{
  "url": "https://moz.com/blog/featured-snippets-drop-to-historic-lows",
  "slug": "featured-snippets-drop-to-historic-lows",
  "title": "Featured Snippets Drop to Historic Lows - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "On February 19, MozCast measured a dramatic drop (40% day-over-day) in SERPs with Featured Snippets. This is the lowest prevalence rate of Featured Snippets in our data set since summer of 2015. What's driving the losses, and who is most affected?",
  "content": "Featured Snippets Drop to Historic Lows Search Engines By: Dr. Peter J. Meyers March 1, 2021 Table of Contents Copied! By: Dr. Peter J. Meyers March 1, 2021 Featured Snippets Drop to Historic Lows Search Engines On February 19, MozCast measured a dramatic drop (40% day-over-day) in SERPs with Featured Snippets, with no immediate signs of recovery. Here's a two-week view (February 10-23): Here's a 60-day view, highlighting this historic low-point in our 10K-keyword data set: I could take the graph back further, but let's cut to the chase — this is the lowest prevalence rate of Featured Snippets in our data set since we started collecting reliable data in the summer of 2015. Are we losing our minds? After the year we've all had, it's always good to check our sanity. In this case, other data sets showed a drop on the same date, but the severity of the drop varied dramatically. So, I checked our STAT data across desktop queries (en-US only) — over two million daily SERPs — and saw the following: STAT recorded an 11% day-over-day drop. Interestingly, there's been a 16% total drop since February 10, if we include a second, smaller drop on February 13. While MozCast is desktop-only, STAT has access to mobile data. Here's the desktop/mobile comparison: While mobile SERPs in STAT showed higher overall prevalence, the pattern was very similar, with a 9% day-over-day-drop on February 19 and a total drop of about 12% since February 10. Note that, while there is considerable overlap, the desktop and mobile data sets may contain different search phrases. While the desktop data set is currently about 2.2M daily SERPs, mobile is closer to 1.7M. Note that the MozCast 10K keywords are skewed (deliberately) toward shorter, more competitive phrases, whereas STAT includes many more \"long-tail\" phrases. This explains the overall higher prevalence in STAT, as longer phrases tend to include questions and other natural-language queries that are more likely to drive Featured Snippets. Why the big difference? What's driving the 40% drop in MozCast and, presumably, more competitive terms? First things first: we've hand-verified a number of these losses, and there is no evidence of measurement error. One helpful aspect of the 10K MozCast keywords is that they're evenly divided across 20 historical Google Ads categories. While some changes impact industry categories similarly, the Featured Snippet loss showed a dramatic range of impact: Competitive healthcare terms lost more than two-thirds of their Featured Snippets. It turns out that many of these terms had other prominent features, such as Medical Knowledge Panels. Here are some high-volume terms that lost Featured Snippets in the Health category: diabeteslupusautismfibromyalgiaacne While Finance had a much lower initial prevalence of Featured Snippets, Finance SERPs also saw massive losses on February 19. Some high-volume examples include: pensionrisk managementmutual fundsroth irainvestment Like the Health category, these terms have a Knowledge Panel in the right-hand column on desktop, with some basic information (primarily from Wikipedia/Wikidata). Again, these are competitive \"head\" terms, where Google was displaying multiple SERP features prior to February 19. Both Health and Finance search phrases align closely with so-called YMYL (Your Money or Your Life) content areas, which, in Google's own words \"... could potentially impact a person’s future happiness, health, financial stability, or safety.\" These are areas where Google is clearly concerned about the quality of the answers they provide. What about passage indexing? Could this be tied to the \"passage indexing\" update that rolled out around February 10? While there's a lot we still don't know about the impact of that update, and while that update impacted rankings and very likely impacted organic snippets of all types, there's no reason to believe that update would impact whether or not a Featured Snippet is displayed for any given query. While the timelines overlap slightly, these events are most likely separate. Is the snippet sky falling? While the 40% drop in Featured Snippets in MozCast appears to be real, the impact was primarily on shorter, more competitive terms and specific industry categories. For those in YMYL categories, it certainly makes sense to evaluate the impact on your rankings and search traffic. Generally speaking, this is a common pattern with SERP features — Google ramps them up over time, then reaches a threshold where quality starts to suffer, and then lowers the volume. As Google becomes more confident in the quality of their Featured Snippet algorithms, they may turn that volume back up. I certainly don't expect Featured Snippets to disappear any time soon, and they're still very prevalent in longer, natural-language queries. Consider, too, that some of these Featured Snippets may just have been redundant. Prior to February 19, someone searching for \"mutual fund\" might have seen this Featured Snippet: Google is assuming a \"What is/are ...?\" question here, but \"mutual fund\" is a highly ambiguous search that could have multiple intents. At the same time, Google was already showing a Knowledge Graph entity in the right-hand column (on desktop), presumably from trusted sources: Why display both, especially if Google has concerns about quality in a category where they're very sensitive to quality issues? At the same time, while it may sting a bit to lose these Featured Snippets, consider whether they were really delivering. While this term may be great for vanity, how often are people at the very beginning of a search journey — who may not even know what a mutual fund is — going to convert into a customer? In many cases, they may be jumping straight to the Knowledge Panel and not even taking the Featured Snippet into account. For Moz Pro customers, remember that you can easily track Featured Snippets from the \"SERP Features\" page (under \"Rankings\" in the left-hand nav) and filter for keywords with Featured Snippets. You'll get a report something like this — look for the scissors icon to see where Featured Snippets are appearing and whether you (blue) or a competitor (red) are capturing them: Whatever the impact, one thing remains true — Google giveth and Google taketh away. Unlike losing a ranking or losing a Featured Snippet to a competitor, there's very little you can do to reverse this kind of sweeping change. For sites in heavily-impacted verticals, we can only monitor the situation and try to assess our new reality. Update: Drop by word-count I realized that we could look at word-count in the STAT data to test the theory that shorter search queries (which are generally both more competitive and more ambiguous) were hit harder by this update. Here's the breakdown of STAT's 2M desktop (en-US) keywords ... There's not much nuance here — 1-word queries were clobbered in this update, 2-word queries dropped substantially higher than the STAT average, and 3+-word queries were hit much less. Why these queries were hit isn't as clear, but the impact on very short queries is clear. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Featured Snippets Drop to Historic Lows"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Featured Snippets Drop to Historic Lows"
    },
    {
      "level": "H2",
      "text": "Are we losing our minds?"
    },
    {
      "level": "H2",
      "text": "Why the big difference?"
    },
    {
      "level": "H2",
      "text": "What about passage indexing?"
    },
    {
      "level": "H2",
      "text": "Is the snippet sky falling?"
    },
    {
      "level": "H2",
      "text": "Update: Drop by word-count"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}