{
  "url": "https://moz.com/blog/featured-snippets-qa-content",
  "slug": "featured-snippets-qa-content",
  "title": "Optimizing Sites for Featured Snippets with Q&A Content [Case Study] - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Learn how to capture featured snippet opportunities (along with increased traffic and conversions) using question-and-answer format content by emulating this case study.",
  "content": "Optimizing Sites for Featured Snippets with Q&A Content [Case Study] Advanced SEO | Conversion Rate Optimization (CRO) By: Nick Van Huis July 24, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Nick Van Huis July 24, 2017 Optimizing Sites for Featured Snippets with Q&A Content [Case Study] Advanced SEO | Conversion Rate Optimization (CRO) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Ranking near the top of the SERPs for short-tail keywords in competitive business verticals can be extremely difficult. Wikipedia, Dictionary.com, and similar sites have the market cornered on ranking at the top of search results. Even if you manage to rank in the first position, there are featured snippets, ads, map packs, and other SERP layouts that are dominating the space as well. Because short-tail keywords have such broad search intents, it's in the search engine’s best interest to try and answer questions directly in SERPs. That is the intent of featured snippets. If a search engine is able to answer a user’s query without them leaving the results page, they believe that delivers the best result. And the proliferation of featured snippets is only beginning. According to Search Engine Land, 19.45% of queries will display rich answers (a form of featured snippets) in Google. A search for “what is orthodontics” in an incognito Google Chrome window displayed the following featured snippet: This search result satisfies at least one large search intent: “What is orthodontics?” I use this as an example because my agency and I had been trying to get a client to rank for this keyword for some time. They were a dental practice with locations across the US that offered both orthodontic and general dental procedures. We had optimized their locations for their orthodontic procedures, but we wanted to get their non-localized service pages to rank as well in order to draw new patients that may be in the beginning stages of looking for a new orthodontist. But without a local qualifier, it was difficult to get the pages to rank for the short-tail searches. After a year and change of writing, optimizing, re-writing, and re-optimizing the content — all while building links — we weren't getting any movement with our organic rankings. It seemed that business websites were not meant to rank for these short-tail keywords. Content creators have long lamented that featured snippets don’t attribute where the content in the SERP comes from, thus leaching traffic away from the site. We believed that rich snippets in SERPs would become more prominent — especially with mobile and voice search on the rise — and that, even without proper attribution, it would benefit our client to appear in these types of search results, especially if we were able to rank in long-tail, question-oriented searches. If we could rank in a featured snippet, where a potential consumer was asking a question about a service that we provide, it would benefit us to answer that question for them. Not only would we achieve the coveted “zero position,” we would position our client as authorities in their vertical, potentially increasing conversions. With this in mind, we began developing the strategy that would ultimately lead us to ranking in featured snippet searches. Q&A contentQuestion and answer content on websites is fairly standard. Many companies will place Frequently Asked Questions (FAQ) content on their sites to help users with any questions they may have instead of answering them directly. Noting the prevalence of featured snippets in SERPs, we used the Q&A format to create new content to find out: a) could we rank for these queries? and b) would it benefit our client to rank in these queries? Research & content creation Using SEMRush, we conducted keyword research to find long-tail keywords with high monthly search volumes. Some of the phrases we decided to create the content around were “how long does it take to put on braces,” “how much does Invisalign cost without insurance,” and other similar queries. We also asked our client’s call team and Livechat correspondents to send us the most-asked questions they receive about orthodontics. The questions that the internal teams provided were primarily about pricing and insurance. This information was vital for our new Q&A content, as it allowed us to create answers we knew our users were looking for. While researching current featured snippets, we gleaned that the content must emphasize the answer, not the answerer. Meaning, the content needed to be straightforward and answer the query without any marketing fluff. We ensured that our headers included the targeted keyword, along with the title tags. Once the content was created, we placed each question in the main navigation bar on the site, with each one leading to a separate landing page. Link building As most SEOs will tell you, backlinks are still a very important ranking factor. It was our belief that building links to our new Q&A content would be essential in ensuring that it ranked well. We built links exclusively via sites like Quora and Reddit, the idea being that these are places where people are already asking questions that we can answer as experts, while linking back to our site. In order to avoid spamming, we limited the number of links that we built per month. ResultsAfter a year of collecting data, we can confidently say that not only were we successful in getting the site to rank for a featured snippet, but traffic to the orthodontics content increased by 46.10%, conversions from the content increased by 235%, and the conversion rate increased by 129.30%. Organic sessions to the orthodontic Q&A content Organic conversions from orthodontic Q&A content Organic conversion rate from orthodontic Q&A content The results were even more striking on mobile, where traffic increased by 91.46%, conversions increased by 322.22%, and conversion rate increased by 120.53%. Mobile organic sessions to the orthodontic Q&A content Mobile organic conversions from orthodontic Q&A content Mobile organic conversion rate from orthodontic Q&A content Measurement methodFor this study we only looked at organic and mobile organic traffic. We also only looked at traffic that landed on our site via the orthodontics content (meaning we only measured users that entered the site via one of the orthodontics pages from an organic source). Attention metrics It should be noted that this implementation was not successful in every facet. One of the most important goals for new content is making sure that users engage with it. And at Rebuild Group, we normally measure content engagement through attention metrics: pages/session, average time on site, bounce rate, etc. Upon collecting the data, we noticed that all attention metrics decreased year over year. Our hypothesis is that because the content is both meant to answer a question and is easily digestible, users were more likely to leave the site after their question was answered. It explains why traffic, conversions, and conversion rate increased so much year over year and attention metrics decreased. RankingsMost important to this experiment, we were able to have our site rank in the first position — or zero position — in search results for the query “how long do you wear invisalign a day,” while also ranking on the first page (though not the first position) for other Q&A orthodontic terms. We started ranking in the first position for this term in mid-January, though we lost the ranking shortly thereafter. We began to consistently rank in the first position in March and are still ranked there as of this writing. Our belief is that by simply answering the question and including the keyword in crawlable parts of the content, we were able to rank in the first position for one of our targeted Q&A phrases, resulting in a featured snippet. ConversionsConversions were measured as the number of contact form submissions sent during sessions where a user entered the site via the orthodontic content. As mentioned above, conversions and conversion rates for all organic and mobile organic traffic increased greatly year over year. However, the effects were not seen until 9 months into the experiment. When the traffic was measured at 90 and 180 days, organic traffic to the new content was steadily increasing overall and via mobile devices, but conversions and conversion rate had not gone up compared to the previous year. It wasn’t until 270 days in, when we first ranked in the featured snippet SERP, that conversions began to increase. Organic traffic to the orthodontic Q&A content Organic conversions from orthodontic Q&A content Once we were consistently ranking in the first position for a featured snippet SERP, while also ranking on the first page of SERPs for other queries, our conversions and conversion rates began to greatly increase. Google Home As stated earlier, voice search is on the rise. Once we were able to rank as a featured snippet in a targeted SERP, we wanted to see if that featured snippet would affect how Google Home provided an answer to the targeted query: *Note: This video was recorded on my phone, so the quality is not the best. You may need to turn up your volume to hear the question and answer. As you can see, Google Home clearly attributes the answer to our client, answers the question, and then sends the user to the Home App, where the answer is again shown: From there they can click through to the site on their mobile device: In the end we drew a strong correlation between the implementation of the Q&A orthodontics content, ranking highly in rich snippet SERPs, and increased conversions and conversion rates. But like all things SEO, there are no definites when implementing this kind of strategy. We implemented content that drove users to a site that offered services they were looking for. Someone searching “how to boil water” is not likely looking to buy new pots and pans. Ultimately, it's important to know what your users are looking for and cater to their searches. Once you're able to answer their questions with simple, to-the-point content, the rest is easy. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Optimizing Sites for Featured Snippets with Q&A Content [Case Study]"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Optimizing Sites for Featured Snippets with Q&A Content [Case Study]"
    },
    {
      "level": "H2",
      "text": "Q&A content"
    },
    {
      "level": "H2",
      "text": "Research & content creation"
    },
    {
      "level": "H2",
      "text": "Link building"
    },
    {
      "level": "H2",
      "text": "Results"
    },
    {
      "level": "H2",
      "text": "Measurement method"
    },
    {
      "level": "H2",
      "text": "Attention metrics"
    },
    {
      "level": "H2",
      "text": "Rankings"
    },
    {
      "level": "H2",
      "text": "Conversions"
    },
    {
      "level": "H2",
      "text": "Google Home"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Nick Van Huis\n          \n            Nick Van Huis\n          \n            Nick Van Huis"
}