{
  "url": "https://moz.com/blog/featured-snippets",
  "slug": "featured-snippets",
  "title": "Featured Snippets: What to Know & How to Target - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Featured snippets are still the best way to take up primo SERP real estate, and they seem to be changing all the time. Today, Britney Muller shares the results of the latest Moz research into featured snippet trends and data, plus some fantastic tips and tricks for winning your own.",
  "content": "Featured Snippets: What to Know & How to Target Keyword Research | Whiteboard Friday | Advanced SEO By: Britney Muller October 11, 2019 Table of Contents Copied! By: Britney Muller October 11, 2019 Featured Snippets: What to Know & How to Target Keyword Research | Whiteboard Friday | Advanced SEO Featured snippets are still the best way to take up primo SERP real estate, and they seem to be changing all the time. Today, Britney Muller shares the results of the latest Moz research into featured snippet trends and data, plus some fantastic tips and tricks for winning your own. (And we just can't resist — if this whets your appetite for all things featured snippet, save your spot in Britney's upcoming webinar with even more exclusive data and takeaways!) Click on the whiteboard image above to open a high resolution version in a new tab! Video Transcription Hey, Moz fans. Welcome to another edition of Whiteboard Friday. Today we're talking about all things featured snippets, so what are they, what sort of research have we discovered about them recently, and what can you take back to the office to target them and effectively basically steal in search results. What is a featured snippet? So to be clear, what is a featured snippet? If you were to do a search for \"are crocs edible,\" you would see a featured snippet like this: Essentially, it's giving you information about your search and citing a website. This isn't to be confused with an answer box, where it's just an answer and there's no citation. If you were to search how many days are in February, Google will probably just tell you 28 and there's no citation. That's an answer box as opposed to a featured snippet. Need-to-know discoveries about featured snippets Now what have we recently discovered about featured snippets? 23% of all search result pages include a featured snippet Well, we know that they're on 23% of all search result pages. That's wild. This is up over 165% since 2016. We know that they're growing. There are 5 general types of featured snippets We know that Google continues to provide more and more in different spaces, and we also know that there are five general types of featured snippets: ParagraphListTableVideoAccordion The most common that we see are the paragraph and the list. The list can come in numerical format or bullets. But we also see tables and then video. The video is interesting because it will just show a specific section of a video that it thinks you need to consume in order to get your answer, which is always interesting. Lately, we have started noticing accordions, and we're not sure if they're testing this or if it might be rolled out. But they're a lot like People Also Ask boxes in that they expand and almost show you additional featured snippets, which is fascinating. Paragraphs (50%) and lists (37%) are the most common types of featured snippets Another important thing to take away is that we know paragraphs and lists are the most common, and we can see that here. Fifty percent of all featured snippet results are paragraphs. Thirty-seven percent are lists. It's a ton. Then it kind of whittles down from there. Nine percent are tables, and then just under two percent are video and under two percent are accordion. Kind of good to know. Half of all featured snippets are part of a carousel Interestingly, half of all featured snippets are part of a carousel. What we mean by a carousel is when you see these sort of circular options within a featured snippet at the bottom. So if you were to search for I think this was comfortable shoes, you have options for women is a circular carousel button, for work, and stylish. What happens when you click these is it recalibrates that featured snippet and changes it into what you clicked. So it starts to get very, very niche. You might have started with this very general search, and Google is basically begging you to refine what it is that you're looking for. It's very, very interesting and something to keep in mind. People Also Ask boxes are on 93.8% of featured snippet SERPs We also know that people also ask boxes are on 93.8% of featured snippet SERPs, meaning they're almost always present when there's a featured snippet, which is fascinating. I think there's a lot of good data we can get from these People Also Ask questions to kind of seed your keyword research and better understand what it is people are looking for. \"Are Crocs supposed to be worn with socks?\" It's a very important question. You have to understand this stuff. Informational sites are winning We see that the sites that are providing finance information and educational information are doing extremely well in the featured snippet space. So again, something to keep in mind. Be a detective and test! You should always be exploring the snippets that you might want to rank for. Where is it grabbing from the page?What sort of markup is it? Start being a detective and looking at all those things. So now to kind of the good stuff. How to win featured snippets What is it that you can specifically do to potentially win a featured snippet? These are sort of the four boiled down steps I've come up with to help you with that. 1. Know which featured snippet keywords you rank on page one for So number one is to know which featured snippet keywords your site already ranks for. It's really easy to do in Keyword Explorer at Moz. So if you search by root domain and you just put in your website into Moz Keyword Explorer, it will show you all of the ranking keywords for that specific domain. From there, you can filter by ranking or by range, from 1 to 10: What are those keywords that you currently rank 1 to 10 on? Then you add those keywords to a list. Once they populate in your list, you can filter by a featured snippet. This is sort of the good stuff. This is your playground. This is where your opportunities are. It gets really fun from here. 2. Know your searchers' intent Number two is to know your searchers' intent. If one of your keywords was \"Halloween costume DIY\" and the search result page was all video and images and content that was very visual, you have to provide visual content to compete with an intent like that. There's obviously an intent behind the search where people want to see what it is and help in that process. It's a big part of crafting content to rank in search results but also featured snippets. Know the intent. 3. Provide succinct answers and content Number three, provide succinct answers and content. Omit needless words. We see Google providing short, concise information, especially for voice results. We know that's the way to go, so I highly suggest doing that. 4. Monitor featured snippet targets Number four, monitor those featured snippet targets, whether you're actively trying to target them or you currently have them. STAT provides really, really great alerts. You can actually get an email notification if you lose or win a featured snippet. It's one of the easiest ways I've discovered to keep track of all of these things. Pro tip: Add a tl;dr summary A pro tip is to add a \"too long, didn't read\" summary to your most popular pages. You already know the content that most people come to your site for or maybe the content that does the best in your conversions, whatever that might be. If you can provide summarized content about that page, just key takeaways or whatever that might be at the top or at the bottom, you could potentially rank for all sorts of featured snippets. So really, really cool, easy stuff to kind of play around with and test. Want more tips and tricks? We've got a webinar for that! Lastly, for more tips and tricks, you should totally sign up for the featured snippet webinar that we're doing. I'm hosting it in a couple weeks. Save my spot! I know spots are limited, but we'll be sharing all of the research that we've discovered and even more takeaways and tricks. So hopefully you enjoyed that, and I appreciate you watching this Whiteboard Friday. Keep me posted on any of your featured snippet battles or what you're trying to get or any struggles down below in the comments. I look forward to seeing you all again soon. Thank you so much for joining me. I'll see you next time. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Featured Snippets: What to Know & How to Target"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Featured Snippets: What to Know & How to Target"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "What is a featured snippet?"
    },
    {
      "level": "H2",
      "text": "Need-to-know discoveries about featured snippets"
    },
    {
      "level": "H3",
      "text": "23% of all search result pages include a featured snippet"
    },
    {
      "level": "H3",
      "text": "There are 5 general types of featured snippets"
    },
    {
      "level": "H3",
      "text": "Paragraphs (50%) and lists (37%) are the most common types of featured snippets"
    },
    {
      "level": "H3",
      "text": "Half of all featured snippets are part of a carousel"
    },
    {
      "level": "H3",
      "text": "People Also Ask boxes are on 93.8% of featured snippet SERPs"
    },
    {
      "level": "H3",
      "text": "Informational sites are winning"
    },
    {
      "level": "H3",
      "text": "Be a detective and test!"
    },
    {
      "level": "H2",
      "text": "How to win featured snippets"
    },
    {
      "level": "H3",
      "text": "1. Know which featured snippet keywords you rank on page one for"
    },
    {
      "level": "H3",
      "text": "2. Know your searchers' intent"
    },
    {
      "level": "H3",
      "text": "3. Provide succinct answers and content"
    },
    {
      "level": "H3",
      "text": "4. Monitor featured snippet targets"
    },
    {
      "level": "H3",
      "text": "Pro tip: Add a tl;dr summary"
    },
    {
      "level": "H2",
      "text": "Want more tips and tricks? We've got a webinar for that!"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Britney Muller\n          \n            Britney Muller"
}