{
  "url": "https://moz.com/blog/featured-snippets-a-deadsimple-tactic-for-making-them-stick",
  "slug": "featured-snippets-a-deadsimple-tactic-for-making-them-stick",
  "title": "Featured Snippets: A Dead-Simple Tactic for Making Them Stick - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If your brand is hoping to earn a featured snippet, develop a strategic mindset, one that focuses as much on keeping the snippet as it does on acquiring it.",
  "content": "Featured Snippets: A Dead-Simple Tactic for Making Them Stick Advanced SEO By: Ronell Smith November 23, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Ronell Smith November 23, 2016 Featured Snippets: A Dead-Simple Tactic for Making Them Stick Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Dr. Pete throwing down at MozCon 2015, flexin' in his retro Flash t-shirt At MozCon 2015, Dr. Pete delivered a gem that perked up my ears when he discussed Google's featured snippets during his talk, \"Surviving Google: SEO in 2020\": \"Let's say you're No. 5 in a competitive query, and you're trying to get from No. 5 to No.1. That is incredibly difficult; that takes a lot of money, a lot of links, a lot of authority. You might be able to jump past No. 1 to No. 0 with this just by matching the question better. So it may actually be easier to get from No. 5 to No. 0 than it is to get from No. 5 to No. 1 ... Be a better match. Be a better answer to the question. It's good for users.\" Something about those 98 words perked my ears up, especially the last two sentences. \"Be a better answer to the question. It's good for users.\"Those words rolled around in my head for months, though their impact wouldn't be felt until even later, when I began to see how prevalent featured snippets had become. More than a year later, I'm now more convinced than ever that most brands should be making the attainment of featured snippets a priority. Why? Try as they might, most sites don't stand a chance of making it to the No.1 position in the SERPs. And today, with so much priority given to ads at the top of the page, above the organic results — not to mention the fact that most people don't recognize ads from organic results — even those who do reach the coveted position have to feel as though they've secured a pyrrhic victory. In the year-plus since the presentation, rich answers have grown significantly, as depicted by the graph below from Stone Temple Consulting: And in the span, a number of teams and individuals have made it their charge to better decipher featured snippets, specifically regarding what seems to influence their presence for certain queries, what types of snippets there are, how to optimize your content to make it more likely that you receive one, and what Google is likely looking for when a snippet is ultimately featured. (For in-depth background information on featured snippets, see the Related Content section at the bottom of the post.) But not a whole lot has been written on how to keep featured snippets once your brand has one. This fact hit me like a ton of bricks during MozCon 2016, when I listened to Rob Bucci of GetStat during his presentation Taking the Top Spot: How to Earn More Featured Snippets. This post, which is a wellspring of some comments Bucci shared near the end of his presentation, will be focused very narrowly on how to keep a Featured Snippet once your brand has been fortunate enough to receive one. The fast five 5 Ws of featured snippetsBefore we dive into that aspect, let's briefly go over a few specifics, surrounding the nuts and bolts of featured snippets. What are they and where do they come from? A featured snippet is the summation of an answer for a web searcher's query, typically taken from a website and includes a link to the site, the page title and the URL, according to GetStat. Why should you care? You shouldn't, unless you care about being the top result on the page (snark for the win). Also, since the result can come from any brand on the first page, you have the potential to occupy two positions on page 1. Who needs them? Any brand that desires organic reach, visibility, traffic and, yeah, uhm, conversions. When do they show up? Any time a query is best answered in list, table, or graph form. For your brand or any other, however, (a) featured snippets provide you with an easy opportunity to better compete against the competition, (b) can amount to a low-investment/high-reward opportunity, and (c) can give you a leg up on the competition. Keeping your hard-earned featured snippetOne of the main reasons to attend conferences such as MozCon in person is the potential to hear a nugget of wisdom that would be missed in a recap blog, not properly conveyed in a tweet by an attendee, or glossed over when listening to the video after the event. For example, Dr. Pete's quote from MozCon 2015 rang clear as a bell when I heard it while sitting in the audience, but I'm not sure I would have noticed it so readily had I simply watched the videos. During the Q&A that followed Bucci's talk, he was asked about the real value of investing in featured snippets, a particular concern given that, in most cases, Google is serving up the content with very little benefit to the brand that houses it. (Unless the user clicks on the URL at the bottom of the content and visits the website.) Bucci did far more than answer the question before him, however. \"Let's say I was [trying to teach someone] how to make toast. The snippet is, like, step 1 put the bread in the toaster; step 2, toast the bread; step 3, eat it, right? If I added a fourth or fifth step so that it was truncated in the snippet, i.e., they didn't get the full steps to make toast, people would be more likely to click on it to get the full results. Think about how you can optimize your snippets by making it so that you don't give away the entire farm in your snippet. They have to go through your website to get the information.\" This tidbit got my attention for two reasons: One of the biggest concerns brands have with regard to investing resources in trying to get a featured snippet is it does very little for the brand if the web searcher does not click on the URL and visit the site. Otherwise, the only entity that benefits to a significant degree is Google. Churn, whereby brands earn and then lose a snippet, is a very real concern, too. Research by Stone Temple Consulting found that more than 55% of the queries that showed featured snippets in January 2016 \"either didn’t show a featured snippet in July 2015, OR shows a different URL for the featured snippet than it did in July 2015.\" Image courtesy of Stone Temple Consulting, Google’s Featured Snippets: Automated Continuous Improvement How to smartly invest in featured snippetsBy applying the logic in Bucci's quote, your brand can employ what I call next-level thinking. Instead of simply thinking \"How do I get a featured snippet?\", think \"How do I keep a featured snippet?\" This is especially important since, as has been reported by STC, Bucci, and others, Google is likely using engagement metrics (e.g., clicks on the URL) as a factor in determining churn. \"By crafting your snippet content in a way that encourages people to click through to your site for the full detail, you can raise your CTR on that SERP,\" says Bucci. \"That's the key thing.\" As you can see from the result below, this result, drawn from the No.1 result on the page, is unlikely to warrant a click since all the needed information is right there for the taking. However, in the result below, the web searcher will have to click the URL and visit the owner of the content's website to see the full list. The important point to delivering a result that's churn-resistant, says Bucci, is to think strategically. \"The biggest recommendation I made that I think people are only now starting to pay attention to how to strategically use formatting to A) win snippets and B) create great user experiences on the SERP. People were just focused on getting any old snippet, but my advice was that they should look at the query space and measure the most common snippet formats. From there, they should optimize their snippets to match those formats, because Google is clearly indicating that they want to use those formats within the give.\" Bucci made a great point, highlighting how we should pay attention to the formatting and content types — not simply the queries — that consistently show up as featured snippets. This, he says, amounts to Google telling us what they're looking to reward. Don't overthink it. Dive in.It's exciting to see brands jump into the fray, beginning to think seriously about featured snippets and how the organic elements can impact their brands. Dr. Pete, who has remained a passionate advocate for brands taking a serious look at how to get and keep featured snippets, says it's essential that brands build their attainment into their overall process, not use it as a one-off tactic. \"I think the first step is to think in terms of questions, and build part of your keyword research around that. In natural language search, questions are increasingly common. Which questions are part of your conversion path? Don't discount them just because they're early in the funnel or part of the research phase. Find out if those questions are showing snippets and then think about ways to use those snippets as a teaser to draw people into your content and, hopefully, your funnel. Once you're ranking on page 1, it's about shaping your content to better answer the question. I think it helps to take an 'inverted pyramid' approach — lead with your most compelling question and a summary of your content, and then dive into the details. This makes for better snippets and grabs short attention spans.\" One of the best ways to get started with featured snippets is by taking a step-by-step approach so that everyone on the team knows what you're going after, why, and its likely impact to the brand. The graphic below is as specific and as detailed as you need to be to get started. Image source: Stone Temple Consulting Remember, though, like all aspects of online marketing, the endeavor will be iterative. What you gain, you might lose. But the process is invaluable. You've still created something worthwhileHopefully, I've shared at least one small tidbit of information that has you excited about adding the attainment of featured snippets to your content marketing strategy. For those of you who might be on the fence, wondering if the potential reward warrants the expense, Dr. Pete's words should nudge you in the right direction. \"I think content that answers questions is naturally compelling, which is what I like about optimizing for featured snippets ... Content that answers questions succinctly provides real value and builds a base of value for your visitors, regardless of where they arrive from. Even if you lose the featured snippet, you've built something useful.\" It bears repeating: \"Even if you lose the featured snippet, you've built something useful.\"Dr. Pete continued: \"Think of featured snippets as much like organic ranking — they aren't something Google awards you and then lets you keep until a new winner comes along. Featured snippets are generated by the algorithm in real time, just like organic rankings. You have to keep competing for them.\" Related reading: Ranking #0: SEO for Answers and How to Rank on Google Home, by Dr. Pete The Definitive Guide to Google’s Rich Answers (part of a three-post series), by Stone Temple Consulting How to Appear in Google's Answer Boxes, by Rand Fishkin How To Get More Featured Snippets, by GetStat Has your brand experimented with featured snippets? If so, what's been the result? Remember, Moz Pro will help you find and track featured snippets, as well as identify opportunities for acquiring them! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Featured Snippets: A Dead-Simple Tactic for Making Them Stick"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Featured Snippets: A Dead-Simple Tactic for Making Them Stick"
    },
    {
      "level": "H2",
      "text": "\"Be a better answer to the question. It's good for users.\""
    },
    {
      "level": "H2",
      "text": "The fast five 5 Ws of featured snippets"
    },
    {
      "level": "H2",
      "text": "Keeping your hard-earned featured snippet"
    },
    {
      "level": "H2",
      "text": "How to smartly invest in featured snippets"
    },
    {
      "level": "H2",
      "text": "Don't overthink it. Dive in."
    },
    {
      "level": "H2",
      "text": "You've still created something worthwhile"
    },
    {
      "level": "H3",
      "text": "\"Even if you lose the featured snippet, you've built something useful.\""
    },
    {
      "level": "H4",
      "text": "Related reading:"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ronell Smith\n          \n            Ronell Smith\n          \n            Ronell Smith"
}