{
  "url": "https://moz.com/blog/february-linkscape-update-66-billion-urls",
  "slug": "february-linkscape-update-66-billion-urls",
  "title": "February Linkscape Update: 66 Billion URLs - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "After some wrestling with Amazon's EC2 and the tragic loss of many hard disks therein, we've finally finished processing and have released the latest Linkscape update (previously scheduled for Feb. 14). This new index is, once again, quite large in comparison to our prior indices, and contains a…",
  "content": "February Linkscape Update: 66 Billion URLs Moz Tools By: Rand Fishkin February 28, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 28, 2012 February Linkscape Update: 66 Billion URLs Moz Tools The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. After some wrestling with Amazon's EC2 and the tragic loss of many hard disks therein, we've finally finished processing and have released the latest Linkscape update (previously scheduled for Feb. 14). This new index is, once again, quite large in comparison to our prior indices, and contains a mix of crawl data going back to the end of last year. In fact, this is technically our largest index ever! Here are the latest stats: 65,997,728,692 (66 billion) URLs 601,062,802 (601 million) Subdomains 140,281,592 (140 million) Root Domains 739,867,470,316 (740 billion) Links Followed vs. Nofollowed 2.21% of all links found were nofollowed 57.91% of nofollowed links are internal 42.09% are external Rel Canonical - 11.11% of all pages now employ a rel=canonical tag The average page in this index has 71.88 links on it 60.98 internal links on average 10.90 external links on average We also ran our correlation metrics against a large set of Google search results and saw very similar data to last round. Here are the latest numbers using mean Spearman correlation coefficients (on a scale of 0 to 1, higher is better): Domain Authority: 0.26 Page Authority: 0.37 MozRank of a URL: 0.19 # of Linking Root Domains to a URL: 0.26 Our evaluation process also check the comprehensiveness of our crawl data against a large set of Google results, and in this index, we've got link data on 82.09% of SERPs. This is slightly down from last month's 82.37%, which we suspect is a result of the late release. Crawl data ages with the web, and new URLs make their way into the SERPs, too. To help visualize our crawl, here's a histogram of when the URLs in this index were seen by Linkscape: We always \"replace\" any older URLs with newer content if we recrawl or see new links to a page, so while there may be some \"old, crusty\" stuff from December, the vast majority of this index was crawled in mid-to-late January. In the next few weeks, we're working on a new, experimental index that may be massively larger (2-3X) this one, and closer to what's in Google's main index at scale. This is very exciting for us and we hope, for all of you who use Open Site Explorer, the Mozbar, the Linkscape API and tools from our partners like Hubspot, Conductor, Brightedge and our newest API partner, Ginza Metrics (check out some cool stuff they're doing with Moz data here and in the screenshot below). Ginza Metrics' New Backlink Analysis Tool If you're interested in chatting about using Moz data in products, drop Andrew Dumont a line and he'll be happy to help. And, as always, feedback on this latest index, our tools or metrics are greatly appreciated. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "February Linkscape Update: 66 Billion URLs"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "February Linkscape Update: 66 Billion URLs"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "Moz AI: Introducing Augmented Intelligence"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}