{
  "url": "https://moz.com/blog/final-post-as-ceo-sarah-bird-has-the-conn",
  "slug": "final-post-as-ceo-sarah-bird-has-the-conn",
  "title": "My Final Post as CEO: Sarah Bird Has the Conn - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If you haven't already heard, we have some big news to share: I'm officially handing over the reins as CEO, and am thrilled to welcome our President and COO Sarah Bird into the role. I sat down with Sarah for a conversation about our memories from working together these past seven years and our…",
  "content": "My Final Post as CEO: Sarah Bird Has the Conn Moz News By: Rand Fishkin January 15, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 15, 2014 My Final Post as CEO: Sarah Bird Has the Conn Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In case you missed the post on my blog last month, we have some big news to share: I'm officially handing over the reins as CEO, and am thrilled to welcome our President and COO Sarah Bird into the role. I sat down with Sarah for a conversation about our memories from working together these past seven years and our plans for the future at Moz. Video Transcription Rand: Howdy, Moz fans. I'm Rand Fishkin, the CEO her at Moz, and I'm joined by my longtime partner in the business, Sarah Bird, who has been our Chief Operations Officer up until today, and in fact I'm going to be handing off my CEO role to Sarah. Sarah: Wait, what's happening? Rand: You don't remember this? Sarah: No. Rand: I sent a memo. Sarah: Yeah. Rand: And as part of that we wanted to discuss a little bit about why the CEO transition is happening, the new role that I'll be taking, how things might change, and what will stay the same under Sarah's tenure. I hope you enjoy it. Gosh, I think we first met at Kim's house. Right? Sarah: Kim's house. Rand: Or at her apartment. Sarah: Mm-hmm. Rand: Was that 2002, '03? Sarah: I was thinking about this. It was probably three. It was probably the beginning of her second year. Rand: And you were in law school. Sarah: We were in law school together, and our friend Kim is a natural connector. She never forgets a face. She is the kindest person on the planet. She makes great food, and she was throwing one of her epic parties of bringing great people together. Rand: She became a lawyer. Sarah: She became a lawyer. Rand: And then she left the law, and now she's a chef. Sarah: Now she's a chef doing what she loves. Rand: Yeah. There were probably seven or eight people at that dinner. My memory is, the first time you met me you called BS on me and thought I was full of it. Sarah: Yeah. Rand: And I really liked you. Sarah: Yeah. It's funny, because I thought that you were naive because you believed something you read on the Internet. And I was, like, \"Oh, dear.\" Rand: To be fair, the Internet is full of junk, right? Sarah: Yeah. But I wasn't sure you knew that at the time. \"No, I read this story about a guy who doesn't have to eat. I read it on the Internet.\" And I was, like, \"No, people have to eat.\" Just because it's on the Internet doesn't mean it's true. So I was lecturing you about the Internet. Rand: I remember Geraldine, my wife, was there. Sarah: Yeah. Although you were not married yet. You were dating. Rand: No. We had just started dating maybe a couple of years before. Sarah: And she and I really bonded, because we had both read this both that we read way too early in our young lives. We read them when we were ten. It was a Judy Bloom book. Right? Rand: Oh God. I remember those. Sarah: I was like, \"Oh my God. I was scarred by that book as a child.\" I was scarred too. Rand: Well, they have you read it really early. Then fast forward probably, what, four or five years later. It's 2000 . . . Sarah: 2007. Rand: . . .'07, and you had been working in a . . . Sarah: A law firm. Rand: Like a family practice kind of thing? Sarah: General practice. Rand: General practice. Sarah: The bread and butter of a lot of general practice is family law, so I did a lot of family law. But I did a lot of other things too. Rand: Yeah. And then my memory is that you just sort of emailed me randomly, because we had been hanging out as friends for years, and said, \"Hey, I'm thinking about making a change.\" Sarah: My memory is we had already had a schedule. We were all scheduled to go out to dinner, you, me and Geraldine anyway. Rand: Okay. Sarah And I had just given my notice. Rand: Oh. Sarah: That's my memory of it. I remember telling you guys at dinner, like, \"Okay, I did it. I made the decision. I don't know what I'm going to do next.\" Rand: Hmm. Did I talk you into it then? Sarah: That's my memory. It was that you said, \"Well, you know I have this round of funding. You should totally come and help out.\" Rand: Oh, yeah. This is the same time that Michelle Goldberg and Ignition Partners were putting their first million dollars into Moz. Sarah: And you were talking to me. It was like, \"Are these good deal terms or what?\" Rand: Oh, yeah. Sarah: While I was still at the practice. Rand: That's right. Sarah: Right. Rand: Thanks for not charging me. Sarah: Yeah. You're welcome. And your mom, actually, Gillian was a great supporter, very kind. So she interviewed me and was like, \"Yeah, you should come onboard.\" Which is crazy. Rand: And I remember that we had like an early board meeting. I think one of our first official board meetings. Sarah: In January. Rand: You came to it, and that was January '08, which you attended sort in like . . . Sarah: General counsel. Rand: . . . yeah, a counsel role. After the meeting, I remember you thought Michelle from Ignition didn't like you at all. Sarah: At all. Rand: And Michelle talked to me and was like, \"Sarah Bird is incredible. We should think about promoting her. Maybe we should give her a different role at the company, upgrade her responsibilities.\" Sarah: Yeah, which is hilarious, because I thought she was the Ice Queen. I was like, \"I'm going to kill her with kindness over time. I'm going to be so nice to her she'll come around.\" And she did. Rand: She liked you though. Sarah: She did. Rand: She loves us both. Sarah: Yeah. We're great friends. Rand: How long was it before we made you COO? Sarah: That was June. So about six months. Rand: Oh, my gosh. Sarah: Well, I was one of the oldest people in the company, and I came to the board meetings with a binder that had color coded tabs, and so clearly I was like the most qualified to be in operations. I'm saying that because I think an important part of the story, for entrepreneurs listening, is that it's not necessarily the best idea to make hiring an attorney like your number eight person. I was number the number eight person, and it didn't make a lot of sense. But I think that both you and I didn't know a lot about the startup and the life cycle and how to make software, right? We were starting out. We were really naive. We knew we liked each other. We knew there was mutual respect on intellect. So between intellect and wanting to do something great and similar values, we were kind of like, \"Oh yeah, we should totally work together.\" Rand: I think one of the best parts that I've always found in our relationship, and I know we've had months and years where things were tough between us, right? Sarah: Tough. Yeah, you wanted to fire me, and I wanted to quit at one point. It's true. Rand: I'm so sorry. Sarah: No, it's true. Both sides, right? But that's part of the journey that's been so great. Rand: I'm really glad you stuck it out. Sarah: I'm glad you stuck it out with me, right? I mean, here we are. It's crazy. Rand: I never wanted to fire you. I just wanted to change how we interacted. I wanted to agree more. Sarah: Yeah. Rand: Sometimes we disagree really passionately, and I think it's always pushed me, I think, eventually to get better, to get smarter, and to refine the data behind my decisions and advance the breadth of what I'm considering in any kind of decision making format. So I really appreciate that. Sarah: We got through the hard parts, right? Challenged each other. The xciting to me is that . . . Rand: It's pretty hard right now too. Sarah: See, I think it's harder for you than it is for me right now, right? Rand: Yeah, that's fair. Sarah: Right. I think that going through that challenging period together in the business, where we both had to grow so much and learn so much and make really hard decisions for people we care about, I think we got to the other side of that, which builds a lot of trust. I don't know about you, but I think no matter how much I'm disagreeing with Rand right now and I would go a totally different way, I never doubt your intent. I trust you so completely. I know you're doing your best. You're thinking the best you can about a long-term problem and wanting to act in accordance with your integrity. So it's great that we have a relationship where you take all of that other stuff off the table. There's no room for suspicion or doubt. Rand: Yeah. As I've been talking to entrepreneurs about this journey and about stepping down from the CEO role, one of the messages that I consistently hear from a lot of folks is, \"I don't have someone like Sarah in my life, in my professional life.\" That's something that I just strongly recommend. I think this process is so hard to go through alone, and if you don't have that partnership, it makes it harder and harder. Sarah: Yeah. Then, for me, I wasn't someone who came in at Moz like, \"Okay, well I'm going to start as general counsel, and then someday I'm going to be the CEO of that place.\" You don't start that way. Rand: That's so true. Sarah: It wouldn't have occurred to me. \"Someday I'm going to be . . . that's my game plan. I'm going to start climbing that ladder.\" So the fact that we have this partnership and that we've been working so closely over time has been great, because at different times in the business I think you and I both served different roles of the leadership, what the company needs at that moment, and that trust has grown over time. Now it's the same thing. It is just shifting, right? Rand: I see that time and time again. There's an inverse correlation between desire for power and influence and ability to effectively hold power and influence. Sarah: Yeah. Totally. Rand: It seems like the people who are reluctantly accepting of the fact that, \"I guess I am good at this, and I think I can take these things on,\" are far better than, \"I want to control everything.\" Sarah: Yeah. That's so true. It's also one thing that I struggle with in this transition. A lot of people ask, \"Oh, how are you feeling? How are you doing? Are you nervous? Are you scared?\" I'm actually not scared, and I'm not even anxious. I am uncomfortable with formal titles and formal perceptions of power. It's just something that has never been valuable to me. There's a lot of weird like cultural mythologies and baggage around CEOs and leadership. So it's been interesting for me to be, \"Okay, now I'm the CEO of a tech company, $30 million tech company.\" That's awesome. I'm so happy about that. In the day-to-day, I don't think twice about it. I don't have any anxiety. But in sort of the bigger picture I'm like, \"Wow, how did I become the boss man?\" You know? Rand: You're still not the boss man. Sarah: Yeah, it's true. So something for me in terms of talking about the transition and even sort of my desire to celebrate it, how I talk about it with my family, I feel a little bit of awkwardness just around like, \"Yeah, I'm the boss now.\" It's weird, right? Rand: I know exactly how you feel. There's this like . . . I don't know what it is. Something after work tomorrow, like a little celebration . . . Sarah: Yeah, a little celebration. Rand: . . . that you guys are doing for the tenure that I've had as CEO here, and that's very kind and flattering, but I also felt incredibly uncomfortable. Sarah: of course. Rand: I almost sent the email that was like, \"Please don't do this. I don't feel like I deserve it.\" Sarah: Yeah, I know. Rand: It's a tough thing to accept. Sarah: It's weird. Rand: I think we're on the same page. Sarah: Yeah, we're similar in that way. We're kind of hippies at heart in some weird social justice way. Right? Rand: That is true. Sarah: What you said earlier too about how lucky we are to have this partnership and how unique it is, I do think it's because a lot of entrepreneurs, when they get to that hard point, those crisis points that we've gotten to at various times in the relationship, they give up then because I think they have less at stake, where you and I had such a friendship ahead of time that we had a lot of motivation around it to say, \"You know what? I'm going to go back to the table. I'm going to listen.\" Or, \"Actually, I can compromise on this one.\" I think that having that extra value around you and I needing to be together for the long term . . . Rand: The sum cost of friendship. Sarah: Right. The sum cost. This is someone that it's more than a business relationship, even a very important business relationship that forces you to go back to the table and work through whatever issue you're having, that then creates this very resilient partnership we have now. Right? Rand: Yeah. I totally agree with that. Sarah: It's special. Rand: What I think is insane about that is that, the flip side, what you hear all the time from folks in the business and entrepreneurial community is, \"Be very careful about working with your friends and your family and those kinds of things.\" Sarah: Right. Rand: But we've seen the good and the bad sides of that. Sarah: Yeah. I wouldn't recommend it. I'm not off telling my friends like, \"Find your best friend and start a business with them.\" I'm not recommending it. Rand: I'm really glad it worked. Sarah: Yeah. Things are going to be different. I don't think that they will be drastically different. I think that if there was something really wrong with the company, you, the board would have said, \"We need a big change. We need a very different person to come in.\" You'd bring in an outside person who is going to drive a lot of change. Things are not going badly, and you and I have been great partners together in so much. I think you and I both said we agree 90% of the time, and the 10% of the time we disagree, it's usually, thank God, about something that one or the other of us is kind of like, \"I don't have a lot passion about that. So here's my opinion, but go for it.\" The amount of times where we disagree, it's something where we're both, like, \"I am like an eight or a nine on this. I'm really, really uncomfortable.\" I can count them on like one hand in the last many years, right? Rand: They have been few and far between. Sarah: Few and far between. Rand: And I think that we've done a good job one compromising on them. Also, one of my favorite things about our interactions is that we don't keep score. Sarah: No. Well, we both have really bad memories. Rand: Wait, what? Sarah: That's great, because we can't keep score. We can't keep score because we can't remember who said what. Rand: Yeah. Sarah: It's great. Rand: That is a good combination. One of the things that I hope, as we make this CEO change, is that you can apply some of the strengths that you've got, particularly around process and organizational scale, people development, that are things where I've sort of been very hands off and almost just let them coast a little bit. You can tighten those up and make them a part of our company and culture as we go forward. But I don't know how much of that is going to be felt externally. Sarah: Yeah. I agree. Rand: My hope is that what happens is as you tightens those things, it simply feels very fluid, like, \"Gosh, Moz is producing better and better quality software and content and things that help marketers at a more and more rapid pace, and I feel like I can rely on them more and more. But I don't necessarily feel this massive change.\" Sarah: They're not going to wake up next week and have it be like, \"Whoa, what happened to Moz?\" Rand: Yeah, exactly. Sarah: What I hope will happen is that Moz will get a little bit better every week, both internally, with how efficient we are and how in line we are with our TAGFEE values, but also the value we're delivering to the customer. So it won't be a moment of like, \"Whoa, Moz changed.\" But maybe nine months from now customers will be like, \"You know, Moz has been putting out a lot of really good stuff lately.\" That's what I would like to see happen. Rand: Yeah, agreed. So my new role is I feel like a little less defined than yours, but in some ways I'm excited about that. Things that I know that I'm going to keep doing, I'm obviously going to keep working on a lot of evangelism and marketing stuff, so continuing to blog, hopefully even more frequently than I had been last year, continuing to speak at a lot of conferences and events, obviously doing a lot of video, Whiteboard Friday, all that kind of stuff. But then I also have this new product architect role where I'm going to be working on particularly the research tools, so Open Site Explorer and Fresh Web Explorer, keyword difficulty, the Moz bar a little bit with the big data team around some of our new initiatives there. I'm excited about that. I mean those are areas where I have historically contributed, but as CEO I didn't get to really focus on them. They're almost like ancillary portions of my job that just happen to overlap, and we thought for a long time, \"Well, we should have product managers take those over.\" So I'm kind of excited about getting to do those things. I have to write a book this year. Sarah: Yeah. Rand: That's on my list. My title is going to be Individual Contributor or Wizard of Moz externally, but nothing formal. Who am I reporting to? Sarah: You're reporting to me. Rand: I'm reporting to you, okay. Sarah: We will have conversations about expectations for sure. Rand: I hope to not need improvement really as often as I have the last five years. That's my goal performance wise. Sarah: Yeah, definitely. I'm excited for you to be able to be free on some of the things that are your real superpowers. You have an incredible gift of understanding. Rand: Growing a beard. Sarah: Growing a beard, which I will never compete on. Rand: Yes. Sarah: I think you have an incredible gift to grasp complex projects and complex algorithms and organizational dynamics that has made you a really effective marketer and leader. It's going to be great for you to take that knowledge and focus on communicating it and creating content around it more consistently than you have been able to as CEO. Rand: Yeah. Sarah: I think it's going to drive a lot of value for the community and really play on your superpowers. Rand: Yeah. I'm really excited to offload some things. I mean, I love our executive team, but I don't think that I've done a very good job having them report to me and being a coach and mentor for those folks. I was talking to someone over coffee today about the role that I play. This person was very surprised. He said to me, \"Gosh, I feel like I know you pretty well, and I'm surprised to hear that you don't think of yourself as a good coach and mentor for the team.\" What I told him was, \"I think I'm really good at communicating externally.\" The way that I coach and communicate is through the blog, through social media sharing (note, some advice from Rand on Social Media for CEOs), through video. I'm not great at sitting down one on one and being like, \"Well, Sarah, I need you to work on these things. I think this is where you can improve your career growth.\" I can't even remember a time when we've done a one on one like that. Sarah: It's not our thing. Rand: Well, it's not my thing. I'm hoping that you're going to do a great job, that you can sit down with people like Anthony and Annette and Adam. Is everybody named A? Sarah: That was the case, but then we have M, JB and Glenn now. Rand: Oh yeah. Right. Sarah: So it was like the triple As. Rand: Matt Brown. Right, so that you can help upgrade all of those folks. Sarah: Yeah. One of the things I'm really passionate about, that I think is a little bit different than what you brought to the org is having some more clarity around when decisions get made, who makes those decisions, accountability for them, real team building within each different governing body within the organization, and making sure we're all independent enough to move quickly, but also operating in alignment, I think, is very critical. I think you're totally right. You've done a great job of leading, about marketing and TAGFEE externally and internally. I'd like to see you continue to do that and actually bring some of your marketing knowledge back into Moz. A really interesting exercise for you, if every presentation you gave externally, you gave that same presentation internally as a lunch and learn. Rand: Hmm. Sarah: Would that raise the whole level of awareness about marketing and what marketers are thinking about the team. Rand: Yeah. That's an interesting idea. Sarah: We have a lot of one on ones to go. Different planning. Rand: That sounds good. And in terms of the obligations and roles that you'll be taking on as CEO . . . Sarah: Yeah. You've got to set the vision for the company. You've got to hold the team accountable. You're ultimately responsible for execution and for really driving the vision, obviously with the board. We've got a wonderful board of great, supportive people. A lot of stakeholders there, but it is the CEO's vision to communicate that, to drive it home, drive it to consensus, and then get the team on line to execute on it. Rand: Sarah, what do you think is going to be the toughest part? What do you think is going to be the hardest part of being CEO? Sarah: Gosh, actually I'm not sure yet. I'm in an unusual position, because this is a company I know so well, and I have worked so closely with you for so long that a lot of the role is already very familiar to me. So my challenges, I think, are actually going to be much more about just my own perception and making sure to think of myself as, \"I am that person.\" I need to make sure I am communicating clearly and setting that vision across the organization, whereas right now, being a second in command, it's pretty awesome. I have so much influence and none of the public accountability or even the internal accountability really, because you haven't been a hard driving manager. So I kind of had the best of both worlds, and now I'm taking on the public accountability, the internal accountability, and that's something I know that I'm going to need to be comfortable with and get comfortable with over time. And then of course you always worry about people. It's a tremendous responsibility, both to our customers, to the community, to the folks on the team to really deliver true value to them in all the different ways that each of those groups and constituents need value. So I take that very serious. Rand: I think one of the things that was a little odd for me, Geraldine described it the other night to some of our friends. She was saying that, \"I think Rand was a little bit sad that people weren't more upset that he was leaving the role.\" Sarah: Right. Right? Rand: Right. Sarah: You kind of want people to belike, \"Don't go!\" Rand: Yeah. But instead they were like, \"Oh, this is a great decision. Yeah, you should totally do it!\" \"Get him out of here.\" Sarah: That's not . . . Rand: I know that's not how people perceived it, but there was definitely like that . . . the amount of support, like the amount of positivity around the decision made me go, \"Maybe I should have been doing something else before now.\" Sarah: The Internet has been so nice, right? Rand: They have. They have been wonderful. Sarah: Yeah. It's been great. Rand: Which is a rare thing for the Internet. Sarah: Thank you. Rand: Yeah. Keep it up. Sarah: Yeah. I can see that. I think part of that is one of your strengths as a leader, that's really pushed me and helped me grow, is that transparency and authenticity. So you have been very clear and honest both internally and externally. When there are parts of your role that you're not loving, people know about it. Rand: Sure. Sarah: It's not a secret. Everyone cares so much about you personally that when they know how unhappy you are, they want you to be happy, and so when you discover a path to happiness, of course people are going to be like, \"Well, yeah, you should do that.\" I hope we all can make those kinds of decisions, have the self- awareness to recognize when you're not being fulfilled. I think what you're doing is so unique, because for most people the mythology and the draw of that CEO title, you want to go to your class reunion and be the CEO of a great company. There's all this public perception that you have achieved something, you've made it. That is success. And most people, I think, don't have the self-awareness to reflect back and say, \"Well, it doesn't really matter that that's the cultural understanding of success. What's my personal understanding of success?\" Rand: That's very flattering. Thank you. It's very nice. Sarah: Yeah. I think it's great. We can all learn from that. Rand: I'm most excited about being able to say yes to some things and no to others and feeling less guilt. That is sitting high on my list of items, just not feeling guilty for passing off an investor contact, or something to do with press, or something external, and just passing that over to you, or forwarding something on and not making a call about it, the decision. I think I'm also excited about being able to dig in on things where I really want to. I want to spend a bunch more time figuring out how we can improve the spam algorithm that Dr. Peters and the data science team have come up with. Going and having an hour to dig around the web and look at a bunch of web spam papers and not feel guilty about, \"Gosh, I'm really spending . . .\" Sarah: That's not CEO work. Rand: Yeah, that's not CEO work. The product manager should be doing that or the product architect. \"Oh wait, I'm the product architect! I get to do this.\" That's awesome for me. I'm excited about that. Sarah: Yeah, you're going to be great. I'm excited on your behalf for that, and it's going to add a lot of value to the community and to the company to have you doing that as part of your job. Rand: I hope so. Sarah: It will. What am I excited about? I'm excited about a lot of things. I'm excited that this is a huge opportunity for growth for me. There are new challenges in this role, things that you do as second nature that you don't even have to think about, like for example this video. You're on video all the time. You're very public. You are always doing these press things, whatever that is, and that will be new for me. Even just managing the time for it. I'm not that concerned that I'll pick up the skill. I think I'm competent enough to eventually, someday, I hope, be comfortable on video and other public formats. Rand: You seem plenty comfortable to me. You did a great job at MozCon. You do well on video. I don't think you have . . . Sarah: But I'm not a Rand Fishkin. That's okay. I will never be exactly like Rand Fishkin. Rand: I can tell you, it's weird being in here. Sarah: So I'm looking forward to taking on some of those challenges. That's going to be managing my schedule, managing my priorities. I'm really looking forward to . . . I feel lucky. Honestly, I feel like I get the opportunity to sort of shepherd Moz in what's going to be a wonderful phase. I think that you have this feeling like, \"Oh, 2013 was such a challenging year.\" Rand: It was really hard. Sarah: You feel like, \"I'm not giving the company to her in the best state.\" I feel like, \"Wow, Rand did most of the shit work, and I get to come in after that's done and be like, 'Well, all right. So let's just tune that, and we'll tune that one and just tweak this thing here. All right. Done.\" I hope I'm right. Rand: I hope you're right too. I do feel like the challenges of scale are so . . . and maybe this is just a different skill set kind of thing. But I feel like they are so less suited to the things that I love to do and the things that I'm good at, and the intersection of those two things at the early stages was fairly strong. The intersection today at this size is drifting away. Sarah: Yeah. It's getting more into the stuff that I just love, right? Rand: I feel really lucky to have you here. Sarah: Me too. I feel lucky to be here. Opportunity of a lifetime. It's crazy. It's like, \"Hey mom, I'm a CEO!\" Rand: Yeah. Whew. I see the future of web marketing going in a lot of different directions and some big overarching trends. Some of those are I think that Google has been moving away from being a utility to becoming a business, and Google's business is focused on Google's interests. Businesses can still get a remarkable amount of value through earning traffic from Google, but you have to conform to the way that their business interests dictate, and that's very different from the historical Google is building a highway through the Internet for traffic. I also see a lot of trends around more people moving into things like content marketing, social media marketing, and SEO, and I think that means it's harder and harder for businesses and creators and creatives to stand out from the crowd. Sarah: And you have to manage workflow. It's a very fragmented market in terms of where you need to spend energy and time and how you can reach customers. I think that's making a marketer's job more complex. Then you add in things like keyword not provided, and there's a real transparency problem and just a time management problem. Rand: I feel like that's our obligation, right? Sarah: Yeah, from the beginning. Rand: You and I and Moz, and the 128 rest of us, all of us, our job is to bring back data that these other networks have taken away or that scale of networks have removed. Something like a Twitter, they're not trying to obfuscate data like Google is, but the scale of social media has made finding the needle in the haystack impossible. That's what we have to do as a company is show here's the value. Here's how you can take action on that. those kinds of things. Sarah: Surfacing the insight across all the different properties where you have to have your eye on, I have a lot of empathy for the average marketer out there who is just, \"How do you manage your day?\" Rand: Yeah. Sarah: We need to help them do that. Rand: Especially those small to medium businesses. They are overwhelmed by the obligations that they have in order to both earn traffic for themselves or their customers, if they're consultants, and the disparity between the information that's offered by the networks and what they actually need to be able to report and improve. Sarah: And then if you have the time to get access to some of that data, the time and the resources, then the Excel spreadsheets, you need to put it all together. You could spend your whole day just trying to analyze the data after you've gotten a hold of it from random sources, and then at what point are you actually doing your work? When are you moving the ball forward, because you're so busy looking at shifting spreadsheets, right? So I have a lot of empathy for that. I think that the good news is it's a problem that computers can solve, that math can solve. It's not an unsolvable problem. Rand: And a great UI/UX. Sarah: Great UI/UX is going to be absolutely critical to that so that we're saving people time and really driving them towards the right insights at the right moment. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "My Final Post as CEO: Sarah Bird Has the Conn"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "My Final Post as CEO: Sarah Bird Has the Conn"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}