{
  "url": "https://moz.com/blog/final-night-in-kuopio-random-thoughts-on-life-seom-industry",
  "slug": "final-night-in-kuopio-random-thoughts-on-life-seom-industry",
  "title": "Final night in Kuopio – Random Thoughts on Life & SEO/M industry - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Tonight is my final night in Kuopio (Finland) as we’re moving to new office, and new home in Sumiainen tomorrow. I have to admit that I feel a bit sentimental, somewhat scared, but also very excited.  One of my mentors in t...",
  "content": "Final night in Kuopio – Random Thoughts on Life & SEO/M industry Public Relations M By: mozUser1469147917838 June 29, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! M By: mozUser1469147917838 June 29, 2006 Final night in Kuopio – Random Thoughts on Life & SEO/M industry Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Tonight is my final night in Kuopio (Finland) as we’re moving to new office, and new home in Sumiainen tomorrow. I have to admit that I feel a bit sentimental, somewhat scared, but also very excited. One of my mentors in the past said a business person should reinvent him/her-self and set new challenges every 5 years; and that’s roughly the time I’ve been running my business and living in Kuopio with my family. So, where’s the catch? Why move from a city of 90,000 citizens to small municipality of 1,300 citizens? For me, enhancing quality of life is possibly the biggest factor behind the move…One of the things I rarely hear talked in the SEO & SEM industry (or in computing generally), are long term, personal goals. What do you expect from your life? What you do professionaly in 2020 / 2030? Are you happy with your current lifestyle etc? These are hard questions for anybody; and even harder if your living depends entirely on an unestablished industry like SEO/M. These may be very personal questions, but they are also the ones that define how successful a person is / will be. The higher you set the personal goals, the more likely it is that success will follow since there's a source of motivation other than money. I don’t know if people already inside the SEO/M industry realize how lucky we are, and how much we owe to the search engine industry (and yet we blame them most of the time, why?). After all, this is one of the very few business types where anyone, anywhere in the world, with the right motivation and limited assets has the possibility to build a meaningful and successful global/local business. Nobody says it will be easy and it is definitely not going to make every person filthy rich (though most hope for it). It’s just one pretty wicked cool way to make a living, and I'm very proud about it. Times are though changing, and I honestly don’t know if SEO/M will be there in year 2032 when I need to pay the final mortgage payments, but that’s life. Hopefully the world of 2032 still needs enthusiastic geeks. Thanks to all the folks and search engines who have helped me in making this possible. See you soon (if & when we get all the boxes unpacked and new wireless system is up and running). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Final night in Kuopio – Random Thoughts on Life & SEO/M industry"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Final night in Kuopio – Random Thoughts on Life & SEO/M industry"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "mozUser1469147917838\n          \n            mozUser1469147917838"
}