{
  "url": "https://moz.com/blog/find-seo-competitors-whiteboard-friday",
  "slug": "find-seo-competitors-whiteboard-friday",
  "title": "How to Find Your Real SEO Competitors — Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Competitor identification and competitor research is absolutely key to a good SEO strategy. Your real SEO competitors are the ones who target the same keywords, speak to the same audience, and solve for the same consumer needs. In today’s Whiteboard Friday, Lidia Infante walks you through two…",
  "content": "How to Find Your Real SEO Competitors — Whiteboard Friday Whiteboard Friday | Competitive Research By: Lidia Infante August 26, 2022 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Lidia Infante August 26, 2022 How to Find Your Real SEO Competitors — Whiteboard Friday Whiteboard Friday | Competitive Research The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Competitive research and analysis is a critical component of your SEO strategy. You may have an idea of who your business competitors are, but your real SEO competitors are the ones who target the same keywords, speak to the same audience, and solve for the same consumer needs. In today’s Whiteboard Friday, Lidia Infante walks you through two approaches to find out who those competitors are. Click on the whiteboard image above to open a high resolution version in a new tab! Video Transcription Howdy, Moz fans, and welcome to another edition of Whiteboard Fridays. My name is Lidia Infante, and I'm the Senior SEO Manager at Sanity.io. Today, we're going to be talking about how to find your real SEO competitors. Competitor identification and competitor research is absolutely key to a good SEO strategy. And in order to nail it, you need to figure out who your competitors really are. So how do we know that someone is a competitor in search? Essentially, they need to meet three criteria. They're targeting the same keywords as you, they're speaking to the same audience, and they solve for the same consumer need as you. That is, if your target audience goes with them, they have no more need for you. There are essentially two approaches to identifying your competitors. You've got a top-down approach and you've got a bottom-up approach. Top-down approach to competitive research So let's begin with this one. The very first thing you are going to do is contact other departments. Depending on where you are and the type of vertical that you're working in, you're going to want to talk to sales, you're going to want to talk to support, to customer success, to other areas of marketing, and even engineering, and ask them to provide a list of their perceived competitors. The next thing you're going to do is check an audience research tool. I recommend, for example, True Competitor by Moz, obviously. And then you're going to want to find the overlap between the two lists, right? So out of the list that your department and your colleagues say that are your competitors and the list that your tool says those are your competitors, you're going to want to find the overlap. The advantages of this method is that it helps you get buy-in because other departments are going to recognize parts of their work into the output that you're going to present and build better connections with them. And it's really fast. You can get this done in a day, even less, depends on how long you're going to have to wait for that information from other departments. There are other aspects of it that are not as good. So, for example, it's not going to be the most accurate competitor research that you've ever had, and you're not going to be able to drill into competitors by topic. However, this is best for performing sites. So if your site has been online for a while and you're ranking for a few of your target keywords, this is going to work really well for you. And going for the bottom-up framework might be overkill. Bottom-up approach to competitive research But then if you're starting a new site, or if you really, really want to dig into who your competitors are, you're going to want to do the bottom-up way. So the very first thing that we're going to do is we're going to identify what your target keywords are, and then we're going to cluster them into little topics. For each of those keywords, we're going to download the SERP results, the top 10, the first page. And we're going to analyze the competitor presence for each of your topics. So if, let's say, Amazon shows up in 100% of your keywords for X topic, you know that this is very key for you. And then what you can do is drill down even further and identify the SERP features that are present in each topic. You've already done the download. You already have the data. Just dig in a little deeper and you'll find out if you are best to attack these results with infographics, articles, video, any other format. This is very accurate, but it can be really slow. The bottom-up framework is really good if you're starting a new site, or if you're not sure that the approach that you've had before is working. Since it's a little tricky, I have provided a free template that you can find linked in the text below. And you can find me on socials at @lidiainfante or my website, lidia-infante.com. But before you go, to point two, I was using Moz's True Competitor tool, and it blew my mind. I recently joined a new company, Sanity.io, and I really wanted to figure out who my competitors are. I'm not an expert in headless CMSs and the structure content space, so I've been working on it for literal weeks. Just now, I was hanging out with the Moz team. They showed me the tool, and they immediately nailed my top five competitors on a click. What is that? Amazing. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Find Your Real SEO Competitors — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Find Your Real SEO Competitors — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Top-down approach to competitive research"
    },
    {
      "level": "H2",
      "text": "Bottom-up approach to competitive research"
    },
    {
      "level": "H2",
      "text": "Try our SEO Competitive Analysis tools for free!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    }
  ],
  "author": "Lidia Infante\n          \n            Lidia Infante\n          \n            Lidia Infante"
}