{
  "url": "https://moz.com/blog/find-new-keywords-simplifying-keyword-research",
  "slug": "find-new-keywords-simplifying-keyword-research",
  "title": "Find New Keywords: Simplifying Keyword Research - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In December, we rolled out branded keyword rules and metrics to campaigns, to help you segment your branded traffic. Now, we’re excited to introduce a companion feature to make your keyword research easier: Find New Keywords. With this feature, you can view keywords sending you organic search…",
  "content": "Find New Keywords: Simplifying Keyword Research Keyword Research By: Karen Semyan February 1, 2012 Table of Contents Copied! By: Karen Semyan February 1, 2012 Find New Keywords: Simplifying Keyword Research Keyword Research In December, we rolled out branded keyword rules and metrics to campaigns to help you segment your branded traffic. Now, we’re excited to introduce a companion feature to make your keyword research easier: Find New Keywords. With this feature, you can view keywords sending you organic search traffic, filter on your brand rules, and determine if you want to track them in your campaign. First, the basics. You’ll discover the Find New Keywords feature in a tab under your Manage Keywords section. (This feature requires that you connect your campaign to Google Analytics, so if you’re not connected to GA, you’ll find instructions on how to do this on the Find New Keywords tab.) But wait, where did the Manage Brand Rules page go?! We’ve moved your brand rules page into a tab under Manage Keywords, as well, so you can easily move among these sections as you manage your keywords. Now, on to the hunt for new keywords! 1. View the top 200 keywords sending you traffic that you’re not currently tracking. Why stop at 200? We want to make it easier for you to add the keywords that may be most interesting to track because they are branded terms or common words heavily associated by searchers with your site. After that, you can go straight to GA to manually grab more terms. If we see high demand for showing more keywords, we’ll consider showing more terms in the future (so let us know what you think!). 2. Decide which keywords are candidates for tracking. We show you a number of factors: Keyword's position or \"rank\" in your current list of 200 keywords sending you organic search traffic. Keyword’s traffic from the last week and last four weeks. Branded vs, non-branded keyword filters, based on your brand rules. Quick access to a full keyword analysis for keyword difficulty and full SERP analysis. 3. Add keywords of interest to your managed keywords list. With some information in hand about the keyword’s relationship to your brand, traffic, difficulty, and SERP analysis details, you’re on your way to finding some keywords of interest to track. One thing to note: If you are tracking all 200 (which we don’t necessarily recommend--please make your choices carefully), you’ll see a message telling you to check later for new keywords that have moved up the list. We’d love to know what you think of the feature, so let us know! Leave a comment right here, or e-mail help@seomoz.org. Happy keyword finding! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Find New Keywords: Simplifying Keyword Research"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Find New Keywords: Simplifying Keyword Research"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Karen Semyan\n          \n            Karen Semyan"
}