{
  "url": "https://moz.com/blog/finding-a-good-web-design-seo-firm-when-you-already-are-one",
  "slug": "finding-a-good-web-design-seo-firm-when-you-already-are-one",
  "title": "Finding a Good Web Design / SEO Firm (When You Already Are One) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This afternoon I have the privilege of interviewing a web design firm for a fairly large project.  I'm currently in discussions with a company to become the COO of a nicely funded semi-startup, and unfortunately the owners of the firm have already selected a web design firm (thankfully I'm not…",
  "content": "Finding a Good Web Design / SEO Firm (When You Already Are One) SEO Basics By: Joe Rozsa November 5, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Joe Rozsa November 5, 2007 Finding a Good Web Design / SEO Firm (When You Already Are One) SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This afternoon I have the privilege of interviewing a web design firm for a fairly large project. I'm currently in discussions with a company to become the COO of a nicely funded semi-startup, and unfortunately the owners of the firm have already selected a web design firm (thankfully I'm not bound to keep them in any way). As one of the final steps before I take this role, in which I would be responsible for just about everything from the site to the office wall colors, I asked to talk to this firm myself to make sure that I feel comfortable with them and their abilities. I have a feeling that they may have \"buzzworded\" their way into the gig by talking to these owners who are not extremely technically experienced. My experience so far may help those of you that have web design or SEO firms to avoid the same mistakes. In my initial research into the background of the company, I simply visited their website hoping to find a) the quality that they put into their own site, and b) the quality that they put into their client portfolio sites. I get the feeling after looking at both options that I will likely not be retaining their services. The business that I am going to be responsible for will rely heavily on SEO and SEM initially while establishing a community within a certain industry. The site will contain information that does not currently exist elsewhere--lots of potential! So, you can see that I will be looking for some advanced and detailed SEO techniques being used by this firm, as well as some Web 2.0 functionality. I was told by the owners that this company claimed that they specialize in just that. Guess I would be in luck! Here is what I found by looking at their own site: Title tag contains the name of the company - and that is it. Without actually naming them here, it was a one word company name, followed by \"Technologies LLC\". That is it, three words, \"Blank Technologies LLC\". Come on people, if you know anything about SEO, and this is the title tag of the SEO firm's site, it's probably a good idea to look elsewhere. Of course, all of the inner pages shared the same page title, which is always a good idea if you are secretive with your work and never want anyone to find your site. Homepage is mostly an image map, with very little text--only the street address of their location and a mailto email address (ugh, don't get me started there with the spam ramifications!) were actual text on the homepage. Alt tags were present on some of the images, but merely repeated the words displayed on the image and usually were not valuable in terms of SEO. Examples of these alt tags include \"getting started\" and \"what do we do?\" Again, it is becoming obvious that \"what they do\" should not be confused with SEO best practices. Out of curiosity, I pulled up their source code and found that my hunch about the same meta keywords and description tags being used for every page of their site was correct. When will people ever learn that laziness in these tags will get you nowhere? Now I am getting a little angry with these people. And while I was in their source code, I noticed there were no H1 tags, no CSS being used, tables everywhere, etc. I had to stop and check my calendar to make sure it wasn't 1997. Given all of this, I should have canceled my meeting for this afternoon and told the owners to drop this firm altogether, but I can't really do that just yet. So I look for something - anything - that I can build off of that they might do well and for a reason why I might think they could work. It's a stretch, but... They have lots of inbound links. Wow, I was amazed to see how many inbound links this company has. Over 3,000, and it is seemingly because they were able to get their clients to accept (probably unknowingly) having a link to the design firm at the bottom of every page they have. Some of these sites are .edu pages, as it looks like these guys started building sites (likely pro bono) for fraternities and sororities at colleges and universities. Genius! These sites are truthfully no more authoritative than any other site, but the domain ends in .edu and cha-ching, bonus points from the search engines! Over 3,000 incoming links and many from .edu sites is a great start, until I see that every single inbound link uses the exact same anchor text, which is... (drumroll please) the one word name of the company. It's not even a word, for crying out loud. It's a play on words that nobody - absolutely nobody - would intentionally type into a search engine. But if you do (and as I did), you'll see that they have complete domination in the SERPs for their made-up business name. It's painful to me at this point to see that this company is that close to really being big and yet they have no clue what they are doing. It's like stuffing money under your mattress. Probably safe, but you are sitting on an asset and getting absolutely nothing for it. Looking through their client list / portfolio on their site made me even more depressed. No H1 tags on any of them. No keyword based title tags, no site maps to be found, no meta tags at all on some of them, no directory (DMOZ, etc.) listings, no ability to find these sites using big G even when searching for the company name, and sometimes for the domain name! So, two hours from now I meet with this company, and I am still looking for something positive to focus on. I didn't even touch on the web development side of things, but since I'm looking to build a site in 2007 and not 1997, I don't think they will be able to relate there, either. I'm expecting... \"Valid XHTML? Don't you mean DHTML? Sure, we can do that, I think.\" Anyway, to anyone out there that is trying to make a living in these fields, please make sure that your own house is in order first. You may get by buzzwording your way into some business every now and then, but if someone that knows what they are talking about ever interviews you, you could be in for a long day. Before I take off, one final tip from this experience - if you own a web design / SEO firm and you aren't actually good at what you are doing (and I've just discussed one that qualifies), you may not want to put a portfolio of your \"work\" available on your website. For interested competitors, you are providing them with a lead list as well as a \"Why your current firm sucks\" presentation. Heck, this might be its own blog topic someday soon, but for now, it's off to interview this firm... ugh. *Note from Rebecca*: Though this post is over a week old, it got a lot of positive attention from our YOUmoz community, so I thought I'd put it on the main blog for more discussion. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Finding a Good Web Design / SEO Firm (When You Already Are One)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Finding a Good Web Design / SEO Firm (When You Already Are One)"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Joe Rozsa\n          \n            Joe Rozsa"
}