{
  "url": "https://moz.com/blog/find-nap-variations-before-building-local-citations-whiteboard-friday",
  "slug": "find-nap-variations-before-building-local-citations-whiteboard-friday",
  "title": "Find All Your NAP Variations Before Building Local Citations - Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Citation consistency got you down? It's one of the most important local search ranking factors, but it can be an overwhelming task to find inconsistencies, and it's often easy to create accidental duplicate listings. In today's guest Whiteboard Friday, Darren Shaw, founder of Whitespark and recent…",
  "content": "Why You Need to Find All Your NAP Variations Before Building Local Citations Local SEO | Whiteboard Friday By: Darren Shaw March 25, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Darren Shaw March 25, 2016 Why You Need to Find All Your NAP Variations Before Building Local Citations Local SEO | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. [Estimated read time: 6 minutes] Citation consistency got you down? It's one of the most important local search ranking factors, but it can be an overwhelming task to find inconsistencies, and it's often easy to create accidental duplicate listings. In today's guest Whiteboard Friday, Darren Shaw, founder of Whitespark and recent speaker at MozCon Local, outlines a foolproof way to discover all your NAP variations to prepare for proper citation building. Click on the whiteboard image above to open a high resolution version in a new tab! Video TranscriptionHey there, Moz fans, I'm Darren Shaw from Whitespark, and I'm here today to talk to you about why you need to find all of your NAP variations before building local citations. It's an important topic to cover because citation consistency is one of the most important local search ranking factors. In last year's local search ranking factor study, it was ranked the number two most important factor, second only to just actually having a business in the city you're trying to rank. Before I get into it, I want to cover a couple of definitions really quickly. So NAP stands for name, address, and phone number. A citation is basically a mention of your name, address, and phone number somewhere on the Web. Typically you're going to see that on sites like YellowPages.com or Yelp.com or Superpages, but you can find them on any kind of sites like blogs, newspaper, whatever. Anywhere your name is mentioned, that's a citation. I want to illustrate a mistake we see happening all the time in citation building. I'm going to show you an example here. Bob is a lawyer. He wants to figure out how he can rank in the local pack. So he does a little research. He comes across an article on how to rank in local SEO. He reads about citations and how that can help with his local rankings. The article suggests that he uses the local citation finder to research his competitors and find citation opportunities. So he's done that. He's got his list, and he's off to submit his business to all the various directories. He goes to YellowBiznass.com, and he's thinking, well, maybe I already have a listing there. So he searches for his phone number, doesn't find anything. He thinks he's all in the clear so he creates a listing. This is the mistake he's made. He didn't realize, he didn't think about the fact that he already had a citation because he used to use his old cell number for his business. If he had searched for his cell number, he would have found the old listing on the site. So now he's created this problem where he's got an old, incorrect listing on the site, and he's created a duplicate listing. So he's created a citation consistency problem, and it's not really helping him to rank well. We solve this problem in our Whitespark citation services with this four-step process to find all the different NAP variations. How to find NAP variationsStep one, we ask the business: Tell us about any previous business names that you've had, if you've changed your name in the past or if you have a corporate account. How about any addresses? Have you moved locations? Do you have any secondary locations? Do you have your business registered at a corporate address? Phone numbers? Any call tracking numbers, toll-free numbers, cell numbers, any past numbers that you've used for the business? This is a great way to start. We get a list of all that stuff. Next, we'll go to Moz Local and we run a search for the business name and ZIP. This, because Moz Local queries all the primary data aggregators and a number of other important sites in the local search ecosystem, it tends to surface a lot of NAP variations. So we use this to add to our list. Third, we'll go to YellowBot and MerchantCircle. These two sites are interesting because they collect data from a number of different sources, but they don't do a very good job of merging listings as the data comes in. So we end up with a lot of duplicates on the site. It's a lot of work to clean up that site, but it's very helpful for this process. So for this one, you just put in a portion of the business name. Bob's business is Bob Loblaw's Law Firm. Instead of just putting the whole thing in, we'll just put in Loblaw to help surface variations. Here are some variations that might come up. We've got Loblaw and Sons LLC, Loblaw's Law, and Bob Loblaw's Law Blog. After we get that, we're going to go to Google. We're going to search Google. Now what we're doing here is we're trying to find any variations that we didn't already discover. We already have a number of different names. We have a number of different phone numbers. What we'll do is we're going to find more names. If you put in a phone number for the business and you exclude all the names, Google's going to surface any sites or any pages that mention that phone number without any of these names. That helps you to surface any variations that you weren't aware of. You do that for each phone number. Then on the phone number side, if we're trying to find more phone numbers, we'll search for the business name and exclude the phone numbers we already know of. By excluding phone numbers we already know of, we might find new names. The one trouble with this one is it tends to surface a lot of pages where you just mention the business without the phone number, and that's a common thing. So what I do in this case is I scan the results looking for obvious business directories, if it's like a Yelp or a Foursquare or anything like that. I'm looking for business directories in these results. Then we want to see if there are any other addresses we missed. Put in the phone number and exclude the addresses that you're already aware of. Do that for each phone number. An important tip here with the addresses is that you don't want to use the full address. Let's say for example your address is 5329 Saddleback Road South, Suite 705. Don't put in the whole thing. You put that in quotes, it's only going to match pages that are an exact match with that. Just put in that portion that's going to be common to all the sites, like 5329 Saddleback. At the end of this process, you should have a very nice, clean list of all of your various names, addresses, and phone numbers for the business. Now you're ready to build citations.All you have to do at this point is just make sure that you check all NAP variations on the site before you submit a listing. There are two ways to do that. One, you can use the site search feature to search by name and/or phone number. You're going to run all those, but you can't always rely on this. Some of the sites have a really crummy search feature. It doesn't work very well. We always double check by running a number of Google searches as well. You'll use the site colon operator in Google. You'll go site:local.com space and put it in quotes, so phone one, phone two, name one, name two, address one. You're going to go through all of the different variations that you're aware of. At the end of that if you found a listing, you want to claim it and update it. If you didn't find a listing, then you're clear to submit. This way, you'll be creating citations without worrying about creating duplicate listings. That's everything. I hope it's been helpful. I want to say a big thanks to Nyagoslav Zhekov who helped me organize all this information and a big thanks to Moz for having me. If you have any questions, please leave them in the comments. Thanks very much. \u0003 Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why You Need to Find All Your NAP Variations Before Building Local Citations"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why You Need to Find All Your NAP Variations Before Building Local Citations"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "How to find NAP variations"
    },
    {
      "level": "H2",
      "text": "Now you're ready to build citations."
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Darren Shaw\n          \n            Darren Shaw"
}