{
  "url": "https://moz.com/blog/fixing-the-broken-culture-of-seo-metrics-whiteboard-friday",
  "slug": "fixing-the-broken-culture-of-seo-metrics-whiteboard-friday",
  "title": "Fixing the Broken Culture of SEO Metrics - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "SEO is evolving, and the metrics we currently use to gauge success are broken when it comes to the broader ideals of inbound marketing. In today's Whiteboard Friday, Rand talks about what we can do to offer a more holistic and strategic approach to success metrics that our clients can get behind.",
  "content": "Fixing the Broken Culture of SEO Metrics Whiteboard Friday By: Rand Fishkin April 26, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 26, 2013 Fixing the Broken Culture of SEO Metrics Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As SEO continues to evolve, the metrics that indicate success continue to change with it. However, many of our client's needs don't seem to be changing as rapidly. With clients focused on specifics like the number of links they're getting and weekly ranking reports, it's tough to move the needle in the right direction for true SEO success. How do we push other inbound channels (like search, content marketing, and social) forward to offer a more holistic and strategic approach to inbound marketing that our clients can get behind? In today's Whiteboard Friday, Rand talks about the current broken culture of SEO metrics, and offers advice on what we can do to fix it. Video Transcription \"Howdy SEOmoz fans. Welcome to another edition of Whiteboard Friday. This week, I want to share an experience I had with you and then get to our Whiteboard Friday topic, which is going to be all about metrics and how we change this broken culture that we have in the SEO world that's sort of carried over from the past. I got to go to SMX Sydney, which was an incredible time and an amazing visit, and I spoke there with Dan Petrovic from Dejan SEO, who is a well-known SEO guy in Australia, very, very smart guy, leads an agency down there. He asked me some questions that I think are very important and resonated with me because they're things that I've heard from a lot of people and seen reflected in a lot of the questions that we get all the time. That was: \"Rand, I want to do more of this broader inbound marketing. I want to get more strategic about the way I help people with SEO. I want to get less focused on things like the number of links I send you and your particular ranking report for a week. But these are things that our clients care about. When we talk specifically with clients and we pitch them on SEO, they tell us, 'Hey, look, you're not here for that. You're here to get me more links. I want this many links and I want these rankings. I want my page rank to go up. I want my DAPA to go up.'\" Those kinds of metrics have been ingrained as what SEO is all about, and tragically that's not the way to be successful at our jobs. The way that we really move the needle on search, on social, on content marketing, on any of these inbound channels is to have a holistic and strategic focus on them, not this little tactical, rinky-dink, \"I'm going to get 50 links That's going to move this one ranking up.\" We know this. We've been talking about it for a long time here on Whiteboard Friday and across the SEO world. You can find it on nearly every reputable SEO blog out there. So Dan and I were chatting and I said, \"Well, I think what we have to do is take that conversation a level higher and say, 'What do you want those metrics to accomplish? Why do you want links? Why do you want your rankings higher?'\" The answer is often, \"Well, we're trying to attract more traffic and expose people to this new branding campaign,\" or, \"We're trying to get more people signed up for this webinar. We're trying to get more people in our salespeople's funnel. We're trying to convert more leads to perform these types of comparison searches and then buy from one of our partners.\" Okay, good. That is getting us all the way down from these what I call \"leading indicator metrics\" down to the business KPIs. Business KPIs, the things that indicate the performance of the business, are where we should take our strategic initiative, our strategic lead, for any sort of online marketing effort, whether that's SEO, whether it's PPC, advertising. I don't care what it is that you're spending money on, it should be focused on this, centered on this, trying to achieve these things, and then, yes, we can use metrics like links and rankings, even something like page rank or crawl depth, as leading indicators, performance indicators that things are maybe going the right way, that they're not going the right way. We can compare them against our competition, and they're fine metrics for that. We just can't focus on them as where we take our strategy. If the strategy is \"go get me more links,\" I'm probably going to do some gray or black hat SEO because very frankly, that's how you move the needle on that one indicator. If you don't care about potentially getting banned or hurting your brand impression or making a bad impression with the search engines and eventually getting into trouble that kind of way, then, yeah, you're going to do stuff that is non-ideal for your business metrics. So let's have this conversation first. I'm going to start down here. Business KPIs, things that I think about as being business metrics, and these are just a sample. I don't want you to get the idea that these are the only metrics or that these have to fit in these buckets. But in this purple bucket down here, I have things like conversions. Conversions might even be a marketing KPI for you, depending on what your true business goals are. But transaction value, life time customer value, retention of those customers and recidivism of customers, those are the business KPIs, typically, in most organizations. They're trying to get people to the site, perform some type of action that will lead to revenue, lead to a goal being accomplished. Marketing KPIs, these are one step up, but not yet at that level of sort of the SEO leading indicators. These are things like visits and traffic, tweets, shares, +1's. Those are signals of engagement and success over social media, so is followers and fans, and these might be in leading indicators, tweets, shares, +1's could easily be in leading indicators rather than marketing KPIs, brand mentions, pre-conversion action. So people, for example, visiting pages that lead to a conversion on your site and following through that funnel that you've got set up on your site, those are the types of marketing KPIs that the marketing team might be reporting and that you particularly, if you're doing any type of consulting working or if you're working in-house and trying to help move the needle, you do want to have a dashboard that's showing you these. Then those leading indicators, those are much more of a, \"Hey, I think this is a signal that we might be on the right path,\" or, \"This is a test. Let's see if moving the needle on links actually moves the needle on these other things that we care about and these business metrics that we care about,\" or, \"Boy, you know, sometimes it seems like it doesn't.\" Sometimes it seems like other things that we might focus on, perhaps social is really moving the needle, because you're finding that you're having a huge brand impact that's biasing clicks in the search results, that's moving you up in positions through usage and user data types of algorithms, and that's really doing a much better job for you than raw links and raw rankings. Maybe you're expanding your portfolio of content, and that's what's moving the needle for you. You could easily put things like content production in here. You could put that in a leading indicator, or you could put it in a marketing KPI. You could put content engagement, things like comments or registrations. Those could fit into marketing KPIs. It's okay to have different things in these different buckets. Just know what they are and make sure if you're working with someone, that you're getting the right answers here so that you can make the right decisions here. Don't focus on these. If you focus on these from a strategic point of view, your tactics are probably going to lead you in the wrong direction, and, by the way, those of you who might be buying consulting services or hiring an in-house SEO or an in-house marketing team and having them focus on this stuff, you're really going to be misleading your marketers, and they're going to be focused on the wrong kinds of things that aren't going to move the needle for the business. They need to be up here. Let me show you in a more precise fashion how I love to see this visualized and illustrated, how I love to see this done. We actually do this right now at Moz. We've got an internal tool that does some of this stuff, and then we have a big Google docs spreadsheet that I would love to make more sophisticated, and we probably will after we release some of the big, new things we're working on here. But basically, there are three categories up in this leading indicators column that I pay attention to, and those are things like I want to look at the leading indicators, whatever they are, and compare them versus my budget and my goals. So I might have, okay, this was our goal, and we are +x over that goal. This is our goal and we're -y over this goal, and this is our other goal, we've got +c over here, compared to last year this time, Q1 2012. Q1, January 1st to April 1st of 2013, here's what we've done so far, and here's how far ahead we are of where we were this time last year, what we performed in Q1 of last year. I like doing this because seasonality plays a big role in many, many businesses, not every one but many, many businesses. So comparing year over year is really healthy for this. Then compare versus the competition. The wonderful thing about leading indicators, and often one of the big reasons why a lot of folks use them is because we can compare. We can see where our competitors are ranking. We can see what sort of links they're getting. We can see their DA and PA. Maybe we can't see their crawl rate and depth, but those other sorts of leading indicators, even things like tweets and shares and +1's, followers and fans, those indicators we can put in here, and we can compare against our competition. Once we get down a layer, and I would encourage you to have the top layer, which we care about and it's interesting, but it's not the focus. It's just a leading indicator. When we get to the marketing KPIs, we've got, again, budget year over year and competition. Then when we go to the business KPIs, we almost never can get competition, the data on what the competition's doing. So we just have budgeting year over year. But being able to see this, being able to visualize this, it doesn't necessarily have to be in this funnel view, but being able to see this and compare and then to show your clients, your managers, your team members what you're doing and how that stacks up against what the business is trying to accomplish, this is incredibly powerful. It's so much more powerful than saying, \"I want links and rankings.\" If you're hearing from folks, \"I want links and rankings,\" please have them watch this whiteboard video, have them leave comments, have them e-mail me. My goodness, I don't think that this is going to be how successful SEO gets done in the future. This is how tactical SEO was done in the past, and, unfortunately, it's how a lot of black and gray hat SEO became the norm – well, I don't want to say \"the norm\" – but became very popular in our world. By focusing on bigger things, we can be smarter. We can accomplish a lot more. All right everyone, look forward to your comments, and we will see you again next week for another edition of Whiteboard Friday.\" Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Fixing the Broken Culture of SEO Metrics"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Fixing the Broken Culture of SEO Metrics"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}