{
  "url": "https://moz.com/blog/florida-blogger-gets-california-defamation-lawsuit-dismissed-for-lack-of-jurisdiction",
  "slug": "florida-blogger-gets-california-defamation-lawsuit-dismissed-for-lack-of-jurisdiction",
  "title": "Florida Blogger Gets California Defamation Lawsuit Dismissed for Lack of Jurisdiction - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "May It Please the Mozzers, \n\nThe world is filled with all kinds of nutty people. Mostly, this is a wonderful thing. But sometimes people go too far.\n\nThis case involves two lawyers, a messy breakup, and a blog about \"Guns, God, Food, Beer, Tools, Politics, and Whining.\" \n\nStephen Hogge, a Florida…",
  "content": "Florida Blogger Gets California Defamation Lawsuit Dismissed for Lack of Jurisdiction E-Commerce SEO By: Sarah Bird November 24, 2008 Table of Contents Copied! By: Sarah Bird November 24, 2008 Florida Blogger Gets California Defamation Lawsuit Dismissed for Lack of Jurisdiction E-Commerce SEO May It Please the Mozzers, The world is filled with all kinds of nutty people. Mostly, this is a wonderful thing. But sometimes it's not. The case I want to discuss today involves two lawyers, a messy breakup, and a blog about \"Guns, God, Food, Beer, Tools, Politics, and Whining.\" Stephen Hogge, a Florida attorney, operates the blog Hog on Ice. He was sued in California by a former Miami School of Law classmate, Fatima dos Santos Fahmy, over statements he made about her on his blog, including calling her a deadbeat, maligning her work ethic, and falsely claiming that she was Hogge's former girlfriend. To get right to it, he falsely labeled her \"a mentally ill alcoholic prostitute.\" Not surprisingly, Ms Fahmy didn't care for these remarks and tried to put her legal education to good use. Representing herself, she sued Mr. Hogge on her home court, California. Generally, if you're bringing a lawsuit you've got to sue the defendant where he lives. It's a basic fairness issue. Now, the fairness equation changes if you can successfully argue that the defendant sought you out in your home state to commit his wrongful acts. Why should you have to sue him over there if he went out of his way to do something illegal in your state, right? Mr. Hogge, also representing himself, asked the California court to dismiss the case because the California court has no jurisdiction over Florida residents. This is a standard legal challenge to multi-state jurisdictional issues. Ms. Fahmy countered by arguing that Mr. Hogge subjected himself to jurisdiction in California by targeting her for his tortious remarks. He targeted her and she lives in California, ergo, California courts should have jurisdiction over Hogge. Hogge replied by arguing that he didn't know she lived in California, so he couldn't have been targeting California. At first, the court agreed with Ms. Fahmy. However, the Court later reconsidered and decided to go ahead and dismiss the lawsuit, but not without issuing a bit of a lecture to both parties for their alleged technical blunders in the case. Ms. Fahmy didn't properly authenticate her documents and Mr. Hogge filed over-length briefs. This proves again the old adage, \"a lawyer who represents himself has a fool for a client.\" Technically, this is a win for bloggers who are now less likely to be subjected to out-of-state suits. However, I can't help but feel this is a loss for exes of nutty bloggers everywhere. Eric Goldman and The Citizen Media Law Project also cover the case. Best Regards, Sarah Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Florida Blogger Gets California Defamation Lawsuit Dismissed for Lack of Jurisdiction"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Florida Blogger Gets California Defamation Lawsuit Dismissed for Lack of Jurisdiction"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Common Mistakes E-commerce Websites Make Using JavaScript"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sarah Bird\n          \n            Sarah Bird\n          \n            Sarah Bird"
}