{
  "url": "https://moz.com/blog/florida-courts-order-on-negative-keywords-will-not-break-the-internet",
  "slug": "florida-courts-order-on-negative-keywords-will-not-break-the-internet",
  "title": "Florida Court's Order on Negative Keywords Will Not Break the Internet - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Last week, there was minor uproar over a Florida District Court's Order involving negative keywords. Understandably, many SEO/Ms were anxious that the Court screwed something up that would prevent companies from bidding on their competitors' trademarks for keyword advertising.\n\nArs Technica ran the…",
  "content": "Florida Court's Order on Negative Keywords Will Not Break the Internet E-Commerce SEO By: Sarah Bird May 5, 2008 Table of Contents Copied! By: Sarah Bird May 5, 2008 Florida Court's Order on Negative Keywords Will Not Break the Internet E-Commerce SEO May It Please the Mozzers, Last week, there was minor uproar over a Florida District Court's Order involving negative keywords. Understandably, many SEO/Ms were anxious that the Court screwed something up that would prevent companies from bidding on their competitors' trademarks for keyword advertising. Ars Technica ran the headline \"'Negative Keyword' Ruling May Have Big Impact On search Ads.\" Search Engine Watch also expressed deep concern about the ruling, calling it \"a dangerous precedent.\" The Horror! I want to assure the search community that the court's order isn't radical, nor is it likely to have adverse effects on keyword advertising. Let's take a quick look. What Was the Case About? In Orion Bancorp Inc. v. Orion Residential Finance (No. 07-cv-1753 (M.D. Fla., March 25, 2008)), Orion Bank sued a competitor, Orion Residential Finance. The similarity in their names and industry should give you a hint about what the suit is about. That's right, trademark infringement. Orion Bank accused Orion Residential Finance of infringing on its registered trademarks. The bank owns ORION, ORION BANK, and ORION BANCORP. Orion Residential Finance is simply too similar to Orion Bank and the industries overlap. So Orion the bank brings this lawsuit requesting that Orion the residential finance company stop using its marks and pay it some money. Well, the bank never even served the residential finance company. It just went straight to settlement discussions. The two parties negotiated for about six months and reached an agreement. The Order signed by the judged was actually an agreed order written by and willingly entered into between the parties. What Did the Order Say? As you would expect, the Order basically says that the residential finance group can't use the word \"Orion\" to identify its business anymore. In these types of orders, it's typical to prohibit the Defendant from using the challenged name in all manner of traditional media. The only thing different here is that the parties agreed to include a provision on keyword advertising. Among other things, the order states that the Defendant is prohibited from purchasing or using any form of advertising including keywords or 'adwords' in internet advertising containing any mark incorporating Plaintiff's Mark or any confusingly similar mark, and shall, when purchasing internet advertising using keywords, adwords or the like, require the activation of the term \"Orion\" as negative keywords or negative adwords in any internet advertising purchased or used....For purposes of this court order, a \"negative keyword\" or \"negative adword\" shall mean a special kind of advertiser keyword matching option that allows an advertiser to prevent its advertisements from appearing when the specific terms are a part of a given user's internet search or search string. It does not infer that the Defendant may use the specified negative keywords or adwords for any other purpose. Why the Court's Ruling Won't Break the Internet First, this court's order doesn't mean that competitors can't bid on each other's trademarks any more. It doesn't even come close. The only reason this order exists is because the competitors have confusingly similar names and only one has the trademark. In other words, the Court would never have issued such an order (and the parties would never have agreed it) if Orion brought this same lawsuit against Lobster Residential Finance. The Court did not single out keyword advertising as the problem. Instead, the parties agreed that Orion Residential Finance can no longer use the word in commerce because it is confusingly similar to Orion Bank. Period. Second, there was some speculation that because the original Complaint included some John Does, that this Order could be applied to companies other than Orion Residential Finance. There is no need to worry about that happening. First, the John Doe defendants were dismissed from the lawsuit. Second, the Order specifically states that it applies to Orion Residential Financial, not the John Does. Third, there was concern that this order would somehow affect Google's policies on keyword advertising and trademarks or that Google would get involved because of the increased burden. The good news here is that this order has no effect whatsoever on Google's current U.S. policy of allowing competitors to bid on each other's trademarks so long as the marks aren't used in ad copy. The Order is only enforceable between the parties. That means that the Orion Bank couldn't take Google to court for failing to follow this order. Its only option would be to take Orion Residential Finance to Court and ask for sanctions. Thus, I'm sure Google won't be bothered by this result. Concluding Remarks In short, the case didn't add to the interesting discussion of whether it is infringement to bid on a competitor's trademark. Instead, it just affirmed that if Company A's business name infringes on Company B's name, then Company A will have to change its name. As Eric Goldman pointed out, the exciting thing about this case is that two attorneys and a judge seemed to understand how keyword advertising works. Now that IS newsworthy! I hope this clarifies the case and its potential impact on the industry. Best Regards, Sarah Bird Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Florida Court's Order on Negative Keywords Will Not Break the Internet"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Florida Court's Order on Negative Keywords Will Not Break the Internet"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Common Mistakes E-commerce Websites Make Using JavaScript"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sarah Bird\n          \n            Sarah Bird\n          \n            Sarah Bird"
}