{
  "url": "https://moz.com/blog/followerwonk-partners-with-buffer",
  "slug": "followerwonk-partners-with-buffer",
  "title": "Followerwonk Is Moving On to a New, Loving Home - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We've been searching for the perfect home for our Twitter analytics tool, and it finally found us. Please join us in congratulating the new owner of Followerwonk!",
  "content": "Followerwonk Is Moving On to a New, Loving Home Moz News By: Adam Feldstein December 20, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Adam Feldstein December 20, 2017 Followerwonk Is Moving On to a New, Loving Home Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. We have exciting news to share with you about our Twitter analytics tool, Followerwonk! For a while now we’ve been looking for a new home for the tool. We’re very pleased to announce that Marc Mims, one of the tool's original developers, formed a company to acquire it and will continue to operate the popular service under the Followerwonk brand.A little historyIn August 2016, we announced our intention to sell Followerwonk. It’s a useful and powerful application, but since acquiring it in 2012, we discovered that the overlap between users of Followerwonk and users of our core SEO products was smaller than we anticipated. To address that problem, in 2015 we offered it as a separate subscription — part of a larger strategy to extend our services beyond SEO. Last year we made some hard choices, ultimately deciding to refocus our efforts on our SEO core. It was then that we decided to seek a better home for our Twitter analytics tool.Marc and Followerwonk go way back. As an engineer on the team that originally built and launched the tool, he came on board at Moz in 2012 when Moz first acquired it. He spent his first year on the Moz engineering team working on Followerwonk, and then a year working on Open Site Explorer, after which he returned to Followerwonk to help us relaunch it as a standalone product. In August 2016 we put Followerwonk in a holding pattern while we sought a buyer; during this time, Marc stayed on as a contractor to keep it healthy and operational for existing customers.When Marc made an offer to acquire the product, it was like everything had come full circle; we were delighted to know Followerwonk will continue in good hands. There are only a few buyers in the world who could bring Marc's knowledge and passion for Followerwonk to the table. In the months since August 2016, Marc spent his time making improvements and optimizations to the backend. He has quietly deployed 52 releases of Followerwonk in that time, improving performance and stability. He’s excited to be able to start adding new features now, too.What does this mean for existing customers?It means you can expect continued service from the product you love and the addition of new features and capabilities in the future. Moz will continue to host Followerwonk during a transition period while Marc prepares it to run on its own infrastructure. During that time, you can continue to use Followerwonk as you always have.As Marc and Moz work together to transfer the service, Followerwonk customers should not notice much change; most of the work will be happening behind the scenes. Accounts will be transferred securely, and we will communicate directly with customers if any actions are required.If you have legacy access to Followerwonk as part of your Moz Pro subscription from before its 2015 relaunch as a separate service, you will continue to have uninterrupted access to the tool through the transition period. Near the end of that period, Marc and Moz will jointly make a special offer allowing you to subscribe to Followerwonk and continue using it after the tool has left Moz’s infrastructure.The transition period should take between three and six months. During that time, you can access the tool through your Moz login at https://followerwonk.com. Afterwards, you’ll find it at https://followerwonk.com. We’ll be sure to reach out to all customers and those with legacy access to provide more details well before any changes occur.Final thoughtsIn our hearts and minds, this is absolutely the best possible outcome for Followerwonk. It continues in the hands of a strong engineer, a beloved and respected member of the Moz team, an incredibly TAGFEE person, and someone who knows Followerwonk inside and out. Please join us in wishing Marc great success as he builds a team and a business around Followerwonk, giving it the love and attention it richly deserves.If you've got any questions, would like a few more details, or simply wish to congratulate Marc in person, head over to the Q&A post he authored here and join the conversation! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Followerwonk Is Moving On to a New, Loving Home"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Followerwonk Is Moving On to a New, Loving Home"
    },
    {
      "level": "H2",
      "text": "A little history"
    },
    {
      "level": "H2",
      "text": "What does this mean for existing customers?"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Adam Feldstein\n          \n            Adam Feldstein\n          \n            Adam Feldstein"
}