{
  "url": "https://moz.com/blog/follow-your-brand-with-twitter",
  "slug": "follow-your-brand-with-twitter",
  "title": "\"Follow\" Your Brand with Twitter - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Today I was reading my feeds and found interesting news talking about Twitter has acquired Summize. After I read the post,  I thought to myself \"Damn\" , I’m sure a lot of people (includin...",
  "content": "\"Follow\" Your Brand with Twitter Social Media By: Fábio Ricotta July 22, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Fábio Ricotta July 22, 2008 \"Follow\" Your Brand with Twitter Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Recently I was reading my feeds and found interesting news talking about Twitter has acquired Summize. After I read the post, I thought to myself \"Damn.\" I’m sure a lot of people (including me) were thinking that Twitter was supposed to be acquired by another company and not the other way around. If you don’t know Surmise yet, it WAS a popular Twitter search service that allowed users to search all Twitter tweets. Surmise provided an API like Twitter to give some ways for developers to create some mashups, increasing their system features. Now, after this takeover, with the 5 Summize engineers, Twitter created its own search page for everyone to search all tweets and they have a mission to improve Twitter search to increase the user experience. But…what about branding or SEO? Twitter has always been an incredible source for information, discussion, and dissemination of content, allowing anyone to talk about anything, anywhere, with just a few characters. With this new search feature, you can now \"follow\" your company’s brand, your main keyword, or a specific keyword, or even their competitors. Check it: 1) Search for a brand, like the SEOmoz brand or YOUmoz brand: 2) Search for a keyword, like SEO or Search Engine Optimization: 3) You can search for a conference, to see what people are talking about or to follow all info on the conference day. Our search is for SMX São Paulo or SMX Brazil: “Following” your brand or your keyword gives you a chance to see what people are talking or thinking about a subject. It is simple to identify unsatisfied customers or someone that likes your tools, or a customer who wants an improvement into your product but doesn’t want to contact your company to talk about it. You can protect your brand, improve your products, or you can see what your competitors are doing to get more visitors/clients. Here are some additional tips: You can follow this search at your Twitter account or you can subscribe to this search feed (take a look at top right icons); There is a feature to select the language that you want. I mean, I can search everything about SMX but I can select only Portuguese tweets, so probably, you will get some info about Brazil SMX; You can translate any tweets from 17 different languages to English. This feature is provided by Google Translator; You can use a lot of operators, like OR, AND, quotes, and much more. What are you waiting for? “Follow” your brand, major keywords, or even your competitors. There is no doubt that this Twitter tip will help your website SEO strategies. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "\"Follow\" Your Brand with Twitter"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "\"Follow\" Your Brand with Twitter"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Fábio Ricotta\n          \n            Fábio Ricotta"
}