{
  "url": "https://moz.com/blog/for-statistics-hounds",
  "slug": "for-statistics-hounds",
  "title": "For Statistics Hounds - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I really enjoy statistics and have run into some nice summaries today.If you are curious about what monitor resolution people are using, which browser, which operating system, etc. here is a link that gives some trends over time.... Browser StatisticsI was surprised to see that Mac operating system…",
  "content": "For Statistics Hounds Moz News E By: EGOL June 2, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! E By: EGOL June 2, 2006 For Statistics Hounds Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I really enjoy statistics and have run into some nice summaries today.If you are curious about what monitor resolution people are using, which browser, which operating system, etc. here is a link that gives some trends over time.... Browser StatisticsI was surprised to see that Mac operating system was NOT going extinct. Also I think that we are almost to the point where 800x600 resolution designs are undersized for all but a few users.... In fact, I am going to kick up some of my pages to 1024x768.Also, was reading about Internet users by language. Check out the \"penetration by language\" stats and the \"growth for language stats\". Lucky people are those with an inclination for Chinese and an interest in SEO - that language has the lowest penetration and one of the highest growth rates.Top 50 Internet Advertisers by Media Value. If these folks are spending the bucks then there must be some buyers out there. There might be some good generic affilite programs here.Also some stats for the Top 25 Companies / Stickiest Brands on the Web - \"largest unique audience\" and \"time per person\". Google is down at #4 - probably because they are not as strong in the content department.... but seems strange to me that microsoft and yahoo have such small search penetrations in comparison of more people are on their site for longer periods of time. This means that visitors deliberately leave them to search at Google (or use the toolbar).What do you take away from this stuff? I have two ideas... 1) I am designing my next site for 1024x768, and 2) I am going to the \"Top 50 Internet Advertisers\" list to pick up some generic affiliate program ideas. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "For Statistics Hounds"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "For Statistics Hounds"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "EGOL\n          \n            EGOL"
}