{
  "url": "https://moz.com/blog/formatting-for-the-keyword-difficulty-tool",
  "slug": "formatting-for-the-keyword-difficulty-tool",
  "title": "Formatting for the Keyword Difficulty Tool - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When SEOmoz launched the Keyword Difficulty Tool I think we were all impressed with the reports that it was able to spit out. For me having all the data in one place was very useful except for when I tried to share it. At the moment the only way to share it is by exporting it as a .csv and then it…",
  "content": "Formatting for the Keyword Difficulty Tool Video J By: Jordan Judson July 28, 2011 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! J By: Jordan Judson July 28, 2011 Formatting for the Keyword Difficulty Tool Video This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. The Only Downside to SEOmoz's Keyword Difficulty Tool When SEOmoz launched the Keyword Difficulty Tool I think we were all impressed with the reports that it was able to spit out. For me having all the data in one place was very useful except for when I tried to share it. At the moment the only way to share it is by exporting it as a .csv and then it just becomes a block of data. It is very difficult to follow without losing yourself. The simple solution is to add your own formatting which I did. I gave the spreadsheet all the formatting I knew how to so that it looks similar to the version of the report viewed in the browser. There are conditional formatting rules so that the site with the highest Page Authority, mozRank, ect. will have a darker background, bigger and bolded text. After I finished it and thought that I worked out all the kinks I decided to make a post here and make it available to anyone else who hates staring at blocks of data and doesn't like spending the time to format it themselves. Implement it on Your Own Report Download the spread sheet. Open Office Excel Open the spreadsheet (obviously), select the whole sheet (ctrl+A), copy it all (ctrl+C) Next download your report as a .csv and open it with Excel/Open Office Select the whole sheet Right click and \"Paste Special\" Make Sure that only the formats box is checked so you don't overwrite your data and then paste it I hope everyone finds this to be useful tool for sharing these reports, at least that is until another option is available. Maybe we will have the option to export those as a PDF down the road. Final Note Unfortunately Google Docs does not support functions in their conditional formatting rules yet so the only thing you can do is to give it some background colors for now. Here it is in Google Docs if anyone is interested. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Formatting for the Keyword Difficulty Tool"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Formatting for the Keyword Difficulty Tool"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H3",
      "text": "How to Create the Most Basic Google Business Profile Video with Canva, Even If You’re Not Great At This Stuff!"
    },
    {
      "level": "H3",
      "text": "On-page Video SEO – Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jordan Judson\n          \n            Jordan Judson"
}