{
  "url": "https://moz.com/blog/fortune-interactive-sem-logic",
  "slug": "fortune-interactive-sem-logic",
  "title": "Fortune Interactive & SEM Logic - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I'm fascinated by this SEM Logic software. It sounds like something we've been trying to get working for months:\n\nResearch from the fields of Information ...",
  "content": "Fortune Interactive & SEM Logic Public Relations By: Rand Fishkin December 15, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 15, 2005 Fortune Interactive & SEM Logic Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I'm fascinated by this SEM Logic software. It sounds like something we've been trying to get working for months: Research from the fields of Information Theory and Machine Learning (AI) is being applied to the way SEs index their databases. The technology used is based on the concept of Latent Semantic Indexing (LSI)... LSI considers documents that have many words in common to be semantically close, and ones with few words in common to be semantically distant.... The determination of how relevant your content is to a search phrase is no longer just about how well you use your key phrases: keyword effectiveness index (KEI), keyword density, and keyword positioning on your pages. It involves a complex mathematical relationship between words on yours and other pages that a process with artificial intelligence determines are important enough to reveal what those pages “mean.” This sounds to me like SEM Logic is technology that uses some sort of map of the term vector space by having access to a search engine sized index. If so, I'm totally impressed. I think I'm gonna ask for a demo, because this sounds too cool to be true. I'll let you know what they say... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Fortune Interactive & SEM Logic"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Fortune Interactive & SEM Logic"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}