{
  "url": "https://moz.com/blog/four-ads-on-top-the-wait-is-over",
  "slug": "four-ads-on-top-the-wait-is-over",
  "title": "Four Ads on Top: The Wait Is Over - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In the past 2 weeks, Google AdWords top ad blocks with 4 ads jumped from 1% to 36%, and right-column ads have disappeared entirely (moving to the bottom-left position).",
  "content": "Four Ads on Top: The Wait Is Over Search Engines | Paid Search Marketing (PPC) By: Dr. Peter J. Meyers February 19, 2016 Table of Contents Copied! By: Dr. Peter J. Meyers February 19, 2016 Four Ads on Top: The Wait Is Over Search Engines | Paid Search Marketing (PPC) Note: This article has been updated with current graphs and data as of February 23, 2016. For the past couple of months, Google has been testing SERPs with 4 ads at the top of the page (previously, the top ad block had 1–3 ads), leading to a ton of speculation in the PPC community. Across the MozCast data set, 4 ads accounted for only about 1% of SERPs with top ads (which matches testing protocol, historically), until about 2 weeks ago: On the morning of February 18, the percentage of top ads blocks displaying 4 ads jumped to 18.9%. As of this morning (February 23), that percentage has jumped again, to 36.4%. Of the 5,980 page-1 SERPs in our tracking data that displayed top ads this morning, here’s how the ad count currently breaks down: As you can see, 4-ad blocks have overtaken 2-ad and 3-ad blocks and now account for over one-third of all top ad blocks. Keep in mind that this situation is highly dynamic and will continue to change over time. Sample SERPs & keywordsThe 4-ad blocks look the same as other, recent top ad blocks, with the exception of the fourth listing. Here’s one for “used cars,” localized to the Chicago area: Here’s another example, from an equally competitive search, “laptops”: As you can see, the ads continue to carry rich features, including site-links and location enhancements. Other examples of high-volume searches that showed 4 top ads in this morning’s data include: “royal caribbean” “car insurance” “smartphone” “netbook” “medicare” “job search” “crm” “global warming” “cruises” “bridesmaid dresses” Please note that our data set tends toward commercial queries, so it’s likely that our percentages of occurrence are higher than the total population of searches. Public statements from Google are suggesting that 4-ad blocks are only occurring on highly commercial searches, but we're seeing some exceptions (here's one for \"child abuse\"): Pardon a controversial example, but I think we can all agree that this search is not highly commercial. Ad counts shift regularly, even between viewings by the same users, but other non-commercial phrases that showed 4 ads in our data set include: \"global warming,\" \"bible verses,\" and \"habitat for humanity\". Disappearance of right-column adsIn line with Google's public statements this week, we’ve seen another shift — right-hand column ads started shifting to the bottom-left position and then disappeared completely as of this morning (February 23). This is a 30-day graph for the occurrence of right-hand ads and bottom ads in our data set: The disappearance of right-column ads correlates almost perfectly with the jump in 4-ad blocks at the top of the page. Google has now confirmed both changes via multiple sources (see The SEM Post, Search Engine Land). It's worth noting that, even with the substantial jump in 4-ad blocks, the right-hand column historically contained up to 8 ads, so this shift represents an overall drop in ad positions. Across the 10,000 searches in the MozCast data set, ads now max out at 7 per page, with a total ad count of 25,755. As of February 16, there were up to 11 ads on a page (3 top + 8 side) and a total count of 43,740 ads. While top ads are more prominent, Google has take an overall 41.1% drop in AdWords ads in our data set across the past week. Where is Google headed?We can only speculate at this point, but there are a couple of changes that have been coming for a while. First, Google has made a public and measurable move toward mobile-first design. Since mobile doesn’t support the right-hand column, Google may be trying to standardize the advertising ecosystem across devices. Second, many new right-hand elements have popped up in the last couple of years, including Knowledge Panels and paid shopping blocks (PLAs). These entities push right-hand column ads down, sometimes even below the fold. At the same time, Knowledge Panels have begun to integrate with niche advertising in verticals including hotels, movies, music, and even some consumer electronics and other products. This is a volatile situation and the numbers are likely to change over the coming days and weeks. I’ll try to update this post with any major changes. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Four Ads on Top: The Wait Is Over"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Four Ads on Top: The Wait Is Over"
    },
    {
      "level": "H2",
      "text": "Sample SERPs & keywords"
    },
    {
      "level": "H2",
      "text": "Disappearance of right-column ads"
    },
    {
      "level": "H2",
      "text": "Where is Google headed?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}