{
  "url": "https://moz.com/blog/four-creative-link-building-tactics-whiteboard-friday",
  "slug": "four-creative-link-building-tactics-whiteboard-friday",
  "title": "Four Creative Link Building Tactics - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In this week's Whiteboard Friday Rand Fishkin clues you in on four link building tactics that you likely haven't heard about. Given the importance of link building to SEO, this video should prove to be worth its (virtual) weight in gold. (I mean that in the best possible way ;-p)...",
  "content": "Four Creative Link Building Tactics Whiteboard Friday By: Aaron Wheeler September 2, 2010 Table of Contents Copied! By: Aaron Wheeler September 2, 2010 Four Creative Link Building Tactics Whiteboard Friday In this week's Whiteboard Friday Rand Fishkin clues you in on four link building tactics that you likely haven't heard about. Given the importance of link building to SEO, this video should prove to be worth its (virtual) weight in gold. (I mean that in the best possible way ;-p) Video Transcription Hey, SEOmoz fans! Welcome to another edition of Whiteboard Friday. Today we're talking about link building and specifically four tactics that are relatively creative, not talked about a ton in the SEO sphere, that can help you get some direct links to virtually any kind of site. Let's start with number one up here, giving testimonials. I know this sounds a little odd. You're thinking to yourself, \"Wait, I'm a marketer. I should be trying to get testimonials about my product, my service, my company.\" But in fact, give and you shall receive. So in this case, if are you are a site owner and you have a business and you say nice things about a product that you use, products that you like, free web apps, tools on the webs, blogs, resources, whatever it might be, or specific products or companies, and you email them and say, \"Hey, I just wanted to let you know, I really like your service. I enjoy using it. If you'd like to use this as a testimonial, feel free.\" You can say some nice words and then have a, \"My name is Rand Fishkin and I am the CEO of SEOmoz.\" When they publish that, they will take it and put it on their GoodProduct.com website, and you can see that gets embedded right into their site and it will link back over to your site. So, it is a great way to build up a repertoire of contacts, build good relations, and do something nice for the people who are doing something nice for you. I would definitely not do this disingenuously. Make sure that you are actually recommending things that you would recommend to a real friend. It will come back and bite you otherwise. But if you do this, you can get those great links too. The second one, design galleries. This is an odd case because you do have to jump through some hoops. If you can contract some of those exceptional, high quality, CSS and web design folks to build a really great looking site, something that looks nothing like this horrific drawing. I don't even know why I put so many boxes and lines. I am sure there was a reason. You can get featured on sites like CSS REMIX or Drawer or CSS Gallery. If you do a search for CSS galleries, in fact, you will find literally hundreds in the first few hundred results of places where you can get a live link pointing back from those pages just by submitting your site and having a site that looks great. Now, what I would recommend is that before you go through the design process make sure that you visit a lot of these places and get inspired. See what makes it. See what is hot right now. Those designs have the added benefit of being often very good for users. Using CSS properly means that you're loading pages, you are keeping code and design separate. It can often increase your rate of attracting links as well. Linking and quality of design are a direct relationship. As the quality of design rises, so too does the likelihood that people of all kinds, not just design galleries but of all kinds, will link to your site. They'll find you more credible. They'll want to show you off. They'll want to share. This is a great investment both for the direct links you can get and for the future. Number three. This is sort of an interesting one. Thanks to sites out there like HARO, which is Help a Reporter Out, and a few others, I think PR Newswire runs one as well, you can be a press source simply by combing through databases or lists of people who say, \"Hey, I am a reporter in need of a story about a business that keeps dogs in their office and what the impact of having dogs around is. Can we interview you, show off your business?\" Those stories when they get written about, they might appear in sources as big as \"The New York Times\" or as small as your local newspaper, but they appear online as well. When they do, that link will point back to your site giving you a link from a nice press resource, which is a great place to get a link. Number four, the last one here, turning raw numbers into a data story. I like this a lot because the idea here is that people produce a lot of interesting data about virtually every industry, but they don't always do great things with that data. They'll produce interesting numbers or numbers that seem boring on their surface but can be used in interesting ways. It is up to you to be creative about, hmm, okay, comScore published this, Nielsen published that, Forrester published this data research. If I combine some of those numbers or if I think about how they play out, I can come up with a great story and maybe some cool graphics too about what that means. I can take some of the data over time and build a story about what's happening. I can show that data next to something like Google Trends data or Search Insights data or data from a second or third source. When I combine those, I have great link and media bait. The nice thing about producing this is it is not just sort of classic link bait where, \"Oh, that's interesting, I want to share that.\" But it is interesting because when you are the reference resource for the data, everyone else who writes about the story or who wants to share it has to link back to you. A good example of this, check out www.seomoz.org/dp/free-charts and you'll see a bunch of places where we have taken data from great folks like Eightfold Logic used to be Enquisite, comScore, Hitwise, Nielsen, Forrester, and we've combined them into unique and interesting ways to view that data. We didn't even do much with it, just showed sort of, \"Hey, they said that 30% of searches come from Europe and 40% come from Asia, etc., so we're going to build a pie chart of that that looks great and people can embed that.\" Now when they do, they link back to SEOmoz and have the source in there. We'll always say what the original source is too. But by hosting this stuff and creating it, you get all these great links. All right everyone, I hope we have helped out your link building efforts here today. I look forward to the discussion in the comments. We will see you again next week for another edition of Whiteboard Friday. Take care. Video transcription by SpeechPad.com If you have any other advice that you think is worth sharing, please post it in the comments! This post is very much a work in progress. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Four Creative Link Building Tactics"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Four Creative Link Building Tactics"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Aaron Wheeler\n          \n            Aaron Wheeler\n          \n            Aaron Wheeler"
}