{
  "url": "https://moz.com/blog/fractl-leveraged-content-marketing-for-referral-traffic",
  "slug": "fractl-leveraged-content-marketing-for-referral-traffic",
  "title": "How Fractl Leveraged Content Marketing to Increase its Referral Traffic 6,718% - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Increase your traffic, leads, and conversions with content marketing. Kelsey Libert shares the inside scoop on the techniques that contributed to Fractl's success.",
  "content": "How Fractl Leveraged Content Marketing to Increase its Referral Traffic 6,718% Content Marketing | Link Building By: Kelsey Libert April 16, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Kelsey Libert April 16, 2015 How Fractl Leveraged Content Marketing to Increase its Referral Traffic 6,718% Content Marketing | Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In October 2013, Fractl published a study on viral emotions on the Harvard Business Review. The research was picked up by several high-authority publishers, catapulted our brand's authority, increased our brand awareness, and drove dozens of qualified leads. To our expectation, we proved that our client-facing, research-driven content marketing strategy could have the same long-term impact on our own brand. Then, we were off to the races. In early 2014, we launched a survey of more than 500 top-tier publishers. Then, we released a study analyzing 2.6 billion social shares. By November 2014, we joined forces with influencer marketing tool BuzzStream. To date, we've launched more than 10 industry research–driven marketing campaigns, earning more than 180 pickups and 45,000 social shares. The bottom-line impact? Fractl's referral traffic grew 6,718%, its total site traffic grew 4,396%, and its contact list grew 1,900%. Of course, this strategy wasn't launched without lessons along the way; here is what I learned:I. Don't limit large-scale campaigns with narrow-scope ideas Content marketing can be leveraged in every stage of the buying cycle. The biggest mistake most marketers make is choosing a single idea that is too narrow and therefore limits their reach. The second mistake marketers make is thinking that a single campaign will be the silver bullet that increases every KPI they're tracking. The third mistake they make is not developing a diverse content strategy that educates consumers in different stages of the buying cycle. The best content marketing strategies focus on developing a long-term strategy for both on-site and off-site content with a diverse content calendar that includes a variety of campaigns to target every stage of the buying cycle: Viral Campaigns - The idea is tangentially related to a brand, has a broad reach, and leverages a strong emotional hook to encourage hyper-accelerated sharing and traffic. Conversion-Driven Campaigns - The idea is hyper-targeted to a specific audience that is ready or nearly ready to purchase. Awareness Campaigns - The broad-scope idea designed to increase exposure to the brand and attract and engage consumers who are at the top of the sales funnel. On-Site Content - The multipurpose content is designed to build the brand and engage with the target market. When we first launched our co-branded strategy with BuzzStream, their tool was widely known as an influencer marketing CRM. Naturally, the team wanted to focus on ideas that would help educate their user base in influencer marketing tactics. Thus, the following campaigns were born: 21 Tips for Pitching Publishers and Writing Exceptional Subject Lines - ProBlogger Publisher Pet Peeves - PR Daily The PR Guide to Media & Blogger Personalities - Social Media Explorer These narrow-scope ideas spoke to a highly targeted audience, allowing us to secure pickups on authoritative niche marketing blogs. However, by focusing on a narrow idea (e.g. pitching publishers), we also limited our ability to reach larger top-tier publishers who prefer to cover digital marketing as a whole (e.g. content creation and consumption). By limiting our outreach to niche industry blogs, we also limited our ability to reach c-suite executives who were not yet aware of the benefits of influencer marketing and likely read the larger sites (e.g. Adweek) that spoke to the strategies they're currently using (e.g. traditional PR). In January 2015, we revamped our co-branded strategy to speak to a larger audience: Why People Unfollow Brands on Social Media - Adweek The Emotion of Sound - The Next Web Social Popularity by Content Type - HubSpot In doing so, we further developed our content calendar by creating conversion-driven on-site content while simultaneously leveraging our large-scope awareness campaigns to speak to a broad audience of marketers. After we had enough data to go off of, we reevaluated our co-branded marketing mix and came up with the following options for our content calendar: Several months into our partnership, we found that our optional content mix was Option 1, which allowed us to: Build one awareness campaign and one large-scope campaign, which enabled us to secure both top-tier placements and niche-industry placements Offer a gated asset that created the opportunity to convert people into future costumers Create on-site content that served to improve keyword rankings and offered evergreen content for people to engage with Your content mix may be different depending on the KPIs you're hoping to achieve and how aggressive you want to be with your marketing. PRO TIP: If you're a new brand looking for significant growth, develop an aggressive viral content strategy like Rehabs.com. If you're an established brand looking to grow loyalty and engagement, develop awareness campaigns, conversion campaigns, and an on-site content strategy like eBay.com. II. Heavy research earns more press than knowledge curation Now that you understand the importance of a diverse content strategy, how do you develop campaigns that earn highly coveted top-tier pickups? You give publishers what they want. When we surveyed 500 top-tier publishers, we found a whopping 39% want campaigns that feature exclusive research. In the beginning of our co-branded strategy, we cast a wide net of ideas that centered around heavy research, data curation, and knowledge curation. As new campaigns launched, we tracked their performance by the number of pickups, domain authority, and social shares. Three months into production, we were able to analyze our results and continue to refine our strategy. The pie chart on the right shows all of our campaigns divided into a category of heavy research, data curation, and knowledge curation. The chart on the left sorts all of our campaigns based on performance by social engagement, which has a high correlation to links. Lo and behold, our publisher survey results rung true: The level of success of our co-branded campaigns had a high correlation with heavy research–based ideas. Takeaways Heavy research-based campaigns have the highest engagement and syndication, because they bring something new to the table. Data curation has medium engagement, because it's an even split between unearthing new findings and publishing data that might be assumed. Knowledge curation has the lowest engagement, because this data can become widely known as the industry ages and becomes more saturated. So, now that we know publishers and audiences want more research, how do we give it to them?III. Primary research can be either qualitative or quantitative, but we've found more success with quantitative research In our publisher survey, writers wanted to see more data-driven articles, infographics, and mixed-media pieces, followed closely by data visualizations, images, videos, and interactive maps. What did publishers want the least of? Press releases, interactive projects, quizzes, flipbooks, widgets, and badges. While articles might do well with qualitative results, most of the other top-ranked content formats require a type of data visualization that is most valuable when it features quantifiable results. PRO TIP: Before you begin campaign production, base your ideation on the specific publishers you want your campaigns to be published on. Find out what resonates with those publishers using tools like Buzzsumo, and then pitch those ideas to those editors before you ever develop your campaign. Having publisher buy-in early on in the process guarantees a placement for your campaign, and it allows you to work with the publisher to give them exactly what they want. What better way to build a long-term, mutually beneficial relationship? Now, before you run off to generate campaign ideas, it's important to leverage certain tools to evaluate topic engagement on the sites you want to target. Some of my favorite tools include: BuzzSumo.com Inbound.org GrowthHackers.com Reddit.com/r/bigseo When it comes to developing primary research, a survey can be one of the easiest and quickest ways to garner new data. Crowdflower.com, SurveyMonkey.com, and Amazon Mechanical Turk are some of the most popular survey tools for developing your primary research. Average survey payments range from 20–50 cents, based on the length of the survey. Always time yourself taking the survey, and then try offering 5 cents per minute. PRO TIP: An authoritative sample size is no less than 300 respondents, though most top-tier sites prefer a sample size greater than 1,000 respondents. Submit surveys to reddit.com/r/hitsworthturkingfor for additional hits. If you're running a survey, the majority of your questions should have responses based on a scale, versus straight \"yes/no\" answers. This allows you to curate more data to analyze and achieve a more accurate response. If you want to go the route of data curation, there are dozens of public and paid APIs that allow you to unearth data in your field. Some of our favorite data sources include: Google Dataset Search Wolfram-Alpha Google News Google Trends BuzzSumo Reddit U.S. National Library of Medicine (NIH) CIA World Factbook U.S. Bureau of Labor Statistics U.S. Census Bureau Science.gov National Criminal Justice Reference Service Google Scholar Microsoft Academic Search WorldCat Libraries Librarians' Internet Index Think outside the box when coming up with your data visualizations; static infographics are quickly becoming saturated. Try a new format, like any of these examples I pulled from Fractl's portfolio: WebGL Parallax Motion Graphic Video Gifs Perspective IG Interactive Infographic Map Visual Article Flip book HTML5 Animated Graph Now that you've finalized your perfect research-based campaign, how else can you optimize it to increase your core metrics?IV. Gated assets create a value-add and incentivize people to give you their information When we launched our first marketing campaign, we didn't have a formal strategy for capturing our engagement and converting it in our sales funnel. While we'd get a mention for Fractl in all of our write-ups, we weren't offering any incentive for people to actually visit our website. PRO TIP: Read our content marketing strategy guide to learn how to use SEO and content to increase your customers. See what I did there? Creating a white paper, eBook, list, or any other gated asset that adds value to your original research creates an incentive for people to go back to your website and continue engaging with your brand. By gating the asset, you enable your team to capture the contact's information and further nurture them in your sales funnel. If you're conducting research, a best practice is to save at least a quarter of your findings to be featured in your gated asset. Make it explicit in your guest posts that there is more information for people to learn about if they click through. For example, below you'll see the call to action in our Contently post, which led to the gated asset for our research on 2.6 billion shares. While you should include a call to action for your gated asset in the intro text, you should also include it on all of your graphic assets that could potentially be further syndicated without proper attribution. Word of caution: By putting your content behind a gate, you're asking your audience to trust you with their personal information. If you betray a users trust, the damage to your brand can be severe and lasting. Be smart about how you use gated content and what you collect: Beneath your form, create a subscription box that allows people to opt-in to receive your future research. Only email the people who opt in, and only email them with what they opted into. Get granular with your options allowing people to choose the specific research topics they want to receive from your brand. Email frequency and engagement are negatively correlated, so limit your number of email blasts based on individual campaign engagement and overall audience engagement. Collect the bare minimum information you need on your forms, such as name and email address. Then, use smart fields to collect more data from people who are consistently engaging with your brand. Simplify your landing page to tell the user within the first five seconds: what the offer is; the value and why they want to download it; exactly what you want them to do. As you set up your landing pages, another thing you need to consider is optimizing the permalink structure for Google rankings. Matt Cutts says it's best to use 3–5 words in the slug of your permalink, for example: Bad: research.frac.tl/a-study-on-two-billion-shares-reveals-which-publishers-dominate-social-media Good: research.frac.tl/publisher-engagement-analysis Since your word count is limited, you'll want to cut any superfluous words such as \"and.\" Don't forget to do some keyword research to determine which 3–5 words you should use based on traffic data. Obviously you want to go after the words that have the largest traffic, but also evaluate for long-tail opportunities.V. Learning which publishers drive the most qualified lead flow is critical to your success While our coverage on the Harvard Business Review built our authority, the website's visit-to-contact-conversion ratio hovered at a low 9%. Meanwhile, targeted industry sites converted at an average rate of 25-45%, with some gold stars in the 60-90% range. PRO TIP: While top-tier pickups expand your brand's reach and build its authority, niche marketing blogs have a higher contact conversion ratio since their audience is already primed with the benefits of content marketing. So, how do you ensure that your publisher pickups drive brand awareness and convert leads? You develop audience personas. Audience personas are a characterization of your businesses ideal customer. Creating these personas forces you to consider what your customers value, what they hope to achieve, what they fear, and much more. By putting yourself in the shoes of your prospects, you can begin to get a sense for where they get their news and which blogs they might read—allowing you to improve your pitch targeting for brand awareness and conversions. Most people recommend creating 3-5 audience personas, which should outline an individual's: Job Title Roles Goals Challenges Age Gender Income Education Location Story Common objections Elevator pitch You can start to create these personas by: Evaluating your current customers and their differences and commonalities Vetting your social media following for your average or most engaged followers Assessing your past customer inquires and what made a qualified lead versus an unqualified lead Discussing the ideal client with your sales team or other qualified team members Once you have a list of your customer personas, you can begin evaluating where these people might hang out online. Use Buzzsumo's influencer tool to search for people in similar job functions to your audience personas. Then, use the \"view links shared\" option to get a sense of where your personas might be hanging out, too: PRO TIP: Don't limit yourself by only developing personas for your ideal client. Developing personas for unqualified leads allows you to determine which people and publishers you want to avoid, as well. If you want to increase your traffic, leads, and conversions, content marketing is one of the easiest, fastest, and most cost-effective methods to organically earn your core metrics. What other tips do you have for leveraging content marketing for sales? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Fractl Leveraged Content Marketing to Increase its Referral Traffic 6,718%"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Fractl Leveraged Content Marketing to Increase its Referral Traffic 6,718%"
    },
    {
      "level": "H2",
      "text": "I. Don't limit large-scale campaigns with narrow-scope ideas"
    },
    {
      "level": "H2",
      "text": "II. Heavy research earns more press than knowledge curation"
    },
    {
      "level": "H2",
      "text": "III. Primary research can be either qualitative or quantitative, but we've found more success with quantitative research"
    },
    {
      "level": "H2",
      "text": "IV. Gated assets create a value-add and incentivize people to give you their information"
    },
    {
      "level": "H2",
      "text": "V. Learning which publishers drive the most qualified lead flow is critical to your success"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kelsey Libert\n          \n            Kelsey Libert\n          \n            Kelsey Libert"
}