{
  "url": "https://moz.com/blog/free-linkbait-idea-on-web-analytics",
  "slug": "free-linkbait-idea-on-web-analytics",
  "title": "Free Linkbait Idea on Web Analytics - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Someone on the web must want the 50,000 visitors and 10,000 links this article would provide, and I'm too swamped. Here's the idea:\n\n    Compare 5-10 of the top web analytics suites on 2-3 websites over the course of one month\n    Analyze the data, compare them against each other, rate them on…",
  "content": "Free Linkbait Idea on Web Analytics Link Building By: Rand Fishkin November 7, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 7, 2006 Free Linkbait Idea on Web Analytics Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Someone on the web must want the 50,000 visitors and 10,000 links this article would provide, and I'm too swamped. Here's the idea: Compare 5-10 of the top web analytics suites on 2-3 websites over the course of one month Analyze the data, compare them against each other, rate them on ease-of-use, pricing, service, accuracy and features Write up an article, call it \"Visitor Tracking Accuracy: 10 Web Analytics Tools Compared\" - you'll probably get enough links and anchor text to rank well for several high profile, high visibility search terms Tell us about it and we'll post it on SEOmoz and help you get \"Dugg\" Seriously, I'm desperate for something like this, not just for myself, but for lots of clients who are crying out. Who shall answer the call? OK - second part of this post - if you've had great experiences or bad experiences with analytics programs, please share. Feel free to link to any articles or posts that you think are highly relevant, too. I'm on a mission this afternoon :) p.s. I'm particularly interested if anyone's found a good solution that you can buy and host on your own server. Lag issues dictate that this is a \"must-have\" for a couple of our clients. p.p.s. I promise to return to the land of the value-based blogging soon, rather than making the comments do all the work - it's just been one of those weeks... maybe because we're missing Rebecca. :( Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Free Linkbait Idea on Web Analytics"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Free Linkbait Idea on Web Analytics"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}