{
  "url": "https://moz.com/blog/free-php-script-for-download-wheres-it-rank",
  "slug": "free-php-script-for-download-wheres-it-rank",
  "title": "Free PHP Script for Download: \"Where's it Rank?\" - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I needed a tool that quickly tells me what page of search results a URL ranks on for a specific keyword.   It didn't need any advanced features or complicated options, just something where if I was visiting a page I could hit a button and instantly find out where it ranks for a keyword.  I threw…",
  "content": "Free PHP Script for Download: \"Where's it Rank?\" SEO Tools O By: Oatmeal March 28, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! O By: Oatmeal March 28, 2007 Free PHP Script for Download: \"Where's it Rank?\" SEO Tools The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Script PHP gratuit pour savoir votre rang Google I needed a tool that quickly tells me what page of search results a URL ranks on at Google for a specific keyword. It didn't need any advanced features or complicated options, just something where if I was visiting a page I could hit a button and instantly find out where it ranks for a keyword. I threw together a quick PHP script that does exactly this, including a browser button so I can have a Where's it rank?\" link in my firefox toobar. This script certainly doesn't do anything phenomenal (it took me about an hour to write), but I thought I'd offer the source code for download to SEOmoz readers anyway. This isn't intended to be one of our official SEO tools, it's just something I thought I'd share in case there was someone out there with a similar need. Live Example (no longer active) - Where's it Rank? Download Source: https://moz.com/files/scripts/whererank-source.txt Installation is simple: upload the file to a folder on your webserver that executes PHP and give it a .php extension. I know there's a whole host of features this script could have that it doesn't, such as returning results from .co.uk or searching engines other than Google, but that's partially why I offered up the source code. I figured if you needed a very specific feature you could download the source and muck with it yourself. If you use the script on your site a link back is always appreciated, if not that's cool too. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Free PHP Script for Download: \"Where's it Rank?\""
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Free PHP Script for Download: \"Where's it Rank?\""
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Oatmeal\n          \n            Oatmeal"
}