{
  "url": "https://moz.com/blog/free-seo-advice-marketing-tips-for-the-music-industry",
  "slug": "free-seo-advice-marketing-tips-for-the-music-industry",
  "title": "Free SEO Advice & Marketing Tips for the Music Industry - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Music is one of the most popular forms of entertainment and one of the most traded digital assets on the planet. Ever since Napster's debut in 1999 musicians, record labels and the RIAA have all singled out file sharing as the overwhelming source for loss of revenue in record sales. I have always…",
  "content": "Free SEO Advice & Marketing Tips for the Music Industry SEO Basics J By: Joe Youngblood March 27, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! J By: Joe Youngblood March 27, 2012 Free SEO Advice & Marketing Tips for the Music Industry SEO Basics This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Music is one of the most popular forms of entertainment and one of the most traded digital assets on the planet. Ever since Napster's debut in 1999 musicians, record labels and the RIAA have all singled out file sharing as the overwhelming source for loss of revenue in record sales. I have always wondered why they get to point all of these crazy fingers without highlighting how absolutely awful they are at marketing their products on the Internet – not to mention how little they seem to care about the revenue they lose to their own horribleness. Lyrics A massive volume of searches related to music are for song lyrics. For you kids, back in the old days, records, cassette tapes and CD’s came with lyrics to each song included on the album’s liner notes. So, when you finally scraped together $10-$20 to buy an album, you also got some great artwork and the lyrics to every song. You could confidently sing along to your favorites while in the shower, in your car, or just to annoy your coworkers. After the explosion of MP3 files, web users turned to the Internet to find lyrics. However, today it is still rare for an artist’s official website to contain any lyrics to any of their own songs. As perplexing as that might sound to the savvy folks reading this, it gets much worse. Fig. 1 - example of a search for lyrics on Google. A web user searching for lyrics will find them on one of many websites. Since these websites are not official, they gain revenue and profit from the plethora of advertising with which they surround the lyrics. These ads can often be misleading and take users to websites purporting to give away the song for free, perpetuating the very problem the record industry claims is killing them. Fig. 2 - a lyrics website displays an advertisement for free music downloads above an artist's lyrics To highlight this issue I looked at one of my current favorite bands, The Black Keys. The first thing I did was picked out their top three most recognized songs and looked up their exact-match search volume with Google Adwords Keyword tool. To get a better idea of the search volume I looked at three variations of a likely search to find the lyrics for each song: Howling for You, Lonely Boy and Tighten Up. What I found was that, according to Google's tool, each month these variations get 31,960 exact searches. That's 11,460 more people than the capacity of FC Dallas Stadium in Frisco, Texas, where The Black Keys will be headlining a concert in April. For just three songs and nine search phrases, that comes out to 383,520 searches per year (likely declining the older the song gets), or 1/3 of a million chances to engage fans with concert dates, merchandise and other music. Fig. 3 - exact match searches for the lyrics of \"lonely boy\", \"tighten up\" and \"howlin for you\" Music Videos and Music Streaming I remember reading a news article once that stated just how much an artist had to pay to create a music video and then get it slotted in prime viewing time on MTV. This was, of course, before MTV turned teenagers into pregnant-whining-Snooki impersonators. Music videos allow artist to engage music lovers with a visually appealing representation of their music, which helps spread the word and win record sales, both digital and physical. The videos also help get music fans to part with their cash (and routines) and go out to concerts. Music labels and artists are terrible at marketing with their videos on the Internet. The DMCA states that web streams, like web radio, are an “interactive service,” and therefore they cannot play music upon a listener’s demand. Think about that. If you went to Shoutcast, picked a station, and requested a song, you would have to wait one hour for it to play. The DMCA also states that you can only play the same song from an album after an hour gap – and no more than three songs from the same artist or box set in a row. This is a chief complaint among internet radio users. These rules came directly from record labels' lobbying efforts concerned that Internet users would simply record the album from an Internet radio station and never buy it. If you just rolled your eyes, then you are one of the millions of people who go to YouTube and listen to a song by an artist, only to be shown the entire catalog of that artist's works when the video is done playing. You may have even seen official playlists – created by a music label, sometimes! – containing nothing but videos of one artist or album. You can listen to as many songs as you want, on demand, in a row. As long as the label doesn't complain to YouTube, these stay up. It's the record labels’ way of giving us free music. Fig. 4 - a screen capture of keepvid.com downloading videos and music for free from YouTube The most astute web users know they can usually record a music video or find it in their temp files. But it doesn't take a lot of computer know-how to get an MP3, or even the entire HD version of your favorite song, for free from YouTube. Services like Keepvid.com and SnipMP3.com allow access to all of the versions of a video converted on YouTube. Typically that means 240p, 360p and 480p FLV, 480p, 720p, 1080p HD MP4, and 360p, 480p and 720p WebM – and also extracting a standard quality MP3 audio file from the video. So, to put this in perspective, recording artists and record labels attack online streaming radio stations where a listener is interested in a broad category of music like rock, dub step or hip-hop, but allow and encourage the free downloading of their creative works via YouTube/Vevo where the fan has specific intent on just one artist and/or song. Fig. 5 - shoutcast radio stations and pandora encourage music buying and don't allow music to be downloaded. Oh, just wait, record labels get even worse. Just like with lyrics, recording artists are not taking full advantage of the power of their music videos. Most artists, just like The Black Keys, are content to upload their videos to YouTube/Vevo and a few other major websites, letting their music entice people to share it around and these sites promote it. When a web user performs a search for the video, then, they land on YouTube or Vevo – not on the artist’s website. Again, this decreases opportunities to engage fans, who are seeking your content; with tour, merchandise, and music information. Fig. 6 - universal video search appearing at p1 and leaving out the artist's website. An artist or label, like The Black Keys, might have a videos page on their website, or even a separate page for each video with correct title tag, search engine friendly URL structure, and some content. However, as you can see in the SERPs image above, The Black Keys’ own website doesn't show up in top rankings for a search for their music video “Lonely Boy.” That’s because a query with ‘video’ (singular only) seems to pull Google’s Universal Video results in at position #1 in a large majority of searches. The Black Keys website doesn't have a video sitemap or use any markup like Facebook Open Graph or Schema.org to help tell engines and social websites that this is a video page. The result is that, when their site finally shows up in SERPs for a song, it shows up with the main videos page and not the specific page for that song. Finally, we have the issue of encouraging and utilizing user generated content (UGC) to promote your musical brand. The Black Keys, along with artists like Tech N9ne and Blink 182, do a great job of allowing their fans to create videos using their music. However, we have yet to see UGC utilized in music video production on a large scale. There are multiple types of music videos created by fans to help promote an artist’s music including anime music videos, game music videos, fan animation videos, lyric videos, cover loop videos, sing along videos, etc. Find communities and encourage your fans to create their own versions of your music videos, like this one – a close-up of The Black Keys ‘Lonely Boy’ playing on a vinyl record player. Your Own Website The last thing that musicians and labels do that completely drives me insane is mishandling and under-utilizing their own websites. Aside from the issues above – a lack of content that fans want, directing users to other websites, and doing a terrible job of search optimizing their own content – there are several other often repeated problems. The first is the “song preview.” Back to my Black Keys example, the band published their video on MTV, Vimeo and YouTube (kudos for not just using YouTube). The same video appears embedded from YouTube on their website. It’s full length, however, if you land on their Discography page, you can only listen to a short sample of the song. Really? I am not making this up, go look for yourself. Even more perplexing is how hard it is to purchase a song or album after sampling it. I can listen, then find the navigation link to the store, then navigate to music, then I can … OK, I can't buy the song. Thanks for the teaser. Even more confusing, Tour pages typically have a link straight to the “buy tickets” page. Musician websites most often overuse Flash, Quicktime, Silverlight or other proprietary plugins to display content. This limits the ability for users on iPhones, or browsers without plugins installed, to view the content. While this can keep some users from enjoying content, there are other ways that once on a musicians website users can get distracted. The most prominent being the over usage of social media pushing. I get it, you want to engage with users in social media. If I really like you I might follow you on Twitter when I see the follow button, Like you on Facebook, + you on Google+ or hug you on superintenselyfriendlysocialnetwork.com, but when your users are on your website - THEY ARE ALREADY ENGAGING WITH YOU. Your website should engage back. Finally – you were waiting for finally, I know – artist's websites, including The Black Keys, violate several other SEO best practices like good, flat internal linking structures, publishing sitemaps, and providing descriptive alt and image title tags on all images. Fig. 7 - an example of how alt tags are being used on the artist \"the black keys\" website. Bands, solo artists and record labels – the Internet is what you make of it, and you make it wonderful with your music, but terrible with your SEO and marketing practices. Before you keep blaming mythical huge losses on internet sharing, please fix your own online marketing efforts. You stand to make billions. The Free Marketing Tips Lyrics Put them on your own website. You can try putting them on your Facebook page. Surround them with sales info for tours, songs, albums and merchandise. Music Videos and Music Streaming Embrace all video platforms, not just one or two. Promote your music through streaming web radio stations. Encourage and utilize user generated music videos, unleash the creativity of your fans. Place videos on your website, using a new page for each song. Create a video sitemap. Your Website Stop using song previews on sales pages when your song is free to listen to on other websites. Provide ability to purchase or links to purchase location for songs and albums. Stop overusing Flash, Silverlight and other plugin content display software. Instead make a visually stunning site that all browsers / web users can see and interface with that has text based links and text content. Publish a sitemap.xml file. Create a flat internal linking structure with anchor text. Use correct Title tags on your pages. Use descriptive alt and title tags on your images. Don't over push your social networks. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Free SEO Advice & Marketing Tips for the Music Industry"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Free SEO Advice & Marketing Tips for the Music Industry"
    },
    {
      "level": "H2",
      "text": "Lyrics"
    },
    {
      "level": "H2",
      "text": "Music Videos and Music Streaming"
    },
    {
      "level": "H2",
      "text": "Your Own Website"
    },
    {
      "level": "H2",
      "text": "The Free Marketing Tips"
    },
    {
      "level": "H3",
      "text": "Lyrics"
    },
    {
      "level": "H3",
      "text": "Music Videos and Music Streaming"
    },
    {
      "level": "H3",
      "text": "Your Website"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Joe Youngblood\n          \n            Joe Youngblood\n          \n            Joe Youngblood"
}