{
  "url": "https://moz.com/blog/free-google-tools-for-seo",
  "slug": "free-google-tools-for-seo",
  "title": "5 Free Google Tools to Upgrade Your SEO Strategy - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If you’re just getting started or lack the budget necessary for fancy tools, there are still many resources available. In this piece, we’re going to cover five of our favorite FREE Google tools, and how they can help you step up your SEO game.",
  "content": "5 Free Google Tools to Upgrade Your SEO Strategy SEO Tools | SEO Basics By: Brie E Anderson May 24, 2021 Table of Contents Copied! By: Brie E Anderson May 24, 2021 5 Free Google Tools to Upgrade Your SEO Strategy SEO Tools | SEO Basics There's plenty of room for paid tools in the SEO space — Moz is a prime example — but if you’re just getting started or lack the budget necessary for fancy tools, there are still many resources available. In this piece, we’re going to cover five of our favorite FREE Google tools, and how they can help you step up your SEO game. 1. Google Trends Google Trends is used to track the “trends” around search queries. This makes it a great tool for keyword research. Finding new keywords When you go to Google Trends, you’ll see a search bar where you can input a broad topic or specific search query. Upon entering your query, you’ll be presented with a trend chart of interest in the query over time. While this may be useful, the real gems are at the bottom of the page: Related Topics and Related Queries. By default, these boxes will both be set to “rising.” This means that these topics and queries are currently gaining traction. These are the keywords that you may want to capitalize on quickly, as you could be a first-mover and gain rankings quickly. Advanced keyword research Even at a base-level, Google Trends is helpful, but you can always take it a step further. Across the top of Google Trends, there is a menu that allows you to specify a region, time period, category, and search platforms. Region allows you to determine where you want to pull search data from geographically. This can be especially useful when working on local SEO projects. Category allows you to select the category you’re competing in. This is a nice feature for people who offer a service in a specific industry, or who have a query that’s extremely common. Search platform allows you to refine the data to specific platforms such as YouTube Search, Image Search, Google Shopping Search, and News Search. Search platform modifiers are great for those with an integrated SEO plan. 2. Rising Retail Categories Though it’s almost impossible to predict what the Next Big Thing is going to be in e-commerce, you can still stay on top of the game with Rising Retail Categories. This is Google’s compilation of data on retail. On it, you’ll find currently trending product categories and the searches around them, as well as where exactly they're trending. As an e-commerce SEO, this can give you a good idea of which products to focus on for the most potential impact. As an enterprise local SEO, you can use this data to determine which products to focus on in each market. 3. Visual Stories Google summarizes Visual Stories as “Bite-size visual stories for busy marketers, driven by trending topics and data from Google.” These stories range from holiday shopping trends to specific industry case studies, and more. They're interactive slides, each with a few insights or data points. For example, there's a Visual Story about the automotive industry. Throughout the story, there are data points shared to give insight into how the pandemic has affected the car-buying process. These data points don’t just focus on search data, though. It’s clear that this has been a full-on case study by Google. Some insights shared address the desires, experiences, and perceptions of the audience. This information can easily be used to change the user journey, including the things that matter to the customer earlier on. It could also be used to address pain points that hadn’t been previously uncovered, or, on a more basic level, give an SEO an idea of what keywords to focus on. 4. Grow My Store Grow My Store is a fantastic tool for those selling a product either online or in person. Grow My Store tests sites for Google Identifiers for Successful Online Stores. These identifiers are broken down into five categories: Product Information, Store Details, Personalization, Customer Service, and Security. This tool literally hands over Google’s idea of the must-haves for a product-selling business website. Some of the components included are product reviews, profiles for shoppers, live chat, and HTTPS. To use Grow My Store, you simply answer three questions: what is your domain, what type of business do you have, and what industry are you in? Once you answer the questions, you will see a preview of your report with your overall score and some data around your industry. To get your full report complete with recommendations, you have to create an account. The report is then sent to your email. You then get an account where you can create (and track) a checklist of changes that need to be made — according to Google. In addition, you’ll get customized data and insights based on your industry. To find this data on Grow My Store, in the menu, select “Reach More Customers.” If you scroll down a bit, you’ll find a section with the heading “Understanding industry trends.” Here you’ll be able to choose your industry and specific category to get specific information such as top searches in that industry, top months for the industry, and so on. 5. Test My Site Another great tool for measuring your site in the eyes of Google is Test My Site. Much like Grow My Store, Test My Site tests for three very specific categories of features on your site. These features are Speed, Personalization, and Experience. Unlike Grow My Store, Test My Site is for any website, not just product-base business sites. The first report you will get from Test My Site is a mini report that breaks down your mobile site speed and any recommendations for fixes. There is also a tool to show the potential ROI of speeding up your site! Talk about buy-in. If you want even more information, which you will, you can sign up to get the full report. The full report is emailed to you and breaks down recommendations and explanations for both marketers and developers. The report I got back was 16 pages long, filled with links to other resources and case studies as well as tactical tips in the form of a checklist. In conclusion While Google can often be cryptic about what they care about on websites, they’ve created quite a few resources that can give you insight into what they find important. Using these tools can easily get you a step ahead. It’s not just about the tools, though. In 2021, data is more important than ever, and who better to get data from than The Giant themselves? Now, go forth and be excellent — using free stuff! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "5 Free Google Tools to Upgrade Your SEO Strategy"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "5 Free Google Tools to Upgrade Your SEO Strategy"
    },
    {
      "level": "H2",
      "text": "1. Google Trends"
    },
    {
      "level": "H3",
      "text": "Finding new keywords"
    },
    {
      "level": "H3",
      "text": "Advanced keyword research"
    },
    {
      "level": "H2",
      "text": "2. Rising Retail Categories"
    },
    {
      "level": "H2",
      "text": "3. Visual Stories"
    },
    {
      "level": "H2",
      "text": "4. Grow My Store"
    },
    {
      "level": "H2",
      "text": "5. Test My Site"
    },
    {
      "level": "H2",
      "text": "In conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Brie E Anderson\n          \n            Brie E Anderson\n          \n            Brie E Anderson"
}