{
  "url": "https://moz.com/blog/from-twitter-with-love",
  "slug": "from-twitter-with-love",
  "title": "From Twitter with Love: The Ultimate Romantic Linkbait - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Will and Rand would never miss an opportunity for linkbait.\nI take an inside look at how Will's wedding panned out online.",
  "content": "From Twitter with Love: The Ultimate Romantic Linkbait SEO Events By: Rob Ousbey September 17, 2008 Table of Contents Copied! By: Rob Ousbey September 17, 2008 From Twitter with Love: The Ultimate Romantic Linkbait SEO Events When Rand Fishkin managed to get engaged and generate hundreds of links at the same time, he realised that there might just be something in this RomanceBait idea. Since the partnership between SEOmoz and Distilled began, ideas had been floated for creating new linkbait along similar lines. After a late-night brainstorm, the concept of having almost simultaneous weddings on either side of the Atlantic moved into planning stages. No doubt those from the SEOmoz HQ are planning a post about how it went down in Oregon, so here's a quick roundup of the online side of the wedding here in Scotland. (For the benefit of Americans who've never had a chance to visit, Scotland comprises of 30,000 square miles of heather-covered hills and two thousand castles; the main hobbies are drinking whisky and haggis hunting.) Live Twittering from the Groom allowed people all over the world to follow the day's proceedings. During the day, the Distilled blog carried regular photo updates, alongside guest posts by the Registrar, the Bride's father and others; these ranged from entertaining, to enlightening, to poignant. StumbleUpon and Reddit sent a reasonable amount of traffic throughout the afternoon (click to enlarge): The organic traffic drawn by the weekend's blog posts highlights the importance of unexpected long-tail searches. Later in the evening, the speech by Best Man Duncan Morris put to rest the myth that he'd met when they played basketball together. An intrigued audience did what they could to find out more, pushing the event firmly into the Hot Trends list (click to enlarge). Of course, this post is set in an alternate reality. No one's that addicted to linkbait, right? Congratulations to Will and Heather, Rand and Geraldine. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "From Twitter with Love: The Ultimate Romantic Linkbait"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "From Twitter with Love: The Ultimate Romantic Linkbait"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rob Ousbey\n          \n            Rob Ousbey"
}