{
  "url": "https://moz.com/blog/from-keywords-to-contexts-the-new-query-model",
  "slug": "from-keywords-to-contexts-the-new-query-model",
  "title": "From Keywords to Contexts: the New Query Model - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Gone are the days when a search query simply involved a string of words. Today's queries include all sorts of implicit data — location, device, etc. — that add to the search engines' understanding of what searchers really wanted to find. That fact has some very real implications for the way we…",
  "content": "From Keywords to Contexts: the New Query Model Search Engines By: Tom Anthony August 26, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Tom Anthony August 26, 2013 From Keywords to Contexts: the New Query Model Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As SEOs we talk a lot about \"search queries\" (or simply \"searches\"), yet I think search has outgrown our definition of what exactly a search query is. In this post I'm going to explain how I think the old definition is fast becoming less and less useful to us, and also how I believe this is going to mean we're going to talk about keywords less and less. Traditional query model I recently spoke at Kahenacon in Israel about the evolution of search (deck), where I discussed four trends I identified that were influencing the changes I expect to see in search over the next 3-4 years. I noticed that there was a common theme that kept coming up amongst them: Our understanding of what we mean when we say \"query\" has become too narrow. The traditional query model is the one where a search query looks like this: This is the keyword-focused model we have always used, and it has served us well for two decades. However, things are changing, and I think we are already at a point where thinking of a search query in this way is inadequate. First, let's examine things from Google's perspective. They want to understand the users intent when they did this search: what the expectation of the user is, what they are looking for, and more specifically, what search results would best help answer their query. Some questions Google might ask about the \"london tube stations\" query: Is this a schoolchild looking for a history of the tube stations for some homework? Is this someone looking for a list of all the tube station names (we have a fair amount of drinking games in the UK based on these names)? Is this someone looking for a tube station? etc. There are clearly lots more possible situations, and it is quite hard to determine what the user wants. However, the keyword(s) I type in are not the entire query; they are not everything Google has to go on in order to answer this query. It actually looks more like this to Google: The query consists of the keywords that we explicitly typed in, but also the implicit portion of our request based on our context. With this information, it suddenly becomes a lot easier to determine what the user is likely looking for and what types of response will best help them. Furthermore, my example above only gives me a 3-4 extra data points (location, device, potentially a guess at connection type from IP address and connection speed). However, Google are using a lot more signals than that (at least 57 if you aren't logged in), so I imagine the implicit aspect of the query probably contains a lot more. New query model I don't think there is a scenario where Google is not using an implicit aspect to a query — even if we put aside things such as language and which version of Google you are using. There are multiple facets to what is covered by this implicit search (see the next section on context), but the main takeaway is that the search results are always dependent on some implicit aspects. Therefore, I think we need to adjust our understanding of what a query is. After some discussion in the Distilled office, our initial proposal is relatively simple: If we accept my premise, then it is hard to move backwards from this realisation of what a query actually is. However, a good question at this point might be: does it actually change anything? Before I try to answer that, let me first try to make sure we are all understanding what I mean when I say context. Context: the source of the implicit query We've talked a lot about ‘mobile search' and ‘personalised search' over the last few years in the SEO community. However, I believe both of these phrases are too narrow: Mobile search: This has traditionally referred to the device that I'm using, but that is clearly misleading. More and more people are searching on their smartphones from their houses. People are using tablets and ultrabooks on the move. Mobile search should talk about the person and their state (staying still or on the move). However, it doesn't cover every aspect of their state (are they walking or driving, are they at work or play, etc.) — so we need something broader. Personalised search: A couple of years ago we fought personalised search, doing things like manipulating the Google query string to try to disable it, as we wanted to know what the \"real results\" were. However, I think a wave of acceptance is washing over the community as we realise that concept is in our rear view mirror. However, personalised search is only partially responsible for that. When we talk about personalised search, the common understanding of it points to a user's preferences (determined by social connections, search history etc.). To me this causes confusion — if I run the same search at a different time of the day at a different location, I get different results. Both are personalised, but personalisation doesn't capture nearly every aspect of why my search results are different in each case. Beyond these two examples I imagine there are a whole host of other facets that are responsible for the customisation of the search results. I've begun calling all of these various aspects \"context.\" Context encapsulates both mobile and personalisation, and a whole host of other signals (including those that Google has yet to discover/begin using). The implicit-aspect of queries comes from the users' context, so these two concepts are completely intertwined. I expect that we are going to continue to see more and more context signals being used to drive richer and more detailed implicit-aspects to queries. Just a couple of months ago at Google's I/O conference they announced this new Android API: It allows anyone writing an app for Android to ask the phone whether it believes the user is walking, cycling, or driving. I can certainly imagine this being part of the implicit query — a good example being a restaurant search, which might cover a larger radius if I'm in a car than if I am on foot. Furthermore, earlier this year Google acquired Behavio, the team behind funf, the \"Social and Behavioural Sensing Framework.\" This framework basically tries to predict what a user will be doing next based on the current and past states of various sensors on their phone (which wifi networks they've connected to at what times, social proximity, etc.). Imagine a prediction of what you'll be doing next as part of the context of a search. It sounds crazy, yet in some aspects we are already there. Implicit-only searches When Google was founded, Sergey and Larry dreamed of a world where there was no search query at all: He was talking about having no explicit query, and we are rapidly reaching a situation where such searches are a reality; many people report fantastic results from Google Now, where the query is entirely context-based: What does this mean for keywords? For as long as there has been web search engines, there has been SEO, and for as long as there has been SEO, there has been a focus on keywords. I believe we are at a transition point wherein the next 2-3 years is going to see a declining focus on keywords. Imagine the absurdity a couple of years ago if a small-restaurant owner said he wanted to be in position 1 (or even page 1) for the terms \"restaurant\" or \"breakfast.\" Sure, there are local results, but actually ranking in the \"main\" results is silly! Then along came the Venice update (post via Mike Ramsay) and suddenly that didn't seem so silly. (Will Critchlow recalls how a 'breakfast' search worked great for him in this Distilled Live video.) Now it is possible for small companies to rank for things like \"restaurant,\" or the \"divorce attorney\" from Mike's post, but only within certain limited contexts. There are a couple of other points of consideration around the future of keywords: The move towards the knowledge graph, entity searches, and Google's associated shift from indexing to understanding. The move from \"web search\" to \"contextual search\" (think Google Glass and Siri). (not provided) is on the rise, and we're rapidly losing keyword data anyway. I did cover some of this stuff in the deck, and it is outside of the scope of this post. However, I will likely be talking about this at SearchLove London in October, and likely writing more about it over the coming months, as I think think the combination of these things means we are going to look back on 2013 and 2014 as an inflection point for search. So, you're saying keywords aren't important? Not quite. As long as people are doing language-driven searches (be it text or spoken word) — which is going to be for some time to come — keywords are obviously going to be important. What the user explicitly enters as part of their search query is clearly always going to be important. What I'm saying (in this post) is that we need to stop looking at keywords and starting looking at queries — which are nowadays so much more than just the keywords. A query will have explicit and implicit aspects, and the explicit aspect could be a chain of several keywords and additional metadata. In addition, the move from indexing to understanding (not really covered in this post — see the Distilled Live video and my deck) means that even putting aside the above point, the link between the keywords that the user types in and the keyword(s) Google for which shows listings is no longer as direct as it once was. As Google comes to understand the entities involved, the link becomes far more complex; we'll see some benefits (stop worrying about synonyms and long tail) and some downsides (Google won't grasp all entities and relationships perfectly). Finally, the keywords your users are typing in can be really insightful to understand what their intent is — what they really want. This is a point made by AJ Kohn in his recent post on keywords. So, then... what does this mean for doing SEO? That is an excellent question, and I'll start by saying I certainly don't have all of the answers to this. I'm mostly writing this post as this is something we've been talking about at Distilled, but I would really love to hear from the Moz community about your thoughts around this and what you guys think it could mean. A few initial thoughts: When you are looking at traffic in your analytics, broken down by keywords, you need to bear in mind that there was likely a variety of contexts involved (for any specific keyword, but also across keywords). Working out what contexts you are performing well in is going to be something that is going to be increasingly valuable. We need to begin working out the \"context personas\" that we think we can serve with our pages; there are users in a variety of different situations and we need to identify how their intents differ and how we can best serve them. In the near future, this might include having landing pages targeting contexts (or intents) rather than keywords. The way we report to our clients (or management) needs to begin to change in some instances. Reporting on raw keywords is going to potentially become less and less worthwhile, and we need to start educating our clients now such that they understand this shift. Final words I imagine there are potentially going to be some people who rise up to defend keywords, but please realise I'm not saying keywords are dead — just that they no longer give the full picture. I think that Google is going to increasingly consider context, and we should begin working out how we can work that into our understanding. Whether you agree/disagree or have a slightly different idea of how we should model this, I'd love to hear your thoughts in the comments below. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "From Keywords to Contexts: the New Query Model"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "From Keywords to Contexts: the New Query Model"
    },
    {
      "level": "H2",
      "text": "Traditional query model"
    },
    {
      "level": "H2",
      "text": "New query model"
    },
    {
      "level": "H2",
      "text": "Context: the source of the implicit query"
    },
    {
      "level": "H2",
      "text": "Implicit-only searches"
    },
    {
      "level": "H2",
      "text": "What does this mean for keywords?"
    },
    {
      "level": "H2",
      "text": "So, you're saying keywords aren't important?"
    },
    {
      "level": "H2",
      "text": "So, then... what does this mean for doing SEO?"
    },
    {
      "level": "H2",
      "text": "Final words"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Tom Anthony\n          \n            Tom Anthony\n          \n            Tom Anthony"
}