{
  "url": "https://moz.com/blog/from-disaster-to-triumph-how-to-recover-from-an-algorithmic-penalty",
  "slug": "from-disaster-to-triumph-how-to-recover-from-an-algorithmic-penalty",
  "title": "From Disaster to Triumph: How to Recover from an Algorithmic Penalty - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We recently helped one of our clients recover from an algorithmic penalty and they have kindly allowed us to share his case study with everyone as a cautionary tale.",
  "content": "From Disaster to Triumph: How to Recover from an Algorithmic Penalty Technical SEO By: Jonathan Guy September 23, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Jonathan Guy September 23, 2013 From Disaster to Triumph: How to Recover from an Algorithmic Penalty Technical SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. We recently helped one of our clients recover from an algorithmic penalty and they have kindly allowed us to share his case study with everyone as a cautionary tale. Background Aqueous Digital started working with Limos North West at the end of 2011 at which point they arrived at our door with a nice site but an awful backlink profile. They had over 120,000 links to their site and all of them were pointing to the home page. Not only that but the previous SEO Company was threatening to 'destroy the site' by removing all the links they had built. Our advice was that they should let them remove the links even though the previous firm had assured them that this would virtually obliterate their site. We established quite early on that the strategy employed by the previous firm had been trying to get the home page to rank for all the different keywords in a range of different locations by buying in thousands of backlinks. Of course, this had left the client with a hugely confusing website, a backlink profile that was stuffed with cheap links heavily weighted with exact match anchor text and all pointing to the home page. It was obvious that this strategy was never going to work. We started by working with the client on establishing their core proposition and then spent some considerable time working with them to create effective on page content to try to provide a more viable and engaging user experience. Situation The problems started in May 2013 when we received a call from the client telling us that his site had been hacked. After cleaning it once then finding the hacker had gotten back in overnight, the decision was made to rebuild the site which we did over the next few days. Fast forward two weeks to June 2013 and the site had been migrated to a new platform and rebuilt, adding more content and integrating a blog with automatic feeds to social media. We were all set to spring forward with a Digital Marketing plan when once again disaster struck. Our client was looking for a company to write new blog posts for all of the areas to incorporate into the newly built site. They typed in the search engines the key word they believed would deliver the best solution for this new project and found another SEO firm who assured them that they were good. After all this firm were number one for SEO + [GEO] (we won’t tell you where they are based, we’re not like that…) and they were told by this SEO firm that they had a ‘sure fire’ way of making sure that their site would be at number one for every location in a thirty mile radius. Not only that but they could do it for an incredible low, low price. So with the guarantee of number one position everywhere and a low price, what could possibly go wrong? Naturally we advised against this but agreed that if they wanted to do it we would track and measure everything so that we could detail the success or otherwise at a later date. So, sure enough, a week later we got a call advising that the firm had done their stuff and if we checked we would find them at number one for a whole range of locations. The Problem As promised, the site did start to rank immediately for a whole range of geographical locations but our tracking software spotted a problem and it wasn’t long before got the phone call confirming this. We had already checked the work and we were disappointed to find that the SEO firm had simply used a badly written page of content, probably spun but definitely outsourced to a writer whose native language was not English. Into this page, the geographical location had been inserted so every page was identical apart from the name of the town. The problems with this were many but we summarised them as follows; The page was badly written and unlikely to generate an enquiry as the user experience was awful Every page was identical apart from the town name They had used a stock list of town names with no thought to how these related to the local geography Google was unsure which page to rank in some locations, and left to its own devices it had replaced a well written existing page with the newly spun page as it was ‘fresh content’ All the new pages went live on the same day. Now we generally advise clients to create good well-targeted local pages where appropriate but we go to lengths to make sure that they at least contain a sales message and would encourage people to ring them. Even if the content is identical other than the town name, the pages can work but you can’t build an entire strategy on this. In this case, the poor page quality was compounded by the fact that over 200 pages were spun and set live in just eight minutes. For a site which adds a new page a month at best for the past twelve months to suddenly add on another 200 pages is bound to ring an alarm bell, and sure enough it did. By the time we got the phone call and ran the AWR tracking report this was the sight we could see. Not only had Google penalised the new pages that had been added on but it had also penalised every other page on the site. Steady page one rankings for the core keywords that drive business week in week out had disappeared to page three or below in most cases and overnight the phone stopped ringing. With nothing coming in the firm switched on PPC and of course, inevitably, some enquiries started to arrive but not to the normal levels, plus of course they were costing a significant amount to generate. We’re always amazed at how firms with penalties can still advertise with Adwords. The site isn’t good enough for search but is good enough for advertising….. We needed to establish quickly what had gone wrong and although we thought we already knew what the problems were we needed to be sure the issue had been caused by the algorithm. Crucially we could see that this penalty was algorithmic as; There were no warnings in Webmaster Tools The drop was immediate and site wide (oddly enough apart from one solitary geo page which stayed at number one throughout this whole episode..) Both Yahoo and Bing continued to rank the site highly at their normal levels Armed with this knowledge we could now set about fixing the problems that had been caused. The Solution Faced with a site which had been hit so hard we worked closely with the team at Limos North West to find a solution and agreed on the following; Remove all the new pages and 301 redirect the URLs to the home page Investigate the backlink profile and make sure that there were no bad links in there which could have caused an issue If we found bad links to remove them (if we could) and create a disavow links file for the remainder To execute the original marketing plan and become instantly more effective on the blog and social media Work on the ‘offline’ Marketing plan (yes folks, sometimes people don’t use Google!) Removing the offending geo pages was a pain but was done quite quickly however a dive into the backlinks using Open Site Explorer and Majestic SEO identified a number of poorly spun articles with links in them and a whole range of historic domains which had been built years before but only now had become, or would shortly become, an issue. Accordingly we tried to remove as many links as we could but then we created a disavow links file with over 350 domains on it which was duly uploaded to Google. We also made sure that the good work we had done with the client over the previous months, such as making sure that the city pages were properly targeted and had well-written, engaging content that did aim to convert customers, not just the same boilerplate information copied across. We wanted these pages to be the ones that ranked (again) not the highly spun pages. Of course, the problem is that with an algorithmic penalty you can never be 100% certain what tipped it over to penalty, but the only way to recover is to look at all the possibilities and to try and cover them off. Once the site was clean and we had uploaded the disavow links file we then resubmitted the sitemap and asked Google to recrawl the site. The result, a week later was this; a sea of green. Not only has the site recovered, but in many cases the pages were back to their previous positions or in one or two cases higher. Four weeks on and the focus has been on making sure that we keep active with proper marketing activities and any links that arrive on the site are therefore earned rather than built. We have also worked with the client on making sure that they create good content that will engage with their target audience. The upshot of all the activity is neatly summed up in the nice graph from the lovely Panguin Tool which overlays the natural search traffic against a backdrop of Google updates. Summary As we write this today the site still ranks for most of its core keywords but in one or two cases it is now a position or two lower. This may be a residual effect from the penalty or it could be down to disavowing so many links from so many domains; either way the nett effect is that we are slightly worse off today than we were eight weeks ago but there are signs that the site is recovering and traffic is starting to climb back towards normal levels. We are heartened though by the fact that Google still hasn’t sorted out the algorithm properly and in some of the locations a national operator is currently occupying the top two or in some cases three places. Google hasn’t got rid of the problem of multiple entries for some sites in the first page of the listings but we’re confident that it will finally get round to eliminating this and giving a better user experience to end users. Ironically, some sites that sit atop the listings have some of the thinnest on page content and worst user experience of any or all of the other operators but they are there by virtue of the site weight, which is founded on backlinks, but does nothing to add to end user experience. We’re really hopeful that this will change in the near future if for no other reason than to give end users a chance of finding what they are looking for. So, whilst being hit by an algorithmic penalty will be painful and expensive, it needn’t be the end for your site. If you can take swift and decisive action, you can recover and regain your previous positions. Key Take Aways Algorithmic penalties typically come with no warning, simply a dramatic loss of keyword positions in the SERPS. Comparison with other Search Engines will identify if it is a ‘Google’ or a ‘Site’ issue. If you have received a penalty then consider what you have done recently to cause this. Start by removing or undoing any recent work that Google doesn’t like but use the situation as an excuse to do a full ‘drains up’ of on and off site issues. Once you have cleaned up the situation, resubmit your sitemap and request a recrawl of the whole site. Don’t take short cuts with your Marketing. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "From Disaster to Triumph: How to Recover from an Algorithmic Penalty"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "From Disaster to Triumph: How to Recover from an Algorithmic Penalty"
    },
    {
      "level": "H2",
      "text": "Background"
    },
    {
      "level": "H2",
      "text": "Situation"
    },
    {
      "level": "H2",
      "text": "The Problem"
    },
    {
      "level": "H2",
      "text": "The Solution"
    },
    {
      "level": "H2",
      "text": "Summary"
    },
    {
      "level": "H2",
      "text": "Key Take Aways"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jonathan Guy\n          \n            Jonathan Guy"
}