{
  "url": "https://moz.com/blog/ftc-orders-value-click-to-pay-29-million",
  "slug": "ftc-orders-value-click-to-pay-29-million",
  "title": "FTC Orders ValueClick to Pay 2.9 Million - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The FTC announced today that Valueclick has agreed to pay 2.9 million dollars to settle the charges. This is the largest cash settlement since the inception of the Can-Spam Act in 2003. In addition, Valueclick is barred from future violations of the Can-Spam Act. It must also place conspicuous…",
  "content": "FTC Orders ValueClick to Pay 2.9 Million E-Commerce SEO By: Sarah Bird March 17, 2008 Table of Contents Copied! By: Sarah Bird March 17, 2008 FTC Orders ValueClick to Pay 2.9 Million E-Commerce SEO May It Please the Mozzers, We're keeping Legal Monday short and sweet to bring you this breaking news. As many of you know, Valueclick and its subsidiaries, Hi-Speed Media and E-Babylon, have been under investigation by the Federal Trade Commission (\"FTC\") for alleged violations of the Can-Spam Act and failure to protect consumer's sensitive information. (I've got to give a shout-out to Shoemoney for originally reporting on Valueclick's shady practices.) The Settlement The FTC announced today that Valueclick has agreed to pay 2.9 million dollars to settle the charges. This is the largest cash settlement since the inception of the Can-Spam Act in 2003. In addition, Valueclick is barred from future violations of the Can-Spam Act. It must also place conspicuous disclaimers indicating that consumers are required to participate and spend money on other obligations in order to qualify for \"free\" promotions. The settlement also requires them to provide a list of the obligations – such as applying for credit cards, purchasing products, or obtaining a car loan – that consumers must incur to qualify for a free product. Valueclick must also put in place strict measures to protect consumer information. Valueclick's compliance with these measure must be monitored by an independent party for 20 years. The Allegations According to allegations by the FTC, \"ValueClick subsidiary Hi-Speed Media used deceptive e-mails, banner ads, and pop-ups to drive consumers to its Web sites. The e-mails and online ads claimed that consumers were eligible for “free” gifts, including laptops, iPods, and high-value gift cards, and included come-ons such as “Free PS3 for survey,” and “CONGRATULATIONS! Select your FREE Plasma TV.”\" After being promised the sky, the consumers had to participate in a confusing assortment of expensive and burdensome third-party offers – including car loans and satellite television subscriptions. (Click here to download the Complaint and Exhibits from the FTC's site.) These deceptive practices amounted to violations of the CAN-SPAM Act and the FTC Act. According to the FTC, this is its third case targeting the use of deceptive promises of free merchandise by Internet-based “lead generation” operations, and the Commission’s 18th case challenging data security practices by a company handling sensitive consumer information. What does this mean for Valueclick? This news comes after last week's CNN report that Valueclick's stock fell to the lowest it had been in 52 weeks. Regardless, one has to wonder whether a 2.9 million dollar fine will make a dent on a company with reported revenue of 545.6 million, earnings of 62.6 million, and operating cashflow of 114.2 million. There has been regular speculation over the last year about whether Valueclick was going to be acquired. Perhaps Valueclick's current dip in value and the final resolution of the FTC investigation will make it a more attractive candidate to potential purchasers. Let's be on the watch, shall we? Don't be like Valueclick The FTC is being pretty aggressive in pursuit of Can-Spam and FTC Act violators. Make sure you know what's required of you. You can find out more about how to comply with Can-Spam at the FTC's site. They also have a spiffy tutorial on what you need to do to protect consumer information. I'm preparing a post on affiliate marketing coming soon. If you have any questions or concerns about the legal issues surrounding affiliate marketing, or if you're an affiliate marketer who has gotten in trouble for one reason or another, I would love to hear from you. Best Regards, Sarah P.S. Here's an interesting account of one marketer who later regretted using ValueClick. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "FTC Orders ValueClick to Pay 2.9 Million"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "FTC Orders ValueClick to Pay 2.9 Million"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Common Mistakes E-commerce Websites Make Using JavaScript"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sarah Bird\n          \n            Sarah Bird\n          \n            Sarah Bird"
}