{
  "url": "https://moz.com/blog/fulfill-customer-demand-through-faceted-navigation",
  "slug": "fulfill-customer-demand-through-faceted-navigation",
  "title": "Fulfill Untapped Customer Demands Through Your Faceted Navigation - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "By centering your secondary navigation on long-tail keyword opportunities, you’ll be able to strategically utilize consumer intent, secure additional web conversions, and boost revenue levels.",
  "content": "Fulfill Untapped Customer Demands Through Your Faceted Navigation Technical SEO | On-page SEO By: Vicky Golding July 8, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Vicky Golding July 8, 2021 Fulfill Untapped Customer Demands Through Your Faceted Navigation Technical SEO | On-page SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Faceted navigation allows customers to narrow down search results based on specific product attributes. They typically exist on Product Listing Pages (PLPs) and are a great way to help users intuitively discover products but managing this filtering system is a common SEO challenge. Crawling and indexation need to be controlled. However, if we look beyond their inherent functionality, facets can offer us considerable potential. By centering your secondary navigation on long-tail keyword opportunities, you’ll be able to strategically utilize consumer intent, secure additional web conversions, and boost revenue levels. Match consumer intent with long-tail search queries Having an established brand and a solid domain backlink profile won’t guarantee success. This is great news for smaller brands, as industry giants aren’t necessarily going to win at this game. If we search for “long sleeve wedding dresses”, we can see how David’s Bridal’s optimized facet page (Domain Authority: 67/100, Page Authority: 47 / 100) has obtained the top ranking position, while Nordstrom’s result (Domain Authority: 87/100, Page Authority: 39/100) appears in the third position for this particular query. We’ll take a look at what makes this page so effective later. When looking at how we can optimize faceted navigations, it’s important to recognize that product attributes convey consumer needs and aspirations. If, for example, I’m looking for a wedding dress, then I may tailor my search by the color, fabric, neckline shape, and the sleeve length. According to the search demand curve, long-tail queries account for up to 70% of all organic searches. They are highly targeted queries that offer big traffic-driving opportunities. In the last few years, we’ve seen a big shift in the industry towards capitalizing this intent with long-form content. Blog articles and style guides have become the go-to methods for many to capture these visitors, as we can see from the examples taken from Marks & Spencers’ \"Inspire Me\" section: People often look for inspiration when they’re shopping, and these pages provide an effective way to add more internal links to category and product pages. But relying on this approach is one-dimensional, given that these deeper content pages tend to have lower PageRank. An extensive amount of time and effort will, therefore, be required to achieve the desired result. In comparison, Product Listing Pages usually target broader search terms, and faceted navigations typically exist as passive functions. This is because they’re often blocked from crawlers, making them devoid of any SEO value. Waterstones (a well-known British bookstore) is one retailer that applies this rule for their on-page filters: In this particular example, I’ve applied a filter to only show me books for 5 – 8 year olds, but the appended URL (https://www.waterstones.com/category/childrens-teenage/facet/498) is blocked in the robots.txt file. This is going to prevent such pages from being served in the SERPs despite them having the potential to meet specific customer needs. This shows that there can be a fundamental disconnect in matching customer intent to the pages we’re providing them in the organic results. From the diagram below, we can see how editorial content typically focuses on the “awareness” and “interest” stages, whilst Product Listing Pages tend to be more in line with the “consideration” and “purchase” phases: Serving the right content to users throughout their buying journey is pivotal to success. For many retailers, competitors are continuing to prioritize broader, high-volume keywords in saturated markets. They’re targeting the same terms to secure a proportion of the same search traffic. This is a very challenging prospect to face, and without carving out a gap in the marketplace, they won’t necessarily deliver the results they seek to secure. Likewise, relying on informational guides to target long-tail keywords means that you’re missing a large percentage of users who have very specific buying requirements. Yes, they’re ready to make a purchase! By shifting your focus to address your customer’s real needs and expectations, you’ll be able to deliver a satisfying, frictionless experience at every interaction and all the way through to that final purchase. The solution Step 1: Conduct long-tail keyword research Build a really comprehensive view of your potential customers by harnessing data from a variety of sources, including: a) Keyword research tools like Moz, Google Keyword Planner, and Answer The Public. b) The SERPs — get inspiration from the auto-suggest results, People Also Ask, and the related search links at the bottom of the page. c) Competitor activity — aside from using SEO monitoring software, you can use a data mining extension tool like Scraper, which will extract faceted options directly from competitor Product Listing Pages. These tools are often free to download and allow you to quickly transfer product categories. d) Your Google Search Console, Analytics, and PPC accounts to determine which keywords and URLs are securing the highest number of visits and web conversions. Internal search data can also give you great consumer insights. e) Speak to your merchandising team to understand product demands and fulfillment capabilities. Step 2: Group into meaningful sub-topics Once you’ve collated all this information into a spreadsheet, you’ll be able to discover long-tail, consideration-orientated keywords. While individually they may not boast huge monthly search estimates, they can collectively highlight where purchase intentions can be better fulfilled. To help illustrate this point, we can look at a small subset of lingerie keywords and the facets the searches represent: From the table above we can quickly see a pattern emerging with color and material variations appearing across the search terms. We can then substantiate this information with session and revenue estimates with the use of a recognized CTR model. This enables us to help forecast the potential organic uplift and quantify the size of the prize for a number of different scenarios that are on offer from each new facet combination. This may include estimations for securing position 10, 7, 5, 3 and 1 in Google. One thing to note here is that it’s worth excluding synonyms, as they will falsely inflate your calculations. An example here would be to exclude “storage drawers” (22.2k monthly searchers) when reviewing the performance for “chest of drawers” (201k m/s). Including both variants will cause a false positive result and will lead you to draw incorrect conclusions. Step 3: Dig deeper into broader terms around offers, ratings, and price These product filters are found in the “Sort” dropdown box and, from my experience, these are set to “noindex” from the outset as they simply allow users to re-order page results. Certainly, content management systems like Shopify and Shopware have this as a default. This makes sense since their purpose is to allow visitors to simply sort or narrow page content rather than offering alternative results and additional value (which is offered through faceted navigation). As such, filter typically produce duplicate results which should not be discoverable beyond the immediate moment. But this hard-and-fast rule doesn’t always apply perfectly in the real world. This is why we need to look at our individual industries and understand what’s important to our unique set of customers. If we look at the world of gifting, we often see people shopping with a particular budget in mind. Therefore, terms like “birthday gift under £20” (40 m/s) or “Secret Santa gift under £10” (2.9k m/s) are reasonably common, and opening up relevant listing pages could be useful for shoppers. Step 4: The technical steps Facet taxonomies are hugely complex and the number of attributes that can be strung together increases with the size of the domain. We, therefore, need to carefully manage the flood gates and mitigate against any potential risks including crawl inefficiencies and link equity dilution. We can do this by: 1. Avoiding thin/doorway pages by regularly re-assessing your product offering. For instance, you may consider there to be little value in creating a new listings page if you’re selling a very small range of low price point products. In this case, you may decide against opening up an additional Product Listing Page when you sell as few as 10 eligible products. However, this is not a fixed rule, so it’s quite possible that your criteria may be lower for particular product lines. Either way, these numbers will change over time. Consider seasonal trends, when new collections are launched, and when they become discontinued. Setting up a product retirement strategy to manage expired products and categories at scale in parallel with this step is also highly recommended. 2. Prevent content cannibalization by arranging selected facets according to their value and significance. “Size” is very important for some electrical goods like TVs, laptops, and cameras, but is less so for beauty accessories or vacuum cleaners. You must also make sure page content is distinctive and reflects the focus of your chosen facet(s). Refer to step 5 for more details. 3. Follow the sequence in which adjectives and facets are typically selected by your customers. This can vary depending on where your audience lives. So, whilst products generally have five or more distinguishable features, English vernacular determines that we use more than four adjectives (e.g. size + color + material + shape) to describe something. 4. Control the controllables by dealing with overlapping variations. This typically occurs when multiples co-exist and each exhibits good search metrics. For instance, it’s reasonable for someone to simultaneously look for several color and/or fabric combinations in the different ways below. When this situation occurs, we should follow the same linguistic rules as above and choose a preferred sequence. In this case, it would be color + material + product type. In comparison to the noindex tag suggested for on-page filters you should canonicalize unnecessary facets to their parent page (remembering that this is merely a hint and not a directive). This will enable you to control how crawlers deal with highly comparable result pages and will, therefore, help to prevent your site from being demoted in the SERPs. Dynamic search parameters should continue to be defined with a “noindex, nofollow” meta robots tag, disallowed in the robots.txt file, and configured through Google’s URL parameter tool (within your Search Console account) to tell crawlers the purpose of your parameters and how you would like them to be treated. This is a helpful guide on parameter handling for Googlebots, but bear in mind that this last tip won’t influence how Bing or Yahoo user-agents interpret these pages. 5. Open your facets in phases and cultivate it into a test-and-learn process. This will enable you to identify issues a lot sooner and implement facet-wide solutions in a timely manner. Without having to unravel these additional layers of complexity, problems such as crawl inefficiencies, PageRank dilution, or excessive indexation can be swiftly resolved. To show you what this could look like, I’ve provided a phasing plan that was created for one of our e-commerce clients. Our research showed a significant SEO opportunity for opening up some of the facets and filters: potential +£263Kpcm for the “colour + type” facet (UK): What’s more, when we extended our forecast to include other facet combinations, we calculated an additional revenue opportunity of up to +£207K/pcm (before filtering out combinations with no products offering). Step 5: Optimize your facet URLs Optimize your new facet category URLs to establish relevancy for your selected search terms. The key on-page elements to focus on include: URLPage titleBreadcrumb anchor textsH tagsContent snippets (e.g. introductory text and FAQ copy)Image ALT textsProduct namesLink out to similar facet category pages (i.e. via a “You May Also Like” feature box) David’s Bridal is a good example of a retailer that has done this well. Looking back at the ‘Long Sleeve Wedding Dress’ Product Listing Page, we can see that they’ve curated unique content and followed fundamental optimization tactics on the landing page in a way that feels helpful to the user. URL: davidsbridal.com/long-sleeve-wedding-dresses Page Title: Long Sleeve Wedding Dresses & Gowns | David's Bridal Meta Description: Do you dream of wearing a long sleeve wedding dress on your big day? Shop David's Bridal wide variety of wedding gowns with sleeves in lace & other designs! 6. Provide accessibility and build page authority Once you’ve opened up your new facet Product Listing Pages, you need to begin cultivating link equity towards them. This will ensure that they don’t exist as orphan URLs with no PageRank: Ensure they’re referenced in your product XML sitemap.If you have one feature per facet URL, then add them to your faceted navigation across CLP and Product Listing Page pages.If you have two or more features per facet URL, then create a “Popular Searches” or “Related Searches” option within your CLPs. Utilize your mega menu to showcase your new category landing pages. This will not only allow you to direct a large proportion of link equity, but it will also secure the highest click-through rate amongst your visitors. Integrate your editorial strategy by creating engaging content with in-copy links. Think about how you can use descriptive long-tail anchor text about the Product Listing Page you want to link to rather than relying on “click here” or “see more”. Connect to them via href links so you’re not solely relying on links from the main navigation or content hyperlinks. As this is difficult to do at scale, it can be done through modules such as “related categories”, “other subcategories”, “related products”, etc.Devise strategic outreach campaigns that will secure quality, external backlinks to them. Implementing this holistic and robust strategy will help you to secure exponential growth from your new commercial landing pages. Conclusion There is a great deal of organic opportunity that exists within your faceted navigation if you begin to leverage mid- and long-tail search terms. Seek out the opportunity from extended keyword research and competitor analysis before deciding which variants fulfill consumer demands and deliver optimal organic sessions and onsite conversions. Configure a single faceted URL for each opportunity and open them up for crawl and indexation. Ensure PageRank is distributed to them (both internally and externally) and develop your landing page content in line with quality optimization practices. This approach will help you to avoid having crawl inefficiencies, over indexation, cannibalization, or having thin doorway pages. In turn, your website will be better suited to attract highly-targeted users and guide them down the purchase funnel. Maximizing UX and reducing reliance on other marketing channels means that your faceted navigation can truly deliver organic ROI. We have seen this work for our clients. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Fulfill Untapped Customer Demands Through Your Faceted Navigation"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Fulfill Untapped Customer Demands Through Your Faceted Navigation"
    },
    {
      "level": "H2",
      "text": "Match consumer intent with long-tail search queries"
    },
    {
      "level": "H2",
      "text": "The solution"
    },
    {
      "level": "H3",
      "text": "Step 1: Conduct long-tail keyword research"
    },
    {
      "level": "H3",
      "text": "Step 2: Group into meaningful sub-topics"
    },
    {
      "level": "H3",
      "text": "Step 3: Dig deeper into broader terms around offers, ratings, and price"
    },
    {
      "level": "H3",
      "text": "Step 4: The technical steps"
    },
    {
      "level": "H3",
      "text": "Step 5: Optimize your facet URLs"
    },
    {
      "level": "H3",
      "text": "6. Provide accessibility and build page authority"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Vicky Golding\n          \n            Vicky Golding\n          \n            Vicky Golding"
}