{
  "url": "https://moz.com/blog/fun-unlocked-mozcation-milwaukee-2012",
  "slug": "fun-unlocked-mozcation-milwaukee-2012",
  "title": "Fun Unlocked: #Mozcation Milwaukee 2012 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This past Wednesday, October 3rd, Moz invaded Milwaukee for a Mozcation. Our gratious host, Kyle Faber from Regal Creative helped set us up at that Harley Davidson Musuem and show us the best beer.",
  "content": "Fun Unlocked: #Mozcation Milwaukee 2012 Moz News By: Erica McGillivray October 5, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Erica McGillivray October 5, 2012 Fun Unlocked: #Mozcation Milwaukee 2012 Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This past Wednesday, October 3rd, Moz invaded Milwaukee for a Mozcation. Our gracious host, Kyle Faber from Regal Creative helped set us up at that Harley Davidson Musuem and show us the best beer. Here are some highlights: 1. Making New Friends! Mozzers are truly the best people in the world. We love the opportunity to meet with all of you. Whether we're talking shop or sampling local brews, we couldn't ask for better company. You rock! Seriously, the photos say it all. 2. The Amazing Presentations! First, we wouldn't have been anywhere without our wonderful emcee, Chiaryn Miranda, one of our Help Teamsters. She kept the event flowing. Brittan Bright Our first presenter of the night was iAcquire's Brittan Bright, Director of Client Strategy. Her talk, \"From Mess to Success: A Case Study of Cross Discipline Collaboration Done Right,\" showed how much more successful we can be when we work together. As an Account Director for Organic Search at Mindshare, Brittan's team was brought in to collaborate with BBH & Edelman to essentially pull of an Online Reputation Management (ORM) campaign to help the term \"Susan Glenn\" appear to be an organic internet cultural phenomena. Jamie Steven Next up was SEOmoz's Chief Marketing Office, Jamie Steven. His talk \"Technical Skills for Marketers\" launched his newest endeavor, Technical MKTG. There's been a lot of talk of roles like Growth Hackers, Marketing Ninjas and Technical Marketers in the past year; regardless of if you subscribe to these labels, technical marketing skills are becoming a requirement to be a successful in online marketing. The marketers who know SQL, can write code or use PivotTables in Excel will be the most desirable and productive individuals in our industry. Jamie discussed the technical skills every online marketer should be developing along with strategies and resources on how to get there. Luke Summerfield Kicking off our Milwaukee community speakers was Luke Summerfield, Inbound Marketing Specialist at Savvy Panda. With his talk, Mobile Search Skyrocketing? Let's Optimize and Capture!, he dug into mobile search exploding in popularity (growing x4 times since 2010). Additionally, Google predicts that in 2013 more people will use their mobile devices to get online than PC’s. It’s critical that businesses do not ignore this growing trend and act now to position themselves above their competition in SERPS and with usability. Luke explored some key techniques and ideas for optimizing for both mobile search and the mobile user experience. Victor Drover Up next, Victor Drover, Founder and CEO of Anything Digital, dove into \"How to SEO Optimize a CMS.\" He discussed the common SEO problems that many content management systems face and provide practical advice for the three most popular open source platforms, WordPress, Joomla, and Drupal. Tom Snyder Our final Milwaukee community speaker was Tom Snyder, Founder, President, and CEO of Trivera Interactive. His talk, \"How Social Media Impacts Your SEO,\" covered the latest updates to Google's Algorithms that base your SERP position on how much people like your site. Success in social media is based on how much people like you. Figuring out how to accomplish both provides you with a powerful combination to help both your SEO and social programs succeed. Rand Fishkin Last, but not latest, was our CEO, Rand Fishkin discussing \"The Big Picture of CRO.\" He dove into how just testing a button might not be your conversion rate optimization problem. There's a lot more factors when a user buys something from you or does what you want them to on your website. 3. Roger Learned to Ride a Motorcycle Mozcation Milwaukee took place at the Harley-Davidson Museum. So what better place to learn how to ride! (Poor Nick Sayers, who volunteered to join him.) If you missed out on the fun, we recorded it just for you! (Sadly, we had some technical issues and missed the first few minutes.) And there were a couple great wrap-up posts from the Milwaukee community: #Mozcation in Milwaukee – A Fantastic Success! by Kyle Faber What I Learned on SEO Mozcation in Milwaukee by Susan Spaight For those of you who are interested in bringing a #Mozcation to your town, check out what Kyle and his Milwaukee compatriots built to lobby for their town. And I'd suggest starting to build your city's efforts in anticipation of 2013 nominations! See you soon in your city, Mozzers. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Fun Unlocked: #Mozcation Milwaukee 2012"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Fun Unlocked: #Mozcation Milwaukee 2012"
    },
    {
      "level": "H2",
      "text": "1. Making New Friends!"
    },
    {
      "level": "H2",
      "text": "2. The Amazing Presentations!"
    },
    {
      "level": "H3",
      "text": "Brittan Bright"
    },
    {
      "level": "H3",
      "text": "Jamie Steven"
    },
    {
      "level": "H3",
      "text": "Luke Summerfield"
    },
    {
      "level": "H3",
      "text": "Victor Drover"
    },
    {
      "level": "H3",
      "text": "Tom Snyder"
    },
    {
      "level": "H3",
      "text": "Rand Fishkin"
    },
    {
      "level": "H2",
      "text": "3. Roger Learned to Ride a Motorcycle"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Erica McGillivray\n          \n            Erica McGillivray\n          \n            Erica McGillivray"
}