{
  "url": "https://moz.com/blog/future-of-content-upcoming-trends-in-2014",
  "slug": "future-of-content-upcoming-trends-in-2014",
  "title": "The Future of Content: Upcoming Trends in 2014 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "2014 will be an exciting time for the future of content. As technology evolves and competition for user attention increases, marketers need to be agile and adapt to the growing needs and expectations of their customers. Here are four specific trends to watch.",
  "content": "The Future of Content: Upcoming Trends in 2014 Content Marketing By: Stephanie Chang December 9, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Stephanie Chang December 9, 2013 The Future of Content: Upcoming Trends in 2014 Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. We've entered a fortuitous time to be involved in the digital marketing space. Almost half of the global population now has access to the internet, the way consumers consume content is rapidly evolving, and with that comes an exciting array of challenges and opportunities. This post specifically focuses on the trends that lay ahead for content marketers and the role they play within an organization. Having a concrete understanding of upcoming trends is important in laying the foundation for defining the content goals within an organization and deciding where resources should be allocated. Trend 1: Competition to gain consumers' attention will increase Posting new, unique content regularly on your site is NOT enough. Each day there are around 92,000 new articles posted on the internet. Digital media publishers have created systems to produce the greatest amount of content at the lowest price. For example, The Huffington Post produces at least 1,200 pieces of content a day, and Forbes produces 400 (with 1,000 contributors). It's not just from publishers; WordPress users produce about 35.8 million new posts each month. Image Credit Smaller businesses won't be able to compete based on sheer volume. So how can a site differentiate itself in this market? This is where the development of a content strategy can come into play. It's extremely helpful to understand a company's unique value proposition, and if the company doesn't have one, to understand where the opportunities are in the space to create one. For B2C companies, it can be identifying the company's existing target audience and promoting the brand as an advocate for a particular lifestyle. For B2B companies, it is often times about positioning your brand to be the ultimate authority or source of knowledge in a specific industry/niche. When developing a content strategy, it's important to evaluate the product that the business sells. Evaluating a product doesn't mean identifying the features or solely understanding the benefits of the product. It actually means understanding the marketability of the product. For instance, is the product a \"think\" product or a \"feel\" product? Does the product require high involvement or low involvement from the consumer? Using the FCB grid developed by Richard Vaughn is a useful tactic. A \"think\" product is one where a consumer heavily considers before purchasing. These type of products usually involve a high amount of research and personal effort by the consumer before purchasing. A \"feel\" product is one where emotion plays a pivotal role in the buying process. A \"high involvement\" product is one where the consumer is heavily involved in the buying decision. These products are generally more expensive, but not from just a fiscal perspective. It can also be something that once purchased, will require a lot more time to change, or it has significantly more impact from a long-term perspective. For instance, opening a retirement account is a \"high involvement\" purchase. A wallpaper purchase is also a \"high involvement\" purchase. \"Low involvement\" products tend to err on a more impulsive or spur-of-the moment purchase. Once a consumer decides they need this product, not much time will be spent researching because it involves a low margin of error if a decision was incorrectly made. The price of the product is usually low. Image Credit If the product the company sells is a \"high involvement\"/\"think\" product, the consumer is going to spend significantly more time researching the product, including reading/watching product reviews, identifying product features, assessing if this purchase is worth the cost, etc. As a result, the content strategy for such a product should involve plenty of information on the product features, the benefits of the product, as well as growing the product and brand awareness, so that consumers will both discover and search for the product. If the product the company sells is a \"low involvement\"/\"feel\" product, more time should be invested to connecting with consumers and appealing to their emotions. These products should also focus their efforts on building brand loyalty and retention of customers because these products tend to be repeat purchases. Julian Cole, the Head of Comms Planning at BBH, breaks down this process in great detail in his \"Working Out the Business Problems\" slide deck. Trend 2: Determining the key metrics to measure content's success will be more important Traditionally, traffic and page views have been the longstanding metrics to gauge a piece of content's success by. Although there are clear value propositions in having increased traffic (such as increased brand awareness and increased/potential revenue for publishers and bloggers), these metrics on their own can be misleading. More importantly, solely focusing on traffic and page views as a metric of success can lead to unintentional behaviors and misguided motivations. These can include an overemphasis of click-worthy headlines, overuse of keywords in a title, and changing the focus from creating content for users (building for the long-term) to creating content for page views (short-term wins). Ultimately, determining the right metrics for an organization's content depends on the goals for the content. Is it to maintain an engaged community/develop brand advocates, build brand awareness, and/or to convert users into paying customers? Perhaps it is a combination of all 3? These are all difficult questions to answer. At Distilled, we're currently working with clients to help them define these metrics for their content. Sometimes, the best option is to use a combination of metrics that we want to analyze and target. For some clients, a key metric could be combining organic traffic + % returning visitors + tracking changes in bounce rate and time on site. For instance, if a user finds exactly what they're looking for and bounce, that's not necessarily bad. Perhaps, they landed on an ideal landing page and found the exact information they were looking for. That's a fantastic user experience, especially if the users have a long time on site and if they become a returning visitor. Looking at any metric in isolation can lead to tons of wrong assumptions and while there is not a perfect solution, combining metrics can be the next best alternative. For other businesses, social metrics can be a great conversion metric for content pieces. A Facebook like or a Twitter retweet signals some engagement, whereas a share, a comment, or becoming a \"fan\" of a Facebook page signals a potential brand advocate. Although a share or a new \"fan\" on a Facebook page may be worthy more, all these activities demonstrate the ability of a piece to gain a user's attention and that awareness is worth something. Content Marketing Institute has a great list of key metrics that B2B and B2C companies use to measure the effectiveness of their content. Trend 3: Increased interest in content integration (content will be produced for multiple channels) Some of the biggest challenges involved in content often times have nothing to do with content. For many of my clients, the biggest struggles usually involve decisions regarding proper resource allocation - lack of time to implement all of the goals, lack of budget to implement these strategies in an ideal way, and the constant battle with readjusting priorities. These hard constraints make marketing especially challenging, especially as more and more channels develop and digital innovation advances so quickly. While there is no perfect solution to this problem, the next best alternative to balancing out hard resource constraints with the constant need for innovation is to develop better integration methodologies. A poll of CMOs have put integrated marketing communications ahead of effective advertising when it comes the most important thing they want from an agency. Why is this so important? It's because there is a change in the way consumers shop. Accenture conducted global market research on the behaviors of 6,000 consumers in eight countries. One of the top recommendations was the important of providing consumers with a \"seamless retail experience.\" This means providing an on-brand, personalized, and consistent experience regardless of channel. That seamless experience will require content to be heavily involved in a multitude of channels from online to in-person in order to provide potential and current customers with one consistent conversation. The chart below shows statistics about the way Millennials shop. Although Millennials tend to be exceptionally digitally-savvy (especially when it comes to social media), studies show they still like to shop in retail/brick-and-more stores. Millennials use the internet to research and review price, products, value, and service and have shown to have an impact on how their parents shop. The integration of content does not apply to just consumer retail stores. For instance, British Airways has a billboard in London that is programmed to show a kid pointing to a flying British Airways plane every time one passes over the billboard. Here is the video that shows how the billboard works. Last year, AT&T launched a 10,000 foot digitally enhanced store to showcase an apps wall, as well content dedicated to lifestyle areas, like fitness, family, and art. Start-up food blog, Food52 (who is starting to go into ecommerce) is launching a holiday market pop-up store in NYC. Content Marketing Institute's 2014 Report for B2B content marketers indicates that B2B content marketers still view in-person events as their most effective tactic. The seamless transition of content from online marketing channels (via social media conversations, PPC and display ads, and content on the site via case studies and videos) to in-person conversations and consumer experience will only grow in importance. Trend 4: Experimentation with content in new mediums Technology and digital innovation are experiencing rapid increases in growth. PCs are now a small percentage of connected devices, wearables, and smart TVs are about to go mainstream. As competition for attention increases, companies will be increasingly willing to experiment with content in new mediums to reach their intended audiences. This graph is just one depiction of how quickly technology evolves. As marketers, having the ability to quickly adapt and scale to new trends/opportunities is critical. This past year, marketing agency, SapientNitro, released a 156-page free guide entitled Insights 2013 that talks in detail about some of these trends, such as in-store digital retail experiences, the future of television, sensors and experience design, and customer experience on the move to name a few. One of their case studies talks about Sephora. Sephora has developed great content in retail stores, such as several interactive kiosks that allow users to explore different fragrances or gain understanding about skincare. IPads surround the store that provide how to makeup tips and items can be scanned to reveal product information. Sephora's mobile app has content that speaks to their core customer base and is in line with their other online and social media content. All of the content can be easily shared via email or through social networks. Other brands, such as Nivea mixed print advertising with mobile innovation. In this case, Nivea's print ad also doubled as a solar ad charger for phones. Finally, PopTopia is a mobile game that has a mobile phone attachment, called Pop Dangle that will emit the smell of popcorn as you play the game. The game works because the attachment plugs into the audio jack and at a certain frequency, it will signal to spread the smell of popcorn. These examples all show brands who have embraced new mediums for content. 2014 will be an exciting time for the future of content. As technology evolves and competition for user attention increases, marketers need to be agile and adapt to the growing needs and expectations of their customers. The future of businesses will absolutely be critical upon businesses having a very clear unique value proposition. Why is this so crucial? This is the pivotal foundation from which marketing strategies and execution will grow. Our job as marketers is to use that information to pinpoint the metrics we need to measure and prioritize all future marketing strategies. This task is very difficult, but our role is to continue to embrace these challenges in order to seek solutions. Now is the ideal time to begin. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Future of Content: Upcoming Trends in 2014"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Future of Content: Upcoming Trends in 2014"
    },
    {
      "level": "H2",
      "text": "Trend 1: Competition to gain consumers' attention will increase"
    },
    {
      "level": "H2",
      "text": "Trend 2: Determining the key metrics to measure content's success will be more important"
    },
    {
      "level": "H2",
      "text": "Trend 3: Increased interest in content integration (content will be produced for multiple channels)"
    },
    {
      "level": "H2",
      "text": "Trend 4: Experimentation with content in new mediums"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Stephanie Chang\n          \n            Stephanie Chang\n          \n            Stephanie Chang"
}