{
  "url": "https://moz.com/blog/future-marketing-skills",
  "slug": "future-marketing-skills",
  "title": "Top 4 Skills Marketers Need in the Future - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There’s no doubt that AI is impacting the role of marketers around the world, but the skills marketers need to thrive in the future go beyond simply leveraging AI tools. Learn the top 4 skills marketers will need in the future in this blog post.",
  "content": "The Top 4 Skills Marketers Will Need in the Future Marketing Industry | Marketing Psychology By: Bethan Vincent Edited By: Emilie Martin April 16, 2024 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Bethan Vincent Edited By: Emilie Martin April 16, 2024 The Top 4 Skills Marketers Will Need in the Future Marketing Industry | Marketing Psychology The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Is the death knell sounding for marketing jobs across the globe? In a new book on AI, Sam Altman, the CEO of Open AI, has reportedly been quoted as saying: \".... 95% of what marketers use agencies, strategists, and creative professionals for today will easily, nearly instantly, and at almost no cost be handled by the AI — and the AI will likely be able to test the creative against real or synthetic customer focus groups for predicting results and optimizing. Again, all free, instant, and nearly perfect. Images, videos, campaign ideas? No problem.\" While Altman's perspective is certainly provocative, it's essential to approach his claim with a healthy dose of skepticism: 1. Altman is unlikely to have direct experience with the day-to-day challenges and complexities of \"doing marketing” — i.e., he doesn’t fully know what he’s talking about here. 2. As the leader of a company focused on developing and selling AI solutions, Altman clearly has a vested interest in promoting a future where AI plays a dominant role in various disciplines, including marketing. There’s no doubt that AI is impacting the role of marketers around the world. Many of us are working out how to incorporate it into our workflows and fine-tuning our prompt engineering skills to get the most out of the machines. It’s important to continue to cultivate these abilities, but I’d argue that the skills marketers need to thrive in the future go beyond simply leveraging AI tools. Data storytelling One area where AI and computers clearly excel is in processing large amounts of data. AI-powered tools can analyze data at a scale that would be impossible for humans, uncovering patterns and insights that might otherwise go unnoticed. According to a McKinsey estimate, \"...69 percent of data processing and 64 percent of data-collection activities could feasibly be automated.\" This suggests that the ability to collect, organize, and analyze data will soon become table stakes for marketers rather than a distinguishing skill. However, to truly leverage the power of data and AI, marketers must become adept at data storytelling. Simply presenting numbers and statistics is not enough; we must be able to explain the significance of the data and provide actionable recommendations based on the insights. In my experience of reviewing marketing reports across various organizations, I often find that people can successfully identify and present relevant data but struggle to explain its meaning, importance, and implications. To effectively communicate data-driven insights, you could consider using this three-part framework: 1. Data Summary: Start by summarizing the key findings from the data analysis. Identify the most important patterns, trends, or insights, and distill the information down to its core, focusing on the points that matter most to your stakeholders and their goals. 2. What It Means: This is arguably the most important aspect of data storytelling. Explain the significance of the insights and what they mean for your (internal and external) audience. Connect the findings to business objectives, customer needs, or market trends. Clearly articulate the implications of the data and why your audience should pay attention to what you’re presenting. 3. What to Do with It: Finally, provide clear, actionable recommendations based on the insights. Outline the steps that should be taken to seize opportunities or tackle challenges revealed by the data. Explain how the insights can inform marketing strategies, campaigns, or tactical decisions. Give your stakeholders clear guidelines on your recommendations and their implications in terms of trade-offs like time/cost vs. ROI. Effective data storytelling also requires a deep understanding of your audience and how to persuade them that your narrative is credible and actions are worth taking. Tailor your insights and recommendations to the specific stakeholders you're communicating with, whether it's executives, sales teams, or other marketing colleagues. This requires strong communication skills, empathy, and, crucially, the ability to be concise. Humanities skills When discussing Sam Altman's argument earlier, I demonstrated a crucial skill honed during my history degree: identifying and articulating bias in sources, which is vital for marketers to critically assess the information we consume and create. Humanities skills, developed through studying disciplines like literature, history, philosophy, art, and language, include critical thinking, analysis, communication, creativity, and empathy. These skills enable us to understand the human experience, explore complex ideas and emotions, and connect with others across cultural and social divides. When studying history, students learn to approach sources with a skeptical eye, interrogating the creator's agenda, biases, and evidence. This critical mindset is vital for marketers in a world filled with fake news and competing agendas, ensuring that our marketing is based on truth and credibility. Studying humanities also cultivates empathy and understanding of the human experience, which is essential for marketers looking to connect with diverse audiences, craft resonant messaging, and forge lasting connections. Moreover, understanding the broader cultural, social, and historical contexts in which our marketing operates helps us create timely, relevant, and impactful campaigns that anticipate trends and remain engaging in a constantly evolving landscape. A good example of this is dissecting why the Stanley Cup has become such a big trend for a certain demographic, namely suburban, middle-class, middle-aged women in the United States. By applying humanities skills, we can analyze the cultural, social, and psychological factors that have contributed to the Stanley Cup's popularity. Stanley's savvy marketing, which relies on trusted influencers and a new palette of colors and designs, taps into powerful emotions and aspirations for this demographic. The cups are symbols of status, community, and the idealized lifestyles the audience aspires to. The fear of missing out on new releases and hard-to-find colors fuels the frenzy, with the cups representing more than just drinkware but a sense of identity and belonging in a group that has historically been relegated to hidden roles within the domestic sphere. By understanding these deeper meanings and associations, marketers can create campaigns that forge authentic connections with their target market. At its core, marketing is a deeply human discipline and the most successful marketers are those who truly understand what makes people tick. Taste and preference Do you know what good looks like? Building on the example above, a skill set that will become increasingly vital for success is the ability to understand and anticipate consumer tastes and preferences. As markets become more saturated and consumers are bombarded with an endless array of choices, marketers who can tap into the pulse of their target audience and deliver content, products, and experiences that resonate will have a significant advantage. However, it's equally important to recognize when an attempt to connect with an audience falls flat or, worse, offends. Take, for example, the infamous Pepsi ad featuring Kendall Jenner. In the ad, Jenner joins a protest and offers a can of Pepsi to a police officer, seemingly resolving the tension. The ad was swiftly met with backlash, with critics accusing Pepsi of trivializing the Black Lives Matter movement and using social justice as a superficial marketing ploy. This is a prime example of a disconnect between a brand's intended message and the actual tastes and sensitivities of its audience. In attempting to capitalize on a cultural moment and appeal to a socially conscious young demographic, Pepsi instead came across as tone-deaf and opportunistic. It's a cautionary tale for us marketers — understanding your audience isn't just about knowing what they like but also being attuned to what they will find insensitive, offensive, or simply in poor taste. As a marketing leader, I frequently encounter this message/taste mismatch in the content targeted at me. Many of these ads come across as patronizing, failing to truly understand the complex pressures and challenges I face in my role. Rather than providing meaningful, tailored solutions, they often address intricate issues in a superficial, generic manner. This disconnect goes beyond simply failing to resonate with me — it often actively diminishes my perception of the brand. When I encounter content that makes me think, \"they just don't get it,\" it undermines the very purpose of the marketing effort. Instead of building a connection or establishing credibility, it creates a cognitive barrier between the brand and me, making me less likely to engage with them in the future. As we look to the future, the role of the marketer may also shift from managing people to managing machines. With the rise of AI and automation, algorithms and software will handle many of the repetitive tasks of marketing, such as data analysis, transactional copy creation, etc. However, this does not diminish the importance of human judgment and discernment. In fact, it amplifies it! As a marketer, your role will be to manage the outputs of these machines to ensure that they are aligned with your brand's voice and values and the tastes of your target audience. To do this effectively, you will need to have a keen sense of what really good looks like. This means constantly benchmarking your work against the best in your industry, staying attuned to the shifting tastes and trends of your audience, and having a clear vision for what excellence and resonance look like for your particular brand and market. It's no longer enough to simply push out volumes of content or ads and hope for the best. Marketers will need to be curators and arbiters of taste, with the ability to separate the signal from the noise. You’re only as good as the solutions you implement The true test of a marketer's mettle lies not in their ability to come up with clever ideas or flashy creative but in their capacity to solve real business problems and drive organizational change. In my role as a marketing strategy consultant, I often work with scale-up clients facing significant constraints, from limited marketing budgets to the pressures of funding cycles. In these high-stakes environments, crafting effective strategies is only half the battle. The real challenge lies in navigating complex organizational dynamics to turn those strategies into action. This is where the ability to influence becomes paramount. As a marketer, your job isn't just to come up with great ideas but to rally the entire organization around those ideas. You need to be able to articulate a compelling vision, build consensus among diverse stakeholders, and secure the resources and support needed to drive execution. This is no easy feat. In many organizations, marketing ideas are met with skepticism or resistance. Sales teams may push back on new messaging or positioning. Product teams may resist changes to the roadmap. Executives may question the ROI of proposed investments. To overcome these obstacles, marketers need to be skilled negotiators and diplomats. They need to be able to build alliances, find common ground, and make a compelling case for change. They also need to be able to translate marketing jargon into the language of business, demonstrating how their initiatives will drive real results (you can see more tips on this in my Whiteboard Friday presentation on getting executive buy-in). But influencing is just the start. Once you've secured buy-in, you need to be ready to roll up your sleeves and dive into the hard work of execution. This requires a bias for action — a willingness to break complex strategies down into concrete plans and rally teams around clear goals and metrics. Long-term perspective is also vital. Organizations want results to come sooner rather than later, and it's easy to get caught up in the urgency of short-term goals, especially when imposed from the top. But truly effective marketing requires a balanced approach that delivers quick wins while also laying the foundation for sustained growth. This means being able to champion initiatives that may not pay off immediately but are crucial for building brand equity, customer loyalty, or competitive differentiation over time. In the end, the most successful marketers are those who can combine strategic vision with the ability to drive tangible, measurable results. They can rally entire organizations around a shared vision and then lead the charge in turning that vision into reality. They understand that great ideas are meaningless without great execution — and they have the skills, the tenacity, and the influence to make that execution happen. Conclusion While AI will change how we work, it is deeply misguided to suggest that it will replace the vast majority of marketing jobs. In fact, it presents a unique opportunity for marketers to refocus on the core essence of their discipline — understanding and influencing human behavior. To thrive in the future, marketers must double down on the uniquely human skills that machines cannot replicate. This means mastering the art of data storytelling, cultivating deep empathy and understanding of our audiences, and crafting messages and experiences that resonate on a profound emotional level. It also means being the guardians of taste and quality, leveraging our human judgment to ensure that the outputs of our AI tools align with cultural nuances and audience preferences. None of this matters, though, without being able to get things done. We need to be able to better navigate complex organizational dynamics to drive real change and implementation. These skills — the ability to understand, contextualize, influence, and effectively lead are where I’m focusing my continued learning and development. I suggest you do the same. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Top 4 Skills Marketers Will Need in the Future"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Top 4 Skills Marketers Will Need in the Future"
    },
    {
      "level": "H2",
      "text": "Data storytelling"
    },
    {
      "level": "H2",
      "text": "Humanities skills"
    },
    {
      "level": "H2",
      "text": "Taste and preference"
    },
    {
      "level": "H2",
      "text": "You’re only as good as the solutions you implement"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "Learn from the best in the industry."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    }
  ],
  "author": "Bethan Vincent\n          \n            Bethan Vincent\n          \n            Bethan Vincent"
}