{
  "url": "https://moz.com/blog/future-search-marketers-help-them",
  "slug": "future-search-marketers-help-them",
  "title": "Help Future Search Marketers! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I often get dragged away from the computer by my girlfriend to head to the bookstore.  My favorite section is the “Web Design” section, obviously.  I like to take a look at the SEO books and see what kind of outdated information books are pushing onto the readers.  This trip was a little different…",
  "content": "Help Future Search Marketers! Public Relations By: Casey Henry December 11, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Casey Henry December 11, 2008 Help Future Search Marketers! Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I often get dragged away from the computer by my girlfriend to head to the bookstore. My favorite section is the “Web Design” section, obviously. I like to take a look at the SEO books and see what kind of outdated information books are pushing onto the readers. This trip was a little different because I ran into a college student who was looking at an SEO book. We began talking about SEO and more about the class he was researching SEO for. I gave him my contact information and told him to contact me if he needed any further information on the topic. Many phone calls and emails later, the student reported back to me that his report was a hit with his professor. It was such a hit that the professor called and asked me to come in and speak to the class about some SEO information. I thought it would be a great opportunity to inspire some future search marketers. Little did I know what I was about to experience. When I think of a college website design class I think of students learning the most up to date stuff out there, or at least information from within the last year. When I first started talking with them, you would have thought I was speaking a foreign language from the looks on their faces. It’s like they couldn’t believe you could move your site up the rankings at search engines. Once we got to using examples and real world applications, the session went great. The students were very intrigued about what SEO could do for the website projects they were working on. We spent a majority of the time discussing SEO and how to implement it on and off their sites. We also spent a large time looking at the tools on SEOmoz.org and displaying how they worked. Most of the kids really took to the SEO discussion and really were intrigued by the ability to put a website on the first page of Google. I also believe it opened their minds to the amount of money they could make in other areas besides website design. Many of them asked where they can get more information about Search Marketing, and of course I pointed them towards SEOmoz. They also asked if there were any books I could recommend and I had a hard time doing that, mostly because I’ve found most of them to be out of date. My questions to all the YOUmozzers out there are the following: Where do you think the most helpful sources of SEO information are? If you could recommend one book which would it be? If you could recommend one website which would it be? If you could recommend one blog/forum which would it be? What's the most important tip for future search marketers? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Help Future Search Marketers!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Help Future Search Marketers!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Casey Henry\n          \n            Casey Henry\n          \n            Casey Henry"
}