{
  "url": "https://moz.com/blog/gamification-case-study-allkpop",
  "slug": "gamification-case-study-allkpop",
  "title": "Gamification Case Study - allkpop - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For Social Media Week, I wanted to write a case study on one of the hot trends in SEO and online marketing – gamification. Searches for ‘gamification’ have increased 250% since the beginning of 2011 (shown below). Gamification isn’t just a buzzword for the SEO industry, agencies like Badgeville and…",
  "content": "Gamification Case Study - allkpop Social Media C By: Colin Cheng March 6, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! C By: Colin Cheng March 6, 2012 Gamification Case Study - allkpop Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. For Social Media Week, I wanted to write a case study on one of the hot trends in SEO and online marketing – gamification. Searches for ‘gamification’ have increased 250% since the beginning of 2011 (shown below). Gamification isn’t just a buzzword for the SEO industry, agencies like Badgeville and Bunchball are incorporating it into the online marketing strategies for many international companies and brands. In simplistic terms gamification is the name given to adding game mechanics to websites - rewarding points and badges to users for actions and engagement. Many websites have integrated it into their new user registration process; whilst others make it the centre of their online communities. One such website is allkpop - an online news site for Korean pop culture (focusing primarily on K-pop – the infectious Korean brand of pop music). As an ardent fan of K-pop I have been visiting allkpop for several years. During that time I have seen it grow from one of several competing blogs to dominating the English language information consumption for a whole cultural phenomenon. allkpop’s Audience Growth allkpop has some pretty amazing numbers for quite a niche website. They boast 4 million monthly readers and 75 million monthly pageviews. allkpop has just shy of 1 million Facebook fans and over 450,000 followers on Twitter. These numbers are staggering. And that doesn’t include the frequent mentions in the Korean national press, Korean pop stars giving shout outs to website and a couple of Mashable awards to boot. As you can see from the timeline above, their brand awareness has skyrocketed in just a couple of short years. allkpop also has a fantastic content strategy with a team of writers and journalists. K-pop’s fan base is also extremely engaged and social media savvy. However, allkpop’s astuteness at completing this with a gamification strategy has seen their online presence grow significantly. What of the impact of gamification to allkpop? allkpop first started working with Badgeville in February 2011 and you can see an almost instantaneous impact on traffic and pageviews. During the week long promotion of the game mechanics launch on allkpop, they experienced a 104% increase in shares, 36% rise in comments and 24% more pages viewed. You can see that this has had a long term and sustained impact on traffic levels. Done well, gamification can be an incredibly successful strategy to increase engagement and traffic. allkpop’s Gamification Strategy allkpop utilises gamification to increase reader engagement with the website and the number of shares and social signals generated for their content. Users can sign up for an account and earn points for completing these very actions. You earn points for posting a comment, having your comment endorsed by other users, sharing the content and so on. This works fantastically well at increasing usage of the site and the number of pageviews their content generates. allkpop also uses badges. Badges are often seen as one of the fundamental elements of gamification but it is really the underlying concept of rewarding that is important. Whether it’s badges or mayorships introduced in foursquare or real life rewards like stickers from GetGlue - it is the reward aspect that can really see the difference in stickiness when comparing the different examples of gamification. allkpop does this to great effect. Yes, it has the standard badges for the number of comments made or the number of articles you have shared but it also goes one step further with exclusive badges that are tied in with special events. These are time sensitive badges that can be unlocked in conjunction with a certain event or news item. For example, a Korean pop star is launching their new song – to unlock the related badge you might have to comment on the article, like it on Facebook and then share it through Twitter. In doing so, you will be rewarded with the exclusive badge but you might also be entered into a competition to win signed merchandise. This creates a three-way connection between allkpop, fans and music acts. You can easily see how record labels would also be excited to jump on this. Teaming up with allkpop to promote a new music video could result in significantly more views, shares and awareness than otherwise. For allkpop they get greater user loyalty and a huge number of pageviews. Having 75 million monthly page views is certainly going to help with their online ad revenue. With the growing inference that social is already having an impact on organic search engine rankings (or will do) you can see why allkpop will be in a great position to capitalise on this. I can imagine allkpop really winning Google Search Plus Your World. The Evolution of the Fan Now, allkpop has done a fantastic job at gamifying their website but they also have a fantastic, loyal and content hungry fan base. They are all highly motivated to promote their favourite bands or singers. Sharing links to videos of your favourite singer or liking all the news articles you can find about them are the new status signals that show you are a hardcore fan. In the 90s it might have been collecting stickers or decorating your room full of posters. These days, being a fan is completely focused online communities and digital bragging rights. If you can say you were the number one listener to the Wonder Girls last week on last.fm then that’s a bragging right on an international scale! If you’ve never seen what K-pop does some people, then you might be surprised. The Hallyu phenomenon is spreading fast globally (it also known as the Korean Wave) and it’s most obvious in the rise of the K-pop idol group. Whether it’s boy band BIGBANG selling out concerts in Singapore or nine-memeber girl group Girls' Generation teaming up with Universal to debut in the USA, it is quite clear that allkpop have hit the jackpot for a growing pop culture trend. However, it’s their clever use of gamification that really stands out as to how and why they have become so successful. Gamification – More Than a Buzzword I hope that I’ve demonstrated that gamification, far from just being a fad, can be an incredibly smart social media marketing strategy. What’s important to note is that gamification shouldn’t be your core strategy – it should supplement it. Whether your online marketing approach is all about fantastic content or all about building, engaging and keeping a thriving online community, gamification when used well can make your content work that much harder or your community engage that much more. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Gamification Case Study - allkpop"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Gamification Case Study - allkpop"
    },
    {
      "level": "H2",
      "text": "allkpop’s Audience Growth"
    },
    {
      "level": "H2",
      "text": "The Evolution of the Fan"
    },
    {
      "level": "H2",
      "text": "Gamification – More Than a Buzzword"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Colin Cheng\n          \n            Colin Cheng\n          \n            Colin Cheng"
}