{
  "url": "https://moz.com/blog/gauging-keyword-performance",
  "slug": "gauging-keyword-performance",
  "title": "Gauging Keyword Performance - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Today has me thinking on the subject of measuring keyword performance. I'm about to begin a relatively large scale campaign on both the organic and PPC side for a client and have wrestled with the neccessary facts and figures to track in order to have reasonable metrics. Here's a sh...",
  "content": "Gauging Keyword Performance Keyword Research By: Rand Fishkin July 12, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 12, 2005 Gauging Keyword Performance Keyword Research The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Today has me thinking on the subject of measuring keyword performance. I'm about to begin a relatively large scale campaign on both the organic and PPC side for a client and have wrestled with the neccessary facts and figures to track in order to have reasonable metrics. Here's a short list I've composed: Searches per Month - From Overture & WordTracker Daily Click-Throughs in Position 1 at Google & with Overture Conversion Rate per Term Visit Length per Term Avg # of Page Views per Visitor for Given Term Avg Sale per Conversion ROI Rate for Term Historical/Seasonal Fluctuation of Above Numbers I'll probably be adding metrics to track all the time, but at least with these as a starting point, I can attempt a coherent report to make sense of the data. I'm looking forward to starting a new campaign from the ground up, as maintenance and innovation have been in the driving seat over the last year. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Gauging Keyword Performance"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Gauging Keyword Performance"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}