{
  "url": "https://moz.com/blog/gbp-utm-tagging-whiteboard-friday",
  "slug": "gbp-utm-tagging-whiteboard-friday",
  "title": "UTM Tagging for Google Business Profile — Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In this Whiteboard Friday, learn about UTM tagging for Google Business Profiles with Claire Carlile Rees.",
  "content": "UTM Tagging for Google Business Profile — Whiteboard Friday Whiteboard Friday | SEO Analytics | Local SEO By: Claire Carlile Rees Edited By: Emilie Martin June 21, 2024 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Claire Carlile Rees Edited By: Emilie Martin June 21, 2024 UTM Tagging for Google Business Profile — Whiteboard Friday Whiteboard Friday | SEO Analytics | Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In this Whiteboard Friday, learn about UTM tagging for Google Business Profiles with Claire Carlile Rees. Click on the whiteboard image above to open a high-resolution version! Hi, Moz fans. My name is Claire, and I am a local search expert at BrightLocal. And today, we are going to be talking about UTM tagging for Google Business Profiles. So this is a new iteration of a Whiteboard Friday that I've done before, and Google does that thing where it likes changing things. And so, today, we're going to revisit some of those changes, and we're going to look at our UTM tags. So Google My Business has become Google Business Profiles, and along with that, we've seen the sad death of some of those features. We've lost the new follower offer, and some people don't have access to products like they had before. But we do have tickets and activities, which are new. What else has happened? GA UA is dead very sadly, and we are a little bit sad. Some of us are a bit happy about GA4. So we're going to look at UTM in the context of the new Google Business Profile and the new GA4. What So you might be thinking, what is a UTM tag? So UTM tag stands for urchin tracking module. But you can just think of it as something that we add to the end of our external links so that we know where traffic to our website comes from. So as it says here, a UTM code helps us identify the source, medium, and campaign that a website visit comes from. So imagine someone clicks on your link in your Google Business Profile, and then the information about that will then be transferred into Google Analytics. So, let's have a look at some of those parameters. I like to think of source as the place where the journey started. Medium is the method of transport. So, let's pretend that Google Business Profile is a train. The name, the campaign name is the carriage of the train, so say, for example, we're on carriage number one. The content, think of it as the seat number in that carriage, number 61. And the URL is the final destination. That's where we are sending the traffic to on our website. GA4, just to make things complicated, has got some new parameters, platform, marketing tactic, and creative format. I don't use them in my UTM tagging, and also, they're not currently available in the UI anyway, but just to make it clear that this fits perfectly within the way that GA4 works. Why So why would we do this? Well, we do it because we are marketers, and we are used to asking for more. So it might be because we want more budget for ourselves. It might be because we need additional members of the team. It might be that we need digital assets. We are also after more data. So, by UTM tagging, we get to see much more data in Google Analytics, and we can also use Google Search Console to understand the search queries that people found our profiles for. We're always testing. If we're looking for budget and we want to roll out some sort of new feature, if we are multi-location or enterprise, we might try something with a test set of locations, and by UTM tagging, we can prove the worth of that feature. So, without UTM tagging, normally, one of two things is going to happen to our Google Business Profile traffic when it comes to Google Analytics. It could end up in the organic bucket, which is fine, but we can't tell the difference between the traffic that comes in via all of our hard work in Google Business Profiles and that which comes in from the regular parts of organic. Or it might end up in direct, which is pretty much sad times because all of those mobile apps and browsers are failing to transfer information about the source into Google Analytics. But with UTM tagging, we actually capture that data, and it comes in. Where So, let's have a think about where we can actually link from in our Google Business Profile. We're still pretty lucky in that there are actually lots of spots that we can link to our own websites from our Google Business Profiles. What you have available to you as a business is going to be category-dependent, primary and secondary categories, but it could include these things. We have a website link that does normally drive the lion's share of traffic. We can have activities, tickets, Google products, Google posts, appointment link, menu link, and who knows what we might have next. It is worth keeping an eye out to see what new features Google is pushing into the business profiles. Which URL So, which URL are we going to want to tag? Now, this might seem obvious, but from my many years of working with businesses of all shapes and sizes, I realize that it is not obvious. Do you have one location, or do you have many locations? With one location, you'll probably link through to your homepage. Many locations, through to your location landing page. If it is a Google product, probably the product page, a menu, the menu. An appointment, if you have booking functionality on your website, you'll want to link through to there. If you're using special offer posts, you'll probably want to link to that special offer. But what you do need to be aware of is what's going to happen to that link, to that special offer when it expires. We obviously want the URL that we link to to resolve. We want people to be able to see that page. We don't want it to go through a series of redirects. We don't want it to give a 404. I know that your site will be on HTTPS, and you will definitely be including that part in the URL that you link to. And again, just having a think about managing that expired content that you link to. It might be because it's an old post or an old special offer, or it might be because you've changed the URL structure of your website because you've had a CMS change. Who But before you actually add your tags, you are going to need to have a chat with whoever is managing data and reporting within your organization because it is super important that the UTM tags that you add play nicely with everything else that they are doing with their data. You'll also want to check the default UTM tags out of the box on any third-party tools that you're using because it is quite likely that they won't fit what you're going to be using. So, all of these things that we can be looking at, all of these conversions and micro conversions that you'll have set up on your website, revenue, click to call, clicks out to social media, and sign up for a newsletter. It might be content consumption. You might be measuring how far down the page someone reads through. How I’m tagging Okay. So this is how I'm tagging my Google Business Profile URLs: I'm using GBP as the source and organic as the medium. When it comes to campaign name, I'm using the location of that link in the Google Business Profile, and I'm using the campaign content field to give further details of that link. If you decide to use a different template for your UTM tags, then go you. Top tips But what you need to think about is the fact that consistency is going to be key because what you don't want to do is chop and change the way that you add your UTM tags because it's going to bulk your data and it's going to take a lot of time to tidy up. So when I separate the words in my UTM tags, I like to just use a dash. You might decide to not use anything. You might decide to use an underscore. But whatever you do, always keep it consistent. Another thing to remember is that Google Analytics is case-sensitive in all of its reports. So stick to lowercase, so gbp - products, not suddenly becoming uppercase GBP or with a capital G and then a whatever. Basically, keep it all lowercase. And whatever you do, document your conventions, keep a record, and make sure you have a spreadsheet that you can share with people internally and externally. So few, there we go. UTM tags, that's what they're all about. So, it might seem complicated. It might not. What I do have for you is something that I've put together with love, which is my Google sheet, which will auto-generate all of your UTM tags for you, keep it all nice and tidy all in one place, and that you can share that with people, again, within your organization. So it is here. You will find it. All you need to do is drop your URLs in, and it will auto-generate all of these beautiful UTM-tagged links for you. So, I hope that was helpful. It was lovely to be here today, and hopefully, see you again soon. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "What"
    },
    {
      "level": "H2",
      "text": "Why"
    },
    {
      "level": "H2",
      "text": "Where"
    },
    {
      "level": "H2",
      "text": "Which URL"
    },
    {
      "level": "H2",
      "text": "Who"
    },
    {
      "level": "H2",
      "text": "How I’m tagging"
    },
    {
      "level": "H2",
      "text": "Top tips"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    }
  ],
  "author": "Claire Carlile Rees\n          \n            Claire Carlile Rees\n          \n            Claire Carlile Rees"
}