{
  "url": "https://moz.com/blog/gbp-profile-fields",
  "slug": "gbp-profile-fields",
  "title": "The 11 Known Google Business Profile Fields That Impact Your Rank - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In this blog post, Miriam discusses 11 Google Business Profile fields that can have a positive impact on how you rank.",
  "content": "The 11 Known Google Business Profile Fields That Impact Your Rank Local SEO | Search Engines By: Miriam Ellis Edited By: Emilie Martin July 15, 2024 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis Edited By: Emilie Martin July 15, 2024 The 11 Known Google Business Profile Fields That Impact Your Rank Local SEO | Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. There’s never been a more relevant moment than this one for doubling down on your stewardship of your Google Business Profile. Today, I’d like to tell you why that is and then show you why you should prioritize making the most of nine fields on your listing that demonstrably impact your visibility in Google’s search engine results, plus two additional fields that have just been discovered as looking like strong ranking factor candidates. Today’s column is a very simple one, but if you follow the advice in it, it could have a meaningful impact on the revenue of any local business you’re marketing! Why is local search visibility more important than ever? I calculate that I’ve been tuning into Mike Blumenthal’s take on local search for about 20 years now. There’s a reason his voice has become such a trusted one in the industry, and I want to summarize something he recently wrote which strikes me as elegantly encapsulating this moment in local search time: There is a ton of talk at the moment in the larger SEO industry about Google self-preferencing its own results. At a legislative level, Google favoring its own products so that third-party assets are less visible has become the subject of antitrust inquiry.A historical example of Google self-preferencing is the 2007 removal of a highly visible link to MapQuest, which has been cited as contributing to the downfall of that once-dominant brand, while the self-preferenced Google Maps rose to near-monopoly status.When it comes to self-preferencing, Google’s local graph is an asset they are extremely interested in protecting. As Mike Blumenthal states in his piece, “At the EU EMA hearings in Brussels…Google was quite clear that they would not be talking about Local Search results or their entity graph in the context of \"self-preferencing.\" By attempting to set up this boundary, they're trying to protect one of their important sources of proprietary data that encourages zero-click behaviors: the local graph.” Every local business owner and SEO should read Mike’s full article, Local Search Is Evolving, Here's Why You Need to Pay Attention. In the context of these realities and of the overall state of search in 2024, these are my three top takeaways and tips: 1. Unpopular SERP changes There is absolute chaos going on this year in the organic SERPs due to a variety of updates coupled with the rushed rollout of elements like AI Overviews, which set a new high bar when it comes to self-preferencing. Most of Google’s recent developments are not big wins for publishers/business owners whose content is being scraped and turned into AI hash and whose own sites are struggling for organic visibility amid content farms and other low-quality entities. 2. When it comes to web traffic, local is different Local search is often an outlier. Whereas Google’s self-preferencing of SERP content directly, negatively impacts publishers, the effect of their bias towards their own local graph has somewhat different outcomes for local business owners and their marketers. As Mike Blumenthal succinctly sums it up, “Web traffic, while nice, is not critical to our success in Local.” In other words, as long as a customer finds you and arrives at your premises or books an appointment, do you really care whether they got to you via your website or via a local pack quad pack, infinipack, twin pack, places site, local finder, Google Maps, a product-oriented local result, a SERP feature, or an AI overview? The answer is: maybe not too much. You mainly only care if these sources get your business info wrong and drive customers away. 3. Local lemonade out of SERP lemons Self-preferencing and antitrust concerns, while absolutely legitimate, have to be seen in a slightly different light in local. If local businesses are still directly benefiting from being the ingredients that makeup Google’s ever-changing menu of different local SERP features, the stress of the monopoly scenario feels a little less urgent in our neck of the woods. We are still definitely earning customers from Google’s tight grip on its local graph. Google is heavily invested in making local visible in their ecosystem. In sum, the relative stability and usefulness of local SERPs amid a stormy Google organic SERP makes them something which the local businesses you market can focus on in hopes of good (and somewhat dependable) gains that continue to drive both online and offline conversions, if you get the basics right. So now, let’s look at those basics. 11 GBP fields to prioritize for their known impact on rankings I believe the last time I wrote about this topic; there were just 4 Google Business Profile fields that were generally agreed upon as to their impact on rank. Thanks to ongoing studies and discoveries by local SEOs, it’s time to update our knowledge base. Here’s an upgraded list of 9 + 2 GBP fields you should focus on for their definite or probable power to influence your visibility: 1. Business title The reason you will find both real and fictitious listings with incredibly long business titles like “Car Accident Dog Bite Personal Injury Lawyer Boise Idaho” is because Google continues to use the name of the business as a ranking signal. But don’t take this as me advising you to fill your Google Business Profile title field with extraneous keywords because: Such names are unlikely to look trustworthy to potential customersSuch names do not build recognition of the real-world brand you use on store signage, company vehicles, radio, and local TV spots, billboards, phone greetings, and other offline assetsEither Google or any random passerby can notice that your name seems suspicious; the public can then flag the name as spam, and Google can edit it My advice is to read and adhere to the section on naming best practices in The Guidelines for Representing Your Business on Google, but also to see whether there is an opportunity for you to benefit from this known ranking signal in one of these ways: If you are starting a brand new business, investigate whether the name you’re considering is optimized to reflect a particular top search phrase that could help you gain a competitive edge in the local results. For example, it might be better to name your new business “Virgil’s Vegan Diner” instead of just “Virgil’s Place.” If your research has made you realize that your listing is being outranked by competitors because of the keywords in their names, you might consider legally changing your business name. One word of caution: unless you have no plans for your business to grow beyond a single location, be careful about including city names in your legal business title. You don’t want to be “Vancouver Virgil’s Vegan Diner” if, in three years, you decide to open a new location in Whistler. This would create confusion and ranking problems.2. Address The address of your local business doesn’t just predicate how much foot traffic you receive but impacts your local rankings in multiple ways. All of the following factors are in play when it comes to your physical location: The proximity of your address to a searcher’s location when they do a search, impacts your local pack rankings. The closer your business is to the searcher, the more likely you are to appear highly in the packs, finders, and maps. The reverse is also true. If your competitor is closer to the searcher, they will frequently have the edge over you in the rankings. Scenarios arise when a business realizes that the physical location it has chosen is too distant from its core consumer base. While SEO improvements can sometimes alleviate this circumstance and help a business rank well despite distance, there are some instances in which the only fix is to move the business to be closer to its customers.If your address falls outside the mapped Google borders of a town or city (see the red border in the above image), you are likely to find it harder to rank for searchers within that city or for searches that include the name of that city in the search language. Again, SEO can sometimes overcome this disadvantage, and in rural areas with a low level of competition, a business can rank over a very large geographic area because it is one of very few choices, but, in some scenarios, a business may have to move its location inside the city border to level the playing field and be found by its desired audience.There is the historic concept of city and industry centroids, as well. A city centroid is defined as the place on the map where Google locates the name of a city. An industry centroid is a locale where multiple businesses in the same category exist, like an auto row where all the car dealerships in town are located. While proximity to the actual user appeared to become the more important signal about a decade ago, there may still be instances in which the nearness of your address to a city or industry centroid can impact its rankings.This brings up how the proximity of your address to competitors can negatively impact your visibility in Google’s local results. When two or more businesses with the same primary Google Business Profile category also share the same building, street, or are even within a couple of blocks of one another, it’s not uncommon for Google to filter out one or more competitors from the automatic zoom level of their maps-based rankings. In such cases, if you zoom in on the map, these filtered businesses will reappear, but many potential customers will never see them. Using the auto row example, if two Toyota dealerships were located on the same street, Google might filter one, whereas there’s unlikely to be an issue if one enterprise is categorized as a Toyota dealership and the business next store is categorized as a Hyundai dealership. If your business is being filtered due to close proximity and affinity to a competitor, you must either improve your metrics so that Google sees you as the stronger business that should not be filtered, or you must change primary categories, or you must consider moving to a location without a nearby direct competitor.Finally, we have the massive impact associated with the addresses of service area businesses (SABs), like plumbers and carpet cleaning companies that go to customers’ locations for transactions instead of serving them at their own brick-and-mortar locations. Google requires SABs to hide their addresses unless they have a physical location to which customers can come, and it has been speculated for decades that complying with Google’s requirement negatively impacts the rankings of these businesses. In 2023, Sterling Sky was able to capture and validate the impact of hiding the business address. They documented a massive drop in rankings when they tested hiding the business address, and the rankings “magically” reappeared as soon as the address was restored. This is one of the most frustrating aspects of Google’s guidelines: that they tell businesses to do things that harm their ability to rank. The solution to this for SABs is to get a staffed physical office and meet some clients there so that the business is eligible to show its address, but the truth is, this isn’t possible for every enterprise, and Google’s policy is what actually needs to change here. In sum, where you choose to locate your business will play a central role in how and for whom it ranks well. SEO can sometimes override disadvantages, and businesses in both rural areas and scenarios of little competition experience fewer barriers to ranking well. When no amount of optimization can overcome an address-based ranking barrier, sometimes only the extreme solution of moving to a new location will enable the business to rank highly for its intended audience. 3. Categories Be sure the primary category of your listing represents its core offering (the thing you most want to rank for). Beyond that, you have nine additional categories available to you to create a fuller picture of what your business is. If you’re not sure how to fill in those blanks in a way that will have the most impact on your local rankings, read How to Choose Google Business Profile Categories with Cool Tools! to learn techniques for seeing the categories your competitors are choosing. 4. Website link The strength and authority of the website you are developing and growing over time can improve your local pack rankings when you link to it. If you’re not very familiar yet with organic SEO, read The Beginner’s Guide to SEO. If you’re fairly familiar with the topic but would like a current list of suspected organic ranking factors with associated correlation/causation studies, check out this one from Backlinko. To increase your knowledge, join all the SEOs who have been devoting time to studying and interpreting the 2024 Google API Leaks, which appear to confirm some ranking factor theories while calling others into question. Overall, your main goal as a local business owner should be to build an authoritative, high-quality website that answers the questions of potential customers so that they are inspired to do business with you. This goal is supported when your website is easily discovered in Google’s organic or local search results. The more you learn about SEO and marketing, the stronger you can make your website. By linking to your website from your Google listing, you will underpin its ability to rank in the local results. Need to understand local search from the ground up? Read: The Essential Local SEO Strategy Guide. Everything I’ve linked to here is a free educational resource. 5. Hours It’s long been speculated in the industry that local pack rankings appeared to alter based on whether or not local businesses were open or closed. Then, in late 2023, Joy Hawkins and her team at Sterling Sky were able to capture this phenomenon in a tangible way. Her tweet below shows the same search made two hours apart: The ranking grid at left represents a time of day at which a business was closed. Once it opened for the day, the change in ranking position (shown at right) is dramatic. This is a ranking factor that doesn’t make a ton of horse sense in the real world. While it’s true that a customer looking for something immediate, like a quick cup of coffee, is naturally better served by being shown businesses that are open right at the moment, it makes less sense if someone is doing research in the evening for a restaurant they might want to try out next week when they are visiting another city. If the restaurant is invisible because it’s closed after 9 pm, the searcher isn’t really helped in this scenario. Google’s logic is sometimes confusing. That being said, there are two things you can do to optimize for this local ranking factor: You could decide to staff your business 24 hours a day, but this approach will not work for many businesses.Instead, most businesses can do a competitive gap analysis of the hours in which their top nearby competitors are open. For example, if all the local pizza restaurants in your town are closed on Mondays, your pizza place could see significant benefits by being open that day. Similarly, if all your competitors close at 9 pm, you could pick up additional rankings and business by staying open until 11 pm. Study the competition to identify opportunities of this kind.6. Reviews Reviews aren’t just a primary conversion factor, but aspects of them impact local pack rankings. These factors include: Your overall star ratingThe number of your reviewsLanguage in your reviews being surfaced as local justifications (e.g., snippets of text that Google sources from various aspects of your profile and highlights in their local results) It’s also speculated that the velocity with which you receive reviews and their freshness may have some impact on rank, but the overall takeaway is that your business should create a strategy that results in a modest but steady stream of incoming reviews and should be responding to every review you receive. For more on this huge topic, make use of the following free resources: The Impact of Local Business Reviews on Consumer BehaviorHow to Acknowledge and Cope with Fear of Local Business Reviews 7. Attributes Some attributes are out of your control, but the ones you can access via the “More” tab of your new merchant experience are worth investigating because at least one study has shown solid ranking impacts from their inclusion. In today’s column, we’re focusing on known ranking factors to help you prioritize work on your GBP, but I want to be sure to mention at least once that if Google offers you a field, you should always look at it to see if it’s applicable to your business. Otherwise, you’ll overlook something like the fact that adding the “small business” attribute could be of real benefit to you. *The two fields I strongly recommend that you avoid, however, are those labeled “Offers online appointments/estimates” and “Onsite services.” I don’t know whether this is a feature or a bug, but you can’t seem to turn off these fields once you turn them on, and they appear to override any other justifications you might enjoy. This isn’t to be confused with services, though, which we’ll turn to next. 8. Services We must again thank Sterling Sky for their vigorous ongoing testing, which concluded that, at least in some business categories and markets, adding services has a demonstrable local ranking impact. Best practice here is to add as many of the Google-suggested services as are applicable to your business and to use the ability to add customer services, as well. Spend a little time in the area of the NMX to see how detailed you can get. 9. Products Next up, if you upload your inventory via the Google Merchant Center/Pointy, your Google Business Profile will not only feature an eye-catching See What’s In Store section but will help your profile rank for product searches and will help you come up in the product grid within the organic results like this: 10. Popular times We’ve known about open and closed hours impacting local pack rankings for a little while now, but as I was writing today’s column, Claudia Tomina found two new signals that strongly appear to correlate with ranking shifts, and I wanted to be sure to include her exciting research in this article. As Claudia has captured, restaurants appear to be ranking higher during their peak popular times, as graphed by Google. She replicated this across several restaurants, showing how even an unverified listing got a boost over verified competitors during its peak hours. While you do not directly set your popular times grid in Google’s environment, you do have the power to influence what happens in-store. For example, you might have a limited-hours lunch special or a free chips-and-salsa happy hour that could make your business the most popular in a part of town at a particular time of day. 11. Menu items Claudia’s second finding is also worth reading about in her article (linked in the last section). She noticed that a Google Business Profile restaurant menu had a serious typo on it. Instead of listing “caesar salad,” it erroneously listed “caesar kitchen”. By rectifying this one mistake, Claudia saw the local rank of that business for the search term “caesar salad” shoot up overnight from position 71 to position 1! That’s a dramatic finding and a good reason for you to carefully check your menu to be sure every main item you sell is not only included but free of simple typographical errors. Additionally, it’s worth noting that your menu items can show up as justifications on your listings, making them more attractive to prospective diners. Conclusion And that’s a wrap for today. If I could add one more item to this list to make it an even dozen, I’d mention that the photo section of your listing deserves a ton of attention. Google will often swap out the profile photo on your listing to match changes in searcher intent, and as we now know from the Google API leaks, clicks and rankings are best friends. You want the public interacting in every possible, positive way with your listings, and by prioritizing high-value fields, you’ll be doing all you can to have the best GBP in the neighborhood! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H2",
      "text": "Why is local search visibility more important than ever?"
    },
    {
      "level": "H3",
      "text": "1. Unpopular SERP changes"
    },
    {
      "level": "H3",
      "text": "2. When it comes to web traffic, local is different"
    },
    {
      "level": "H3",
      "text": "3. Local lemonade out of SERP lemons"
    },
    {
      "level": "H2",
      "text": "11 GBP fields to prioritize for their known impact on rankings"
    },
    {
      "level": "H3",
      "text": "1. Business title"
    },
    {
      "level": "H3",
      "text": "2. Address"
    },
    {
      "level": "H3",
      "text": "3. Categories"
    },
    {
      "level": "H3",
      "text": "4. Website link"
    },
    {
      "level": "H3",
      "text": "5. Hours"
    },
    {
      "level": "H3",
      "text": "6. Reviews"
    },
    {
      "level": "H3",
      "text": "7. Attributes"
    },
    {
      "level": "H3",
      "text": "8. Services"
    },
    {
      "level": "H3",
      "text": "9. Products"
    },
    {
      "level": "H3",
      "text": "10. Popular times"
    },
    {
      "level": "H3",
      "text": "11. Menu items"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H3",
      "text": "Google Business Profile: FAQ for Multiple Businesses at the Same Address"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}