{
  "url": "https://moz.com/blog/geographical-targeting-factors-you-cant-afford-to-overlook",
  "slug": "geographical-targeting-factors-you-cant-afford-to-overlook",
  "title": "Geographical Targeting: Factors You Can't Afford to Overlook - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In a recent white board Monday, Will Critchlow explained the ranking discrepancy between .com vs. country-specific TLDs. I could relate his post to one of our recent client at RedAlkemi, whose ranking slipped from Ist page to 8th page on Google.com in US but was maintaining its position on the…",
  "content": "Geographical Targeting: Factors You Can't Afford to Overlook Online Advertising By: Pulkit Rastogi ILoveFashionRetail April 3, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Pulkit Rastogi ILoveFashionRetail April 3, 2008 Geographical Targeting: Factors You Can't Afford to Overlook Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. In a recent white board Monday, Will Critchlow explained the ranking discrepancy between .com vs. country-specific TLDs. I could relate his post to one of our recent clients at RedAlkemi, whose ranking slipped from the 1st page to the 8th page on Google.com in the US but was maintaining its position on the first page in other countries like Canada (on Google.co.ca) for the same search query. The same thing happened with other client, who was interested in starting a link building campaign when his website ranking dropped from No.5 on Google.co.uk to No.65 after he changed his hosting provider which had a USA IP addresses (and sadly didn’t even bother to inform us). We had to undergo a long investigation to figure out what suddenly went so wrong. We asked him to restore to a UK hosting company and thank God, he is on the second page now when searched on .co.uk. But telling you frankly, the picture still looks quite hazy to me. So, I decided to write a YOUmoz post and let all the Mozzers blow away the mounted clouds on the geo-targeting issues that many of us face while targeting specific countries on different Search Engines. My primary concerns here are: Will an Australian website (yourdomain.com.au) physically hosted in Australia get higher ranking when searched on Google.com.au than an evilcompetitor.com hosted in Europe? Does a country-specific domain name (TLD) (e.g., .co.uk) actually help if someone is targeting a specific country market? (Yes. It certainly does.) What sort of content duplication issues do you come across while geo-targeting a website? The very basic question that comes to my mind primarily is - How does Google perceive the nationality of a website? Possible factors: From the IP address of the web hosting company Address information on your website Language information from language xml:lang attribute Quite possibly also from the nationality of the majority of sites linking in and out (but I am not quite sure about this) As far as I know, there are 3 ways of targeting specific countries: By using country specific TLDs (like www.apple.co.uk) hosted in the same country (e.g., the UK). This is perhaps the most common practice that bigger companies follow but it’s definitely not the most economical one, as big guns have more resources to build and maintain such a network of websites. Simply use sub folders for that country ( like www.apple.com/uk) – Most economical! Use a subdomain (uk.apple.com). Not many companies use this ploy, and I really don’t know why! You may get a better insight on it if you go through Rand's post. It doesn’t answer all my questions though cuz personally, I am still not hundred percent sure which one of the above mentioned three is the most ideal one to implement. This is because, firstly, this entirely depends on the size of the brand and the website. For example, apple.com is using www.apple.com/uk & has redirected www.uk.apple.com back to www.apple.com/uk. For smaller companies with a limited budget, buying multiple domains at specific IP's may not be the smartest thing to do. Thanks to Google's webmaster tool, we can map folders or subdomains on our website to specific countries to convey to Google; precisely, which folder targets which country. For example: www.yoursite.com (main US website) au.yoursite.com ( for Australia) fr.mysite.com (For French) Now Mr. Google doesn’t have to use his brain to identify the nationality of a website. But the biggest limitation here is that you can only use this tool for the top level domains (.com, .net, .biz) and not for the country-specific domain like .co.uk (as they are already country specific). Secondly Yahoo and MSN are not providing this facility (please correct me if I am wrong). But one thing is for sure - this certainly is the most cost effective way of targeting a specific country Search Engine. However, if money is not an issue, the best way to target a specific country is to buy country specific top-level domains and host these websites with regional hosting companies with local IP address. Having said that, you must be very careful, as there are many UK hosting companies that have US-based servers or Australian hosting companies having their servers in Europe. Make sure that you are aware about the server IP address of your hosting company and also that Google is not allergic to your neighboring websites (since you may suffer even if other websites on your host server are passionate spammers). Content Duplication If you really want yourdomain.com and yourdomain.co.uk to co-exist and co-rank on Google.co.uk, the biggest challenge for websites (especially huge content websites) is to avoid pagination and content duplication issues; otherwise, they might end up getting one (or may be even more) of their sites penalized for copyright infringement. Additionally, to be on a safer side, you may even consider tweaking the link profile of both sites. Why take any chance? Conclusion: From the analysis of a few big & small banner websites, I have come to the conclusion that to get listed on the country specific search engine www.google.co.uk, you need to have a yourwebsite.uk domain with a hosting provider that has a UK IP address. A website .com TLD hosted in the US is bound to struggle to rank in www.google.com.au unless it strategically targets these countries. Another reason why most big brands prefer buying country specific domains is that with a country specific domain (.co.uk) they a get definite upper edge on their competitors in terms of credibility, thus yielding them a higher CTR. If I am not wrong, there is no sure shot formula to country target a website yet, as sometimes it’s search engines who make the final decision. The fact that most of the people still prefer using Google.com instead of Google.co.uk must give us a sigh of relief. But the problem comes when a client with a big website and limited budget actually seeks to rank at Google.com and Google.co.uk/.com.au/.co.ca, and so on. I am aware that I have only scratched the surface of geo-targeting with this post, but with your precious comments I am sure we can go an inch deeper. And BTW, it’s only after writing this post that I discovered SEOmoz offers a geo-targeting detection tool - lol. Those of you who were unaware like me, you may want to give it a try. Looks really cool to me. It's my first post on YOUmoz and I consider myself only a beginner. And did I tell you that I am a designer as well; yeah, I am talking about the picture above - they may not be as cool & relevant as the ones in Rand's post, but I hope you all like it. Thanks :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Geographical Targeting: Factors You Can't Afford to Overlook"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Geographical Targeting: Factors You Can't Afford to Overlook"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Pulkit Rastogi ILoveFashionRetail\n          \n            Pulkit Rastogi ILoveFashionRetail\n          \n            Pulkit Rastogi ILoveFashionRetail"
}