{
  "url": "https://moz.com/blog/geolocation-international-seo-faq",
  "slug": "geolocation-international-seo-faq",
  "title": "Geolocation & International SEO Frequently Asked Questions - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "While answering Q&A the other day it occurred to me that a lot of questions we see are basically the same question asked over and over again in different formats. In answering these questions we often end up re-using the same responses time and time again so I thought it would be a good idea to…",
  "content": "Geolocation & International SEO Frequently Asked Questions Local SEO T By: Tom Critchlow May 4, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! T By: Tom Critchlow May 4, 2009 Geolocation & International SEO Frequently Asked Questions Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. While answering Q&A the other day it occurred to me that a lot of questions we see are basically the same question asked over and over again in different formats. In answering these questions we often end up re-using the same responses time and time again, so I thought it would be a good idea to create a bit of an FAQ based off some of the most informative questions and answers which we've answered over the past couple of years. This format could easily turn into a series of posts if people are interested, but to start with I'm just going to look at questions relating to geo-location, internationalisation and foreign language questions. In my opinion 99% of questions on these topics can be answered by the information below. For the other 1% we'd be delighted to have you stop by Q&A and share your troubles :-) Note: You do need to be a PRO member to read the answers to the questions I've linked to, but I've pulled out the highlights from each question for you here so that everyone can benefit from the post. The Basics Before I delve into the Q&A, I'm going to link to some of the best posts on the topic which we nearly always end up linking to when we're talking about geolocation and international issues: A post by Duncan on some tricky Local issues Will is interviewed at SMX by Rand on the basics of ranking internationally Lucy interviews local SEO experts from around the world to get their take on the usual problems The Answer To The TLD/Sub-Domain/Sub-Folder Question This question we see more than any other. People are ALWAYS asking which is better: www.domain.com/uk, www.domain.co.uk, uk.domain.com? The answer is \"it depends,\" which is why we get asked the question all the time. On what does it depend, you might ask? Well, look no further, the answer is covered in these 3 Q&A: My rule of thumb with multi-location / language sites is as follows: Any country where you will have staff in the country, language resources to write the website and / or where it will be enough of your business to justify the investment, I would target with its own cctld (e.g., a website hosted in France, written in French at domain.fr to target France) Anywhere that is not an option (for cost / benefit reasons - and this could be all non-English areas), I would create the country as a sub-folder on the .com and write in the local language only within that sub-folder (e.g., domain.com/pt for Portugal, in Portuguese). Test registering these sub-folders as geo-targeted within Webmaster Central. I would probably host this in the UK as you will want your English-language content to be geo-targeted to the UK. Apart from the homepage, put your English-language content in /en or /uk, depending on your preference. Things to think about when designing a global multi-lingual SEO strategy Basically, my feeling is that big brands, whose content naturally earns lots of links and attention, should go for country-specific TLDs. Smaller brands, who are much less likely to earn the quantity and quality of links to each separate domain they need to rank well, should use one domain with geo-targeted sub-folders. Subdirectories or CC TLDs? I would probably avoid hosting a .com targeting North America in the UK as the English-language component could confuse the engines. Geographic considerations of your web hosting provider If you have a small business rather than a big one sometimes the answer changes; check out this question specifically for small businesses. And to finish off this section, Jane answers a few specific questions. International Link Building Of course, one of the important ranking factors is links from the correct geographical location. So how do you go about link building internationally? I think using domain extension specific searches is probably an excellent way to go. For example: http://www.google.com/search?q=directory+site%3Aco.uk http://www.google.com/search?q=intitle%3Adirectory+site%3Aco.uk http://www.google.com/search?q=inurl%3Adirectory+site%3Aco.uk http://www.google.com/search?q=resources+site%3Aco.uk You can add your specific topic/keywords (make sure you think broad) to these types of searches and find excellent places to list your site. International linkbuilding tips Geo-location/IP-based Redirection (AKA Cloaking) While questions on this aren't as common, we see this problem giving a lot of people a hard time (probably because there are a few pitfalls to avoid!). Unfortunately, most of these questions are marked as private so I can't share them; however, the most common sources we link to when talking about this are these, so make sure you've read them before you think about any conditional redirection: Rand turns to the dark side Does white hat cloaking exist? The world series spidering problem Miscellaneous Questions of Interest This is the bracket containing those hard-to-categorise questions which are still useful and worth reading even if the problem doesn't apply to you directly: I believe the best practice for this is to use the accent in body copy and title tags (I would choose &eacute; as that should work regardless of your character encoding and your users' browser). In the URL, however, I would choose the first example www.domain.com/cinema for the user-focused reason that accents in URLs get encoded when they appear in your browser's address bar - which makes them illegible to users. How to deal with foreign characters Adding &gl=uk (for the UK, that is, nz for New Zealand, etc) to the end of a search query will return results as if you were in that country. For example, notice the difference between these two results on Google.com for \"athletics\": regular result versus Australian result. Seeing Google as if from another country Because you're targeting these language markets, I would go with the native spellings of the languages in your URLs, rather than the English spellings. Neither is likely to make or break the site in terms of international rankings, but this is still the route I would take. International search language use and spelling However, from some searching around I've seen that almost all English language queries in google.ae are returning English sites. This is mostly .com (due to the dominance of .com domains) but I've seen .co.uk sites and .com.au sites ranking as well. This suggests to me that it would be possible to rank for English language terms in google.ae with any TLD so long as the language is in English. Geo-targeting a .me extension to the middle east That's all, folks! Hopefully this is useful and if you're thinking of asking a question on geo-targeting or international issues, why not check out these links first! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Geolocation & International SEO Frequently Asked Questions"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Geolocation & International SEO Frequently Asked Questions"
    },
    {
      "level": "H2",
      "text": "The Basics"
    },
    {
      "level": "H2",
      "text": "The Answer To The TLD/Sub-Domain/Sub-Folder Question"
    },
    {
      "level": "H2",
      "text": "International Link Building"
    },
    {
      "level": "H2",
      "text": "Geo-location/IP-based Redirection (AKA Cloaking)"
    },
    {
      "level": "H2",
      "text": "Miscellaneous Questions of Interest"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Tom Critchlow\n          \n            Tom Critchlow\n          \n            Tom Critchlow"
}