{
  "url": "https://moz.com/blog/get-inside-their-heads-a-strategic-framework-for-supereffective-seo",
  "slug": "get-inside-their-heads-a-strategic-framework-for-supereffective-seo",
  "title": "Get Inside Their Heads - A Strategic Framework For Super-Effective SEO! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Imagine this. Your prospective client types in a phrase or keyword into the search box on Google. She finds your site listed near the top of the search results, and clicks through to it. She is delighted by finding exactly what she was looking for.",
  "content": "Get Inside Their Heads - A Strategic Framework For Super-Effective SEO! Advanced SEO By: Trond Lyngbø March 20, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Trond Lyngbø March 20, 2012 Get Inside Their Heads - A Strategic Framework For Super-Effective SEO! Advanced SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Imagine this. Your prospective client types in a phrase or keyword into the search box on Google. She finds your site listed near the top of the search results, and clicks through to it. She is delighted by finding exactly what she was looking for. After quickly scrolling through your content, she is led irresistibly towards taking the action you want her to - making a purchase, subscribing to a list, sharing it with a friend, adopting a point of view, taking a decision... whatever it is you are targeting as a 'desired response'. Wouldn't that be nirvana? Hold that thought, as we look at the flip side. Unfortunately, this alternative scenario is all too common. You spend hundreds, or even thousands of dollars on SEO. Your page finally ranks on top at Google - but your traffic isn't that much higher. Worse, when you analyze your visitors' behavior using a stats package like Google Analytics, you discover that the bounce rate is high and the time spent on your site is very small. With a sinking feeling in your gut, you wake up to the unpleasant truth. Your visitors aren't finding what they're looking for on your site. Even with the #1 position on Google, your SEO is ineffective! That's the danger of executing an SEO campaign without a powerful and focused underlying strategy to guide it. At the core of a great, effective SEO strategy lies a deep understanding of human psychology. Specifically, the mindset of your market. The desires and dreams, problems and worries, anxieties and annoyances, hopes and prayers that drive your prospects to seek you out as their solution. Know these, and you own your niche - and your clients. Being unaware about the psychological drivers of SEO will condemn your efforts to mediocrity, and cause even the most powerful results to massively underperform their fullest potential. SEO isn't about code - it's about people. Superficially, it may seem as if SEO is meant to optimize and tweak keywords and code on a page in order to trick Google (and other search engines) to rank it higher. But smart SEO consultants, those savvy professionals who generate the best results for their clients, have always known the truth. Search engine optimization is always about people. Your site may sit on top of the search engine results. That may even bring more visitors to your site. But unless you understand the people coming to you through search results, you will not have many buyers or generate big profits. This is not to say that website optimizing tactics have no place in SEO. You can't dream of getting near the top of Google if you ignore SEO basics. But mindlessly optimizing a page for a specific keyword alone is no longer enough. You need to dig deeper - into the mind of your market. So how to devise a psychology-based SEO strategy? The battle for your audience's mind (and heart) begins well before they ever see your website listed on a search engine. It begins with what's inside their head, the things they tell themselves, the mental conversations they are engaged in before beginning a search. But how in the world can anyone know what people think? You're no mind reader, are you? Well, it's relatively simple - even easy - when you have a clear picture of your ideal audience and prospect. In the physical world of business, you would have to adopt a very intrusive approach if you were to try and uncover what's going through your customers' mind as they engage in the buying process with your business. It's not so difficult on your website. Because their thoughts drive their behavior. And all kinds of actions they take on your website can be tracked using technology! You can discover exactly which pages on your site a visitor browses, how long they spend on it, which links they click to progress through the site, and much more. You can even test different variations to see what works better, play around with copy elements like headlines, offers, graphics and layout to find out which combination appeals most to your visitors, and improves your level of engagement with prospects. Armed with all this information, through a deductive process of imaginative analysis, you'll be able to make very accurate estimates about what your clients are thinking while they are browsing through your site. What problems do they want solved? What pain are they seeking a salve for? What dreams would they love you to fulfill for them? Combined with intimate knowledge about your ideal customers, this can allow you to reverse engineer the psychology of your best buyers. You can't do this, however, by trying to 'slap on SEO' as the last step. You'll have to start thinking about SEO right at the beginning. By integrating SEO into each step in the process. That way, you'll be able to... make more sales lower your costs better deploy resources tap into long-lasting synergies A case study may help explain this better. Let's say you're in the resort business and are running a promotion for a romantic year-end get-away for young couples. Your ideal prospect is a busy businessman like George. As an up and coming entrepreneur who is pushing hard to corner the market in widgets, George works really hard every day. He travels a lot to meet buyers and suppliers. He spends long hours at the office, making deals and managing his manufacturing process. And because of this, he's been ignoring his beautiful wife, Alice. Staring with bleary eyes at his computer screen late one night, he decides to treat his spouse to a surprise holiday at a resort over the New Year weekend. Your site is one of the first he finds on a Google search. What must your landing page say to appeal to George? Not a detailed story about the geography and history of your hotel, or the facilities at your business center, or even the excellent handicrafts on sale at rock-bottom prices. And surely not something like 'cheap' or 'affordable' or 'economy'... words which may work very well for a price conscious buyer of a commodity, but would turn off a rich husband looking to pamper his special someone for a day or two. You'll have to understand the mindset of your prospect, and structure your landing page to speak to his deepest desires and dreams. A relaxing holiday in the seclusion of your hilltop resort, the luxury rooms that delight the senses, the excellent cuisine your guests will enjoy in the backdrop of snow-capped mountains, the quiet candle-light dinner with vintage wine... all of which cater to George's desire to give his wife a memorable treat, and make up for those long weeks of ignoring her. When you're able to read the mind of your prospect, you'll position your offer to appeal to their inner drives and urges, making it far easier to close a sale or make a deal. The most effective SEO techniques are built upon dry research for keywords and phrases - but are rooted in the vibrant, intimate and heartfelt elements of human psychology. This involves some detective work to unearth the intentions and motives that drive every keyword search that your prospects perform to find your business. And this extends to the language you use to greet these visitors, the approach you take in presenting them with your solutions, the price point you'll fix for your product or service, and much more - all of which will work in synchrony to skyrocket your conversion rate. It's a subtle shift - but one that can have a dramatic impact on the action you elicit from visitors. Done right, it can even boost your profitability massively. Once you know what your prospect wants, and can draw them to your website with laser targeted SEO, you'll be able to sell them more, at a higher price, often many more times - and even get them to refer new business to you. For example, if your website targeted George's desire to make it up to his wife for not paying enough attention to her lately, then your copy will work to allay his guilt and give him a feeling of fulfillment at indulging his sweetheart... to the point where price is no longer even a factor in the decision-making process! Understanding your buyer's psychology may indeed govern more than just your SEO campaign. It will even impact the offer you make, the positioning of your product or brand, your pricing, your add-on offers and several other elements of your business itself. And as your buyer's needs shift and change, so must your offer and presentation. George won't be as impressed by the romantic component of your resort's holiday package if he's looking to entertain his business partners over a weekend of hard negotiating. The same prospect now needs a different offer - one that matches his current needs. A need that will be reflected by the choice of search keywords he will use to seek you out. Expert SEO consultants teach businesses to view every page on their site as a 'landing page'. This means looking at each individual section of your website, and asking these critical questions about them: Why do visitors come to this page? What problems are they looking to solve, and how can we help? How can we delight and impress them so they'll keep coming back for more? Answer these questions correctly and your website visitors will more often say, \"Wow, this is just perfect. It's exactly what I was looking for!\" - and you'll win the battle for their mind. Keywords are the clue. Knowing what phrases bring a prospect to your website can give you valuable guidance into their mind and attitude. Creating targeted landing pages for specific keyword groups can enhance the overall conversion of your SEO process in a way that far outweighs the added effort and expense involved in setting this up. The key secret is knowing what keywords to target, and understanding the psychology of your ideal buyer who arrives at your site from searching on that keyword. That's where software tools enter the picture. Whether you use the free Google Adwords Keyword Tool or prefer a more robust software like Market Samurai to help you with competition analysis and profit potential inherent in keyword phrases, the important thing is to use your keyword data to try and understand a little more about the people who visit your website. A searcher using the keyword 'Nike shoes' might just as well be a retailer of shoes, or a sports enthusiast looking to buy a pair for himself, or a girlfriend thinking about gifting them to her lover, or a student researching for his term paper. 'Nike basketball shoes' are more specific, and very likely indicate a prospect interested in the game and looking for footwear to play in. A search for 'price of Nike Air Max Diamond Turf Men's Shoes' is a lot more indicative about the searcher's interest and mindset (a knowledgeable prospect who knows what he wants, doesn't mind paying a premium for superior quality, and is probably ready to buy right away). But that's just the beginning. When you delve deeper, you can find out more about your prospects. When you examine a cross-section of your traffic and analyze the keywords that brought them to your site, you'll be able to compile psychographic profiles about your customers which you can use to tailor your offer so that it appeals to many of them. Sophisticated scripts and analytics packages reveal a lot of nuances and details about people visiting your website. Analyzing this data, comparing it against the actions visitors take on your site, tweaking your landing page to test different approaches, and then scaling up your SEO efforts will quickly multiply the results from your online business in a dramatic and even unbelievable way! Sadly, too many online businesses use data analysis packages to simply count visitors to their site. That's a waste of precious information about key performance indicators that can make you very successful. Mining this rich resource hidden inside your traffic logs can transform your business in a very short time. One of the costliest mistakes you could make as a business owner is assuming that you know what your prospects like or want. You are not in control. They are. Your role is to fill their needs. Find out what they are looking for. Analyzing keywords and traffic data will help you uncover this information. Then integrate that knowledge into all components of your website marketing. Align your SEO campaign with this to enjoy mind-boggling results. SEO is not about just designing the best website for search engines to rank higher. Intelligent and effective SEO is about designing the best site for buyers to find what they want - and then position that site in front of your ideal audience to deliver the highest value to your business. In that sense, smart SEO is just applied psychology, adapted and modified to integrate effectively with other elements that power the e commerce engine. So how to plan the perfect system for digital marketing and SEO? A good strategy to base your plan on is Paul Smith's SOSTAC® model of marketing, which relies on 6 simple elements that guide every effective marketing plan. Situation - Where are you right now? Objectives - Where do you aim to go? Strategy - How will you get there? Tactics - What will you do to execute this plan? Actions - Who will carry out each step? When will they finish? Control - How will you monitor and measure the process? Simple? Yes. Effective? Very. Let's adapt this to your SEO strategy, and see how a step by step plan can help you as an SEO consultant in devising a strategy that's rooted in buyer psychology and executed in a systematic fashion like a well-planned military operation. Situation Analysis In any SEO campaign, it is mandatory to find out where you stand right now in the context of your business, your competition, and your search rankings. How is your SEO doing now? Look at your search rankings for top money keywords, your optimization activities, your traffic targets, and all other relevant elements of your business. How well is your SEO campaign working? Are you getting progressively higher rankings on an increasing number of important keywords? Are you targeting the right keyword phrases? A few key terms will account for the bulk of your sales and profits. Are you ranking high on these terms? Is your SEO campaign effective? Are your efforts appropriate, cost-effective, and future-proof against shifts in search paradigms? How well is your SEO protected against adverse trends? Will a single algorithm modification decimate your search rankings, or will you be among those still standing? Setting Objectives Once you know your current status, you must define your goals and targets for the future. These questions will help you do it. What is your mission? Remember, you're not blindly chasing the #1 search ranking. Making sales, generating profits, achieving KPIs are all just as important. Clearly define your goals. What are your business objectives? Is making more sales your bottom-line target? Or do you have other objectives? Are they being served by your SEO strategy and action plan? Which are your highest priority objectives? Your SEO strategy may have multiple goals. But which are the most important? Knowing this will help with your planning. What are your marketing objectives? SEO is about getting higher ranking and driving more traffic. But without objectives for these visitors once they enter your marketing funnel, most of it will be wasted effort. Are your SEO objectives SMART? S - Are they specific? M - Can you measure them? A - Have you formulated an action plan using them? R - Are they achievable realistically? T - Is there a time frame to achieve them? Strategy Setting Your SEO campaign must take you (or your client) closer to their business objectives. No one can dominate every facet of their niche in search results. The first step is to segment your market so that you identify a section you can serve optimally. Targeting your audience within a broader niche allows you to deliver greater value to your best qualified prospects, and also position yourself to be most appealing to them. Tactical Planning Everything you've done until now falls under the head of \"planning\". Whether your strategy succeeds or fails will depend upon how well you can implement your plan. Decide which SEO tactics and tools to use. You are spoiled for choice. Trying to deploy every technique, skill and resource in your arsenal may not work as well as mastering just a few of the most effective ones. Plan how to use the tools. The same technique or software or service may be used in different, creative ways to achieve synergy with all other aspects of your marketing. Fine tune your marketing message and focus on it throughout your SEO campaign. Confused prospects do not buy. Telegraphing a clear and consistent message is an important component of your SEO strategy. Budget intelligently. This helps maximize those channels for marketing that are within your scope and reach, rather than spending tiny sums on many approaches, none of which will deliver the results you seek. Plan Action Steps Your SEO campaign needs an action plan to outlines the role of each member in the team. Who is in charge overall of SEO related decisions? For smaller businesses and promotions, one person may oversee the entire process. For more complex projects, roles must be assigned to different members. Are those selected for the task the best choices to do it? Why? Are the right people in charge of each step? If not, who is - or what must they learn, or have, to be able to do it? When must the actions be completed? Setting deadlines for each component of the overall plan is important. How can you find out if they are performing well? Select parameters that will indicate that the tasks are being carried out effectively. How to measure progress? An easy to understand visual progress report can help get teams excited and working together with more enthusiasm. Control Progress Controlling an SEO campaign involves staying on top of multiple activities and keeping track of relevant indices. Are you measuring data related to your SEO goals? Keeping track of what's really important to your bottom-line is helpful in maintaining control. Who will measure progress? While software will compile much of the information, someone on the team still must be tasked with monitoring and reporting on progress. How frequently do you need to measure things? Some processes need closer monitoring. Others can be tracked less frequently. Deciding which measurements matter will ensure that critical components are more closely observed. What tools will you use? Whether or not you use expensive, complex and intricate software and tools is a choice to make early on in your campaign. Choosing effective tools which are also cost-effective will impact the overall success of your campaign. What will you analyze, and how? Decide how you will use the data you measure to guide future decisions and actions. How to deal with variance? When things go contrary to your expectations, do you have a fall-back plan in place? How will you put it into action? Who will decide, and what steps will they take? There's one last step. After you've evolved an outline, you must check to see if what you've created also fits the goals of the RACE planning system, and is able to: Reach - your prospects and customers Act - achieve interaction with your audience Convert - turn prospects into leads or customers Engage - continuously, over time, and generate repeat business That's because the ultimate goal of any effective SEO strategy is to go beyond the obvious target of ranking high on search engines for your highest value keywords, and attain the Holy Grail of generating more sales, delivering more profits and creating more impact in the marketplace. This step by step outline to come up with your SEO strategy that's based on a rock-solid marketing model can seem intense and complicated. But by following this simple plan of action that asks and answers a few critical questions, you'll quickly evolve a winning SEO strategy... that's based on getting inside your customer's head! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Get Inside Their Heads - A Strategic Framework For Super-Effective SEO!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Get Inside Their Heads - A Strategic Framework For Super-Effective SEO!"
    },
    {
      "level": "H2",
      "text": "SEO isn't about code - it's about people."
    },
    {
      "level": "H2",
      "text": "Keywords are the clue."
    },
    {
      "level": "H2",
      "text": "Situation Analysis"
    },
    {
      "level": "H2",
      "text": "Strategy Setting"
    },
    {
      "level": "H2",
      "text": "Tactical Planning"
    },
    {
      "level": "H2",
      "text": "Plan Action Steps"
    },
    {
      "level": "H2",
      "text": "Control Progress"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Trond Lyngbø\n          \n            Trond Lyngbø\n          \n            Trond Lyngbø"
}