{
  "url": "https://moz.com/blog/get-email-alerts-for-new-backlinks-with-open-site-explorer",
  "slug": "get-email-alerts-for-new-backlinks-with-open-site-explorer",
  "title": "Get Email Alerts for New Backlinks with Open Site Explorer - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Recently SEOmoz added a new function to their Open Site Explorer called Just-Discovered Links. Instead of having to wait for new index updates and comparing your CSVs, you can simply monitor the new links tab. Unfortunately SEOmoz doesn’t have RSS support for Just-Discovered links. And checking for…",
  "content": "Get Email Alerts for New Backlinks with Open Site Explorer Link Building By: Martijn Oud May 13, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Martijn Oud May 13, 2013 Get Email Alerts for New Backlinks with Open Site Explorer Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Recently SEOmoz added a new function to their Open Site Explorer called Just-Discovered Links. Instead of having to wait for new index updates and comparing your CSVs, you can simply monitor the new links tab. Unfortunately SEOmoz doesn’t have RSS support for Just-Discovered links. And checking for page updates every day is probably not the best use of your time. In this YouMoz I'll demonstrate a quick and easy way to monitor new backlinks to websites. I've set this up for my own site, but also my competitors. It shouldn't take you more than 30-45 minutes to set up, and it will save you a lot of time. What we will be doing is creating an RSS feed for that page and then sending an email for every new feed item. Don't worry, we will use free tools to accomplice this. No programming knowledge needed. Step 1) Get the URL Personally, I would like to be know every external new link to a website (root domain). For that, use the URL below. Replace www.example.com with the domain of your choosing. http://www.opensiteexplorer.org/just-discovered?page=1&site=www.example.com&sort=crawled&filter=&source=external&target=domain&group=1 Of course you can change this to fit your needs. Step 2) Creating an RSS feed To get around not having an RSS feed, I use a service called Page2RSS. You simply enter a page URL and this website does all the magic for you. It’s free and doesn’t require an account. It’s not perfect; there are no instant updates and sometimes feed entries are blank. Still, it works just fine for this particular job. With this feed I use another free service to email every new feed item. Now, the most important part is being notified of new links. For this, we will use IFTTT. Step 3) Setting up email alerts IFTT (if this then that) is a online service that lets you create triggers. For example, you can ask to be sent an email if it’s going to rain tomorrow. Or tweet ‘Happy New Year’ at New Year's (more ideas). You can also ask it to send you an email each time a RSS feed is updated. This is what we are going to use. Here is the recipe that I use. For feed URL enter the RSS feed you created in step two. Instead of an email you can also use other channels as well, like Twitter. You can then adjust the email to your needs. Make sure to enter the name of the website you are monitoring in the subject. This makes for easy filtering in your email service later. This is a quick workaround until SEOmoz adds RSS support. Hopefully, they’ll even add email alerts! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Get Email Alerts for New Backlinks with Open Site Explorer"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Get Email Alerts for New Backlinks with Open Site Explorer"
    },
    {
      "level": "H2",
      "text": "Step 1) Get the URL"
    },
    {
      "level": "H2",
      "text": "Step 2) Creating an RSS feed"
    },
    {
      "level": "H2",
      "text": "Step 3) Setting up email alerts"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Martijn Oud\n          \n            Martijn Oud\n          \n            Martijn Oud"
}