{
  "url": "https://moz.com/blog/get-more-visitors-without-ranking-higher",
  "slug": "get-more-visitors-without-ranking-higher",
  "title": "Get More Visitors to Your Website Without Ranking Higher - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "At this week's SMX, Rand made a comment about two big brands that ranked at #2 and #3 for their industry's generic keyword behind an exact match domain. Referring to SERPs Click-Through-Rate data, he suggested that you could calculate how much more traffic the larger brand could receive from the…",
  "content": "Get More Visitors to Your Website Without Ranking Higher On-page SEO By: Rob Ousbey May 22, 2009 Table of Contents Copied! By: Rob Ousbey May 22, 2009 Get More Visitors to Your Website Without Ranking Higher On-page SEO At this week's SMX, Rand made a comment about two big brands that ranked at #2 and #3 for their industry's generic keyword behind an exact match domain. Referring to SERPs Click-Through-Rate data, he suggested that you could calculate how much more traffic the larger brand could receive from the keyword by moving from position 2 to position 1. At the risk of getting a stern talking to, I'm going to have to ask: really? I'm confident that where you see a well-known brand's site next to an anonymous brand, the recognised name will get a disproportionate number of clicks. The location of each user's click can't be modeled by some exponential decay function; the titles, descriptions and URLs (including the goodwill associated with a strong brand) will have a significant effect on click through rate. So, there's our opportunity to stack the odds in our favour. If it's true that more than 50% of people click on a result other than number 1, this means that most people disagree with the search engine's judgment as to which page best satisfies their query. And what about all the searches that don't result in any clicks at all? Quite a few sites appear to be thinking creatively to improve the number of clicks they receive, so here are some tips you can implement in order to get more visits from any keyword, without having to improve your ranking. Use language that sells Use compelling language in the snippet where possible, by placing sales-orientated text near the first occurrence of the target phrase. For example, in the screenshot below (and overlooking any brand loyalty that people may have to Amazon or Game), the idea that a Wii Remote has free delivery is more compelling than knowing it can be used as a sword AND a paintbrush. If you've got a strong brand, use it Remember that sometimes there's no competition for clicks when the user has their destination in mind before seeing the results. For instance, a user may know they want to go to Wikipedia when they search for \"The Shirehorses\" and head there despite it ranking at #3. A very similar thing is likely to happen for product / shopping searches, where the searcher has brand loyalty to a particular retailer. I imagine that Amazon receives a similar amount of traffic (if not more) than Canon does for the search 'canon 400d' - this might still be a destinational search. However, in this situation Canon could get the clicks from people who are researching the product as well as those about to buy if they manipulated their snippet to say something like, \"See full details for the Canon EOS 400D, and buy it direct for the best online price.\" Prove that your site is going to be useful Get listed in Google Local, and get a map and reviews next to your branded search results. OK: you'd hope not to ever lose clicks from your branded search, but a result like that below gives real trust to the visitor. To see an example where users might avoid the official site in a branded search, consider another London venue: is it easier to find the opening hours on the official Sketch site, or on the View London page? Cover all the bases for organic DKI Fake your way into using dynamic keyword insertion for organic search. Although Google still prefers to use the meta description of a page as the snippet when possible, in a search of more than a couple of words, it often needs to pull a quote from the page in order to show text relevant to the search. By using the exact match of popular variants of your search terms (particularly ones with valuable searcher intent) within your text, you can have the search terms highlighted in your snippet in order to demonstrate high relevancy. (Of course, you should be doing this anyway if you want to target those particular terms.) The example below shows three of the UK results for 'choose an engagement ring'. The user doesn't want to know how to buy one, doesn't want to know the etiquette, but wants help choosing one - the third link is likely to get the click. Don't give everything away too early Let's say a searcher needs to know the height of Mount Everest in inches, or can't remember the order of parameters in PHP's strrchr command. They might see the following results in Google: There's no need for them to click through to the results. Using a variation of the earlier advice, make sure the 'answer' on the page isn't right next to the first mention of the search term if you want to get people to actually visit your page. These similar examples ('height of mount everest in yards' and 'str_replace') don't spill the beans too early. If you've being using similar techniques, or have seen sites that you think should be getting more clicks from their search results, please do share them in the comments. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Get More Visitors to Your Website Without Ranking Higher"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Get More Visitors to Your Website Without Ranking Higher"
    },
    {
      "level": "H2",
      "text": "Use language that sells"
    },
    {
      "level": "H2",
      "text": "If you've got a strong brand, use it"
    },
    {
      "level": "H2",
      "text": "Prove that your site is going to be useful"
    },
    {
      "level": "H2",
      "text": "Cover all the bases for organic DKI"
    },
    {
      "level": "H2",
      "text": "Don't give everything away too early"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rob Ousbey\n          \n            Rob Ousbey"
}