{
  "url": "https://moz.com/blog/getting-attention-as-a-blogger-through-blogger-interviews",
  "slug": "getting-attention-as-a-blogger-through-blogger-interviews",
  "title": "Getting Attention as a Blogger Through Blogger Interviews - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I run a 'kinda-sorta' authority blog on blogging and making money online, I'm always thinking of new ways to be a better blogger, make more money, just be good enough to preach about what I practice, to do that properly I try all sorts of new strategies. This is one of them. I've been thinking…",
  "content": "Getting Attention as a Blogger Through Blogger Interviews Content Marketing G By: Gnet September 9, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! G By: Gnet September 9, 2008 Getting Attention as a Blogger Through Blogger Interviews Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I run a 'kinda-sorta' authority blog on blogging and making money online, and I'm always thinking of new ways to be a better blogger, make more money, and just be good enough to preach about what I practice. To do that properly I try all sorts of new strategies. This is one of them. I've been thinking really hard about ways to get my blog a little more known in the high-profile blogger area. I've thought of paid ads - too expensive, in my opinion. As always, there's an easier way to do everything--I just needed to figure out how. So out of nowhere I thought of spreading some link love around by doing some blogger interviews. After asking a few people here and there, I had a lot of responses and some even volunteered for them (maybe because of the free publicity and PR5 links...I don't know :p). I asked around 50 bloggers or so and had a great line of interviews lined up for at least 2 weeks. At first I never thought that interviewing other people would be in any way profitable for myself, but soon I had an increase of 100 RSS subscribers and a lot of link love from other bloggers as well. Anyway, I've learned a few things from this: Don't do interviews if you are doing it for yourself: think of the person being interviewed first. Content first, monetization later. Do it for the benefit of someone else. If you are really doing it out of goodwill, you'll get something in return, too. The better the interviews are, the more attention your blog will get. If the interview you conduct is what your readers are looking for, then obviously you'll get more reaction from them, which could be traffic, links, social media support, etc. The more questions, the better. Ask your heart out. Focus on things that benefit both the interviewer and the person being interviewed. The better your questions are, the more your readers will look forward to the next one. Don't just ask questions about their life and business, but ask them what they do to make money and get traffic, and ask them for tips as well. So far the blogger being interviewed is benefiting, so let's think about your own readers, if you ask these bloggers questions about how they go about making money, getting content/traffic, etc, that will be like an added value to your interview and provides another reason for readers to come back for more. Here is the list of interviews I did. You can see that I've asked almost everyone the same questions; that's because everyone has different tactics and opinions on the same topics, so this is where my readers learn what works and what doesn't. Adnan - Blogtrepreneur.com Michael Dunlop - Retireat21.com Steven Snell - Traffikd.com Chad Ledford - 3tailer.com Jason Pereira - TheUniversityKid.com Scott Weaver : AffToolbox.com Javier - Mr.Javo.com Adriaan “Adii” Pienaar - Adii.co.za Shannon Lilly - InfectedByBugs.com Patrick Altoft - Blogstorm.co.uk Max Miroff - BlogBadly.com David Peralty - eXtra For Every Publisher - XFEP.com Kevin Muldoon - BloggingTips.com Collin LaHay - MixedMarketArts.com Aaron Nimocks - AaronNimocks.com One more thing, doing interviews not only gave me a lot of readers but a hell of a boost in Alexa. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Getting Attention as a Blogger Through Blogger Interviews"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Getting Attention as a Blogger Through Blogger Interviews"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Gnet\n          \n            Gnet"
}