{
  "url": "https://moz.com/blog/getting-users-to-try-something-new",
  "slug": "getting-users-to-try-something-new",
  "title": "Getting Users to Try Something New - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There is not enough time in my day for me to read about, dabble with, and build all the blog articles, internet-based tools, and web-related projects that I desire; some carry over to the next day, much gets lost to the ether.  But, when I get excited about something going on in the websphere,…",
  "content": "Getting Users to Try Something New Marketing Psychology By: Michael Shearer February 7, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Michael Shearer February 7, 2007 Getting Users to Try Something New Marketing Psychology This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. There is not enough time in my day for me to read about, dabble with, and build all the blog articles, internet-based tools, and web-related projects that I desire; some carry over to the next day, much gets lost to the ether. But, when I get excited about something going on in the websphere, something new and simple, I like to promote its use. For example, not that it’s new, but Del.icio.us is such a smart tool amongst other social bookmarking tools. You and I know this, but does my neighbor, my co-worker, or my wife? They should, but how do you get them to 1) understand how the tool works, and 2) use it regularly? One way I’ve addressed these questions is, at my day job, I built a Del.icio.us page for website resources for the Admissions department to share with prospective and current students. They can now just go to the Del.icio.us page and use the tags to find what they are looking for. Do they use this page often? I don’t know for certain, but I don’t believe so. Did I do something wrong when I explained it? Is it too foreign of an idea from their normal day-to-day activities to use? What is it about the unfamiliarity that prevents it from being utilized? As a comparison, I’ve also implemented Gold Mine contact management software. Although new and outside of the norm of their daily business as well, it is much more popular in usage. Why? Because they have to use it; the Admissions director requires it. It is disappointing for me to think that it takes force for something to take hold, but at a j-o-b, that is often the case. More than the force factor in this comparison, something else evolves in my thinking and analysis of the situation…consistent exposure. Like bookmarks and the organization of them, information can get misplaced. If people don’t find a regular need for the tool right away, it gets lost in the shuffle. I bet if I sent an email out every time the EMS page gets updated (and update it on daily basis), people would start using it. With some exciting verbiage in my message, like a description of each of the new links and when to share it, I could make this project take off. (In fact, I am so compelled that I am going to get on it after this…as part of an Intranet page build.) So, to get away from requiring someone to do something, and getting them excited about it instead, you have to be excited yourself and express it regularly. Take this with you in everything you do. If you see a major improvement on the SERPs for a targeted key phrase, share your excitement along with the details. Do this regularly for accomplishments small and large, and your clients, your co-workers, your friends will grow in their appreciation as well. This growth will make your work more meaningful to them and rewarding to you. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Getting Users to Try Something New"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Getting Users to Try Something New"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Turn Marketing Into Meaningful Relationships — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Catering to User Behavior Shifts During Times of Economic Turbulence — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Close More Sales With Emotion-Driven SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Michael Shearer\n          \n            Michael Shearer\n          \n            Michael Shearer"
}