{
  "url": "https://moz.com/blog/getting-started-with-paid-promotions",
  "slug": "getting-started-with-paid-promotions",
  "title": "Getting Started With Paid Promotions - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Paid promotion is a crucial part of any holistic digital marketing strategy. By using the range of paid online promotion and advertising tools available, we can take more comprehensive control in presenting the best user experience throughout the funnel, delivering the right content, at the right…",
  "content": "Getting Started With Paid Promotions Content Marketing | Online Advertising By: Anthony Coraggio November 24, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Anthony Coraggio November 24, 2014 Getting Started With Paid Promotions Content Marketing | Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I'm receiving more and more questions from clients about how best to leverage paid content distribution and paid social platforms (here referred to together as 'paid promotions'). There's a lot of reason for increased interest—as content production has ramped up in digital marketing, it has become harder and harder to stand out from the crowd and reach the audience you want. Facebook shutting down companies' free lunch social distribution has only further pressed the issue—and sometimes you've simply maxed out on other paid channels! But more than simply being an extra 'pay to play' option, paid promotion is a crucial part of any holistic digital marketing strategy. By using the range of paid online promotion and advertising tools available, we can take more comprehensive control in presenting the best user experience throughout the funnel—delivering the right content, at the right time, to the right person. There are three primary functions of paid promotions: Improve the breadth and depth of content distribution Use powerful targeting to drive more qualified traffic Capture, retain, and shepherd qualified users to ultimately produce conversions How and why you might use paid promotions will of course vary quite a bit, but regardless of your end goal, there are two key tasks for anyone seeking to succeed in doing so. Do these two things right, and you will have laid a solid foundation for achieving your goals. First...1. Define and target a specific audience Defining a target audience in digital advertising or paid promotions is a more exacting exercise than usual, because we're actually operationalizing a definition that can be precisely carried out by setting controls in a PPC-like interface. Think of it like programming a computer—you need to break down your definition in extremely concrete, exclusive terms that are interpretable by the tool you're using. Don't despair though—it's not hard to do, and if you've been a good marketer and developed some proper user personas you'll be ahead of the game! Answer these questions to set a concrete definition of the people that should be targeted with a given campaign or content release. These are typically going to be the criteria you actually enter into an interface when starting a promotions campaign on a tool like Facebook or StumbleUpon. Demographic Information - Our ideal target for this content is... Age - Many platforms will offer simple age based targeting, usually in the form of your typical \"18-24, 25 – 36\" type brackets. Gender - Again, this is a simple demographic setting and is often available. Think about setting up separate 'A/B' versions to separately address men and women when relevant! Education Level/Status - Is your audience in school? Have they completed a degree? Facebook and LinkedIn will let you drill in on these parameters. Geography - Be as specific as possible. Generally, the combination of a state/province and a metro area level is as granular as geotargeting options go. There are a few more options you can find on places like Facebook -income level, marital status, employment status, and more can be particularly useful in B2C contexts. Many platforms will also give you an opportunity to define your target audience by interests, so think about what relevant topics or subjects the target user might be particularly interested in or looking for while online! For example, likes for travel blogs, language learning sites, famous travel writers, country specific cuisine, etc all can be used to converge on a very specific type of person.2. Choose promotion channels Once your target audience has been defined and the above questions answered with the best data available, you must consider the channels or platforms that will best make use of it. There are three major factors: Which platforms have targeting capabilities and an audience that can best replicate the user profile using their targeting? Remember to weight the user's expected online behavior heavily in selecting platforms – while one might offer targeting to match the most targeting characteristics, if your audience does not actively use the platform's core service it is of little value as a promotional channel. Which platforms can best present the media to be promoted? It is important not to detract from the user's experience of the content, or place it in a channel that does not fit it's form. A long form video, for example, will not usually fare well in skippable preroll spots or on-site rollover placements. Remember also that use of different platforms can depend on device – and so might the usability of your content! What behavioral context is preferable to achieve your objectives for this piece? I strongly recommend taking a few minutes to browse around as a user when making these decisions, in order to think less abstractly about the experience you aim to create. Choosing channels is often a case-by-case process, but for common objectives there are some simple, intuitive guidelines to keep in mind: If you want your content shared, promote it on channels that have built-in sharing capabilities (social media, StumbleUpon). If you want users to feel they've 'discovered' a piece, focus on content plug-ins (Outbrain, Zemanta, etc), discovery tools (StumbleUpon), and more niche placements (subreddits, subject blogs)—depending on the accessibility/simplicity. If your goal is a high level of direct exposure for content at a low price, content discovery plugins and display ad networks can deliver. Cost is relatively low and inventory is high, so it's easy to get eyeballs on your work. If conveying authority is important, officially sponsored or openly disclosed promotions on respected media platforms or with trusted individual publishers can be a good tool—though often more expensive. It can be useful to combine these guidelines to plan for more complex goals. For example, if you want to convey a sense of 'discovery' but also encourage sharing, StumbleUpon Paid Discovery could fulfill both these needs—the sponsorship is subtle, the user is in 'discovery mode', and SU has a social sharing frame right on top of the page. If that audience isn't engaged enough, you might bring traffic to a piece via Reddit and retarget for sharing on Twitter. Planning for promotion should not be an exclusively post hoc activity—the content itself should be created with intended placement and utility in mind. Engage early in the process as goals for the content are first set, so that creative development and objectives do not ultimately conflict with the feasibility of promotions. Simply being involved in the conversation to flag potential problems is often enough! Think outside of yourself… One of the most critical parts of this framework is leveling what you want to achieve with what users will accept and value in a given medium, so I want to take a moment to reinforce the importance of this. In answering questions of targeting and placement in a performance-driven world, it can be dangerously easy to think egocentrically, only in terms of what YOU want your customer to do in a given context—or more insidiously, what you want them to want to do. Remember that as a marketer or advertiser you are necessarily carrying tremendous baggage, both in terms of product knowledge and expectations. It's tremendously important to step back from your own (or your company's) perspective and think as a user. What you ultimately need to reach your goals isn't necessarily what individuals using one of these channels wants when doing so, or are ready to do. Take the time to understand your audience and reach out to them in a way will resonate with the journey they are on. What considerations do you pay special attention to when promoting content? Are there areas of the discipline you'd love to learn more about? Hit me back in the comments! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Getting Started With Paid Promotions"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Getting Started With Paid Promotions"
    },
    {
      "level": "H2",
      "text": "1. Define and target a specific audience"
    },
    {
      "level": "H2",
      "text": "2. Choose promotion channels"
    },
    {
      "level": "H3",
      "text": "Think outside of yourself…"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Anthony Coraggio\n          \n            Anthony Coraggio\n          \n            Anthony Coraggio"
}