{
  "url": "https://moz.com/blog/getting-authorship-to-work",
  "slug": "getting-authorship-to-work",
  "title": "Getting Authorship to Work: A Moz.com Case Study - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We all know authorship is important, but it can be really hard to get working properly. Here's how we (finally) got authorship working the way it should on Moz.com.",
  "content": "Getting Authorship to Work: A Moz.com Case Study Technical SEO By: Ruth Burr Reedy January 21, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Ruth Burr Reedy January 21, 2014 Getting Authorship to Work: A Moz.com Case Study Technical SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Editor's note: Since the publication of this post, Google has discontinued support for authorship markup in web search. While we're leaving this post up for reference, we want you to know that implementation of authorship will no longer result in rich author snippets shown on SERPs. Carry on! Having author markup working on your site is important—especially if, like Moz, you're producing new blog content daily. Not only does having an author picture snippet in the SERPs help increase clickthrough, it also builds trust with users when they see an author they already know and respect has written a piece of content. Author markup may also help sites get other special results such as the in-depth article result. All in all, Google seems to be doing a lot to encourage blog owners and writers alike to implement authorship markup on their sites. So why is it so $@%#! hard to get working properly? Behold the epic saga of trying to get authorship working on Moz.com. It's been almost two years, and we've finally gotten it working (mostly) correctly. I wanted to share our journey with you in the hopes that it will take you less time to figure out what's going on with your own site. Part I: In which we have a brief hiccup followed by success When I started at Moz back in 2012 (in the before times; the long long ago; the SEOmoz), authorship wasn't working properly on Moz.com because… well… it hadn't been implemented properly. In the \"Join the Moz Community\" buttons you see to the right of each blog post, the link to our Google+ page was overriding author markup on individual posts. This meant that Google thought that the Moz page was the author of each posts. We were getting a nice little author snippet with Roger's picture, but individual authors were out of luck. A friendly Moz community member pointed this out right after I started, and we were able to get it fixed up pretty quickly. The result: SUCCESS! We started seeing correct authorship snippets almost right away. And I was all like: But then, something changed. Part II: In which everything is terrible After several months of authorship appearing for content on Moz.com with no problems, our authorship snippets disappeared. Poof! Suddenly we couldn't find a single example of the snippet appearing for Moz content. The worst part was that Google's Structured Data Validator tool claimed that our author markup was working just fine: What often happens in situations like this is that Google changes the criteria for a snippet to appear, but doesn't update the validator tool until much later. In this case, what I suspect happened is that Google got stricter about how markup could be implemented and still work, probably due to too many false positives. Our markup wasn't perfect, but it was close enough for Google to connect the dots—until they decided not to anymore. Unfortunately, this also meant we couldn't rely on the validator tool to tell us whether or not we'd fixed the problem. With no more information than \"it stopped working for some reason,\" I set out to troubleshoot everything I could think of. Part III: In which things are tried We were using the 2-link method for authorship markup, in which we link from the author's byline to his or her Moz profile with \"rel=author\" and then from the author's profile page to their Google+ page with \"rel=me.\" Like I said, this was working fine until it wasn't anymore. Here are the things we tested to try to get authorship working again: Nofollow links from social sharing buttons to Google+. Remembering our earlier fiasco, we tried nofollowing links to Google+ from our social sharing buttons. I remember thinking \"if this is the problem, that's really stupid\" but it wasn't. Result: No change. Linking directly from author byline to Google+ profile. Historically on the Moz blog, the post author's byline links to his or her profile page in our community section. Concerned that this made for too many links for Google to parse, we tested linking directly to authors' Google+ profiles from their bylines. Result: No change. Also, you guys HATED it. Turns out that the ability to click through from an author's byline to read more posts by that author is a feature our readers love. Adding nicknames in Google+. Many of our authors don't blog under their real names. For example, Dr. Pete's first name isn't really Doctor. To see if the nickname thing was throwing Google off, we got a few of our authors to add their nicknames in Google+. Result: No change. Start using authors' real names. In your Moz community profile settings, you have the option to tell us whether or not you're comfortable with us displaying your real first and last name, as opposed to your username. Because not everyone chose this option, our default was to show everyone's usernames. Since Google+ is such a stickler for people using their real names and faces, we updated our settings so that users' first and last names were their author bylines instead of their usernames. Result: No change, but… Link to Google+ with real names. Feeling sure we were onto something with the whole \"real names\" thing, we tried switching the anchor text on profile page links to Google+ profiles. Now, instead of saying e.g. \"randfish on Google+,\" links to Google+ from Moz profile pages would say \"Rand Fishkin on Google+.\" Result: Success…? Our \"use real names\" initiative got authorship snippets appearing in the SERPs again: hooray! However, in many cases they were the WRONG results: This is a post by Rand. This is a picture of Erica. Part IV: In which all (OK, most) is revealed It turns out that Google is currently very sensitive to byline information. Any instance of the word \"by\" followed by someone's name – especially if that person also has authorship set up on the site as well. On the Moz blog, any comment that had been edited after posting had a notice that said \"Edited by (user) on (date).\" That extra instance of \"by\" followed by a name was messing Google UP. We changed the wording on edited comments, and authorship was fixed! Mostly! We are actually still seeing this problem crop up from time to time in posts where we say \"by (person's name)\" in the body of the blog post, and then that person comments on the post. It's not a super common occurrence, but it does happen, especially since people tend to comment on posts in which they're mentioned. Beyond removing the instance of \"by\" and changing the post wording, I haven't figured out a systemic fix for that yet. Further bulletins as events unfold! TL;DR In order to get authorship working, here are some things to keep in mind: You can't always trust the validator tool. Check your SERPs (in an incognito window or with personalization turned off) to be sure. Google takes any instance of \"by (person's name)\" seriously, so if you're getting the wrong author snippet, check for that first. Adding nicknames in Google+ is much less effective than using your real name. Wherever possible, use real first and last names to get author snippets. For more on troubleshooting authorship, read Mark Traphagen's post from last year (notice I didn't say \"this post by…\" well, you get the idea). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Getting Authorship to Work: A Moz.com Case Study"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Getting Authorship to Work: A Moz.com Case Study"
    },
    {
      "level": "H2",
      "text": "Part I: In which we have a brief hiccup followed by success"
    },
    {
      "level": "H2",
      "text": "Part II: In which everything is terrible"
    },
    {
      "level": "H2",
      "text": "Part III: In which things are tried"
    },
    {
      "level": "H2",
      "text": "Part IV: In which all (OK, most) is revealed"
    },
    {
      "level": "H2",
      "text": "TL;DR"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ruth Burr Reedy\n          \n            Ruth Burr Reedy\n          \n            Ruth Burr Reedy"
}