{
  "url": "https://moz.com/blog/getting-a-link-from-dmoz-isnt-worth-what-it-once-was",
  "slug": "getting-a-link-from-dmoz-isnt-worth-what-it-once-was",
  "title": "Getting a Link from DMOZ Isn't Worth What It Once Was - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "More than a few folks have asked that I weigh in on DMOZ and going through several forum posts, it appears the need is dire. As many may have noticed, DMOZ hasn't been accepting any new submissions for several months - when you try to submit a site, they simply show this page (link condom applied;…",
  "content": "Getting a Link from DMOZ Isn't Worth What It Once Was Link Building By: Rand Fishkin December 11, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 11, 2006 Getting a Link from DMOZ Isn't Worth What It Once Was Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. More than a few folks have asked that I weigh in on DMOZ and going through several forum posts, it appears the need is dire. As many may have noticed, DMOZ hasn't been accepting any new submissions for several months - when you try to submit a site, they simply show this page (link condom applied; they'll get no quality votes from me): If you try to visit the editor forums, they specifically request that you don't ask about submissions or when the service might return. Welcome to DMOZ 2.0 - The Kafka Version. Luckily, it doesn't really matter. In a time long ago, DMOZ was an incredibly important link to have because: It brought direct traffic as many DMOZ pages ranked well for search queries and were used directly by web visitors before Google's serach boom. Google had the directory copied as the Google directory, which was linked to from their home page (now you have to surf all the way to their big services list to find it) DMOZ was an active place where new links were added, reviewed and modified, thus making it relevant and current DMOZ received new inbound links, thus making it valuable in the eyes of the search engines Nowadays, DMOZ is practically useless: SEOmoz itself, and many of our clients have listings in DMOZ - not one sends traffic above 10 visits per day, and SEOmoz's 3 unique listings send less than that each week (FYI - we never even submitted). The Google DMOZ clone is practically dead - we see even less traffic from that referrer DMOZ's activity has slowed to a crawl - new sites aren't being accepted, the editors have closed ranks to stifle discussion and those listings that do exist are typically quite stale DMOZ's rate of new inbound links have dropped; although folks still shoot over the occassional link, it's no longer the canonical source of information it once was, and many of the new links I see via Technorati are coming from splogs. For these reasons, it's my belief that a DMOZ link provides very little value compared to the effort or funds required to get in (with editors getting paranoid about abuse, it's even more expensive to bribe your way to inclusion nowadays - I know a business owner who paid over $1K). Spend your time elsewhere, folks; that time/money can be directed to content or marketing efforts with far greater ROI. In many ways, Wikipedia has replaced DMOZ as a source of reference information - the outbound links on the encyclopedia's pages serve as a directory of sorts, and while DMOZ link growth slows, Wikipedia's is red-hot. Still, I can't help but wonder about the possibilities for a new Internet directory classification project. DMOZ is a failed system and one we can expect will be almost completely abandoned within 2-3 years, but from its ashes, I suspect that someone could create a \"Web 2.0\"-style directory with the possibility to become something great. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Getting a Link from DMOZ Isn't Worth What It Once Was"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Getting a Link from DMOZ Isn't Worth What It Once Was"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}