{
  "url": "https://moz.com/blog/getting-started-with-guest-posting-whiteboard-friday",
  "slug": "getting-started-with-guest-posting-whiteboard-friday",
  "title": "Getting Started with Guest Posting - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In this week's Whiteboard Friday, I am going to be walking through how to get started guest blogging. There are plenty of articles all over the web that go into the finer details of guest blogging, but let's step back for a second and really talk about how to get started.\n\n\tFrom getting into the…",
  "content": "Getting Started with Guest Posting Whiteboard Friday By: Eric Enge June 29, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Eric Enge June 29, 2012 Getting Started with Guest Posting Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In this week's Whiteboard Friday, I am going to be walking through how to get started guest blogging. There are plenty of articles all over the web that go into the finer details of guest blogging, but let's step back for a second and really talk about how to get started. From getting into the guest blogging mindset to building up your list of guest blogging opportunities, we'll cover this topic from a top down approach. Happy Friday everyone! Please leave your own ideas and advice in the comments below too. Video Transcription Hi, I'm Eric Enge with Stone Temple Consulting. I'm here at SEOmoz to do a Whiteboard Friday today. We're a 25 person online marketing company that does consulting services for various people through the industry. What I actually want to talk about is how you get started with guest posting. There's a lot that goes into it, and there have been some great articles on SEOmoz that really get into the details of some of the aspects of it. But I want to step back and take you from the top down to help you get started. The first thing I want you to think about is the mindset. The mindset is really important. There's a lot of stuff out there, guest blogging services that offer you all kinds of \"sounds almost too good to be true\" type options. The reality is, for the most part, they are too good to be true. Done well and done right, this is hard work, but it can bring really good returns. What I'm going to do today, I'm really going to focus on the high- end approach to guest posting and how you get posts that are really brand building in nature. So let's dig in a little bit further. The first thing I want you to do is I want you to tap into your team knowledge. Get your key team members together. Get them in a conference room. Get them brainstorming. Where are the places you'd love to be covered in an article? Great place to start, because after all, some of them it might be possible. Once you have that kind of list in your mind, the next thing to do is to actually go check and see if they take posts. They may or may not have a policy on their site. If they do, that's a great thing to look for and can be very helpful. But sometimes they take guest posts without actually ever having been quite so overt about it. You can basically take this query here, site:targetdomain.com, whatever it is, and then put \"guest post\" or \"guest contributor\" or \"guest author.\" You can try different phases, and see whether or not they've ever taken those kinds of guest contributions in the past. Great place to start. Hopefully that gets you off to a good start. If that's not enough, you can actually go to next step, which is you can try some industry search terms. You can try things like, let's say you're in the Tupperware business. Tupperware and then guest post and you search on that in Google. That can be very helpful in potentially bringing targets up. These kinds of queries tend to be very noisy. You can actually do the same thing with Twitter by the way. There is a tool that somebody posted up on SEOmoz recently which is good at this. But it does tend to be very noisy. You'll have to sift through a lot of stuff to find targets that you'll want to deal with, but it still is worthwhile to get started if you have to go that way. The point of all this is you're looking for initial targets. Where the big win really comes in is when you start finding other prominent people in your industry space who are doing guest posts, because then you can follow their trails and see all the things they're doing. That's really the next step here that I want to lead you to. Once you've found authors, first of all you'll want to assess their prominence, because there are probably going to be a lot of spammy operators out there in your space that are doing guest posts, and you really don't want to follow their trails and see everywhere they've posted because you're going to get in the same kind of trouble that they're eventually going to be in. But you can see where these authors have guest posted by taking the author name in double quotes, and then put \"guest post\" or \"guest author\" or \"guest contributor,\" those various flavors. You can then see all the places where these people have posted in the past. Wonderful way to get a long list of targets and really get your campaign off to a powerful start. To me this is really the big payoff that you're looking for in terms of developing a good target list. Once you have this good target list, the next thing you want to do is you want to evaluate the target quality. You want to start thinking about: Are these sites where we want to be seen? Certainly if one of your prominent competitors or a prominent pundit in the industry writes on that site, that's a very good sign. Do they have a good readership? Is there a lot of social activity that happens from what they do at the site? Also the types of links allowed. It used to be when people did guest posts, it was all about those free, in context links with rich anchor text. I am telling you that strategy, which may still work for some people, is really a Titanic looking for an iceberg. So you really want to focus on how you find targets which are actually a little more restrictive. It's actually good if they allow outbound links in the body of the article. But if they're allowing you to stuff anchor text links to yourself in the body of the article, that's actually not good for you. The main thing you should expect when you're working with the right kinds of targets for guest posting is you're going to be getting attribution, byline level links, and that actually is the safest place to be in the long term for guest posting. It's the kind of policies that you're going to find on the most valuable sites anyway. So those are my thoughts on guest posting for today. I've enjoyed doing this Whiteboard Friday for you. Have a good day. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Getting Started with Guest Posting"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Getting Started with Guest Posting"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Eric Enge\n          \n            Eric Enge"
}