{
  "url": "https://moz.com/blog/getting-down-to-basics-building-a-blog-from-the-ground-up",
  "slug": "getting-down-to-basics-building-a-blog-from-the-ground-up",
  "title": "Getting Down to Basics: Building a Blog From the Ground Up - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In short, we needed to find a way to break into the jam packed real estate blog realm and find a unique voice that would help us stand out. When we first started we averaged 3,000 visitors a month. Less than seven months later, our growing real estate blog receives between 30,000 and 70,000…",
  "content": "Getting Down to Basics: Building a Blog From the Ground Up Blogging By: Chris Kolmar September 17, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Chris Kolmar September 17, 2012 Getting Down to Basics: Building a Blog From the Ground Up Blogging This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. In December of last year, we were tasked with expanding our company’s web presence through a blog. The goal was to not only create a popular image for our online real estate company, but strengthen our SEO. As a small Internet-based business this proved to be a challenge. The Internet is a large place and real estate is a popular arena dominated by sites that focus on beautiful aesthetics, housing statistics, or a combination of both. In short, Movoto Real Estate needed to find a way to break into the jam packed real estate blog realm and find a unique voice that would help us stand out. When we first started we averaged 3,000 visitors a month. Less than seven months later, our growing real estate blog receives between 30,000 and 70,000 visitors a month. Success is marked by failure When we started our blog push we chose a rapid testing model of trying, failing quickly, and learning from our mistakes. Our goal was to test how a new type of content would read. Over the course of several months we tried numerous approaches. We Pedaled real estate widgets Pitched demographic/housing data to schools Sent demographic/housing data to local businesses Created generic stories such as “most expensive home sold in ...” Each time we would write the posts and send them to blogs and reporters. And then we waited. Often nothing happened. Not only was it a learning experience, it was a humbling experience. In our search for ideas, we finally turned to infographics. We had moderate success with infographics that were tied to real estate, but it wasn’t until we tried an off-the-wall idea that we learned how to write about real estate. Stories about the upcoming presidential election are all over the Internet. This led us to ask a simple question: How much would the White House cost? We laughed about it, and then we figured it out. We shipped the story to friends, family, and bloggers and kept our expectations low. Then links started to come in, slowly at first. Within a few weeks our off-the-wall article was talked not only in the States but across the world. This was our first true lesson in writing about real estate: For 99 percent of people, real estate is boring. If you have a boring niche, don't write about your niche--at least not directly! We have seen time and again SEO suggesting ways to make your niche interesting so that people will link to you. Here’s the truth: the basics of plumbing are just not link-worthy (Well maybe if you make it a sing-a-long..). Real estate is the same way; do you really care that prices are up .3 percent month-over-month? People on the Internet want to be entertained. So give them what they want! Write something that is tangentially related to your niche, but is interesting to the mainstream audience. Our experimentation led us to three conclusions: Be entertaining Write what you know Make news, don’t report on it Be Entertaining People on the Internet want to be entertained. We learned to give them what they want. This meant creating content that was related to real estate, but also interesting to a mainstream audience. Valuing the White House is interesting to real estate junkies because it takes basic real estate principles and uses them in a different way. The same story is interesting to a larger audience because most people have a basic understanding of the importance of the White House in American culture. Write What You Know A second important fact we learned was to write what you know. Movoto Real Estate’s blog team consists of twenty somethings who sure as hell aren't experts on the real estate market. We can write a fantastic article about schools or the real estate market, but this doesn’t make us experts. We are, however, experts in pop culture, niche markets, and having fun. We used that to our advantage. We bypassed all the dry, boring facts of real estate and went right for the jugular--entertainment. We took our knowledge of popular culture and fun and combined these with a little math and economics. The end product was our signature niche--evaluating imaginary real estate. And people loved it--they really, really loved it. Make News, Don’t Report on It Our final lesson made more sense in hindsight. Websites such as Gizmodo, Wired, Forbes, Yahoo, and BBC link to the best content on the Internet. If you have some sort of new content no one else has, these titans of link juice will pick up your content. Which means the smaller sites will as well. Our imaginary real estate stories did this. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Getting Down to Basics: Building a Blog From the Ground Up"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Getting Down to Basics: Building a Blog From the Ground Up"
    },
    {
      "level": "H2",
      "text": "Success is marked by failure"
    },
    {
      "level": "H2",
      "text": "If you have a boring niche, don't write about your niche--at least not directly!"
    },
    {
      "level": "H2",
      "text": "Be Entertaining"
    },
    {
      "level": "H2",
      "text": "Write What You Know"
    },
    {
      "level": "H2",
      "text": "Make News, Don’t Report on It"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Chris Kolmar\n          \n            Chris Kolmar\n          \n            Chris Kolmar"
}