{
  "url": "https://moz.com/blog/getting-link-removals-wrong",
  "slug": "getting-link-removals-wrong",
  "title": "Getting Link Removals Wrong - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As someone who has overseen link removal campaigns, I am not down on link removals. They have a place, and I've seen positive effects from cutting out large chunks of really bad links (porn, pills, poker, you name it). But, I also believe there are good and bad ways to remove links, and I want to…",
  "content": "Getting Link Removals Wrong Link Building By: John Doherty February 5, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: John Doherty February 5, 2014 Getting Link Removals Wrong Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Ever since Penguin launched in 2012, SEOs who for years had built less than savory links, or companies who for years had ridden off the coat tails of these links, started to ask for links to be removed. I've heard many of my friends, like Wil Reynolds, repeatedly poo-poo it from the stage (Wil did it during his now famous \"Real Company Shit\" talk at Mozcon in 2012). As someone who has overseen link removal campaigns for clients when I was at Distilled, I am not down on link removals. They have a place, and I've seen positive effects from cutting out large chunks of really bad links (porn, pills, poker, you name it). But, I also believe there are good and bad ways to remove links, and I want to make an example here. In the aftermath of Matt Cutts coming out and warning people off from manipulative guest posting (something all of us have seen and grown more and more tired of in the past few years), I think a voice of reason is needed to stop companies from doing more harm than good to themselves. You’ll see an example of an email I received a few weeks ago, the day after Matt came out with his proclamation, but let’s cover some basics first before we get into conjecture. Why remove links? I'm not going to give a full diatribe on why you might want to remove links pointing into your website, as that is not the point of this article. But, here are some reasons why you may want to remove links - You aggressively obtained exact match anchor text back on 2008/2009/2010; Your organic traffic dropped for specific keywords (or rankings plummeted and did not recover) on or around the days we know Penguin rolled out (Algo History here) You're being proactive because you see that Google is increasingly lowering the barrier to classifying something as spam and you do not want to be caught out in the cold when the hammer drops That's a quick overview of link removal, and by no means complete. This one is. The guest posting fiasco For years now, as old tactics have quit being as effective (though many still work when done as part of a full and balanced campaign), many \"SEO\" companies turned to guest posting as a way of getting links. Many have done it well. They've built great relationships with sites that have a relevant audience to them, have driven traffic back to their site, and yes, built a link or two. But notice the order - first comes the business purpose (customers, traffic) and tertiary is links. Many other companies have tried to \"scale\" link building via guest posting, yet as we all know when you begin to scale something the first to go out the window is quality. And when you have your boss or client breathing down your neck to lower the cost per link (which is not the metric to base quality on, but money is important to keep an eye on), the temptation to outsource outreach or writing becomes very appealing. That’s why we’ve ended up with this: When Matt dropped the hammer a few weeks ago, many companies freaked out and started getting their guest post links removed, exact anchors and all. To me, this is stupid on many many levels, such as - If you wrote the content on a quality site, you should want credit in the form of a link, Google be damned; If you are requesting removal and the person is nice enough to remove the anchor text link, thank them instead of also asking that the branded link be removed too. Only manipulative posts are being targeted, and in my opinion if you been accepting bad poets just to get content on your site, you deserve to have your site disavowed. Removal Automation I'm in favor of automating what you can when it makes sense. Collecting data, smart algorithms to surface content via internal links, and the like are all examples of something that can and should be automated. When we talk about link removal, I'm all in favor of automating the initial data gathering of sites linking to your page(s) that have been affected. This is where the automation stops though, because a machine will never be as good as a human pair of eyes. We're not just removing links from low authority (from a strictly SEO domain or page authority perspective) sites, but from irrelevant sites where you placed a link just to get a link. Outreach should be personal. When you automate the gathering of pages to request your link be removed from, any SEO worth their salt will immediately see this. Here is a list of pages on HotPads that a site (redacted) asked that I remove links from (with an admission that they believe themselves to be negatively affected by a manipulative links penalty, which SEMrush seems to indicate as well): The problem here is that, as you can see, many of these are archive and category pages. They only have links on the actual guest post (and I was nice enough to remove the exact anchor. I left the branded link), but sent me this laundry list because they got it straight from OpenSiteExplorer or MajesticSeo, I'm sure. The other area you can automate is checking to see if links are still live, then manually qualifying if they should be or not. Many of the removal tools do this, or you can upload a list of pages to Scrapebox and see if the links are still there. I know link qualification is a tedious process (I’ve looked at tens of thousands of links to qualify them as good/bad in my career), but putting a human touch onto your work will long-term benefit you, I believe. What if my site is disavowed? Here's a question I've heard posed a few times: \"But won't my site get disavowed if I don't remove the link? Will my site suffer if I am disavowed?\" No one has studied this yet, mostly because you cannot know if your site has been disavowed or not. I have to believe that Google can tell semi-algorithmically if a site is being used for manipulative linking or not. With how long it takes for a disavow file to seem to take effect, I believe that disavow lists are manually looked at, and a site may be whitelisted if it is disavowed, but judged to not be manipulative. So no, I don't worry about my site being disavowed. If shady work was done in the past, then clean it up. If your site is clean, carry on. Conclusion I hope this has given you some food for thought before removing links or starting the process. It's a tricky business and can be quite effective when done well, but can cause more harm if done poorly. Proceed with caution. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Getting Link Removals Wrong"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Getting Link Removals Wrong"
    },
    {
      "level": "H2",
      "text": "Why remove links?"
    },
    {
      "level": "H2",
      "text": "The guest posting fiasco"
    },
    {
      "level": "H2",
      "text": "Removal Automation"
    },
    {
      "level": "H2",
      "text": "What if my site is disavowed?"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "John Doherty\n          \n            John Doherty\n          \n            John Doherty"
}