{
  "url": "https://moz.com/blog/getting-the-most-out-of-schemaorg-microformats",
  "slug": "getting-the-most-out-of-schemaorg-microformats",
  "title": "Getting The Most Out of Schema.org Microformats - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Properly using microformats is the best thing since sliced bread for an enhanced search display. There are SEO murmurs that sites without microformats will soon be left in the dust in the SERP display. Both Google and Bing have both introduced new tools in the Webmaster repertoire that help monitor…",
  "content": "Getting The Most Out of Schema.org Microformats Technical SEO By: Irving Weiss September 26, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Irving Weiss September 26, 2012 Getting The Most Out of Schema.org Microformats Technical SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Properly using microformats is the best thing since sliced bread for an enhanced search display. There are SEO murmurs that sites without microformats will soon be left in the dust in the SERP display. Both Google and Bing have both introduced new tools in the Webmaster repertoire that help monitor and troubleshoot issues the microformats. I am not going to delve into the all the individual schema.org microformats and I will suggest that every Webmaster review all entire list of microformats and see which are applicable for their site. Learn More about Schema:https://moz.com/learn/seo/schema-structured-data I want to stress the importance of using the testing tools and not to rely on your expectations of how the microformats should behave, even if you followed all the rules to the tee. Here are the steps that have been a tremendous help to me in ensuring that I not only tagged all the elements correclty but that I am taking the most advantage of the search display in Google and Bing. 1. Analyze your site content and tag data accordingly with microfomats supplied by schema.org. You can have many schemas on one page, like webpage, product, reviews, breadcrumb and video. Follow the schema guidelines exaclty and a good example that many people don't follow is to link every part of the breadcrumb, including the last part of the breadcrumb which is a self-reference to the page. <div itemprop=\"breadcrumb\"> <a href=\"category/books.html\">Books</a> > <a href=\"category/books-literature.html\">Literature & Fiction</a> > <a href=\"category/books-classics\">Classics</a> </div> 2. Copy the page code into the Google Rich Snippets Tool and know what you're looking for. Google will present how your rich snippets will look in the search results. You can see many rich snippets like rating stars, images, breadcrumbs and price data. Recently, I discovered that Google is sensitive to having certain tags in select schemas. Google wouldn't show the image snippet when I had the image tag in the Person schema and although that is valid within that schema, Google insisted that I move the tag to the Webpage schema before they would show it in the tool. Also, Google will not show every microformat and has a hierarchy of which microformats to display so make sure the output is what you expect it to be. 3. Review the extracted rich snippet data Google is showing in the tool. Is all the data in the right fields? Are there any data errors? Example of Extracted Microformat Output in Rich Snippet Tool: Item Type: http://schema.org/webpage aggregaterating = Item( 1 ) Item Type: http://schema.org/person honorificprefix = Dr. additionalname = Kenneth honorificsuffix = MD honorificsuffix = FACC honorificsuffix = FACS gender = male jobtitle = Thoracic Surgery jobtitle = Cardiothoracic Vascular Surgery jobtitle = Surgery honorificprefix = Dr. name = Todd Rosengart address = Item( 2 ) Item 2 Type: http://schema.org/postaladdress streetaddress = Level 5 Mod S addresslocality = Stony Brook addressregion = NY postalcode = 11790 Item 1 Type: http://schema.org/aggregaterating ratingvalue = 3.5 reviewcount = 13 bestrating = 4 Item Type: http://data-vocabulary.org/breadcrumb url text = Home href = http://www.example.com title = Home Page ... 4. Go into Google Webmaster Tools and make note of all your structured data. Here is where you can track your real progress once you go live and see if Google is seeing all your microformats. Another great troubleshooting tool Google just added for us. Sample Google Structured Data Ouput: 5. Go Live and Monitor the Structured Data report and your actual search display in Google and Bing. Examples of rich snippet display in Google and Bing: Google Microformat Example: Bing Microformat Example: 6. Immediately after going live, you can now use the new Bing microfmat validator tool which only accepts URL's and not code (you can possible do this before going live - but I am making this simple). If you see any Bing error notices, make Bingbot happy and fix the errors but don't forget to retest with the Google Rich Snippets Testing tool and find that happy medium between these two. Example of a Bing Microformat Validator output: Markup Validator (Beta) Provide a URL and our tool will report on any structured markup found on the page. We may use the structured markup to display rich snippets for your URLs in Bing. Spend time on getting the microformats done correctly and you will reap the benefits in the search engine rankings display and traffic. Good Luck. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Getting The Most Out of Schema.org Microformats"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Getting The Most Out of Schema.org Microformats"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Irving Weiss\n          \n            Irving Weiss\n          \n            Irving Weiss"
}