{
  "url": "https://moz.com/blog/giveaways-for-seo-the-almost-definitive-guide",
  "slug": "giveaways-for-seo-the-almost-definitive-guide",
  "title": "Giveaways For SEO: The (Almost!) Definitive Guide - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Hosting giveaways for the purpose of SEO is nothing new. But in the right hands it can be a profitable and powerful SEO (and social media) tactic to add to your arsenal.",
  "content": "Giveaways For SEO: The (Almost!) Definitive Guide Marketing Industry L By: Lee Mancini October 23, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! L By: Lee Mancini October 23, 2012 Giveaways For SEO: The (Almost!) Definitive Guide Marketing Industry This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Hosting giveaways for the purpose of SEO is nothing new. But in the right hands, it can be a profitable and powerful SEO (and social media) tactic to add to your arsenal. The premise is simple: you give away something of value to your audience, and in return, they socialize your brand through platforms like Facebook, Twitter, and Google+. It’s a win­­–win situation, and if done correctly, it will attract social buzz and juicy links. Here’s the best strategy/process I’ve found for hosting giveaways for SEO, including some must-have resources to help you succeed. Step One: Decide On the Prize Decide what prize you want to give away. It might sound like an obvious step, but the decision shouldn’t be taken lightly. Ask yourself: Will it attract potential customers that could convert down the line, or just the mass market of freebie seekers? On the flipside, will its appeal be broad enough to actually generate interest? You want to find a middle ground here. Will it still be of interest in a month’s time? Trending products can attract huge numbers, but gauge their longevity carefully. I generally recommend looking for something on Amazon.com or a similar reputable online retailer for a couple reasons: highly competitive pricing, efficient delivery administration, and the option to add a gift note for a more personal touch. In terms of prize value, I’ve found the $150 - $300 mark to be quite effective; it’s enough to garner interest from the masses whilst still keeping your piggy bank in one piece. Step Two: Decide What You Want in Return We all know there’s no such thing as a free lunch, and well-planned giveaways are no exception. You need to make your users do something in return for an entry. This can range from some simple clicks to fully-fledged engagement. You might ask them to: Follow you on Twitter (or tweet about your giveaway) Sign up to your mailing list Refer five friends to your brand page/campaign For a more thorough interaction, you might ask that they: Post some sort of response on Facebook, Twitter, or Google+ Post a video response to your Youtube video Sing a cover (think of either a longtime classic or a hugely popular trend) Record a dance (think Gangham, Ellen, Jai Ho, random flashmobs) The options are practically endless so long as you can capture, track, and measure them, which leads us onto Step Three. Step Three: Build the “Giveaway Machine” While you certainly can host your giveaway “manually” using various scripts, there are some great pre-packaged tools out there to help you automate the process. Be sure to check out these platforms before you try re-invent the wheel: Rafflecopter is possibly the most popular giveaway tool, providing a clean interface with a number of social action buttons built in (including Facebook page integration). It’s also relatively obedient to the terms and conditions of the various social media platforms, so you’re less likely to run into trouble (more about this later). Rafflecopter’s free interface is more than sufficient for first time giveaways. For those who need it, the service comes with a $99 white label option. Punchtab offers a fairly similar service with some alternative styling and configuration options. Well worth a look if Rafflecopter doesn’t tickle you. Secondstreet is an enterprise-level solution, offering mobile support, full white label functionality, and a host of other features. Be prepared to spend some money, though. If you’re uncertain about which platform to use, start with Rafflecopter and assess any additional needs from there. Whichever platform you decide to use, be sure to build a dedicated entry page on your website with optimized copy to ensure optimal rankings for “win a <insert prize here>.\" You’ll be surprised how many people are actively searching for ways to win the things they want! Also be sure to incorporate social sharing buttons on this page to increase chances of viral sharing. A note on timing I generally suggest running giveaways for 30 days to get optimal value. If you go any shorter, you’re minimizing the window of opportunity to gain entries (thereby minimizing your ROI); if you go too much longer, you’re potentially deterring users from entering since the winning opportunity seems too far away. Step Four: Spread the Word Understand one thing – without effective promotion, your giveaway will be a flop. Promotion needn’t cost an arm and a leg, but be prepared to put some marketing dollar into getting the word out about your giveaway. As a rule of thumb, I’ve always tried to spend at least twice as much on promotion compared to prize. Working on a $300 prize value, that pegs promo spend at an additional $600, creating a total cost of $900. This rule isn’t hard and fast, but I urge you to keep at least some budget for promotion. Promotion of your giveaway can take many forms – I’ll outline some of the most effective ones I’ve found: 1. The freebies & “easy wins” Inform your existing client base/Mailing List Send a mailer to your existing clients informing them of your giveaway. This is straightforward and shouldn’t cost you much, if anything at all. Promoting to an existing client base also adds future value, because you can access them via multiple marketing channels down the line (assuming you’re asking them to follow you on social media platforms). Share it on social media While this will likely have a lower return since you’re asking social media followers to follow you on social media), it’s still a quick, easy win that will maximize the number of social platforms on which you can connect with followers. If you’re using Rafflecopter, be sure to add a tab to your Facebook page to make it as easy as possible for your users. You can also use Pagemodo to create a customized tab. Get entrants to blog about it Consider offering extra entries to visitors who blog about your giveaway on their own sites. Just make sure they fill in their URL else this could be abused. 2. The low-cost tactics Submit to giveaway sites Believe it or not, there are tons of websites dedicated to listing new giveaways. While these kinds of sites do tend to drive lower quality, giveaway-hunter type visitors, they still provide some engaging traffic for a relatively low cost. There is a huge giveaway community in the US, but you’ll find similar sites in most other countries/regions. Just Google “submit giveaway” as a starting search string in whichever country you’re targeting and you’re bound to find some targets. You’ll receive some nice clean, do-follow links, and while they will fade rather fast, it’s a low/no-cost way of getting some traffic and traction. Below are some popular sites in the US: www.giveawaypromote.com (featured listings from $5.99) www.sweepsadavantage.com (various options – check out their PPC options) www.giveawayscoop.com (featured listings from $10) www.contesthound.com (various options) Get listed on giveaway linky lists Archaic as they may be, linky lists can drive some serious traffic (plus some short-term link juice). Don’t know what linky lists are? Check out Deidre at Cuckoo For Coupon Deals’ list of giveaway linky sites. She also offers a submission service to all of these sites for $80. In my experience this has been very worthwhile. Grab some paid stumbles StumbleUpon’s Paid Discovery platform provides dirt-cheap targeted traffic. Depending on what you’re giving away, you can get some serious traction using this tool. I recommend doing a trial run of $20 and measuring your return before jumping in. Push a press release Some argue that press releases have limited value these days, but I see no harm in doing some free submissions to promote your giveaway. Additionally, you can use a tool like link prospector to find relevant blogs that you can syndicate your press release to. Most “mommy blogs” will be happy to mention a high value giveaway to their audiences; you just need to let them know. 3. The pricey tactics Adwords & Adcentre advertising Bidding on low-competition keywords such as “win a <insert prize name>” can drive reasonable amounts of low-cost traffic to your site. The display network is particularly powerful for giveaways since it’s visually stimulating and enticing. That said, Pay Per Click bills can rack up mighty fast unchecked, so keep a keen eye on your spend and conversion rate. Facebook advertising As with Adwords and Adcentre, Facebook Ads can drive some great traffic to your giveaway. I recommend creating a customized tab (using something like Pagemodo) to minimise bounce rate and increase conversion to entry. Business 2 Blogger paid outreach If you haven’t used it before, check out Business 2 Blogger, a platform that connects advertisers with private bloggers. Use it for some targeted promotion of your giveaway on relevant blogs. You can get featured on a relevant blog for as little as $15-$20, but be beware, these costs can rack up quickly! There is unfortunately no cookie-cutter approach to giveaway promotion, and what works for one may not work for another. You need to play around with various combinations of the above steps and monitor your analytics data to assess what drives maximum ROI for your giveaways. It’s crucial that you drive your giveaway promotion strategy from launch day to ensure maximum exposure. (It’s amazing how quickly a month passes.) On the same note, try to stagger your tactics to ensure a consistent flow of entries and maximum longevity. Step Five: Picking a Winner The final (logical) step is wrapping up the giveaway and picking a winner. Always, and I mean always, pick your winner on the day you promised to. Delayed selection is the ultimate public relations fail and will hurt your future giveaway success. The last thing you want is a social media blowout about how your giveaway was a scam. Also, make sure that your prize gets delivered promptly after announcing the winner. Milk the opportunity Follow up with the winner within a week to make sure they received the prize. You’ll generally get a very appreciative thanks. For extra traction, politely ask them if they’d mind sharing their appreciation on Facebook or Twitter. That personal endorsement will generate fantastic trust for your brand’s giveaways down the line. Wrapping Up Running giveaways for SEO can be a high-return activity if done correctly, benefiting not only your SEO efforts, but social media and brand awareness as a whole. Remember to allocate sufficient budget to promote your giveaway and work on perfecting that balance between mass market and qualified prospects. Good luck! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Giveaways For SEO: The (Almost!) Definitive Guide"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Giveaways For SEO: The (Almost!) Definitive Guide"
    },
    {
      "level": "H2",
      "text": "Step One: Decide On the Prize"
    },
    {
      "level": "H2",
      "text": "Step Two: Decide What You Want in Return"
    },
    {
      "level": "H2",
      "text": "Step Three: Build the “Giveaway Machine”"
    },
    {
      "level": "H3",
      "text": "A note on timing"
    },
    {
      "level": "H2",
      "text": "Step Four: Spread the Word"
    },
    {
      "level": "H3",
      "text": "1. The freebies & “easy wins”"
    },
    {
      "level": "H3",
      "text": "2. The low-cost tactics"
    },
    {
      "level": "H3",
      "text": "3. The pricey tactics"
    },
    {
      "level": "H2",
      "text": "Step Five: Picking a Winner"
    },
    {
      "level": "H3",
      "text": "Milk the opportunity"
    },
    {
      "level": "H2",
      "text": "Wrapping Up"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Lee Mancini\n          \n            Lee Mancini"
}