{
  "url": "https://moz.com/blog/gmb-to-gbp",
  "slug": "gmb-to-gbp",
  "title": "GMB to GBP: 3 Invitations for Google to Alter Their Indifference towards SMBs - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The rebrand of Google My Business to Google Business Profile included the news that nice dashboards will be the sole province of more fortunate, large enterprises. In response, please join me in sending three invitations to Google from the local business neighborhood, in hopes of an RSVP.",
  "content": "GMB to GBP: 3 Invitations for Google to Alter Their Indifference towards SMBs Local SEO | Search Engines By: Miriam Ellis November 15, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis November 15, 2021 GMB to GBP: 3 Invitations for Google to Alter Their Indifference towards SMBs Local SEO | Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Software dashboards are supposed to feel clean and quiet, organized so that everything you need to do good work is right at hand, like this: Seeing the rebrand of Google My Business to Google Business Profile include the news that single location businesses will no longer enjoy the dignity of a room of one’s own because nice dashboards will be the sole province of more fortunate, large enterprises, it feels like SMBs are now being told (with indifference) to manage their listings here: In Google’s own words: “Moving forward, we recommend small businesses manage their profiles directly on Search or Maps. To keep things simple, ‘Google My Business’ is being renamed ‘Google Business Profile.’...The existing Google My Business web experience will transition to primarily support larger businesses with multiple locations, and will be renamed ‘Business Profile Manager.’” To wit, big businesses will be granted some version of the former Google My Business dashboard, with its helpful navigation and dedicated work areas, while SMBs must figure out what has changed and try to manage their most visible local business listings directly in the messy SERPs, amid an astounding clutter of ads, organic results, SERP features, carousels, images, video results, and so on. Perhaps it’s no big deal and local businesses desiring the organization of a dedicated listings management dashboard can rely on the Moz Locals of the marketplace. Or perhaps it’s a turning point. Maybe now is a critical moment in Google’s history to invite them to rethink this troubling pattern their powerful company has fallen into since they stepped into the lives of small business owners 16 years ago, and began to dominate so much of their fate. The highlighted words in the above quote are an emphatic statement of alignment with larger — often elite — brands instead of with the diverse small businesses, which are the very meaning of localism. Personally, I see our socioeconomics deeply wounded by the pattern of giving preferential treatment to whatever is largest and treating whatever is smallest with chronic indifference, and I believe Google has the clout to change this dynamic within their own, very substantial sphere — if they choose to. Today, when champions of positive change are the most important people in any room, please join me in sending three invitations to Google from the local business neighborhood, in hopes of an RSVP. 1) Could Google stop hiding 59% of websites in local packs? My friend and Moz’s marketing scientist, Dr. Peter J. Meyers, recently shared some numbers with me that deserve to be seen. Running 10,000 keywords through MozCast, half of which were specifically localized to cities, Google returned 3,322 local packs on desktop, meaning that 33% of the SERPs queried featured these types of results. Of these packs, 59% featured zero links to local business websites, in this fashion: This was not a case of website links missing because no websites existed — packs in which some of the entries had website links and others didn’t (because no URL had been added) were 41% of the total number. Rather, these website-less packs were of the kind that have been dubbed “local teasers”, and a variety of other names over the years. Dr. Pete ran the test twice, and on the second trial, website-less packs made up 58% of the total. In other words, nearly 6/10 of Google’s local SERPs intentionally hide URLs. This is not a force of nature, or a scientific principle — it’s a decision Google is making to obscure local businesses’ home base, where they work so hard to offer a customer experience they directly control. Why am I inviting Google to change this? Granted, the chief charm of local business listings is that they can be just what customers need for very quick information. But the pandemic has made local business websites centers of help, commerce, and communication like never before, and these companies deserve a search engine that respects the investments they are making in shopping carts, booking systems, live chat, text and audio-visual media, and other brand-controlled assets. Google’s vision is to be, as Tidings founder David Mihm says, “the transaction layer of the Internet”, but I invite them not to support that goal by hiding the transactional capabilities offered by the small brands that make up Google’s index. It’s not right or fair to do so. Something Google can do to signal that they aren’t disrespecting single location businesses is to return websites links to all local packs whenever a business has uploaded a URL. This would show that Google understands that small business owners often feel powerless having a giant search engine own so much of the display of their information and reputation. Google can toss the ball back to Main Street so that more customers end up on a platform where the business controls the customer experience in their own, unique style. 2) Could Google align with straight talk, not scare tactics, for a healthier shared workspace? As recently demonstrated in a study by Sterling Sky, Google’s local product has become a dominant driver of local business leads. Short of going completely off the Google grid, local business owners are forced to make Google’s place their own in order to be found by customers, and everyone deserves to have a shared workspace where they’re treated with dignity. Unfortunately, Google chose to kick off the rebranding of Google My Business as Google Business Profile by subjecting local business owners to emails and CTAs developed to frighten them into believing that anti-trust regulations of Google’s monopoly will hurt small businesses. The local SEO community tended to take it like this: As reported by Near Media’s Mike Blumenthal, these scare tactics may not be new, but they are certainly antisocial. Having witnessed Facebook whistleblower Frances Haugen explain how causing society anger, distress, and fear monetarily benefits publishers, all technology brands of good conscience should be pledging to become allies to a healthy and informed society instead of one that is being harmed with calculated misinformation. As a Californian, I take Google’s attempt to cause fear personally, having recently lived through third party food delivery and rideshare corporations pouring a record-breaking $200+ million dollars into Proposition 22 in order to deny a living wage and basic protections to a group of drivers who are so poor that they are often living in their cars and eating part of the food they are meant to deliver. Prop 22 was recently ruled unconstitutional, and many voters and drivers now regret that they were manipulated into voting for it via a threatening, powerful ad campaign. No business model should rely on creating the very stress physicians tell us to avoid to protect our health, and I would invite Google to rethink the workspace they’re creating, in which independent business owners have little other choice than to participate. These scary CTAs and emails are being received by the doctors who provide vaccines to Google executives and employees, the independent distillery owners who made your hand sanitizer when Purell disappeared, the local grocer or restaurateur who makes and delivers your meals while you work from home. Reciprocal respect is required. Be an honest ally to the local businesses that have heroically served society through COVID-19 and kept our communities supplied. Don’t target them with misinformation and cause them distress just for the sake of protecting Google’s profits. Individual and societal health are priceless. 3) Could Google draft a good neighbor policy to establish a new relationship with small, local businesses? In his inaugural address in 1933, FDR stated: “In the field of world policy I would dedicate this nation to the policy of the good neighbor...the neighbor who resolutely respects himself and, because he does so, respects the rights of others.” I’ve spent most of the last two decades of my life consulting with local business owners and becoming an advocate for the essential role they play in building diverse and sustainable communities. Perhaps it’s because I grew up hanging out in the imagined neighborhoods of Mister Rogers and Sesame Street that it seems so fundamental to me that respect for one’s self is the first step towards respecting others. Google, as a workplace, is full of good people who deserve an environment of respect that is felt by all staff, all local product users, and all communities. If you want to make localism your platform’s business, these folks deserve a good neighbor: I can’t speak for the local business owners who have put on masks every day for the past two years to serve others at great personal risk, but I would like to start an open list today of suggestions for how Google, with its central role in the online local world, could become a better neighbor in serving the offline, real world we all share: Reconsider excluding single location business owners from the dashboard; everyone deserves an equal workspace. Return website links to all local packs.Do not use fear to protect your profits; stress causes damage to human health.Do provide accessible support for all Google local products, via a full staff of remote workers who have been deeply trained in all the things that can go wrong with Google Business Profiles and how to fix them.Create a dedicated, remote listing spam removal team to the scale of the problem and demote easily-manipulated ranking factors like business title stuffing. Create a dedicated, remote review mediation staff to the scale of the problem to promptly investigate and resolve business owner reports of review spam attacks. Launch an investigation into the pattern of low quality Q&A answers and reviews that has arisen from the decision to incentivize Local Guides; if business owners aren’t supposed to offer perks in exchange for this type of UGC, Google really shouldn’t either.Don’t use your power to favor Google products and partners over small business solutions. Do use your power to lead on Climate Action to protect local business districts from wildfires, floods, and other increasing disasters. Put @EthicalGooglers and other human rights and DEI groups within Google at the center of company policy-making to reflect a real-world diversity of people, values, and needs. I’d like to ask the Moz community to be a good neighbor by adding their sincere suggestions for positive change you believe Google can contribute to. Tell me what you’d add to my list by tweeting me. In his article entitled How Indifference Can Kill a Relationship, John M. Grohl, Psy.D. states: “What a relationship has real difficulty surviving is when two people have gone into ‘autopilot’ mode and become indifferent toward one another. When you’ve given up on emotion entirely, when you feel nothing toward the other person, that’s a difficult thing to come back from.” I don’t believe that the good human beings working at Google are personally indifferent to the doctors, restaurateurs, grocers, drivers, shopkeepers, teachers, religious leaders, and other community servants who care for their needs and whose entities make up the thing now called Google Business Profile. I believe all we have here is a relationship that needs to be fixed, and that Google already has everything they need to do it. 2022, with all we’ve been through together, would be a wonderful year for Google to show their deep investment in localism and their intentions to build forward from a place of mutual respect. Image credits Kelly Sims, R. Kriatyrr Brosvik, and Baker County Tourism Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "GMB to GBP: 3 Invitations for Google to Alter Their Indifference towards SMBs"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "GMB to GBP: 3 Invitations for Google to Alter Their Indifference towards SMBs"
    },
    {
      "level": "H2",
      "text": "1) Could Google stop hiding 59% of websites in local packs?"
    },
    {
      "level": "H2",
      "text": "2) Could Google align with straight talk, not scare tactics, for a healthier shared workspace?"
    },
    {
      "level": "H2",
      "text": "3) Could Google draft a good neighbor policy to establish a new relationship with small, local businesses?"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}