{
  "url": "https://moz.com/blog/gms-doing-it-wrong-facebook-marketing-lessons-15202",
  "slug": "gms-doing-it-wrong-facebook-marketing-lessons-15202",
  "title": "GM's Doing it Wrong: Facebook Marketing Lessons - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "By dumping Facebook, GM’s doing it wrong\n\n\tGM made a huge stink this week when they pulled their $10 million Facebook advertising budget.\n\n\tThey’re doing it wrong. And you can learn some valuable lessons from their mistake:\n\n\tFacebook is the best display adve...",
  "content": "GM's Doing it Wrong: Facebook Marketing Lessons Social Media By: Ian Lurie May 21, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Ian Lurie May 21, 2012 GM's Doing it Wrong: Facebook Marketing Lessons Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. By dumping Facebook, GM’s doing it wrong GM made a huge stink last week when they pulled their $10 million Facebook advertising budget. They’re doing it wrong. And you can learn some valuable lessons from their mistake: Facebook is the best display advertising deal on the internet The Register pointed out that Facebook ads average a .05% click-through rate. Click-through rate is the total number of clicks on an ad, divided by the number of ad views, or impressions. That’s very low, compared to .4% on Google’s Display Network. But you can purchase ads on both networks on a cost-per-click basis: You only pay if someone actually clicks on the ad. If a GM ad shows up on my Facebook page, and I glance at it but move on, GM doesn’t pay a thing. But I still saw GM’s ad. It’s free display advertising! There’s no way to pin a value on that glance, but there is a value. If nothing else, GM just occupied attention otherwise available for Toyota. Managed correctly, Facebook advertising is an unbeatable display ad bargain. GM’s losing a huge branding opportunity. Understand earned media Social media is earned media. Selling in earned media is a two-step process: Attract and build an audience over time. Then you sell to that audience. Facebook ads boost step 1. GM claims Facebook ads aren’t delivering results. But they’re measuring the wrong results, I’ll bet: They’re looking at clicks, sales and web site traffic. They should be looking at new followers, share of voice, and the quality of the following they build. You can grow your brand without paid Facebook ads, by posting to your Facebook page. In our tests, 2-4 great posts per day is the minimum effective pace for a major brand. Post less often and your brand shrinks. General Motors posts every 1-2 days, at best. With that pace, and without ads, they can’t grow their brand. Don’t repeat their mistake: Understand earned media. Your Facebook following is a long-term asset. It’s a community that’s primed for your marketing message. Neglect it and you’ll fail. GM has to either maintain their ad spend (clearly they won’t) or step up their other efforts (hopefully they will). As it stands now, when GM stops their ad campaign, their Facebook page will stagnate. Learn to measure earned media You can measure the return from earned media on Facebook. Run Facebook-specific offers. GM could run a regional campaign with participating dealers and offer cash back, or free oil changes for 3 years, or similar. See how many people participate. Use the performance of those campaigns over time to track the value of your average Facebook follower. That’s only part of the value generated, but it’s a start. It lets you sketch out a comparison of ‘good’ versus ‘bad’ ads, content and offers. Learn to measure earned media performance. Don’t amputate for a hangnail $10 million is a huge Facebook spend. Chances are, GM can optimize it and improve performance, or reduce waste by removing non-performing ads and segments. Instead, they’re chucking the entire budget baby out with the bathwater. If GM applied the budgeting technique to print and television, they’d shut down those campaigns, too. If you manage a Facebook campaign, you’ll hit a point where you want to turn it off. Don’t. Instead, test, refine and improve. Use Facebook’s amazing segmenting tools to create precisely-targeted ads. Don’t hack off a limb because of a hangnail. That’s what GM is doing. Keep perspective Facebook ads represent .5% of GM’s total marketing budget. To be worthwhile, Facebook ads would need to generate 45,000 cars sold. Staggering numbers for you and I, but for a company that sold 9 million cars last year, that’s a totally achievable goal. My last advice: Don’t shut down an ad spend that’s less than 1% of your budget unless you’re 100% certain it’s a failure. When the stakes are low and the potential high, keep perspective. Bottom line, that’s what GM forgot to do, and it’s going to hurt them a lot more than Facebook in the long run. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "GM's Doing it Wrong: Facebook Marketing Lessons"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "GM's Doing it Wrong: Facebook Marketing Lessons"
    },
    {
      "level": "H1",
      "text": "By dumping Facebook, GM’s doing it wrong"
    },
    {
      "level": "H2",
      "text": "Facebook is the best display advertising deal on the internet"
    },
    {
      "level": "H2",
      "text": "Understand earned media"
    },
    {
      "level": "H2",
      "text": "Learn to measure earned media"
    },
    {
      "level": "H2",
      "text": "Don’t amputate for a hangnail"
    },
    {
      "level": "H2",
      "text": "Keep perspective"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ian Lurie\n          \n            Ian Lurie\n          \n            Ian Lurie"
}