{
  "url": "https://moz.com/blog/goal-based-domain-selection",
  "slug": "goal-based-domain-selection",
  "title": "The Goal-Based Approach to Domain Selection - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Two essential questions should guide you as you select a domain: what are my goals​, and what's best for my users?​ ​In this Whiteboard Friday, Kameron Jenkins shares how to ensure your domain selection aligns with your business goals.",
  "content": "The Goal-Based Approach to Domain Selection SEO Basics | Whiteboard Friday By: Kameron Jenkins June 22, 2018 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Kameron Jenkins June 22, 2018 The Goal-Based Approach to Domain Selection SEO Basics | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Choosing a domain is a big deal, and there's a lot that goes into it. Even with everything that goes into determining your URL, there are two essential questions to ask that ought to guide your decision-making: what are my goals, and what's best for my users? In today's edition of Whiteboard Friday, we're beyond delighted to welcome Kameron Jenkins, our SEO Wordsmith, to the show to teach us all about how to select a domain that aligns with and supports your business goals. Click on the whiteboard image above to open a high-resolution version in a new tab! Video TranscriptionHey, everyone. Welcome to this week's edition of Whiteboard Friday. My name is Kameron Jenkins, and I am the SEO Wordsmith here at Moz. Today we're going to be talking about a goals-based approach to choosing a domain type or a domain selection. There are a lot of questions in the SEO industry right now, and as an agency, I used to work at an agency, and a lot of times our clients would ask us, \"Should I do a microsite? Should I do a subdomain? Should I consolidate all my sites?\" There is a lot of confusion about the SEO impact of all of these different types of domain choices, and there certainly are SEO ramifications for each type, but today we're going to be taking a slightly different approach and focusing on goals first. What are your business goals? What are your goals for your website? What are your goals for your users? And then choosing a domain that matches those goals. By the end, instead of what's better for SEO, we're going to hopefully have answered, \"What best suits my unique goals?\" Before we start...define!Before we start, let's launch into some quick definitions just so we all kind of know what we're talking about and why all the different terminology we're going to be using. Main domain Main domain, this is often called a root domain in some cases. That's anything that precedes your dot com or other TLD. So YourSite.com, it lives right before that. Subdomain A subdomain is a third-level domain name for your domain. So example, Blog.YourSite.com, that would be a subdomain. SubfolderA subfolder, or some people call this subdirectory, those are folders trailing the dot com. An example would be YourSite.com/blog. That /blog is the folder. That's a subfolder. Microsite A microsite, there's a lot of different terminology around this type of domain selection, but it's just a completely separate domain from your main domain. The focus is usually a little bit more niche than the topic of your main website. That would be YourSite1.com and YourSite2.com. They're two totally, completely separate domains. Business goals that can impact domain structureNext we're going to start talking about business goals that can impact domain structure. There are a lot of different business goals. You want to grow revenue. You want more customers. But we're specifically here going to be talking about the types of business goals that can impact domain selection. 1. Expand locations/products/servicesThe first one here that we're going to talk about is the business wants to expand their locations, their products, or their services. They want to grow. They want to expand in some way. An example I like to use is say this clothing store has two locations. They have two storefronts. They have one in Dallas and one in Fort Worth. So they launch two websites — CoolClothesDallas.com and CoolClothesFortWorth.com. But the problem with that is if you want to grow, you're going to open stores in Austin, Houston, etc. You've set the precedent that you're going to have a different domain for every single location, which is not really future-proof. It's hard to scale. Every time you launch a brand-new website, that's a lot of work to launch it, a lot of work to maintain it. So if you plan on growing and getting into new locations or products or services or whatever it might be, just make sure you select a domain structure that's going to accommodate that. In particular, I would say a main root domain with subfolders for the different products or services you have is probably the best bet for that situation. So you have YourSite.com/Product1, /Product2, and you talk about it in that sense because it's all related. It's all the same topic. It's more future-proof. It's easier to add a page than it is to launch a whole new domain. 2. Set apart distinct facets of business So another business goal that can affect your domain structure would be that the business wants to set apart distinct facets within their business. An example I found that was actually kind of helpful is Apple.com has a subdomain for Trailers.Apple.com. Now, I'm not Apple. I don't really know exactly why they do this, but I have to imagine that it was because there are very different intents and uses for those different types of content that live on the subdomain versus the main site. So Trailers has movie trailers, lots of different content, and Apple.com is talking more about their consumer products, more about that type of thing. So the audiences are slightly different. The intents are very different. In that situation, if you have a situation like that and that matches what your business is encountering, you want to set it apart, it has a different audience, you might want to consider a subdomain or maybe even a microsite. Just keep in mind that it takes effort to maintain each domain that you launch. So make sure you have the resources to do this. You could, if you didn't have the resources, put it all on the main domain. But if you want a little bit more separation, the different aspects of your business are very disparate and you don't want them really associated on the same domain, you could separate it out with a subdomain or a microsite. Just, again, make sure that you have the resources to maintain it, because while both have equal ability to rank, it's the effort that increases with each new website you launch. 3. Differentiate uniquely branded sub-departmentsThree, another goal is to differentiate uniquely branded sub-departments. There is a lot of this I've noticed in the healthcare space. So the sites that I've worked on, say they have Joe Smith Health, and this is the health system, the umbrella health system. Then within that you have Joe Smith Endocrinology. Usually those types of situations they have completely different branding. They're in a different location. They reach a different audience, a different community. So in those situations I've seen that, especially healthcare, they usually have the resources to launch and maintain a completely different domain for that uniquely branded sub-department, and that might make sense. Again, make sure you have the resources. But if it's very, very different, whether in branding or audience or intent, than the content that's on your main website, then I might consider separating them. Another example of this is sometimes you have a parent company and they own a lot of different companies, but that's about where the similarities stop. They're just only owned by the parent company. All the different subcompanies don't have anything to do with each other. I would probably say it's wisest to separate those into their own unique domains. They probably definitely have unique branding. They're totally different companies. They're just owned by the same company. In those situations it might make sense, again, to separate them, but just know that they're not going to have any ranking benefit for each other because they're just completely separate domains. 4. Temporary or seasonal campaignsThe fourth business goal we're going to talk about is a temporary or a seasonal campaign. This one is not as common, but I figured I would just mention it. Sometimes a business will want to run a conference or sponsor an event or get a lot of media attention around some initiative that's separate from what their business does or offers, and it's just more of an events-based, seasonal type of thing. In those situations it might make sense to do a microsite that's completely branded for that event. It's not necessary. For example, Moz has MozCon, and that's located on subfolder Moz.com/MozCon. You don't have to do that, but it certainly is an option for you if you want to uniquely brand it. It can also be really good for press. I've noticed just in my experience, I don't know if this is widely common, but sometimes the press tends to just link to the homepage because that's what they know. They don't link to a specific page on your site. They don't know always where it's located. It's just easier to link to the main domain. If you want to build links specifically for this event that are really relevant, you might want to do a microsite or something like that. Just make sure that when the event is over, don't just let it float out there and die. Especially if you build links and attention around it, make sure you 301 that back to your main website as long as that makes sense. So temporary or seasonal campaigns, that could be the way to go — microsite, subfolder. You have some options there. 5. Test out a new agency or consultantThen finally the last goal we're going to be talking about that could impact domain structure is testing out a new agency or consultant. Now this one holds a special place in my heart having worked for an agency prior to this for almost seven years. It's actually really common, and I can empathize with businesses who are in this situation. They are about to hand over their keys to their domain to a brand-new company. They don't quite know if they trust them yet. Especially this is concerning if a business has a really strong domain that they've built up over time. It can be really scary to just let someone take over your domain. In some cases I have encountered, the business goes, \"Hey, we'd love to test you out. We think you're great.However, you can't touch the main domain.You have to do your SEO somewhere else.\" That's okay, but we're kind of handcuffed in that situation. You would have to, at that point, use a subdomain or a microsite, just a completely different website. If you can't touch the main domain, you don't really have many other options than that. You just have to launch on a brand-new thing. In that situation, it's a little frustrating, actually quite frustrating for SEOs because they're starting from nothing. They have no authority inherited from that main domain. They're starting from square one. They have to build that up over time. While that's possible, just know that it kind of sets you back. You're way behind the starting line in that situation with using a subdomain or a microsite, not being able to touch that main domain. If you find yourself in this situation and you can negotiate this, just make sure that the company that's hiring you is giving you enough time to prove the value of SEO. This is tried-and-true for a reason, but SEO is a marathon. It's not a sprint. It's not pay to play like paid advertising is. In that situation, just make sure that whoever is hiring you is giving you enough time. Enough time is kind of dependent on how competitive the goals are. If they're asking you, \"Hey, I'm going to test you out for this really, really competitive, high-volume keyword or group of keywords and you only have one month to do it,\" you're kind of set up to fail in that situation. Either ask them for more time, or I probably wouldn't take that job. So testing out a new agency or consultant is definitely something that can impact your ability to launch on one domain type versus another. Pitfalls!Now that we've talked about all of those, I'm just going to wrap up with some pitfalls. A lot of these are going to be repeat, but just as a way of review just watch out for these things. ⃠ Failing to future-proofLike I said earlier, if you're planning on growing in the future, just make sure that your domain matches your future plans. ⃠ Exact-match domainsThere's nothing inherently wrong with exact-match domains. It's just that you can't expect to launch a microsite with a bunch of keywords that are relevant to your business in your domain and just set it and forget it and hope that the keywords in the domain alone are what's going to get it to rank. That doesn't work anymore. It's not worked for a while. You have to actually proactively be adding value to that microsite. Maybe you've decided that that makes sense for your business. That's great. Just make sure that you put in the resources to make it valuable outside of just the keywords in the domain. ⃠ Over-fragmentingOne thing I like to say is, \"Would you rather have 3 websites with 10 backlinks each, or 1 website with 30 backlinks?\" That's just a way to illustrate that if you don't have the resources to equally dedicate to each of those domains or subdomains or microsites or whatever you decided to launch, it's not going to be as strong. Usually what I see when I evaluate a customer or a client's domain structure, usually there is one standout domain that has all of the content, all of the authority, all of the backlinks, and then the other ones just kind of suffer and they're usually stronger together than they are apart. So while it is totally possible to do separate websites, just make sure that you don't fragment so much that you're spread too thin to actually do anything effective on the SEO front. ⃠ Ignoring user experienceLook at your websites from the eyes of your users. If someone is going to go to the search results page and Google search your business name, are they going to see five websites there? That's kind of confusing unless they're very differently branded, different intents. They'll probably be confused. Like, \"Is this where I go to contact your business? How about this? Is it this?\" There are just a lot of different ways that can cause confusion, so just keep that in mind. Also if you have a website where you're addressing two completely different audiences within your website — if a consumer, for example, can be browsing blouses and then somehow end up accidentally on a section that's only for employees — that's a little confusing for user experience. Make sure you either gate that or make it a subdomain or a microsite. Just separate them if that would be confusing for your main user base. ⃠ Set it and forget itLike I said, I keep repeating this just because it's so, so important. Every type of domain has equal ability to rank. It really does. It's just the effort that gets harder and harder with each new website. Just make sure that you don't just decide to do microsites and subdomains and then don't do anything with them. That can be a totally fine choice. Just make sure that you don't set it and forget it, that you actually have the resources and you have the ability to keep building those up. ⃠ Intent overlap between domainsThe last one I'll talk about in the pitfall department is intent overlap between domains. I see this one actually kind of a lot. It can be like a winery. So they have tastings.winery.com or something like that. In that situation, their Tasting subdomain talks all about their wine tasting, their tasting room. It's very focused on that niche of their business. But then on Winery.com they also have extensive content about tastings. Well, you've got overlap there, and you're kind of making yourself do more work than you have to. I would choose one or the other and not both. Just make sure that there's no overlap there if you do choose to do separate domains, subdomains, microsites, that kind of thing. Make sure that there's no overlap and each of them has a distinct purpose. Two important questions to focus on: Now that we're to the end of this, I really want the takeaway to be these two questions. I think this will make domain selection a lot easier when you focus on these two questions. What am I trying to accomplish? What are the goals? What am I trying to do? Just focus on that first. Then second of all, and probably most important, what is best for my users? So focus on your goals, focus on your users, and I think the domain selection process will be a lot easier. It's not easy by any means. There are some very complicated situations, but I think, in the end, it's going to be a lot easier if you focus on your goals and your users. If you have any comments regarding domain selection that you think would be helpful for others to know, please share it in the comments below. That's it for this week's Whiteboard Friday, and come back next week for another one. Thanks everybody. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Goal-Based Approach to Domain Selection"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Goal-Based Approach to Domain Selection"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Before we start...define!"
    },
    {
      "level": "H3",
      "text": "Main domain"
    },
    {
      "level": "H3",
      "text": "Subdomain"
    },
    {
      "level": "H3",
      "text": "Subfolder"
    },
    {
      "level": "H3",
      "text": "Microsite"
    },
    {
      "level": "H2",
      "text": "Business goals that can impact domain structure"
    },
    {
      "level": "H3",
      "text": "1. Expand locations/products/services"
    },
    {
      "level": "H3",
      "text": "2. Set apart distinct facets of business"
    },
    {
      "level": "H3",
      "text": "3. Differentiate uniquely branded sub-departments"
    },
    {
      "level": "H3",
      "text": "4. Temporary or seasonal campaigns"
    },
    {
      "level": "H3",
      "text": "5. Test out a new agency or consultant"
    },
    {
      "level": "H2",
      "text": "Pitfalls!"
    },
    {
      "level": "H3",
      "text": "⃠ Failing to future-proof"
    },
    {
      "level": "H3",
      "text": "⃠ Exact-match domains"
    },
    {
      "level": "H3",
      "text": "⃠ Over-fragmenting"
    },
    {
      "level": "H3",
      "text": "⃠ Ignoring user experience"
    },
    {
      "level": "H3",
      "text": "⃠ Set it and forget it"
    },
    {
      "level": "H3",
      "text": "⃠ Intent overlap between domains"
    },
    {
      "level": "H2",
      "text": "Two important questions to focus on:"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kameron Jenkins\n          \n            Kameron Jenkins\n          \n            Kameron Jenkins"
}