{
  "url": "https://moz.com/blog/going-viral-on-pinterest-driving-big-traffic-and-making-pinterest-a-real-marketing-solution",
  "slug": "going-viral-on-pinterest-driving-big-traffic-and-making-pinterest-a-real-marketing-solution",
  "title": "Going Viral on Pinterest: Driving Big Traffic and Making Pinterest a Real Marketing Solution - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When I was first introduced to Digg in 2007 I didn’t leave the computer until I absorbed every piece of information that Kevin Rose made available to me. When I switched over to Reddit in 2008, I found the content even more enthralling and gave out upvotes until my fingers bled on nearly ever…",
  "content": "Going Viral on Pinterest: Driving Big Traffic and Making Pinterest a Real Marketing Solution Social Media C By: Colby Almond March 20, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! C By: Colby Almond March 20, 2012 Going Viral on Pinterest: Driving Big Traffic and Making Pinterest a Real Marketing Solution Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. When I was first introduced to Digg in 2007 I didn’t leave the computer until I absorbed every piece of information that Kevin Rose made available to me. When I switched over to Reddit in 2008, I found the content even more enthralling and gave out upvotes until my fingers bled on nearly ever subreddit. A little over two months ago my girlfriend, Alaina was on her laptop on the couch totally enchanted by some type of site I had never seen before. However, I knew the passion and attention she was giving the site was all too familiar. There she was pinning and repinning content onto her boards like it was her job. As a marketer of nearly seven years, I absolutely knew this “Pinterest” thing was going to be huge. I never would have expected, however, that it would change the world of viral marketing so quickly. It was during that month of January that Pinterest exploded from a casual social network to an absolute powerhouse of over 10 million users. By this point, it was driving more referral traffic than Google+, Youtube, and LinkedIn. For a social network remaining under the radar for the marketing industry, these are numbers that can’t be ignored. The Power behind Pinterest The best way to understand the power behind Pinterest is to compare it to the last ruler of viral traffic: The Front Page of Digg. We all remember the stunning days of 2007-2008 when reaching the front page of Digg was considered a milestone in your career. When developing content specifically for Digg was fun and actually reaching the front page was cause for celebration . . . and panic as your servers soon overloaded with traffic and eventually crashed. Those were fun times, indeed, and I have missed them ever since Digg’s mishap that resulted in a mass migration to other social networks. I still remember my first Digg front page in 2008; I even printed it out and thought about framing it at that point in my career. Below is the actual data from my first three “Front Pagers” and what I thought would be the best traffic that I could ever drive to a website in a 24 hour time-frame. In 2008 on a good day the front page of Digg could drive around 30-50 thousand visitors in a 24 hour time span. After the content was off the front page, it often disappeared into oblivion to never be seen again. That was the life of viral marketing back then and a lot of people have said since Digg’s demise that it would never be possible to reach those levels again. However, I’m here to tell you that in the past two months I have not only reached those levels again, I have completely obliterated the old “Digg Effect”. Below are the analytics from a single piece of content created for my personal site nearly over two weeks ago geared specifically towards Pinterest. As you can see, there’s a HUGE difference between the two. Not only did this one piece of content nearly triple the traffic that was produced by the old Digg, but the average time spent on site is nearly 2 minutes and 43 seconds. This is exponentially better than the 12-13 seconds regular content is awarded from going viral on other social networks. The best part about going viral on Pinterest, however, is that once it hits its peak the traffic simply doesn’t stop. With the site’s growth in unique users and ability to “repin” and share, viral content will continue to bring in thousands of daily visitors for up to 3-4 weeks. So how did I go about getting 46 thousand repins from one piece of content on my personal site? It’s all about the content, baby. Understanding the Pinterest Community When I started researching how to better understand the Pinterest community and its users I was met with some criticism. Being told “I’m revoking your man-card” or “you’re wasting your time” were the most frequent. However, as I soon began seeing results my peers began to ask me if I was casting some type of voodoo magic over the Pinterest users. I have played D&D before and I do have a set of dice, however, I am no magic user when it comes to Pinterest.It's not about knowing what women want, it's about knowing what the community wants. The real secret to understanding the Pinterest community is this: IT’S JUST LIKE EVERY OTHER SOCIAL NETWORK. Just like Digg, Reddit, Facebook, and Twitter . . . pictures of cute animals and memes run rampant. While there are some exceptions to this rule, there isn’t a day that goes by that I don’t see something from Reddit hit the popular page of Pinterest. Yes it’s true that throwing up a picture of Ryan Reynolds shirtless or of Ryan Gosling “Hey Girl-ing” a kitten will probably get you thousands of repins, it will never result in any traffic through to your site. The most important thing to remember is that the users of Pinterest are looking to share and repin creative ideas and advice. There are thousands of infographics being submitted to Pinterest on a daily basis. However, I can count on my hand how many infographics I’ve ever seen make it to the popular page of Pinterest. When it comes to going viral, making the popular page is an absolute necessity in the effectiveness of your content. While infographics might work on every other social network, they just aren’t what the Pinterest users are looking to share. The whole point of infographics is to visually interpret data in a way that’s appealing to the users. While information and knowledge is extremely convenient, it just doesn’t fit in well with the ideals of Pinterest. Every few years there is a change in the trends associated with the design of content for social sites. While infographics have been a hot item for years, they just aren't working at the level I've seen with other content on Pinterest. That’s why the team at 97th Floor and I are proud to share with you what we believe is the first of a new type of visual content: Instructographics. Instructographics for Pinterest: Since the term of “instructographics” has never been used before, I guess I should provide a formal definition. Instructographics are a vertical representation of creative ideas or steps that guides the user to a specific deliverable. It doesn’t matter if it’s a recipe, hairstyle, do-it-yourself project . . . instructographics work on nearly any level. Why do these graphics work better than infographics on Pinterest? It’s simply because the instructographic walks the user through a series of instructions that will result in something useful in real life. Pinterest is all about the sharing of ideas and the instructographic is the perfect type of content for doing such. So how does one go about constructing an instructographic? At 97th Floor we use the following methods when setting up one of our many Pinterest marketing campaigns: Step 1: Find an Idea For this step it’s pretty simple, just find an idea of a cool concept or creation that you think would go over well in the Pinterest community. The possibilities are endless; however, make sure the idea is something that you’ve never seen before. Do you have an idea that is just so brilliant that it’s never been seen before? Good, that’s what you’ll need. After you’ve determined exactly what you want to share with the community, get your team together and start brainstorming the processes you’ll need to take to get to a final product. While you could probably make a monster instructographic outlining every single detail, I believe in K.I.S.S (Keep It Simple, Stupid). Step 2: Begin the Design After you’ve determined exactly what content your instructographic will contain, begin designing a basic step by step vertical guide. It is important to remember to keep the title of your instructographic as visible as possible as it will be the first thing viewed by the users of Pinterest. Step 3: Upload to your Client Site Unlike other social networks that give major notice to the URL that the image is uploaded on, Pinterest gives very little attention to this element. As long as the content is remotely similar to the site and looks like it fits it will be just find with Pinterest. Step 4: Size it Correctly What’s the difference between 40 visitors to your site from an instructographic and 40,000? The size of your content. As long as your content is longer than 2,500 pixels it will be unreadable by the Pinterest users. Anything smaller and Pinterest will magnify the image so that it's readable on the site (meaning there's no reason to click through to your page). This forces them to click on your submission, through to your page to view the content. If it’s something that’s worth reading and creative, this is a necessity. If it’s longer than 5,000 pixels, then create a simple 300x300 pixel button outlining your graphic. The reason for this is because the “like” and “repin” buttons are at the top of the submission. If they have to scroll too far town to view the entire piece, chances are they aren’t going to scroll up to click on those buttons. For me the ideal image is 600x3000 pixels. Step 5: Submit and Pin! When your instructographic is ready to be shared, there are several important elements that you should keep in mind before submitting to Pinterest. If you're still having troubles understanding the intricacies of the instructographic below is one 97th Floor recently designed for a client which received 14,000+ repins: The Pinterest Popularity Algorithm Like every other social network in the realm of the internets, there is a science behind going popular on Pinterest. This is no way considered gaming the Pinterest site, however, it will give your content the best chance possible to make it to the popular board. Once every piece of content is submitted it is placed onto the top of the specific category pages. Getting to the top of these pages is essential to going viral on Pinterest. Consider these category pages your springboard to the popular page. You do not need an established or aged account to get to the top, however, there are some elements that will block your attempts. Every piece of content is placed onto the top of the category pages barring it doesn’t break any of the following guidelines: You’ve submitted within the past hour It seems that in an effort to combat spam, Pinterest has limited every user account to ONE piece of content on the category pages per hour. We tell all our clients to hold off on the pinning up to three hours before we’re ready for a content push. You’ve hosted your content on Imgur I have no idea why Pinterest has done so, but any piece of content hosted on Imgur will not make it to the top of the category pages. I’m guessing this is a maneuver to differentiate themselves from Reddit, however, no one has explained the reasoning quite yet. Just beware if you plan on rehosting content on your site. Timing the Submission As with every social network, there is a specific time that you can submit that will give you the best chance of reaching the front or popular pages. Pinterest is no different as their users tend to be more active during different points of the day. The goal as a content creator is to get your content onto the site when it is least competitive yet most effective. With Pinterest this time tends to be between 5-7AM and 5-7PM EST. The reason for this is because the majority of users are either waking up or getting off work to check their Pinterest boards. Since this is the case, you want to submit your content at least one hour beforehand to ensure that it will be visible to the most people at the right time. Monitoring Your Content After your content has been submitted to Pinterest and gone viral, it is important that you check the popular boards routinely to see if your content has been rehosted on any different sites or blogs. As the creators of the content you are entitled to every visitor that it receives. Unfortunately sites such as 9Gag have included the “Pin It” button allowing the users to direct 100% of the traffic to their site. I have found that if you ask the user that pinned your content from a site like this to nicely to change the URL, they will abide. While it might seem tedious and time consuming, this is essentially thousands of visitors that your client will be missing out on if you do not follow through. Conclusion Pinterest is here to stay and if it’s not in your marketing plans yet, it very well should be. I expect Pinterest to double in size and traffic potential in the coming months. It’s important to remember that while the majority of Pinterest users are women, more men are starting to migrate over due to its easy usability and creative content. Don’t be one of those companies kicking themselves in a few months because you didn’t get in on the trend. They said Facebook would never take over Myspace and Twitter would be useless to social marketing. Experts are saying the same thing about Pinterest right now. I’m here to tell you they’re wrong. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Going Viral on Pinterest: Driving  Big Traffic and Making Pinterest a Real Marketing Solution"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Going Viral on Pinterest: Driving  Big Traffic and Making Pinterest a Real Marketing Solution"
    },
    {
      "level": "H2",
      "text": "The Power behind Pinterest"
    },
    {
      "level": "H2",
      "text": "Understanding the Pinterest Community"
    },
    {
      "level": "H2",
      "text": "Instructographics for Pinterest:"
    },
    {
      "level": "H3",
      "text": "Step 1: Find an Idea"
    },
    {
      "level": "H3",
      "text": "Step 2: Begin the Design"
    },
    {
      "level": "H3",
      "text": "Step 3: Upload to your Client Site"
    },
    {
      "level": "H3",
      "text": "Step 4: Size it Correctly"
    },
    {
      "level": "H3",
      "text": "Step 5: Submit and Pin!"
    },
    {
      "level": "H2",
      "text": "The Pinterest Popularity Algorithm"
    },
    {
      "level": "H2",
      "text": "Timing the Submission"
    },
    {
      "level": "H2",
      "text": "Monitoring Your Content"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Colby Almond\n          \n            Colby Almond\n          \n            Colby Almond"
}