{
  "url": "https://moz.com/blog/goodbye-seomoz-hello-moz",
  "slug": "goodbye-seomoz-hello-moz",
  "title": "Goodbye SEOmoz. Hello Moz! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For the last two years, the 130+ Mozzers across product, engineering, marketing, and operations have been working to transform this company to the next stage of our evolution. Today, that incredibly demanding, intense, but ultimately rewarding process has reached its first goal. I'm excited to…",
  "content": "Goodbye SEOmoz. Hello Moz! Moz News By: Rand Fishkin May 29, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 29, 2013 Goodbye SEOmoz. Hello Moz! Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. For the last two years, the 130+ Mozzers across product, engineering, marketing, and operations have been working to transform this company to the next stage of our evolution. Today, that incredibly demanding, intense, but ultimately rewarding process has reached its first goal. I'm excited to announce that as of today, SEOmoz is formally transitioning our brand, our products, our company name, and all of our efforts to Moz. What?! Why?! How?! I know - there are lots of questions, and I will do my best to answer them all. For those of you who'd like to skip ahead, here's what you'll find in this post: Why We're Retiring SEOmoz The Mission & Vision for Moz The Beta Launch of Moz Analytics Plans for the Years Ahead Notable Changes & Announcements Why We're Retiring SEOmoz The company and the name 'SEOmoz' began in 2004 with a blog. I'd been reading, participating, and sharing a lot on SEO forums and wanted a place to post in my own format with more detail than what I could do on other sites. Fast forward to 2006; SEOmoz had became quite a popular site, and we changed the name of the company to match it. In 2009, when we retired our consulting business to focus exclusively on software, SEOmoz was seeing more than 500,000 visits a month (in April 2013 that number was over two million). The SEOmoz site in 2005 - designed and built by yours truly (in Dreamweaver; oh yeah!) But today, we're retiring that brand for a number of reasons Calling ourselves \"SEO\"moz is no longer transparent and authentic. With products like Fresh Web Explorer, FollowerWonk, GetListed, and the beta of Moz Analytics (alongside the vast array of non-SEO content we publish), we're no longer purely an SEO software company. Pretending otherwise is disingenuous, and that violates our core values. SEO is bigger than just SEO - as hard as I've fought personally and we've fought as an organization over the last decade to make marketers and organizations think more holistically about organic search, the branding of the past remains. SEO is seen as a narrow set of activities that move rankings up and bring search visitors in. To truly help with SEO, we have to do more than just place keywords, make sites accessible, and build links, but first we need the influence to make these changes. A broader marketer is often granted that influence, while pure SEOs still, unfairly, must strive for it. For many folks outside of our community, the acronym SEO has (unfair) associations with spam or manipulation. To quote an all-too-frequent comment we see when our site is mentioned around the web, \"Don't trust any domain with SEO in the name.\" That feedback is hard to hear, and it's wrong, but that doesn't change the impact. We know that the \"SEO\" in SEOmoz has, in the past, hurt our ability to persuade people about the incredible value of organic search marketing. Moz gives us a chance to do something all marketers love - test something new and observe the results :-) It's surprisingly hard for folks who don't know to say the acronym \"SEO\" as letters to pronounce the brand name. I've heard everything from see-oh-moez to say-ow-mahz to sh-ow-moss. For years, I didn't think it was a big deal, but fluency bias suggests this probably has a substantive negative impact on the brand's perception. The SEOmoz name retains a strong branding connection and expectation to our historical consulting business (just last week, I received 4 consulting inquiries!). We haven't offered consulting in many years, and this move can help distance our 2004-2009 incarnation from the software focus we have today. For the sake of transparency, I need to be honest that this is also marketing move - a rebrand is a chance to earn a second look from people who've long known us and had associations with the company. We hope that second look is going to lead those who haven't yet seen what we've become over the last few years to check out our content, Moz Analytics, and the many functions our research tools provide. What we are not doing, and I am most certainly not doing, is giving up on the fight for the legitimacy, value, and importance of SEO. Organic search remains my personal passion, and one of the most powerful marketing channels in history. For as long as I'm active in the field, I will be shouting the value of SEO from the stages on which I present, the publications where I write, and the social channels where I share. Moz will be part of that battle, too. The Mission & Vision for Moz Moz's mission is to help people do better marketing. We've long had a similar core purpose with SEOmoz - to simplify the promotion of ideas on the web. But \"better marketing\" is a more accurate and succinct description of why we exist. Moz is about educating marketers and those they work with. It's about providing tools and software to help measure and improve marketing efforts. It's about giving marketers a platform to ask questions and show off their skill and knowledge. The catalyst for all of that is a belief we hold - that, tragically, a lot of marketing sucks. Together, we can change that. The marketers who are part of the Moz community are on the cutting edge of technology and tactics, but they're also passionate about bringing value from their efforts without compromising ethics or burning bridges with customers. We want to constantly push ourselves and the world of marketing to join them and do better. Moz's current vision is to power the shift from interruption to inbound marketing by giving every marketer affordable software to measure and improve their efforts. Today, 90% of marketing investment is spent on channels that interrupt people in order to get their attention. TV commercials, print ads, radio spots, and billboards are part of this, but so too are web channels like banner advertising, pop-ups and pop-unders, non-opt-in emails, and interstitials. It's not that these channels are evil or wrong - interruption-based marketing can still be effective if it's done empathetically and delights its audience. But on the web at least, less than 10% of all the clicks and traffic go through these channels. The vast majority of web users' time and attention, whether desktop, tablet, or mobile goes to inbound sources - personal & opt-in emails we want to read, content we want to consume, search results we want to click, social media we want to engage with, videos we want to watch, etc. We believe that in the next decade, the effort and dollars put toward web marketing will become more sophisticated, and growth in channels like SEO, social media marketing, content creation, etc. will dwarf the growth rates of those in more traditional, interruption-based endeavors. For many institutional and historic reasons (including the self-interest of web properties to encourage the flow of ad dollars), these may never be fully proportional, but our passion and our goal is to help marketers, especially those outside Fortune 1000s, with analytics and recommendations for these earned channels. Our core values remain unchanged. They are TAGFEE: Transparency - we believe in sharing what we know and what we do openly, and in letting everyone participate in the adventure that is Moz. Authenticity - we never want to be someone other than ourselves. We won't put on a figurative fancy suit just to impress; we will embrace our true identities and let everyone experience the real us. Generosity - we believe in giving without thought of return, and in sharing what we have with others. Our generosity should extend to our co-workers, our customers, and our communities, all of whom have already given so generously to us. Fun - work is only work if you make it so. We want to always love what we do, and we believe that love and enjoyment of our professional tasks will carry us through the tough times. Empathy - it is our duty to put ourselves in the shoes of others and see things from their perspective. Empathy begins with kindness, too, and we seek to apply warmth and understanding in every aspect of how we do business. The Exception - wherever there is a common practice or standard methodology, we seek to question its value before deciding what to do. We believe that immense opportunity exists where others fear to tread. Our goal is to be the exception, not stick to the rules. These three elements - our mission, vision, and values - are the architecture that helps us operate and grow the company. They're also the yardstick against which we measure ourselves and expect to be judged by others. If you see us engaging in behavior that's not a match with this, or if you're ever confused by how what we've done compares to our mission, vision, and values, call us on it. Being held accountable is the best way for us to stay true to the right path. The Beta Launch of Moz Analytics The move to Moz isn't purely a branding change. It's also the launch of Moz Analytics in Beta, our upgrade (and eventual replacement) for SEOmoz PRO. Moz Analytics dramatically upgrades the SEO-focused features of SEOmoz PRO while adding much more depth and breadth for tracking 4 other critical inbound channels: social, content, links, and mentions. A handful of our customer advisory board members have been given access today, and over the next 60-90 days, we'll be sending invitations to every PRO subscriber. Below is a glimpse of what's to come: (Note that I've used sample data in this screenshot and the one below! Thankfully we got more than 115 direct visits in March) Moz Analytics is designed to bring together all of the functionality of SEOmoz PRO into the search section, and add large sets of new data and reports in the new tabs: overview, social, links, brand + mentions, and content (a section that will be added after the launch of the others). We believe that all your data about inbound channels should be aggregated in one place, and while this is only the first step, it's a significant collection of metrics, tracked over time, and comparable against your competition. (Note that this \"competition\" section in the overview isn't yet ready, but is on the list of \"coming soon\" features) In the weeks to come, our product team will be posting a detailed walkthrough of each section and all the features in Moz Analytics, so I won't dive too deep here. I will, however, note that the Beta launch means there's still kinks to be worked out and plenty of features to add. We'd love your feedback via this feature suggestion/bug report page (and you can see our planned work items there, too). There are two ways to join the Moz Analytics invite list: Sign up for a free trial of Moz PRO (which includes access to all of our research tools like Open Site Explorer, the Mozbar, FollowerWonk, Fresh Web Explorer, Keyword Difficulty, Rank Tracker, etc) and request your Moz Analytics invite. Moz subscribers will be the first folks to get access, in order of when you request your invitation. Request an email invite to Moz Analytics once it's open to new subscribers. This may take a bit longer, but we'll email you as soon as we're ready to allow public access. My best guess is that this will be 60-90 days from now. If you're not yet on the waiting list for an invite, you can sign up via the link below. Here's our current plan for opening up access to Moz Analytics (subject to change): Over the next 30 days: Roll out access to our customer advisory board members and fix the bugs and UI issues they help us discover (thank you so much!) 30-60 days out: Enable access for our paying subscribers and those in a free trial (your campaigns will migrate directly over) 60-90 days out: Send emails to those on the invite list which will give the ability to create campaigns and test the software 90+ days out: Open from private to public beta, and allow new folks visiting Moz.com to set up campaigns via a free trial ​It's important to note that these dates may shift earlier or later as we have more people testing the application and importing data. We have a very talented group of engineers and product folks behind Moz Analytics who want to make sure that those who get access have a usable experience with consistent, accurate data. If we need more time to give a great first look, please be patient! In the meantime, all of our research tools and the PRO Web App will still be available and fully functional.UPDATE: For those asking, Moz Analytics will be part of your current subscription package at no extra cost. If you're currently a subscriber, you'll get access automatically in the weeks/months ahead as we roll it out and import everyone's campaigns. Plans for the Years Ahead Today, we're setting the foundation for the future. Moz Analytics is a first step, but there's many more to come. We've got some big priorities on our plate, and I want to make these transparent. Here's our priorities, in rough order: #1: Make Moz Analytics Incredible The beta launch today and the refinements in the weeks to come are just the beginning of what this product will eventually become. The goal of Moz Analytics boils down to three primary components: All the data from your inbound channels tracked in one place, over time, against competition, with great reporting functionality Prescriptive recommendations everywhere it makes sense to provide them A robust set of research tools to dig into the field at large and discover opportunities, expose interesting data, and explore web-scale metrics Today's launch provides a chunk of early features that address these goals. But I'm always passionate about the future, and I know the horizon holds some remarkable advances. Of particular interest to me are our plans to upgrade rank data to help make it more accurate, more aggregated, more useful, and to show comparisons with other sources of similar information (e.g. the VED parameter). Later, when we launch the content section, we'll be able to track the pages on your site that earn the most traffic, links, shares, and engagement, and compare them against the most successful content produced by your competitors. We're also in the process of building multi-seat access in so you can give multiple users the ability to view campaigns (with controls to select who can see and do what). Now that Moz and Moz Analytics have launched, you can expect to see far more transparency from us about our product roadmap, and the progress we're making. #2: Grow Mozscape & Freshscape Mozscape's index (which powers Open Site Explorer) has a great signal to noise ratio and its metrics are the best correlated with Google's rankings. The sites, pages, and links in its index are almost always ones Google has seen and indexed, and the links, when hand-checked, nearly always still exist. By contrast, Mozscape's primary competitors have much larger indices, often poorer metrics, and a larger percent of transient links. For a long time, we believed that this differentiating proposition was a valuable one, but we've heard otherwise from many of our customers. What Mozscape needs to be is the perfect link index. It should be: Close to Google's main index's size and freshness, including links that may be purely spam (though not including links that are highly ephemeral and don't exist when hand-checked) Maintain extremely good metrics that correlate well to the pages/sites performing well in Google's results Highly flexible, containing numerous, fast options for sorting and filtering data Able to be queried historically to show trends, lost & gained links, and changes over time (even to those who haven't been tracking the data in their campaigns) Eminently useful and usable via a robust API (we've already made some recent upgrades here) This is a major focus for our big data team over the next 9 months, and you should anticipate remarkable progress toward each of these goals. Likewise, Freshscape, the index that powers Fresh Web Explorer, needs to become bigger while retaining a high ratio of signal to noise. We currently have ~4 million feeds in Freshscape. Our initial pull of anything with an RSS feed from Mozscape revealed many millions more, but the quantity of junk was far too high (lots of sites have feeds for just about everything they publish). Thus, we're trying a bunch of tactics now to uncover and include the feeds that show links and mentions marketers actually care to see. Another major feature we'll be adding to FWE is email alerts. The index already shows tons of mentions and links that Google Alerts ignores, and we think the ability to select a range of feed authority sites to display, along with many more knobs to tune will make FWE alerts a remarkably useful service. #3: Launch a Product for Local Marketers A huge percent of the marketers we meet and interact with serve primarily local clients operating in specific geographic markets. They may care about a few standard web rankings, but they also care deeply about local/maps results, along with their ratings/reviews/visibility/accuracy on services like Yelp, FourSquare, CitySearch, TripAdvisor, Urbanspoon, Apple Maps, and the like. With the acquisition of GetListed and the help of David Mihm, we've got a local squad of engineers, designers, product folks, and marketers working in concert to create the functionality local marketers (whether they be small business owners or consultants/agencies) need. We hope to have this product available by the end of 2013 as a standalone, and we'll be adding many of the features to Moz Analytics as well (probably in a separate tab on the left sidebar). #4: Organize the Web's Domains to Make Link & Mention Data More Useful As I do research into my links and those of my competition and colleagues, I want to see what percent come from blogs, what percent come from e-commerce sites, what percent come from sites about software, hardware, movies, heck, even crafting sites. And beyond these percentages, I want to be able to browse all the blogs on the subject of toys and games in descending Domain Authority order. Annotating this data to millions of sites is hard, but it's possible and it's incredibly valuable. In the year to come, we have teams working on both manual classification and machine learning to help build this structured data layer on top of our Mozscape and Freshscape indices (and on top of the domains that refer traffic in your Moz Analytics account). #5: Create a Traffic Prediction Algorithm that Actually Works Alexa, Compete, Doubleclick, Google Trends for Websites, and Quantcast all try to give predictions for a website's traffic, but none of them are remotely close to accurate, not even directionally! For the top several thousand sites on the web, the metrics can be decent, but anyone running a non-top-1,000 web property knows that the stats from these services simply don't add up. At Moz, we believe we've got access to enough kinds of valuable data - the link graph, search results, social media metrics, brand mentions, etc. - to give us the potential for a far better traffic prediction algorithm that truly works in the long tail of the web. We'll likely never get to the level of granular accuracy that true visitor analytics provide, but we might be able to provide something much more correct and useful than what the existing field does today. This is a long-term project for the Mozzers, and I have no guesses today about when such a service might launch. I can promise to keep you up-to-date as we make progress against this goal over the months and years to come. Notable Changes & Announcements Moving our site from seomoz.org to Moz.com isn't the only big change happening today. As part of this rebrand, our social accounts, RSS feed, and other important resources are also moving a bit. Here's the important ones: You can now find us on the Twitter account @Moz Our Facebook page has changed to Facebook.com/MozThis blog's RSS feed has moved to http://feeds.feedburner.com/mozblogYouMoz is also moving its RSS feed to http://feeds.feedburner.com/youmoz Naturally, with any shift of this magnitude, there'll be some kinks to work out. We'd ask for your patience as we make some fixes, but we'd also love your help - if you discover anything broken/not working right with our content, our site, or our social profiles, please let us know by tweeting at us or dropping a line to help at seomoz dot org. Finally, I'd like to say thank you. Thank you so, so much for helping a tiny blog turn into something so remarkable. I'm overwhelmed by the outpouring of support, the offers of help, the kind words, and the incredible team and community that have built up around Moz these past 9 years. As I left the office last night, it was a bit like saying goodbye to an old friend. SEOmoz was something special, and Moz, with your help and support, will be something even more special. If ever I can help repay my debt of gratitude, just let me know and I'll do my best to fit it into this crazy schedule I've somehow found myself in. You can reach me directly now via rand at moz.com (replacing my old rand at seomoz.org email), or tweet @randfish. With hugs, love, and gratitude, Rand Fishkin, CEO of SEOmoz Moz p.s. We'll be sure to do an interesting case study on the impact this domain migration has on our search traffic. :-) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Goodbye SEOmoz. Hello Moz!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Goodbye SEOmoz. Hello Moz!"
    },
    {
      "level": "H2",
      "text": "Why We're Retiring SEOmoz"
    },
    {
      "level": "H2",
      "text": "The Mission & Vision for Moz"
    },
    {
      "level": "H2",
      "text": "The Beta Launch of Moz Analytics"
    },
    {
      "level": "H2",
      "text": "Plans for the Years Ahead"
    },
    {
      "level": "H2",
      "text": "Notable Changes & Announcements"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}