{
  "url": "https://moz.com/blog/good-to-great-gillian-responds-to-rands-answers-to-hard-questions-2816",
  "slug": "good-to-great-gillian-responds-to-rands-answers-to-hard-questions-2816",
  "title": "Good to Great: Gillian Responds to Rand's Answers to Hard Questions - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Jim Collins never said, \"Do these five things and you cannot help but create a great company in one generation or less.\" Gillian finds value in Collins' work.",
  "content": "Good to Great: Gillian Responds to Rand's Answers to Hard Questions Marketing Industry By: Gillian Muessig September 27, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Gillian Muessig September 27, 2007 Good to Great: Gillian Responds to Rand's Answers to Hard Questions Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. INTRO FROM RAND: Despite pouring in 80+ hour weeks over the last month, Gillian managed to find some time to write her first content-based post for SEOmoz. Thanks, mom - you rock. As my job is the ‘business end’ of running SEOmoz, I don’t often weigh in on the blog, but today, I have some insight that might be of use to some and of interest to others. Rand’s recent blog post about Jim Collins’ book ‘Good to Great’ got some interesting responses. I have more to say than a comment, and so, as I am famous for saying, “My put is”… I encouraged Rand to read ‘From Good to Great’, so it will surprise no one that I am favorably impressed by the book. I’ve read the Business Pundit’s review and note that his issues surrounding the book are not with the principles, but with the notoriety the book has attained, the simplistic sound bytes with which other reviewers tout its brilliance (why does he bother? They are merely marketers trying to sell the book), and the fact that thin-thinkers everywhere jabber about simply following five steps and achieving long lasting greatness in a company. All nonsense, of course. But so what? That doesn’t detract from the scholarship, the comparative studies, or even the conclusions of this valuable work. Collins never says, “Follow these steps and tenets and you cannot help but create a great company in one generation or less.” He merely notes that with some fairly clean, thoughtful scholarship and careful documentation, he and his hardworking team have identified some similarities in companies that have achieved significantly higher than average stock market returns for their investors over a reasonable period of time. Please note that this does not even say that the company was a good place to work, that it served its communities well, that it bettered the world, or that it produced any other desirable trait. What is interesting is that there are similarities in companies that achieved this financial success, and some of those achievements are not what we would have expected from the robber barons of more than a century ago. Some of the traits turn out to be fairly desirable for other reasons than the ability to turn a profit. I note that it is always ‘cooler’ to throw cold water on an idea, an effort, or a production than it is to demonstrate a serious, thoughtful support of the idea. This is especially true of ideas or endeavors which have won popular favor, such as best sellers. What could be more mundane than agreeing with ‘the masses’? I am often challenged myself and have always challenged my children to choose not to be jaded, to give credit when and where it is due, regardless of whether it feels cool, urbane, or ever-so-worldly to do it. I would encourage all who haven’t read Collins’ study to do so with an open eye, disregarding the foolish thin-thinkers and the pundits alike. Then tell me whether you see something interesting in the study as I did. Here’s what I found interesting. A number of noticeable-to-outside-observers traits were identified among the long-term financially successful companies. There are probably others that are not so easy to identify unless you worked inside those companies. I have no idea whether they might be similar among all of the companies studied. I will focus on what the study was able to provide, rather than focus on what else might be ‘out there’ for us to discover. The companies who achieved long term profitability seemed to be, by and large, places I would want to work. Not so much because they made money, but for corporate culture reasons. That was very interesting to me because I have always known – and am thrilled to report (although I am sure this also will come as no surprise to you) that Rand agrees with me – there are some products, services, and industries I would never, under any circumstances, nor for any amount of money, work for or with, or support in any way. That specifically includes the sale of cigarettes. Some years ago, when times were very, very tough indeed for us, Rand and I sat down to discuss what new or different industries we might approach and what services we might offer in an effort to change the course of our company and save it from the extinction so many of our competitors suffered at that time. We both agreed that we would never work for the tobacco industry. Even for a million dollars. We agreed that there are some things about which no amount of money can change your mind. Child pornography and cigarettes made the list. I was intrigued that the culture of Philip Morris seemed seductively enticing. I still wouldn’t work there. They still manufacture, encourage the addiction of, and sell instruments of death to ever younger clientele all over the world. But their corporate culture is such that they became a ‘great’ company. Great? I don’t think so. What Collins meant was ‘long term profitable’. Let’s not forget the difference. ‘Great’ is just a good marketing moniker – it sells books because \"good to sustainably profitable\" just doesn’t have that ring. (Also, sustainably isn’t a word, but I digress.) I found that putting SEOmoz to the test, improved clarity on each of the issues, forced me to think and rethink some of the decisions I was making - and that Rand was making - and encouraged me to look at SEOmoz with a wider lens. As I see it, the job of the president and/or CEO is to climb the tallest tree on the highest mountain and shout to the team hacking at breakneck speed through the forest below, “Wrong mountain! Go that way!” Because we are small, growing like a weed, and always racing to meet our daily obligations, we tend to focus on crisis management rather than long term vision. Studies like Collins’ work help to jostle me away from the daily issues to take a look at some important broader issues. I read, with interest, Rand’s take on the state of SEOmoz. Although I agree with much of his assessment, my vantage point is a little different. I have a few years on Rand and many of you who also responded. Perhaps I can shed some light with my two cents. Does SEOmoz Have Level 5 Leadership? No… and yes. In the making. When I read the Level 5 leadership chapter I, like the Pundit, wondered whether it was not a little shortsighted. Did one leader really make all the difference? Was GE not a great company for years and merely ‘took off’ as a result of all the work that came for all the generations before? Yes. And no. I’ve run this company (under another name) for more than a quarter of a century. That’s more than a generation. It was small, family owned, with a locally based clientele, doing largely unexciting, non-innovative things for average companies. In other words, in no way would it be considered a great company. But I planted some seeds. I was personally honorable, trustworthy, creative, and my clients made money when they took my advise and used my services wisely. Rand joined the company when he was very young. I admit I both shepherded and pushed him beyond his comfort zone creatively, in sales and management. When Rand took over as CEO, he’ll tell you he wanted to, but wasn’t ready to do so. There is only way to become ready for such a role. As Nike says, just do it. I see the elements of a Level 5 leader in Rand. The fact that I devote hours to mopping up and doing what others don’t doesn’t make me a Level 5 leader. It makes me a good team player, a good sport. Likewise, the fact that Rand gets lots of press doesn’t make him not a Level 5 leader. A Level 5 leader’s ego is wrapped up in the success of the company, not in whether the papers carry his name or photo. Rand meets that criteria. There are other criteria which he will struggle to achieve. But I have no doubt that he will, because of his fortitude and will. The product of first generation Americans, Rand truly believes that he can, by sheer force of will, do, create, and achieve anything. He’ll attest to the many times I have driven that idea home to him over the years. So I will take credit for ‘growing’ this emerging leader, not for being one. My own company was fine, but small and local. Rand will take it ‘to the next level’. He already has, and I am honored to steer the course while he shoulders the mantle of that responsibility. Do We Have the Right People in the Right Seats? Here, I agree with Rand. We have some of the right on the bus, not all in the right positions. As we are small, we don’t have the luxury to sit in our ‘right’ seat all the time. Witness that Rand and I serve as the receptionist. A note about Rebecca: Rebecca’s capacity to learn whatever is needed, under pressure, is truly noteworthy. With this large base of experience, Rebecca will find her field of specialty. But it is her ability to excel in so many areas in such a short period of time that impresses upon me daily that she is the right person. As we grow, there will be even more valuable roles for her and I have no doubt that she will identify and fill them well. Do We Confront the Brutal Facts? Here I bring the wisdom of age to the answer. This one is the easiest one for me to answer. Yes. We have confronted brutal facts and survived because of it. Before the dot-com bust years, I had a traditional marketing and advertising company that also developed websites. From May to July of 2001, we saw the market for high end websites dry up overnight. We saw dozens of competitors go out of business over the next half year. We were faced with some brutal facts: 1) There was no more capital budget money in the client base we served to purchase websites. We could no longer sell to them. 2) Traditional print media marketing, specifically newspaper advertising, although it might sustain us in the short term, was a dying industry. We had to get out of it, not waste time in it. 3) If we were to survive, we had to continue to focus on web-based products and services and determine how to make that work or lose our footing in the future marketplace. We solved the problem (how is another story) and survived. Recently, we had to look at the ‘do not do’ list. Some of that was ‘brutal’ for me, if not for Rand or the balance of the team. Some of what we must not do involves saying goodbye to clients with whom I have worked for more than 15 years. I have seen their children grow, welcomed the arrival of their grandchildren. I have seen them leave prosperous companies and start their own. I have shepherded their new companies to national success and shared in their joy. These people have become more than business acquaintances. Today, I said goodbye to one of those dear friends. We will still handle a small piece of their marketing, but I will find a new agency for them. We are no longer in that business. Hard to do. Absolutely necessary. The ‘do not do’ list has been hardest for me. What is Our Hedgehog Concept? Premium content. Yep. No argument there. Oh – SEOmoz was around as a concept since 2003. The company was formed as an LLC in 2005. In a few days, we’ll change again and be a C corp. I’ll get around to blogging about the relative advantages for those of you who are ready to move on from the sole proprietor consulting model soon. Have We Created a Culture of Discipline? Here, I would waffle more than Rand has. Discipline is not defined by working early or late. That’s passion. Discipline is doing the right things – and tending to the do-not-do list. It’s setting goals and timelines and doing what it takes to meet them or changing how them and then changing how you estimate the time it will take for the next goal. It’s applying metrics to your organization the way we apply them to activity on websites. I think we have a long way to go at SEOmoz in terms of discipline. We’re starting, but it will be a long road, and we will all feel the strain of it as we put it place. I am convinced that without discipline, we will not succeed. Wish us luck; this is going to be our stumbling block. If we can master corporate discipline, we’ll reach our goal of providing excellent products and services to the growing SEO profession. Are We Turning the Flywheel? I agree again. We are turning the fly wheel. I will even say that it is becoming a little easier to turn with each passing day. I will confess to feeling weary from having tugged so long and pushed so hard to make it turn even once and then twice. I expect Rand would feel the same way. But now, I see the snowball or flywheel effect taking hold. With each launch, each improvement of existing service, and each new idea, the wheel turns more easily. I’ll let you know if and when I see the point of ‘breakthrough’. I see Rand’s challenge and hope more will step up and take it. If you’re running your own show, even as an independent contractor/consultant, this is a worthwhile exercise. BTW - Across the pond, Will Critchlow has put his own company, Distilled, to the Good to Great test. It's fantastic to see others being so open about their businesses. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Good to Great: Gillian Responds to Rand's Answers to Hard Questions"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Good to Great: Gillian Responds to Rand's Answers to Hard Questions"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Gillian Muessig\n          \n            Gillian Muessig"
}