{
  "url": "https://moz.com/blog/good-retrospective-from-jim-boykin",
  "slug": "good-retrospective-from-jim-boykin",
  "title": "Good Retrospective from Jim Boykin - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Jim (of WeBuildPages) was interviewed by Aaron Pratt of SEO Buzzbox (a site I hadn't heard about until today). In it, he talks about the last few years of running an SEO company, getting called out for being \"evil\" by Matt Cutts and touches on how he's gotten \"whiter\" with the times. It's a ...",
  "content": "Good Retrospective from Jim Boykin SEO Events By: Rand Fishkin December 1, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 1, 2005 Good Retrospective from Jim Boykin SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Jim (of WeBuildPages) was interviewed by Aaron Pratt of SEO Buzzbox (a site I hadn't heard about until today). In it, he talks about the last few years of running an SEO company, getting called out for being \"evil\" by Matt Cutts and touches on how he's gotten \"whiter\" with the times. It's a good read and a very honest conversation. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Good Retrospective from Jim Boykin"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Good Retrospective from Jim Boykin"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}