{
  "url": "https://moz.com/blog/google-toolbar-pagerank-updates",
  "slug": "google-toolbar-pagerank-updates",
  "title": "Aggregate Detail on the Numbers from Google's October 2007 Toolbar PageRank Updates - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Just a little under two weeks ago, we received numerous reports that a very large number of sites had experienced a sudden drop in Page Rank.\n\nMany immediately began claiming that Google had rolled out an update for its rank formula to penalize for paid links.\nOthers played down these reports…",
  "content": "Aggregate Detail on the Numbers from Google's October 2007 Toolbar PageRank Updates Search Engines By: MelGray November 5, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: MelGray November 5, 2007 Aggregate Detail on the Numbers from Google's October 2007 Toolbar PageRank Updates Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Just a little under two weeks ago, we received numerous reports that a very large number of sites had experienced a sudden drop in Page Rank. Many immediately began claiming that Google had rolled out an update for its rank formula to penalize for paid links. Others played down these reports offering that their own sites had experienced no change at all. How do we know who to believe? How do we sort through the hearsay and report findings based not on alchemy, but instead on real science? Well luckily, here at the MOZplex, we have quite the arsenal of tools up for the job. Thanks to our users, we have amassed an impressive amount of historical rank data for domains. We can use this data by comparing it to live Page Rank information. The difference in these numbers provides us with a point that we can use to start turning lead into gold (unless of course your page sank, then its still lead). And now on to the brass tax, our findings... These tests were run on 10/24/2007 between 3pm and 10:32pm PST 32,856 domains surveyed 0 experienced a gain in Page Rank 1,264 experienced a drop in Page Rank 31,592 experienced no change in Page Rank 0% gained Page Rank 3.8% lost Page Rank The above does lead one to believe that a change has taken place. What makes it more interesting is that after combing through the top 5 biggest losers, we had confirmed that they all indeed contain paid links. This leads one to believe that perhaps there are some Rodkas present amongst those initially reporting the problem ;) While this isn't really at all that encouraging, it doesn't really seem as bad as some made it out to be... We then caught wind that there would be a second round of \"adjustments,\" so we re-ran our tests. This occurred on 10/29/2007 between 12:19pm and 5:28pm PST. This time around we found that a great number of pages experienced a page rank increase. 5,499 pages gained in toolbar PageRank 1 page jumped 6 points 4 pages jumped 5 points 35 jumped 4 points 211 jumped 3 points 1,054 jumped 2 points 4,194 jumped 1 point But, with the good does come the bad. 9,527 pages experienced a drop in rank this time. This wave seems much more significant than the initial changes, as the differences in rank are much more dramatic. The pages that dropped in the first round fell at the very most, by 4 points. This time around we saw drops as large as 7 points. However, the pages that took those big hits don't seem to be operating under the guise of legitimacy, but rather are all parked and/or offline. A very interesting observation is some of Google's competitors dropped (albeit by a single point, but still a drop [Yahoo, Altavista, Microsoft, etc]). This could mean nothing, as Google.fr appears to have dropped ranks as well. At a glance it appears that many sites did lose page rank for untold reasons. However, the sites that dropped by the greatest margin did contain paid links. Any other observations, additional data, or questions are more than welcome. NOTE FROM RAND: Just as an FYI - while we collect a lot of cool data like this, we'll only ever use it in the aggregate. We DO NOT use our collected data for competitive analysis, to give us ideas, or to \"out\" any specific sites for their actions and won't do so in the future. However, we will try to provide lots of nifty data like the above from Mel as major changes happen in the engines. My personal opinion is that based on the data we see and shared, the first rollout of TBPR data was very clearly an effort to devalue or discriminate against those sites selling links that Google felt were intended to manipulate rankings, while the second change (approx. 48 hours later) was a traditional updating of visible toolbar PageRank data. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Aggregate Detail on the Numbers from Google's October 2007 Toolbar PageRank Updates"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Aggregate Detail on the Numbers from Google's October 2007 Toolbar PageRank Updates"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "MelGray\n          \n            MelGray"
}