{
  "url": "https://moz.com/blog/google-plus-new-google-social-network",
  "slug": "google-plus-new-google-social-network",
  "title": "Google+ | The New Google Social Network - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Last night I got my first look at Google+, I spent just over three hours diving in a playing with all the features they have to offer. For those of you who already have access, please share you thoughts in the comments and those without access, enjoy this preview and share your thoughts on what…",
  "content": "The New Google Social Network - Google+ Social Media By: Casey Henry June 30, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Casey Henry June 30, 2011 The New Google Social Network - Google+ Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Last night I got my first look at Google+, I spent just over three hours diving in and playing with all the features they have to offer. For those of you who already have access, please share your thoughts in the comments and those without access, enjoy this preview and share your thoughts on what this new social network could mean for SEO. First Look Below is the \"Home\" screen, which seems vaguely familiar to a different social network I use but seems to be somewhat more streamlined. You can simply sort your friend groups, called Circles, by clicking on the \"Streams\" in the left sidebar. This give you a chance to only see things shared from your family or other Circles, for example I can select \"Family\" and see only their content. This looks like it makes it really easy to combine all your work and personal contacts into one network. Circles The first thing I got right into was creating Circles, which are much like Facebook groups where you can categorize people. This is helpful for people like myself who don't like to share my SEO related stories/posts with my friends/family members. The process of adding people to these Circles was relativity easy, granted I only had 8 people in my list, but this process seems very streamlined. Hangouts An interesting feature that Rand, Space, Mike and I got to try last night was Google Hangouts. It's a feature that allows you to chat and video chat with up to 10 friends. We found the feature to work, though it wasn't as great as I thought it was going to be. The cool thing is that when you start a Hangout, it alerts other people in your Circles that you have started a Hangout so they can join. You can limit who sees that you have started a Hangout this prevents you from starting a business Hangout and having your Mom show up. Sparks Next up was something that Google calls Sparks and describes Sparks as “an online sharing engine.” To me, Sparks seems to be a way to add a \"live\" SERP into your social network. I added SEO and Cycling as my first two Sparks to see what happens. Basically I got a list of webpages, press releases, and videos that relate to the term I entered and they seemed to update over the few hours I watched them. The content listed in each Spark has a Share link, which allows you to easily share that content with your Circles. Photos As with any social network, having the ability to share photos with your friends is key! Google+ has a few different ways of displaying and sharing photos with your friends. Below is the first way to see the photos that your friends have shared. It is quite a user-friendly way of seeing what images are included in each album your friend shared. If you click on one of the options above, it opens a slideshow of all the images your Circles have uploaded. It allows you to quickly flip through your friend’s images and add comments quickly, along with seeing all other comments. Like other networks you can tag your friends in photos that you upload. Next is what it looks like when you share a picture within an album that you created. When you roll over the image it increases in size and displays the whole images, which is helpful for some images. I found the ability to upload photos very easy and the uploads happened very quickly. Overall I found that the ability to share photos was not as streamlined as I would have liked it to be but I'll leave the final judgment up to others. Security Below are some of the security options that you can set when sharing things with your circles. It allows you to stop people from commenting on the thing you shared and you can stop them from resharing it with their circles. Also when you first share something it allows you to pick what Circles you want to see the thing you shared. So if you don't want your Mom to see the picture of Carlos from Agillian below, then you should make sure you share it only with your SEO friends. My Takeaways In closing, I have to say I was impressed with some things but overall I think they have some work to do before this really catches on with the main stream public. Google+ seems to have a large learning curve which could deter many new users. I spent just over 3 hours on it and don't feel like I really touched the surface of what it can do, nor do I fully understand what the purpose of some of their new features. Rand may have said it best with what he shared on Google+ last night: How Does This Affect SEO How do you think Google is going to integrate Google+ with your search results? We did some quick tests last night to see how sharing things on Google+ will effect the SERPs of the friends in your social Circles. So far we couldn't see any noticeable difference when your friends share something or +1 it within Google+. Now this doesn't mean anything as Google often rolls out products early and works them into the SERPs later. We will be doing more testing to see how this new release from Google will effect the way we do our jobs, so stay tuned. Also if you have seen anything that I may have missed, please do share it in the comments below. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The New Google Social Network - Google+"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The New Google Social Network - Google+"
    },
    {
      "level": "H2",
      "text": "First Look"
    },
    {
      "level": "H2",
      "text": "Circles"
    },
    {
      "level": "H2",
      "text": "Hangouts"
    },
    {
      "level": "H2",
      "text": "Sparks"
    },
    {
      "level": "H2",
      "text": "Photos"
    },
    {
      "level": "H2",
      "text": "Security"
    },
    {
      "level": "H2",
      "text": "My Takeaways"
    },
    {
      "level": "H2",
      "text": "How Does This Affect SEO"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Casey Henry\n          \n            Casey Henry\n          \n            Casey Henry"
}