{
  "url": "https://moz.com/blog/google-adwords-is-giving-me-a-headache",
  "slug": "google-adwords-is-giving-me-a-headache",
  "title": "Google AdWords is Giving Me a Headache - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "At the beginning of October Rand and I launched 25 ad campaigns on Google AdWords. We chose keywords that got a fair amount of searches each month but were by no means popular so that we'd be able to bid on them for dirt cheap; hence, we bid on words like \"Punnett square,\" \"snark,\" Venn diagram,\"…",
  "content": "Google AdWords is Giving Me a Headache SEO Analytics By: Rebecca Kelley January 3, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley January 3, 2007 Google AdWords is Giving Me a Headache SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. At the beginning of October Rand and I launched 25 ad campaigns on Google AdWords. We chose keywords that got a fair amount of searches each month but were by no means popular so that we'd be able to bid on them for dirt cheap; hence, we bid on words like \"Punnett square,\" \"snark,\" Venn diagram,\" and \"uvula.\" Our goal for this experiment was to see how many impressions AdWords tracked for each keyword and compare it to various keyword research tools. I made sure to adjust our bids so that our ads would show up on the first page of results, and I also wrote boring ads in order to reduce clickthrough (we weren't interested in clicks, only impressions; plus, we wanted our experiment to be as cheap as possible). After constructing landing pages for each term that defined the keyword and linked out to additional sources, we ran the ads until the end of 2006 so that we could analyze 3 months of data.After October turned out to be a bust (I forgot to edit the campaign settings and only show our ads on Google searches, which resulted in us owing Google $649.40...grrrrrrrr), we analyzed November and December's data. The results did not make us happy.Six of our ads didn't show, so they had zero impressions. \"Blood in urine\" had 11 impressions for the month, which probably means that the ads only showed for part of the month. December is even worse:Eleven ads didn't show, even though I made sure all of our campaigns were activated and that each bid was enough to show on the first page of search results. Clicking on a term with zero impressions brought up this note: A pink notice box for the ad group also offers the following advice: \"These keywords are marked in the Status column of the Keywords tab below. Improve their quality through optimization, delete them, or raise the keywords' maximum CPCs to the minimum bids indicated. (Raising the bids to at least the minimum will activate the keywords.).\"So, basically because nobody else is bidding on \"fishing in the dark,\" I have to increase my cost per click in order to have my ad show? Yet \"sulfur dioxide\" is fine? What doesn't make sense to me is that when I set up these campaigns, I adjusted the costs to ensure that they'd show up in search results, and I checked a few times to see if they were showing (which they were). Some time between when I set up the campaigns and when I checked them to see how they were doing, Google decided to stop showing certain campaigns until I pay them more money.What am I supposed to do, check the campaigns a couple of times each day in order to see if the ads are still visible? Not only is that going to throw off my impressions, but I (obviously) have other things to work on than to devote a good chunk of my week making sure AdWords is doing its job. I can't keep fiddling with CPCs because what Google decides is sufficient one day is unacceptable the next. To further add to the frustration, I don't know if the impressions are accurate because for all I know, some of my campaigns could have stopped showing for a couple days, which would throw off the count.If anyone else has had a similar headache with Google AdWords, I'd be interested in hearing about it. Or, if you have advice on how to improve our experiment or know if there's an easy fix for our problem, let me know. OR, if you're on the AdWords team, let me know what the heck is going on here. I am not a happy Mozzer.Update from Rand: What really makes me upset about this is how frustrating AdWords makes it for new users to figure out their system. Granted, I probably should have spent some serious time with Rebecca figuring out the ins and outs of the system, paying attention to the spend and the figures, and not playing fire and forget. But, at the same time, Google is way off base by: providing a way to ensure your ad shows (particularly when no one else is bidding) not defaulting to the content network (that's more than a bit evil, IMO) not showing more accurate estimates for traffic and spend - that accuracy will serve to provide more revenue and use; any time marketers get better information, they spend more - that's why search marketing is such a great investment. For long-time PPC addicts, this is, no doubt, old hat, but for us on the organic side, it's completely un-intuitive. I've managed campaigns in the past, but it's been a while and Rebecca's experience is, to my mind, a perfect example of why folks get so frustrated with the product. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google AdWords is Giving Me a Headache"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google AdWords is Giving Me a Headache"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}