{
  "url": "https://moz.com/blog/google-api-leaks",
  "slug": "google-api-leaks",
  "title": "20 SEOs Share Their Key Takeaways From the Google API Leaks - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Discover expert insights from the recent Google API documentation leak with actionable strategies to help you become a better SEO strategist.",
  "content": "20 SEOs Share Their Key Takeaways From the Google API Leaks Advanced SEO | Marketing Industry By: Chima Mmeje Edited By: Emilie Martin June 18, 2024 Table of Contents Copied! By: Chima Mmeje Edited By: Emilie Martin June 18, 2024 20 SEOs Share Their Key Takeaways From the Google API Leaks Advanced SEO | Marketing Industry For years, we’ve been asking Google one question as an industry: How do you rank content? So far, we’ve gotten piecemeal around algorithm update documentation and some guidance from search liaisons that never felt like a proper answer. Until now. If you work in SEO, you’ve probably heard about the Google leaks. While most of it confirms what many of us already know, it's still useful to validate these theories and raise new questions about how some features work. Before reading this article, I strongly recommend that you do two things: Read Mike King’s breakdown of the Google Leaks. Read Rand Fishkin’s breakdown of the Google API documentation leaks. FYI, I’ve featured these rock stars in this article. I also contacted two well-known Google employees, Search Relations Team Lead John Mueller and Developer Advocate Martin Splitt, for comments. They both declined and referred me to Google Press. I sent two emails to Google Press asking for comments, but I didn't hear back from them at the time of publishing this post. With this roundup post, I've fleshed out key questions to help SEOs do their jobs better going forward. I invited 20 SEOs and marketers to share their thoughts about specific parts of the leaks and actions you can implement in your strategy. 1. But first, an overview of my key takeaways Chima Mmeje — Senior Content Marketing Manager at Moz Collect topical backlinks like infinity stones The leaked document sheds light on Google's nuanced approach to evaluating links, especially the topical relevance of those links. The section in the screenshot below concerns what to include in an article rather than where to get backlinks. But the fact is that the Google algorithm understands the topicality of an entity, and relevance seems to be a core focus for scoring across the board. I can assume that if Google algorithms can tell whether an entity is relevant to a topic, they can also tell when links are topically relevant. I suspect that Google's algorithm prioritizes links that are contextually aligned with the content of the linking and linked pages. Topical links are trust signals from authoritative websites telling Google about the reliability and quality of your content. So, rather than waste time collecting generic links, focus on becoming a topical authority that people want to link to naturally. Creating helpful content triggers a good ripple effect Here’s the ripple effect that happens when you create helpful content: People land on your pages and read your contentThey spend more time, which improves your dwell time metricsThey navigate to other pagesThey don’t go back to the SERP for more answersThey convert, take action, and enter your funnel, likely leading to a sale The leaks have shown that Google uses Chrome data and clickstream data to determine overall site quality. If you create helpful content, people will naturally take action that improves your engagement metrics. Brand authority is evergreen SEO The leaks discuss various site-wide authority indicators contradicting Google's previous statements denying using sitewide signals for ranking purposes. Narrow approaches won’t cut it anymore. Rather than focusing on individual ranking factors, consider how people perceive your overall brand and how they engage with you across various platforms (including social media), not just on your website. To become the source of truth and slowly evolve into a memorable brand, you need a multimodal, omnichannel approach centered around high-quality content. Alright, enough yapping from me. Let’s hear from other SEOs who’ve been vocal about these issues for a long time. 2. What is NavBoost, and why does it matter for search ranking, as seen in the leaked document? Mike King — Founder of iPullRank NavBoost is a re-ranking system that modifies search results based on user click behavior, considering factors like location, device, and SERP click positions. According to Pandu Nayak's DoJ testimony, Google established this system in 2005, and it has evolved significantly as machine learning became an integral part of Google Search. The leak and the DoJ testimony emphasize the importance of user engagement, which I now see as crucial in SEO, as on platforms like Instagram and TikTok. Chima’s key takeaways from Mike King: We must reduce the distance between SEO and user experience (UX). For SEO to work, you need to integrate deep audience analysis that leads to engaging, sticky experiences.SEOs should take the time to understand NavBoost. It’s one of the most essential elements of Google's ranking systems, underscoring the importance of creating content that resonates with specific audiences. Darwin Santos — Senior Technical SEO Strategist & AI Innovation Manager at Webserv From my understanding, NavBoost is a tool that enhances user experience by quickly directing users to what they're searching for, such as making sure a search for \"Facebook\" takes them straight to its home page. NavBoost prioritizes results based on historical click data. It analyzes user behavior, monitoring click rates and how long they stay on a page to ensure the most relevant results are presented. Chima’s key takeaways from Darwin Santos: Optimize queries to meet expectations, focusing on improving user experience, site structure, and mobile optimization.Make sure you control branded SERPs and use structured data to improve SEO. 3. How do you think the leaked information about Google's API will impact SEO strategies? Should we change anything or maintain the status quo? Jeff Coyle — Co-founder, Chief Strategy Officer at MarketMuse The Google Content Warehouse API leak gives me a glimpse into how Google organizes and processes information, hinting at benefits such as creating a unified industry vocabulary. This common language could improve communication, standardize SEO practices, and promote transparency, potentially leading to faster innovation and better search result quality. My detailed exploration in this article provides practical applications. However, caution is necessary; the leaked information might be incomplete, outdated, or lack sufficient context. As such, there's an obvious risk of misinterpretation. We must avoid jumping to conclusions or making decisions based on this incomplete information. Chima’s key takeaways from Jeff Coyle: Embrace the shared vocabulary to enhance industry communication and standardize SEO practices.Use the insights from the leak for more effective strategies and improved search quality.Exercise caution about the data's completeness and remain flexible in response to changes in Google's processes. Sofia Inga Tyson — Senior Content Manager at Juro As an industry, we’re obsessed with testing and learning, which is great. But we’re prone to overengineering our efforts and narrowly following what Google’s spokespeople tell us is gospel. The recent leak about Google's API shows the importance of user experience in SEO strategies, a perspective long held by many in the industry. This leak has validated my assumptions about how Google assesses and values content, emphasizing that genuine, user-focused strategies are essential. The goal was never to manipulate algorithms but to provide real value to human users. Chima’s key takeaways from Sofia Inga Tyson: Continue prioritizing user experience in SEO strategies as it aligns with Google's criteria and SEO best practices.Regularly update content to ensure accuracy and relevance, maintaining trust and engagement.Validate content authorship to establish credibility and build trust with your audience.Focus on relevant linking within content to aid users in their research and improve site navigation.Ensure your brand maintains a strong, authoritative online presence to boost SEO and consumer confidence.Mordy Oberstein — Head of SEO Brand at Wix I am concerned that SEOs may misinterpret the information as a checklist. Take how the leaks refer to \"mentions,\" for example. I'm concerned that SEOs will focus on these, similar to how they previously focused on links. Instead, the leaks should encourage the longstanding idea of a broader, more holistic approach, emphasizing a digital presence shaped by user interactions across the web rather than isolated metrics. Attract Google by creating a bright \"digital light\" for your site. During the Medic Update in 2018, I discussed how Google seemed to be profiling sites. Specifically, I had a strong hunch that they were looking at whether the content on the site aligned with its purpose. For example, if the site was informational, was that informational content far too transactional? At the time (and still do), I believed that Google was examining the entire corpus of content presented on the site to see if there was a thread of topical alignment. I see similar themes in some of what was contained in the leaks. Chima’s key takeaways from Mordy Oberstein: Move beyond traditional link-building; consider all aspects of digital interaction contributing to a site's \"digital light.\"Focus on maintaining a robust and consistent brand identity across all content and platforms.Ensure content aligns with the site's overall purpose, avoiding a scattergun approach to topics or themes.Adapt to the holistic approach signaled by the leaks, integrating insights about how broader user interactions influence search visibility. Tyler Hakes — Strategy Director & Principal, Optimist I worry that Google's API leak may unintentionally encourage a resurgence of dubious SEO practices, like engagement bots or click farms, as bad actors look to exploit the system. However, such tactics are only temporarily effective before Google updates its algorithm to penalize these shortcuts. Strategically, this means that organizations should view SEO as a multifaceted discipline requiring investment in: Content qualitySite authorityBrand buildingSERP optimizationUser experienceTechnical SEO A holistic approach ensures that no algorithm change can drastically impact overall performance. Chima’s key takeaways from Tyler Hakes: Avoid reliance on quick-fix SEO tactics, which may lead to big traffic drops or penalties with future algorithm updates.Commit to a comprehensive SEO strategy encompassing factors like content quality and user experience.Invest in SEO resources to ensure a well-rounded approach that aligns with long-term business growth rather than short-term gains. Jonathan Berthold — VP of Revenue at Moz The answer to this question differs based on the profile of SEO you ask. Affiliate marketers, in particular, may find their strategies under more scrutiny, urging a shift towards more sustainable practices due to the potential for further restrictions on organic traffic. Also, the leaks affirm the importance of brand building and creating high-quality, user-centric content. We can deduce that Google considers author expertise and associations, highlighting the growing relevance of brand and authority in content strategy. Chima’s key takeaways from Jonathan Berthold: SEOs using aggressive link-building and AI tools should adjust to focus more on quality and sustainability.Continue refining user experience strategies, but incorporate insights from the leaks to improve link-building approaches.Prioritize building a strong brand and authoritative content, focusing on the expertise of recognized authors to boost engagement and SEO outcomes. 4. Given the revelation of 'siteAuthority' in the leaked documents, how do you think this affects the industry’s understanding of Domain Authority? Rand Fishkin — Co-Founder of Sparktoro The \" siteAuthority \" metric is the least interesting and obvious of the sitewide authority signals in the API docs. While it sounds damning, we don't know what it means. What we do know is that signals like \"homepage PageRank,\" \"site2vec,\" \"entities being tied to domains,\" and the dozens of link, authorship, content, and title signals across a \"site\" or \"domain\" and not just on a page indicate Google has been misleading marketers for years when saying they don't use \"sitewide signals\" or \"any form of website authority.\" Rand Fishkin's key takeaways: With big brands dominating search, exploring Barnacle SEO (i.e., placing your content on other people's powerful sites), finding alternative channels (PR, email marketing, influencers, sponsorships, etc), or targeting niche terms overlooked by larger competitors might be more effective.Given the leak's metrics on sitewide relevance and consistency of page value, it may be wise to test trimming (by removal or noindex) content that isn't targeted at your core topic(s) or isn't unique, high-quality, and human-created. The leak also suggests that sites with specific, narrow topics could improve Google's perceived relevance and authority vs. diluting site focus with unrelated work (even if it's very high quality). The leak contains evidence to support these strategies, but remember — we don't know how highly Google weighs these factors. It's important to test, pay attention to other professionals publishing the results of their own tests, and stay on top of Google's ever-changing systems. Barry Schwartz — Founder of Search Engine Roundtable It is interesting how Google has worded things in the past, often saying Google does not use Domain Authority®, which is a specific metric from Moz. Meanwhile, it acknowledges using some form of site authority to aid new pages lacking individual signals. Recent references to site authority, especially with the helpful content update, suggest a more nuanced use of this metric than previously admitted. This revelation prompts a critical review of how SEO professionals approach \"authority\" within the framework of EEAT, where \"authoritativeness\" is a crucial component. The challenge is ensuring that efforts to improve a site's authority are genuine, not merely attempting to \"game\" the system. Chima’s key takeaways from Barry Schwartz Focus on cultivating real authority by enhancing content quality and reliability.Stay updated with Google's latest statements and guidelines on authority metrics to ensure that SEO strategies align with the current best practices and expectations. 5. The leak mentioned several engagement data as ranking signals. How do you think these features are weighted? Are they still in use? Stefanie Morris — SEO & Marketing Consultant The leaked Google API documents reveal how engagement data influences SEO rankings. Key metrics include: NavBoost click and location attributes: These track user clicks and geographical data to tailor site navigation and enhance personalized experiences.Clickstream data: Monitors user click sequences across pages, offering insights into user behavior and journey.Content attributions: Links specific content to user actions, helping to identify what content effectively engages users. These attributes suggest a sophisticated approach to measuring user interaction. Different weights are likely assigned based on their impact on user experience and content relevance. Due to their direct influence on engagement and retention, NavBoost attributes are possibly heavily weighted. Clickstream data and content attributions might hold moderate weight, informing site structure and content strategy adjustments. Understanding these metrics is crucial for SEOs aiming to optimize sites comprehensively. The emphasis on genuine user engagement highlights the importance of developing content strategies that cater to user needs, moving beyond superficial tactics to foster real interaction and satisfy user intent. What should SEOs focus on? Improve user interaction through personalized content and navigational ease.Analyze and adapt to user behavior data to optimize site architecture and content placement.Prioritize creating value-driven content that resonates with users, reflecting better engagement metrics. Erfan Azimi — Founder at EA Eagle Digital The leaked Google API documents provide detailed insights into how site-level quality is assessed. They integrate metrics such as Chrome user signals and click data to determine a site's overall quality. Additional factors such as product reviews and exact match demotions also play a role. This process isn’t real-time and likely coincides with broad core updates to affect rankings. Focusing on user engagement metrics is vital for site optimization. Branded clicks, in particular, can indicate higher engagement levels and influence site assessments. Google also evaluates content at the sub-folder level, potentially scoring different sections of a site, such as product pages and blogs, differently based on their engagement data. NavBoost details: Real-time boost: It uses instant NavBoost and Chrome data to adapt to content virality, updating quickly every 10 minutes.NavBoost queries: Adjusts rankings based on user interactions with specific queries, enhancing relevance for frequent searches.Image/video engagement: Engagements with images and videos related to NavBoost queries can trigger multimedia features in search results.Engagement scoring: Differentiates between short and long clicks to gauge content relevance and user satisfaction. Despite the potential for manipulation through bots and click farms, such tactics are challenging and risky. My experimentation across various countries indicates that, while possible, influencing engagement signals on a large scale is improbable. Chima’s key takeaways from Erfan Azimi: Prioritize engagement metrics to optimize site quality evaluationsTrack user engagement at the sub-folder level to understand and enhance different site areas based on their performanceWhile manipulating engagement signals is technically possible, it's risky and unlikely to succeed on a large scale, emphasizing the importance of genuine user engagement 6. What's your take on Google possibly penalizing small sites? Why do you think that is? How should these sites adapt? Caileen Kehayas Holden — Content Director at Career Contessa The pain inflicted on small sites is the most heartbreaking. Many small sites belong to independent creators and veritable experts in their fields. In an ideal world, we would have a democratized internet, but algorithm updates in the past year have devastated small publishers. When these leaks hit the internet, it was a bit of a vindication. Unfortunately, vindication has never paid a mortgage. Google's public responses to these issues were dismissive or evasive, exacerbating the frustration for these site owners. Chima’s key takeaways from Caileen Kehayas Holden: Small sites must prioritize diversifying their revenue streams to mitigate the impact of Google's algorithm changes.Find alternative platforms and channels less dependent on search engine algorithms to ensure stability.Continue improving site and content quality, and explore new ways to engage and expand your audience beyond traditional search methods. Tom Capper — Senior Search Scientist at Moz The Google leak has highlighted potential algorithmic penalties, specifically a demotion known as \"smallPersonalSite,\" which targets small, personal sites. At face value, it would seem like a jump to suggest that this is related to the smaller affiliate, review, blog, and travel sites that have struggled in recent updates. However, a more detailed examination of the leak reveals discussions about \"NavBoost queries,\" a concept involving Chrome data to identify what SEOs might refer to as navigational or branded searches. This method could align with an old patent related to Panda, suggesting that Google evaluates the ratio of navigational searches to links to gauge the appropriateness of a site’s link portfolio relative to its brand size. It mirrors the rationale behind Moz’s Brand Authority™ score and supports longstanding views that branded search volume and click data significantly influence rankings. With Google increasingly focusing on search quality amid challenges like AI-generated content, this emphasis on brand strength and navigational intent could be a key factor behind the recent penalizations of smaller sites. Chima’s key takeaways from Tom Capper: How can small sites adapt? Improve your brand signals by increasing navigational searches directly associated with your brand.Focus on creating high-quality content that engages your audience. Watch Tom Capper’s insights from The Google Leaks: Miriam Ellis — Local Search Scientist at Moz Remember when using the web was more about stumbling upon cool and original small sites, and it wasn’t quite so common to hear complaints about Google favoring big brand content farms for every possible topic? I recall the multi-part HouseFresh story from earlier this year, with its stirring documentation of plummeting visibility and traffic. The Google leak revealing the \"smallPersonalSite\" feature suggests that Google might actively demote smaller sites based on their size, a concern for many small publishers. The definition and implications of a \"smallPersonalSite\" remain unclear, such as whether it applies to niche-focused sites with considerable content like HouseFresh or truly small entities like personal blogs or local businesses. These are my tips for small publishers: For local businesses, the smallPersonalsite feature is unlikely to be a major deterrent to basic discoverability because local packs still exist. Focus on improving local SEO for local search visibility to mitigate the impact of broader demotions.Expanding visibility beyond Google is crucial for non-local site owners. Leveraging social media and other platforms can help offset potential disadvantages in Google's search algorithms. 7. Mike King and others have drawn a link between the leak and an old Panda patent featuring a branded search-to-link ratio. How does this affect SEO? Liv Day — SEO Lead at Digitaloft If there is indeed a branded search-to-link ratio, we need to pay close attention to it, both in terms of our overall SEO strategies and link-focused ones. This metric suggests a logical connection: a site that doesn’t attract branded searches is unlikely to acquire links naturally. Hence, strategies that increase brand visibility and encourage branded searches, such as digital PR, are crucial because they earn links, boost brand recognition, and generate more searches. This aligns with what many of us have been saying for some time: links are not the only way digital PR influences SEO. This connection between the old Panda patent and the branded search-to-links ratio reinforces this. We’ve also learned that: Google may be ignoring links from within content that isn't relevant.Links from other countries could be less valuable.Google specifically tags links that come from “high-quality, newsy sites.” 8. Given the discrepancies between Google's public statements and the practices revealed in the leaked documents, what ethical responsibilities do you think search engines have toward transparency with the SEO community and the general public? Roshni Shaikh — SaaS Product Marketer and Information Architect Google's public statements often contradict the practices revealed in leaked documents, raising concerns about transparency. For instance, despite claims that user experience metrics like bounce rates and dwell times don't influence rankings, the reality is evident in how these factors affect user engagement in practice. Source: X.com via @rustybrick Ensuring more transparency around their ranking systems without deleting past communication can help Google regain its credibility. What needs to change? Google must ensure its communications, especially about ranking factors like dwell time and bounce rates, are clear and supported by observable metrics.Avoid erasing historical data or communication, maintaining a complete record for reference and accountability with search liaisons and Google itself.Direct and unambiguous responses to user inquiries are crucial for maintaining credibility and trust within the SEO community. Barry Adams — Independent SEO Consultant for News Publishers The leaked documents revealed a major gap between Google's public statements and its actual practices, impacting the trust between Google and the SEO community. The leaks confirm Google's use of metrics and signals they previously denied, such as user engagement and site-wide authority, undermining their credibility. These revelations indicate that Google may have been using the SEO community for its benefit rather than supporting genuine optimization efforts. Chima’s key takeaways from Barry Adams: Approach Google's guidelines with caution, recognizing that not all statements from Google may align with actual ranking factors.Diversify your strategies to include a broader understanding of potential undisclosed metrics influencing rankings. David Lovett — VP of Content & SEO at Rocket55 I might be swimming away from the rest of the pack here, but I don't think search engines have ethical responsibilities for their users. I have often thought of that as the SEO industry's role. To some extent, we exist to make search engines accurate and to hold them accountable. This might be a contrary opinion, but I like the idea of users losing confidence in Google because it increases the chances of Google's monopoly weakening and rival search engines stealing market share. Any monopoly concerns me, and I am excited that we are finally seeing Google's star fall. 9. How will the Google leak affect the Anti-trust trial? Tory Gray — CEO at GrayDotCo The Google leak could impact the ongoing antitrust trial by challenging the company's long-standing claims of maintaining a separation of church and state between its services. Google has consistently stated the following: Google Ads payments do not affect organic rankings.Google Analytics data is not used for ranking purposes due to its private nature.No data from Chrome influences rankings. These reassurances were intended to dispel concerns that Google was using its market dominance in one area to influence another unfairly. However, the leak suggests that data sharing between Google's various entities may be more extensive than previously acknowledged, potentially indirectly using this information to influence market dynamics. Key takeaways for regulatory scrutiny from the Google leak: Regulators may intensify investigations into Google's internal practices to determine if there has been any cross-sharing of data between Google's services that could affect fair competition.The leak could lead to a reassessment of Google's compliance with antitrust regulations, especially regarding its claims of independence between its advertising, analytics, and browser operations.Enhanced regulatory oversight might be necessary to ensure that Google's market behavior remains competitive and does not abuse its dominant positions across different platforms. Concluding thoughts: Prioritize user experience and Brand Authority to win at search The Google API documentation leak reaffirms the importance of link relevance and user engagement in Google's ranking criteria. It highlights the enduring value of high-quality, topically relevant backlinks and robust user interaction metrics. Also, the role of user experience and site-wide authority signals challenge previous assertions by Google denying their use. SEOs must build a strong, consistent brand presence powered by an omnichannel content strategy that provides lasting value to users. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "20 SEOs Share Their Key Takeaways From the Google API Leaks"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "20 SEOs Share Their Key Takeaways From the Google API Leaks"
    },
    {
      "level": "H2",
      "text": "1. But first, an overview of my key takeaways"
    },
    {
      "level": "H3",
      "text": "Chima Mmeje — Senior Content Marketing Manager at Moz"
    },
    {
      "level": "H4",
      "text": "Collect topical backlinks like infinity stones"
    },
    {
      "level": "H4",
      "text": "Creating helpful content triggers a good ripple effect"
    },
    {
      "level": "H4",
      "text": "Brand authority is evergreen SEO"
    },
    {
      "level": "H2",
      "text": "2. What is NavBoost, and why does it matter for search ranking, as seen in the leaked document?"
    },
    {
      "level": "H3",
      "text": "Mike King — Founder of iPullRank"
    },
    {
      "level": "H3",
      "text": "Darwin Santos — Senior Technical SEO Strategist & AI Innovation Manager at Webserv"
    },
    {
      "level": "H2",
      "text": "3. How do you think the leaked information about Google's API will impact SEO strategies? Should we change anything or maintain the status quo?"
    },
    {
      "level": "H3",
      "text": "Jeff Coyle — Co-founder, Chief Strategy Officer at MarketMuse"
    },
    {
      "level": "H3",
      "text": "Sofia Inga Tyson — Senior Content Manager at Juro"
    },
    {
      "level": "H3",
      "text": "Mordy Oberstein — Head of SEO Brand at Wix"
    },
    {
      "level": "H3",
      "text": "Tyler Hakes — Strategy Director & Principal, Optimist"
    },
    {
      "level": "H3",
      "text": "Jonathan Berthold — VP of Revenue at Moz"
    },
    {
      "level": "H2",
      "text": "4. Given the revelation of 'siteAuthority' in the leaked documents, how do you think this affects the industry’s understanding of Domain Authority?"
    },
    {
      "level": "H3",
      "text": "Rand Fishkin — Co-Founder of Sparktoro"
    },
    {
      "level": "H3",
      "text": "Barry Schwartz — Founder of Search Engine Roundtable"
    },
    {
      "level": "H2",
      "text": "5. The leak mentioned several engagement data as ranking signals. How do you think these features are weighted? Are they still in use?"
    },
    {
      "level": "H3",
      "text": "Stefanie Morris — SEO & Marketing Consultant"
    },
    {
      "level": "H3",
      "text": "Erfan Azimi — Founder at EA Eagle Digital"
    },
    {
      "level": "H2",
      "text": "6. What's your take on Google possibly penalizing small sites? Why do you think that is? How should these sites adapt?"
    },
    {
      "level": "H3",
      "text": "Caileen Kehayas Holden — Content Director at Career Contessa"
    },
    {
      "level": "H3",
      "text": "Tom Capper — Senior Search Scientist at Moz"
    },
    {
      "level": "H3",
      "text": "Miriam Ellis — Local Search Scientist at Moz"
    },
    {
      "level": "H2",
      "text": "7. Mike King and others have drawn a link between the leak and an old Panda patent featuring a branded search-to-link ratio. How does this affect SEO?"
    },
    {
      "level": "H3",
      "text": "Liv Day — SEO Lead at Digitaloft"
    },
    {
      "level": "H2",
      "text": "8. Given the discrepancies between Google's public statements and the practices revealed in the leaked documents, what ethical responsibilities do you think search engines have toward transparency with the SEO community and the general public?"
    },
    {
      "level": "H3",
      "text": "Roshni Shaikh — SaaS Product Marketer and Information Architect"
    },
    {
      "level": "H3",
      "text": "Barry Adams — Independent SEO Consultant for News Publishers"
    },
    {
      "level": "H3",
      "text": "David Lovett — VP of Content & SEO at Rocket55"
    },
    {
      "level": "H2",
      "text": "9. How will the Google leak affect the Anti-trust trial?"
    },
    {
      "level": "H3",
      "text": "Tory Gray — CEO at GrayDotCo"
    },
    {
      "level": "H2",
      "text": "Concluding thoughts: Prioritize user experience and Brand Authority to win at search"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    }
  ],
  "author": "Chima Mmeje\n          \n            Chima Mmeje\n          \n            Chima Mmeje"
}