{
  "url": "https://moz.com/blog/google-profile-search-rank-for-jennifer-lopez",
  "slug": "google-profile-search-rank-for-jennifer-lopez",
  "title": "Google Profile Search (aka How to Rank for Jennifer Lopez) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Last week, Google started showing Google profiles at the bottom of U.S. search results. This caused quite a stir among the search marketing industry and a flurry of blog posts have been written about it. As with any topic there are varying opinions on the profiles. Some feel that it is a great way…",
  "content": "Google Profile Search (aka How to Rank for Jennifer Lopez) Reputation Management By: Jennifer Sable Lopez April 26, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jennifer Sable Lopez April 26, 2009 Google Profile Search (aka How to Rank for Jennifer Lopez) Reputation Management The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Last week, Google started showing Google profiles at the bottom of U.S. search results. This caused quite a stir among the search marketing industry and a flurry of blog posts have been written about it. As with any topic there are varying opinions on the profiles. Some feel that it is a great way to brand yourself, while others feel that Google is a bully trying to force us to hand over our personal information. See the image below for an example of how the Google profile results displays Rand's information: Either way, I was completely unphased at first. I read a short article about it, thought \"huh... interesting,\" but quickly went back to work (heck, it was my second week on the job!!). Not long after, I started noticing my Twitter stream was discussing the profiles more and more. Still, I hadn't even thought about creating a profile yet, why bother right? That's when it hit me... DUH! My name is Jennifer Lopez, and nowhere, nohow was I ever going to find myself in any SERPs for any search related to Jennifer (even Jen or Jenny) Lopez. Until now! Right?! Maybe? As soon as I realized the possible potential of my profile, I stopped what I was doing and created mine. Although I didn't fill out every little detail, I did add quite a bit of information. My focus was to make sure my name was set to Jennifer Lopez, and to list all the other names I've gone by in the past in the \"other names\" section. About 20 minutes after I created my Google profile, I finally started showing up at the bottom of Google search results for the terms \"Jen Lopez\" and \"Jenny Lopez.\" Wow... there I was! The first of MANY poor Jen (Jenny, Jennifer) Lopez' of the world finally getting their Google debuts! [One annoying \"feature\" is that the profiles don't show up in the results for famous names: Jennifer Lopez, Mike (or Michael) Myers, Michael Bolton, John Stewart. I've submitted a question to Google about this, in addition to asking @googleprofiles (a valid Google twitter account) via Twitter.] Check out the results for a search on \"Jen Lopez\" below: The profile results not only show you a brief intro about the top four, it also has links to view the full result set for your query. With links to searches on MySpace (huh? who still uses MySpace?), Facebook, Classmates (again, huh?) and LinkedIn. Think of the possibilities...! Long ago I had decided that I had to brand myself as \"Jennifer Sable Lopez\" for the very reason mentioned above. As of two weeks ago, I more or less dominated the SERPs for any combination of Jennifer, Jenny, Jen + Sable + Lopez. \"Sable\" was the key factor though. Without it, I was nowhere to be seen. Although I still don't rank for \"Jennifer Lopez,\" I'm quite excited that someone can now search for me sans \"Sable\" and find my information. Now, don't get me wrong. I'm not condoning the fact that Google is pretty much forcing us to create/update our profiles in order to show up correctly in the profile section. However, before you completely throw out the idea of creating your profile, think about the positive possibilities and the doors that this may open. Think about the other people out there with YOUR same name, who never show up in the SERPs because you completely dominate it for your name. Think of the JLo's of the world, and the possibility that we'll finally be found in a search! Profile Components If you haven't created your profile yet, I suggest getting on the ball! The first step is to simply search for \"me\" in Google and the first result will take you to the first step in setting up your profile. I won't go into full detail; Danny Sullivan wrote a great tutorial on how to set up your Google profile. You can add quite a bit of information, here's a quick list of items you can fill out: First and Last Name Nickname Other Names Location Information Work Information Education Information Short Bio Links Profile URL Photo Contact Information One of the great things about the profile is that you can make it as complete as you'd like, or only enter the most basic information. The only information you must enter in order to show up in the SERPs is your first name and last name. It's really up to you how detailed you want to be. Verify Your Name I really wanted to call out this portion because it took me quite a bit of digging before I figured out where/how to verify my name. This is one of the first things I did after setting up my profile. I have no idea if it will help with my rankings or not, but I wanted to have any kind of edge that I could get. Verifying your name is simple once you find where to do it! The only way to do this right now is through your Knol account. If you already have an account, you may already be ahead of the game, if not setting one up is quick and easy to do. Follow the steps below to get your name verified. Sign in/sign up to Knol Go to \"My Profile\" at the top of the page (Note: if you have never created a Knol before, you'll need to click \"add a Knol\" - but don't actually need to create one - in order to see the \"My Profile\" link) [edited to add this!] Select \"Edit My Preferences\" next to your image (under your name) Select \"Name Verification\" From here you can select one of two ways to verify your name - either by phone or credit card. I chose to verify via phone... I'd much rather have Google call me, than know my credit card number! Once you select \"Verify name by phone,\" you're asked to fill out your name, phone number and address. Then select \"Verfiy name by phone\" again. Finally, you get a page that displays the information you just entered, plus a verification code. As soon as you receive the call (which was within seconds) they will ask you to enter the verification code. Follow the directions from the phone call and voila! You're verified. Details, Details I'm sure people have tons of questions regarding the new profiles, so below I've listed a few details that I've found out from my initial research. These were questions I had and found the answers to. Currently, this is for U.S. search results only. Links from the profiles do not pass link juice simply because they're from a Google domain. Matt Cutts responded to this question posed by Danny Sullivan. If you already use Gmail, it automatically uses your Gmail name as the profile URL (which is mildly annoying). However if you don't have a Gmail account, apparently you have the ability to create your own URL (as long as it doesn't already exist). Conclusion In general, I'm a bit annoyed that I \"have\" to fill out my information in order to rank, but at the same time I think this is a great tool to help get the information YOU want to show up in the results. I'd love to hear your profile stories, what you love or hate about it. Do you have any additional information to add? By the way this is my first post for SEOmoz, I'd love to hear your feedback in general. I look forward to writing more in the future! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google Profile Search (aka How to Rank for Jennifer Lopez)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google Profile Search (aka How to Rank for Jennifer Lopez)"
    },
    {
      "level": "H2",
      "text": "Profile Components"
    },
    {
      "level": "H2",
      "text": "Verify Your Name"
    },
    {
      "level": "H2",
      "text": "Details, Details"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Acknowledge and Cope with Fear of Local Business Reviews"
    },
    {
      "level": "H3",
      "text": "Celebrating Canada’s Small Business Month With Sustainable Local Biz Tips"
    },
    {
      "level": "H3",
      "text": "Takeaways from an Irish Locksmith Listing Spam Scandal"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez"
}