{
  "url": "https://moz.com/blog/googles-disavow-tool-works-penalty-removal",
  "slug": "googles-disavow-tool-works-penalty-removal",
  "title": "Google's Disavow Tool Works - Penalty Removal - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When the Disavow tool was announced by Matt Cutts at Pubcon, this year, there was an uproar of mixed reactions for SEOs across the digital world. Some had a good feeling about and others had their doubts about the real reason behind the introduction, even though Bing has had a similar tool in…",
  "content": "Google's Disavow Tool Works - Penalty Removal Advanced SEO By: Duke Tanson January 21, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Duke Tanson January 21, 2013 Google's Disavow Tool Works - Penalty Removal Advanced SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. When the Disavow Tool was announced by Matt Cutts at Pubcon this year, there was an uproar of mixed reactions for SEOs across the digital world. Some had a good feeling about the tool and others had their doubts about the real reason behind the introduction, even though Bing has had a similar tool in existence for a while. For those of us who welcome the tool, we have used it and managed to get link penalty removed by Google. In this post, I will be going through the steps I took to remove bad links for my client VoucherSeeker, a UK voucher code website, and ended up getting a manual penalty revoked by the Google spam team. Key Dates Below is the chronology of events leading to the penalty removal. 10th May 2012 - Unnatural link profile warning 20th July 2012 - Reconsideration request 23rd July 2012- Unnatural link profile response - More work required 8th August 2012 - Reconsideration request responded 20th October 2012 - Disavow tools used 30th October 2012 - Another reconsideration request 28th November 2012 - Manual penalty revoked NOTE: The steps I will be discussing here are by no means, the blueprint of getting a penalty removed. Different websites will pose different challenges, which calls for a diversity of approach. Backlinks Review To have a better understanding of the scale of my client's problem, my first step was to conduct a backlinks review using data from SEOmoz's Open Site Explorer , Majestic Site Explorer and Google Webmaster Tools backlinks data. A quick glance of the data showed there were some dodgy links. There were examples of domains with circa 51,000 links pointing to the website. To get a full understanding of this, I had to dig further. My review looked at the following; Links to Domain Ratio Domain Authority Distribution Page Authority Distribution Link Location Link Source Variety Thanks to the awesome excel tool by Ron Medlin and his SEOmoz blog post covering the use of the tool. Other resources to consider for such analysis are: Ryan Kent Post on Identifying Link Penalties Dr. Pete's Guide on Disavow Tool Tom Anthony Post on Link Profiling SEOmoz Link Profile Tool Links to Domain Ratio A high links-to-domain ratio is always a red flag for an unnatural link profile. The client, in some cases had 51,000 backlinks from a single domain. That is often a sign of a site wide footer link. Domain Authority Distribution A natural link profile should always have a good distribution of domain authority, page authority and should look like what Dr. Pete described in his post on link profiling with OSE. Link Source Variety Another important element I looked at is the link source variety. A good link profile always shows diversity of link sources. A website with a high percentage of its links from directories, for example, is definitely heading for trouble. A review of the client website showed tons of links from paid directories and Typepad pages with low quality, non-engaging content. Having done a review of the link profile it was time to delve deeper and identify all the crap links we wanted to get rid of. This is a very painful exercise, guys, but if you really need to nail this blackhat beast, you need to review the links manually. Link Removal Outreach Having identified the links I wanted to remove, the real work of appealing to people began. Thankfully the brilliant data gathering tool by Richard Baxter was at hand to help. I got all the contact details of the domains I wanted to remove using this tool. The next tiresome stage was an email outreach, asking webmasters nicely, to remove links pointing to the client's website. When contacting webmasters expect to find people who will want to kick you while you are down. There were even some webmasters asking for money to remove links. The effort paid off; after weeks of emails back and forth, a fair amount of links were removed. Reconsideration Request This is where honesty should really be your best policy. There is no way out here. The big G has caught you in the act. Admit it, tell them what you have done to reverse the situation and pray that they let you out of prison! Unfortunately for the client, Matt Cutts and his team didn't think we had done enough. This was followed up with another email with little success in terms of links removed. The Saviour is Born At this stage of the process, I thought we had hit the end of road, hence time to call it a day. Luckily, Matt Cutts came to the rescue at Pubcon with the announcement of the introduction of the disavow tool. This was followed by a detailed post by the Dr. Pete on how to use it. Armed with this information, I submitted the unwanted list to Google Webmaster Tools and took a chill pill, waiting patiently. This was followed by a reconsideration request 10 days later. Finally after 38 days of waiting, Google decided to have compassion on the poor website that went astray on the link building path. Organic traffic hasn't taken off massively but there is a clear sign of improvement. This experience can be a real lesson for all SEOs and website owners. Don’t cut corners in your link building effort. Your gains will be small and short-lived, but your fall will be fast, heavy and you might not get back on your feet again. Stop chasing dodgy links and start earning quality ones. Note that penalty removal won’t necessarily lead to increases in rankings and traffic. It gives you a clean slate to start again and you can bet on the fact that Google will be watching you. The Future of Backlink Analysis The question that cropped up after the penalty removal was, “how will SEOs accurately review backlinks in the future?.\" All those dodgy links will still be showing up in any backlinks download, making it difficult to correctly assess the link profile of any website that has used the disavow tool. I don’t have an answer for this, but it’s something SEOs and backlinks tool developers need to think about. I would love to hear your views and experience on using the disavow tool. You can hook up with me on Twitter for a chat. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google's Disavow Tool Works - Penalty Removal"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google's Disavow Tool Works - Penalty Removal"
    },
    {
      "level": "H3",
      "text": "Key Dates"
    },
    {
      "level": "H2",
      "text": "Backlinks Review"
    },
    {
      "level": "H2",
      "text": "Link Removal Outreach"
    },
    {
      "level": "H3",
      "text": "Reconsideration Request"
    },
    {
      "level": "H3",
      "text": "The Saviour is Born"
    },
    {
      "level": "H2",
      "text": "The Future of Backlink Analysis"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Duke Tanson\n          \n            Duke Tanson"
}