{
  "url": "https://moz.com/blog/google-impairing-webmasters-with-obsessive-algorithm-changes-and-the-staples-of-seo",
  "slug": "google-impairing-webmasters-with-obsessive-algorithm-changes-and-the-staples-of-seo",
  "title": "Google is Impairing Webmasters with Obsessive Algorithm Changes - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "But what about webmasters? Are all these changes really beneficial to those that are trying to promote their content legitimately? Webmasters will argue that they have allotted substantial time to making their site Google friendly - only to be prompted with another algorithm update.",
  "content": "Google is Impairing Webmasters with Obsessive Algorithm Changes and the Staples of SEO Marketing Industry By: Paul Myers October 3, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Paul Myers October 3, 2012 Google is Impairing Webmasters with Obsessive Algorithm Changes and the Staples of SEO Marketing Industry This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Google recently announced another amendment to their search ranking system by introducing a procedure to lower and erase the relevance of pirate and copyright material. The tweak is the latest in the line of subtle changes that Google have made to their algorithm – in fact; they make over 500 of these tweaks every year. They are designed – at least on paper – to help improve the user’s experience and provide a premium search service that filters out web sites that are irrelevant or misleading. Google themselves admit that changes are a “commitment to returning high-quality sites to Google users”. But what about webmasters? Are all these changes really beneficial to those that are trying to promote their content legitimately? Webmasters will argue that they have allotted substantial time to making their site Google friendly - only to be prompted with another algorithm update. There have been over 20 major updates in 2012 already – including the much publicised Penguin and Panda releases which aim to negate over-optimisation techniques such as keyword stuffing and unnatural linking with less relevance on lower-quality web sites. Updates have also proven to be much more frequent in recent years. In 2009, there were just four major updates and in 2008 only two. One blogger even proclaims that savvy SEO teams must learn to adapt their methods from day-to-day simply to keep a tab on Google’s ever changing policy list. So do the alterations really affect the performance of web sites? Well, according to a survey from Search Engine Roundtable, around 65 per cent of webmasters oversaw a decrease in search engine traffic following a recent Penguin update. With the regularity and the variety of changes ever expanding, the webmaster’s task of maintaining their web page to accommodate Google’s algorithm rules becomes increasingly frustrating. While you cannot simply generalise a viewpoint for each of Google’s 20 plus updates this calendar year, research from April does point out that Google’s Penguin update didn’t even seem to help filter out the web sites it was supposed to. Therefore, is the user experience really any different? Google want a higher-quality experience for their consumers but has anyone actually noticed? If these rigorous changes aren’t benefiting or improving the experience of either users or webmasters then what is the point? Shouldn’t Google think about changing the way they modify their algorithm? If users are the priority, what about letting them customise their own search experience? Users could be given the opportunity to alter specific search settings that would have a direct affect on the results that were returned upon their queries. While that could have a further negative impact on webmaster’s search traffic, what will irk them more is Google’s proposed use of semantic search. It has already been widely identified that this would be bad news for web optimisers. Semantic search would see users being presented with direct query answers from Google’s on-page results service ahead of the URL listings – a move that would certainly upset the applecart only further. So how exactly can webmasters keep on top of these changes without editing their whole SEO output every time an update is processed? For the moment, quality and unique content that targets certain keywords probably remains the best way to optimise your web site. However, the many surrounding factors that Google consistently tampers with will always have a significant bearing on where your pages eventually rank. Are people becoming irritated by Google’s fidgety requirements? Well, recent research has shown that Google lost a small chunk of their search engine traffic to Microsoft’s Bing. Continuing to alienate webmasters and users alike could well lead to another portion of consumers losing faith in Google’s “high-quality” service. With all of this in mind, what are the core elements of SEO that optimisers need to focus on? In a whirlwind of information that the internet provides, here are four key points that I believe are the staples of performing well on Google. Follow them, if you so wish, let’s just hope Google doesn’t give us any more surprises. 1. Quality content Ok, so you’ve heard this one a million times before (I’m bored of hearing it too) but it’s a fact that great content will help your SEO. Writing good stuff increases the likelihood of user interaction and the possibility of sharing which will in turn boost your SEO. It’s always good to drop in keywords to your content but don’t be spammy about it. Write it naturally. Remember, you’re writing for a reader and not a search engine. 2. Linking Google’s bots will always appreciate sites that are easy to navigate and can be linked from page to page effortlessly. With this in mind, always try to add internal linking to your posts. If you are referencing to something that you’ve previously written about then link back to it. Additionally, ensure that you have a site map installed so that Google bots have easy access to all your index-able pages. 3. Site speed Google – like most of us these days that have rapid broadband connections – are impatient. It doesn’t like slow loading web sites. In order to optimise your site to suit Google then you may need to remove large images or flash that could slow the pace of your pages down. 4. Title tags Arguably the most significant area of your web site to define your keywords is your title tag – the wording that appears at the top of a browser. Make sure to show off your key themes here but, again, keep it natural and try to construct a sentence. However, you must make sure that titles are no more than 70 characters long to help fully maximise your optimising potential. -------- To conclude, it would be fair to state that there are some staple values of SEO that act as the “bread and butter” of optimisation. However, the surrounding variables are all too distorted and indistinctive to really be clear on what a modern-day SEO campaign should target. Optimisers, give me some feedback, are Google’s changes becoming the bane of your life or are you satisfied with the strength your SEO campaigns? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google is Impairing Webmasters with Obsessive Algorithm Changes and the Staples of SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google is Impairing Webmasters with Obsessive Algorithm Changes and the Staples of SEO"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Paul Myers\n          \n            Paul Myers\n          \n            Paul Myers"
}