{
  "url": "https://moz.com/blog/google-quietly-pushing-more-links-data-in-snippets",
  "slug": "google-quietly-pushing-more-links-data-in-snippets",
  "title": "Google Quietly Pushing More Links + Data in Snippets - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The last 3 months have heralded a bevy of new tests and features from Google's search results, and it's worth taking a review of the most frequent of these and examining what it potentially holds for optimization of the future.\nThe new results types include:\n\n    Growth of Rich Text Snippets\n   …",
  "content": "Google Quietly Pushing More Links + Data in Snippets Search Engines By: Rand Fishkin September 14, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 14, 2009 Google Quietly Pushing More Links + Data in Snippets Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The last 3 months have heralded a bevy of new tests and features from Google's search results, and it's worth taking a review of the most frequent of these and examining what it potentially holds for optimization of the future. The new results types include: Growth of Rich Text Snippets Perhaps the most obvious and well-covered, rich text snippets enable certain sites to provide Google with extra \"structured\" information about their pages and receive data callouts in several formats inside Google's results. BTW - Notice how Hulu's rich snippets aren't quite as \"rich\" as YouTube's? I'm not entirely sure why that is, as Hulu does feature star review numbers just like YouTube. Internal Anchor Links Google's been recognizing use of the hash tag (#) in URLs and has taken a new approach of showing these embedded anchor links right in the SERPs as separate callouts. This last Gmail result is among the more recent changes Google's shown with the \"jump to\" feature embedded inside the snippet (rather than below it). Page-Specific Sitelinks Domains have, for a long time, been able to achieve \"sitelink\" status, whereby important subpages are listed below the main URL, taking up a significant portion of a SERPs' real estate. Now, Google is offering a similar, though slightly less spacious, piece of real estate to sub-pages on individual internal pages. Embedded Vertical Results Several forms of this feature have received mainstream coverage, but the use of embedding vertical data and links, typically with the \"+\" link, has grown in recent months to encompass data of all kinds. Multi-Page Article Results One of the least reported (at least in my brief survey of blog posts) effects, this rich snippet format can have a dramatic effect on the vertical space devoted to a listing. It shows for certain types of forum threads & articles where multiple pages are (in Google's eyes) relevant to the search query. What Does this Portend for SEO? Smart, valuable internal anchors may be a good way to get more visibility in the SERPs Attaching vertical data or vertical connections to URLs can earn more visibility (but Google may also take those clicks away as they lead back to other Google properties such as Maps, Finance, etc.) Earning authority to individual internal pages may be a valuable tactic to receive greater eyeball activity in the results (even if your page's don't rank #1) Multiple authors and pages on blog/forum style content can attract greater SERPs real estate I'd love to hear other new kinds of SERPs you've been seeing and the impact you perceive on the practices of SEO and content creation. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google Quietly Pushing More Links + Data in Snippets"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google Quietly Pushing More Links + Data in Snippets"
    },
    {
      "level": "H2",
      "text": "Growth of Rich Text Snippets"
    },
    {
      "level": "H2",
      "text": "Internal Anchor Links"
    },
    {
      "level": "H2",
      "text": "Page-Specific Sitelinks"
    },
    {
      "level": "H2",
      "text": "Embedded Vertical Results"
    },
    {
      "level": "H2",
      "text": "Multi-Page Article Results"
    },
    {
      "level": "H2",
      "text": "What Does this Portend for SEO?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}