{
  "url": "https://moz.com/blog/google-discover-seo",
  "slug": "google-discover-seo",
  "title": "SEO and Google Discover - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In today’s episode of Whiteboard Friday, Moz’s own SEO expert, Tom Capper, talks about the untapped organic traffic opportunity that is Google Discover.",
  "content": "SEO and Google Discover Whiteboard Friday | Search Engines | Marketing Industry By: Tom Capper August 20, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Tom Capper August 20, 2021 SEO and Google Discover Whiteboard Friday | Search Engines | Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In today’s episode of Whiteboard Friday, Moz’s own SEO expert, Tom Capper, talks about the untapped organic traffic opportunity that is Google Discover. Click on the whiteboard image above to open a larger version in a new tab! Video Transcription Happy Friday, Moz fans, and today's topic is going to be Google Discover. Now this is a massive opportunity that I think a lot of sites have been sleeping on. It's been out for about three years now, and the sites that are taking it seriously, I've seen quite a few recently that are now getting more traffic from Google Discover than they are from organic. What is Google Discover? So hopefully that gives you some kind of idea of what you're missing out on. But in case you have been sort of living under a rock, completely oblivious to this, this is what Google Discover is. This is what it looks like. So basically, if you open up the Google app on Android or on iOS, you'll see, yes, there's a search bar that you normally expect with Google, but there's also, if you scroll down, by default at least, there's this list of recommended articles, very heavily personalized. You can sort of scroll infinitely. They're based on your interests and sort of what Google has seen you searching for and looking for in the past basically. They're all articles. This isn't e-commerce or something like that for the most part. How to be featured Now I'm going to talk a little bit about what you need to do to be featured here. Indexing, at the basic level, works the same as regular Google organic. There's no sort of special process like you might see with Google News or something like that. But there are a few hard requirements that you're going to need, and there's also a few sort of myths that I'm going to talk about. 1. Schema markup Now the first big hard requirement that I've seen completely ubiquitously is schema markup. So in my own Google Discover feed, everything that I've seen recommended to me is either marked up as schema in an article or schema in a news article. When I've looked at the analytics of sites I have access to and what they're getting featured in Google Discover, it's the same. It's all either article or news article markup. Now it might be possible that people are succeeding with maybe recipes or something like that and I've just not seen that. But definitely some kind of schema markup is required here. 2. Unambiguous, broad topics Now there's also sort of, like I say, a very heavy topics layer here and what people are being recommended based on their interests and so on. This is kind of surprisingly unsubtle as far as I can tell, or at least surprising if you're used to Google's organic algorithm and how sophisticated it is. So basically Google will cotton on very heavily to a few broad topics of things you're interested in, and sites that I've seen doing well and articles that I've seen doing well are very unambiguously about one of these sort of broad topics. So, for example, the Moz Blog actually does quite well in Google Discover. I think that's because it's very unambiguously about SEO, and it's never really dangerous to recommend a Moz blog article to someone who's interested in SEO. Similarly, on some sites the articles I've seen doing very well are ones that prominently mention and clearly are about maybe a celebrity or a car brand or some other sort of broad topic like this. So this sort of unambiguous topic seems to be very important. 3. Click-worthiness The next requirement is more something you might be familiar with if you've optimized for YouTube or Twitter or Facebook or something like that, and it's this clickiness. And to be honest, I'm sorry to say kind of being click-baity. The articles that do best on Google Discover are ones that sort of hint at something salacious in the title but don't reveal it. So they're really drawing in that click, and it seems to really reward that. Now it's worth mentioning this title. This is not a title tag, like you might be used to from SEO, and it's also not an Open Graph title, like you might be used to from social media optimization. This is part of that schema markup. It's the headline in there. This needs to be no more than 110 characters. Ideally pretty close to that. There's also this image. This image needs to be 1,200 pixels wide, and again it's referenced in that schema markup. Again, that can be a very important way of drawing in that click. 4. Speed The last sort of big requirement that I noticed is speed. It seems much more important for Google Discover than it is for Google organic to have fast loading pages, to such an extent that I've seen a lot of people out there sort of claiming that AMP is a hard requirement. Google Discover myths Now we sort of get into the myths section or the urban myths. 1. AMP AMP is definitely not a hard requirement for Google Discover. There are sites out there doing very well without AMP, even smaller, lesser-known sites doing very well without AMP. But you do need to be very fast. So I can see how people come to have that idea, and sure enough if you look in your own Google Discover, you'll probably see a lot of AMP pages. But it's definitely not a requirement. Indeed there are even some sites doing well with slower pages, but they tend to be more a household name or very authoritative brands within their space, which possibly compensates. 2. Link building I think that's what leads people to think about this next myth, which is I've seen a lot of people recommending that you should do link building for the benefit of Google Discover. Maybe that does help. But compared to organic, I've seen sites DA 20 something doing very, very well, six-figure daily traffic through Google Discover. It's definitely not a hard requirement to have any substantial amount of links. So maybe it helps, or maybe there are other ways that Google is measuring brand here, but this is not something I would focus on for Google Discover to start with. 3. Knowledge graph The last sort of myth that I've seen is I think it comes about because early on in Google Discover you could follow certain sites or brands if they were featured in the Knowledge Graph, and then you would supposedly see more content from that site. That's no longer possible. But in any case, like I say, I've seen sites doing very, very well that not only have very few links, but also as a brand or as a site or as an entity are not in the Knowledge Graph. So what I think probably is working trying to get your brand featured in the Knowledge Graph and probably your brand already is featured in the Knowledge Graph if it's well-known. This is definitely not something that's going to be a hard requirement for you to perform very, very well in Google Discover. Measuring success in Google Discover Now the next step you're probably going to want to think about is how do you actually go about, once you're optimizing for Google Discover, how do you measure how well you've been doing so that you can sort of iterate and improve. Now sadly this is a little bit messy. The most accurate data source you're going to have is Google Search Console. Similar to Google News, if you're getting any Google Discover traffic at all, you'll get this extra tab appear in Google Search Console that shows you your Discover traffic as separate to your web search traffic or your Google News traffic if you have that. Again, the Google News thing only appears if you're getting Google News traffic. Obviously, Search Console data isn't ideal. It has some limitations. It's not tied up with data from your other channels. It's not tied up with your conversion data or your on-site analytics. But if you want to actually debug this in something like Google Analytics, it's very messy. So what I've seen when I found articles that according to Google Search Console are only getting Discover traffic, zero web search traffic whatsoever, they're just getting Discover traffic, and then I look at how that Discover traffic appears in Analytics, it sadly very spread out. There used to be some ways of capturing this through basically a typo in the referral that Google Discover was sending. Sadly, that's no longer the case. So what you tend to see is the Google Discover traffic appears mostly as Google organic, sort of blended in with your other organic data. Then a good chunk of it, in my experience about 17%, will appear as direct. So 15% to 20%. Seventeen is probably overly precise. Then you'll get a tiny sliver which is appearing as this googleapis.com referral traffic. Now if you're getting anything with googleapis.com referral as the source and medium, then you're definitely getting some Discover traffic, but it's a lot more than you would think from this green slice. This is just sort of the tip of the iceberg. So hopefully you found all of that useful. I'd love to know your own tips if you can share them on social and tag me or tag Moz. This is an area that I think right now is relatively little explored by SEOs and by the industry. So yeah, I'd love to see what other people are doing and what's working for them. Thank you very much. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO and Google Discover"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO and Google Discover"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "What is Google Discover?"
    },
    {
      "level": "H2",
      "text": "How to be featured"
    },
    {
      "level": "H3",
      "text": "1. Schema markup"
    },
    {
      "level": "H3",
      "text": "2. Unambiguous, broad topics"
    },
    {
      "level": "H3",
      "text": "3. Click-worthiness"
    },
    {
      "level": "H3",
      "text": "4. Speed"
    },
    {
      "level": "H2",
      "text": "Google Discover myths"
    },
    {
      "level": "H3",
      "text": "1. AMP"
    },
    {
      "level": "H3",
      "text": "2. Link building"
    },
    {
      "level": "H3",
      "text": "3. Knowledge graph"
    },
    {
      "level": "H2",
      "text": "Measuring success in Google Discover"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Tom Capper\n          \n            Tom Capper\n          \n            Tom Capper"
}