{
  "url": "https://moz.com/blog/google-is-changing-long-tail-search-with-efforts-like-hummingbird-whiteboard-friday",
  "slug": "google-is-changing-long-tail-search-with-efforts-like-hummingbird-whiteboard-friday",
  "title": "How Google is Changing Long-Tail Search with Efforts Like Hummingbird - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Google's Hummingbird update aims, at least in part, to better understand the context of the content in the index, returning relevant results for some of the more unique queries. In today's Whiteboard Friday, Rand offers examples of long-tail queries and how Google is approaching them with its…",
  "content": "How Google is Changing Long-Tail Search with Efforts Like Hummingbird Whiteboard Friday By: Rand Fishkin October 18, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 18, 2013 How Google is Changing Long-Tail Search with Efforts Like Hummingbird Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The Hummingbird update was different from the major algorithm updates like Penguin and Panda, revising core aspects of how Google understands what it finds on the pages it crawls. In today's Whiteboard Friday, Rand explains what effect that has on long-tail searches, and how those continue to evolve. For reference, here's a still of this week's whiteboard! Video Transcription Howdy, Moz fans and welcome to another edition of Whiteboard Friday. This week I wanted to talk a little bit about Google Hummingbird slightly, but more broadly how Google has been making many efforts over the years to change how they deal with long-tail search. Now long tail, if you're not familiar already, is those queries that are usually lengthier in terms of number of words in the phrase and refer to more specific kinds of queries than the sort of head of the demand curve, which would be shorter queries, many more people performing them, and, generally speaking, the ones that in our profession, especially in the SEO world, the ones that we tend to care about. So those are the shorter phrases, the head of the demand curve, or the chunky middle of the demand curve versus the long tail. Long tail, as Google has often mentioned, is a very big proportion of the Web search traffic. It's anywhere from 20% to maybe 40% or even 50% of all the queries on the Web are in that long tail, sort of fewer than maybe 10 to 50 searches per month, in that bucket. Somewhere around 18% or 20% of all searches Google says are extremely long tail, meaning they've never seen them before, extremely unique kinds of searches. I think Google struggles with this a little bit. They struggle from an advertising perspective because they'd like to be able to serve up great ads targeting those long-tail phrases, but inside of AdWords, Google's Keyword Tool, for self-service advertising, it's tough to choose those. Google doesn't often show volume around them. Google themselves might have a tough time figuring out, \"hey, is this query relevant to these types of results,\" especially if it's in a long tail. So we've seen them get more and more sophisticated with content, context, and textual analysis over the years such that today, with the release of, in August according to Google, Hummingbird, which was an infrastructure update more so than an algorithmic update. You can think of Penguin or Panda as being algorithmic style updates, and Google Caffeine, which upgraded their speed, or Hummingbird, which they say upgrades their text processing and their content and context understanding mechanisms is affecting things today. I'll try and illustrate this with an example. Let's say Google gets two search queries, \"best restaurants SEA,\" Seattle's airport, that's the airport code, the three-letter code, and \"where to eat at Sea-Tac Airport in Terminal C.\" Let's say then that we've got a page here that's been produced by someone who has listed the best restaurants at Sea-Tac, and they've ordered them by terminals. So if you're in Terminal A, Terminal B, Terminal C, it's actually easy to walk between most of them except for N and S. I hope you never have to go N. It's just a pain. S is even more of a pain. But in Terminal C, which I assume would be Beecher's Cheese, because that place is incredible. It just opened. It's super good. In Terminal C, they've got a Beecher's Cheese, so they've got a listing for this. A smart Google, an intelligent engineer at Google would go, \"Man, you know, I'd really like to be able to serve up this page for this result. But it doesn't target the words 'where to eat' or 'Terminal C' specifically, especially not in the title or the headline, the page title. How am I going to figure that out?\" Well, with upgrades like what we've seen with Hummingbird, Google may be able to do more of this. So they essentially say, \"I want to understand that this page can satisfy both of these kinds of results.\" This has some implications for the SEO world. On top of this, we're also getting kind of biased away from long-tail search, because keyword (not provided) means it's harder for an individual marketer to say: \"Oh, are people searching for this? Are people searching for that? Is this bringing me traffic? Maybe I can optimize my page more towards it, optimize my content for it.\" So this kind of combination and this direction that we're feeling from Google has a few impacts. Those include more traffic opportunities, opportunities for great content that isn't necessarily doing a fantastic job at specific keyword targeting. So this is kind of interesting from an SEO perspective, because we're not saying, and I'm definitely not saying, stop doing keyword targeting, stop putting good keywords in your titles and making your pages contextually relevant to search queries. But I am saying if you do a good job of targeting this, best restaurants at SEA or best restaurants Sea-Tac, you might find yourself getting a lot more traffic for things like this. So there's almost an increased benefit to producing that great content around this and serving, satisfying a number of needs that a search query's intent might have. Unfortunately, for some of us in the SEO world, it could get rougher for sites that are targeting a lot of mid and long-tail queries through keyword targeting that aren't necessarily doing a fantastic job from a content perspective or from other algorithmic inputs. So if it's the case that I just have to be ranking for a lot of long-tail phrases like this, but I don't have a lot of the brand signals, link signals, social signals, user usage signals, I just have strong keyword signals, well, Google might be trying to say, \"Hey, strong keyword signals doesn't mean as much to us anymore because now we can take pages that we previously couldn't connect to that query and connect them up.\" In general, what we're talking about is Google rewarding better content over more content, and that's kind of the way that things are trending in the SEO world today. So I'm sure there's going to be some great discussion. I really appreciate the input of people who have done extensive analysis on top of Hummingbird. Those folks include folks like Dr. Pete, of course, from Moz, Bill Slawski from SEO by the Sea, Ammon Johns, who wrote a great post about this. I think there'll be more great discussion in the comments. I look forward to joining you there. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Google is Changing Long-Tail Search with Efforts Like Hummingbird"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Google is Changing Long-Tail Search with Efforts Like Hummingbird"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}