{
  "url": "https://moz.com/blog/google-autocomplete-seo-tool",
  "slug": "google-autocomplete-seo-tool",
  "title": "Use Google Autocomplete as an SEO Tool - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For years, SEOs have been using Google Autocomplete (aka Google Suggest) as a free keyword research tool. Yet there’s much more to this search feature, especially after all the updates Google has introduced, turning Google Autocomplete into a smart and predictive platform of its own.",
  "content": "Google Autocomplete: More than a Free Keyword Research Tool Search Engines | SEO Tools | Keyword Research By: Ann Smarty June 22, 2022 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Ann Smarty June 22, 2022 Google Autocomplete: More than a Free Keyword Research Tool Search Engines | SEO Tools | Keyword Research The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Google Autocomplete (often referred to as Google Suggest) is one of the first Google search developments that appeared on SEOs’ radar. Many years ago, Google Suggest was what powered Google Instant results, making a huge impact on users’ searching journeys. SEOs have been using it as a free keyword research tool. Yet there’s much more to this search feature, especially after all the updates Google has introduced, turning Google Autocomplete into a smart and predictive platform of its own. What is Google Autocomplete? Google Autocomplete allows users to easily complete their query by suggesting possible extensions of what they are currently typing: Google’s suggestions are dynamic — they instantly change as you’re typing your query. Google is trying to predict what a user means to type. These predictions are likely to impact the searching behaviors as people may instinctively choose a suggestion they never meant to type. In other words, Google’s Autocomplete should be an SEO priority. But there’s another factor making the feature very important for any digital marketing strategy: By default, it delivers suggestions in the address bars of at least three of the most popular browsers: Firefox, Google Chrome, and Safari. Here’s Chrome’s address bar, which suggests search terms (and auto-completes them) as you type. Now imagine that your domain is plumber.com and that’s your customer trying to type in your domain name. This means that in many cases, users will be prompted to search even when they had no intention to, and they will search for the terms that were suggested by Google. How do Google’s Autocomplete predictions work? Google’s Autocomplete predictions rely on actual users’ popular searching patterns, i.e. what Google’s searchers tend to type next. In other words, Google’s suggestions reflect the most common search queries. Additional factors that impact Google’s predictions are: The searcher’s locationThe user’s past searchesCurrently trending search queries. For example, many of these suggestions seem to be driven by trending searches: You can disable your past searching history from messing with your Google predictions by disabling personalization here. This way you’ll get a cleaner insight into your target users’ searching habits. Use Google’s Autocomplete to research your keywords Keyword research is exactly how SEOs have been using Google Suggest for ages — with much success. Google Autocomplete is perfect for discovering more specific and relevant phrases that searchers are using to solve problems or answer questions, as it extends your search query as you type it. If your query is searched a lot, Google will continue extending it further and further — just keep hitting space at the end of each query: All of these suggestions provide content ideas by narrowing your initial term down to more specific angles. While you can do this by using the search box itself, you can also use tools like Suggestion Keyword Finder to make it easier and faster, , as it extends each of your chosen terms deeper to level three: There are also a few plugins that bring those suggestions right inside your Wordpress post editor. Use Google Autocomplete to research questions Question research is useful on many levels, from content ideation to identifying the challenges your customers may be experiencing with your product or service. Google Autocomplete is one of the most powerful sources of niche questions that your target users routinely type to solve related problems. To find those questions, simply type question words (why, how, where, etc.) in front of your search term in Google’s search box: To avoid manually doing this, you can use Answer the Public, which uses this trick to create a mindmap of questions based on your keyword: There are several ways to implement these questions in your content optimization strategy: Set up an on-site knowledge base to attract long-tail traffic and empower your customer support team.Use these questions in your content refresh strategy when optimizing old or outdated pages.Launch a Youtube series/playlist or even a video course to address each of these questions, one by one. You will have lots of content that you can reuse on your site, on social media, and elsewhere. Narrato is a handy content creation and collaboration platform allowing you to import these questions and integrate them in your content brief and content itself: Narrato helps you consolidate a lot of data around each content project helping you create better optimized guides, lead magnets or commercial landing pages. Use Google Autocomplete to research related concept entities Extending core keywords is how we’ve utilized Google Autocomplete for years, but the tool has been evolving, and these days it gives even more insight into how people search and what Google considers relevant to your target topic (and buying journey). Traditionally, Google would generate search predictions prior to you performing a search. Nowadays, Google will help you refine your search query by suggesting alternative terms after you perform the search. To generate these suggestions, simply put your cursor back in Google’s search box once it loads search results. These are referred to as “search refinements”: The key benefit of this exercise is that you get to uncover related concepts and entities you may want to include into your optimization strategy. For example, if you search for [why is google maps slow] and put your cursor anywhere inside your query in the search box, Google Autocomplete will try to help you specify the problem by suggesting [delay time] instead of [slow] and making sure you really mean [maps] and not [google earth slow]. There’s no insight into how Google generates search refinements, but they most probably rely on their users’ searching journeys (i.e the same person typing these queries within one session). SE Ranking uses search refinements to identify related keywords you’d want to include into your SEO strategy: Autocomplete search refinements in local marketing Search refinements have many implications. For example, if you’re a local business, you should use Autocomplete to discover related towns and cities people in your area may be using to find similar businesses. These are all your target keywords: In this case, a plumber located in Halfmoon, NY will know that they need to have pages targeting Clifton Park, Ballston Spa, and Glenville. They will also find a distinct local competitor to keep an eye on. Interestingly, Google knows how far away from your location related entities should be. In case of plumbers, Google would suggest locations 10-30 minutes away. But if you search for something like “playgrounds” in the same town, you will only be suggested places within a five-minute drive: Use Google Autocomplete for organic reputation management strategy Brand-driven search is when a search query contains your brand or product name. Your potential customers are using your brand-driven search when trying to figure out if your company is worth dealing with or if your product is what they need. Obviously, branded search is an essential part of your sales funnel, and the one you cannot fully control. With Google Autocomplete, branded search becomes even more tricky and less controllable: Google may prompt your customers to search for your name when they are trying to actually type your domain and get to your site. In this case, Google’s Autocomplete may distract and drive your actual customers away from your site, so you need to make sure that your branded search results will bring them back to your site.Google Autocomplete may give your customers “ideas” on what they need to do prior to buying from you (and finally get them to change their minds). For those two reasons, your branded Autocomplete results should be your company’s priority: Research and extend those using tools like Suggestion Keyword Finder, Answer The Public, and SE Ranking (all mentioned above).Track your rankings for all of these search queries (naturally, you want your pages to rank #1 to instantly take those searchers back to your site).Ensure your brand visibility in more than organic listings. Google’s SERPs are visual and interactive, which means lots of people may never click those organic results. Those searchers need to keep seeing your brand all over those SERPs to finally be convinced to go to your site: Branded SERPs often include image and video carousels, People Also Ask boxes, tweets from the brand’s official account, and more. A well-organized reputation management strategy should target all of these search sections and elements. For your company’s key branded keywords, set up Visual Ping, a change-monitoring platform that will alert you once your branded SERPs add or remove anything. You will also be notified of any changes in your knowledge panel, new results, new images or videos pulled into your branded carousels, changes in local 3-pack, etc.: Use Google Autocomplete to identify and research entities Google Autocomplete is evolving together with Google search. As Google is integrating entities (e.g. organizations, books, places, celebrities, movies, shows, etc.) into its algorithm, so does Autocomplete. When Google considers something an entity, the Autocomplete dropdown will include its logo and the category Google is associating this entity with. Local entities will also include their location: It’s a good idea to check Autocomplete results for your chosen name prior to registering the domain. Namify makes it easy as you can add domains to the list to check them all before deciding: It’s a good idea to stay away from brand names that are already identified as entities in the same or neighboring category. For newly launched projects and products, Google Autocomplete can be used to identify whether Google considers you an entity yet: Conclusion Autocomplete is a great (and free) keyword research tool, but it is also a powerful factor that can impact your target customers’ journeys on most popular browsers. For this reason, it’s important to keep an eye on Google Autocomplete suggestions for your important search queries, including your brand-driven queries. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google Autocomplete: More than a Free Keyword Research Tool"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google Autocomplete: More than a Free Keyword Research Tool"
    },
    {
      "level": "H2",
      "text": "What is Google Autocomplete?"
    },
    {
      "level": "H2",
      "text": "How do Google’s Autocomplete predictions work?"
    },
    {
      "level": "H2",
      "text": "Use Google’s Autocomplete to research your keywords"
    },
    {
      "level": "H2",
      "text": "Use Google Autocomplete to research questions"
    },
    {
      "level": "H2",
      "text": "Use Google Autocomplete to research related concept entities"
    },
    {
      "level": "H3",
      "text": "Autocomplete search refinements in local marketing"
    },
    {
      "level": "H2",
      "text": "Use Google Autocomplete for organic reputation management strategy"
    },
    {
      "level": "H2",
      "text": "Use Google Autocomplete to identify and research entities"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    }
  ],
  "author": "Ann Smarty\n          \n            Ann Smarty\n          \n            Ann Smarty"
}