{
  "url": "https://moz.com/blog/google-glossary",
  "slug": "google-glossary",
  "title": "Google Glossary: Revenge of Mega-SERP - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The Google Glossary is an ongoing attempt to catalog the rich Google feature set and the world beyond 10 blue links.",
  "content": "Google Glossary: Revenge of Mega-SERP SEO Basics | Search Engines By: Dr. Peter J. Meyers September 22, 2015 Table of Contents Copied! By: Dr. Peter J. Meyers September 22, 2015 Google Glossary: Revenge of Mega-SERP SEO Basics | Search Engines The Google landscape is constantly changing. Two years ago, I created the Mega-SERP, and within days it was already outdated. This time, we've set out to create a more permanent glossary of Google features – a reference that we'll update as the SERPs (Search Engine Results Pages) change.If your focus is on organic SEO, why should you care about the wider world of Google features? Put simply, because rich SERP features are no longer the exception to the rule. Across 10,000 keywords tracked daily by the MozCast project, this is what we saw as of September 1, 2015: Of course, this is just one data set, but even with a healthy margin of error, the story is clear – Google SERPs are dynamic and feature-rich. In our data set, 97% of keywords show at least one rich or paid feature. Only 3% of these SERPs are still pristine, organic wilderness. Times have changed. Table of Contents This glossary is organized by the sections in the graph above and is an attempt to cover major SERP features currently seen on Google. To make it easy to come back and see what you're interested in (or check out new features), here are a few jump-links to the sections: New & In Testing Organic & Enhancements Vertical Results The Knowledge Graph Local Results Ads & Shopping This list won't cover every variation (there are dozens, possibly hundreds, of variations of Knowledge Panels, for example), but our goal is to cover every significant feature. We're also working to find common naming conventions between the SEO industry and Google. If you think something is missing or incorrect, please leave a comment. Each feature in this glossary is paired with a thumbnail image, which shows the approximate location that feature occupies on a hypothetical SERP. The light-gray boxes show generic SERP elements, and the dark-gray box shows the location of the feature. In this instance, the feature appears in the left-hand column, mixed with organic results. New & In TestingLet's start with what's new and currently in testing. We'll update this section regularly as Google introduces new features, so we're going to keep it at the top of the post. As these features roll out and accumulate some history, we'll move them to other sections. Compare MortgagesMuch like they did with credit card comparison, Google is testing a sponsored mortgage comparison feature. Listings appeared to be paid, but details of the program are unknown at this time. Search: \"should I refinance\" Car Loan CalculatorSimilar to the mortgage calculator launched early this year, Google is testing car loan calculators. Based on similar tools in the past, it is likely that this entity will appear on a variety of competitive queries in the auto vertical. Search: \"calculate car payment\" Customized AT&T Ad Unit (Oct 2015)Google seems to be testing a unique ad unit with mobile plan information and pricing. This example was captured for AT&T, but it's likely this option is in testing across multiple carriers. Search: \"at&t prepaid\" Rosters in Team Knowledge Panels (Oct 2015)Previously available in carousel format for narrow searches (like \"Chicago Cubs roster), team rosters were added to Knowledge Panels for professional sports franchises. Rosters appear as a scrolling window. Search: \"chicago cubs\" \"Claim this business\" in Local Panel (Sep 2015)Google seems to be testing functions to \"Claim this business\" and \"Suggest an edit\" directly in the Local Knowledge Panel. Previously, these features existed much deeper in Google's local SEO functionality. Search: \"mustangs unlimited\" (Manchester, CT) \"I'm Feeling Curious\" Card (Sep 2015)Type \"I'm feeling curious\" into Google, and you'll get a card-like feature with a random trivia question. Like Featured Snippets, these factoids come from indexed pages and include attribution. Search: \"i'm feeling curious\" Popular Times (Sep 2015)Some local Knowledge Panels are beginning to show a graph of \"Popular Times\" (by day of the week), to help visitors sort out when best to visit a location, especially popular destinations. Search: \"art institute of chicago\" Book an Appointment (Aug 2015)In partnership with Demandforce (an Intuit company), Google launched the ability for local businesses to book appointments from the Knowledge Panel. Searchers are given a dropdown list of appointment types, which takes them directly to the Demandforce website. Search: \"bjs auto repair\" (Chicago) Home Services Ads (Aug 2015)Google has announced their entry into the home services market, and they've started testing a pilot program in a couple of niches in the San Francisco area. The AdWords team has confirmed that this result is part of that test. We have no timeline on when and how this program might expand. Search: \"plumbers\" Organic & EnhancementsIt all started with 10 blue links, so that's where we'll start the rest of this glossary. This section will also include \"enhancements\" - add-ons to organic links that enhance them but aren't technically stand-alone SERP features. Simple Organic ResultsThey're the things we spend all of our time chasing. A simple organic result, if such a thing even exists these days, has a linked title (in blue), a destination URL (in green), and a \"snippet\" of descriptive text. Search: \"tacos are the best\" Only 13 reasons?! Step it up, BuzzFeed! Organic w/ Date Add-onSometimes, Google will algorithmically add information to a snippet. One of the most common examples is a date-stamp added to news and blog results. These add-ons appear at the beginning of the snippet. Search: \"are tacos healthy\" Organic w/ Virtual PathGoogle will occasionally replace a page's URL with a breadcrumb-style path. These URL rewrites are common on mobile SERPs and will likely become more common on desktop. These virtual paths replace the destination URL. Search: \"walking taco news\" Organic w/ Long SnippetMost descriptive snippets are limited to about two lines (conventional SEO wisdom is to keep them below 155 characters). Recently, though, longer snippets have appeared, often paired with Featured Snippets. Search: \"how much is a taco bell\" Organic w/ Brand DropdownBrands and other known entities may get an additional linked reference to their name. Clicking on it reveals a dropdown with general information about the entity. Search: \"taco bell menu\" Organic w/ Mini SitelinksFor internal links or on-page anchors, Google will occasionally display mini-sitelinks directly to those pages/anchors. These sitelinks occupy a single row below the result snippet. Search: \"how many tacos are there\" Organic w/ Full SitelinksDominant entities in the #1 position may be rewarded with a set of full sitelinks. A #1 result can have anywhere from 1-6 full sitelinks, and each row of sitelinks displaces one organic result. So, a #1 result with 5-6 full site links (3 rows) removes 3 organic positions from page 1. Search: \"taco johns\" Organic w/ Mega-SitelinksWhen someone searches for an exact domain (suggesting clear brand intent), Google may display an expanded pack of up to 10 sitelinks. The full pack of sitelinks occupies 5 organic positions, dominating the SERP. Search: \"tacobell.com\" Organic w/ Internal SearchSearches with clear brand intent may display a search box that allows you to search the Google index for a single website (the equivalent of a \"site:\" search). This option only seems to be available in the #1 organic position and is usually accompanied by Full Sitelinks. Search: \"food network\" Organic w/ Review StarsReview stars and rating data are sometimes displayed for products, recipes, and other relevant items. Review/rating data is shown between the destination URL and snippet. Search: \"best taco holders\" Organic w/ Video ThumbnailVideo results (especially YouTube) may display a thumbnail of that video. Video results used to be a true vertical but are now more of an organic enhancement. Search: \"taco of destiny\" I have absolutely no idea what's going on in this video. Organic w/ Recipe ThumbnailRecipes are eligible for a specialized square thumbnail. This type of thumbnail was also used for results with authorship, but that display format has been discontinued. Search: \"brisket taco monkey\" (yeah, you heard me) There is a recipe site called \"in sock monkey slippers\", and so every result title is in the form of \"Some food - in sock monkey slippers\". This is an act of pure genius. Organic w/ Knowledge SnippetsKnowledge Snippets are factoids from the Knowledge Graph that complement an organic result. The snippets appear in a list-like format below the search snippet. Search: \"when was the taco invented\" Special thanks to Patrick Bos for finding me a taco-related Knowledge Snippet. Organic w/ Forum ResultsDiscussion forum results sometimes show a special snippet with links to related results. These appear as individual rows below the snippet, and may show additional data. Search: \"in-depth taco discussion\" Organic w/ Event ResultsSimilarly, pages about events may show rich snippets that link to specific dates and locations. These appear as individual rows below the snippet, and may show additional data. Search: \"taco events\" Vertical ResultsVerticals results are blocks of specialized results that are triggered for searches with specific types of intent and use ranking rules beyond the core organic algorithm. Each block of vertical results takes the place of one organic result (as of this writing). Image ResultsImage results are displayed as a horizontal row of image links, which click through to a Google Images search. Image results may appear in any organic position. Search: \"show me the tacos\" Image Mega-blockFor searches that are clearly image related (containing keywords like \"pictures\" or \"photos\"), Google may display a large block of images that takes up three organic positions. Search: \"best taco pics\" News ResultsTime-sensitive and newsworthy topics may generate a block of results from Google News. Since the \"In the news\" update in late 2014, a wider variety of sites are eligible to rank in the news block. Search: \"taco news\" In-depth ArticlesFor broad or ambiguous terms, Google may return a block of \"in-depth\" articles, which are almost indistinguishable from organic results. They follow somewhat different ranking rules than core organic, and are dominated by large publishers. Each block of three occupies only one organic position. Search: \"tacos\" Google+ ResultsIn personalized search, Google may return matching posts from your Google+ circles. Like other verticals these results are intermixed with organic results, but they don't occupy an organic position. Search: \"talking tacos\" Twitter Results (Aug 2015)Google recently made a new agreement with Twitter and has started displaying tweets directly in SERPs, mixed in with organic results. Unlike Google+ results, Twitter results do not seem to require or be affected by personalization. Search: \"rick bayless\" The Knowledge GraphThe \"Knowledge Graph\" covers a lot of ground, from semantic data from human-edited sources (such as WikiData) to semantic data extracted from the Google index to private data partnerships. We'll use the term \"Knowledge Graph\" loosely for the purposes of this glossary. Knowledge Panels (Person)The most familiar incarnation of the Knowledge Graph is the Knowledge Panel, a rich entity that appears in the right-hand column of Google desktop searches. This is a pretty typical example, containing images, a descriptive snippet, relevant factoids, and related searches. Search: \"glen bell\" Knowledge Panels (Celebrity)Actors/actresses, musicians, and other celebrities may have very rich Knowledge Panels, including information about music and movies, social profiles, and more. This has nothing to do with tacos – I just love Justin Timberlake. Search: \"justin timberlake\" Knowledge Panels (Brand)Brands may also qualify for Knowledge Panels. Big brands may list detailed information (like the one below), but even smaller brands and local businesses that Google recognizes as entities can qualify for a Knowledge Panel. Search: \"chipotle\" Knowledge Panels (Nutrition)Food items may show a specialized Knowledge Panel with nutrition facts. Google is constantly adding specialized Knowledge Panels and will likely continue. Sometimes, though, ignorance is bliss – just enjoy your taco in peace. Search: \"tacos\" Disambiguation BoxesWhen a search is ambiguous, and Google doesn't have additional data (like search history), they may display a disambiguation box. The example below is a rich one, covering astronomy, mythology, and science-fiction television. Search: \"andromeda\" Medical Knowledge PanelsEarly in 2015, Google launched a first of its kind – original content in the Knowledge Panel. Medical Knowledge Panels are curated by Google along with third-party professionals, and even contain original illustrations. Search: \"irritable bowel syndrome\" Knowledge CardsKnowledge Cards (AKA \"Answer Boxes\", \"Direct Answers\") return semantic data directly from the Knowledge Graph. These answers are usually factual, such as a date, relationship, measurement, or some verifiable piece of information. Search: \"where is my taco\" Knowledge Cards w/ ReminderKnowledge Cards are driven by mobile search, and tie neatly into newer formats, such as Google Now. This is an example of a date-based answer that allows a logged-in searcher to submit information directly to Google Now. Search: \"when is national taco day\" Definition CardsQueries liked \"definition of[word]\" and \"origin of [word]\" may show a special definition card, that includes definitions, origin information, usage trends, and pronunciation. Some less common words may show this card even without \"definition\" in the search. Search: \"definition of taco\" Rich Knowledge CardsSome Knowledge Cards return rich, structured information, including images. The example below shows Dr. Seuss' birthday, but also includes a picture, a list of birthdays of other childrens' authors, and a header that restates the question. Search: \"dr. seuss birthday\" Knowledge Cards w/ GraphKnowledge Cards may return even more specialized and structured data, such as a graph. The example below shows the population of Mexico City over time. This graph also includes source attribution. Search: \"population of mexico city Unit Conversion CardsThe recently-redesigned unit conversion card includes a range of options, from digital storage to fuel economy to temperature. Enter any value in the boxes to run new conversion calculations on the fly. Search: \"pebibytes to petabits\" Calorie Counter CardsThere are some unique features that look like Knowledge Cards. One example is conversion calculators. The taco one below is just for fun, but Google also allows many types of unit and currency conversions. Search: \"how many calories in a taco\" Calculator CardsGoogle also includes a fully-featured scientific calculator, that can be triggered by simple formulas, such as \"7 X 6\" or \"sqrt(1764)\". The example below is a Google Easter Egg. Some formulas, such as \"sin x\" will launch a graph card instead. Search: \"answer to life the universe and everything\" Mortgage CalculatorsGoogle is beginning to invest in more specialized calculators, such as this mortgage calculator, which triggers for a wide range of competitive queries. Expect to see more niche calculators and tools in the near future. Search: \"mortgage calculator\" Google Now CardsSome personalized data, especially data from Gmail, can be pulled directly into Google-Now-style Knowledge Cards. This includes upcoming flight information, frequent flyer numbers, hotel bookings, and product purchases. Search: \"my flights\" Live Results (Sports)\"Live Results\" are a special type of card driven by private partnerships in select verticals. Many of these contain very rich data. There are multiple examples in both professional and college sports, including the box score card below. Search: \"cubs score\" Live Results (Weather)Another common Live Result is regional weather forecasts. This is another very rich feature that includes current conditions, a short-term forecast, a long-term forecast, and even some interactive features in the UI. Search: \"seattle weather\" Live Results (Stock Quote)Financial information for many ticker symbols is also available via live results. Nearly real-time results (including after-hours trades) are available from major financial news sources, along with graphs over multiple time windows. Search: \"yum stock quote\" Mega-Video CardsGoogles \"Mega-Video\" format promotes a single video to a prominent card-like result, with a very large thumbnail and song/artist data. Mega-Videos are dominated by YouTube and the Vevo music video network. Search: \"never gonna give you up\" Lyrics Cards (from Google Play)In the first half of 2015, Google started to display song lyrics directly in a card-like format. Lyrics are taken directly from Google Play and link to Google Play for more information and the option to purchase the song. Search: \"never gonna give you up lyrics\" Menu ResultsRestaurant menus for specific locations may be shown in a specialized, card-like format. These generally list the name of the restaurant, the address, and tabbed categories that allow you to scroll through a text-based menu. Search: \"el pollo loco menu\" (Seattle) Featured SnippetsWhen Google wants to answer a question that isn't in the core Knowledge Graph, they may attempt to find that answer in the index. This creates a special class of organic result with information extracted from the target page. Search: \"who invented tacos\" Featured Snippets w/ TablesAs Featured Snippets expand, they are also becoming more richly formatted, including images, lists, and tables. The example below shows a Featured Snippet made up of tabular data. Search: \"how much is a taco\" Related Questions (AKA \"People Also Ask\")The Related Questions card shows algorithmically-generated questions that Google believes might relate to your search. Each question expands to something that looks like a Featured Snippet. Related Questions are mixed into organic results and their location may vary. Search: \"chipotle name origin\" Knowledge CarouselsSome niche searches may bring up a carousel with a black background that extends across both columns. This carousel may also have unique search filters related to the search. The image below is truncated for a close-up view. Search: \"best movies of 1984\" Rich ListsAnother carousel format presents lists in a table across both columns. This format seems to be expanding, and can include songs, travel destinations, nutrition information, and other list-style data. Search: \"songs by taco\" Local ResultsLocal SEO has changed dramatically in the past couple of years, and local features are evolving rapidly. Especially if you have a brick-and-mortar business, it's important to be very familiar with Google's local space. Local PacksIn mid-2015, Google phased out the familiar 2-7 result local pack (that blended with organic results), and rolled out a new 2-3 result entity that's more closely aligned with Google Maps. Search: \"gastroenterologists\" (Seattle) Local A/B/C PacksIn some cases, Google may display a variant local pack with A/B/C labels and map pins. This sometimes occurs when all of the locations in a pack are related to the same entity (such as a restaurant chain). Search: \"taco bell\" (Seattle) Local \"Snack\" PacksBefore re-launching local packs, Google rolled out the \"snack pack\", a specialized local 3-pack with search filters, and no direct website link. These packs are still being used in some niches, including general restaurant searches. Search: \"mexican food\" (Seattle) Authoritative One-boxesIf Google finds a single, authoritative location for a search, they may return a \"one-box\". This is a single local result represented by a map pin and address/phone, integrated into an organic result. Search: \"topolobampo\" (Chicago) Local Knowledge PanelsOften tied with Authoritative One-boxes, Local Knowledge Panels display rich information about a local business, including address, phone, hours, reviews, and, most recently, a graph of when you should expect a crowd. Search: \"frontera grill\" (Chicago) Ads & ShoppingGoogle's financial empire is built on pay-per-click (PPC) ads, but in recent years the simple Google ad block has transformed into a rich advertising ecosystem. Here are a few of the more prominent types of paid results. AdWords Ads (Top/Bottom)Traditional AdWords ads come in many flavors now, but the most common type appears at the top and/or bottom of the left-hand column, above and below organic results. Each ad has a colored [Ad] label next to it. Search: \"tequila gift baskets\" AdWords Ads w/ ExtensionsTraditional ads can have many different extensions and enhancements, just like organic results. The example below has review stars, Google+ follower count, and mini-sitelinks. Ads may also qualify for full sitelinks. Search: \"chichen itza tours\" AdWords Ads (Right Column)Ads in the right-hand column are a bit smaller, horizontally, and may appear in packs with up to eight total ads. The [Ads] label only appears once in the right-hand column, above the first ad. Search: \"destination weddings\" Paid Shopping (Left Column)Paid Shopping results or Product Listing Ads (PLAs) sell products directly with rich information, such as images and pricing. Paid Shopping results in the left column usually appear as a horizontal row of products. Search: \"taco shells\" Paid Shopping (Right Column)Shopping results in the right-hand column are very similar, but they may take up multiple rows. Google has experimented with larger Paid Shopping results, but most current results are either one or two rows of products. Search: \"buy tortillas\" Paid Shopping w/ Rows (Right)For a smaller product count, paid shopping in the right-hand column may also be displayed as one product per row. The functionality is similar, but this allows for additional space and a line of ad copy. Search: \"pace picante\" Paid Product PanelsUnique product models may trigger a specialized entity that looks like a Knowledge Panel but is actually a sponsored result. The example below is from a smartphone search, which shows retailers and the option to filter by carrier. Search: \"iphone 6\" Movies w/ Watch Now AdsKnowledge Panels for movies that are available to watch online may display \"Watch now\" ads to services such as Google Play, Amazon, etc. These are currently labeled with the AdWords [Ads] marker. Search: \"cloudy with a chance of meatballs 2\" Music w/ Listen Now AdsSimilarly, Knowledge Panels for musical artists and album titles may give you paid listings to listen to songs online. Recently, some books have added \"Read now\" ads as well. Expect this type of paid feature to expand. Search: \"futuresex\" Hotels w/ Book a Room AdsSome Local Knowledge Panels for hotels allow you to check availability dates and link directly to booking services. Google is actively expanding both organic and paid hotel elements, including amenities data. Search: \"hotel monaco\" (Seattle) Paid Flight ResultsFlight searches can trigger a number of paid features. The example below is a card-like format that allows you to check and book flights directly via the Google Flights engine. Search: \"flight from chicago to seattle\" AcknowledgementsCataloging and naming the Google feature ecosystem is not something I could ever do alone. Many features were spotted and named long before I re-entered the industry, most notably by the tireless work of Danny Sullivan and Barry Schwartz. I'd also like to thank Jennifer Slegg for her great work over the past year identifying and tracking down names for new features. Thanks also to Gary Illyes at Google, for being willing to talk openly with us about new features and naming conventions. Special thanks to the local SEO community for their ongoing generosity and geekery, and my sincere apologies for ever creating the name \"snack pack\". Finally, thanks to Kevin on our design team for being willing to listen to instructions like \"Think glossary + Godzilla + tacos!\" without murdering me. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google Glossary: Revenge of Mega-SERP"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google Glossary: Revenge of Mega-SERP"
    },
    {
      "level": "H2",
      "text": "Table of Contents"
    },
    {
      "level": "H2",
      "text": "New & In Testing"
    },
    {
      "level": "H2",
      "text": "Compare Mortgages"
    },
    {
      "level": "H2",
      "text": "Car Loan Calculator"
    },
    {
      "level": "H2",
      "text": "Customized AT&T Ad Unit (Oct 2015)"
    },
    {
      "level": "H2",
      "text": "Rosters in Team Knowledge Panels (Oct 2015)"
    },
    {
      "level": "H2",
      "text": "\"Claim this business\" in Local Panel (Sep 2015)"
    },
    {
      "level": "H2",
      "text": "\"I'm Feeling Curious\" Card (Sep 2015)"
    },
    {
      "level": "H2",
      "text": "Popular Times (Sep 2015)"
    },
    {
      "level": "H2",
      "text": "Book an Appointment (Aug 2015)"
    },
    {
      "level": "H2",
      "text": "Home Services Ads (Aug 2015)"
    },
    {
      "level": "H2",
      "text": "Organic & Enhancements"
    },
    {
      "level": "H2",
      "text": "Simple Organic Results"
    },
    {
      "level": "H2",
      "text": "Organic w/ Date Add-on"
    },
    {
      "level": "H2",
      "text": "Organic w/ Virtual Path"
    },
    {
      "level": "H2",
      "text": "Organic w/ Long Snippet"
    },
    {
      "level": "H2",
      "text": "Organic w/ Brand Dropdown"
    },
    {
      "level": "H2",
      "text": "Organic w/ Mini Sitelinks"
    },
    {
      "level": "H2",
      "text": "Organic w/ Full Sitelinks"
    },
    {
      "level": "H2",
      "text": "Organic w/ Mega-Sitelinks"
    },
    {
      "level": "H2",
      "text": "Organic w/ Internal Search"
    },
    {
      "level": "H2",
      "text": "Organic w/ Review Stars"
    },
    {
      "level": "H2",
      "text": "Organic w/ Video Thumbnail"
    },
    {
      "level": "H2",
      "text": "Organic w/ Recipe Thumbnail"
    },
    {
      "level": "H2",
      "text": "Organic w/ Knowledge Snippets"
    },
    {
      "level": "H2",
      "text": "Organic w/ Forum Results"
    },
    {
      "level": "H2",
      "text": "Organic w/ Event Results"
    },
    {
      "level": "H2",
      "text": "Vertical Results"
    },
    {
      "level": "H2",
      "text": "Image Results"
    },
    {
      "level": "H2",
      "text": "Image Mega-block"
    },
    {
      "level": "H2",
      "text": "News Results"
    },
    {
      "level": "H2",
      "text": "In-depth Articles"
    },
    {
      "level": "H2",
      "text": "Google+ Results"
    },
    {
      "level": "H2",
      "text": "Twitter Results (Aug 2015)"
    },
    {
      "level": "H2",
      "text": "The Knowledge Graph"
    },
    {
      "level": "H2",
      "text": "Knowledge Panels (Person)"
    },
    {
      "level": "H2",
      "text": "Knowledge Panels (Celebrity)"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Knowledge Panels (Brand)"
    },
    {
      "level": "H2",
      "text": "Knowledge Panels (Nutrition)"
    },
    {
      "level": "H2",
      "text": "Disambiguation Boxes"
    },
    {
      "level": "H2",
      "text": "Medical Knowledge Panels"
    },
    {
      "level": "H2",
      "text": "Knowledge Cards"
    },
    {
      "level": "H2",
      "text": "Knowledge Cards w/ Reminder"
    },
    {
      "level": "H2",
      "text": "Definition Cards"
    },
    {
      "level": "H2",
      "text": "Rich Knowledge Cards"
    },
    {
      "level": "H2",
      "text": "Knowledge Cards w/ Graph"
    },
    {
      "level": "H2",
      "text": "Unit Conversion Cards"
    },
    {
      "level": "H2",
      "text": "Calorie Counter Cards"
    },
    {
      "level": "H2",
      "text": "Calculator Cards"
    },
    {
      "level": "H2",
      "text": "Mortgage Calculators"
    },
    {
      "level": "H2",
      "text": "Google Now Cards"
    },
    {
      "level": "H2",
      "text": "Live Results (Sports)"
    },
    {
      "level": "H2",
      "text": "Live Results (Weather)"
    },
    {
      "level": "H2",
      "text": "Live Results (Stock Quote)"
    },
    {
      "level": "H2",
      "text": "Mega-Video Cards"
    },
    {
      "level": "H2",
      "text": "Lyrics Cards (from Google Play)"
    },
    {
      "level": "H2",
      "text": "Menu Results"
    },
    {
      "level": "H2",
      "text": "Featured Snippets"
    },
    {
      "level": "H2",
      "text": "Featured Snippets w/ Tables"
    },
    {
      "level": "H2",
      "text": "Related Questions (AKA \"People Also Ask\")"
    },
    {
      "level": "H2",
      "text": "Knowledge Carousels"
    },
    {
      "level": "H2",
      "text": "Rich Lists"
    },
    {
      "level": "H2",
      "text": "Local Results"
    },
    {
      "level": "H2",
      "text": "Local Packs"
    },
    {
      "level": "H2",
      "text": "Local A/B/C Packs"
    },
    {
      "level": "H2",
      "text": "Local \"Snack\" Packs"
    },
    {
      "level": "H2",
      "text": "Authoritative One-boxes"
    },
    {
      "level": "H2",
      "text": "Local Knowledge Panels"
    },
    {
      "level": "H2",
      "text": "Ads & Shopping"
    },
    {
      "level": "H2",
      "text": "AdWords Ads (Top/Bottom)"
    },
    {
      "level": "H2",
      "text": "AdWords Ads w/ Extensions"
    },
    {
      "level": "H2",
      "text": "AdWords Ads (Right Column)"
    },
    {
      "level": "H2",
      "text": "Paid Shopping (Left Column)"
    },
    {
      "level": "H2",
      "text": "Paid Shopping (Right Column)"
    },
    {
      "level": "H2",
      "text": "Paid Shopping w/ Rows (Right)"
    },
    {
      "level": "H2",
      "text": "Paid Product Panels"
    },
    {
      "level": "H2",
      "text": "Movies w/ Watch Now Ads"
    },
    {
      "level": "H2",
      "text": "Music w/ Listen Now Ads"
    },
    {
      "level": "H2",
      "text": "Hotels w/ Book a Room Ads"
    },
    {
      "level": "H2",
      "text": "Paid Flight Results"
    },
    {
      "level": "H2",
      "text": "Acknowledgements"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}