{
  "url": "https://moz.com/blog/google-grouping-keyword-volumes-what-does-this-mean-for-seo",
  "slug": "google-grouping-keyword-volumes-what-does-this-mean-for-seo",
  "title": "Google Is Grouping Keyword Volumes - What Does This Mean for SEO? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Google Keyword Planner recently saw a disappointing change: Keyword volumes are being lumped into large ranges that don't offer near the detail we had before. This post explores what that means for your SEO work.",
  "content": "Google Is Grouping Keyword Volumes - What Does This Mean for SEO? Keyword Research | Search Engines By: Sam Nemzer September 19, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Sam Nemzer September 19, 2016 Google Is Grouping Keyword Volumes - What Does This Mean for SEO? Keyword Research | Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As of June this year, Google is now grouping keyword volumes for similar keywords in Keyword Planner. I wanted to investigate whether or not this is having an impact on the pages that rank for these similar, grouped keywords. My hypothesis is that, given that Google is associating keywords closely enough to group their volumes, we should expect that the search results would be very similar too. What has Google changed and why does it matter?The grouping of keyword volumes is a problem for anyone working in search because Keyword Planner is the primary source for volume data that we use in keyword research, whether that be from Keyword Planner directly, or through a third party tool that takes Keyword Planner data as its input—such as SEMRush, BrightEdge or SearchMetrics. By \"grouping keyword volumes,\" we mean that different keywords that are slightly different (but generally convey the same meaning) are given the same volume, which represents the combined volume of every variation. For example, if (hypothetically) [SEO] is searched 21,000 times per month in the UK, and [Search Engine Optimisation] is searched 12,100 times per month, once these keywords are combined, each will be reported as receiving the total of the two—33,100 searches per month.\\ On top of this, in the last few weeks Google have also been reducing access to keyword planner data for some accounts. Earlier this month, it was announced that Keyword Planner data will be given only in very broad buckets for advertisers with \"lower monthly spend\" (although some ways around this have been found). This is a separate change from the volume grouping, which is the main focus of this article. The fact that Google is grouping keyword volumes in this way implies that they see these keywords as equivalent, at least to some extent. The questions that this raised for me were: Does this mean that we should see keywords with grouped volumes as identical? From an SEO point of view, should we focus our targeting efforts on any one of the grouped keywords, given that Google is seeing them as the same? There is further reason to think this way given the simple fact that Google is always getting smarter. As well as Parsey McParseface, the English language parser that Google released to the public, much of the research output that we see in patents and journal articles from Google relates to natural language processing, so it is clear that this is an area that Google see as a priority for their research. One way to test whether or not Google does indeed consider grouped keywords to be identical is to look at search results. The theory is that if keywords are viewed identically, we should see exactly the same pages ranking for the keywords. What's going on in the SERPs?I did a similar analysis a few months ago, which was focused more on general distinctions between keywords within a topic. This analysis is much more focused on the types of variations of keywords that we are seeing being grouped. These types of variations were categorised by, among others, Jennifer Slegg at The SEM Post. The five types of variations that I've looked into for this analysis are the following: Initialisms/Abbreviations. For example, comparing SERPs for [BBC] and [British Broadcasting Corporation] Plurals. For example, [waffle maker] and [waffle makers]. Verb stems with and without suffixes. For example, [calculate], [calculated] and [calculating]. Keywords with and without punctuation. For example, [midnight's children] and [midnights children] Keywords with and without typos. For example, [heart rate monitor] and [heart rat monitor]. For each of these five categories, I put together a list of 50-100 keywords, along with a variation for each. Within these keyword pairs I investigated whether or not Keyword Planner reported the same volume, and also used the rank tracking tool STAT to see what pages are ranking for each keyword. From that analysis, I was able to measure the prevalence of grouping keyword volumes within each category (i.e. the percentage of keyword pairs that have grouped volumes), and the similarity of the SERPs (the number of top ten results that were shared between the two keywords) for grouped and ungrouped keyword pairs. ResultsThe results for those metrics are the following: I also looked at how common it is that SERPs are exactly identical, that is that the top ten results are the same pages, in the same order. This showed an interesting pattern. There are only two categories with significant numbers of identical SERPs—Punctuation and Typos. In the case of keywords with and without punctuation, you are more likely to see identical SERPs (implying that Google sees the pair of keywords as identical) if keyword volumes are grouped than if they are not. This is not a hard-and-fast rule though – there are still some ungrouped keywords which have identical SERPs. In the case of Typos, there are no grouped keyword pairs at all that have identical SERPs. Given also the low prevalence of grouped keywords in this category, it appears that the identical SERPs are coming from \"showing results for\" SERPs, where Google replaces results for the mistyped keywords with the correct one. What conclusions can we draw? The prevalence of keyword grouping is highest for plurals, and very low for typosThis may be a result of the sample of keywords used in this study, but overall, around 50% of keywords in the sample are grouped. This indicates that, although this volume grouping is a growing phenomenon in Keyword Planner data, it is not yet consistent across all SERPs. There is not a lot of difference between keywords that are grouped by Keyword Planner, and those that aren't.This is a surprising result. The motivation for conducting this study was to confirm the suspicion that Google associating keyword volumes means that it also associates the search intent. This is comprehensively disproven by this data. There is no significant difference between grouped and ungrouped keyword pairs when it comes to SERP similarity.The one group where there is a larger difference is the verb stems category. This is likely because there are many verbs where the present and past tense mean very different things, indicating different search intent. For example, the keywords [march] and [marched] have completely different intents due to the multiple meanings of the word 'march.' This means that there's no chance that these SERPs will be similar. On the other hand, some verbs have little intent difference between past and present forms (for example [admire] and [admired]). These types of keyword pairs generally have grouped volume, and also have more similar SERPs. Overall, there is not a very high rate of similarity of SERPs for similar keywordsWhen starting this analysis, I expected to see much higher rates of similarity between very similar keywords. This is not the case, and to me that is surprising for two reasons. The first is that, as mentioned above, I saw the grouping of keyword volumes to be a clear signal that the keywords were seen as identical intents. This appears not to be the case.The other reason is that I have a lot of faith in how smart Google is. Its developments in natural language processing and intent assessment give me the impression that it is able to associate similar keywords in the results it shows.It may be that things are heading in this direction, but it's too early for it to have been fully implemented. The alternative explanation would be Google is that smart, and can interpret the subtle difference between keywords with incredibly similar content. What should we take away from this?What does this mean for SEOs doing keyword research? Rank tracking companies such as STAT are looking into ways of splitting keyword volumes between the constituent keywords, so there is hope for at least semi-accurate volume data. What it does mean is that we should ignore the grouped volumes when targeting keywords—just because keywords are given the same volume, it doesn't mean you shouldn't target them individually on your site. On a wider scale, this tells us something about how the anthropomorphised \"Google\" thinks and works. There are two very separate factors at work here—what Google tells us, and what we actually see. This is something Rand picked up on in his recent Whiteboard Friday, and it applies across all of search—Google tells us one thing, but search rankings don't necessarily behave the same way. This backs up my belief to never take anything at face value, and always do your own research. Do these results surprise you as much as they do me? Let me know in the comments. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google Is Grouping Keyword Volumes - What Does This Mean for SEO?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google Is Grouping Keyword Volumes - What Does This Mean for SEO?"
    },
    {
      "level": "H2",
      "text": "What has Google changed and why does it matter?"
    },
    {
      "level": "H2",
      "text": "What's going on in the SERPs?"
    },
    {
      "level": "H2",
      "text": "Results"
    },
    {
      "level": "H2",
      "text": "What conclusions can we draw?"
    },
    {
      "level": "H2",
      "text": "What should we take away from this?"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sam Nemzer\n          \n            Sam Nemzer"
}