{
  "url": "https://moz.com/blog/google-organic-clicks-shifting-to-paid",
  "slug": "google-organic-clicks-shifting-to-paid",
  "title": "New Findings Show Google Organic Clicks Shifting to Paid - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "One large e-commerce brand noticed a startling shift in organic CTR, with paid ads now earning nearly the same percentage of clicks as organic results. What does this mean and how can sites combat the new trend?",
  "content": "New Findings Show Google Organic Clicks Shifting to Paid E-Commerce SEO | Search Engines By: Brian Wood October 5, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Brian Wood October 5, 2017 New Findings Show Google Organic Clicks Shifting to Paid E-Commerce SEO | Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. On the Wayfair SEO team, we keep track of our non-branded click curves: the average click-through rate (CTR) for each ranking position. This helps us accurately evaluate the potential opportunity of keyword clusters. Over the last two years, the total share of organic clicks on page one of our e-commerce SERPs has dropped 25% on desktop and 55% on mobile. For the ad-heavy non-local SERPs that we work in, paid ads are likely now earning nearly the same percentage of clicks as organic results — a staggering change from most of the history of Google. Organic CTR loses 25% of click share on desktop, 55% on mobile Looking at 2015 vs 2017 data for all keywords ranking organically on the first page, we’ve seen a dramatic change in CTR. Below we’ve normalized our actual CTR on a 1–10 scale, representing a total drop of 25% of click share on desktop and 55% on mobile. Organic receives 25% less desktop CTR and 55% less mobile CTR compared to two years ago. The much larger drop on mobile is particularly relevant because we’ve seen large traffic shifts to mobile over the last two years as well. The overall percentage drop plays out somewhat similarly across the first page of results; however, the top four were most heavily impacted. The first four organic results were most heavily impacted by the CTR shift from organic to paid. About the data It’s important to note that this type of CTR change is not true for every SERP. This data is only applicable to e-commerce intent search queries, where ads and PLAs are on nearly every query. We gather the impression, click, and rank data from Search Console. While Search Console data isn’t quantitatively correct, it does appear to be directionally correct for us (if we see clicks double in Search Console, we also see organic Google traffic double in our analytics), site improvements that lead to meaningful CTR gains appear to be reflected in Search Console, we can roughly verify impressions via ad data, and we can confirm the accuracy of rank. For purposes of this data pull, we excluded any keywords that Search Console reported as a non-integer rank (such as ranking 1.2). We have thousands of page one keywords, including many large head terms comprising millions of combined clicks, which gives us a lot of data for each ranking position. We remove all branded queries from the data, which hugely skews click curves. It’s important to note that paid ads are not getting all the clicks that organic is not. In addition to the small number of people who click beyond the first page, a surprising number do not click at all. Our best guess is that all ads combined now get about the same percentage of clicks (for our results) as all organic results combined. Why is this happening? It’s no secret to SEOs who work on transactional keywords why we no longer gain as large a share of clicks for our best rankings. We suspect the primary causes are the following: Ads serving on more queries More ads per query Larger ads, with more space given to each ad Google Shopping (which show up on more queries, list more products per query, and take up more space) Subtler ad labeling, making it less obvious that an ad is an ad At Wayfair, we’ve seen Google Shopping results appear on more and more search queries over the last year. Using Stat Search Analytics, we can track the growth in queries serving Google Shopping results (modified by search volume to give a qualitative visibility score) across the 25,000 keywords we track daily on mobile and desktop. The overall share of voice of Google Shopping has grown nearly 60% in the last year. Number of transactional queries serving Google Shopping has grown nearly 60% in the last year. On top of this, we’re often seeing four PPC ads for a typical non-branded commercial term, in addition to the Google Shopping results. And with the expanded size of ads on mobile, almost none of our queries show anything other than ads without scrolling: This great image from Edwords shows the steady growth in percent of the desktop page consumed by ads for a query that has only three ad results. We go from seeing five organic results above the scroll, to just one. In more recent years we’ve seen this size growth explode on mobile as well. At the same time that ads have grown, the labeling of ads has become increasingly subtle. In a 2015 study, Ofcom found that half of adults don’t recognize ads in Google, and about 70% of teenagers didn’t recognize Google ads — and ad labeling has become substantially less obvious since then. For most of its history, Google ads were labeled by a large colored block that was intuitively separate from the non-ad results, though sometimes not visible on monitors with a higher brightness setting. 2000 – Shaded background around all ads: 2010 – Shaded background still exists around ads: 2014 – No background; yellow box label next to each ad (and ads take up a lot more space): 2017 – Yellow box changed to green, the same color as the URL it’s next to (and ads take up even more space): 2017 – Green box changed to a thin green outline the same color as the URL: What to do about it The good news is that this is impacting everyone in e-commerce equally, and all those search clicks are still happening — in other words, those users haven’t gone away. The growth in the number of searches each year means that you probably aren’t seeing huge losses in organic traffic; instead, it will show as small losses or anemic growth. The bad news is that it will cost you — as well as your competitors — more money to capture the same overall share of search traffic. A strong search marketing strategy has always involved organic, paid search, and PLA combined. Sites optimizing for all search channels are already well-positioned to capture search traffic regardless of ad changes to the SERPs: if SEO growth slows, then PLA and paid search growth speeds up. As real estate for one channel shrinks, real estate for others grows. If you haven’t been strongly invested in search ads or PLAs, then the Chinese proverb on the best time to plant a tree applies perfectly: The best time to plant a tree was 20 years ago. The second best time is now. With a similar percentage of clicks going to paid and organic, your investment in each should be similar (unless, of course, you have some catching up to do with one channel). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "New Findings Show Google Organic Clicks Shifting to Paid"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "New Findings Show Google Organic Clicks Shifting to Paid"
    },
    {
      "level": "H2",
      "text": "Organic CTR loses 25% of click share on desktop, 55% on mobile"
    },
    {
      "level": "H2",
      "text": "About the data"
    },
    {
      "level": "H2",
      "text": "Why is this happening?"
    },
    {
      "level": "H4",
      "text": "2000 – Shaded background around all ads:"
    },
    {
      "level": "H4",
      "text": "2010 – Shaded background still exists around ads:"
    },
    {
      "level": "H4",
      "text": "2014 – No background; yellow box label next to each ad (and ads take up a lot more space):"
    },
    {
      "level": "H4",
      "text": "2017 – Yellow box changed to green, the same color as the URL it’s next to (and ads take up even more space):"
    },
    {
      "level": "H4",
      "text": "2017 – Green box changed to a thin green outline the same color as the URL:"
    },
    {
      "level": "H2",
      "text": "What to do about it"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Common Mistakes E-commerce Websites Make Using JavaScript"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Brian Wood\n          \n            Brian Wood\n          \n            Brian Wood"
}