{
  "url": "https://moz.com/blog/google-shopping-feed-cost-and-ppc-best-practices-16918",
  "slug": "google-shopping-feed-cost-and-ppc-best-practices-16918",
  "title": "Google Shopping Feed, Cost, and PPC Best Practices - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Google Shopping is an online shopping campaign which can really give merchants a headache. Here are some best practices and ways to ease that headache.",
  "content": "Google Shopping Feed, Cost, and PPC Best Practices Paid Search Marketing (PPC) C By: CPC Strategy April 17, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! C By: CPC Strategy April 17, 2013 Google Shopping Feed, Cost, and PPC Best Practices Paid Search Marketing (PPC) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Google Shopping is an online shopping campaign which can really give merchants a headache. Here are some best practices and ways to ease that headache. When listing on Google Shopping you should keep in mind three major elements of the Google campaign: Your product data, or your Google Shopping data feed; How much you are spending on Google; and what your PPC is on Google Shopping. For Google to list your Product Listing Ads on Google Shopping, Google needs your product information, and the way you communicate that to Google Shopping is with the Google Shopping product data feed. What is a Google Shopping Data Feed? Your Google Product Listing Ads (PLA) product data feed at its simplest is a detailed spreadsheet. This file has all of your products information: everything you sell and all of the product information specific to those products (eg. size, color, URL). In other words, the Google Shopping data feed contains your product data. It’s a Google Shopping data feed because you must regularly feed it to Google in order to update your product data whenever you change a product name, price, category, image, URL or stock availability. *Note: Although you manage Google Shopping through the Google AdWords login, the Google Shopping feed should be sent to the Google Merchant Center. How Do I Optimize My Google Shopping Data Feed? Google determines which Product Listing Ads appear in a search depending on Google Shopping Cost Per Click (CPC) bids and product information from the Google Shopping product data feed. Google matches these merchant inputs as best it can with a consumer’s search terms. Because of this, your Google Shopping data feed should focus on providing Google Shopping and consumers relevant product data. You can do this by having product titles and product descriptions in the Google Shopping feed which have the information shoppers are looking for. Google Shopping Feed Product Titles and Descriptions When you're creating product descriptions and product titles keep in mind what shoppers are searching (e.g. brand, size, MPN, UPC, product title, category title (i.e. ‘baby strollers’) etc.), you will want to do some research here and or get some SEO advice. Here are a few articles to get you started with SEO, and help you understand why keywords and titles are so important in your Google Shopping data feed and beyond: What are Title Tags and how do they impact SEO? What are On- Page Factors and how do they impact SEO? How Do I Build The Perfectly Optimized Page? Once you've determined the terms you want to include in your product titles and descriptions in the Google Shopping data feed, you need to organize the order of keywords in those titles and descriptions. Although this has not been officially confirmed, we’ve found that Google seems to count data feed product titles and descriptions from left to right in terms of importance. Product information at the beginning of titles and descriptions in your Google Shopping data feed counts for more than shopping feed data following those initial terms, farther to the right. When you are creating Google Shopping product data, try to put more important product descriptors at the front (to the left), and those which are searched less to the right. Google Shopping Cost Google determines which shopping feed ads to display based on the data in the merchant’s Google Shopping data feed in addition to the amount a merchant bids on AdWords. How Much Does Google Shopping Cost? Google does not have a minimum bid or a minimum cost for Google Shopping / Product Listing Ads. You can choose a cost per click as low as $0.01, and there is no minimum daily budget, so you have a lot of flexibility with how much you spend on Google Shopping. Google Shopping can cost you $1 a day, $1 a month, or more than $100 a day, depending on how much visibility you want your products to have. In Q4, we conducted a Google Shopping study which shows merchant costs on Google Shopping averaged at $11.30 in spend for every $100.00 in sales. Compared to other marketing channels, Google Shopping costs were extremely low, even lower than the flat fees on most Amazon Marketplace categories. Google Shopping, if managed correctly, should yield similar Google Shopping cost / revenue ratios, depending on your average order value, price compared to your competitors, and site-wide conversion rates. You can dictate how much Google Shopping costs by increasing or decreasing your daily budget and your PPC bids. Keep in mind that if your costs on Google Shopping are low, you also will have low Google Shopping ad visibility. Additionally, it's important to know that Google will stop serving your ads once your Google Shopping daily budget is reached. So if you have a $20 max daily cost on Google Shopping, your Google Shopping ads will show up until that $20 is reached. If you have a high Google Shopping average CPC cost with a low Google Shopping cost, your ads will only appear for a fraction of the day as you will run out of spend more quickly. The amount of products you have also plays a big role on how much your Google Shopping campaign will cost. If you have 100,000 products at a cost of 30 cents per click, you will spend a lot more than a merchant with 100 products at the same cost per click. Google determines which ads to display on Google Shopping based on how the keywords in your data feed match a consumer’s search, in addition to the CPC bids you set up in your Google Shopping PPC campaign. How to Set Your Google Shopping PPC To be competitive on Google Shopping, you ideally want to be among the top five ads for a Google Shopping result page. Realistically your Google Shopping PPC campaign may not be able to afford to rank high on Google Shopping depending on what the average Google Shopping CPC is for your category, and how much you are comfortable spending on Google Shopping. Other merchants on Google Shopping will be changing their PPC campaign and how much they are spending weekly (if not daily), so you should keep an eye on your average position for your Google Shopping Ads, and how much you are spending on Google shopping. Google Shopping Data Feed, Cost, and PPC Best Practices Review The Google Shopping Data Feed: Optimize Google Shopping feed product information based on Google's algorithm and shopping intent. Google Shopping Costs Choose a daily budget which fits your goals and how much you can spend on Google Shopping, but also keeps in mind how much visibility you want. Google Shopping costs to revenue ratios in Q4 were better than all other shopping feed marketing channels. Prepare to monitor your budget and costs on your Google Shopping campaign, especially in the first few weeks. Google Shopping PPC When setting PPC amounts for your Google Shopping Ad Groups, consider how high you want to rank on Google Shopping pages, and how long you want to be serving Ads on Google throughout the day. Google Shopping is a big deal. Realistically you're stretched for time and resources, but taking a look at your Google Shopping campaign will be more than worth the investment. Please feel free to reach out if you have any questions. Want to lean more Google Shopping best practices? Check out the SEOmoz and CPC Strategy Webinar this Thursday, 4/18 at 11:00AM PST. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google Shopping Feed, Cost, and PPC Best Practices"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google Shopping Feed, Cost, and PPC Best Practices"
    },
    {
      "level": "H2",
      "text": "What is a Google Shopping Data Feed?"
    },
    {
      "level": "H2",
      "text": "How Do I Optimize My Google Shopping Data Feed?"
    },
    {
      "level": "H2",
      "text": "Google Shopping Feed Product Titles and Descriptions"
    },
    {
      "level": "H2",
      "text": "How Much Does Google Shopping Cost?"
    },
    {
      "level": "H2",
      "text": "How to Set Your Google Shopping PPC"
    },
    {
      "level": "H2",
      "text": "Google Shopping Data Feed, Cost, and PPC Best Practices Review"
    },
    {
      "level": "H3",
      "text": "The Google Shopping Data Feed:"
    },
    {
      "level": "H3",
      "text": "Google Shopping Costs"
    },
    {
      "level": "H3",
      "text": "Google Shopping PPC"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "CPC Strategy\n          \n            CPC Strategy\n          \n            CPC Strategy"
}