{
  "url": "https://moz.com/blog/google-trends-is-awesome",
  "slug": "google-trends-is-awesome",
  "title": "Google Trends is Awesome! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Hey,If you have not seen Google Trends yet, better get over there right now and sniff around.   It is exactly like Zeitgeist but you can type in any term that you want and see a whole lot of really cool data.For example....",
  "content": "Google Trends is Awesome! Search Engines E By: EGOL May 10, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! E By: EGOL May 10, 2006 Google Trends is Awesome! Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Hey,If you have not seen Google Trends yet, better get over there right now and sniff around. It is exactly like Zeitgeist but you can type in any term that you want and see a whole lot of really cool data.For example.... Search for Deer Hunting and you can see that folks start searching heavy for it in June and then the search volume peaks at the start of the season in November. Good marketing data here for when to promote stuff on your site. In addition to these charts you can see news articles that might drive search. That is what the flags sticking up off of the trend line correspond to. (The Zeitgeist example of Rosa Parks - search volume driven by Black History Month and the news of her death.)Also you can see histograms of what cities or what regions are the sources of big search volume. Search for \"groundhog day\" and you can see clearly that it is a big Pennsylvania thing.Another, you can see how long hot news items drive search.Go check it out and give us some of your best ideas on how we can use this to make money or improve our websites.I will use it to decide when to start some of my homepage advertising and what geographic areas to target for some of my products. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google Trends is Awesome!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google Trends is Awesome!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "EGOL\n          \n            EGOL"
}