{
  "url": "https://moz.com/blog/googles-future-is-in-the-cards",
  "slug": "googles-future-is-in-the-cards",
  "title": "Google's Future is in the Cards - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Google's card-based design tests go well beyond aesthetics and represents an evolution in their approach to search. I use many examples to tell the story of what cards mean for search.",
  "content": "Google's Future is in the Cards Advanced SEO | Search Engines By: Dr. Peter J. Meyers August 23, 2016 Table of Contents Copied! By: Dr. Peter J. Meyers August 23, 2016 Google's Future is in the Cards Advanced SEO | Search Engines Google is constantly testing new design elements, but over the past few months they've been testing a change that, while it might seem small on the surface, represents a major philosophical shift. The screenshots in this post were all captured on live SERPs but appear to be tests and have not rolled out permanently. Here's an example of the basic change: Notice how each result (ads and organic) is wrapped in a container and visually separated on a gray background. These containers are called \"cards\" in Google's vernacular, and they're important, but we'll get to that. Why should we care about a few borders and a background? Shift #1: Mobile-first designWe've known for over two years that Google was shifting to a mobile-first design philosophy. Earlier this year, Google removed ads from the right-hand column. While this change was partially due to performance, I believe that a big part of it was standardizing the ad environment across platforms (mobile, tablet, desktop, etc.). What's not obvious from the test above is that this card-based design is more than just boxes and backgrounds. Google is testing a serious move toward single-column SERPs. The removal of ads from the right-hand column was only the beginning. Here's a SERP screenshot for \"polar bear\" in Google's current desktop design: Below is the test design, captured back in May. The Knowledge Panel has been moved to the top-left, and the right-hand column is gone. This is not a Knowledge Card of the sort we typically see on the top-left. It is the traditionally right-hand desktop entity, moved and collapsed (with a \"More about Polar bear\" arrow): Here's the same search on an Android phone. Notice the card-based format and Knowledge Panel at the top. Obviously, nothing is in the right-hand column, because mobile only has one column: There are still display differences between mobile and the desktop test, of course, but you can clearly start to see the convergence between the test and the current mobile design. How will it all fit on the left?Getting everything on current desktop SERPs into one column poses significant challenges, and Google is experimenting with a few variations. Here's a SERP that has both a Knowledge Panel and a Knowledge Card, for example: In this case, the Knowledge Card showing the support phone number appears above the Knowledge Panel, and both are above the first organic result. You'll notice some design differences on this example, which was captured in July. Here's another example, with a different, more interesting layout: This SERP has a local 3-pack, which is at the top (like on current designs), followed by an organic result, and then followed by the Knowledge Panel. This pushes the Knowledge Panel down the page quite a bit, and the #2 organic result down well below the fold. In another example, we saw a Knowledge Panel below four ads and four organic results. So, the traditional top placement may become more flexible. Here's an example with a Featured Video, followed by a Knowledge Panel, and then the first organic: The bottom of this same SERP has another interesting feature: a set of three different related searches, each with their own card. On the current design, these live at the bottom of the Knowledge Panel, but here they've been split off from the panel and expanded: Keep in mind that these are only variations in testing, and that this testing has been ongoing over a period of months. We can piece together Google's intent from looking at multiple tests, but we can't pin down what the final design will look like or when (or even if) it will launch. Shift #2: Google Now There's another reason I think the card-based design is potentially interesting. Google Now, Google's predictive search product, was built on the \"card\" concept. Here's an Android screenshot: Google Now mixes and matches results of personal interest. On this screen, I've got a Knowledge Graph-style card with an upcoming game time, another KG-style card with a recent box score, and a carousel of news results, all under a topical \"Chicago Cubs\" section header. Here's another Google Now screen: Here, I've got another news carousel (note its similarity to mobile search news carousels), and then an individual news story with its own card. Google Now shows that you can create a result using virtually no traditional organic results and mix multiple Knowledge Graphs, news, and other entities in a single, fluid experience.What does it all mean?Cards are much more than just a design philosophy. We're used to seeing SERPs in clusters: a column of organic results, a Knowledge Panel, a box of news results, a box of local results, etc. Prior to individually-labelled ads, even AdWords ads came in visually-delineated chunks. With cards, we have to start thinking of each individual information unit as a stand-alone result, and every SERP is a mix of the most relevant results across a wide variety of sources and types. Viewing SERPs as collection of search information units (SIUs?) also allows Google to easily adapt across a wide range of displays, from desktop all the way down to wearables, which might only have screen space for a single card. Even voice search can be adapted to cards. Currently, if you run a voice search on Android that returns a Featured Snippet, for example, your mobile device will read that snippet back to you. Voice search is returning one card, a single unit of search information. Cards give Google a great deal of flexibility, and will begin to break traditional design barriers and result groupings. We may see ads leaving top and bottom blocks and being dispersed between other results. We may see a mix of shopping results, say a single product card and a multi-product carousel on the same page. Similarly, we may see multiple news results or carousels across a single page. We may see multiple Knowledge Cards or personalized results, if a search merits that kind of personalization. The era of cards is the final nail in the coffin of ten blue links. Ultimately, our definition of search engine optimization is going to have to expand beyond traditional results and into any information unit that can drive traffic. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google's Future is in the Cards"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google's Future is in the Cards"
    },
    {
      "level": "H2",
      "text": "Shift #1: Mobile-first design"
    },
    {
      "level": "H2",
      "text": "How will it all fit on the left?"
    },
    {
      "level": "H2",
      "text": "Shift #2: Google Now"
    },
    {
      "level": "H2",
      "text": "What does it all mean?"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}