{
  "url": "https://moz.com/blog/google-gives-chris-pirillo-the-no-confidence-vote",
  "slug": "google-gives-chris-pirillo-the-no-confidence-vote",
  "title": "Google Gives Chris Pirillo the No Confidence Vote - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "More sandboxing problems at Google with a big name brand - this time it's Chris Pirillo's TagJag site, which was 301'd several weeks ago from the Gada.be domain. Let's see what the search engines have to say about this high profile move....\nYahoo! (tagjag.com)\n...",
  "content": "Google Gives Chris Pirillo the No Confidence Vote Search Engines By: Rand Fishkin July 19, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 19, 2006 Google Gives Chris Pirillo the No Confidence Vote Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. More sandboxing problems at Google with a big name brand - this time it's Chris Pirillo's TagJag site, which was 301'd several weeks ago from the Gada.be domain. Let's see what the search engines have to say about this high profile move.... Yahoo! (tagjag.com) Pretty good - they know about the domain, and they're ranking the cheerleader tag in 3rd position, which I can respect (though I'm more into the librarian-types myself). I do note that a search for tagjag itself doesn't bring up the site until position 27 (and that result is the cheerleader tag page), so we're seeing a little of Yahoo!'s relatively new sandboxing effect, first noted between 3-5 months ago. MSN (tagjag.com) MSN is doing a terrific job of picking up the new URL, and their results look a little less... shall we say \"high school?\" They're also ranking the URL first for a straight TagJag search - no sandboxing in Redmond (yet). I'm proud of them for giving Chris a little trust. Google (tagjag.com) That's weird... let's check out some other related searches: Gada.be - gives me the same result - no information TagJag - they're not in the top 100 results, and neither is Gada.be Check the headers - nothing wrong there; it's a clean 301 re-direct Site:gada.be - only one result not in supplemental; Google has serious trust issues with Chris. Link Check at Yahoo! - Oh, that explains it... There's only a half million or so links pointing there. No wonder Google doesn't think it's important! Seriously, this ugly sandbox \"we don't trust new domains or 301s\" business is getting mighty old. Let's hope there's a solution in site. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google Gives Chris Pirillo the No Confidence Vote"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google Gives Chris Pirillo the No Confidence Vote"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}