{
  "url": "https://moz.com/blog/google-webmaster-central-an-indepth-review",
  "slug": "google-webmaster-central-an-indepth-review",
  "title": "Google Webmaster Central - An In-Depth Review - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Poor Vanessa Fox, working late on a Friday night. I felt so bad for her, I just had to post this timely review of Google's new Webmaster Central, which is replacing sitemaps (and including its old functionality). There's a lot of material to cover, so let's ...",
  "content": "Google Webmaster Central - An In-Depth Review Search Engines By: Rand Fishkin August 5, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 5, 2006 Google Webmaster Central - An In-Depth Review Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Poor Vanessa Fox, working late on a Friday night. I felt so bad for her, I just had to post this timely review of Google's new Webmaster Central, which is replacing sitemaps (and including its old functionality). There's a lot of material to cover, so let's dive in: Above, we can see the start page for Google Webmaster Central once you've verified a site (this can be done by uploading an HTML file, or by editing a meta tag on the site). Once I'm in, I see both www.seomoz.org and seomoz.org are listed as verified, and there's the additional tools, including report spam and submit a re-iniclusion request. Almost ironic in its dichotomy, eh? Next, we've got the indexing summary page, showing me the variety of problems that Google's had when crawling the SEOmoz.org site. They give you the last crawl date and let me know that I should consider submitting a sitemap and reviewing the files they're having trouble accessing. When we dig a bit deeper, we can see exactly which pages they had trouble crawling, and the errors they received. It looks like Kat's link ninjas photos from earlier this year were disabled, though I'm having no trouble seeing the branding page that's listed first. I like that they also show you when they tried to reach the problematic page. After the web crawl, we can see things like the robots.txt analysis and managing site verification - good features, but basic enough that they don't need in-depth coverage. However, the preferred domain feature is really groovy. Note that I can select to display either SEOmoz.org or www.SEOmoz.org in the SERPs. Hopefully, this also helps with link canonicalization and duplicate content issues that could potentially hurt sites who don't use the 301 re-direct to send url.com to www.url.com (or the reverse). After I clicked \"preferred domain,\" I saw a new link on the menu called \"crawl rate,\" but clicking it just resulted in an error: Those hard-working Googlers just have too much to do... Query stats is one of my favorite features - it's not as in-depth as a good analytics program, but it does show ranking positions, which is very nifty. They also seem relatively accurate, though I saw a few where I can't imagine I ever ranked well for them - i.e. \"no access.\" Additionally, the functionality of monitoring queries from different geographic locations is useful, since it can help you understand your geotargeted rankings and focus in Google's eyes. Crawl stats are also helpful, though I'm in doubt about why the blog would be the highest PageRank page. My guess would have been the beginner's guide, as it's so well linked to off the site, and so popular in what folks are visiting. It's no surprise that the vast majority of pages are very low PR, since there's 1200+ blog entries with only a few inbounds each. Page analysis is interesting since I can see both the types of pages Google sees on the site, and the semantics of what they think the site is about. There's what I most commonly say on the site AND what others are most commonly using to describe me in their anchor text - damn cool. The add a sitemap page is exactly what it sounds like. You can send Google an XML file and they'll use it to crawl the pages on your site they may not have indexed (or may not be crawling frequently enough for your tastes). I'll try to get feedback on how well this is working next time we're part of a big launch. Finally, we've got the index stats, which just link out to the searches - not particularly valuable for savvy SEOs, but certainly interesting to those who don't know how to use these queries. I think that a pop-up question mark describing what each query is showing you would probably add a bit more value for those who are seeking to understand what they're searching. All in all, an amazing system - robust, professional and useful. Great work Vanessa & Amanda (and all of Webmasters Central team). Your new moniker is a bit lengthy for my tastes, but it's certainly a more accurate descriptor of what the \"sitemaps\" part of Google can do. What do you think? Will you be signing up your sites for inclusion? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google Webmaster Central - An In-Depth Review"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google Webmaster Central - An In-Depth Review"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}