{
  "url": "https://moz.com/blog/googles-true-ranking-of-your-site",
  "slug": "googles-true-ranking-of-your-site",
  "title": "Google's True Ranking Of Your Site? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I noticed recently that for one of my sites, http://waste-some-time.com, while I was receiving no visitors from Google for the keyphrase waste some time, I was receiving a few for “wast...",
  "content": "Google's True Ranking Of Your Site? Search Engines B By: bigalreturns March 19, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! B By: bigalreturns March 19, 2007 Google's True Ranking Of Your Site? Search Engines This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I noticed recently that for one of my sites, http://waste-some-time.com, while I was receiving no visitors from Google for the keyphrase waste some time, I was receiving a few for “wast some time”, i.e with a typo. I checked these results out, and as you would expect, Google suggests \"Did you mean ______\", and shows results containing very similar sites to the properly spelled query, but ranked slightly differently. My site is relatively new, and if you believe all you read, then this means it's going to be subjected to some age-related penalisation in the SERPs. It appeared nowhere close to the top for searches “waste some time,” yet is ranked top for “wast some time.” Given that it appears, to all intents and purposes, that Google treats these two queries as one and the same, I propose that the query “wast some time” reflects the results as they would be were an age related penalty, or the sandbox, as it can be called, not in place. These results were obtained several months ago, but although my site now ranks reasonably (#4-#7) for the properly spelled query, it consistently ranks #1 for the mispelled query. I also realise that this is a one off example, and that by no means could it be called a \"fair test,\" but the results are interesting at the least. Do any of you have sites that rank in a similar fashion? Try seeing how your sites rank changes with a mispelled query. Or can you offer an alternative reason behind these results? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google's True Ranking Of Your Site?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google's True Ranking Of Your Site?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "bigalreturns\n          \n            bigalreturns"
}