{
  "url": "https://moz.com/blog/google-wont-remove-that-page-you-dont-like-but-you-or-your-seo-can",
  "slug": "google-wont-remove-that-page-you-dont-like-but-you-or-your-seo-can",
  "title": "Google Won't Remove that Page You Don't Like, But You (or Your SEO) Can - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Google's head of web spam (a division of the engine's search quality division) recently posted a piece entitled, Why Google Won't Remove that Page You Don't Like. An excerpt:\n\nEvery few weeks or so, someone contacts me and says “Hey Matt, there’s page out on ...",
  "content": "Google Won't Remove that Page You Don't Like, But You (or Your SEO) Can Search Engines By: Rand Fishkin March 4, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 4, 2009 Google Won't Remove that Page You Don't Like, But You (or Your SEO) Can Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Google's head of web spam (a division of the engine's search quality division) recently posted a piece entitled, Why Google Won't Remove That Page You Don't Like. An excerpt: Every few weeks or so, someone contacts me and says “Hey Matt, there’s page out on the web about me that I really don’t like. Is there any way to remove it from Google’s index?” People don’t usually say it like that. More likely, they say “There’s this person making crazy claims about me on the web, and the stuff they say is just off-the-wall. Can Google remove this crazy person’s page?” In a standard follow-up email, two options for removal are offered: The best actions for you from our perspective can be one of a couple options. Either contact whoever put up webpage B and convince them to modify or to take the page down. Or if the page is doing something against the law, get a court to agree with you and force webpage B to be removed or changed. We really don’t want to be taking sides in a he-said/she-said dispute, so that’s why we typically say “Get the page fixed, changed, or removed on the web and then Google will update our index with those changes the next time that we crawl that page.” Unmentioned in the post is a third method - one that involves a lot of hard work, diligence and often, high expense, but it's usable and useful for businesses and individuals who run into this issue. In the SEO field, we call it \"reputation management.\"A reputation management campaign has three basic components: Identify which search queries (keywords) produce prominently listed, undesirable results (typically this is only the top 10 - aka Page 1) Create content on multiple sites with the intention of outranking the negative content (remember that, in general, Google will only list a maximum of two pages from a single domain on a given results page) Optimize those pages with content & links to achieve rankings higher than the negative content, thus \"pushing it down\" to the 2nd page of results (or further) This is generally considered one of the toughest tasks in the SEO field. You're not only fighting for rankings on (up to) 10 different sites/pages or more, you're also competing against what many feel is a strong algorithmic component in Google's engine - QDD (Query Deserves Diversity). QDD is believed to impact the types of results Google prefers to show ranking in the top 10, and biases away from strict algorithmic \"strength\" (i.e., link juice, anchor text, optimization) and towards showing a variety of different pages (positive and negative sentiment analysis is suspected by some to be a component here, hence the potential impact on reputation management campaigns).So, how do you do it? How can you create content to successfully outrank a negative result?First off, you'll want to leverage as many positive \"pre-existing\" conditions as possible. These include: Exact Keyword Term/Phrase Domain Name Matches By owning/optimizing a keyword-match domain name, you leverage the inherent boost these sites receive in Google's ranking algorithm. For example, if someone were writing mean things about the author F. Scott Fitzgerald and I were running the reputation management campaign, I'd certainly push for optimization/ranking of the domain fscottfitzgerald.com to be part of the strategy. This is valuable only to a point, though, as it appears (in campaigns we've worked on and talked to other about) that it's much harder to rank multiple sites of this ilk (for example, having fscottfitzgerald.net, fscottfitzgerald.info, etc). Authority Domains Using or creating content on high value, authoritative domains like Facebook, MySpace, LinkedIn, Twitter and other user-generated-content portals can be a very powerful strategy. You not only leverage the pre-existing strength of the domain for getting that content crawled and indexed, but can lean on the \"authoritative domain\" bias that Google shows in their rankings. Note - don't use Wikipedia for this, as they are more likely to find & report the negative pieces (if it's a prominent name/brand worthy of inclusion) or simply delete the article (if it isn't). Pages Already Ranking Well for the Query In most cases where reputation management is necessary, there are already pages ranking in the top 10-20 results that are positive or neutral in content and therefore potential targets for optimization. Although you may not control these pages or be able to optimize on-page factors, pointing links with optimized anchor text to them can nudge up their rankings and help you achieve your goal. From these three basic tenets, you can form the basis for the list of tactics employed to start a reputation management campaign, but there are a number of other smart methodologies I like, including: Press releases that actually get picked up by major media and wire services Pay-per-post blogging that leverages the keywords in the title of the posts (not to be used for link acquisition, as this can get you penalized) Creating linkbait that leverages the keyword terms/phrases (this doesn't have to be on your site or even use the subject matter) Sponsoring charitable donations in \"honor\" of the brand/person's name that will get press attention Build multimedia content that can potentially get listed in vertical results (videos & news results are typically most effective) Because reputation management campaigns are so tremendously challenging, you should be prepared for exorbitant costs. We've pitched contracts in excess of $100,000 for these types of services (obviously, not many takers), and know other firms regularly charge $50,000 and up. Even at those price points, the expenses can outweigh the work done. In a pay-for-performance contract from an industry colleague, they charged over $80,000 but ended up losing money on the deal as the time, effort and expenses added up to nearly $100,000.I was asked recently what I'd do if I had unlimited budget for a reputation management contract. My answer - pay for a Hollywood film to be created titled with the keywords/name that needed the push. At times, the best attack is simply to go around the problem :-)Some good additional resources include: 10 Ways to \"Own Yourself Online\" from Todd Malicoat 10 Strategies for Fixing Negative Google Results from Andy Beal Make it Look Natural from Joost De Valk Tips for Rep Management from Chris Bennet 8 Tactics for Rep Management the Easy Way from Jaan Kanellis Sometimes, you can pursue one of the strategies Google recommends (or simply avoid trouble on the web), but if not, reputation management SEO is always an option. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google Won't Remove that Page You Don't Like, But You (or Your SEO) Can"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google Won't Remove that Page You Don't Like, But You (or Your SEO) Can"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}