{
  "url": "https://moz.com/blog/google-local-out-of-date-riddled-with-spam-but-absolutely-worth-it",
  "slug": "google-local-out-of-date-riddled-with-spam-but-absolutely-worth-it",
  "title": "Google Local - Out of Date, Riddled with Spam But Absolutely Worth It - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Hello hello, today I'm going to talk a little about Google Local. The things I'm talking about aren't necessarily new or ground-breaking, but I think it's important to expose them to the Moz readership as Local isn't something that's talked about all that often on here and there are quite a few…",
  "content": "Google Local - Out of Date, Riddled with Spam But Absolutely Worth It Local SEO T By: Tom Critchlow June 1, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! T By: Tom Critchlow June 1, 2009 Google Local - Out of Date, Riddled with Spam But Absolutely Worth It Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Hello hello, today I'm going to talk a little about Google Local. The things I'm talking about aren't necessarily new or ground-breaking, but I think it's important to expose them to the Moz readership as Local isn't something that's talked about all that often on here and there are quite a few intricacies which you should be aware of when dealing with local optimisation, particularly for clients who have many locations and who rely on using a bulk upload to Google Local. Before I go any further, there's some really, really smart people who talk about Google Local optimisation and I've been chatting with them recently - I strongly recommend that you check out the further reading at the bottom of this post as they go into a lot more detail about a lot of this stuff than I do (and they probably know more about it than I do too!). Why Do You Care About Google Local? There are two reasons to care about Google Local. The first is unbranded traffic. The second is branded traffic. 1) Unbranded Traffic Over the past 6 months or so Google has become incredibly aggressive with displaying local results in the main listings. These almost always come in the form of a 10-result one-box (kind of like a 10-box, I suppose). It used to be the case that you had to refine your query with a location before you saw any Google Local results, such as Hotels in Leeds: Notice how this 10-box is the very first result that users see - even appearing 3rd or 4th in the 10-box can generate more clicks than a #1 ranking in the organic results just below. That's pretty staggering. That means that for these super competitive travel queries, if you want traffic you need to be optimising for the 10-box before you think about optimising for the regular organic listings. But wait, trouble is on the horizon because Google is becoming even more aggressive with its 10-boxing and it's starting to display 10-boxes on regular search results without a geographical modifier if Google knows where you're searching from. Take, for example, a search for 'IT support' which generates the following result for me: Notice that handy 10-box slipping into the results without me specifying my geographical location? Scary, huh. So in short, generic competitive queries are generating 10-boxes. If you want to grab that head traffic then you'd best go about some Google Local optimisation pretty quick. 2) Branded Traffic Ok sure, generic queries are generating 10-boxes so that gives me some potential to aim for, but surely my navigational branded search queries are safe, right? Right?! Unfortunately not; take a look at this search for \"napoleons casino leeds\" (one of my old poker haunts), which generates a local listing above the regular organic result: Well that's ok, right? Surely that local result is controlled by me? You would think so, wouldn't you, but actually in many cases that's not true. Keep reading below for examples of when this goes wrong. So that covers WHY you should care about Google Local - now let's cover some of the issues. Issues with Google Local Here are a few of the common issues I have come across dealing with Google Local Spam, and Lots of It I recently did an analysis of the top 10 hotel searches in the US as determined by the Google Search Suggest (I know, pretty unscientific but I wanted a random snap shot): I then analysed the 10 results in the 10-box for each search result - a total of 100 local results - and found that 15 of them were spammed in one of the following ways: Spam in the main index: Take a look at this 10-box from 'hotels in boston'. Can anyone spot the odd one out? Yeah, of course the last one, which is a locksmith rather than a hotel. Easy. The real question is, how many of you spotted the other odd one out? Look at D carefully - you see that the listing appears correctly - it's for the Club Quarters Hotel, which is indeed located in Boston, but the URL actually sends you to www.elephantcastle.com (which, incidentally, is a chain of bars which has a location in Boston; it's not the website for the tube station in London). The reason for this occurrence is that the Elephant & Castle bar and the Club Quarters Hotel have the same address - and Google is trying to merge the listings and doing a pretty poor job of it. Spam in the details of the Google Local Index: Take a look at result C - you see that the hotel listing appears correct but the URL is www.cheap-hotels.usa.net. This certainly isn't a case of merging listings since the www.cheap-hotels-usa.net URL isn't a genuine site. So why does this spam happen? Well, it gets even worse - click through to the details (by clicking on the reviews link) and you see this: It's a pretty strange listing - not only is the official website not listed, neither is the cheap-hotels-usa site. Instead, it's now linking to a spam blog on blogspot. Why is this? Well, the reason is that there's an edit button on the listing. And that leads to a free text edit of the Google Local information, including the URL. I'm really not sure why Google allows this free edit - in the past they've come out and said that the majority of edits are genuine and that may be true for niche small stores, but for the main competitive terms it's just overrun with spam. There's a few weeks delay on the data that gets edited here feeding back into the main Google Local index which gets displayed in the 10-box, which is why the cheap-hotels-usa URL is still being used in the 10-box. Here's the shocking part - if you own a hotel chain and submit a bulk upload to Google Local, this bulk upload isn't trusted enough to prevent this free text edit function being displayed for your hotel. Language So Google Local, which you'd think would be designed to handle local queries, actually sucks really badly at local language searches. The problem is that, as far as I can see, there's only one Google Local index worldwide compared to all the local indexes you get for google.co.uk, google.fr, google.com, etc. This manifests itself in a few ways, but the most important one is this - only one language version of a page can be listed in Google Local. So if I search for \"madrid hotel\" in google.co.uk: And google.es: You see that I get a combination of .com (English) and .es (Spanish) results. This is handled reasonably well because there's a leaning towards .es sites in google.es. Cool! But the problem comes when you have two versions of the same content in different languages; whether it's on a subdomain, subfolder or local TLD, it doesn't matter to Google Local -- you can only have one listing for one location. So the Hotel Regente in the above example (which has multiple languages on the site) can only ever rank with the Spanish homepage, even for searches in the UK, in English. That sucks, right? I really wish there was a way to fix this - Google is really good at detecting this in the regular SERPs, so it'd be great to roll that language/geotargeting detection into the Google Local indexes as well. Verification This is the third issue and it relates to the above issues. If you have a large number of geographical locations (physical stores or hotels, for example), then registering them individually can be a real pain. Imagine having to coordinate hundreds of different local verifications all with consistent data and accurate information. But you don't need to do that, right? Surely you can just submit a bulk upload? Well you CAN, but as shown above a bulk upload just isn't that trusted by Google, so the only option is to verify them individually which is nigh on impossible if you have many, many locations... Advice So what's the point of this post? Well, it's two-fold. Firstly, it's to highlight some of the issues Google Local is facing at the moment so that you can understand better how to optimise your site (or your client's sites). Secondly, it's to offer a few tips which you can start mulling over and hopefully put into practice: 1) Don't rely on a bulk upload unless you have to Given the ability of webmasters to edit local listings and given the relatively untrusted nature of the bulk upload, I urge you to try and register individually the locations/properties you want in Google Local. 2) Only create one listing for each individual location Even if you have multiple language pages or multiple properties at the same location, ensure that only one of them is registered with Google Local. At the moment they're not good at handling businesses with the same address. 3) Think about using KML Geositemaps if you have many locations If it's unfeasible to register all of your properties individually (or even while you're putting that process in place), consider using a Geositemap since this should be more trusted than the bulk upload, as it relies on the same sitemap file verification process which is intrinsically more trusted than the upload process since it's tied to your domain. Further Reading And last but not least, if you want to know more about Google Local, consult these resources as they cover a lot of the issues I've touched upon in a lot more detail! Mike Blumenthal's Blog on everything to do with Google Local David Mihm's 2009 Local Search Ranking Factors Matt McGee's Blog on all things Local Martijn Beijk's blog Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google Local - Out of Date, Riddled with Spam But Absolutely Worth It"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google Local - Out of Date, Riddled with Spam But Absolutely Worth It"
    },
    {
      "level": "H1",
      "text": "Why Do You Care About Google Local?"
    },
    {
      "level": "H2",
      "text": "1) Unbranded Traffic"
    },
    {
      "level": "H2",
      "text": "2) Branded Traffic"
    },
    {
      "level": "H1",
      "text": "Issues with Google Local"
    },
    {
      "level": "H2",
      "text": "Spam, and Lots of It"
    },
    {
      "level": "H2",
      "text": "Language"
    },
    {
      "level": "H2",
      "text": "Verification"
    },
    {
      "level": "H1",
      "text": "Advice"
    },
    {
      "level": "H2",
      "text": "1) Don't rely on a bulk upload unless you have to"
    },
    {
      "level": "H2",
      "text": "2) Only create one listing for each individual location"
    },
    {
      "level": "H2",
      "text": "3) Think about using KML Geositemaps if you have many locations"
    },
    {
      "level": "H1",
      "text": "Further Reading"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Tom Critchlow\n          \n            Tom Critchlow\n          \n            Tom Critchlow"
}