{
  "url": "https://moz.com/blog/googles-next-move-movie-screen-advertising",
  "slug": "googles-next-move-movie-screen-advertising",
  "title": "Google's Next Move: Movie Screen Advertising - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Google is quickly becoming the world's largest ad agency, now entering print ads in newspapers and radio ads across the world...",
  "content": "Google's Next Move: Movie Screen Advertising Search Engines M By: Michael Jensen May 10, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! M By: Michael Jensen May 10, 2007 Google's Next Move: Movie Screen Advertising Search Engines This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Google is quickly becoming the world's largest ad agency, now entering print ads in newspapers and radio ads across the world's soundwaves. What's their next move? Movie Screen Advertising The Scenario You've arrived 20 minutes early to that summer hit movie, popcorn and drink in hand. You've just fumbled with your cell phone but now you're bored so you look up at the screen. Some trivia and quotes from different movie stars entertain you for a few minutes until they cycle again. In the mix, though, is an advertisement from a local dentist, or from a major car company highlighting the features of their new vehicle. You see the ads twice, then the lights go out completely and the movie previews begin. The Ad Medium This is a pretty standard experience at a theater. This medium is fantastic for branding...you've got a whole theater of people who make enough money to watch an $8-12 movie sitting in the direction of your advertisement with little else to do than look at the screen. Some stats on cinema advertising show that there is a high level of retention compared to TV. The Advantages Besides the high retention of an audience with money to spend, you can easily target age groups, gender, and other \"people types\" based on the type of movie. If you are selling a new toy, target the ads to only G rated movies. If you are selling subscriptions to a sports site, target the ads to action, horror, sports, or other films that may have more men, or married women likely to influence men. If you want to target women, target to \"Sense and Sensibility\" movies (I admit however, I enjoyed the newest one...). The other strong advantage is local advertising. If you're promoting a local business/web service, you can target your ads to locals in cities, counties, states, or regions. Most people that see movies see them at their local theaters. Video ads are being shown at higher end theaters across the country, which is also a perfect fit for Google. Get on the big screen without going to Hollywood! The Barriers Yes, there are some problems with Google getting into cinema advertising. First, right now most theaters use slides for the ads. That's not practical for an ad from your Adwords account. Many theaters are migrating to digital projectors, which would solve this issue. Digital projectors would also allow for video ads to be shown. Second, the spots are done either weekly or monthly and are the same for all theaters in the complex, both a G and PG movie. Ideally you would be able to run it for just a few days (budget limited) or for the opening weekend of a certain movie. With digital projectors, and a software tool that Google could build, they could handle both direct advertisers (like theaters have now) as well as Google advertisers. Just remember you heard it from me first. Google will be moving into a theater near you sometime soon. The nice thing is, you (and your site) will be able move into a theater near you, too. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google's Next Move: Movie Screen Advertising"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google's Next Move: Movie Screen Advertising"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Michael Jensen\n          \n            Michael Jensen"
}