{
  "url": "https://moz.com/blog/google-pagerank-still-relevant-after-all-these-years",
  "slug": "google-pagerank-still-relevant-after-all-these-years",
  "title": "Google PageRank: Still Relevant After All These Years - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When Larry Page and Sergey Brin invented the PageRank algorithm way back in the late 90s, they struck gold and were smart enough to found Google to capitalize on its very real potential to change search. For many years Google even told us the PageRank number for each web page...",
  "content": "Google PageRank: Still Relevant After All These Years Technical SEO By: Jonathan Gouveia June 14, 2011 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Jonathan Gouveia June 14, 2011 Google PageRank: Still Relevant After All These Years Technical SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. When Larry Page and Sergey Brin invented the PageRank algorithm way back in the late 90s, they struck gold and were smart enough to found Google to capitalize on its very real potential to change search. For many years Google even told us the PageRank number for each web page on the Internet via the Google Toolbar and later in Webmaster Tools. We grew to love PageRank and, as a profession, we SEOs started placing too much importance on it as a ranking factor. In recent years, the pendulum has swung in the opposite direction with people like my friend Mike Volpe declaring that \"Google PageRank is now irrelevant\". And Mike is in good company. In this post, I take the contrary point of view and argue that, in fact, Google PageRank is still relevant after all these years. Toolbar PageRank vs. Real PageRank First let's distinguish between the number Google gives us in the Google toolbar and the real PageRank Google uses in its complex algorithm. Toolbar PR is notoriously out of date being only updated a couple times a year according to Google. That makes it only marginally useful at best. Let's also admit here that we don't know the real PageRank in anything like real time, (though we can approximate it with similar algorithms like the SEOMoz mozRank – more on that later). So what is left to argue about? Well let's look at some pesky facts. An Inconvenient Truth Facts are hard to come by in the SEO business, but every once in a while we are fortunate enough to stumble across some. In a recent SEOMoz study of factors that are correlated with ranking well in Google, the fact is that Domain mozRank is closely correlated with ranking well (see slide 22). Now as Rand Fishkin points out, correlation does not prove causality. Nonetheless, if PageRank is no longer relevant then why would there be such a strong correlation with mozRank? I would humbly submit that Google never scrapped the PageRank algorithm. In fact, Google states that clearly in their Technology Overview: \"Today we use more than 200 signals, including PageRank, to order websites\". They very likely modified it to incorporate the concept of TrustRank, but why would they throw the PageRank part out when it is based on sound concepts? If they did then why is Google still concerned with those that \"game the system\" by paying for links from not-so-trustworthy sites? Seems to me that PageRank must be alive and well deep inside the Google algorithm. PageRank is an Algorithm not a Metric Some people confuse the PageRank algorithm for a metric. Since it can't really be measured with any confidence, it can't serve as a metric. Enter SEOMoz with their similar algorithm mozRank which is updated frequently enough to be useful as a metric. You can read all about mozRank on the SEOMoz site. Understanding how PageRank the algorithm works can still be useful to us. In a related post, I run through some calculations using the original PageRank formula to show how PageRank flows within different website linking topologies. While the examples might be simple the same method of calculation can be applied to larger topologies and inform decisions about website link structure. PageRank Doesn't Apply to Social Media Given the rapid rise of social media and its influence on our thinking, Google had to find a way to incorporate these social signals into its algorithm. Now we know that Google looks at social signals like the number of retweets, author authority, author quality, etc (as does Bing). We don't know how Google is integrating these signals into the main Google algorithm but in the same SEOMoz report mentioned above its clear that social signals do influence regular web page rankings. So the fact that Google is now using social signals to rank plain old web pages doesn't mean that they aren't using PageRank as well. It's also clear that social media pages/tweets are now showing up in the SERPs for certain types of queries – but certainly not all types of queries and I would argue not for the vast majority of queries. Thus, the premise that Google doesn't use PageRank for social media pages/tweets, while it might be true, is still not that important when you look at the small number of queries that actually have them in the SERPs. PageRank Lets the Cream Rise to the Top PageRank helps us find more relevant results using the idea that there is an implied endorsement when someone goes to the trouble of linking to another page. Since PageRank is a logarithmic scale, it separates the upper echelon of websites from the rest. In a world where thousands of new websites are churned out every day, PageRank still has the ability to let the cream rise to the top. The higher you're PageRank, the more difficult it is to improve it. Also, it grows with the evolving nature of the web. As the internet grows, PageRank adapts at scale. It's a brilliant formula really. What To Do With PageRank If PageRank is still relevant, what should we do about it? Well, here I agree with Mike Volpe that we still need to focus on building compelling optimized content that will attract links and rank well so it can then attract visitors to our websites who will convert to leads and eventually become customers. That is, after all, why we SEOs do what we do. Understanding the nature of PageRank and how it flows in a website linking structure can help us optimize information architectures. Using metrics like mozRank can also help us identify attractive linking partners and thereby prioritize our link-building efforts that in turn promote our great content. Further Research: Matt Cutts post on sculpting PageRank with nice intro about how PageRank flows Rand Fishkin's Whiteboard Friday post about how to think of “link juice” Google Webmaster Central video with Matt Cutts describing how PageRank flows from Facebook and Twitter Correlation between mozRank and PageRank post by Nick Gerner What do you think – is PageRank still relevant? I welcome your comments and will do my best to respond in a timely fashion. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google PageRank: Still Relevant After All These Years"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google PageRank: Still Relevant After All These Years"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jonathan Gouveia\n          \n            Jonathan Gouveia"
}