{
  "url": "https://moz.com/blog/google-analytics-referral-traffic-get-some-really-granular-data-using-utm",
  "slug": "google-analytics-referral-traffic-get-some-really-granular-data-using-utm",
  "title": "Google Analytics Referral Traffic: Get Some Really Granular Data Using UTM - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We have been using Google Analytics for over a year now and I admit there is lots of stuff that I have squint my eyes at and ask myself how it could possibly make sense. Lots of stuff, that is, except the greatest little trick in the world that I have been using for about the same amount of time.…",
  "content": "Google Analytics Referral Traffic: Get Some Really Granular Data Using UTM SEO Analytics C By: CyndiK February 26, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! C By: CyndiK February 26, 2008 Google Analytics Referral Traffic: Get Some Really Granular Data Using UTM SEO Analytics This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. We have been using Google Analytics for over a year now, and I admit there is a lot of stuff that I squint my eyes at and ask myself how it could possibly make sense. Lots of stuff, that is, except the greatest little trick in the world that I have been using for about the same amount of time. Google Analytics has a parameter tag known as UTM. Sorry, couldn’t tell you what it stands for, but I still love it. The UTM parameter allows you to build a custom unique link to put onto ads, email campaign links, and other inlinks in which you can define the source, campaign, and medium (more granular detail is also possible). This traffic is displayed separately in plain language (your own words, as a matter of fact!) in Google Analytics in the Campaigns section and easily identifies the referral traffic from these individual sources. No more www.somewhereonanothersite.com/referral aggregates when you are running several campaigns and creatives. I have even given custom URLs to different parts of an individual creative to test the effectiveness of working and different parts. For instance, I would create slightly different URLs with different UTM parameters for the Headline, Main Body, and Call to Action links. They would all end up on the same page, but it provides measurable data and feedback on which combinations work best. Now for the downside. It creates quite a long UR, that makes it pretty much “bad” to use (in plain text emails, for instance). The only other concern is that if a user is distrustful of clicking on links, they may choose to go directly to your URL, which would count them as part of the aggregate of direct traffic and not as a specific referral. Being of the marketing persuasion and NOT of the technical sort, I have been using a really great tool to generate these URLs. I’m not meaning to advertise for these guys and I don’t work there, but they do provide this took free to people like me and it’s really useful and easy to understand. ...and I still don’t know what UTM stands for…! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google Analytics Referral Traffic: Get Some Really Granular Data Using UTM"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google Analytics Referral Traffic: Get Some Really Granular Data Using UTM"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "CyndiK\n          \n            CyndiK"
}