{
  "url": "https://moz.com/blog/googles-august-1st-core-update-week-1",
  "slug": "googles-august-1st-core-update-week-1",
  "title": "Google's August 1st Core Update: Week 1 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "One week after the August 1st core update, it's clear that this was a big one. We dive into the impact, including winners and losers, and whether there's a connection to the health and wellness industry.",
  "content": "Google's August 1st Core Update: Week 1 Search Engines By: Dr. Peter J. Meyers August 9, 2018 Table of Contents Copied! By: Dr. Peter J. Meyers August 9, 2018 Google's August 1st Core Update: Week 1 Search Engines On August 1, Google (via Danny Sullivan's @searchliaison account) announced that they released a \"broad core algorithm update.\" Algorithm trackers and webmaster chatter confirmed multiple days of heavy ranking flux, including our own MozCast system: Temperatures peaked on August 1-2 (both around 114°F), with a 4-day period of sustained rankings flux (purple bars are all over 100°F). While this has settled somewhat, yesterday's data suggests that we may not be done. August 2nd set a 2018 record for MozCast at 114.4°F. Keep in mind that, while MozCast was originally tuned to an average temperature of 70°F, 2017-2018 average temperatures have been much higher (closer to 90° in 2018). Temperatures by Vertical There's been speculation that this algo update targeted so called YMYL queries (Your Money or Your Life) and disproportionately impacted health and wellness sites. MozCast is broken up into 20 keyword categories (roughly corresponding to Google Ads categories). Here are the August 2nd temperatures by category: At first glance, the \"Health\" category does appear to be the most impacted. Keywords in that category had a daily average temperature of 124°F. Note, though, that all categories showed temperatures over 100°F on August 1st – this isn't a situation where one category was blasted and the rest were left untouched. It's also important to note that this pattern shifted during the other three days of heavy flux, with other categories showing higher average temperatures. The multi-day update impacted a wide range of verticals. Top 30 winners So, who were the big winners (so far) of this update? I always hesitate to do a winners/losers analysis – while useful, especially for spotting patterns, there are plenty of pitfalls. First and foremost, a site can gain or lose SERP share for many reasons that have nothing to do with algorithm updates. Second, any winners/losers analysis is only a snapshot in time (and often just one day). Since we know that this update spanned multiple days, I've decided to look at the percentage increase (or decrease) in SERP share between July 31st and August 7th. In this analysis, \"Share\" is a raw percentage of page-1 rankings in the MozCast 10K data set. I've limited this analysis to only sites that had at least 25 rankings across our data set on July 31 (below that the data gets very noisy). Here are the top 30... The first column is the percentage increase across the 7 days. The final column is the overall share – this is very low for all but mega-sites (Wikipedia hovers in the colossal 5% range). Before you over-analyze, note the second column – this is the percent change from the highest July SERP share for that site. What the 7-day share doesn't tell us is whether the site is naturally volatile. Look at Time.com (#27) for a stark example. Time Magazine saw a +19.5% lift over the 7 days, which sounds great, except that they landed on a final share that was down 54.4% from their highest point in July. As a news site, Time's rankings are naturally volatile, and it's unclear whether this has much to do with the algorithm update. Similarly, LinkedIn, AMC Theaters, OpenTable, World Market, MapQuest, and RE/MAX all show highs in July that were near or above their August 7th peaks. Take their gains with a grain of salt. Top 30 losers We can run the same analysis for the sites that lost the most ground. In this case, the \"Max %\" is calculated against the July low. Again, we want to be mindful of any site where the 7-day drop looks a lot different than the drop from that site's July low-point... Comparing the first two columns, Verywell Health immediately stands out. While the site ended the 7-day period down 52.3%, it was up just over 200% from July lows. It turns out that this site was sitting very low during the first week of July and then saw a jump in SERP share. Interestingly, Verywell Family and Verywell Fit also appear on our top 30 losers list, suggesting that there's a deeper story here. Anecdotally, it's easy to spot a pattern of health and wellness sites in this list, including big players like Prevention and LIVESTRONG. Whether this list represents the entire world of sites hit by the algorithm update is impossible to say, but our data certainly seems to echo what others are seeing. Are you what you E-A-T? There's been some speculation that this update is connected to Google's recent changes to their Quality Rater Guidelines. While it's very unlikely that manual ratings based on the new guidelines would drive major ranking shifts (especially so quickly), it's entirely plausible that the guideline updates and this algorithm update share a common philosophical view of quality and Google's latest thinking on the subject. Marie Haynes' post theorizing the YMYL connection also raises the idea that Google may be looking more closely at E-A-T signals (Expertise, Authoritativeness and Trust). While certainly an interesting theory, I can't adequately address that question with this data set. Declines in sites like Fortune, IGN and Android Central pose some interesting questions about authoritativeness and trust outside of the health and wellness vertical, but I hesitate to speculate based only on a handful of outliers. If your site has been impacted in a material way (including significant traffic gains or drops), I'd love to hear more details in the comments section. If you've taken losses, try to isolate whether those losses are tied to specific keywords, keyword groups, or pages/content. For now, I'd advise that this update could still be rolling out or being tweaked, and we all need to keep our eyes open. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google's August 1st Core Update: Week 1"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google's August 1st Core Update: Week 1"
    },
    {
      "level": "H2",
      "text": "Temperatures by Vertical"
    },
    {
      "level": "H2",
      "text": "Top 30 winners"
    },
    {
      "level": "H2",
      "text": "Top 30 losers"
    },
    {
      "level": "H2",
      "text": "Are you what you E-A-T?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}