{
  "url": "https://moz.com/blog/google-instant-previews-is-this-the-final-nail-in-a-coffin-for-flash",
  "slug": "google-instant-previews-is-this-the-final-nail-in-a-coffin-for-flash",
  "title": "Google Instant Previews - The Nail in the Coffin for Flash? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In recent years both Google and Apple have been strong advocates of HTML5 - a new HTML standard which includes features like video playback and drag-and-drop. Many believe that HTML5 will be a replacement for third-party browser plug-ins such as Adobe Flash and Microsoft Silverlight.\nGoogle has…",
  "content": "Google Instant Previews - The Nail in the Coffin for Flash? Design D By: Dominic Gluchowski December 8, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! D By: Dominic Gluchowski December 8, 2010 Google Instant Previews - The Nail in the Coffin for Flash? Design This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. In recent years both Google and Apple have been strong advocates of HTML5 - a new HTML standard which includes features like video playback and drag-and-drop. Many believe that HTML5 will be a replacement for third-party browser plug-ins such as Adobe Flash and Microsoft Silverlight. Google has just introduced Google Instant Previews where the websites can be previewed straight from Google's search engine page. Google claims that this new feature makes searchers 5% more likely to be satisfied with the results they click. Interestingly enough, Google Instant Previews does not show a number of flash sites including those of Pepsi, SAAB, Jeep Australia, and HBO, just to name a few. However, there are exceptions such as Insure My Ride and Jeep USA. Despite this, even with Jeep USA, Google shows only the start of the Flash animation, which means that the preview page is almost blank. In addition, Google Instant Previews does not display Flash components on websites, i.e. the main banner on disney.go.com. I'm not a website developer, and I'm definitely not a flash expert, so I would love for someone to help me understand why Google displays certain flash sites and not others eg. Insure My Ride? Examples of Google Instant Previews Flash failures: Pepsi SAAB JEEP Australia HBO Disney Examples of working Flash Google Instant Previews: Insure My Ride: Jeep Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google Instant Previews - The Nail in the Coffin for Flash?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google Instant Previews - The Nail in the Coffin for Flash?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dominic Gluchowski\n          \n            Dominic Gluchowski\n          \n            Dominic Gluchowski"
}