{
  "url": "https://moz.com/blog/google-may-use-your-behavior-to-impact-search-rankings-whiteboard-friday",
  "slug": "google-may-use-your-behavior-to-impact-search-rankings-whiteboard-friday",
  "title": "How Google May Use Searcher, Usage, & Clickstream Behavior to Impact Rankings - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The amount of data Google has about our habits on the web is absolutely astounding. In today's Whiteboard Friday, Rand explores the implications of a recent patent, offering views into how they might be using that data.",
  "content": "How Google May Use Searcher, Usage, & Clickstream Behavior to Impact Rankings Search Engines | Whiteboard Friday By: Rand Fishkin June 25, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin June 25, 2015 How Google May Use Searcher, Usage, & Clickstream Behavior to Impact Rankings Search Engines | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. A recent patent from Google suggests a new kind of influence in the rankings that has immense implications for marketers. In today's Whiteboard Friday, Rand discusses what it says, what that means, and adds a twist of his own to get us thinking about where Google might be heading. For reference, here's a still of this week's whiteboard. Click on it to open a high resolution image in a new tab! Video TranscriptionHowdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week let's chat about some things that Google is learning about web searchers and web surfers that may be impacting the rankings. I was pretty psyched to see a patent a few weeks ago that had been granted actually to Google, so filed a while before that. That patent came from Navneet Panda who, as many in the SEO space may remember, is also the engineer for whom Panda, the Panda Update from Google, is named after. Bill Slawski did a great analysis of the patent on his website, and you can check that out, along with some of the other patent diagrams themselves. Patents can be a little confusing and weird, especially the language, but this one had some surprising clarity to it and some potentially obvious applications for web marketers too. Deciphering searcher intentSo, in this case, Googlebot here -- I've anthropomorphized him, my Googlebot there, nicely -- is thinking about the queries that are being performed in Google search engine and basically saying, \"Huh, if I see lots of people searching for things like 'find email address,' 'email address tool,' 'email finder,' and then I also see a lot of search queries similar to those but with an additional branded element, like 'VoilaNorbert email tool' or 'Norbert email finder' or 'how to find email Norbert,' or even things like 'email site:voilanorbert.com,'\" Googlebot might actually say, \"Hmm, lots of searchers who look for these kinds of queries seem to be also looking for this particular brand.\" You can imagine this in tons and tons of ways. Lots of people searching for restaurants also search for Yelp. Lots of people searching for hotels also add in queries like \"Trip Advisor.\" Lots of people searching for homes to buy also add in Zillow. These brands that essentially get known and combined and perform very well in these non-branded searches, one of the ways that Google might be thinking about that is because they see a lot of branded search that includes the unbranded words around that site. Google's site quality patentIn Panda's site quality patent -- and Navneet Panda wasn't the only author on this patent, but one of the ones we recognize -- what's described is essentially that this algorithm, well not algorithm, very simplistic equation. I'm sure much more than simplistic than what Google's actually using if they are actually using this. Remember, when it comes to patents, they usually way oversimplify that type of stuff because they don't want to get exactly what they're doing out there in the public. But they have this equation that looks like this: Number of unique searchers for the brand or keyword X -- so essentially, this is kind of a searches, searchers. They're trying to identify only unique quantities of people doing it, looking at things like IP address and device and location and all of that to try and identify just the unique people who are performing this -- divided by the number of unique searches for the non-branded version. So branded divided by non-branded equals some sort of site quality score for keyword X. If a lot more people are performing a search for \"Trip Advisor + California vacations\" than are performing searches for just \"California vacations,\" then the site quality score for Trip Advisor when it comes to the keyword \"California vacations\" might be quite high. You can imagine that if we take another brand -- let's say a brand that folks are less familiar with, WhereToGoInTheWorld.com -- and there's very, very few searches for that brand plus \"California vacations,\" and there's lots of searches for the unbranded version, the site quality score for WhereToGoInTheWorld.com is going to be much lower. I don't even think that's a real website, but regardless. Rand's theory Now, I want to add one more wrinkle on to this. I think one of the things that struck me as being almost obvious but not literally mentioned in this specific patent was my theory that this also applies to clickstream data. You can see this happening obviously already in personalization, personalized search, but I think it might be happening in non-personalized search as well, and that is essentially through Android and through Chrome, which I've drawn these lovely logos just for you. Google knows basically where everyone goes on the web and what everyone does on the web. They see this performance. So they can look and see the clickstream for a lot of people's process is a searcher goes and searches for \"find email address tool,\" and then they find this resource from Distilled and Distilled mentions Rob Ousbey's account -- I think it was from Rob Ousbey that that original resource came out -- and they follow him and then they follow me and they see that I tweeted about VoilaNorbert. Voila, they make it to VoilaNorbert.com's website, where their search ends. They're no longer looking for this information. They've now found a source that sort of answers their desire, their intent. Google might go, \"Huh, you know, why not just rank this? Why rank this one when we could just put this there? Because this seems to be the thing that is answering the searcher's problem. It's taking care of their issue.\" So what does this mean for us?This is tough for marketers. I think both of these, the query formatting and the potential clickstream uses, suggest a world in which building up your brand association and building up the stream of traffic to your website that's solving a problem not just for searchers, but for potential searchers and people with that issue, whether they search or not, is part of SEO. I think that's going to mean that things like branding and things like attracting traffic from other sources, from social, from email, from content, from direct, from offline, and word-of-mouth, that all of those things are going to become part of the SEO equation. If we don't do those things well, in the long term, we might do great SEO, kind of classic, old-school keywords and links and crawl and rankings SEO and miss out on this important piece that's on the rise. I'm looking forward to some great comments and your theories as well. We'll see you again next week for another edition of Whiteboard Friday. Take care.Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Google May Use Searcher, Usage, & Clickstream Behavior to Impact Rankings"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Google May Use Searcher, Usage, & Clickstream Behavior to Impact Rankings"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H3",
      "text": "Deciphering searcher intent"
    },
    {
      "level": "H3",
      "text": "Google's site quality patent"
    },
    {
      "level": "H3",
      "text": "Rand's theory"
    },
    {
      "level": "H3",
      "text": "So what does this mean for us?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}