{
  "url": "https://moz.com/blog/google-is-losing-hundreds-of-thousands-of-advertising-dollars-in-canada",
  "slug": "google-is-losing-hundreds-of-thousands-of-advertising-dollars-in-canada",
  "title": "Google is Losing Hundreds of Thousands of Advertising Dollars in Canada - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A few months ago, I was out of my office for an appointment with a client in downtown Montreal. Since I knew (well, I thought I knew!) how Google Adwords IP geotargeting system worked, I wanted to give him a demo with a concrete example. I used, as my example, my own firm's Adwords campaign, which…",
  "content": "Google is Losing Hundreds of Thousands of Advertising Dollars in Canada Search Engines E By: Ella_D December 1, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! E By: Ella_D December 1, 2006 Google is Losing Hundreds of Thousands of Advertising Dollars in Canada Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. A few months ago, I was out of my office for an appointment with a client in downtown Montreal. Since I knew (well, I thought I knew!) how Google Adwords IP geotargeting system worked, I wanted to give him a demo with a concrete example. I used, as my example, my own firm's Adwords campaign, which had the keyword “conception web” (translation: “web design”) geotargeting the Quebec province (Canda's only French-speaking region). Since I was in Quebec, I presumed it would show up on nearly all Quebec computers, no matter the ISP. But, when we tried from the client's office, we couldn’t get the ad to show! I called the office, and they checked my bids and NVI was still on the first PPC spot in Quebec location on “conception web”. I didn’t understand the problem at that time, but it seemed that the only difference between the testing done at my client's office and the one made by my colleague at our office was the ISP. My client was connected to the Internet with Bell/Sympatico (on ADSL), one of the two leaders in Quebec and my office with Videotron (Cable), the other leading ISP company. I couldn’t believe that most of Bell/Sympatico’s Quebec customers (at least 40-50% of Quebec total ISP residential / commercial market) connections were not taken into account. So, we did a real test to understand and explain this phenomenon. Here’s the test: IP: 70.49.203.251 (one of the 10 IP’s we’ve tested) Location : Montreal Test we’ve done: For one of our customers, we’ve selected Quebec as the geographical target for a keyword and tried to have it show up on Google.ca with several Bell/Sympatico ISP clients. We’ve also done the same test with the keyword “conception web”, and we couldn’t get our ad to show up for those Bell/Sympatico users. This probably means that we have selected “Quebec” in your geographical target for your existing French Adwords campaign. The main problem is that most of the Bell/Sympatico IPs are pointing to servers located in Ottawa and Toronto, which are in Ontario province, despite the fact the clients are located in Quebec province. Problem: Ads not showing in Google-sponsored links because the IP is resolved in Ontario. This is caused because many Bell/Sympatico ISP servers delivering the Internet connection to Quebec residents are located in Ottawa and Toronto, and Google thinks the customers are located in Ontario and therefore won’t show the ads to them. The Big Issue: I don’t think Google is aware of it, so most of the Google campaigns you will run for French & English keywords will not show up in Quebec province for most/all of Bell/Sympatico Internet users if you have selected “Quebec” as your geographical target. This basically means that you are not targeting half of the already small French market! Way to go! Google advertising reach a lot less French consumers in Quebec, and Google loses a lot of money through its pay-per-click system in Quebec because it doesn’t serve Bell/Sympatico ISP clients. How to overcome this obstacle? The best solution we found is to create a copy of your existing French PPC campaign but by targeting Ontario as a geographical target, you can dramatically boost your PPC impressions and clicks for Quebec province without hurting too much your quality since most of Ontario residents won't search for terms in French. On the other hand, to reach Anglophones in Quebec, you have to target Anglophones in Ontario as well, which is not a viable solution for advertising campaign targeted only for Quebec. What is Google's position on this issue? In March, we sent a brief note through the Google Help Center. Google answered that it can't do anything since Bell/Sympatico has chosen to implement its servers outside Quebec. That surprised me a lot, since I was giving Google an insight that is worth at least several hundreds thousands of advertising dollars… for FREE. Maybe it didn't get to the right person! p.s. from Rand - If any SEOmozzers think they can slip the AdWords folks a note during study hall, I'm sure they'd appreciate the several million extra dollars in ad revenue? p.p.s. from Guillaume - The French version of this Google article is available on Go-Referencement.org Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google is Losing Hundreds of Thousands of Advertising Dollars in Canada"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google is Losing Hundreds of Thousands of Advertising Dollars in Canada"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ella_D\n          \n            Ella_D"
}