{
  "url": "https://moz.com/blog/google-plus-tips-seo",
  "slug": "google-plus-tips-seo",
  "title": "10 Smart Tips to Leverage Google+ for Increased Web Traffic - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "While not everyone has an audience active on Google+, the number of people who interact socially with any Google products on a monthly basis now reportedly ​exceeds 500 million.",
  "content": "10 Smart Tips to Leverage Google+ for Increased Web Traffic Social Media By: Cyrus Shepard April 15, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Cyrus Shepard April 15, 2014 10 Smart Tips to Leverage Google+ for Increased Web Traffic Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This time, it's about engaged traffic. While checking our stats here at Moz, we noticed that while visits sent to us from Facebook keep decreasing, traffic from Google+ has started to appear significant by comparison. While not everyone has an audience active on Google+, the number of people who interact socially with any Google products on a monthly basis now reportedly exceeds 500 million. What's different about Google+ is that beyond the direct social visits as seen above, Google offers marketers the opportunity to interact with visitors through many more touch points, including YouTube and directly in search results. This means that for visitors who engage with you through Google+, the potential traffic channels multiply. For this method to work, it requires that your visitors actually engage. Facebook and Twitter experts know this and perfected their engagement craft over several years. Engagement with Google+ means a new set tactics and best practices. These are areas that I consistently see otherwise expert brands fall short and miss easy opportunities. Let's discuss supercharging our Google+ engagement.1. Headlines, every time The more users notice your Google+ posts, the more likely they are to engage. The challenge is to stand out in a sea of thousands of posts. First things first. Unlike other social platforms, Google+ posts act more like mini blog posts, and every post needs a headline. Not only does adding a header help your post stand out, but Google uses the first words of your post in two different ways: They incorporates your headline into the title tag of the post The headline is typically what displays in Google search results Adding the right headline can help your post stand out in search results, and can greatly influence the number of people who both notice and click through to your content. Use a headline, every time.2. Formatting for attention Easily break up your long blocks of text with formatting to make your posts simpler to read and skim. This allows you to communicate more clearly and makes your text more accessible. In addition to adding bold to your headline, copy and paste the formatting cheats below to help compose a post that stands out from the rest. G+ Formatting Cheats: *This is a Bolded Headline* _ Italic_ *Bold* -Strikethrough- Mix and match styles: _*Bolded Italic*_ Numbered List: *1.* Point One *2.* Point Two *3.* Point Three Bulleted List: • Point 1 • Point 2 • Point 3 Link: http://example.com #hashtag1 #hashtag2 How it Looks: 3. Use your words Google+ is a both a visual and a text medium, so make them both count! Don't be afraid of writing longer posts. Instead of simply posting a link to your latest blog posts and hoping for the best, add a summary of your important points. Explain why this is important. Give people additional context as to why they should click and share. Personal example of Google+ posts where I embraced the long-form: Introducing The Web Developer's SEO Cheat Sheet 2.0 • 308 +1s, 222 Reshares 5 Takeaways and Assumptions from Matt Cutt's Video on Authority vs. Popularity • 194 +1s, 94 Reshares New Google Title Tag Length Guidelines: 55 Characters • 152 +1s, 180 Reshares The few minutes it takes to jot down your thoughts could result in multiple reshares and thousands of additional eyeballs on your content.4. Use your images too The vast majority of top posts on Google+ use images. In fact, the most popular post I've personally ever shared was a simple animated GIF. For increased shareability, it's usually best to upload your own photo. By default, Google+ tries to include an image for any URL that you share. Unless you define the right Open Graph images and the proper social meta tags, the images are often not ideal, or are sized wrong. When you upload your own image, the image links to the full-size version, not the URL you want to share. In this case, don't forget to include a link to the URL in the text.5. Smarter sharing > targeted Most people set their post to \"public,\" thinking this gives them maximum exposure. In fact, there is a much more effective way to gain exposure to your top content, as long as you don't abuse it. By also adding your circles and select individuals to your share settings, this triggers a notification for those users that you've shared a post directly with them. Used smartly, these notifications can greatly influence the amount of activity on a post. Warning: When targeted sharing is used too often, it turns spammy. Be careful what you share. Only choose your very best, most important posts. Amazingly, Google+ also allows you to notify people in your circles via email when you share. In order for this to work, the individuals must have their email notifications set up correctly. Be extra careful with this function, as it can turn people off fast!6. The mighty, mighty #hashtag Twitter and Facebook have made us accustomed to hashtags, but Google+ uses them in entirely different ways to organize and recommend content. Google uses hashtags and semantic analysis to form relationships between topics. For example, consider this hashtag search for #linkbuilding. Notice the related topics Google associates with link building: These associations aren't random. In fact, Mark Traphagen demonstrates how you can \"teach\" Google these relationships by tagging your own posts. By default, Google often adds hashtags automatically to any post with sufficient text. Best practice is to add your own relevant hashtags at the end or within the body of each post.7. Find the followed links The followed link on Google+ has gone the way of the dodo. When Google+ was born, it was a bonanza for links, and seen as an SEO paradise. Since that time, Google has replaced most equity passing followed links with nofollow, which pass no link equity. This includes profile links, \"contributor to,\" and shared URLs. There is one exception. Public +1's remain followed. For now, whenever a visitor +1s your content without sharing it to their stream, this results in a followed link as long as the visitor has +1's set to \"public.\" This could be an oversight, or Google could remove these followed links soon. While the value of +1s for SEO has been debated again and again, this may be the last remaining place that a +1 may actually pass link equity.8. Leverage Google+ comments I'm sort of in love with the Google+ commenting system. Much like Facebook's popular commenting plugin, you can embed Google+ comments on your own blog. What makes this so powerful is when visitors leave a comment, they are given the option of sharing your post to their own Google+ followers. This can greatly increase engagement among these users and their followers. Officially, Google+ comments are only supported for Google's own Blogger platform. Fortuneatly, clever folks have devised a number of plugins and solutions for Wordpress, Drupal, and more.9. +Post Ads: the future of social engagement? Google's +Post Ads offer an interesting premise: take your most successful Google+ posts and turn them into ads that show all over Google's massive display network. This exposes your posts to more people who otherwise would not have interacted with your brand on Google+ alone. This interaction drives more social sharing, and the sharing can continue after the paid promotion is over. For example, if you are a car manufacturer, you could target your Google+ posts to appear on auto parts websites. While still early in adoption, +Post Ads present a unique opportunity for businesses to attract customers at different stages of the buying cycle, and then keep those customers engaged through social media. While the jury is still out if +Post Ads will be effective, it will likely take some time for marketers to learn how to effectively leverage this channel.10. Interactive posts Interactive Google+ posts allow you to perfectly customize how your content is shared, but they also allow you to prompt your social audience to take a specific action. Google maintains an impressive list of actions which you can automatically embed into your post. These include: Watch a video Sign up for a newsletter Reserve a table at a restaurant Open an app ...and about 100 more. Mike Arnesen wrote up a good overview of getting started with Interactive posts, or you can find more at the Google Developers blog. Building your influence Google+ isn't so much a social media platform like Twitter and Facebook, but an identity platform that works with Google to connect across all our different devices and web services. This means that while sites like Facebook and Twitter can still deliver traffic to your website, Google+ is so integrated across so many platforms that it has many more places to touch potential visitors. Business that build up their audience base today potentially position themselves to collect bigger rewards in the future. Do you receive traffic from Google+? Is it a part of your social strategy? Let us know in the comments below. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "10 Smart Tips to Leverage Google+ for Increased Web Traffic"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "10 Smart Tips to Leverage Google+ for Increased Web Traffic"
    },
    {
      "level": "H2",
      "text": "1. Headlines, every time"
    },
    {
      "level": "H2",
      "text": "2. Formatting for attention"
    },
    {
      "level": "H4",
      "text": "G+ Formatting Cheats:"
    },
    {
      "level": "H4",
      "text": "How it Looks:"
    },
    {
      "level": "H2",
      "text": "3. Use your words"
    },
    {
      "level": "H2",
      "text": "4. Use your images too"
    },
    {
      "level": "H2",
      "text": "5. Smarter sharing > targeted"
    },
    {
      "level": "H2",
      "text": "6. The mighty, mighty #hashtag"
    },
    {
      "level": "H2",
      "text": "7. Find the followed links"
    },
    {
      "level": "H2",
      "text": "8. Leverage Google+ comments"
    },
    {
      "level": "H2",
      "text": "9. +Post Ads: the future of social engagement?"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "10. Interactive posts"
    },
    {
      "level": "H4",
      "text": "Building your influence"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Cyrus Shepard\n          \n            Cyrus Shepard\n          \n            Cyrus Shepard"
}