{
  "url": "https://moz.com/blog/google-advanced-search-operators",
  "slug": "google-advanced-search-operators",
  "title": "Google Advanced Search Operators for Competitive Content Research - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Without an organizing principle, a spreadsheet full of keywords is a bottomless to-do list. It’s not enough to know what your competitors are ranking for — you need to know what content is powering those rankings and how you’re currently competing with that content. Enter advanced search operators.",
  "content": "Google Advanced Search Operators for Competitive Content Research Search Engines | Competitive Research By: Dr. Peter J. Meyers May 7, 2021 Table of Contents Copied! By: Dr. Peter J. Meyers May 7, 2021 Google Advanced Search Operators for Competitive Content Research Search Engines | Competitive Research The excitement of finishing a competitive keyword research project often gives way to the panic of fleeing from an avalanche of opportunities. Without an organizing principle, a spreadsheet full of keywords is a bottomless to-do list. It’s not enough to know what your competitors are ranking for — you need to know what content is powering those rankings and how you’re currently competing with that content. You need a blueprint to craft those keywords into a compelling structure. Recently, I wrote a post about the current state of long-tail SEO. While I had an angle for the piece in mind, I also knew it was a topic Moz and others had covered many times. I needed to understand the competitive landscape and make sure I wasn’t cannibalizing our own content. This post covers one method to perform that competitive content research, using Google’s advanced search operators. For simplicity’s sake, we’ll pare down the keyword research and start our journey with just one phrase: “long tail seo.” Find your best content (site:) long tail seo site:moz.com “long tail seo” site:moz.com First, what has Moz already published on the subject? By pairing your target keywords with the [site:] operator, you can search for matching content only on your own site. I usually start with a broad-match search, but if your target phrases are made up of common words, you could also use quotation marks and exact-match search. Here’s the first piece of content I see: Our best match on the subject is a Whiteboard Friday from five years ago. If I had nothing new to add to the subject and/or I was considering doing a video, this might end my journey. I don’t really want to compete with my own content that’s already performing well. In this case, I decide that I’ve got a fresh take, and I move forward. Target a specific folder (inurl:) long tail seo site:moz.com inurl:learn long tail seo site:moz.com/learn For larger sites, you might want to focus on a specific section, like the blog, or in Moz’s case, our Learning Center. You have a couple of options here. You could use the [inurl:] operator with the folder name, but that may result in false alarms, like: moz.com/blog/learn-seo-in-30-minutes-a-daymoz.com/blog/what-seos-can-learn-from-adwordsmoz.com/community/q/topic/20117/what-is-the-best-way-to-learn-seo This may be useful, in some cases, but when you need to specifically focus on a sub-folder, just add that sub-folder to the [site:] operator. The handy thing about the [site:] operator is that anything left off is essentially a wild card, so [site:moz.com/learn] will return anything in the /learn folder. Find all competing pages (-site:) long tail seo -site:moz.com Now that you have a sense of your own, currently-ranking content, you can start to dig into the competition. I like to start broad, simply using negative match [-site:] to remove my own site from the list. I get back something like this: This is great for a big-picture view, but you’re probably going to want to focus in on just a couple or a handful of known competitors. So, let's narrow down the results ... Explore key competitors (site: OR site:) long tail seo (site:ahrefs.com OR site:semrush.com) By using the [OR] operator with [site:] and putting the result in parentheses, you can target a specific group of competitors. Now, I get back something like this: Is this really different than targeting one competitor at a time? Yes, in one important way: now I can see how these competitors rank against each other. Explore related content #1 (-“phrase”) long tail seo -\"long tail seo\" As you get into longer, more targeted phrases, it’s possible to miss relevant or related content. Hopefully, you’ve done a thorough job of your initial keyword research, but it’s still worth checking for gaps. One approach I use is to search for your main phrase with broad match, but exclude the exact match phrase. This leaves results like: Just glancing at page one of results, I can see multiple mentions of “long tail keywords” (as well as “long-tail” with a hyphen), and other variants like “long tail keyword research” and “long tail organic traffic.” Even if you’ve turned these up in your initial keyword research, this combination of Google search operators gives you a quick way to cover a lot of variants and potentially relevant content. Explore related content #2 (intext: -intitle:) intext:\"long tail seo\" -intitle:\"long tail seo\" Another handy trick is to use the [intext:] operator to target your phrase in the body of the content, but then use [-intitle:] to exclude results with the exact-match phrase in the title. While the results will overlap with the previous trick, you can sometimes turn up some interesting side discussions and related topics. Of course, you can also use [intitle:] to laser-target your search on content titles. Find pages by dates (####..####) long tail seo 2010..2015 In some cases, you might want to target your search on a date-range. You can combine the four-digit years with the range operator [..] to target a time period. Note that this will search for the years as numbers anywhere in the content. While the [daterange:] operator is theoretically your most precise option, it relies on Google being able to correctly identify the publication date of a piece, and I’ve found it difficult to use and a bit unpredictable. The range operator usually does the job. Find top X lists (intitle:”#..#”) intitle:\"top 11..15\" long tail seo This can get a little silly, but I just want to illustrate the power of combining operators. Let’s say you’re working on a top X list about long-tail SEO, but want to make sure there isn’t too much competition for the 11-15 item range you’re landing in. Using a combo of [intitle:] plus the range operator [..], you might get something like this: Note that operator combos can get weird, and results may vary depending on the order of the operators. Some operators can’t be used in combination (or at least the results are highly suspicious), so always gut-check what you see. Putting all of the data to work If you approach this process in an organized way (if I can do it, you can do it, because, frankly, I’m not that organized), what you should end up with is a list of relevant topics you might have missed, a list of your currently top-performing pages, a list of your relevant competitors, and a list of your competitors’ top-performing pages. With this bundle of related data, you can answer questions like the following: Are you at risk of competing with your own relevant content?Should you create new content or improve on existing content?Is there outdated content you should remove or 301-redirect?What competitors are most relevant in this content space?What effort/cost will it take to clear the competitive bar?What niches haven’t been covered by your competitors? No tool will magically answer these questions, but by using your existing keyword research tools and Google’s advanced search operators methodically, you should be able to put your human intelligence to work and create a specific and actionable content strategy around your chosen topic. If you’d like to learn more about Google’s advanced search operators, check out our comprehensive Learning Center page or my post with 67 search operator tricks. I’d love to hear more about how you put these tools to work in your own competitive research. Life rushed back into Jayda’s lungs, sharp and unforgiving. To her left, shards of a thousand synonyms. To her right, the crumbling remains of a mountain of long-tail keywords. As the air filled her lungs, the memories came rushing back, and with them the crushing realization that her team was buried beneath the debris. After months of effort, they had finally finished their competitive keyword research, but at what cost? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google Advanced Search Operators for Competitive Content Research"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google Advanced Search Operators for Competitive Content Research"
    },
    {
      "level": "H2",
      "text": "Find your best content (site:)"
    },
    {
      "level": "H2",
      "text": "Target a specific folder (inurl:)"
    },
    {
      "level": "H2",
      "text": "Find all competing pages (-site:)"
    },
    {
      "level": "H2",
      "text": "Explore key competitors (site: OR site:)"
    },
    {
      "level": "H2",
      "text": "Explore related content #1 (-“phrase”)"
    },
    {
      "level": "H2",
      "text": "Explore related content #2 (intext: -intitle:)"
    },
    {
      "level": "H2",
      "text": "Find pages by dates (####..####)"
    },
    {
      "level": "H2",
      "text": "Find top X lists (intitle:”#..#”)"
    },
    {
      "level": "H2",
      "text": "Putting all of the data to work"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}