{
  "url": "https://moz.com/blog/google-local-page-management-comparison",
  "slug": "google-local-page-management-comparison",
  "title": "Comparing the Google+ and Google Places Page Management Interfaces - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "With an interface and user experience far superior to that of Google+ pages, Google's Places for Business dashboard effectively provides everything a small brick-and-mortar business needs. By continuing to promote both services, the company is only confusing its users.",
  "content": "Comparing the Google+ and Google Places Page Management Interfaces Local SEO By: David Mihm August 27, 2013 Table of Contents Copied! By: David Mihm August 27, 2013 Comparing the Google+ and Google Places Page Management Interfaces Local SEO Caveat: I am definitely not a professional interface designer; this task I leave largely to the experts on our UX & Design team. My goal behind this post is to increase usage of Places for Business, however, and raise the visibility of that destination among the small-business-focused marketing community. Setting aside the difficulty that Google had integrating Zagat into its product mix, its own branding difficulties in the Local space have been well-chronicled. Following the zigzag from Local to Maps to Places to Places-with-Hotspot, back to just Places, then to Plus-Local, and (finally?) plain ol' Plus has been like observing a misguided exercise in corporate alligator escapism. Although the result of this hodgepodge of brands appears largely the same to consumers, who probably weren't all that keyed into the evolution anyway, Google's ill-defined brand in Local has almost certainly been a contributing factor to its deficit in business owner engagement relative to Facebook. It's just not clear to the average brick-and-mortar business owner, let alone the average SEO, where she should go to get started at Google. While Google's \"first responders\" in the support forums have been darned consistent in their mantra of using Places for Business to manage this presence, this destination gets very little love in Google's mainstream advertising — or even AdWords. It's impossible to get to from Google's primary business-oriented pages, and a number of searches (including \"Google Plus Local Page\") return this answer. Which is a shame, because the Plus management interface offers a vastly inferior experience for business owners. Although I recommended it last year, here's why I no longer encourage business owners (or SEOs) to use it, and why I've come around to places.google.com. The deficiencies of the Google+ page management interface 1. No UI hierarchy This interface is a jumble of Pinterest-like modules, with none more or less important than the others. If I were to answer my own question (\"What am I supposed to look at?\"), my natural inclination would seem to be the big green box in the middle — \"Start a video call with your followers.\" Hardly something the average business owner is going to have time for or get any value out of. Meanwhile, attributes that are core to a business's success (categories, hours, location information) are hidden behind a white-on-white button, and my natural primary activity (posting as my business rather than as myself) is easy to miss when juxtaposed alongside the \"green monster.\" It's no wonder that even LinkedIn beats Google+ for social sharing. 2. Mis-targeting the average SMB The eager-beaver SMBs who explore the navigation beyond the first page are likely to find themselves pretty lost. They're asked to install plugins, buttons, and even connect to the Google APIs console (while being consoled that it's only a 3-step process). Something like 50% of this audience doesn't even have a website, and 90% doesn't even have a mobile website, for goodness sake. 3. Slightly misleading insights The Places dashboard hasn't exactly been a paragon of useful information, but my main complaint with this tab is presentation, rather than data. There's actually quite a bit of useful information here, but unfortunately it's hidden in the default view. \"Actions\" and \"Views\" are presented flatly, where a view of a post is treated with the same importance as a click for driving directions or into a business's website. So a business is likely to miss out on what are actually some pretty important metrics, or at least see some inflated numbers. 4. No help The only way to get help with this far-from-simple product is to click first into settings, and then into \"Learn More\" on the section that you're interested in. The strengths of the Places management interface 1. Extremely clear messaging Strong calls to action pop right off the page here: the green-backgrounded \"Complete your business information,\" the blue-backgrounded \"Edit information,\" and even the boringness of the grayed-out \"Add photo\" area all point directly to what Google and the SMB are both trying to accomplish with this product. 2. Perfect targeting of the average SMB It's evident that the designers of the Places Dashboard have spent plenty of time watching business owners using their product. Clicking the question mark just once brings up tooltips alongside all the major sections of the tool. Not only does this decrease the number of questions Google is likely to receive from business owners, but it answers those questions in a clear, friendly tone that gives less-sophisticated owners a great first impression of Google's products. 3. Clear(er) insights This simplistic interface is very transparent about the data it's showing (number of times this listing appeared in a local search result), and presents a much more representative view of a business's presence at Google (my page only has 3 actions) without overcomplicating the situation for the business owner. 4. Terrific tooltips and inline help text Here's where the experience of the Places team really shines through: They don't take any pre-existing knowledge of how business listings work for granted, walking the business owner through every step of the page-creation process. 5. Phone support (!) And of course, if a business owner isn't able to figure things out on their own, there are plenty of relevant links directly to the most-commonly asked questions, and the process highlights Google's revolutionary option of phone support. Conclusion Given how much effort has been put into the Local Business Center / Places for Business Dashboard over the last several years — and the extremely polished result those efforts have yielded — I'm surprised Google continues to throw any energy into promoting the Plus management option to small businesses, let alone developing and maintaining it. Any business owner who visits Plus should be sent right over to the Places for Business Dashboard. It seems to be much more empathetic to the typical business owner's level of sophistication, and solves their most important needs more directly than Plus. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Comparing the Google+ and Google Places Page Management Interfaces"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Comparing the Google+ and Google Places Page Management Interfaces"
    },
    {
      "level": "H2",
      "text": "The deficiencies of the Google+ page management interface"
    },
    {
      "level": "H3",
      "text": "1. No UI hierarchy"
    },
    {
      "level": "H3",
      "text": "2. Mis-targeting the average SMB"
    },
    {
      "level": "H3",
      "text": "3. Slightly misleading insights"
    },
    {
      "level": "H3",
      "text": "4. No help"
    },
    {
      "level": "H2",
      "text": "The strengths of the Places management interface"
    },
    {
      "level": "H3",
      "text": "1. Extremely clear messaging"
    },
    {
      "level": "H3",
      "text": "2. Perfect targeting of the average SMB"
    },
    {
      "level": "H3",
      "text": "3. Clear(er) insights"
    },
    {
      "level": "H3",
      "text": "4. Terrific tooltips and inline help text"
    },
    {
      "level": "H3",
      "text": "5. Phone support (!)"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "David Mihm\n          \n            David Mihm\n          \n            David Mihm"
}