{
  "url": "https://moz.com/blog/googles-emd-algo-update-early-data",
  "slug": "googles-emd-algo-update-early-data",
  "title": "Google's EMD Algo Update - Early Data - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Google announced an \"upcoming\" algorithm change targeting low-quality Exact-Match Domains on 9/28. Data from MozCast indicated the change did hit on 9/28 - I break down the data, along with some of the sites impacted.",
  "content": "Google's EMD Algo Update - Early Data Moz News By: Dr. Peter J. Meyers September 29, 2012 Table of Contents Copied! By: Dr. Peter J. Meyers September 29, 2012 Google's EMD Algo Update - Early Data Moz News Recently, I wrote about changes we’ve been tracking in how Google treats Exact-Match Domains (EMDs). Yesterday (Friday, 9/28), Matt Cutts tweeted the following message: It was initially unclear what “upcoming” meant and whether the change was in progress or would roll out later in the weekend. Matt went on to say that the change “affects 0.6% of English-US queries to a noticeable degree,” but didn’t pin down the timeline. This morning, our new MozCast \"Top-View\" metrics showed the following: We measured a 24-hour drop in EMD influence from 3.58% to 3.21%. This represents a day-over-day change of 10.3%. While the graph only shows the 30-day view, this also marks the lowest measurement of EMD influence on record since we started collecting data in early April. So, Who Got Hit? Across our data set of 1000 SERPs, 41 EMDs fell out of the Top 10 (5 new EMDs entered, so the net change was 36 domains). Please note that we can’t prove that a domain lost ranking due to the algorithm change – we can only measure what fell out. Here are 5 examples of domains that lost ranking as of this morning (9/29) – all had previously ranked for at least the past 7 days: www.bmicalculatormale.com (#4) www.charterschools.org (#7) playscrabble.net (#3) www.purses.org (#3) www.teethwhitening.com (#4) The parenthetical value shows the EMDs ranking on 9/28 (the day before the drop). Again, all we know is that these domains fell out of the rankings for their exact-match phrases as of this morning – I’m not making any statements about the quality of the domains as a whole. As you can see, the affected domains cover a range of phrase length and TLDs (including .com’s). There’s no clear pattern in the size of the drop – some fell out of the top 100 entirely, while others slipped a couple of pages. For example, www.charterschools.org fell from #7 to #23, whereas playscrabble.net dropped from #3 down 18 pages to #183. What About The #1s? You may have noticed that none of my example domains were previously ranked in the #1 spot. Across the 41 EMDs that dropped out of the top 10 in our data, none of them ranked #1 the previous day. Three domains held the #2 spot prior to their fall, including www.mariogamesonline.net, which is no longer in the top 100. It’s interesting to note that, of the 41 EMDs affected, 5 of them had “games” in their domain name, but this could just be a fluke (or a sign of an industry with too many low-value sites). What’s The Pattern? It’s not my goal to call these sites out – some may have dropped in ranking due to factors that had nothing to do with this algorithm update (and were only coincidentally EMDs). For example, www.charterschools.org appears to be a legitimate site representing a professional organization: the Michigan Association of Public School Academies (MAPSA). At first glance, it appears that their only crime may be choosing a keyword-focused domain over their own brand. The site doesn’t really target the phrase “charter schools” particularly strongly and is tied to one state. It’s not a bad site, but one can argue whether it deserves to rank in the top 10 for a competitive keyword simply because of its domain name. Other sites in the mix do appear to exhibit more traditional low-quality signals – aggressive keyword usage, low-authority, spammy link-building, etc. – and seem to have been ranking solely by virtue of their EMDs. There’s no one clear signal in play, though – at this point, we have to assume that Google is weighing multiple factors. Again, it is interesting to note that no EMDs previously at #1 were affected, but our data set is still relatively small. If you have specific questions about the data, please feel free to ask in the comments, and I’ll do my best to follow up. These patterns are surprisingly complex, and I wanted to dig in for a quick first look while the data was still fresh. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google's EMD Algo Update - Early Data"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google's EMD Algo Update - Early Data"
    },
    {
      "level": "H2",
      "text": "So, Who Got Hit?"
    },
    {
      "level": "H2",
      "text": "What About The #1s?"
    },
    {
      "level": "H2",
      "text": "What’s The Pattern?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}