{
  "url": "https://moz.com/blog/google-serp-feature-seo-misconceptions",
  "slug": "google-serp-feature-seo-misconceptions",
  "title": "6 Common Google SERP Feature Misconceptions in SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Brodie Clark teamed up with Izzi Smith to create a new SEO quiz series, testing marketers' knowledge of Google SERP features. In this post, read through the six most common misconceptions found in quiz answers, dealing with structured data, Featured Snippets, and more!",
  "content": "6 Common Google SERP Feature Misconceptions in SEO Search Engines By: Brodie Clark April 6, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Brodie Clark April 6, 2021 6 Common Google SERP Feature Misconceptions in SEO Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As SEO professionals, we can easily fall behind on the latest Google search engine result page (SERP) features. Frequent updates keep us on our toes, and also keep our jobs interesting. Recently, I teamed up with fellow Moz writer and all-round brilliant SEO, Izzi Smith, to create a new SEO quiz series named “SERP Pursuit”. The quiz is still open, if you’d like to test your knowledge of Google’s SERP features. The outcome of the quiz was a collection of insights from the SEO community about different SERP feature topics, including the questions where participants may have struggled or become confused. Thanks to everyone that shared and participated in the quiz! The top question in the series received 825 answers – providing a strong sample size. For each question, the sample size has been included along with the question. The six common misconceptions found in our data relate to structured data (in terms of schema.org), Featured Snippets, unpaid Shopping tab listings (now referred to as “free product listings”), and also Web Stories. Here are the questions, the answers to those questions, along with further details explaining why the correct answer is as such. FAQ and How-To Schema rich resultsUsing too much Structured Data markupStructured Data influencing Featured SnippetsScroll-to-text with Featured SnippetsUnpaid Shopping tab listing inputsWeb Story device type rich results 1. What is the maximum number of FAQ and How-To schema rich results that can appear on the first page of Google? The maximum number of FAQ and How-To schema rich results that can appear on the first page of Google is three. This has been proven for both FAQ schema and How-To schema rich results across mobile and desktop search results. Filtering will happen if less than three rich results are eligible. According to our question sample of 775 answers, the most popular answer at 39% was that there is no limit in place for FAQ and How-To rich results (incorrect). The correct answer of “3” was selected by 34% of respondents. Participants may have been drawn to the “no limit” response because this has historically been the answer for rich results other than FAQ and How-To schema. For instance, review snippets with Product schema don't have limitations regarding what Google results page they can appear on, or the amount that can appear at the same time. I am, however, glad to see the amount of participants that gave the correct answer, as this is a topic I’ve written about extensively over the past couple of years. Filtering is a very common reason for FAQ and How-To rich results not appearing, and being aware of the limitations can be a big time-saver for troubleshooting. 2. Is it possible to have too much structured data markup on a single page? No, it is not possible to have too much structured data on a single page. But just because there are no repercussions from Google for excessive usage, time is often better spent elsewhere. Ultimately, you should focus on what provides value to your site: using valid schema containing information used by Google. According to our question sample of 604 answers, the most popular answer at 55% was that it is possible to have too much structured data on a single page (incorrect answer). The correct answer of “False” was selected by 45% of respondents. This question is one that comes down to semantics, but does cause confusion among the SEO community. In the context of SEO, there is no generic ranking factor associated with structured data usage. But using the right schema types, with a good spread of usage, can provide relevant results for users. It’s also good to keep in mind what does and does not yield rich results. For the most part, it is my opinion that structured data shouldn’t be a task that requires a significant and regular investment of time. If using WordPress, there are tools such as Yoast that have already solved many of the ongoing structured data issues faced by sites. Their plugin provides Google with plenty of structured data signals, without extensive time investment (to be avoided). 3. Is structured data (in the context of schema.org) used to generate Featured Snippets on Google? No, structured data (in the context of schema.org) is not used to generate Featured Snippets on Google. The structure of content on a page is, however, often a contributing factor. Google’s systems determine whether content is or isn’t suitable for inclusion in Featured Snippets. According to our question sample of 579 answers, the most popular answer at 52% was that structured data is used to generate Featured Snippets (incorrect answer). The correct answer of “False” was selected by 48% of respondents. The misconception of structured data influencing Featured Snippets is one that I come across often. It is often based on experiments where structured data is added to a page and seeing the page then being added to a Featured Snippet. With an understanding of how Featured Snippets operate, this connection doesn’t make sense, even as a contributing factor. In my last article that I wrote for Moz, I showed how some sites can be prevented from ranking within Featured Snippets. This shows the complexity around how content is presented prominently at the top of Google’s search results, but structured data is one that Google has repeatedly mentioned doesn’t influence Featured Snippets as far back as 2015. 4. In which scenarios will the yellow text highlight and scroll-to functionality trigger once a Featured Snippet result is clicked? Currently, scroll-to-text will only ever be triggered for Featured Snippets on Google in two separate scenarios. The first is when the Chrome browser is in use (on both mobile and desktop), and also when a URL is built using Accelerated Mobile Pages (AMP) on mobile devices with any browser in use. According to our quiz sample of 527 answers, the most popular answer at 48% was the correct answer on the quiz. The closest answer to this, mentioning that this will only ever happen on Chrome on desktop, was selected by 36% of respondents. Although the highest percentage of respondents answered this question correctly, I believe it is still worthwhile to discuss due to the fact that it wasn’t over half of respondents. Featured Snippet highlights have been happening as far back as December of 2019, but originally were exclusively for pages built with AMP. Scroll-to-text has been an interesting addition to search. We saw the gradual expansion to usage via Chrome, to insights sporadically appearing in Google Search Console, and now being visible beyond just Featured Snippets with some Knowledge Panels and editorial reviews within some free product listings. 5. With unpaid Google Shopping tab listings, are product feeds submitted via Merchant Center and structured data used as inputs? The unpaid listings that appear within Google’s Shopping tab are based exclusively on data submitted via product feeds in Merchant Center. Support was originally for both product feeds and also structured data, but Google’s documentation was updated in May of 2020 to be exclusively product feeds. According to our question sample of 468 answers, the most popular answer at 78% was that both product feeds and Structured Data are both used as inputs (incorrect answer). The correct answer of “False” was selected by only 22% of respondents. Out of all questions in the quiz, this was the one that tripped up the most respondents. Prior to May 2020, it was the case that both product feeds and structured data were used as inputs for unpaid Shopping tab listings. Because this was only shown as a change in Google’s documentation, and was included as the original announcement, I can see how this could have confused respondents. A recent announcement from Google changed the naming from “surfaces across Google” to “free product listings” or “free listings”, which is also good to keep in mind for this feature. But if you’re ever trying to troubleshoot issues related to the “free listings” within the Shopping tab, spend your time investigating your Merchant Center data, not your product structured data. 6. When it comes to rich results, do Web Stories make your search result stand out more prominently on both desktop and mobile? While Google’s Web Stories are a feature that can rank on both mobile and desktop search results, the rich result element only comes into play on mobile. Using the AMP Test, which now has support for Web Stories, you can preview how your Web Story rich results will appear on mobile devices. According to our question sample of 407 answers, the most popular answer at 69% was that Web Story rich results show on both desktop and mobile (incorrect answer). The correct answer of “False” was selected by 31% of respondents. When a Web Story surfaces in Google’s search results while using a desktop device, it can be an… odd experience for users. They select the result, then they’re suddenly catapulted into the immersive full-screen Web Story experience. This is without prompt for the user (because the URL looks like a standard web search listing), which is a UX that Google still needs to address. Web Stories are an interesting format that are worth experimenting with considering the rich results benefits on mobile for standing out more, and also for the prominence they are often given within Google’s Discover Feed. I’ve written about several Web Stories SEO tips for publishers to keep in mind when creating them with Google’s plugin. Final thoughts The questions covered in this post are the top areas where respondents of our quiz struggled most relating to structured data, Featured Snippets, free product listings, and Web Stories. If some of these SERP feature questions had you feeling confused, don’t be too hard on yourself, just use this as an opportunity to improve on your understanding! Nailing the areas mentioned in this post is a great start to expanding your Google SERP feature knowledge. SERP features change frequently on Google. If you’re wanting to keep updated on the latest changes to Google’s documentation, I’d highly suggest bookmarking this page, which features key changes as they’re made. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "6 Common Google SERP Feature Misconceptions in SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "6 Common Google SERP Feature Misconceptions in SEO"
    },
    {
      "level": "H2",
      "text": "1. What is the maximum number of FAQ and How-To schema rich results that can appear on the first page of Google?"
    },
    {
      "level": "H2",
      "text": "2. Is it possible to have too much structured data markup on a single page?"
    },
    {
      "level": "H2",
      "text": "3. Is structured data (in the context of schema.org) used to generate Featured Snippets on Google?"
    },
    {
      "level": "H2",
      "text": "4. In which scenarios will the yellow text highlight and scroll-to functionality trigger once a Featured Snippet result is clicked?"
    },
    {
      "level": "H2",
      "text": "5. With unpaid Google Shopping tab listings, are product feeds submitted via Merchant Center and structured data used as inputs?"
    },
    {
      "level": "H2",
      "text": "6. When it comes to rich results, do Web Stories make your search result stand out more prominently on both desktop and mobile?"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Brodie Clark\n          \n            Brodie Clark"
}