{
  "url": "https://moz.com/blog/google-link-command-busting-the-myths",
  "slug": "google-link-command-busting-the-myths",
  "title": "Google Link: Command - Busting the Myths - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I'm a big Google fan - my wife often sleeps in their t-shirts, I speak on panels with Googlers all the time and I've even got a Google water bottle for working out (which happens all of once a month these days). However, I am NOT a fan of the Google link command, and I'm shocked by the number of…",
  "content": "Google Link: Command - Busting the Myths Search Engines By: Rand Fishkin November 23, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 23, 2009 Google Link: Command - Busting the Myths Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I'm a big Google fan - my wife often sleeps in their t-shirts, I speak on panels with Googlers all the time and I've even got a Google water bottle for working out (which happens all of once a month these days). However, I am NOT a fan of the Google link command, and I'm shocked by the number of folks who operate in and around the SEO, webdev and technology industries who haven't realized this. Here's what Google themselves have to say on the matter: You can perform a Google search using the link: operator to find a sampling of links to any site. For instance, [link:www.google.com] will list web pages that have links pointing to the Google home page. Note there can be no space between the \"link:\" and the web page URL. To see a much larger sampling of links to any verified site in Webmaster Tools: On the Webmaster Tools Home page, click the site you want. Under Your site on the web, click Links to your site. Note: Not all links to your site may be listed. This is normal. Here's what Matt Cutts (head of Google's Webspam team) had to say in a video on the subject: The short answer is that historically, we only had room for a very small percentage of backlinks because web search was the main part and we didn't have a ton of servers for link colon queries and so, we have doubled or increased the amount of backlinks that we show over time for link colon, but it is still a sub-sample. It's a relatively small percentage. And I think that that's a pretty good balance, because if you just automatically show a ton of backlinks for any website then spammers or competitors can use that to try to reverse engineer someone's rankings. Google themselves is telling us not to pay too much attention to the link command, but that doesn't seem to be stopping folks. Let the myth busting commence. Myth #1 - The Google Link Command Returns Accurate Numbers Nope. Not even close. Google themselves say the numbers aren't accurate and that they're showing a small sub-sample. The numbers show this as well. Check your link counts with the Google link command vs. the number inside Google's Webmaster Tools (when you verify your account, you'll see them shown). Here's the stats for SEOmoz, for example: Google's link command claims 1,590 links. Let's see what Webmaster Tools says: Hmm... 381,403 seems slightly larger than 1,590. In fact, the link command is showing me 0.4% of what Webmaster Tools says exists. Running this analysis on another few domains that we have access to in Webmaster Tools, I saw numbers ranging from 0.1% to 4.4% (meaning there's not even any consistency between in the percentage of links from the two counts). Myth #2 - The Google Link Command Returns Important Links Tragically, a long time ago (pre-2004), Google did show only important links via the link: command, which created the myth that exists to this day. In fact, the links shown in the link: command have no particular importance or relevance. They are truly a random sample, including links that are nofollowed, links from pages that have had PageRank penalties applied to them as well as links that do pass link juice and value. Myth #3 - The Google Link Command Returns Links in Some Kind of Order No one in SEO has been able to show any ordering of any kind in the Google link: command's results. Important, well-known websites may be listed on page 2 or page 20 of the results, and it is likewise with spam, scrapers and low quality sites that Google's likely not counting. In Site Explorer and the web results, Yahoo! appears to do some type of ordering, tending to show more important links, pages and sites before less important ones (though not with great consistency). Unfortunately, many SEOs suspect that, should Microsoft's deal to power Yahoo! with Bing results go through, Yahoo! is unlikely to maintain their own web index (and thus, link, linkdomain and site explorer will be gone). As exemplified above, Google appears to be very random indeed when showing link: results. Myth #4 - The Google Link Command Returns a Numerically Representative Count of Links This is possibly the myth that's most disturbing of all, primarily because so many operators in the SEO field belive it and track the link: command count as a reliable, useful metric. Nothing could be further from the truth - and here's some data to help back it up: Root Domain Google Link: # (external + internal?) Yahoo! Linkdomain # (external only) Linkscape Count (external only) Yahoo.com 3,650 331,000,000 201,681,667 Recovery.gov 7,550 328,000 155,780 Facebook.com 165,000 567,000,000 116,748,934 Real.com 11,400 4,600,000 5,596,165 Adobe.com 51,200 124,000,000 78,550,468 Reddit.com 18,300 128,000,000 29,071,291 Twitter.com 224,000 515,000,000 132,528,763 Salon.com 12,300 3,420,000 1,535,342 SEOmoz.org 1,590 957,000 486,405 NYTimes.com 7,990 21,200,000 12,884,758 TurkeyDayRun.com 3 68 22 Ninme.com 539 42,000 3,149 Burgerking.com 942 106,000 23,761 Alaskaair.com 1,010 44,000 38,358 Smashingmagazine.com 8,730 1,130,000 592,054 Smithsonian.org 4,860 25,700 14,545 I collected the data above spur of the moment, so I won't try to claim great statistical integrity. However, looking at Google's link: command results, the best I can say is that Google has some relationship to the others within 1-2 orders of magnitude, though they may be directionally inaccurate much of the time as well. Just look at the NYTimes.com for example - Google claims they have 2/3rds the links that Salon.com has, yet Yahoo! and Linkscape agree that, in fact, NYTimes.com has 6X+ Salon.com's link total. These are not numbers you want to hang your hat (or any crucial business decisions) on. Myth #5 - The Google Link Command Tracks Accurately Over Time Unfortunately, I don't have data points I can show, but our observations over time indicate that Google's link count in Webmaster Tools might rise, along with the Yahoo! and Linkscape link counts, yet the Google link: command will show lower numbers. The reverse is sometimes also the case. Without directional consistency, even when compared against their own counts, it's very hard to take the Google link: count seriously. Myth #6 - The Google Link Command is Up to Date Most SEOs & webmasters have noticed that the Google link: counts update infrequently, inconsistently and most often in correlation with toolbar PageRank updates (another data point I'll need to takcle in a future post). These updates from Google occur every 2-10 months with little warning about when they're coming or have happened. If you watch sites like closely, they'll report many of these as they occur. The next time someone tells you their Google link: command numbers as a metric for SEO, competitive analysis or anything else, make sure they read this post. Google's not nearly as up-front with the information as they should be (honestly, removing the link command would save so much time and effort for poor site owners who get needlessly confused), but hopefully as a community, we can help build more awareness around this issue. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google Link: Command - Busting the Myths"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google Link: Command - Busting the Myths"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}