{
  "url": "https://moz.com/blog/google-balancing-an-elephant-on-stilts",
  "slug": "google-balancing-an-elephant-on-stilts",
  "title": "Google: Balancing an Elephant on Stilts - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I'm a Googler, Are you a Googler?I love Google on most days. In fact, I'm one of those passionate Googlers with a blogger account, a packed Calendar, a stuffed Reader, a couple Coop engines, I use the Docs and Spreadsheets, I send out invites to all my friends describing the wonders of Gmail, I've…",
  "content": "Google: Balancing an Elephant on Stilts Search Engines B By: Bud-Caddell March 29, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! B By: Bud-Caddell March 29, 2007 Google: Balancing an Elephant on Stilts Search Engines This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I'm a Googler, Are you a Googler? I love Google on most days. In fact, I'm one of those passionate Googlers with a blogger account, a packed Calendar, a stuffed Reader, a couple Co-op engines, I use the Docs and Spreadsheets, I send out invites to all my friends describing the wonders of Gmail, I've listed my company in the local business center, I run Analytics on all of my sites, I've got Talk installed and actually USE it -- these are all products I've tested out, liked, used repeatedly and even have become a strong advocate for. Good Faith is Fickle But recently, while experiencing some mild frustration, I penned this letter to Google on my blog. I was once again thwarted at every attempt to do anything within the Google Webmaster Tools. And the error message, \"This Service is Unavailable,\" really didn't clear things up much for me. I also caught this story today about Google Apps users, those people who love Google so much that they pay for their business apps, who are upset that Google isn't providing the uptime they promised. And it seems like at least once a week someone is complaining about Gmail uptime as well (and rumours that Gmail is eating up accounts and passing them into oblivion). Here She Comes to Save the Day, Vanessa Fox is On Her Way Much to my shock, after penning my little diatribe, I received a comment on my blog from Vanessa Fox. \"I'm really sorry that you've had trouble. We're working to ensure that you don't see these errors and that the system is up and running. I know it's really frustrating when the service isn't available.\" My blog is not a very popular blog. If my blog were a city, it'd be Marfa, Texas. Ok, not even Marfa, Marfa has cool art galleries and weird UFO sightings. The point is, the time it took to find my blog and post a comment probably isn't worth anything to Google, but I greatly appreciate that the team cares enough to at least want to respond to user concerns. So I want to say thanks for that. But even though people like Vanessa Fox take the time to run over to upset users, the basic recurring problem still remains. And the nature of that problem is a little shocking. When I think of Google, I think of complex algorithms and forward thinking solutions, I think of the future of the web -- I don't think of endless server farms and infrastructure challenges. But when these problems creep up, I start to rethink the brand entirely. Is Google Too Powerful? This story, Is Google Too Powerful?, also ran today, and it's a great read. Google is branching out across all of media and their size is definitely growing, but for me, that's a question for the SEC to answer. What I found interesting was when the article touched on the idea of Google being this ominous big brother -- mining all of our personal information, showing up at our door and beating up our cats, and all that stuff. To me, the infrastructure woes mediate my concerns over what they're doing with my data. Google's human, they are barely able to offer 99% uptime, in my mind I just don't see them with much time left to correlate my site visits with my browsing behaviour with my incessant google image searches of \"Rod Stewart\" and \"the faces.\" That still doesn't necessarily mean I'm right, it's just my perception. When Microsoft was being called the monopoly and their brand was cast in the long dark shadow of \"big-brother,\" all they needed to do was have Bill Gates show up at a conference, bumble through his speech and nervously try to get the newest release of Windows to unfreeze in front of the entire world. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google: Balancing an Elephant on Stilts"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google: Balancing an Elephant on Stilts"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Bud-Caddell\n          \n            Bud-Caddell"
}