{
  "url": "https://moz.com/blog/google-sucks-at-adwords",
  "slug": "google-sucks-at-adwords",
  "title": "Google Sucks at Adwords - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When a big client wants to advertise in \"search\" they probably end up in Google's own portfolio. And it makes perfect sense: why pay more for an adwords campaign when you can just pay for the clicks and have the rest of work done for you, by the same guys that invented the system in the first…",
  "content": "Google Sucks at Adwords Online Advertising N By: Nuno Hipólito January 15, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! N By: Nuno Hipólito January 15, 2008 Google Sucks at Adwords Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. When a big client wants to advertise in \"search,\" they probably end up in Google's own portfolio. And it makes perfect sense: why pay more for an AdWords campaign when you can just pay for the clicks and have the rest of the work done for you by the same guys that invented the system in the first place! After all, if they can't do it better, who can? Well... you for instance, or me, or pretty much anyone with a GAP credential... The thing is Google teaches people the basics of how to do ad campaigns in AdWords. From there the GAP is free to find out the best tricks and experiment with pretty much anything in order to seize the experience that will make him or her a great AdWords specialist. There are many skills involved in that, and you need to basically have copy skills, analytics skills, do tests, read and understand statistics, understand niche markets, understand product lingo and target audiences, etc... the list goes on and on. For sure the guys and girls at Google pretty much have all these skills and rock at AdWords. Well, no, at least from my experience, and I've seen several AdWords campaigns designed by Google employees. They are mediocre, because: The ad copy is bland and unimaginative and doesn't include important keywords The ads are often repeated and not targeted to the chosen keywords or theme The text often spills from line to line, and there is no call to action The campaign structure is often misleading and not focused enough, mixing very different keywords together They don't use negative keywords at the campaign level or in every ad group, as they should They don't Suck with a capital S, mind you, but you'd expect much better from Google, especially in campaigns that sometimes ranged in the 50-60 thousand dollars or more, each. It's mind warping why they don't follow their own guidelines... and that pretty much results in badly written, poorly structured campaigns. But its a chance for the rest of us, right? Well, no. Only if we can get those clients, which unfortunately is the hardest part of the process. The clients mostly trust their accounts to big media companies, which unload the work to Google and that's that. Anyway, I find it interesting how the little guy can do a better job at AdWords than big G. Do you agree? Have you seen this happen? I'd love some feedback! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google Sucks at Adwords"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google Sucks at Adwords"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Nuno Hipólito\n          \n            Nuno Hipólito"
}