{
  "url": "https://moz.com/blog/googles-december-authorship-shake-up",
  "slug": "googles-december-authorship-shake-up",
  "title": "Google's December Authorship Shake-up - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Before the holidays, we spotted a significant drop-off (roughly 15%) in searches display authorship. I take a deep dive into that data, including 30- and 60-day views, an analysis of authorship counts, and queries that lost out.",
  "content": "Google's December Authorship Shake-up Search Engines By: Dr. Peter J. Meyers January 9, 2014 Table of Contents Copied! By: Dr. Peter J. Meyers January 9, 2014 Google's December Authorship Shake-up Search Engines Back in mid-December, the newly launched MozCast Feature Graph showed a significant short-term drop in the number of tracked searches displaying authorship mark-up. Here's a 30-day view of the data (from November 22, 2013 to December 21): The graph shows the percentage of queries that displayed authorship mark-up (to any degree) on page 1 of Google (note: the Y-axis has been constrained to the range of the data). This data ranges from a peak of 23.71% on Nov. 24 to a low of 20.03% on Dec. 19, a relative drop of 15.5%. Was it foretold at Pubcon? If you follow the search industry closely, that 15% may sound familiar. Back in October, Matt Cutts took the stage at Pubcon and suggested that a 10-15% reduction in authorship seemed to improve search quality. Many took this as a sign that Google had reduced the amount of authorship mark-up appearing in SERPs or would reduce it soon. The graph above is a bit cherry-picked, in terms of the timeframe. So, let's expand it to 60 days, including Matt's announcement at Pubcon (which happened on Oct. 23): Interestingly, authorship actually climbed a bit after Matt's announcement, before eventually dropping. There was a 9.6% relative drop from Oct. 23 to Dec. 19. These numbers all line up pretty well with Matt's predicted 10-15% range, and he confirmed around Dec. 19 that the authorship change had rolled out. Since Dec. 19, authorship presence in our data set has ranged from 19.8% to 20.3%. There has been no substantial recovery. Did authorship counts drop? When you think about a reduction in authorship, there are actually two very different possible interpretations. You could see what the graphs above show – that, overall, less searches displayed authorship mark-up. These graphs only indicate whether queries had authorship mark-up or didn't, in all-or-none fashion. The other possible interpretation is that, within the searches that displayed authorship mark-up, fewer results would get that mark-up. So, let's compare the peak date of Nov. 24 to the 60-day low of Dec. 19. The following table breaks down the searches with authorship by the count of results that displayed authorship mark-up (as a percentage of the total searches with authorship): The vast majority of SERPs, before and after the shake-up, displayed one result with authorship mark-up. There aren't really any major differences until you get down to 5/page, and at that point the number of data points is so small that it's difficult to say the difference is meaningful. The mean number of results displaying authorship mark-up on Nov. 24 was 1.326, which fell slightly to 1.305 on Dec. 19. There was a slight shift toward searches where only one result showed mark-up, but the general proportions remained roughly the same in our data set. If you're curious, the query that broke the 10/10 mark was \"best android phones\" (although I'm currently only seeing 8 results with mark-up for that search). Which searches lost mark-up? Between Nov. 23 and Dec. 19, 628 searches lost authorship mark-up in our data set. For reference, here's a set of 20 relatively high-volume queries from that list of 628: vpn bruce springsteen tractor supply nectar astrology fisher price pilates gadgets linksys ie8 acne hernia multiple sclerosis malaria copd crohn's disease tattoo designs command and conquer web design fashion bug It can be tempting to dive right in and try to find some patterns, but here's where things start to get tricky. If you do the math, you may notice that the drop in percentages only suggests about 370 searches losing authorship mark-up. So, how did we end up with a list of 628 keywords? It turns out that 260 keywords actually gained authorship mark-up during the same period. So, while there was a significant net loss, there were both winners and losers. It's also worth noting that many of these queries have a news component and probably a QDF (Query Deserves Freshness) aspect to them, so the day-to-day presence of authorship mark-up can vary with the actual results returned. This calculation is almost certainly done in real-time and can be highly dynamic. Google doesn't have a list of domains that either get authorship mark-up or don't – they're making a decision on the fly based on the interaction of the query, page, and domain. What can you do about it? It's important to realize that, while losing authorship mark-up for some of your search terms may be upsetting, this is not a penalty in the traditional sense. Google has lowered the volume, so to speak – they seem to feel that authorship was too prominent and that the quality bar may have been set a little too low. So, if you lost mark-up, does that mean your site is necessarily low quality? No, at least not in the sense you or I understand the word. It's more likely that Google was awarding authorship mark-up simply based on on-page tags or superficial factors and wasn't looking at how those factors were supported by other ranking signals. So, you may need a bit more corroborating evidence (a solid link profile, social mentions, etc.) to get your authorship to be recognized. Ultimately, authorship mark-up is a nice-to-have, but don't bet the farm on it. Google+ is only 2-1/2 years old, and Google is just beginning to understand how to measure authorship and individual authority (what some people call \"AuthorRank\", although that implies a specific metric that may or may not exist yet). Improving your individual authority and building your social profiles makes sense for many reasons, but getting hung up on the micro-details of authorship mark-up and watching it appear and disappear day-by-day is probably only going to drive you crazy. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google's December Authorship Shake-up"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google's December Authorship Shake-up"
    },
    {
      "level": "H2",
      "text": "Was it foretold at Pubcon?"
    },
    {
      "level": "H2",
      "text": "Did authorship counts drop?"
    },
    {
      "level": "H2",
      "text": "Which searches lost mark-up?"
    },
    {
      "level": "H2",
      "text": "What can you do about it?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}