{
  "url": "https://moz.com/blog/google-1-and-the-rise-of-social-seo",
  "slug": "google-1-and-the-rise-of-social-seo",
  "title": "Google +1 And The Rise of Social SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Today Google announced the release of a new social feature: +1  Read more about the launch from these in-depth blog posts:      Danny's ever-excellent coverage: http://searchengineland.com/meet-1-googles-answe...",
  "content": "Google +1 And The Rise of Social SEO Social Media T By: Tom Critchlow March 30, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! T By: Tom Critchlow March 30, 2011 Google +1 And The Rise of Social SEO Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Today Google announced the release of a new social feature: +1 Read more about the launch from these in-depth blog posts: Danny's ever-excellent coverage: http://searchengineland.com/meet-1-googles-answer-to-the-facebook-like-button-70569 Official Google post: http://googleblog.blogspot.com/2011/03/1s-right-recommendations-right-when-you.html Official Google page: http://www.google.com/+1/button/ Quick Summary Rolling out across English Google over the next few days is a new \"+1\" feature that allows you to endorse URLs. If you're not yet seeing it in your search results enable it in Google experimental. Once enabled you see a little grey +1 next to all search results - including adwords listings: Once you click a result you see something like this: All of your +1 results appear on your Google Profile (e.g. Tom Critchlow): I'm a really big fan of this from Google - they seem to be doing a lot of things right with social at the moment and this seems to be universally received as positive by the twittersphere. It's a lot of fun and ridiculously intuitive to +1 something and I can really see this catching on. The Impact of +1 on SEO So what's the impact of this for SEOs? Well I'm struck by the opening paragraph from the Google +1 page (emphasis mine): The +1 button is shorthand for \"this is pretty cool\" or \"you should check this out.\" Click +1 to publicly give something your stamp of approval. Your +1's can help friends, contacts, and others on the web find the best stuff when they search. Note how Google is emphasising right from the start that this is going to influence search results. Another quote from the official Google Blog (again, emphasis mine): Say, for example, you’re planning a winter trip to Tahoe, Calif. When you do a search, you may now see a +1 from your slalom-skiing aunt next to the result for a lodge in the area. Or if you’re looking for a new pasta recipe, we’ll show you +1’s from your culinary genius college roommate. And even if none of your friends are baristas or caffeine addicts, we may still show you how many people across the web have +1’d your local coffee shop. So the bottom line is that getting people to +1 your content is going to help you get more organic traffic from Google. Maybe even more/cheaper paid traffic too! The Rise of Social SEO Of course, for me this isn't so much a new direction as much as a continuation of the social circle work that Google has been doing recently. I'm a massive fan of results from your social circle - as I'm searching around these appear on a crazy high % of search results: These social results pop up all the time and are immediately obvious and useful to me. The more that Google rolls out this integration the better imho. Is this how Google are going to reduce the emphasis on links? Maybe. Social Metrics Are Already Well Correlated With Rankings I'm not going to go into too much detail here as we're still in the middle of gathering data and running analysis but here's a sneak peak from Rand's presentation that he's giving in SMX Munich next week. We've run a correlation analysis on a whole bunch of search results (~10,000) for a wide range of factors and there's some surprising results. Check out this graph: It shows that Facebook shares are well correlated with rankings. In fact, comparing to other factors we see Facebook shares are similarly correlated to the number of linking root domains. It's early days in the analysis and all we're showing here is correlation not causation but it's kind of surprising the correlation is so strong! (Aside: I should point out a few things here - when we say Facebook shares we're talking about the aggregated number of Facebook interactions; comments, likes and shares as reported by the Facebook graph API. The full analysis will breakdown the different types of Facebook interactions in more detail. We should also say a big thankyou to Topsy as we have been using their totally awesome API to gather Twitter information) In my opinion this is why inbound marketing is going to overtake SEO as the primary function of SEO professionals. Engaging across social channels to get links, shares, likes, comments and +1s is going to be the future for generating organic traffic to your site. Not just from Google but these channels are increasingly driving significant volumes of traffic in their own right. +1 & Social Metrics Will Be Hard To Game Previously the biggest objection I've heard from SEOs about user-generated signals is that they are easy to game. Well I'm not so sure. Think about how much information Google has on you and all the ways they can justify your profile is tied to a real human being account. For example - to show you're a real human being Google could look for the following signals: Gmail Google analytics Google calendar Adwords Google voice Google checkout Chrome sync Search history Google docs Google reader Youtube .... etc Don't believe me? Why not head on over to your Google dashboard and see just how much information Google knows about you. Still think it'll be easy to fake? Combine this with some measure of author authority, which we know Google and Bing are looking at, and you have a pretty good picture of which accounts are influential and which are spammers. Let's also not forget that Google are smart. I very much doubt that social signals will impact search results equally - some industries just don't have a strong social footprint. For these industries I think (hope) Google will normalise the impact and won't let the \"fun\" site outrank the \"useful\" site - they can easily tell which niches have a lot of social activity and those that don't. For the more mundane/commercial industries Google will fall back on the regular signals of links. What's Next for Google +1? Google are already talking about a new publisher button that you will be able to embed on your page to allow people to +1 content from your site - very similar to the Facebook like and tweet this buttons that already exist. Once you enable +1 you're also opted in to show this information on 3rd party sites in exactly the same was as Facebook buttons: Here's a few other more speculative things to think about: Will Google create aggregated pages for the \"hot\" +1 content on the web? How will Google persuade regular people to create their Google profile page and add their friends? It seems like this is a very direct threat to the Facebook like button - how will Facebook react? How will +1 results impact Adwords listings? What kind of dashboard/analytics information will be available to publishers to see who is +1'ing their content? For now, why not do us a favour and go give SEOmoz a nice juicy +1 :-D Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google +1 And The Rise of Social SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google +1 And The Rise of Social SEO"
    },
    {
      "level": "H2",
      "text": "Quick Summary"
    },
    {
      "level": "H2",
      "text": "The Impact of +1 on SEO"
    },
    {
      "level": "H2",
      "text": "The Rise of Social SEO"
    },
    {
      "level": "H2",
      "text": "Social Metrics Are Already Well Correlated With Rankings"
    },
    {
      "level": "H2",
      "text": "+1 & Social Metrics Will Be Hard To Game"
    },
    {
      "level": "H2",
      "text": "What's Next for Google +1?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Tom Critchlow\n          \n            Tom Critchlow\n          \n            Tom Critchlow"
}