{
  "url": "https://moz.com/blog/googles-advice-godsend-or-gimmick",
  "slug": "googles-advice-godsend-or-gimmick",
  "title": "Google's Advice - Godsend Or Gimmick? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "What's the deal with all this advice that Google employees like to give us, then? Of all the search engines (and of many companies of Google's size and scope), Google appears to be the most open with its distribution of information, its interactions with its users and its willingness to give us…",
  "content": "Google's Advice - Godsend Or Gimmick? Search Engines By: Jane Copland September 24, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jane Copland September 24, 2008 Google's Advice - Godsend Or Gimmick? Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. What's the deal with all this advice that Google employees like to give us? Of all the search engines (and of many companies of Google's size and scope), Google appears to be the most open with its distribution of information, its interactions with its users and its willingness to give us advice. The other search engines are catching up, but Google has always seemed to lead the way in its interactions with the public, especially those members of the public who want it the most. Taken at face value, the interactions of people like Matt Cutts and Brian White on blogs, forums and social networks are fantastic. You can't expect to write a blog post or submit a thread about Facebook and have a high-ranking employee show up to correct a misconception or answer a question. Of course, Googlers can't and don't weigh in on everything, but the fact that they're there is awesome. However, it's healthy to avoid taking everything at face value, and some people are better at that than others. A true Google fan will say that the information and advice dispensed by Google employees is dispensed 100% in good faith, that it is for our own benefit and that if we can trust anyone, we can trust a search engine worker. A true conspiracy theorist will say that every utterance from a big company employee's mouth, no matter whether that company be Google, Microsoft, Apple or the Bank of America, is filtered through a carefully-planned corporate agenda. People read a lot into the public situations Googlers get involved in. The most recent debate surrounded whether Twitter had nofollowed users' profile page links because a Googler told them to. The public message Matt Cutts sent to Twitter co-founder Evan Williams linked to David Naylor's post on the subject of followed profile links and said that he's \"dropped (Evan) an email\" about it. According to Matt, he did not tell Evan to remove or nofollow those links, but only pointed out that Twitter could fall victim to spam attacks because of a PageRank-leaking loophole. I haven't read the email Matt sent and it's likely that you haven't either. However, you'll undoubtedly have your assumptions about it. The conspiracy theorists will have you believe that Twitter was pressured into removing its users' links under threats of lost PageRank. The believers will tell you that Matt dropped in like a friendly genie to alert Evan of a possible problem. I envision that hypothetical email beginning with \"Oh noes!\" In reality, it's probably going to be somewhere in the middle and I believe that goes for most of Google's interactions with the public. Search engines have long advised against linking to \"bad neighbourhoods\": we know both inherently and factually that linking to spam does not make a site look more trustworthy. However, it would seem that Twitter has little to gain from search engine rankings and that nofollowing those outbound links benefits Google and its use of PageRank more than it does a site whose growth hardly relies on search traffic. Then again, Google could just have easily discounted followed outbound links from Twitter. Given the ease with which they could have done this, surely Matt's actions could be seen as pretty philanthropic? It isn't as though Google hasn't turned off sites' ability to pass PageRank in the past. I've speculated on both sides of the theory here, but I always end up in the middle again. Google offers advice for a number of reasons and one of those is good will. Another seems to be making its employees' lives easier. Take Monday's blog post about URL rewriting, which Rand covers here: I walked away from that article feeling that although Google would like to help webmasters avoid rewriting screw-ups, they're quite invested in the idea that we should make their lives simpler. A third reason behind some Google actions is also going to boil down to corporate agenda. It's doubtful that a company can become that big and successful without one. People who write for Google have a responsibility to take the utmost care in the advice they give, and Monday's URL rewriting post somewhat neglects this responsibility. The post seems to look out for Google's interests more than it does the interests of website owners: it is misleading to experienced webmasters who knows how to effectively rewrite URLs... which they often do for purposes other than search engine crawling and ranking. Nothing that comes out with a Google stamp on it, and nothing that Googlers say on their own time, is taken lightly. Matt can send Evan Williams a two-line email that says something along the lines of: \"Hey dude, those links from Twitter profile pages under 'Bio' are passing PageRank and there are some nasty spammers signed up to your site. It's going to show up badly on your outbound link profile. Catch you later.\" and it means a lot more than it says. Google doesn't have to threaten a webmaster with anything; a message like that is enough to spur action. Similarly, Google's publication of any material, including Monday's URL rewriting post, carries a lot of weight and usually shapes how webmasters conduct themselves and their businesses. The conflict of interest happens when Google combines its interests as a company (in this case, easiest, most effective web crawling) with advice to webmasters. On Monday, it appears that commercial interests won out and Google dispensed less-than-ideal advice to an enormous community. Google's employees know this, which is where goodwill and power come together. I am absolutely sure that the things I've seen Matt tell webmasters is imparted in good faith. Many of us have received great advice, clarification and information from Googlers. However, they know that they hold a huge amount of power. People who've been around this space for a fairly good amount of time will have seen the annoyingly polished, corporate-approved statements and posts. The language is deliberately chummy but ends up being condescending. We recognise this because we've also seen their genuine voices. We have seen them get pissed off and call us out. I don't have my tin hat on. The title of this post is a bit sensational because I neither believe that the public-facing side of Google is a godsend or a controlled gimmick. I believe that you can rely on the advice you hear and read from search engines, especially from the ever-vocal Google, not to get your site banned, hurt your rankings or be deliberately detrimental in any way. However, always remember that they're going to misspeak and they're going to publish posts and comments that are in their own interest. They are also aware of their power, and so we should pay close attention to the meaning behind the messages we hear and find the middle ground between faithful servant and irate conspiracy theorist. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google's Advice - Godsend Or Gimmick?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google's Advice - Godsend Or Gimmick?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jane Copland\n          \n            Jane Copland"
}