{
  "url": "https://moz.com/blog/google-1-in-machine-translation",
  "slug": "google-1-in-machine-translation",
  "title": "Google #1 in Machine Translation - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This sort of thing really scares me. Via Matt's blog, Google recently placed #1 in every category in a US government (actually from the NIST Speech Group) sponsored ...",
  "content": "Google #1 in Machine Translation Search Engines By: Rand Fishkin August 24, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 24, 2005 Google #1 in Machine Translation Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This sort of thing really scares me. Via Matt's blog, Google recently placed #1 in every category in a US government (actually from the NIST Speech Group) sponsored contest comparing machine translation programs. This year, they tested Arabic to English & Chinese to English. In the 4 categories (2 for each language), Google ranked #1 - in every case at least 10% more accurate than the next highest ranked competitors. What this says to me is that Google's machine language understanding tools are bar-none the best in the world, and that if they can translate Arabic & Chinese with such accuracy and precision, their understanding of English is most likely far beyond what we might expect. This great level of care and devotion to automated language processing should spell the end of low quality texts in Google's index within the next few years - two problems that are probably hindering development now are false positives (identifying well written text as low quality) and processing power. I'd guess that it takes far too long to run 8.5 billion documents through a lanugage processor to make it practical at this time. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google #1 in Machine Translation"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google #1 in Machine Translation"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}