{
  "url": "https://moz.com/blog/google-people-also-ask-finance-case-study",
  "slug": "google-people-also-ask-finance-case-study",
  "title": "We Need to Talk About Google's “People Also Ask”: A Finance Case Study - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The team at iProspect started noticing that YMYL queries that should return local (UK) content in Google's \"People Also Ask\" results actually have a heavy influence from the US. They decided to analyze over 1,000 of the most-searched-for keywords in the finance industry to see how much of an issue…",
  "content": "We Need to Talk About Google's “People Also Ask”: A Finance Case Study Search Engines | International SEO By: BARRY LOUGHRAN March 11, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: BARRY LOUGHRAN March 11, 2020 We Need to Talk About Google's “People Also Ask”: A Finance Case Study Search Engines | International SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. For a while now, I’ve been disappointed with the People Also Ask (PAAs) feature in Google’s search results. My disappointment is not due to the vast amount of space they take up on the SERPs (that’s another post entirely), but more that the quality is never where I expect it to be. Google has been running PAAs since April 2015 and they are a pretty big deal. MozCast is currently tracking PAAs (Related Questions) across 90% of all searches, which is more than any other SERP feature. The quality issue I’m running into is that I still find several obscure PAA questions and results or content from other countries. When I run searches that have a universal answer, such as “can you eat raw chicken?”, the answer is universally correct so there is no issue with the results. But when I run a search that should return local (UK) content, such as “car insurance”, I’m finding a heavy influence from the US — especially around YMYL queries. I wanted to find out how much of an issue this actually is, so my team and I analyzed over 1,000 of the most-searched-for keywords in the finance industry, where we would expect UK PAA results. Before we dig in, my fundamental question going into this research was: “Should a financial query originating in the UK, whose products are governed within UK regulations, return related questions that contain UK content?” I believe that they should and I hope that by the end of this post, you agree, too. Our methodology To conduct our analysis, we followed these steps: 1. Tag keywords by category and sub-category: 2. Remove keywords where you would expect a universal result, e.g. “insurance definition”. 3. Extract PAAs and the respective ranking URLs using STAT. 4. Identify country origin through manual review: are we seeing correct results? Our findings 55.1% of the 4,507 available financial PAAs returned non-UK content. US content was served 50.5% of the time, while the remaining 4.6% was made up of sites from India, Australia, Canada, Ireland, South Africa, Spain, and Singapore. Results by category Breaking it down by category, we see that personal finance keywords bring back a UK PAA 33.72% of the time, insurance keywords 52.10%, utilities keywords 64.89%, and business keywords 38.76%. Personal finance Digging into the most competitive products in the UK, personal finance, we found that a significant percentage of PAAs brought back US or Indian content in the results. Out of the 558 personal finance keywords, 186 keywords didn’t bring back a single UK PAA result, including: financial advisorfirst credit cardbest car loansbalance transfer cardshow to buy a housebest payday loanscheap car financeloan calculator Credit cards 17.41% of credit card PAAs were showing UK-specific PAAs, with the US taking just over four out of every five. That’s huge. Another surprising find is that 61 out of 104 credit card keywords didn’t bring back a single UK PAA. I find this remarkable given the fact that the credit card queries originated in the UK. Loans Only 15.8% of searches returned a UK PAA result with over 75% coming from the US. We also saw highly-competitive and scrutinized searches for keywords like “payday loans” generate several non-UK results. Mortgages While the UK holds the majority of PAA results for mortgage-related keywords at 53.53%, there are still some major keywords (like “mortgages”) that only bring back a single UK result. If you’re searching for “mortgages” in the UK, then you want to see information about UK mortgages, but instead Google serves up mainly US results. Insurance Insurance results weren’t as bad as personal finance. However, there was still a big swing towards the US for some products, such as life insurance. Out of the 350 insurance keywords tested, there were 64 keywords that didn’t bring back a single UK PAA result, including: pet insurancecheap home insurancelife insurance comparisoncar insurance for teenscheap dog insurancetypes of car insurance Car insurance 60.54% of car insurance PAAs were showing UK-specific PAAs, with the US taking 36.97%. Out of the 132 keywords that were in this sub-category, UK sites were present for 118, which is better than the personal finance sub-categories. Home insurance As one of the most competitive spaces in the finance sector, it was really surprising to see that only 56.25% of results for home insurance queries returned a UK PAA. There are nuances to policies across different markets, so this is a frustrating and potentially harmful experience for searchers. Utilities Although we see a majority of PAAs in this keyword category return UK results, there are quite a few more specific searches for which you would absolutely be looking for a UK result (e.g. “unlimited data phone contracts”) but that bring back only one UK result. One interesting find is that this UKPower page has captured 35 PAAs for the 49 keywords it ranks for. That’s an impressive 71.43% — the highest rating we’ve seen across our analysis. Business At the time of our analysis, we found that 36.7% of business-related PAAs were from the UK. One of the keywords with the lowest representation in this category was \"business loans\", which generated only 6.25% UK results. While the volume of keywords are smaller in this category, there is more potential for harm with serving international content for queries relating to UK businesses. What pages generate the most PAA results? To make this post a little more actionable, I aggregated which URLs generated the most PAAs across some of the most competitive financial products in the UK. Ironically, four out of the top 10 were US-based (cars.news.com manages to generate 32 PAAs across one of the most competitive industries in UK financial searches: car insurance). A hat tip to ukpower.co.uk, which ranked #1 in our list, generating 35 results in the energy space. To summarize the above analysis, it’s clear that there is too much dominance from non-UK sites in finance searches. While there are a handful of UK sites doing well, there are UK queries being searched for that are bringing back clearly irrelevant information. As an industry, we have been pushed to improve quality — whether it’s increasing our relevancy or the expertise of our content — so findings like these show that Google could be doing more themselves. What does this mean for your SEO strategy? For the purpose of this research, we only looked at financial terms, so whilst we can’t categorically say this is the same for all industries, if Google is missing this much across financial YMYL terms then it doesn’t look good for other categories. My advice would be that if you are investing any time optimizing for PAAs, then you should spend your time elsewhere, for now, since the cards in finance niches are stacked against you. Featured Snippets are still the prime real estate for SEOs and (anecdotally, anyway) don’t seem to suffer from this geo-skew like PAAs do, so go for Featured Snippets instead. Have you got any thoughts on the quality of PAAs across your SERPs? Let me know in the comments below! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "We Need to Talk About Google's “People Also Ask”: A Finance Case Study"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "We Need to Talk About Google's “People Also Ask”: A Finance Case Study"
    },
    {
      "level": "H2",
      "text": "Our methodology"
    },
    {
      "level": "H2",
      "text": "Our findings"
    },
    {
      "level": "H2",
      "text": "Results by category"
    },
    {
      "level": "H3",
      "text": "Personal finance"
    },
    {
      "level": "H4",
      "text": "Credit cards"
    },
    {
      "level": "H4",
      "text": "Loans"
    },
    {
      "level": "H4",
      "text": "Mortgages"
    },
    {
      "level": "H3",
      "text": "Insurance"
    },
    {
      "level": "H4",
      "text": "Car insurance"
    },
    {
      "level": "H4",
      "text": "Home insurance"
    },
    {
      "level": "H3",
      "text": "Utilities"
    },
    {
      "level": "H3",
      "text": "Business"
    },
    {
      "level": "H2",
      "text": "What pages generate the most PAA results?"
    },
    {
      "level": "H2",
      "text": "What does this mean for your SEO strategy?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "BARRY LOUGHRAN\n          \n            BARRY LOUGHRAN"
}