{
  "url": "https://moz.com/blog/grassroots-seo-strategy-process-life-cycle",
  "slug": "grassroots-seo-strategy-process-life-cycle",
  "title": "Grassroots SEO - Strategy, Process & Life Cycle - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If you're a patron at search events, conferences and workshops, you might walk away the way I typically do: full of \"stuff\" to try but no clue where to start. Weeks go by, your notes become a beautiful art piece with dozens of brown coffee cup circles and doodles, eventually getting crumpled into a…",
  "content": "Grassroots SEO - Strategy, Process & Life Cycle Advanced SEO By: Steve Wiideman December 26, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Steve Wiideman December 26, 2011 Grassroots SEO - Strategy, Process & Life Cycle Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. If you're a patron at search events, conferences and workshops, you might walk away the way I typically do: full of \"stuff\" to try but no clue where to start. Weeks go by, your notes become a beautiful art piece with dozens of brown coffee cup circles and doodles, eventually getting crumpled into a ball and tossed across the room just next to the trashcan you were aiming for. There goes another $1,300 of inspiration without actionable takeaways. In this post, I'm going to give you a way to organize information you receive (and some of my own tactics) into what you will now and forever call an \"SEO Strategy.\" There are rockstars who multi-task and play all the search channels at once, optimizing content, creating links, rendering videos and engaging with social media elements while juggling 12 bowling pins and guzzling an energy drink. Good for them. For the rest of us, let's stick to something a bit more palatable and a lot more doable. Below you'll find the basic layout of your 6-12 month campaign, starting with what's in your SEO strategy. Let's start with milestones. You can put your milestones into a Google Spreadsheet in bold, font 24. Paste items in between milestones respectively, as you grow in your understanding of SEO best practices and techniques. You can also use project management tools, such as TeamWorkLive.com or Basecamp, both of which allow you to calendar your milestones and create assignable task lists beneath them. If you're an agency, you can create templates and cookie cutter your boilerplate SEO campaign. Example: Milestone 1 - Your SEO Strategic Plan (1 Month) You are going to get to hundreds of ideas and tools thrown at you for keyword research, spying on competitors, finding link opportunities and elements to consider when planning your SEO campaign. Problem is, most presenters don't actually say \"okay, add these line items to your research to-do list, phase 1 of 5 in your holistic SEO strategy\", they just say \"here's some stuff you can do\". What's in Your SEO Plan? Below is a list of reports and actionable lists to carry over to your project management system (or spreadsheet). The planning phase can take up to a month, but will save you a lot of time and frustration later in the campaign. Remember, this is boilerplate, so you can squeeze in new research and data-mining tasks you pick up from events. Isn't it nice to have a place to start putting the \"stuff\"? Obstacle Analysis Report (OAR) - This report will help you discover potential crawl and indexing issues. It has little to do with content, and is mostly focused on how search engine-friendly a website is. Criteria might include: checking for broken links and duplicate content, analyzing HTML and XML sitemaps, optimizing robots.txt and .htaccess files, to help crawlers get to the content you want indexed and away from the content you don't. The OAR might also include a review of Webmaster Tools, an audit from your seomoz.org campaign, and possibly data from similar online tools. Basically, your on-page \"stuff\" goes here. Competitor Analysis Report (CAR) - This is your baseline report, your Day 1, your \"aha\" moment, where you get to discover some exciting things about your competition, and some occasionally depressing things about your current SEO performance. Having access to Hitwise is the most ideal starting point (if you can afford it). If not, tools such as Compete.com, SEMRush, KeywordCompetitor, and OpenSiteExplorer.org can give you really nice insight into where your competitors are earning links, what keywords they are getting traffic from (AdWords and natural search), and even tell you how much more money they spent on specific keywords last month versus the month prior (a keyword performance indicator). For local businesses, WhiteSpark's Local Citation Finder does a darn good job of finding competitor business citations and sorting them by seomoz.org's own Domain Authority for easy prioritizing. Link Analysis Report (LAR) - This report is fun. Using tools like those in the seomoz.org arsenal, or possibly giving Ontolo a spin, you'll be seeking out and creating an organized inventory of link opportunities. Categorize your opportunities by classifications such as: Web Directory, Business Directory, Industry Blog, Regional Blog, Industry Portal, Industry Forum, Industry Experts, Niche Social Networks, and so forth. From here you have a few choices of how to store the information. I prefer Buzzstream, an Eric Ward-approved link tracking software, but Google Docs will do the job as well. If you do use a Google spreadsheet, break your classifications into their own tabs or link building becomes unmanageable. Keyword Discovery Report (KDR) - You'll already have a boatload of data from the first three reports to help with this, possibly the most important, report. You can also explore a number of other tools to help tally up all the keyword opportunities. WordTracker and Google AdWords will provide some excellent ideas, but nothing will beat what you'll find in your own web analytics and Webmaster Tools (provided you are actually tracking conversions and/or sales). With competitor data, you can run pivot tables in Excel to learn about the frequency of keywords the major competitors appear to be receiving traffic from. Purge out the terms that are too broad or not searched enough to be bothered with, sort by relevancy and search volume and you've got yourself a list of keywords to optimize for. Now that you have all this terrific data, what the heck do you do with it? Here's where actionable items or deliverables come into play. Put your OAR items into a To-Do List within your project management system (under the milestone of On-Page SEO) Put your CAR items into a Google spreadsheet so you can track and monitor changes over time Put your LAR classifications into one or more To-Do List within your project management system (under the Off-Page SEO milestone), put the opportunities into a spreadsheet or Buzzstream Put your KDR into a Google Docs spreadsheet, create a new tab called Content Tracking Spreadsheet with a column for just the top 100 or so keywords, and create columns to track Page Name, Title, Meta Description, Has Video?, Image Name, Image Attributes, Has 450+ words of Content? Matt Cutts Didn't Throw Up, Is Engaging? etc. In your PM system, your content writing tasks can be assigned (put the list under the On-Page SEO milestone) Now that the technical stuff is done, you get to start the creative and social media campaign planning. Pull a group of super smart people into a room for a full day and come out with awesome link bait, widget, tools/giveaways, and other creative link building strategies to add under your respective milestones. Milestone 2 - On-Page SEO (2 Months) There are thousands of smart (and sometimes silly) things you can do to optimize your website. You already have a To-Do List assigned in your project management system to square away OAR findings, and a To-Do List for your content team based on the keyword themes you want to optimize for. This initial phase of your SEO shouldn't take more than 60-90 days and typically isn't rocket science. You're going to get all sorts of new ideas from the seomoz.org blog, Search Engine Land, SEO Roundtable, and thousands of Tweets if you follow #seo in Twitter. Therefore, if you're using a project management system, your template will be growing and growing over time. Local and Ecommerce websites will have a few special To-Do Lists for data feed optimization, location-based landing pages, and a few other things you might extract from David Mihm's Local Search Ranking Factors or elsewhere. Milestone 3 - Off-Page SEO (3 Months for the Basic Tasks, 6 for Moderate) Mike Essex wrote an excellent post awhile back on 99 Ways to Build Links by Giving Stuff Away. I also like to use my Meetup.com group to have everyone provide 1-3 creative link building ideas to everyone who requests ideas, along with some crowd-sourcing tools, such as Amazon Mechanical Turk and similar services. Choose the top ideas based on the business and industry and add them to an Advanced SEO To-Do List in your project management system. You will definitely need to create several project briefs for each idea so it makes sense to the tech and marketing teams. I keep a Google spreadsheet going that has nearly 400 link building opportunities now (thank you Eric Ward). You'll also have a list for Basic Link Building (industry destinations and directories), Moderate Link Building (outreach, and slightly more technical than submission-based linking). Advanced link building tasks are really more of an initiative and can be tracked outside of the the project management system as ongoing marketing innovation. Milestone 4 - Social Media Optimization (1 Month for Setup) This milestone gets a bit tricky and requires getting in bed with those crazy social media people we all love. Perform an audit of all the current destinations our SMM teams are working with and insure they all contain relevant keywords, profile links, and (if location-based) business name, address, and phone number. Next, seek out new social media opportunities, such as niche social destinations, popular social networks that have not been claimed yet (Google+ might be a good start). You might even buy lunch for the social team, and then try to give them training on how to blog with keyword-rich links every so often. If their eyes start going crazy as if you fed them after midnight, run away and try again another day. If not, train your social team, in distributing content, video, and micro-blogging to give you a serious lift in ranking. The trick is to make them think it was all their idea. Milestone 5 - Video & Mobile (2 Months for Setup) Technically, you can break video and mobile into two different milestones. But for the sake of the novel this post has become, let's bundle them together. For video, I recommend having a quick chat or consult with a pro, such as Mark Robertson of ReelSEO on campaign, channel and distribution ideas. Get ready to setup some video XML sitemaps and to start distributing video to relevant sharing networks. Also be prepared to start using video ads (PPC), which may help long term placement on key YouTube videos. For mobile, you'll want to slip ONE task in for Milestone 2, insuring your mobile users have a custom experience that's mind-blowing and award winning. The rest will revolve around the creation of mobile apps for your products, mobile search optimization, and possibly even a few short code campaigns. We love Vegas, so I'm always excited to get my MB SMS offers from Mandalay Bay). I've Completed My Milestones, Now What? If you get through all the milestones (6-12 months on average - some might overlap, but they don't have to), your project management system should be empty of tasks. If so, you're no longer in Production Mode, you're now in Operations Mode and need only use your link and campaign tracking tools (here's a sample) for your day-to-day SEO initiative. However, you may elect to start over and repeat the entire process annually, depending on the results from the first round. Now you have 5-6 vehicles of SEO in an organized form. You may decide to create a page for each milestone on your yellow notepad when you attend SEO conferences and events. If a presenter gives you some cool \"stuff\" to do, you should be able to easily classify the task into one of these buckets, so later you can update your project management template, as though you were putting another piece into a seemingly endless puzzle; which beats the heck out of creating scribble for your crumble ball with beautiful coffee rings on it. Thanks for reading. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Grassroots SEO - Strategy, Process & Life Cycle"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Grassroots SEO - Strategy, Process & Life Cycle"
    },
    {
      "level": "H2",
      "text": "Milestone 1 - Your SEO Strategic Plan (1 Month)"
    },
    {
      "level": "H2",
      "text": "Milestone 2 - On-Page SEO (2 Months)"
    },
    {
      "level": "H2",
      "text": "Milestone 3 - Off-Page SEO (3 Months for the Basic Tasks, 6 for Moderate)"
    },
    {
      "level": "H2",
      "text": "Milestone 4 - Social Media Optimization (1 Month for Setup)"
    },
    {
      "level": "H2",
      "text": "Milestone 5 - Video & Mobile (2 Months for Setup)"
    },
    {
      "level": "H3",
      "text": "I've Completed My Milestones, Now What?"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Steve Wiideman\n          \n            Steve Wiideman\n          \n            Steve Wiideman"
}