{
  "url": "https://moz.com/blog/great-content-for-seo-simpler-than-you-ever-imagined",
  "slug": "great-content-for-seo-simpler-than-you-ever-imagined",
  "title": "Great Content for SEO: Simpler than You Ever Imagined - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Today I want to share an incredibly simple yet massively powerful process for building search-optimized, \"great content.\" There's no fancy tricks and nothing propetiary about the approach, but it is rare indeed to find an organization that follows these steps and hence, it's a way to potentially…",
  "content": "Great Content for SEO: Simpler than You Ever Imagined Content Marketing By: Rand Fishkin April 26, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 26, 2011 Great Content for SEO: Simpler than You Ever Imagined Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Today I want to share an incredibly simple yet massively powerful process for building search-optimized, \"great content.\" There's no fancy tricks and nothing proprietary about the approach, but it is rare indeed to find an organization that follows these steps and hence, it's a way to potentially differentiate and build a competitive advantage. Step 1: Build a Survey No one knows what searchers want better than the searchers themselves, so let's hear what they have to say. To find out, we'll start with a short series of questions asking the survey taker to imagine they've just performed the desired query. Here's an example: See the full form in action here The basic structure is simple - request the top 3 content pieces your audience desires, then ask specifically about features that would make the page worthy of sharing (this is important, because it often differs substantively from what makes a page merely answer the user's query). Finally, you can ask them to actually do the search (you don't want them to do it until the end, because what they find might bias their responses) and report any results they liked (which can provide additional insight). Step 2: Send it to Your Customers / Potential Customers I cheated and used a tweet: You can find customers or potential customers virtually anywhere - your friends, neighbors, co-workers, friends on social networks, etc. Anyone who fits your customer demographic or is creative enough to imagine themselves as that demographic will work. A link in the bottom of your email newsletter or a share on Facebook/LinkedIn/Twitter can often do the job, too. You might even try posting a link in a relevant industry forum or discussion group (so long as you're sure it won't be perceived as spammy). Step 3: Record Responses + Leverage them to Build What the People Want My Twitter followers are clearly office chair experts because I got some fantastic responses: There are some fantastic suggestions in there - enough to form a serious roadmap for content generation and to steer me clear of crafting a landing page missing these features (which would likely increase bounce rate, earn less links/shares and, probably, have a lower conversion rate). It gets even more fleshed-out with the next section: You can see all the responses to my Tweet here Simply amazing. I really believe that by following the recommendations of these few, late-night, Twitter-obsessed, good web-samaritans, I could build a page of content better than anything the top 20 at Google or Bing have to offer right now. When you're doing this formally, collect as many responses as you reasonably can (before all the answers start to look the same) and use your intuition plus the aggregates of the data to make the best page possible. Any feature/content mentioned by 3+ respondents should definitely make the cut. From there, you can learn from what they liked/didn't in the current SERPs and bolster it with any remarkable suggestions they gave for making the page \"share-worthy.\" That's all there is to it. And while you're thinking, \"He's right! It's so easy... I can do this in 15 minutes tomorrow and have the perfect roadmap to build something searchers will love,\" you're probably busy and might put this on the back burner for another time. Don't do it! Implement now - even for just one keyword and one page. Even if you only get 2 responses! Heck, you can just fill it out yourself 4 or 5 times with how you think others might respond and it will still give you a better plan than 90% of what's in the top 10 results for most queries. If you follow this process and have examples to share, I'd love to see them in the comments. Feel free to use live links to your pages, feedback forms or responses. You might even be able to recruit some Moz readers to take your survey :-) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Great Content for SEO: Simpler than You Ever Imagined"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Great Content for SEO: Simpler than You Ever Imagined"
    },
    {
      "level": "H2",
      "text": "Step 1: Build a Survey"
    },
    {
      "level": "H2",
      "text": "Step 2: Send it to Your Customers / Potential Customers"
    },
    {
      "level": "H2",
      "text": "Step 3: Record Responses + Leverage them to Build What the People Want"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}