{
  "url": "https://moz.com/blog/great-site-for-learning-about-term-weight",
  "slug": "great-site-for-learning-about-term-weight",
  "title": "Great Site for Learning about Term Weight - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I stumbled across Professor Rich Ackerman's Theory of Information Retrieval Site today and found this excellent summary on the theory of normalized term weight. There's some nasty...",
  "content": "Great Site for Learning about Term Weight Search Engines By: Rand Fishkin August 19, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 19, 2005 Great Site for Learning about Term Weight Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I stumbled across Professor Rich Ackerman's Theory of Information Retrieval Site today and found this excellent summary on the theory of normalized term weight. There's some nasty math and equations but the explanations themselves are very clear. Ackerman even has a sample term vector calculation tool that searches a small set of 10 documents and ranks them based on term weight. SEOmoz is once again working on building an accurate term weight measurement tool so we can do away with keyword density once and for all. We're also deep into a tool to calculate the on-topic relevance of a page and are planning to train a bayesian algorithm on the DMOZ data dump and possibly a Wikipedia dump as well (depending on our bandwidth capabilities). It should be an exciting project when it's finished and will, as always, be available for free to the community. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Great Site for Learning about Term Weight"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Great Site for Learning about Term Weight"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}