{
  "url": "https://moz.com/blog/group-intelligence-search-tracking",
  "slug": "group-intelligence-search-tracking",
  "title": "Group Intelligence & Search Tracking - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The prediction power of a group is frighteningly accurate. Get a large number of individuals together and ask them to vote on the answer to a question and (as long as it has nothing to do with politics) you've got a nearly foolproof answering system. This group int...",
  "content": "Group Intelligence & Search Tracking SEO Analytics By: Rand Fishkin March 25, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 25, 2005 Group Intelligence & Search Tracking SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The prediction power of a group is frighteningly accurate. Get a large number of individuals together and ask them to vote on the answer to a question and (as long as it has nothing to do with politics) you've got a nearly foolproof answering system. This group intelligence has been exploited in the past by marketers, advertisers, governments & corporations, but the world of search gives us new insight.Mis-spellings, for example, can be checked by noting the number of results for a particular spelling of a word, phrase or name. Comparitive popularity can also be seen using the number of searches a particular term or phrase received vs. a competitor. For example, Thomas Hayden Church was recently signed to play Spiderman's nemesis in the third movie. But, the identity of the villain he portrays remains in doubt, but for this quote from Yahoo's Buzz Index: The most searched-on villain in Spider-Man's neighborhood is definitely Venom -- interest in the long-tongued hisser quickly went from zilch into the thousands once the casting decision was announced. Sandman and Black Cat also have a bit of a following, as does the Hobgoblin, but search-wise, they can't compare. So there you have it, Hollywood -- if you want to make the fanboys happy, give 'em a shot of Venom.Pretty compelling evidence, no? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Group Intelligence & Search Tracking"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Group Intelligence & Search Tracking"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}