{
  "url": "https://moz.com/blog/growing-your-internet-marketing-business-in-a-down-economy",
  "slug": "growing-your-internet-marketing-business-in-a-down-economy",
  "title": "Growing Your Internet Marketing Business in a Down Economy - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The economy is in the tank.  Hundreds of thousands of people are losing jobs every month.  Unprecedented numbers of people are losing their homes.  Yet we, as Internet Marketing Professionals, are blessed to be in the right market at the right time.",
  "content": "Growing Your Internet Marketing Business in a Down Economy Online Advertising A By: Alan Bleiweiss December 29, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! A By: Alan Bleiweiss December 29, 2008 Growing Your Internet Marketing Business in a Down Economy Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. The economy is in the tank. Hundreds of thousands of people are losing jobs every month. Unprecedented numbers of people are losing their homes. Yet we, as Internet Marketing Professionals, are blessed to be in the right market at the right time. We're in the perfect storm from a positive perspective in how we can grow and thrive even in this economy. I was on the phone yesterday with a client and, of course, the economy came up. We're just now getting her web site optimized and launching their AdWords campaign. Since it's so new and more needs to be done, it's slow going in terms of clicks and conversions. Yet I offered an insight about perspective that I'd learned a long time ago and that is just as valid today as it was when my wife and I first moved to California in 1993. Back then, we'd done a lot of research to determine where in California we wanted to live. I came up with Santa Cruz - not too far north, not too far south, populated enough to not be a complete bore, and right along the water. Yet it seemed that everyone I'd spoken with who had ever lived in Santa Cruz took the position that if we wanted to live there, we'd need to commute every day to work over the Santa Cruz Mountains and into the Silicon Valley along Highway 17 - dreaded for its narrow winding way and the inevitable accidents that the route is famous for which end up bringing traffic to a grinding halt and extending commute time through the roof. Personally, I despise long commutes if I have to take them every day. So this should have been a red flag to me. Yet I sat with it for a while, and my intuitive kicked in. Santa Cruz County isn't some barren landscape with no life. There are about 250,000 people living there. So with that many residents, even if the majority of them work \"over the hill,\" the fact is that there's going to be a lot of business being done right there in the county. Support businesses, entertainment, dining, shopping, etc. And with that awareness, we moved out from New York that November. When we first arrived, we stayed at my sister's up in Marin county. I immediately began job-hunting. And sure enough, within two weeks, I had a job as office manager for Thunderbird Real Estate. Right there in Santa Cruz County. The point here is that just because everyone around us seems to be drowning in doom and gloom, it doesn't mean we have to. There just may be a silver lining to other people's clouds. January marks my 14th year as an Internet Marketing consultant. Prior to this career, I spent a decade managing numerous businesses in a variety of industries. The first web site I created? It was for Thunderbird Real Estate. The previous year I had set them up with their own Real Estate BBS on the FidoNet (though that's another story for another time...). Through all of this history, I've come to learn some fundamental truths about business, about opportunity and about what it means to see beyond the noise, and not become lost in fear. (ask me some day about how I rode the dot-com boom). As a member of the American Marketing Association, I receive several publications each month that help shed light on the overall marketing industry. In an article from the November 15th 2008 issue of Marketing News, I read some statistics that confirm what I've intuitively understood regarding the prospects for our industry. According to the 2008 Chief Marketing Officer survey, while the overall economy is down in so many places, business marketing budgets will grow 2.4% in the coming year. Within marketing, non-Internet related marketing is expected to grow 1% while Internet marketing budgets are expected to grow 16% at the same time. This makes sense for so many reasons that I've seen and thought for a long time. First, the more the overall economy shrinks, the more companies need to do to reach the same people they used to reach who were previously willing to spend more. Second, a fundamental business concept is to find ways to make your marketing money work harder for you - to maximize the value for your expenditures. While traditional media costs so much (between $111,000 and $160,000 for a full page ad in the Wall Street Journal), there's only so much you can learn in regard to the effectiveness of print ads. Sure, you can include special codes, special URLs, or special phone numbers to associate when someone converts into a sale. Yet how many people see the print ad then go to the site's home page for more information? How many people see the ad and then do a search through Google based on a handful of words they remember from the ad? There's much less trackable correlation between print media ads and conversion tracking than you can get from Internet ad spending. At a fraction of the cost. Perhaps it's Google AdWords with its associated conversion tracking code. Or a clickable link embedded in a marketing email where that link has the ad-specific code embedded directly in that link. Or organic optimization where you can see increased site activity (and you can tie conversion tracking to specific keyword phrase search statistics). These are just a few examples of how we can directly help our business clients see much more accurately how successful their marketing initiatives are. The more accurately a client can gauge individual initiative effectiveness, the more we can work with them to refine, and thus improve results. Factor in the ability to perform A/B split testing, multivariate testing, and micro-analysis (down to the cost per click, and cost per conversion). This inevitably proves beyond a shadow of a doubt, to our clients, that their marketing investment is paying off or not. Like one client who sent me an email this week letting me know that our SEO work is paying off. Even though her site is only a couple months old in a highly competitive arena (they sell designer handbags at $400+ each) in a down economy, fully one in four sales are now from people who are coming to her site through Google and Yahoo. People who would not have found her site without our work. And we're not done with our optimization work yet either. And when our work IS paying off, the client is much better positioned to have their job, their department's portion of a company's overall spending, justified to the CFO or the CEO. And the smaller the company, the more one person wears all the hats. And the more one person wears all the hats, the less stress and fear and worry that person feels when they see tangible provable results that they are making the right decision about how and where to advertise and promote their offerings. With this understanding of the economy, and the mentality that goes into marketing budget decision making, and of how we can help our clients, it means we can be more effective in our own sales efforts. And that is a primary reason my company is on track for having a banner year. So as far as I'm concerned, we're in the right industry at the right time. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Growing Your Internet Marketing Business in a Down Economy"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Growing Your Internet Marketing Business in a Down Economy"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Alan Bleiweiss\n          \n            Alan Bleiweiss\n          \n            Alan Bleiweiss"
}