{
  "url": "https://moz.com/blog/growing-your-youtube-presence-guide",
  "slug": "growing-your-youtube-presence-guide",
  "title": "A Step-by-Step Guide to Setting Up and Growing Your YouTube Presence - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "YouTube is a huge search engine in its own right, and growing your presence there can be valuable for your brand, your presence in organic Google SERPs, and more. Check out this guide that walks you through methods of setting up and growing your YouTube presence, as well as tool suggestions and pro…",
  "content": "A Step-by-Step Guide to Setting Up and Growing Your YouTube Presence Video | Social Media By: Ann Smarty March 20, 2018 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Ann Smarty March 20, 2018 A Step-by-Step Guide to Setting Up and Growing Your YouTube Presence Video | Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. When was the last time you saw a video on YouTube? I bet you've seen one today. YouTube is too huge and too popular for marketers to ignore. If you don't have a YouTube channel, now's the time to start one. If you have a channel and you never got it off the ground, now's the time to take action. This article will take you through the process of setting up your YouTube presence, listing steps, tools, and important tips to get you started and moving forward. 1. Define your goals If your goal is to become a YouTube star, you might be a bit late to the party: it's really hard to get noticed these days — too competitive. Stardom will take years of hard work to achieve because of the number of channels users have to choose from. Even back in 2014, when I was reading about YouTube celebrity bloggers, one quote really stood out to me: “We think, if we were coming to YouTube today, it would be too hard. We couldn't do it.” That’s not to say, however, that you cannot achieve other, more tangible goals on YouTube. It's an excellent venue for business owners and marketers. Here are three achievable goals that make more sense than fame from a business perspective: 1.1. YouTube for reputation management Here's one thing about reputation management on Google: You’re never finished. Even if your reputation is fabulous and you love every single result that comes up in the SERPs for your business name, you may still want to publish more content around your brand. The thing is, for reputation management purposes, the more navigational queries you can control, the better: YouTube is the perfect platform for reputation management. YouTube videos rank incredibly well in Google, especially when it comes to low-competition navigational queries that include your brand name. Furthermore, YouTube videos almost always get that rich snippet treatment (meaning that Google shows the video thumbnail, author, and length of the video in the SERPs). This means you can more easily attract attention to your video search result. That being said, think about putting videos on YouTube that: Give your product/service overview Show happy customers Visualize customer feedback (for example, visual testimonials beautifully collected and displayed in a video) Offer a glimpse inside your team (show people behind the brand, publish videos from events or conferences, etc.) 1.2 YouTube videos for improved conversions Videos improve conversions for a clear reason: They offer a low-effort way for your customer to see why they need your product. Over the years, there have been numerous case studies proving the point: An older study (dating back to 2011) states that customers are 144% more likely to add products to a shopping cart after watching the product video Around 1 in 3 millennials state they have bought a product directly as a result of watching a how-to video on it This Animoto survey found that almost all the participants (96%) considered videos \"helpful when making purchasing decisions online\" Wistia found that visitors who engage with a video are much more likely to convert than those who don't That being said, YouTube is a perfect platform to host your video product overviews: it's free, it offers the additional benefit of ranking well in Google, and it provides additional exposure to your products through their huge community, allowing people to discover your business via native search and suggested videos. 1.3 YouTube for creating alternative traffic and exposure channels YouTube has huge marketing potential that businesses in most niches just cannot afford to ignore: it serves as a great discovery engine. Imagine your video being suggested next after your competitor's product review. Imagine your competitors' customers stumbling across your video comparison when searching for an alternative service on Youtube. Just being there increases your chances of getting found. Again, it's not easy to reach the YouTube Top 10, but for specific low-competition queries it's quite doable. Note: To be able to build traffic from inside your YouTube videos, you need to build up your channel to 10,000 public overall views to qualify to become a YouTube partner. Once approved, you'll be able to add clickable links to your site from within your videos using cards and actually build up your own site traffic via video views. 2. Develop a video editorial calendar As with any type of content, video content requires a lot of brainstorming, organizing, and planning. My regular routine when it comes to creating an editorial calendar is as follows: Start with keyword research Use question research to come up with more specific ideas Use seasonality to come up with timing for each piece of content Allocate sufficient time for production and promotion You can read about my exact editorial process here. Here's a sample of my content roadmap laying out a major content asset for each month of the year, based on keyword research and seasonality: For keyword and question research I use Serpstat because they offer a unique clustering feature. For each keyword list you provide, they use the Google search results page to identify overlapping and similar URLs, evaluate how related different terms in your list are, and based on that, cluster them into groups. This grouping makes content planning easier, allowing you to see the concepts behind keyword groups and put them into your roadmap based on seasonality or other factors that come into play (e.g. is there a slot/gap you need to fill? Are there company milestones or events coming up?). Depending on how much video content you plan to create, you can set up a separate calendar or include videos in your overall editorial calendar. When creating your roadmap, keep your goals in mind, as well. Some videos, such as testimonials and product reviews, won't be based on your keyword research but still need to be included in the roadmap. 3. Proceed to video production Video production can be intimidating, especially if you have a modest budget, but these days it's much easier and more affordable than you'd imagine. Keeping lower-budget campaigns in mind, here are few types of videos and tools you can try out: 3.1 In-house video production You can actually handle much of your video production in-house without the need to set up a separate room or purchase expensive gadgets. Here are a few ideas: Put together high-quality explanatory videos using Animatron (starts at $15/month): Takes a day or so to get to know all the available tools and options, but after that the production goes quite smoothly Create beautiful visual testimonials, promo videos, and visual takeaways using Animoto ($8/month): You don’t need much time to learn to use it; it's very easy and fun. Create video tutorials using iMovie (free for Mac users): It will take you or your team about a week to properly figure out all its options, but you'll get there eventually. Create video interviews with niche influencers using Blue Jeans (starts at $12.49/month) Create (whiteboard) presentations using ClickMeeting (starts at $25/month): Host a webinar first, then use the video recording as a permanent brand asset. ClickMeeting will save your whiteboard notes and let you reuse them in your article. You can brand your room to show your logo and brand colors in the video. Record your entire presentation using presentation mode, then upload them to your channel. 3.2 How to affordably outsource video production The most obvious option for outsourcing video production is a site like Fiverr. Searching its gigs will actually give you even more ideas as to what kinds of videos you might create. While you may get burned there a few times, don’t let it discourage you — there are plenty of creative people who can put together awesome videos for you. Another great idea is to reach out to YouTube bloggers in your niche. Some of them will be happy to work for you, and as a bonus you'll be rewarded with additional exposure from their personal branding and social media channels. I was able to find a great YouTube blogger to work for my client for as low as $75 per video; those videos were of top quality and upload-ready. There's lots of talent out there: just spend a few weeks searching and reaching out! 4. Optimize each video page When uploading your videos to YouTube, spend some time optimizing each one. Add ample content to each video page, including a detailed title, a detailed description (at least 300–500 characters), and a lot of tags. Title of the video: Generally, a more eye-catching and detailed title including: Your core term/focus keyword (if any) Product name and your brand name The speaker's name when applicable (for example, when you post interviews). This may include their other identifiable personal brand elements, such as their Twitter handle Event name and hashtag (when applicable) City, state, country (especially if you're managing a local business) Description of the video: The full transcript of the video. This can be obtained via services such as Speechpad. A good readable and eye-catching thumbnail: These can be created easily using a tool like Canva. Use a checklist: 5. Generate clicks and engagement Apart from basic keyword matching using video title and description, YouTube uses other video-specific metrics to determine how often the video should be suggested next to related videos and how high it should rank in search results. Here's an example of how that might work: The more people that view more than the first half of your video, the better. If more than 50% of all your video viewers watched more than 50% of the video, YouTube would assume your video is high quality, and so it could pop up in \"suggested\" results next to or at the end of other videos. (Please note: These numbers are examples, made up using my best judgment. No one knows the exact percentage points YouTube is using, but you get the general idea of how this works.) That being said, driving \"deep\" views to your videos is crucial when it comes to getting the YouTube algorithm to favor you. 5.1 Create a clickable table of contents to drive people in Your video description and/or the pinned comment should have a clickable table of contents to draw viewers into the video. This will improve deep views into the video, which are a crucial factor in YouTube rankings. 5.2 Use social media to generate extra views Promoting your videos on social media is an easy way to bring in some extra clicks and positive signals. 5.2.1 First, embed the video to your site Important: Embed videos to your web page and promote your own URL instead of the actual YouTube page. This approach has two important benefits: Avoid auto-plays: Don't screw up your YouTube stats! YouTube pages auto-play videos by default, so if you share a YouTube URL on Twitter, many people will click and immediately leave (social media users are mostly lurkers). However, if you share your page with the video embedded on it, it won't play until the user clicks to play. This way you'll ensure the video is played only by people who seriously want to watch it. Invest time and effort into your own site promotion instead of marketing the youtube.com page: Promoting your own site URL with the video embedded on it, you can rest assured that more people will keep interacting with your brand rather than leave to watch other people's videos from YouTube suggested results. There are also plenty of ways to embed YouTube videos naturally in your blog and offer more exposure. Look at some of these themes, for example, for ideas to display videos in ways that invite views and engagement. 5.2.2 Use tools to partially scale social media promotion For better, easier social media exposure, consider these options: Investing in paid social media ads, especially Facebook ads, as they work best for engagement Use recurring tweets to scale video promotion. There are a few tools you can try, such as DrumUp. Schedule the same update to go live several times on your chosen social media channels, generating more YouTube views from each repeated share. This is especially helpful for Twitter, because the lifespan of a tweet is just several minutes (between two and ten minutes, depending on how active and engaged your Twitter audience is). With recurring tweets, you'll make sure that more of your followers see your update. A project I co-founded, Viral Content Bee, can put your videos in front of niche influencers on the lookout for more content to share on their social media accounts. 5.3 Build playlists By sorting your videos into playlists, you achieve two important goals: Keeping your viewers engaged with your brand videos longer: Videos within one playlist keep playing on autopilot until stopped Creating separate brand assets of their own: Playlist URLs are able to rank both in YouTube and Google search results, driving additional exposure to your videos and brand overall, as well as allowing you to control more of those search results: Using playlists, you can also customize the look and feel of your YouTube channel more effectively to give your potential subscribers a glimpse into additional topics you cover: Furthermore, by customizing the look of your YouTube channel, you transform it into a more effective landing page, highlighting important content that might otherwise get lost in the archives. 6. Monitor your progress 6.1 Topvisor Topvisor is the only rank tracker I am aware of that monitors YouTube rankings. You'll have to create a new project for each of your videos (which is somewhat of a pain), but you can monitor multiple keywords you're targeting for each video. I always monitor my focus keyword, my brand name, and any other specific information I'm including in the video title (like location and the speaker's name): 6.2 YouTube Analytics YouTube provides a good deal of insight into how your channel and each individual video is doing, allowing you to build on your past success. You'll see traffic sources, i.e. where the views are coming from: suggested videos, YouTube search, external (traffic from websites and apps that embed your videos or link to them on YouTube), etc. The number of times your videos were included in viewers' playlists, including favorites, for the selected date range, region, and other filters. This is equal to additions minus removals. Average view duration for each video. How many interactions (subscribers, likes, comments) every video brought. You can see the stats for each individual video, as well as for each of your playlists. 6.3 Using a dashboard for the full picture If you produce at least one video a month, you may want to set up a dashboard to get an overall picture of how your YouTube channel is growing. Cyfe (disclaimer: as of recently, Cyfe is a content marketing client of mine) is a tool that offers a great way to keep you organized when it comes to tracking your stats across multiple platforms and assets. I have a separate dashboard there which I use to keep an eye on my YouTube channels. Conclusion Building a YouTube channel is hard work. You're likely to see little or no activity for weeks at a time, maybe even months after you start working on it. Don’t let this discourage you. It's a big platform with lots of opportunity, and if you keep working consistently, you'll see your views and engagement steadily growing. Do you have a YouTube channel? What are you doing to build it up and increase its exposure? Let us know in the comments. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Step-by-Step Guide to Setting Up and Growing Your YouTube Presence"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Step-by-Step Guide to Setting Up and Growing Your YouTube Presence"
    },
    {
      "level": "H2",
      "text": "1. Define your goals"
    },
    {
      "level": "H3",
      "text": "1.1. YouTube for reputation management"
    },
    {
      "level": "H3",
      "text": "1.2 YouTube videos for improved conversions"
    },
    {
      "level": "H3",
      "text": "1.3 YouTube for creating alternative traffic and exposure channels"
    },
    {
      "level": "H2",
      "text": "2. Develop a video editorial calendar"
    },
    {
      "level": "H2",
      "text": "3. Proceed to video production"
    },
    {
      "level": "H3",
      "text": "3.1 In-house video production"
    },
    {
      "level": "H3",
      "text": "3.2 How to affordably outsource video production"
    },
    {
      "level": "H2",
      "text": "4. Optimize each video page"
    },
    {
      "level": "H2",
      "text": "5. Generate clicks and engagement"
    },
    {
      "level": "H3",
      "text": "5.1 Create a clickable table of contents to drive people in"
    },
    {
      "level": "H3",
      "text": "5.2 Use social media to generate extra views"
    },
    {
      "level": "H4",
      "text": "5.2.1 First, embed the video to your site"
    },
    {
      "level": "H4",
      "text": "5.2.2 Use tools to partially scale social media promotion"
    },
    {
      "level": "H3",
      "text": "5.3 Build playlists"
    },
    {
      "level": "H2",
      "text": "6. Monitor your progress"
    },
    {
      "level": "H3",
      "text": "6.1 Topvisor"
    },
    {
      "level": "H3",
      "text": "6.2 YouTube Analytics"
    },
    {
      "level": "H3",
      "text": "6.3 Using a dashboard for the full picture"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H3",
      "text": "How to Create the Most Basic Google Business Profile Video with Canva, Even If You’re Not Great At This Stuff!"
    },
    {
      "level": "H3",
      "text": "On-page Video SEO – Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ann Smarty\n          \n            Ann Smarty\n          \n            Ann Smarty"
}