{
  "url": "https://moz.com/blog/guest-blogging-strategies-whiteboard-friday",
  "slug": "guest-blogging-strategies-whiteboard-friday",
  "title": "Guest Blogging Strategies - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Guest blogging can be a great way to help build up your brand, earn recognition, and even get some great links back to your site. When guest blogging it's important to study your audience so that you can produce the best content possible. Exceptional content is often heavily shared and that has…",
  "content": "Guest Blogging Strategies Whiteboard Friday By: Rand Fishkin March 1, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 1, 2012 Guest Blogging Strategies Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Guest blogging can be a great way to help build up your brand, earn recognition, and even get some great links back to your site. When guest blogging it's important to study your audience so that you can produce the best content possible. Exceptional content is often heavily shared and that has huge potential value for your site. In this week's Whiteboard Friday, we'll be covering a few guest blogging strategies that you can start using today. Please leave your comments below and maybe even share some of your own guest blogging strategies with us. Video Transcription Howdy, SEOmoz fans. Welcome to another edition of Whiteboard Friday. This week we're talking about guest blogging strategies. Guest blogging and guest authorship across websites other than your own is a fantastic strategy to build your brand, get in front of new people, earn some links back to your site, and earn the recognition from other communities that can lead to all sorts of good marketing opportunities in the future. But guest posting and guest blogging can also get really run down, spammy, manipulative, low quality, and junky. What I want to do today is talk about some strategies that will help you keep it high quality, help return exceptional value from those guest posts, and make sure that when you're contributing content you're not losing all of the value that you might get from putting it on your own site, or at least you're gaining enough in return to make that transaction worthwhile. So let's take a look at some of these. I want to walk through a step-by- step format here. The first step, of course, in any sort of guest authoring, guest posting situation is trying to find good targets. A few tools that I do recommend, obviously, there are some things you can do around Google searches, searching for blogs in your niche. You probably already know of some. But you can also use some more advanced searches. I like using things like \"guest author in URL blog\" or \"guest post\" or \"guest contributor,\" variations on these phrases. \"Guest posting guidelines\" or \"guest authoring guidelines\" or \"guest blog guidelines,\" using these types of queries inside of Google, inside of Bing can reveal a lot of different things. You probably want to add in something about your topic, some keyword that is related to you, something broad. So if you are, for example, in the world of, I don't know, contact lenses and eyeglasses, you might write about something like glasses or eyewear or ocular health or any of those types of things to try and find people in that world. I also highly recommend using a metric that's unique from the metrics that we typically talk about here at Moz. So certainly things like Domain Authority from Open Site Explorer and Page Authority, MozRank, those are all very good, very helpful. But you can go to google.com/reader and use their search function to actually search for blogs by name or by topic area, and you will find blogs with their subscriber count, the number of people who subscribe to them in Google Reader. What this number tells you is sort of how well read and how distributed is that blog. If you see something with maybe a dozen, a couple dozen readers, I'd be a little wary. I don't know how big or valuable that blog audience is going to be, and remember it's a lot of time if you are writing a high quality article, versus something that has hundreds or thousands, hopefully thousands, of subscribers. That has tremendous, tremendous value. This is also a good research tool in general. Then I also like using some of the blog directories if you are struggling to find topic areas, you're just not finding them using your keywords. Go dig in to some of these structured and organized hierarchies. BlogHer is an excellent directory list of blogs, primarily run by woman but also sort of around female-centric topic, woman-centric topics. My Blog Guest, another great community for finding things. Technorati and Alltop, two more that you could add to that list. I would also be seeking in the things that you are looking for, in the metrics and sort of things that you are looking for, try to find, if you can, blogs that get scraped. I know this is an odd one, but blogs that get scraped, it tends to be an indication that that blog is important and well-known and that other people are taking and using their content, some of them for legitimate purposes, some of them for less legitimate purposes. But the value comes particularly when you have a link from one of these sites that gets scraped and republished all over the Web, that you get links from a lot more domains than just the one domain where you're writing. Blogs that rarely have guest content. So, a lot of blogs out there are kind of in a little bit of this kind of spammy world of just, oh, yeah, yeah, I take guest posts from everywhere, we post guest posts around, and we're more like a low quality content link directory. If you find blogs that, hey, you know, four or five days out of the week the primary writers are writing there and then maybe one guest post a week. Great. Those are excellent targets typically speaking from a quality standpoint. Then finally, non-blog news and content sites that have guest authorship opportunities. I know this sounds a little odd, but the idea here is that you can contribute just like you could to newspapers or to traditional print publications, editorial content, or guest content, and those types of ways. When that gets published, it is often a very, very unique place and an audience that your competitors are going to have a very tough time reaching. Step two, let's go in to this building relationship. I despise this idea that, \"Oh, you know, hey, Rand, I wrote this post about metadata for SEO. Please publish it on SEOmoz.\" Who are you? Do we know each other? This is a very odd transaction. Right? No one comes up to me in the street and is like, \"Hey, hey Rand, wear this T-shirt. I want you to wear this T-shirt. It's got my brand on it.\" This is my bad Jersey. Sorry about that everyone. All right. I was born in New Jersey, so, you know, I have an excuse. But you need that relationship before you're going to do this kind of outreach and ask these questions So what I recommend is using the social networks, right, Twitter, Facebook, LinkedIn, Google+. Do you like my Twitter bird here? He doesn't really have wings. Does he look better? Better or worse? A little worse. Eh, he's Christmassy though. What I highly recommend is four weeks, a minimum of four weeks of interaction and engagement with your target for outreach, with your target that you're trying to reach out to for your guest posting, before you send them the request. Let them know that you're a real person, that you know who they are, that you've researched them, that you've been in touch. After spending time interacting and engaging over social media, on their blog itself, I recommend at least two or more unique mediums, meaning maybe Twitter and Facebook, maybe Twitter and Google+, maybe Twitter and their blog, and do leave some comments on their blog so that they get to know you. They're approving those comments. They're seeing you in there. You have a presence in their community. Other people who are reading their site are knowing who you are. And do try to help them with something. Over these four weeks of engagement they will probably tweet something, say something, blog about something, have some kind of request, or you can figure it out yourself from looking at their About page and reading more about them that, oh you know what, this person, they are very, very curious about this particular topic or they are traveling here and they want some tips. Whatever it is, reach out and try and help in some way. If that is your first point of contact, the relationship is going to be much better than if the first thing you ask for is a favor - \"Hey will you post my guest post?\". Step three, you want to optimize your content, the content you're going to be writing, for their audience. So you want to be looking at their readers and asking questions like, \"Well, what do the readers like?\" You can see what people have guest posted previously, if there have been some. You can see what the authors are writing about. You kind of get this sense of, oh, wow, you know, this community is really focused on these topics and they seem to lean in these directions sort of emotionally and psychologically and politically and from a technical standpoint and here's what they understand and don't understand and here's how in-depth they like their material. Fantastic. Great. You know more about them. You're going to be able to write far more effective content that's (a) more likely to get published and (b) more likely to be shared by that audience. Remember, you don't just want a post to go up and provide you with a link. You're looking for that content to spread far and wide. You want lots of people sharing it, lots of people following your Twitter account after you've shared it with people. You want people visiting your site, finding more content like that, and then subscribing to your blog and RSS feed, following your brand on Facebook and all these other social networks. You want to get those people into the top of your marketing funnel so that they are comfortable and familiar with you and they trust you and like you. The way to do that is to study the audience where you're going to be participating. So, what earns comments, shares, and likes? If you use the Open Site Explorer top pages tool for this, you can actually go to a blog and then see, hey, what's been the most successful content and you can see all the social share numbers and all that kind of stuff and the links too. You can also ask yourself, \"What kinds of questions does this community have?\" If it is a highly participatory community, you'll often see that engagement. You can start to follow people who are deep in that community and see, oh, yeah, they're constantly asking these kinds of questions. I can answer that content. Finally, step four, I want to try to help you with some specific tactics that are going to earn outsize returns from your guest content. So, one of the first ones, one of the ones that I highly, highly recommend is you're usually getting a link, but that link is often in the form of a bio and people, if you submit a guest post and it has a lot of anchor text links pointing to your content, no one is going to approve it. People are going to think you're spammy. Even if the content is great, they're going to assume you're just there for the SEO, and they don't want any part of it. But you can get great links back to your site and a lot of visits to your site if you have embeddable content. So things like images and graphics or videos or interactive tools, interactive content that you're referencing back on your site that for obvious reasons can't live in the post itself. Right. Now, you might have a small version of an infographic or a small version of a photo, but then you would link off to the larger version of that photo or the larger version of that graphic, which would live on your site. That's a great thing to do too because it means that the hosting is offloaded from the guest blog publisher who might not have the world's most robust hosting, and if they are getting tons and tons of bandwidth requests, it's not exactly ideal. I also recommend a few other ones. If you can, if you have a few blogs that you know, hey, this audience is phenomenal, ask if you can do a series. Say, \"Hey, I have a three or four part series on this specific topic.\" It's very, very wide, it's broad. Great. Write three or four guest posts and that will get you more and more familiarity with that audience, earn you better branding, earn you more links, all those good things. When you are guest posting, you often have a target list of many, many folks. You're going, \"Oh well, I'm going after this guy. Then I want to go after these three guys over here, these three other blogs.\" Oh yeah? Well, when you write for this guy, freaking link to these guys. What does that do? That says to these people, \"Oh, wow, this is cool. I got a link from this other post. Oh, interesting, it's a guest author. He must follow me, he must like me.\" Fantastic. Now you're relationship building in the future. They're going to get the trackback and the ping for this. You'll have done them a favor by giving them a nice link to some of their content you recognized. You're building that relationship. Fantastic. Do that. When you are writing for one, link to the others. Bio links. Bio links are tough, but you can actually, if you are clever and smart about how you interact with these, you can get the anchor text to overlap well with your branding. So, for example, I use this example a lot. Whenever I have my bio go on other people's sites, I like to link to my wife's travel blog. Now, obviously people would get very suspicious if I said travel blog, and Geraldine, my wife, of course, refuses to do any SEO herself. So, yeah, anyway, whole other story, we could do a Whiteboard Friday about that. So what I like to do, is I like to say, \"Rand's wife, Geraldine, chronicles their adventures in her Serendipitous travel blog,\" and that is the link that I use. So it is sort of a, \"Oh, you know, this is a clever combination.\" It does get the words travel blog in there, which I hope some day she might rank for. I think she has a great travel blog, so I hope that she does. The idea here is that you take your brand, right, so if you have your eyeglasses site, you might say, \"Well, Kenny's nascent eyewear site is doing quite well in this particular vertical.\" Whatever it is, you want to try and craft that in a clever way so that you include some anchor text, include some branding. Finally, last thing here. When a lot of people write guest posts, they do one of two things, and I think both are kind of dumb. Number one is they don't do any SEO. They're not actually targeting keywords. They think to themselves, \"Well, I want to target keyword phrases and rank for stuff on my site, not on someone else's.\" That's weird. The second thing they do is they try and target their primary keyword phrases on somebody else's site, which, of course, is also a little bit strange. I understand these are two dichotomous opinions here. But what I highly recommend is target those secondary or tertiary keyword phrases, the ones that you wouldn't go after because they're not super high volume. Maybe they're secondary or tertiary in your list of important keywords to go after. But you do want to try and own those search results, and one of the ways to do it is with a guest blog post. So doing a little bit of that keyword research upfront, figuring out the terms and phrases that you really want to rank for, targeting those on your site, the ones that are of secondary importance and maybe thinking about those as great guest posting opportunities, because, remember, guest posts, especially on powerful blogs, they're going to earn lots of links, they have high potential to rank, and of course, if they do that and they earn lots of nice link juice, the links pointing back to you are going to be authoritative and helpful for your own SEO. All right everyone. I hope to see lots of phenomenal guest posts from you all over the Web. Great content only. I don't want to see any more of this mishmash SEO spammy crap. I hope you'll join us again next week for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Guest Blogging Strategies"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Guest Blogging Strategies"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}