{
  "url": "https://moz.com/blog/guide-to-ads",
  "slug": "guide-to-ads",
  "title": "An SEO Guide to Adsense, Ads and Placement - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "SEOs don't talk about advertising much, perhaps because it's the conceptual opposite of “great content.” The truth is, advertising is the gasoline that runs much of the web. Without ad revenue, great sites we love like Search Engine Land, Smashing Magazine, and even Wired might...",
  "content": "An SEO Guide to Adsense, Ads and Placement On-page SEO By: Cyrus Shepard November 8, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Cyrus Shepard November 8, 2011 An SEO Guide to Adsense, Ads and Placement On-page SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. SEOs don't talk about advertising much, perhaps because it's the conceptual opposite of “great content.” The truth is, advertising is the gasoline that runs much of the web. Without ad revenue, great sites we love like Search Engine Land, Smashing Magazine, and even Wired might cease to exist. Ads are great, but as SEOs we need to present them as the commercials that they are, not the main show. Optimizing for CTR the Old Way Not long ago, it was common to see sites like this dominating the SERPs. (Thanks to Michael Gray for the lead) When Panda struck, sites like this got hit hard, time and time again. Even websites with superior content were penalized if they contained over-aggressive ads above the fold. I don't know if the site above was penalized by Panda, but I'm guessing their traffic is not as healthy as it could be, and a simple layout change would help significantly. 1. Ads as a Ranking Factor The 2011 Ranking Factors showed a slight negative correlation between rankings and the amount of Adsense on a page. Several Panda updates have rolled out since this data was collected, and I would expect the relationship today to be even more negative. Although Adsense isn't the only game on the market, it's the one ad network SEOs get the most information from. Matt Cutts has said that his team sends one way messages to the Adsense team in order to help webmasters comply with Google quality guidelines. In April, after Panda hit, Adsense changed how they advocate best practices for ad placement. Gone (or at least tucked away) were the old heat maps. 2. Panda Friendly Layouts The new layouts specifically advocate for ads that do not push content below the fold. These are the types of layouts that should be safe no matter what kind of ads you run. You can see earlier versions in their one-click optimizer, but these older layouts don't go very far in placing content first. Use at your own risk. 3. Balance Your Template Footprint Ads are a component your template footprint. A template footprint is any non-unique content that appears on every page, as opposed to content that makes the page unique. It's best to keep your ratio of unique content to footprint as high as possible. If you can't reduce your template footprint, at least place your content in the highest, most prominent place possible in order to stay out of the penalty zone. 4. Future Proof Your Ads The new Adsense recommendations are great for this round of Panda, but what about next year? In my opinion, they represent the minimum of what you should do to avoid a penalty. The New York Times does a good job of balancing ads against content. Their strategy neither ignores users nor puts them at risk for near-future algorithm changes. Aggressive ads tend to alienate users, which can affect your bounce rate, time on site, pageviews and other user engagement metrics. All of these can have undesirable long term consequences. For publishers dedicated to long term profits, there is a better approach. 5. Beyond CTR – Smart Ways to Increase Ad Revenue It's true that higher click-through rates give webmasters incentive to place ads above content. But CTR isn't the only way to increase earnings. You can optimize several other factors to your long term advantage. If you are an Adsense publisher, you are familiar with these concepts. 1. Coverage 2. Cost-Per-Click (CPC) 3. Cost Per Impression (CPI or CPM) 4. Impressions All of these can be optimized for higher earnings. Number 4, impressions, is the most actionable from an SEO point of view. If you're producing great content and promoting it the right way, then your pageviews will soar. Here in the States, the SuperBowl will always make more in ad revenue than reruns of Murder, She Wrote. If you sell ads, be the SuperBowl of content publishers. Produce the best content you can, and you can sell your premium ad space for top dollar. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "An SEO Guide to Adsense, Ads and Placement"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "An SEO Guide to Adsense, Ads and Placement"
    },
    {
      "level": "H2",
      "text": "Optimizing for CTR the Old Way"
    },
    {
      "level": "H2",
      "text": "1. Ads as a Ranking Factor"
    },
    {
      "level": "H2",
      "text": "2. Panda Friendly Layouts"
    },
    {
      "level": "H2",
      "text": "3. Balance Your Template Footprint"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "4. Future Proof Your Ads"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "5. Beyond CTR – Smart Ways to Increase Ad Revenue"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Cyrus Shepard\n          \n            Cyrus Shepard\n          \n            Cyrus Shepard"
}