{
  "url": "https://moz.com/blog/guide-to-googles-disavow-tool",
  "slug": "guide-to-googles-disavow-tool",
  "title": "When & How to Disavow Backlinks in 2021 [Google Disavow Tool] - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It’s been nearly nine years since Google rolled out its Disavow Tool. This guide covers how and when to use it, and the potential risks and benefits.",
  "content": "When & How to Disavow Backlinks in 2021 Link Building | Search Engines By: Tom Capper April 28, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Tom Capper April 28, 2021 When & How to Disavow Backlinks in 2021 Link Building | Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This post will cover step-by-step how and when to use — and when not to use — Google’s Disavow Tool. I’ll also comment on what place it has in an SEO’s toolset in 2021, given the widespread doubts around its ongoing usefulness. First, though, a little background. The Disavow Tool was launched in late 2012, into an SEO ecosystem very different from the one we work in today. The Penguin link-spam update was still very new, and Manual Actions were commonplace. Working in an SEO agency in 2013 and 2014, I remember this being a common source of new business — sites that had been working with a less reputable agency on link building work would receive a message from Google, and all or part of their site would disappear from search results. They’d come to us to get it fixed, and we’d trawl through their portfolio of terrible links, work on a disavow file, and engage in what was often a drawn out back-and-forth, exchanging messages with Google employees through Google Search Console (or Webmaster Tools as it was then). What was particularly different compared to today’s landscape was that generally, if you had been penalized because of link building tactics, you were explicitly told, and the tactical implications were extremely clear and included use of the Disavow Tool. Nowadays, it’s very, very rare for someone to get a manual action. If your traffic drops, you have no way of knowing for sure whether it’s for some link-based reason, or something else entirely. Your traffic may indeed bounce right back with the next Core Update, even if you do nothing — that’s something I’ve seen happen to numerous sites. British news site, The Daily Mail, were so confused by this pattern that they’re suing Google over it. So, in this divergent landscape, is the Disavow Tool a dinosaur, or still relevant? Is the Disavow Tool still useful in 2021? Traffic drops So now, if you experience a big traffic drop, but you don’t have a manual action, should you disavow? Google seems to say no. In 2020, Marie Haynes asked Google’s John Mueller if a site could see increased traffic after using the Disavow Tool, even if it did not have a manual action (i.e. a visible message in Google Search Console.) John Mueller said such a benefit would be “very rare”, essentially suggesting that if sites see benefit after a disavow, it’s probably a case of correlation rather than causation. This builds on previous advice from Google to the effect that its algorithms were now intelligent enough to just ignore bad links, rather than requiring some penalty action. However, if you have just seen a big traffic drop, you probably want to cover your bases and try everything that might reasonably work, right? A sensible first step would be to take a look at your backlink portfolio and see whether, broadly, it seems suspicious. Of course, everyone has some bad links, but are you heavily reliant on them? Are a lot of them recent? Moz’s own Spam Score is the perfect metric for this task if you’re stuck, and this post gives a good walkthrough. If, after reviewing your own link portfolio, you think maybe you deserved the traffic drop after all, perhaps a disavow file should be part of your clean-up plan. But remember: if you were reliant on questionable links, the disavow is supposed to wipe those out — meaning you’ll have to replace them with some hard-earned, legitimate equivalents. Proactive disavow What if your traffic is fine right now, but you’re worried about the skeletons in the closet? Perhaps you think it’s remarkable you (or your client) is getting away with the state of their link portfolio, and it’s an accident waiting to happen? Or maybe you believe someone is building dodgy-looking links to your site in a deliberate effort to do harm, or just for some unrelated reason that ends up looking bad nonetheless? In these cases, you can consider a proactive disavow, again as an “erring on the side of caution” measure. I would advise a very light touch, though, as there’s an element here of “don’t fix what isn’t broken”, and it would be all too easy to do more harm than good. Which links should I disavow? I won’t go into too much detail here, as there’s already an excellent Whiteboard Friday on the topic: What Links to Target with Google’s Disavow Tool. A rough process could look something like this: Use Spam Score to narrow down your analysis to links you’re particularly concerned about.Use Excel, Google Sheets, or similar, to prioritize some links for manual review (if a site links to you 10,000 times, you probably only need to review a handful to get the idea!). Remember at this stage to cut out any links that are nofollowed, expired, 404ed, or otherwise no longer passing equity.Look through the links you’ve found, and ask yourself what motive the author might have had for placing them. If you can’t imagine any reason other than financial incentive or the site’s security being compromised, you might want to disavow that link. If all the links from that domain look like this, you might want to disavow the domain. Use Spam Score to narrow down your analysis to links you’re particularly concerned about. Once you’ve figured out which links and domains you want to disavow, you can proceed to the next step. How to check your disavow file You can always download your existing disavow file, as long as you have Google Search Console access. It’s always a good idea to take a look at what this contains — at this point many sites have a historic disavow file, often with comments revealing the reasoning and the time that any links were originally added. You can navigate to the tool here, and select your site from the dropdown. Be aware though that the disavow tool is old, so it doesn’t support domain properties. Instead, you’ll need to look at prefixes (e.g. “https://www.moz.com”, instead of just “moz.com”). It’s very likely that any old disavow file was uploaded in the era of HTTP rather than HTTPS too, so you’ll need to make sure your HTTP:// and HTTP://WWW. properties are verified. Example disavow file upload.Can I remove links from a disavow file? What if you find some domains in a disavow file that you’re pretty sure shouldn’t be there? I’ve been in situations quite a few times where I’ve found an old disavow file that was probably created in a bit of a panic, and perhaps disavows some of the site’s best — and cleanest — links. In a couple of cases, I’ve even seen sites that disavow themselves. In these cases, I’ve corrected the errors, and I have to say I’ve seen no positive uplift from doing so. Which leaves a few possible explanations: 1. Google ignores disavow files altogether anyway or 2. Once a link is disavowed, there’s no going back or 3. Google ignores clearly errant entries or 4. These sites weren’t in a position to benefit from more links anyhow This tweet from John Mueller in 2019 explicitly rules out option 2, and sort of implies option 1 isn’t the case either. If you remove something from a disavow fire and upload it again, then it won't be disavowed anymore, so that should just work.— 🍌 John 🍌 (@JohnMu) August 13, 2019 My suspicion, given my familiarity with the cases I mentioned above, is some combination of answers 3, and 4. These weren’t sites that generally lacked for authority compared to their peers (quite the contrary), but I’d expect disavowing yourself to be a fatal blow if it had any effect at all. The two sites that had done this were by no means dead, so I guess disavowing yourself has no effect. So yes, you can remove links from a disavow file. How to create a disavow file A disavow file is fundamentally just a text (.txt or .csv) file. Each line in the text file must be one of the following: A disavowed link, e.g. https://example.com/dodgyA disavowed domain (meaning every link from this domain is gone), e.g. domain:example.comA comment (which Google will ignore, but your colleagues may find useful in the future), e.g. #New disavows 2021-02-01 Here’s how those might look together: Example disavow file. A few important notes: You can disavow subdomains. E.g. domain:blog.example.com This is particularly useful if you have links from some questionable blogspot sites (e.g. dodgyblog.blogspot.com), but you don’t necessarily want to disavow every blogspot site, even though they all share a domain (blogspot.com). A disavow file must be UTF-8 or 7-bit ASCII If you build your disavow file by pasting from Excel into Notepad, for example, you’d need to then navigate to “Save As” and make sure it looks like this:Example save for disavow file in correct format. Maximum file size is 2MB, or 100,000 lines I’ve heard ex-Googlers suggest a 10,000 row limit in the past, but Google’s own official advice suggests the larger figure of 100,000 rows. How to submit a disavow file Navigate to the tool. It’s now impossible to navigate to the Disavow Tool through Google Search Console. Instead, you need to navigate to https://search.google.com/search-console/disavow-links.Select the site you want to disavow links for. Remember that you’ll need to be verified on the relevant prefix property (e.g. https://moz.com, as that’s the indexed version of this site — not http://moz.com, https://www.moz.com, etc.).Upload your disavow file. Depending on whether you previously had a disavow file, you’ll get a button saying either “Upload disavow list” or “Replace”. If it’s the latter, make sure you keep a copy of the old one as backup! Upload disavow file.Using the Disavow Tool after a domain migration In theory, you only need to disavow on the new target domain — there’s no need to go back and update disavow files on old properties that now 301 to the current canonical version. For example, there would be no need for Moz to update the disavow file on: http://moz.comhttp://seomoz.org That does mean that if you already have a disavow file you’re happy with, and you’re undergoing a planned migration, it’d be a good idea to bring it with you and re-upload on the new property. Weighing the risks and benefits The hazard of the Disavow Tool is that you don’t know which of your links are doing more harm than good — if any. Furthermore, if you actually are engaged in nefarious link building practices, there’s a very good chance that a disavow file is helping Google to profile the links you build as bad, which will make it even harder for you to succeed on your next project. The benefits, meanwhile, are uncertain, poorly documented, and nigh-impossible to test. I have worked on sites in the past few years that proactively disavowed links and then saw improvements, but this kind of SEO activity does not exist in a vacuum — numerous Core Updates, competitor changes, offline marketing initiatives, and new content came and went in the meantime. Overall, my advice would be to use the Disavow Tool sparingly, and with caution. If you have links you are confident are doing you no good, then ultimately it may put your mind more at ease if you disavow than if you don’t. I’d love to hear other SEOs’ philosophies on this grey area, though. Let me know your thoughts in the comments below. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "When & How to Disavow Backlinks in 2021"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "When & How to Disavow Backlinks in 2021"
    },
    {
      "level": "H2",
      "text": "Is the Disavow Tool still useful in 2021?"
    },
    {
      "level": "H3",
      "text": "Traffic drops"
    },
    {
      "level": "H3",
      "text": "Proactive disavow"
    },
    {
      "level": "H2",
      "text": "Which links should I disavow?"
    },
    {
      "level": "H2",
      "text": "How to check your disavow file"
    },
    {
      "level": "H2",
      "text": "Can I remove links from a disavow file?"
    },
    {
      "level": "H2",
      "text": "How to create a disavow file"
    },
    {
      "level": "H3",
      "text": "You can disavow subdomains."
    },
    {
      "level": "H3",
      "text": "A disavow file must be UTF-8 or 7-bit ASCII"
    },
    {
      "level": "H3",
      "text": "Maximum file size is 2MB, or 100,000 lines"
    },
    {
      "level": "H2",
      "text": "How to submit a disavow file"
    },
    {
      "level": "H2",
      "text": "Using the Disavow Tool after a domain migration"
    },
    {
      "level": "H2",
      "text": "Weighing the risks and benefits"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Tom Capper\n          \n            Tom Capper\n          \n            Tom Capper"
}