{
  "url": "https://moz.com/blog/guide-to-local-sponsorship-marketing",
  "slug": "guide-to-local-sponsorship-marketing",
  "title": "The Guide to Local Sponsorship Marketing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Local sponsorships are an actionable strategy that offer dozens of marketing benefits. Just like content campaigns, local PR campaigns, or review management, they have their own set of rules and best practices. Learn all about local sponsorship marketing and where they belong in your local SEO plan.",
  "content": "The Guide to Local Sponsorship Marketing - The 2018 Edition Local SEO | Marketing Industry | Branding By: Claudia Cruz April 3, 2018 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Claudia Cruz April 3, 2018 The Guide to Local Sponsorship Marketing - The 2018 Edition Local SEO | Marketing Industry | Branding The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. For most Moz readers, local marketing means content, reviews, AdWords, local listings, and of course citations. If you’re a larger brand, you might be doing outdoor, radio, print, and television advertising as well. Today we’re here to humbly submit that local sponsorships remain the most-overlooked and opportunity-rich channel, and they build real local connections for both large brands and small business alike. This article is the second edition of the ZipSprout team’s guide to local sponsorships. We wrote the first edition in 2016 after a few months of securing local sponsorship campaigns for a handful of clients. Since then, we’ve tripled our client roster and we’ve worked with more than 8,000 local organizations, donating nearly $1,000,000 in local sponsorships to 1,300+ opportunities. Since then we’ve also learned how to build campaigns for local presence. So we knew the guide was due for a reboot. One of our most significant learnings of the past two years is the understanding of local sponsorships as a channel in their own right. They can be directed toward local SEO or local marketing campaigns, but sponsorships are their own breed of local connection — and just like content campaigns, local PR campaigns, or review management, local sponsorships have their own set of conventions and best practices. This article is meant for anyone with an eye toward local sponsorships as a marketing channel. Agencies and enterprise organizations may find it particularly helpful, but we’re big believers in encouraging smaller local businesses to engage in sponsorships too. Get out there and meet your neighbors!The what & why of local sponsorshipsLocal events, nonprofits, and associations constitute a disjointed but very real network of opportunities. Unlike other channels, local sponsorships aren’t accessible from a single platform, but we’ve found that many sponsorships share similarities. This makes it possible to develop processes that work for campaigns in any metro area. Local sponsorships are also a unique channel in that the benefits can range from the digital to the analog: from local links to a booth, from social posts to signage on a soccer field. The common thread is joining the community by partnering with local organizations, but the benefits themselves vary widely. We’ve identified and track 24 unique benefits of sponsorships related to local marketing:Ad (full or partial)Advertising on event appBlog post featuring sponsorBooth, tent, or table at eventEvent named for sponsorGuest post on organization blogInclusion in press releaseLink in email newsletterLink on websiteLogo on event t-shirt or other swagLogo on signageLogo or name on websiteMedia spots (television/radio/newspaper)Mention in email newsletterMention in publicity materials, such as programs & other printed materialsNetworking opportunityPhysical thing (building, etc.) named for sponsorSocial media mentionSpeaking opportunity at eventSponsor & sponsor's employees receive discounts on services/products/eventsSponsor can donate merchandise for goodie bagsSponsored post (on blog or online magazine)Tickets to eventVerbal recognitionThere are probably more, but in our experience most benefits fall into these core categories. That said, these benefits aren’t necessarily for everyone...Who shouldn’t do local sponsorships?1. Don’t do local sponsorships if you need fast turnaround.Campaigns can take 1–3 months from launch until fulfillment. If you’re in a hurry to see a return, just increase your search ad budget.2. Don’t do local sponsorships if you’re not okay with the branding component. Local link building can certainly be measured, as can coupon usage, email addresses gathered for a drawing, etc… But measuring local brand lift still isn’t a perfect art form. Leave pure attribution to digital ads.3. Don’t do local sponsorships with a \"one size fits all\" expectation. The great thing about local events and opportunities is their diversity. While some components can be scaled, others require high touch outreach, more similar to a PR campaign. Considerations for agencies vs brands in local sponsorship campaignsAgencies, especially if they’re creating sponsorship campaigns for multiple clients, can cast a wide net and select from the best opportunities that return. Even if a potential partnership isn’t a good fit for a current client, they may work for a client down the road. Brands, on the other hand, need to be a little more goal and mission-focused during prospecting and outreach. If they’re reaching out to organizations that are clearly a bad fit, they’re wasting everyone’s time. Brands also need to be more careful because they have a consumer-facing image to protect. As with any outreach campaign, there are dos and don’ts and best practices that all should follow (DO be respectful; DON’T over-email), but brands especially have more to lose from an outreach faux pas.Our processOutreachOnce we’ve identified local organizations in a given metro area, we recommend reaching out with an email to introduce ourselves and learn more about sponsorship opportunities. In two years, the ZipSprout team has A/B tested 100 different email templates. With these initial emails, we’re trying to inform without confusing or scaring away potential new partners. Some templates have resulted in local organizations thinking we’re asking them for sponsorship money or that we want to charge them for a service. Oops! A/B tests have helped to find the best wording for clarity and, in turn, response rate. Here are some of our learnings: 1. Mentioning location matters. We reached out to almost 1,000 Chicago organizations in the spring of 2017. When we mentioned Chicago in the email, the response rate increased by 20%. 2. Emails sent to organizations who already had sponsorship info on their websites were most successful if the email acknowledged the onsite sponsorship info and asked for confirmation. These are also our most successful outreach attempts, likely because these organizations are actively looking for sponsors (as signified by having sponsorship info on their site). Further, by demonstrating that we’ve been on their site, we’re signaling a higher level of intent.3. Whether or not we included an outreacher phone number in email signatures had no effect on response rate. If anything, response rates were higher for emails with no phone number in signature, at 41% compared with 40.2%. 4. Shorter is better when it comes to outreach emails. Consider the following two emails: EMAIL A Hi [NAME], I sent an email last week, but in case you missed it, I figured I’d follow up. :) I work to help corporate clients find local sponsorships. We’re an agency that helps our business clients identify and sponsor local organizations like [ORG NAME]. We’re paid by businesses who are looking for local sponsorships. Often, local organizations are overlooked, so my company, ZipSprout, works for businesses who want to sponsor locally, but aren’t sure who to partner with. To that end, I'd love to learn more about [ORG NAME] and see what sponsorship opportunities you have available. Is there a PDF or list of cost and benefits you can share over email or a phone call? Thanks, ___EMAIL B Hi [NAME], I sent an email last week, but in case you missed it, I figured I’d follow up. :) I'd love to learn more about [ORG NAME] and see what sponsorships you have available. Is there a PDF or list of cost and benefits you can share over email or a phone call? Thanks, ___In an 800-email test, Email B performed 30% better than Email A.Matchmaking: How can I choose a sponsorship opportunity that fits my brand? There are many ways to evaluate potential sponsorships.These are the questions that help us match organizations with clients: Who is your brand targeting (women, senior citizens, family-friendly, dog owners, new parents)?Do you want to tie your brand with a particular cause (eco-friendly, professional associations, awareness foundations, advocacy groups)?Is your campaign based on location? Are you launching your brand in a particular city? A particular zip code?What is your total budget and per-sponsorship range? A top max price or a price range is a useful parameter — and perhaps the most important.Once the campaign goals are determined, we filter through opportunities based partially on their online presence. We look at Domain Authority, location, website aesthetics, and other sponsors (competitors and non-competitors) in addition to Reach Score (details below). Further, we review backlinks, organic traffic, and referring domains. We make sure that this nonprofit partnership is not spammy or funky from an SEO perspective and that is a frequently visited website. A small organization may not have all the juicy digital metrics, but by gauging event attendance or measuring organic traffic we can further identify solid prospects that could have been missed otherwise. We also look at social media presence; event attendance, event dates and how responsive these organizations or event organizers are. Responsiveness, we have learned, is a CRITICAL variable. It can be the determining point of your link going live in 48 hours or less, as opposed to 6+ months from payment. Reach ScoreFrom a numbers perspective, Domain Authority is a good way to appreciate the value of a website, but it doesn’t tell the whole story when it comes to local marketing. To help fill in the gaps we created Reach Score, which combines virtual measures (like Domain Authority) with social measures (friends/followers) and physical measures (event attendance). The score ranks entities based on their metro area, so we’re not comparing the reach of an organization in Louisville, KY to one in NYC.As of March 2018, we have about 8,000 organizations with valid Reach Scores across four metro areas — Raleigh/Durham, Boston, Houston, and Chicago. The average Reach Score is 37 out of 100. Of the 34 types of organizations that we track, the most common is Event Venue/Company (average Reach Score of 38), followed by Advocacy Groups (43) and Sports Teams/Clubs/Leagues (22). The types of organizations with the highest Reach Scores are Local Government (64), Museums (63), and Parks and Recreation (55).Thanks to Reach Score, we’ve found differences between organizations from city to city as well. In Raleigh-Durham, the entities with the highest reach tend to be government-related organizations, such as Chambers of Commerce and Parks & Rec Departments. In Boston, the highest reach tends to fall to arts organizations, such as music ensembles, as well as professional associations. This score serves as a good reminder that each metro area has a unique community of local organizations. (Read more about our Reach Score findings here.) FulfillmentOur campaigns used to take several months to complete, from contract to final sponsorship. Now our average fulfillment rate is 18.7 days, regardless of our project size! Staying (politely) on top of the communication with the nonprofit organizations was the main driver for this improvement.We find further that the first 48 hours from sending a notification of sponsorship on behalf of your brand are crucial to speedy campaigns. Be ready to award the sponsorship funds in a timely manner and follow up with a phone call or an email, checking in to see if these funds have been received.It's okay to ask when can you expect the sponsorship digital benefits to go live and how to streamline the process for any other deliverables needed to complete the sponsorship.Applying these simple best practices, our team has been able to run a campaign in a week or less. Two important concepts to remember about the sponsorship channel from the fulfillment perspective: It’s difficult to fulfill. If your city project involves any more than two or three sponsorships, you're in for multiple hours of follow ups, reminders, phone calls, etc. There is the desire from most local organizations to honor their sponsors and keep them happy. That said, we've learned that keeping the momentum going serves as an important reminder for the nonprofit. This can involve phone call reminders and emails for links to go live and other benefits to come through. Again, be polite and respectful.It’s SO worth all the effort though! It shows that your brand cares. A sponsorship campaign is a fantastic way to get in front of your target audience in areas that have a special meaning at a personal level. And not in a broad general scope, but locally. Locally sponsoring a beach cleanup in Santa Monica gives you the opportunity to impact a highly localized audience with a very particular cause in mind that would ultimately affect their everyday life, as opposed to partnering with a huge foundation advocating for clean oceans. Enhancing a local campaignSome prefer to use local sponsorships as a link building effort, but there are ways — and ample benefit — to going far beyond the link. Local event attendanceSo, so many local sponsorship campaigns come with the opportunity for event attendance. We currently have 11,345 opportunities in our database (62.2% of our total inventory) that feature events: 5Ks, galas, performances, parades, and even a rubber ducky derby or two! If you’re able to send local team members, find opportunities that match your target audience and test it out — and bring your camera so your social and brand team will have material for publication. If local team members aren’t an option, consider working with a notable and ambitious startup such as Field Day, which can send locals out on behalf of your brand. We’ve spoken with them on several occasions and found them adaptable and wonderful to work with.Coupons/invitationsOne client, FunBrands, used local sponsorships as a way to reach out to locals ahead of stores’ grand re-openings (read the full case study here). For another client, we created unique coupons for each local organization, using print and social media posts for distribution. An example coupon — use codes to track attribution back to an event.Conclusion: Local sponsorships are a channelSponsorships are an actionable strategy that contribute to your local rankings, while providing unprecedented opportunities for community engagement and neighborly branding. We hope that this updated guide will provide a strong operational overview along with realistic expectations — and even inspirations — for a local sponsorship campaign in your target cities. Last but not least: As with all outreach campaigns, please remember to be human. Keep in mind that local engagements are the living extension of your brand in the real world. And if somehow this article wasn’t enough, we just finished up The Local Sponsorship Playbook. Every purchase comes with a 30-minute consultation with the author. We hope everyone chooses to get out, get local, and join the community in the channel that truly benefits everyone. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Guide to Local Sponsorship Marketing - The 2018 Edition"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Guide to Local Sponsorship Marketing - The 2018 Edition"
    },
    {
      "level": "H2",
      "text": "The what & why of local sponsorships"
    },
    {
      "level": "H3",
      "text": "Who shouldn’t do local sponsorships?"
    },
    {
      "level": "H4",
      "text": "1. Don’t do local sponsorships if you need fast turnaround."
    },
    {
      "level": "H4",
      "text": "2. Don’t do local sponsorships if you’re not okay with the branding component."
    },
    {
      "level": "H4",
      "text": "3. Don’t do local sponsorships with a \"one size fits all\" expectation."
    },
    {
      "level": "H3",
      "text": "Considerations for agencies vs brands in local sponsorship campaigns"
    },
    {
      "level": "H2",
      "text": "Our process"
    },
    {
      "level": "H3",
      "text": "Outreach"
    },
    {
      "level": "H4",
      "text": "1.  Mentioning location matters."
    },
    {
      "level": "H4",
      "text": "2. Emails sent to organizations who already had sponsorship info on their websites were most successful if the email acknowledged the onsite sponsorship info and asked for confirmation."
    },
    {
      "level": "H4",
      "text": "3. Whether or not we included an outreacher phone number in email signatures had no effect on response rate."
    },
    {
      "level": "H4",
      "text": "4. Shorter is better when it comes to outreach emails."
    },
    {
      "level": "H3",
      "text": "Matchmaking: How can I choose a sponsorship opportunity that fits my brand?"
    },
    {
      "level": "H4",
      "text": "Reach Score"
    },
    {
      "level": "H3",
      "text": "Fulfillment"
    },
    {
      "level": "H2",
      "text": "Enhancing a local campaign"
    },
    {
      "level": "H3",
      "text": "Local event attendance"
    },
    {
      "level": "H3",
      "text": "Coupons/invitations"
    },
    {
      "level": "H2",
      "text": "Conclusion: Local sponsorships are a channel"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Claudia Cruz\n          \n            Claudia Cruz\n          \n            Claudia Cruz"
}