{
  "url": "https://moz.com/blog/guide-for-the-beginner-from-a-beginners-prospective-on-learning-seo",
  "slug": "guide-for-the-beginner-from-a-beginners-prospective-on-learning-seo",
  "title": "Guide For the Beginner, From a Beginner's Prospective, on Learning SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For the last year and a half I have been living abroad in Malta, and within a few months I started getting into learning about blogging and making money online and of course stumbled into SEO. Literally within days, SEO was all I could think about. Now it seem like I'm on a journey to great things…",
  "content": "Guide For the Beginner, From a Beginner's Prospective, on Learning SEO Marketing Industry By: Craig Addyman June 4, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Craig Addyman June 4, 2010 Guide For the Beginner, From a Beginner's Prospective, on Learning SEO Marketing Industry This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. For the last year and a half I have been living abroad in Malta, and within a few months I started getting into learning about blogging and making money online and of course stumbled into SEO. Literally within days, SEO was all I could think about. Now it seems like I'm on a journey to great things and I wanted to share with you some of the things I have done to kick start my learning process. I have wasted a lot of time on the internet trying to learn the arts of seo, a lot of that time was in shady \"black hat\" type forums, which of course at the time I didn't even know what black hat tactics really were. Things like cloaking, same colour hidden texts, doorway pages, etc. A complete waste of time, although at least now I know it and know not to use those tatics. Here is a quick list of the things I have done/recommend.. When I first stumbled upon SEOmoz, it was a Whiteboard Friday and straight away proceeded to watch all of the videos, of the Whiteboard Friday series, over the next few days (Ok I'm still trying to get through them as there are that many). I subscribed to the RSS and I read every blog post, most of which I didn't/don't understand but, things bit by bit get more clear all the time. Work your way through Matt Cutts YouTube videos. Join the Problogger community, as well as seo tips for blogging, it will help you think about how to target your audience, which is very important when conducting keyword research. Buy \"The Art Of SEO\" and a \"highlighter pen\" and get reading. Work on some personal branding, Danny offers his branding platform for free download, but if like me you don't have a server yet, use wordpress.com. I have the following positions in google for my name 1st, 2nd, 4th, 5th, 8th and 9th. Start a blog. I started a blog in March about fitness and how to get a 6 pack. Do it about something you have a passion for and slowly apply what you learn to it. Print off \"The Beginners Check List For Learning SEO\" To carry on my learning I will be.. Renting a server so I can run my own tests and host my own websites. Upgrading to a Pro membership here at SEOmoz. Further my reading of books and within the SEOmoz community. Once back in England, I will be doing a small night class on web development, to help me work with the dev teams and further my understanding on how the web works. Apply for a job within the SEO sector. I work in marketing/sales at the moment for a huge hotel chain. One of the marketing managers jobs is sourcing leads for the company. I actually pitched him for a job and ended up having a 2 hour meeting about what I could do for the company and how I could help. Although I am still waiting to hear back I have now gotten my foot in the door and have had a bit of on the spot probing and actually shocked myself on how much I could talk about a subject. So if you're not yet actually doing the job like I am but have been bit by the bug, why not see how it could benefit your company and pitch your boss for the job? Fingers crossed I will become the company's online marketer/SEO as sometime next week I have another meeting with them as they want me to look at their PPC campaign, if not it's all experience! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Guide For the Beginner, From a Beginner's Prospective, on Learning SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Guide For the Beginner, From a Beginner's Prospective, on Learning SEO"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Craig Addyman\n          \n            Craig Addyman\n          \n            Craig Addyman"
}