{
  "url": "https://moz.com/blog/hacking-facebooks-local-awareness-ads-5-advanced-tips",
  "slug": "hacking-facebooks-local-awareness-ads-5-advanced-tips",
  "title": "Hacking Facebook’s Local Awareness Ads: 5 Advanced Tips - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For years, local businesses have relied solely on direct mail, stickers, flyers, referrals, and word of mouth. These were the life-blood of their business. Now, in the digital age, we can replace these tactics with a more affordable digital channel that has the power to bolster all of our other…",
  "content": "Hacking Facebook’s Local Awareness Ads: 5 Advanced Tips Local SEO | Social Media By: Garrett Mehrguth January 26, 2016 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Garrett Mehrguth January 26, 2016 Hacking Facebook’s Local Awareness Ads: 5 Advanced Tips Local SEO | Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Editor's note: Since the publication of this post, Facebook has re-branded it's Local Awareness ads as \"Reach Ads\". Carry on! For years, direct mail, stickers, flyers, referrals, and word of mouth were the life-blood of local businesses. Now, however, we can use more affordable digital channels to drive new business and bolster all of our other marketing channels. In this post, I will introduce you to Facebook's Local Awareness Ads. I will also cover tactics for local awareness ads that can be easily implemented. This post will not dive deep into how to set up a local awareness campaign, as there's plenty of content that already exists on the subject: http://webmarketingtoday.com/articles/115027-Pros-... https://www.facebook.com/business/learn/facebook-c... http://www.socialmediaexaminer.com/how-to-use-face... The goal of this post is to help local business owners and in-house marketers walk away feeling confident that they can properly grow their local brand on a shoestring budget using local awareness ads. If you are a consultant for an agency, I hope you can use this post, too, to mix up your strategies and start building brand impressions for your client at a fraction of their normal ad budget. FB advanced tactic #1: Bolster CTRs for PPC & SEO with content In the past, SEOs talked about the importance of catchy titles and meta-descriptions to earn clicks. On the PPC side, marketers emphasized the importance of adding site links and extensions. Thinking outside the box, and looking at the big picture, let's us focus on the impact our other marketing channels have on clickthrough rates (CTRs). There is no cheaper way to build impressions than local awareness ads. Even the display network pales in comparison. So, I encourage you to take a small part of your advertising budget and use it to build your local impressions. Think about local awareness ads as the the cheap version of direct mail or radio ads. The targeting is meager, but the impact is large. Put yourself in your target market's shoes and think: \"Who would I click on, a random local business with a catchy title, or a local business that I recognize?\" The first step to is to take an inventory of our content, as it is crucial that we understand our target audience and internal business objectives. Ask yourself: \"Would I actually read my own content? If the answer is no, then it's time to hit the drawing board. In particular, let's try to use content for local awareness ads that is particularly relevant to our audience's location. Here are some topical ideas for content you can use to get the ball rolling: Top Food Trucks You Have to Try in [Your City] 8 QuestionsYou Need to Ask Before Hiring a [Your Service] in [Your City] Why Everything You Know About [Your Service] Is Built on a Lie Do these ideas sound like clickbait? Yes, a little bit, but that's okay. The goal is to stand out in our search channels and eventually increase CTRs because people actually remember us. Alternatively, you can take a thought leadership approach if you are a B2B by pitching a recent white paper with your local awareness ads. For most B2B companies, there is plenty of business in our backyards to properly build authority and impressions with. FB advanced tactic #2: Use reviews to build a local brand What qualifies you as a local brand? I believe a good litmus test is if someone recognizes your business name in the local search engine results pages SERPs for their area (both paid and organic listings). And even better indicator that you are a local brand (and a successful one) is if someone in your area wants goes directly to your site when they want want to purchase what you are offering. Not only will building a local brand increase your phone calls and form submissions, it will increase your close rate, too, as your target market starts to feel they can trust you. One advanced tactic for building your brand locally with Facebook awareness ads is to utilize brand reviews. Take a look at the importance of online reviews according to BrightLocal's study: If we know that reviews are powerful influencers in the buyer journey, the only question is: \"How do we get more people to see our awesome reviews?\" And the cheapest answer to that question is local awareness ads. Simply follow these steps and you will be rocking and rolling in no time: Find a great review someone left you online. Ask the person who left the review if you can use a photo of them. Take that review and summarize it. (Note: Facebook only allows 20% of the ad image to have text. Here's a tool to test if you're OK: https://www.facebook.com/ads/tools/text_overlay.) Now, take the photo and the review, then use this tool to overlay your review on the image they supplied! For example: The goal with all of these tactics is to first run them in the same local awareness campaign, providing your target market with a variety of ads to interact with and preventing brand decay. FB advanced tactic #3: Advertise at sporting events cheaply Have you ever wanted your business or client's name on the Jumbotron? Call me crazy, but I'd love to be able to advertise at a sporting event just to see my business' logo next to my favorite sports team's. Ego aside, there are some benefits to advertising at a local sporting event, including building your local brand affinity, associating your brand positively with hometown heroes, and positioning yourself as a bigger player in your space. Unfortunately, we don't all have budgets for that. We all can, however, advertise like one big boys for a fraction of the cost. The trick to pulling this off is to run your local awareness ads on a lifetime budget. By setting your ads on a lifetime budget, you can control scheduling for time of day and location. Let's pretend we want to advertise at an Anaheim Ducks game. Using the address of the venue where the game is being played, we will set our ads to start running thirty minutes before the game, and stop thirty minutes after. That way, anyone at the game who meets our demographics will see our ads when they check into Facebook. For this to work really well, make sure to customize your ads with your team's colors and even logo! Here's what my targeting might look like if I advertised at an Anaheim Ducks game: Now, that's a cool way to do big-time branding on a small-time budget! FB advanced Tactic #4: Hire locally, baby If you are like most local businesses, hiring can be a bit complex. Finding the right talent is crucial. Potential employees, similar to potential clients, do their research. We use our local awareness ads to help with the CTRs of our job postings on local job boards. As we are trying to hire the savviest digital marketers, we need them to be impressed with our brand. Building their attention and their awareness is critical. If you want to hire the best, they better have heard of you before. Using local awareness ads is a cheap way to build the brand resonance you need. Pretend you are a plumber. You have one truck, but with your search campaigns booming, it's tough to make it to all your calls. You know you need to hire another person, but it's tough to find the right person. By launching a local awareness ad with the intent of hiring someone, you can start to do thing like: Demonstrating to your client that you are expanding Showing your target employee the type of environment they'd get to work in A simple way to execute this tactic is to use a team picture that highlight's your culture's uniqueness. Specifically, we like to use our local awareness ads as a promotional newsletter. If we launch 401ks, we want the whole community to know about it. While we also run ads on the top of the hiring boards using a service called Workable, as we believe it's important to build impressions for marketers in our area. Local marketing isn't about perfection; it's about consistency. Check out a simple example of what this looks like: FB advanced tactic #5: Add a CTA arrow on your image Ever wonder if there was an easier way to earn clicks on your paid social media campaigns? Scrolling through Instagram the other day, I saw a brand place a downward arrow in the bottom, righthand corner of their ad. Genius. We can take this same idea and apply it to your local awareness advertising. As an example, I have added a simple white arrow to the CTA in an ad we ran for a local business. With a simple design cue like this, we can effectively begin to garnish more clicks on our ads and build our remarketing lists. While it's great to build local impressions, getting clicks is the ultimate goal. Keep in mind that most local awareness campaigns are not built for direct conversions. They are best used for awareness, but if they do click, let's make sure we have remarketing ads in place to send them to a nice landing page. Examples include the following: White paper download Terrific piece of resource content Coupon page You could even send them to your Yelp or Google My Business page so they can read reviews of your business While I am not a designer, one can quite simply use Canva! Even with my basic design chops, I was able to use this tool to create this image: Bonus: Target college campuses across the country Want to target college campuses across the country with an ad? Now you can. All you need are local stock images, a copywriter, and a modest budget. Here's what you need to do: Create a local awareness ads campaign called \"College Campuses.\" Add an ad group for each college college campus you are targeting. Within each ad group, aim to have four ads. Compile local images that are relevant for each college campus. Craft the copy to overlay on each ad image using https://buffer.com/pablo. Look at each college's Facebook group and start to get an idea of what copy would be most relevant. Using the local details gathered above, choose the copy for your text, headline, and news feed description. Launch your campaign and carefully analyze relevance scores. This concludes your introduction to advanced hacks for local awareness ads. Please join in the conversation and let me know your thoughts below! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Hacking Facebook’s Local Awareness Ads: 5 Advanced Tips"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Hacking Facebook’s Local Awareness Ads: 5 Advanced Tips"
    },
    {
      "level": "H2",
      "text": "FB advanced tactic #1: Bolster CTRs for PPC & SEO with content"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "FB advanced tactic #2: Use reviews to build a local brand"
    },
    {
      "level": "H2",
      "text": "FB advanced tactic #3: Advertise at sporting events cheaply"
    },
    {
      "level": "H2",
      "text": "FB advanced Tactic #4: Hire locally, baby"
    },
    {
      "level": "H2",
      "text": "FB advanced tactic #5: Add a CTA arrow on your image"
    },
    {
      "level": "H2",
      "text": "Bonus: Target college campuses across the country"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Garrett Mehrguth\n          \n            Garrett Mehrguth\n          \n            Garrett Mehrguth"
}