{
  "url": "https://moz.com/blog/had-to-share-my-first-speaking-engagment",
  "slug": "had-to-share-my-first-speaking-engagment",
  "title": "Had to share - My first speaking engagment! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I'm really excited and had to share - I just spoke at my first professional conference and WOW!I spoke about practical things anyone can do to their website to help its organic rankings.  I spoke about on page elements, keyword research, link building and link ninjas, linkbaiting and finished with…",
  "content": "Had to share - My first speaking engagment! SEO Events J By: Judith Lewis March 11, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! J By: Judith Lewis March 11, 2007 Had to share - My first speaking engagment! SEO Events This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I'm really excited and had to share - I just spoke at my first professional conference and WOW! I spoke about practical things anyone can do to their website to help its organic rankings. I spoke about on page elements, keyword research, link building and link ninjas, linkbaiting, and finished with some SEO tools. I was the most highly rated speaker with 5 out of 5 mode, and median ratings with an overall mean of 4.62 out of 5! YAY! I was also specifically singled out frequently on feedback forms as having given the most useful and practical session with two people giving me bonus points. I was even admonished by an agency afterwards for giving away secrets (in true SEOmoz spirit) they didn't want clients to know - WOOHOO! Job done then! It might have been, to me, a pretty basic talk, but it seems that is what made it popular. I was really nervous to the point of being grey under my makeup, but apparently I hid it well, engaged with my audience (though my love of chocolate), and was \"fun\". So here I am tooting my own horn - I'm just so excited! Possibly the only eyes on this will be the moderators but in my heart I'll hold out the hope that at least a handful of folks out there will read it and feel happy for me. YAY! CELEBRATORY CHOCOLATE TIME! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Had to share - My first speaking engagment!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Had to share - My first speaking engagment!"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Judith Lewis\n          \n            Judith Lewis"
}