{
  "url": "https://moz.com/blog/happy-birthday-alan",
  "slug": "happy-birthday-alan",
  "title": "Happy Birthday Alan - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Like most people who have featured on YOUmoz, for me blogging is a pleasure. It allows me to play at being a journalist, as well as giving me a platform to talk about a subject that fascinates me, and hopefully even lets me spread some learning.However, for many people journalism is a very serious…",
  "content": "Happy Birthday Alan Moz News C By: Ciaran Norris May 17, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! C By: Ciaran Norris May 17, 2007 Happy Birthday Alan Moz News This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Like most people who have featured on YOUmoz, for me blogging is a pleasure. It allows me to play at being a journalist, as well as giving me a platform to talk about a subject that fascinates me, and hopefully even lets me spread some learning. However, for many people journalism is a very serious issue indeed. The reason I say this is that today (May 17th) is the 45th birthday of a man called Alan Johnston. I'm not sure how many of you outside of the UK will be aware of who Alan Johnston is, but essentially he is a BBC journalist who has being covering the Middle East situation as the BBC's correspondent in Gaza for the last 3 years. And for the last 66 days he has been missing, feared kidnapped. There have been widespread calls around the world for Alan to be freed, as he has always been the very model of the balanced, fair journalist, providing a valuable service not just to the people he broadcasts to, but also to the people whose stories he covers. I have no intention of getting into the rights & wrongs of the situation that he has been caught up in, I would like to do something much simpler than that. Basically, I would like bloggers around the world to send Alan a message of support on this, his birthday. As people who are lucky enough to do this from the safety of our own homes or offices, about stories that, in the grand scheme of things donm't really matter, I think that we could all do well to remember Alan & his family on this day, and wish him a safe and happy birthday, and a speedy return to safety. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Happy Birthday Alan"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Happy Birthday Alan"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ciaran Norris\n          \n            Ciaran Norris"
}