{
  "url": "https://moz.com/blog/have-google-given-up-trying-to-police-onpage-ranking-factors",
  "slug": "have-google-given-up-trying-to-police-onpage-ranking-factors",
  "title": "Has Google Given Up Trying to Police On-Page Ranking Factors? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I was cruising around the Internet doing some research for a pitch the other day, and as I often do in such cases I had switched off javascript on my browser and forgotten to switch it back on again. That’s how I stumbled upon this beaut of a piece of crude ‘black-hatting’.",
  "content": "Has Google Given Up Trying to Police On-Page Ranking Factors? Blogging By: John McElborough November 18, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: John McElborough November 18, 2008 Has Google Given Up Trying to Police On-Page Ranking Factors? Blogging This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I was cruising around the Internet doing some research for a pitch the other day, and as I often do in such cases I had switched off javascript on my browser and forgotten to switch it back on again. That’s how I stumbled upon this beaut of a piece of crude ‘black-hatting’. It started with a search which brought me to the site in question. At first I thought these guys had just gone all out on the SEO -- \"Who cares what it looks like, we’ll dump a bunch of headings and links at the top of the page.\" It looks rubbish but it seemed to have done the job and gotten them some good positions. Then the penny dropped and I realised I had javascript off and, when switched on, all this text was hidden. The guys had stuffed a noscript tag with headings and anchor links. And not just on this page, but every damn page on the site uses these spamtastic headings. What they actually seem to be doing is printing the contents of their page title in an H1 tag, the meta description in an H5 and the meta keywords in an H3, all inside the noscript. Obviously it's impossible to know whether it's the spammy noscript or the visible content which is gaining them the decent rankings on this term, but one thing's for sure, they're not being penialised. I thought a bit more about this and how it was that this site had slipped through the net, how a method so glaringly obvious couldn’t be picked up by the supposedly sophisticated anti-spam measures put in place at Google (actually, the site seems to be doing quite nicely in Yahoo and Live as well). Although the search engines occasionally catch out sites using dodgy onsite tactics, so they say, you have to wonder how many sites out there are getting away with murder -- millions, I would expect. So I’m wondering, in the face of such opposition, if Google has gone a bit soft on trying to detect the less malicious of this type of spam, perhaps being more concerned with detecting paid links and more serious cloaking. In my simplistic programming mind it wouldn’t be too difficult for Google engineers to stomp this out; just look at the telltale signs on this site: Noscript tag at the top of the page, with no scripts above it to require a noscript Noscript tag full of heading tags Headings in noscript tag identical to page title, meta description and meta keywords As I said above, I was in 2 minds about whether to ‘out’ this site. The deciding factor for me was when I saw a particular page that not only has the noscript spam at the top, which likely means blind users with a screen reader will have to endure 5 paragraphs of keyword stuffing before getting to the page content, the page itself features a heading \"Give the blind a sporting chance\" IN AN IMAGE, with incorrect alt text. Deliberate or not, that just takes the p*ss! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Has Google Given Up Trying to Police On-Page Ranking Factors?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Has Google Given Up Trying to Police On-Page Ranking Factors?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "John McElborough\n          \n            John McElborough\n          \n            John McElborough"
}