{
  "url": "https://moz.com/blog/have-online-press-releases-gone-the-way-of-the-dodo",
  "slug": "have-online-press-releases-gone-the-way-of-the-dodo",
  "title": "Have Online Press Releases Gone the Way of the Dodo? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Recently I attended the eCommerce Summit, and while I was there I attended the \"Using Press Releases to Drive Sales\" session. The sole speaker was Joe Beaulaurier, marketing manager of PRWeb. Sure, his session was a bit salesy (then again, so were a lot of the session at the eCommerce Summit, but…",
  "content": "Have Online Press Releases Gone the Way of the Dodo? Branding By: Rebecca Kelley May 6, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley May 6, 2008 Have Online Press Releases Gone the Way of the Dodo? Branding The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Recently I attended the eCommerce Summit, and while I was there I attended the \"Using Press Releases to Drive Sales\" session. The sole speaker was Joe Beaulaurier, marketing manager of PRWeb. Sure, his session was a bit salesy (then again, so were a lot of the session at the eCommerce Summit, but it is ecommerce, after all), but he did make some interesting points. Joe first talked about the \"old fashioned press release,\" which was crafted in hopes of being published in some form. Words and images/charts were all you had to use to convey the message. If the media didn't pick up your press release, you were SOL. Compare this to online press releases, which can be rich with multimedia. They're great for getting the media's attention, and they're even better for directly reaching your best prospects. A few different types of PR distribution are the following: Push distribution. Potentially reach an audience in the 10s of thousands via channels like email (where you benefit from an entirely opt-in audience interested in information you have to offer) and RSS (where feed content is directly delivered to audiences who subscribe to receive your website content). Pull distribution. Potentially reach an audience in the 10s of millions using SEO. Optimize your press releases by using appropriate keywords and get your PRs to rank for those keywords/phrases when they're searched for in the major search engines. Social media distribution. Create press releases interesting and compelling enough to get people to use social media and social networking websites and share your content with their peers. At this point in Joe's presentation, an interesting slide popped up. Right when I was about to take a picture of it, some lady wearing a ridiculous hat decided to sit down directly in front of me, thus blocking my shot (seriously, that hat is velvet, and it was like 84 degrees with 1,000% humidity in New Orleans). Thankfully, I have long arms, so I stood up and shot the photo over the woman's pimp hat: How does one write a press release? Joe recommends: Spend a lot of time on the headline. It may be your only chance to sell the news to your audience. The subhead/summary should enhance the headline. The body should answer who/what/where/when/why. Include 2-3 quotations from principals. The media and bloggers are attracted to these. Use a journalistic voice (just the facts, ma'am). Don't sell—this isn't an advertisement. The last point amused me, as I had been in another session where a guy from a different PR company stressed that your press releases should essentially be pitches about new products and crap that you offer. I'm more inclined to agree with Joe on this one--press releases should be relatively objective and should include information your target audience will hopefully find interesting, such as a case study, the results from an experiment or a survey, etc. If you want to push products, use email marketing or newsletters. Well, now that I think about it, I suppose the first thing you should do is figure out what the hell you want your press release to do for you. If you want your press releases to sell products and increase conversion rates, then yeah, make sure they focus on your products, services, etc. If you want your press releases to be shared among your audience or linked to, craft more content-rich press releases that can attract links and eyeballs. I personally think of press releases as being more of the latter (more on the interesting, link-worthy side), but that's just me. Some tips on how to optimize your press releases: Know which keywords and phrases you want the press release to rank for, and only focus on 2 or 3 keywords/phrases per release. Use the keywords in the headline, subheader, and early in the body of the release. Link back to the relevant pages in your site using the keywords as anchor text. Here's where I explain the title of this here post. How effective are press releases in today's blog-riddled world? Couldn't you take what would normally be a press release that you'd distribute via email and just post it as a blog entry or an article on your site? You could even link to the entry from the press release email--that way, you're getting traffic and, hopefully, links. For example, I regularly get Hitwise's press releases, and sometimes they're really interesting--they'll have studies or search engine market share or other nifty stats and charts. I've linked to a few in some previous Roundup Thursday posts. What really irks me, however, is that I receive the press releases via email, and they don't include a link to the information on Hitwise's site. How am I supposed to link to the press release? I end up having to poke around Hitwise's site until I find the PR I'm looking for, and at that point I've wasted a few minutes finding the information that should have been linked to from the initial email. Maybe it's just because I'm more blog-savvy than PR-savvy, but when I think of press releases I picture blocks and blocks of text written in a monotonous, voiceless fashion, and my eyes instantly glaze over. That's not to say that I ignore all press releases; as I already stated, some have successfully grabbed my attention, but usually the ones that do are more quantitative in nature (survey results, data findings, study conclusions, etc). Numbers and graphs often speak louder than words, and they definitely grab my attention better than a word-heavy press release. Joe had gone over some newsworthy press release content. They are: New products/services. I wouldn't read this press release. It seems too salesy, and I'd prefer to see this sort of content in a marketing email or newsletter. List of five top items for blah blah blah. A top five list? This reeks of blog post. Lists and other baity stuff should really be released on your site in the form of a blog post or article. Customer survey results. Okay, now I'm getting a press release vibe. I'd potentially be interested in this sort of information. New hire. Ugh, \"Who cares?\" comes to mind, though I edit Search Engine Land's articles and I can't tell you how many \"So and So Has Left [insert search engine company here] and Now Works for Facebook\" posts I've read, so obviously these types of press releases are successful for certain audiences. Just not me. :) Site upgrades. Meh. Anyone who already visits your site would notice any major upgrades, and subtle upgrades could be highlighted via an email to your members. The only way I'd see this be successful is analogous to what Reddit did--recently they shared some future site upgrades with some prominent bloggers, and those people blogged about the upcoming features. These posts spread across the internet and had a \"Leaked Upcoming Reddit Features!\" angle. Thought leadership. Okay, I don't even know what this means. \"Thought leadership\" is one of those weenie euphemisms. Couldn't an expert statement or stance about a particular topic be formed as a blog post? Well, to answer my own initial question of \"Have Online Press Releases Gone the Way of the Dodo?\", I'd say \"yes\" and \"no.\" I do think that press releases continue to hold value, but it really depends on what sort of information you want to distribute. What do you want your press release to accomplish, and what can your press release do that a blog post, newsletter, or email marketing campaign can't already do easier and better? I think it's important to truly optimize your press releases, not just for search engines, but for user retention. Don't waste your time putting all of your eggs in the press release basket when a much cushier basket (say, a blog) exists for half of those eggs. (Sorry for the lengthy egg analogy. Scott sent me a video of Gordon Ramsay making what appear to be the best scrambled eggs ever, and I've had eggs on the brain for the past few days.) What are your thoughts? Have any of you had resounding success with press releases? If so, what sort of content do you typically send out? Do any of you split your marketing efforts between blogging, email marketing, newsletters, and press releases? Is that too much work, or do the different channels bring better success rates compared to using only one channel? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Have Online Press Releases Gone the Way of the Dodo?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Have Online Press Releases Gone the Way of the Dodo?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Getting Buy-In for Customer Stories — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Local Brand Loyalty Takeaways From That Time Ace Hardware Was Trending"
    },
    {
      "level": "H3",
      "text": "How to Build a Strong Brand Moat With SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}