{
  "url": "https://moz.com/blog/headsmacking-tip-18-use-discussion-search-as-competitive-intel",
  "slug": "headsmacking-tip-18-use-discussion-search-as-competitive-intel",
  "title": "Headsmacking Tip #18: Use Discussion Search as Competitive Intel - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Most of us in the search field have likely seen the addition of \"Discussions\" to Google's search options. It lets searchers specifically target either forums or Q+A sites for their queries (or both, by default), and it's a gold mine for competitive intelligence and research....",
  "content": "Headsmacking Tip #18: Use Discussion Search as Competitive Intel Competitive Research By: Rand Fishkin March 21, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 21, 2011 Headsmacking Tip #18: Use Discussion Search as Competitive Intel Competitive Research The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Most of us in the search field have likely seen the addition of \"Discussions\" to Google's search options. It lets searchers specifically target either forums or Q+A sites for their queries (or both, by default), and it's a gold mine for competitive intelligence and research.Here's 5 ways to leverage discussions for SEO + competitive intel:Search for your competitors' product names or websites in the Q&A section. You'll almost always find people asking about features, alternatives, ways to use the service/product. These are great opportunities to authentically present your solution as an alternative, or simply learn about what makes their customers happy (or unhappy).Query your keywords in the forums and you'll discover popular threads with engaging content. You can use these as the catalyst for content/blog posts, as opportunities to connect with other forum users who share your interests and sometimes even as link opportunities. You can use the sorting by \"by date\" to ID the most recent discussions.Keep tabs on your own brand/product names - potentially you might use the \"24 hours\" or \"past week\" settings every day/week. The discussions and questions are opportunities to explain your product, present the best face you can and provide \"off site\" customer service. Many times, these will lead to some good traffic, and often, links/tweets/shares as well.Using high-level topics around your site/niche/keywords, you can often find entire forums/Q+A sites/sections devoted to your topics. If they contain a large number of active users, it's likely worthwhile to register, make yourself known and be a contributor in these communities (it's how I started building SEOmoz's links and traffic back in 2003!)Similar in function to Link Intersect, and perhaps my favorite in terms of finding good referencing opportunities, is to use the brand names of multiple competitors with \"OR\" separators and set the sorting to \"relevance\" but restrict the date range to \"last month.\" This shows recent threads where several of your competitors were mentioned, and is often an ideal place to present your own solutions.Forums and Q+A sites are often good sources of direct traffic, but your presence in them can also lead to greater awareness, links, sharing, tweets and citations of other kinds. In addition to Google's Discussion search, BoardReader and BoardTracker make for solid alternatives (and will often show stuff Google misses or buries).Undoubtedly, you'll be able to think of many more tactics that discussion/forum/Q+A search enables. Enjoy!p.s. Some folks noted in the comments that SocialMention's search and the integration with Raven Tools are also good for this type of stuff. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Headsmacking Tip #18: Use Discussion Search as Competitive Intel"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Headsmacking Tip #18: Use Discussion Search as Competitive Intel"
    },
    {
      "level": "H2",
      "text": "Try our SEO Competitive Analysis tool"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Actually Be Better Than Your Competitors in the Eyes of Choosy Customers"
    },
    {
      "level": "H3",
      "text": "SEO Gap Analysis — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Daily SEO Fix: Competitive Link Research"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}