{
  "url": "https://moz.com/blog/headsmacking-tip-1-link-requests-in-order-confirmation-emails",
  "slug": "headsmacking-tip-1-link-requests-in-order-confirmation-emails",
  "title": "Headsmacking Tip #1: Link Requests in Order Confirmation Emails - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Tonight I made an online purchase at a store called Widgetco.com (no, I'm not kidding, and I'm not using \"widget\" as an example, the site is actually www.widgetco.com). Sixty seconds later, this email shows up in my inbox:\n...",
  "content": "Headsmacking Tip #1: Link Requests in Order Confirmation Emails Link Building By: Rand Fishkin June 19, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin June 19, 2008 Headsmacking Tip #1: Link Requests in Order Confirmation Emails Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Tonight I made an online purchase at a store called Widgetco.com (no, I'm not kidding, and I'm not using \"widget\" as an example, the site is actually www.widgetco.com). Sixty seconds later, this email shows up in my inbox: When I read the second-to-last line of the message, I realized that SEOmoz needs a \"headsmacking tips\" series on the blog, and that this was a perfect candidate. It's unreal that in all the link building tips, all the blog posts and Whiteboard Fridays, not once have I brought up what a terrific idea it is to leverage your customers for link building. Why Should I Have My Customers Build Links For Me? They already like you They have a relationship with you, so the link request is more like \"If you liked our barbershop, please refer your friend.\" Google loves these kinds of links - in their greatest dreams, the Internet, through links, is a realistic model of the relationships between people, companies and organizations. Links like these get them one step closer to that fantasy. Your customers are usually relevant to you, and it's likely that if they link, the post they use or the content they link from will have the right kind of relationship with your niche. It's scalable - the more customers you get, the more you can ping them with link requests and the more links you'll receive (again, bolstering Google's desire to show the most popular and successful businesses on top of the results). But, There's Downsides, Right? Maybe one - most of your customers probably won't do it, and many of them who might don't even have sites/pages where they could link (unless you provide website services). Of course, compared to a spammy link request email campaign, this is infinitely more effective. How Do I Do It? Just like WidgetCo did! Include a brief request in the order confirmation or shipment confirmation email. You might even consider following up with the customer and making sure everything was OK a day or two after the shipment arrived (assuming you're doing shipment tracking), and requesting the link then, when they're probably feeling most generous towards you. If customers have a good experience and they want to share it, encouraging them with a widget, a badge,or even just a simple link request is not going to hurt your relationship, and it's going to bring you a lot more customers - both through search (thanks to all those juicy links) and through direct referral traffic. Oh. So I Should Really Get On That, Huh? Yep. Why Haven't You Told Us This Before? Oh what, I can't make a mistake sometimes? Just cause you're in bold doesn't mean you're all that. I bet Aaron Wall's got a post on it somewhere (can't seem to find it right now but I'm sure it's somewhere), why don't you go read his blog? Oh, what's that, you already do? Well good. Cause it's a really good blog. Sorry - got a little upset there. I'm good now, and I'll almost certainly post some more Headsmacking tips in the future :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Headsmacking Tip #1: Link Requests in Order Confirmation Emails"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Headsmacking Tip #1: Link Requests in Order Confirmation Emails"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}