{
  "url": "https://moz.com/blog/headsmacking-tip-7-enforce-link-attribution-for-your-work",
  "slug": "headsmacking-tip-7-enforce-link-attribution-for-your-work",
  "title": "Headsmacking Tip #7 - Enforce Link Attribution for Your Work - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In the world of SEO, every link matters, and every link that can be earned, should be - it's the principle of \"optimization.\" Yet, to this day, even many companies and sites that are focused on growing their search traffic don't think about optimizing the links they've earned. Case-in-point: The…",
  "content": "Headsmacking Tip #7 - Enforce Link Attribution for Your Work Link Building By: Rand Fishkin September 11, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 11, 2008 Headsmacking Tip #7 - Enforce Link Attribution for Your Work Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In the world of SEO, every link matters, and every link that can be earned, should be - it's the principle of \"optimization.\" Yet, to this day, even many companies and sites that are focused on growing their search traffic don't think about optimizing the links they've earned. Case-in-point: The web forum software company, VBulletin. Have a look at these search results - allintitle:powered by vbulletin -site:vbulletin.com. All of these sites feature a footer similar to this: It makes me want to cry. Why? Because there's attribution, but no link. There are literally hundreds of millions of pages on the web that Google, Yahoo! and Live have indexed that contain the phrase \"powered by VBulletin\" in the title tag, yet virtually none of these pages actually link to VBulletin's site. A (relatively) paltry 1.2 million links and PageRank 6 are what VBulletin.com has to show for the terrific software they've created. Just imagine the SEO power of their domain had they gone the route Invision went and made those links default in their installation packages (they've got 15X VBulletin's links by Yahoo!'s count). Another terrific example comes from an unlikely source - YouTube. Check out a standard YouTube embed code: <object width=\"425\" height=\"344\"><param name=\"movie\" value=\"http://www.youtube.com/v/anxkrm9uEJk&hl=en&fs=1\"></param><param name=\"allowFullScreen\" value=\"true\"></param><embed src=\"http://www.youtube.com/v/anxkrm9uEJk&hl=en&fs=1\" type=\"application/x-shockwave-flash\" allowfullscreen=\"true\" width=\"425\" height=\"344\"></embed></object> No link! Unbelievable, but true. Now check out Vimeo's embed code: <object width=\"400\" height=\"302\"> <param name=\"allowfullscreen\" value=\"true\" /> <param name=\"allowscriptaccess\" value=\"always\" /> <param name=\"movie\" value=\"https://vimeo.com/moogaloop.swf? clip_id=1020365&amp;server=vimeo.com&amp; show_title=1&amp;show_byline=1&amp;show_portrait=0&amp;color=&amp;fullscreen=1\" /> <embed src=\"https://vimeo.com/moogaloop.swf?clip_id=1020365&amp;server=vimeo.com&amp; show_title=1&amp;show_byline=1&amp;show_portrait=0&amp;color=&amp;fullscreen=1\" type=\"application/x-shockwave-flash\" allowfullscreen=\"true\" allowscriptaccess=\"always\" width=\"400\" height=\"302\"></embed></object><br /><a href=\"http://vimeo.com/1020365?pg=embed&amp;sec=1020365\">SEOmoz Whiteboard Friday-Blogging for Higher Rankings</a> from <a href=\"http://vimeo.com/user409469?pg=embed&amp;sec=1020365\">Scott Willoughby</a> on <a href=\"http://vimeo.com?pg=embed&amp;sec=1020365\">Vimeo</a>. It's a little longer, but it contains three beautiful, relevant, anchor-text rich links to Vimeo's site. If you're powering something, providing content, offering embeddable material or contributing in some fashion - automated or manual - you should be getting the link credit. It's still the only way the search engines are recognizing \"votes\" on the web, and I can think of few higher endorsements than the leveraging of a source's material on one's own site. These are links Google and the other engines want to find so they can provide proper attribution. Don't let them, or your search traffic, down. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Headsmacking Tip #7 - Enforce Link Attribution for Your Work"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Headsmacking Tip #7 - Enforce Link Attribution for Your Work"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}