{
  "url": "https://moz.com/blog/headsmacking-tip-11-refresh-legacy-content-for-a-rankings-boost",
  "slug": "headsmacking-tip-11-refresh-legacy-content-for-a-rankings-boost",
  "title": "Headsmacking Tip #11 - Refresh Legacy Content for a Rankings Boost - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This week's headsmacking tip is extremely powerful and pretty darn simple to implement. The premise is straightforward - you've got old content that ranks in the top 20-30 results, but never achieves first page (or top 5) rankings. Frequently, we see a lot of sites making the mistake of trying to…",
  "content": "Headsmacking Tip #11 - Refresh Legacy Content for a Rankings Boost On-page SEO By: Rand Fishkin January 19, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 19, 2009 Headsmacking Tip #11 - Refresh Legacy Content for a Rankings Boost On-page SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This week's headsmacking tip is extremely powerful and pretty darn simple to implement. The premise is straightforward - you've got old content that ranks in the top 20-30 results, but never achieves first page (or top 5) rankings. Frequently, we see a lot of sites making the mistake of trying to link build (both internally and externally) to the old content: For some reason, site owners often seem wedded to the existing content - it doesn't have to be this way. One of the fastest and best ways to attract links is with \"linkbait,\" right? Content that naturally spreads across the web because it's interesting, valuable and has viral-worthy features like great design, sensible layout, commercial-free presentation, etc. Here's the news flash - linkbait doesn't have to go on new pages; it can function equally well on old URLs that already have existing link juice. There are some specific strategies that are excellent for refreshing content and continuing to earn links to a URL: Have an old blog post? Spruce it up with new material, some spiffy graphics and re-release with a promotional push. Got a contest? Re-run it annually and continue to garner links to the URL again and again. Built a smart how-to article? Re-engineer it with the latest data and go for a new viral campaign. Old sales page that lacks anything interesting? Do what these guys do and make a new version. Added bonus - when you refresh a page, you might find that you have trouble submitting it to the major social marketing services. Use the # operator (which the engines ignore) or a ? operator in the URL that 301s and you'll be fine. You can also take the old content and, if desired, move it to a new URL (using our example above, something like domain.com/tubas/2001/ would work) so it stays in your archive and can still be accessed by those who are interested. Give this headsmacker a try on some pages that you're having an especially hard time ranking. The combination of old links + new can be a great way to win an otherwise very challenging battle in the SERPs. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Headsmacking Tip #11 - Refresh Legacy Content for a Rankings Boost"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Headsmacking Tip #11 - Refresh Legacy Content for a Rankings Boost"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}