{
  "url": "https://moz.com/blog/headsmacking-tip-4-use-keyword-variations-with-matching-intent-together",
  "slug": "headsmacking-tip-4-use-keyword-variations-with-matching-intent-together",
  "title": "Headsmacking Tip #4: Use Keyword Variations with Matching Intent Together - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For this week's tip, I thought we'd quickly run through an issue that, early in my SEO career, frequently confused me (and seems to trip up lots of sites today, too). The concept is simple - given a page that's ranking well for Keyword \"A\" some folks make the mistake of targeting close variations…",
  "content": "Headsmacking Tip #4: Use Keyword Variations with Matching Intent Together On-page SEO By: Rand Fishkin August 4, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 4, 2008 Headsmacking Tip #4: Use Keyword Variations with Matching Intent Together On-page SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. For this week's tip (see #1, #2 and #3 in the series) , I thought we'd quickly run through an issue that, early in my SEO career, frequently confused me (and seems to trip up lots of sites today, too). The concept is simple - given a page that's ranking well for keyword \"A\", some folks make the mistake of targeting close variations of \"A\" on separate pages without good justification. Here's a quick example: Sometimes, it can be wise to target variations on different pages, but you need to think carefully about why. In our example above, the intent for a searcher seeking \"electric scooters\" vs. \"buy electric scooters,\" \"electric scooters for sale,\" and \"cheap electric scooters\" isn't substantively different. Therefore, it might be unwise to create a multitude of pages to target each of these variations when a single page could target each effectively. In my experience there's no need to even venture into spammy territory here. Let's look at some title tags: Spammy Version TITLE: Cheap Electric Scooters for Sale, Buy Electric Scooters Good Version TITLE: Buy Electric Scooters at Scootermoz - 1000s of (In Stock) Electric Scooters for Sale In the good version, I didn't use cheap in the title, and I probably wouldn't in a real example either. From experience in retail SEO, I've seen that \"cheap\" (as a keyword modifier) is often a low conversion rate visitor, and it may even lower the conversion rate of other visitors. Instead, I'd probably opt to put it in the text of the page (and even then, relatively sparsely). The other phrases are valuable, and I've included them in the title and would pepper the page appropriately with mentions. Typically, with a variant that's best to keep on a single page, the broader phrase is included (as in \"electric scooters\" being included in the phrase \"electric scooters for sale\"), and thus, mentions of the longer phrase will help with keyword prominence of the original as well. There's no trick here - just a simple guiding philosophy: It's far easier to get links to one page rather than four Wasting internal link juice on extraneous pages is never a good idea Spending time and energy on content for additional pages that could be focused in higher ROI activities is tragic A single page with a concentrated keyword phrase and several variations is likely to perform better in the engines that multiple offshoot pages targeting very similar phrase variants There are times when breaking out the pages would make more sense. I'd use a relatively simple process to determine which path to choose: There may not be any rocket science at work here, but given how commonly I see mistakes like this, I'd say it's a valuable tip to keep in mind and apply to the sites you build and audit. As always, input is welcomed! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Headsmacking Tip #4: Use Keyword Variations with Matching Intent Together"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Headsmacking Tip #4: Use Keyword Variations with Matching Intent Together"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}