{
  "url": "https://moz.com/blog/headsmacking-tip-2-top-level-navigation-naming-conventions",
  "slug": "headsmacking-tip-2-top-level-navigation-naming-conventions",
  "title": "Headsmacking Tip #2: Top Level Navigation Naming Conventions - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Tonight I'm continuing with our headsmacking tips theme (see #1 from June) with a piece of SEO advice that's been around the industry for longer than Google but still doesn't get the traction it deserves.\nWhen it comes to top-level menu navigation, most of us are thinking about which b...",
  "content": "Headsmacking Tip #2: Top Level Navigation Naming Conventions On-page SEO By: Rand Fishkin July 8, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 8, 2008 Headsmacking Tip #2: Top Level Navigation Naming Conventions On-page SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Tonight I'm continuing with our headsmacking tips theme (see #1 from June) with a piece of SEO advice that's been around the industry for longer than Google but still doesn't get the traction it deserves. When it comes to top-level menu navigation, most of us are thinking about which broad subject areas best encompass the content we have to share with users. We're considering usability and user experience and ease-of-navigation, all of which are excellent. But sometimes, in this process, we forget about SEO and how perfectly it can tie in with these other goals. Just think - if you have broad subject areas under which many niche topics, products, articles, etc. fall, chances are there are some fairly competitive, high search-volume keyword terms and phrases you could target with those top-level navigation pages. Here's an example: British Petrol's got this nice micro-site on their alternative energy program, and in it they have a number of top-level navigation links like \"Who we are,\" \"What we do,\" \"Where we are,\" etc. The sad part is, while many visitors might want to learn about \"who they are,\" not very many are performing searches around those topics. Instead, they might be looking for things like \"renewable energy,\" \"climate change,\" \"low-emission fuel,\" \"fuel alternatives,\" etc., many of which BP could be targeting in their top-level menu. The thing is - top level menus exist throughout a site, and when you name a section of your website something, that's how it get referred to across the web in link anchor text and blog mentions and directory listings. All that external reference, combined with your internal focus, can produce some pretty terrific results. Not convinced? Go check out a few of the sites you work on or their competitors and see how well they rank for the names of their top-level menu items. It's uncanny, right? If your domain is generally strong, those top-level pages are almost always in the top 20 for the names you've given them. Here's an example of a site generally sticking to this advice: Their reward? Try searches for car reviews, car buying guides, road tests, even the incredibly competitive used cars. They're in the top 10 across the board. That's not to say they're doing everything perfectly, but they are a testament to the power of top-level nav menu naming. So, next time you've got an opportunity to re-design the top level menu or launch a new site, consider the searcher. They're telling you what they want through keywords, both broad and specific. If you can find ways to get creative with your naming while remaining usable and user-friendly, you've got a big win. p.s. Notice how SEOmoz names our SEO Tools section and our SEO Services Marketplace (just moved into position. Imagine if we had been really smart and called one of our top level tabs \"Buy Viagra... AKA How Blackhat SEO Works.\" Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Headsmacking Tip #2: Top Level Navigation Naming Conventions"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Headsmacking Tip #2: Top Level Navigation Naming Conventions"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}