{
  "url": "https://moz.com/blog/help-rand-craft-interview-questions-for-google-wmc-team",
  "slug": "help-rand-craft-interview-questions-for-google-wmc-team",
  "title": "Help Rand Craft Interview Questions for Google WMC Team - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Tomorrow, Mike McDonald of WebProNews, Vanessa Fox of Google's Webmaster Central and I will attempt to create a second version of our first interview together. It's late, and I'm wiped (plus I still have some presentaiton polishing to do), so I'm hoping you'll help me to craft some questions to…",
  "content": "Help Rand Craft Interview Questions for Google WMC Team SEO Events By: Rand Fishkin April 10, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 10, 2007 Help Rand Craft Interview Questions for Google WMC Team SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Tomorrow, Mike McDonald of WebProNews, Vanessa Fox of Google's Webmaster Central and I will attempt to create a second version of our first interview together. It's late, and I'm wiped (plus I still have some presentation polishing to do), so I'm hoping you'll help me to craft some questions to pose to Vanessa tomorrow. Topics can include: Anything to do with Google Webmaster Central, Sitemaps, etc. Crawling & Indexing Issues in General Google's Webmaster Central Blog Vanessa's New Blog Rumors & Gossip in the Search World Topics to generally avoid would be those that center around algorithmic or penalty-type questions. Vanessa's less a part of the search spam or algo-creation team, so they wouldn't be as likely to generate a great response. Thanks for your help everyone - we're looking forward to churning out some really top-notch content and coverage at the end of SES NY. p.s. For those wondering about YOUmoz entries; Rebecca's been a bit busy partying especially hard, but she'll get to them soon :) Oh yeah, and beware the comics! UPDATE: Vanessa and I just wrapped up the piece, and I was able to ask many of your questions into the interview. Yes, Matt, even yours. Look for the finished piece on WebProNews, hopefully in the next couple days. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Help Rand Craft Interview Questions for Google WMC Team"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Help Rand Craft Interview Questions for Google WMC Team"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}