{
  "url": "https://moz.com/blog/help-me-write-a-presentation-on-social-media",
  "slug": "help-me-write-a-presentation-on-social-media",
  "title": "Help Me Write A Presentation On Social Media - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In just over a week I will be making my speaking debut at an industry conference. I'll be speaking at the a4u Expo in London, which is aimed at affiliate marketers, but is also twinning with SES to cover search. My particular session is on social media/networks and how they are being used by brands…",
  "content": "Help Me Write A Presentation On Social Media Social Media C By: Ciaran Norris October 16, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! C By: Ciaran Norris October 16, 2007 Help Me Write A Presentation On Social Media Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. In just over a week I will be making my speaking debut at an industry conference. I'll be speaking at the a4u Expo in London, which is aimed at affiliate marketers, but is also twinning with SES to cover search. My particular session is on social media/networks and how they are being used by brands to drive sales (my co-speaker will be looking at it from the affiliate point of view). Now I'm a pretty organised chap, and so think that I've probably got my presentation pretty much wrapped up. However, following in the footsteps of Catherine at Sticky Content, who invited peer contributions for her presentation at the Online Marketing Show this summer, I'd like to invite the wonderful Mozzers to suggest any examples they can think of where brands have used social media/networks (in all their forms - it doesn't just need to be MySpace & Digg) to promote themselves, and hopefully drive sales. Hopefully there will be some great suggestions, forcing me to re-write my presentation. However, I do have to have the final version over to the organisers by October 19th, so you don't have long. Even if I don't get to use any or all of them, this will hopefully provide a good forum to discuss real-world uses of social media. I'll also aim to share my presentation here after the event, for all of you who can't make it over to London. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Help Me Write A Presentation On Social Media"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Help Me Write A Presentation On Social Media"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ciaran Norris\n          \n            Ciaran Norris"
}