{
  "url": "https://moz.com/blog/help-team-university",
  "slug": "help-team-university",
  "title": "Help Team University - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "At Moz, we strive to give our customers the best experience possible when using our product and interacting with our team members. Help Team University is our new program that gives everyone across all teams the chance to support our customers and hear their voice!",
  "content": "Help Team University Moz News By: Nick Sayers December 19, 2012 Table of Contents Copied! By: Nick Sayers December 19, 2012 Help Team University Moz News Here at Moz, we live for happy customers. We want to give our customers the best experience possible when using our product, interacting with our community, and solving problems if they arise, and the way we wanted to get there was to give everyone in the company a chance to do customer support. To help us reach our goal, we developed Help Team University, a daylong crash course where everyone at the company does support for our customers. The concept may seem a little odd. How does training developers, HR, and even executives on the finer details of customer care actually help customers? Think about it this way: put a Mozzer who directly influences features in our products on the phone with a customer who has been adversely affected by a bug and it will provide a completely new perspective. By establishing a new window into customer support, we hope to make our products better from the ground up. We hope that HTU is a small step in the direction of being the most customer-driven SAAS company in the world! Why HTU? I believe that every single person at Moz is in customer support. We create a product for people to use and love. Every piece of the Moz process, from the E-team to Operations, deeply affects customers. HTU reinforces this connection and keeps the customer fresh in Mozzers’ minds. We like to think that the best customer support is a well-built product that is easy to use. Having the entire company interact with the people who use the product everyday will help us get there, because feedback is best coming directly from you, the customer. Help Team University gives customers a tangible voice in shaping the entire company. For instance, one of our engineers had a conversation with a customer about a bug that had been persisting for a few weeks. The engineer then opened his laptop and started fixing the bug right then and there. In addition to providing on-the-spot fixes, HTU is also valuable in providing Mozzers insight into how customers actually use our product. Moz is rapidly growing and some of our newest additions may help develop our SEO crawler, but it's tough to know exactly what pieces customers use their crawl diagnostic reports without talking directly to users. HTU provides members from all teams the opportunity to learn how people use our tools, which aids the evolution of our analytics set to be more useful to you! Another Level of TAGFEE The most important thing Moz has to offer the world is TAGFEE. With HTU, we are teaching another level of TAGFEE to everyone at Moz, beyond how we express TAGFEE internally. The great thing about TAGFEE is that it looks different every time it's used, depending on the team or situation. People sitting down with us for HTU are getting a lesson in how to treat a customer with a deep level of empathy. Every conversation we have with a customer is framed with, “Well, put yourself in their shoes.” Mozzers are consistently surprised by how empathetic and generous we are to customers experiencing bugs. This will hopefully translate to generosity and empathy deeply embedded in our product. Showing Off The Help Team loves showing off how we interact with customers (for example, we send out a weekly digest to the entire company that lets them know how happy our customers are and what bugs are weighing heavily on our community). HTU takes this a step further. We get to show the rest of the team the entire process of how we collect happiness metrics and bug reports. HTU gives the Help Team a chance to show the rest of the team how we keep thousands of customers happy with 5-6 people. Rewards The HTU process wouldn’t exist if it wasn’t rewarding. Everyone on the Help Team rewards students by teaching them with optimism and humor. We like to make everyone laugh and keep their up, even if there is a tool outage or another issue is prompting a lot of customers to reach out. We also like to keep the HTU students grounded by focusing their attention to how important PRO is to our customers. In my opinion, that intimate connection could be the most rewarding takeaway from Help Team University. I think this is the reason people ask to come back and do HTU again, and why engineering leads frequently stop in to ask about any issues we’ve noticed, or even to just chat about customers. To top it off, we add an awesome HTU achievement badge (designed by Abe Schmidt) to their Moz profile page. I am extremely lucky and proud that HTU continues inspire Mozzers. The entire process has been enlightening for the Help Team and the rest of Moz. I think any company with a customer care team would benefit from having all hands help support their community. If your company does something similar or has thought about ways to be radical advocates for your customers, please share in the comments! Also, if you have any great ideas we can implement, please let us know! Oh, and don’t forget to thank everyone on our Help Team and Sarah Bird for giving HTU life. \"It was a really fun day, and I feel like it grounded me back in the help world, which I've always loved.\" - Rand \"I really liked HTU. Specifically, I liked getting a feel for what kinds of issues come up and what Help Team thinks about to maintain a quality experience for customers. I also liked being able to tell people outside of SEOmoz about HTU. Friends were very impressed by a company that values their Help Team's job enough to allow engineers to get mentoring from the Help Team. \" - Ethel \"It good.\" - Miranda Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Help Team University"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Help Team University"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Why HTU?"
    },
    {
      "level": "H2",
      "text": "Another Level of TAGFEE"
    },
    {
      "level": "H2",
      "text": "Showing Off"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Rewards"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Nick Sayers\n          \n            Nick Sayers\n          \n            Nick Sayers"
}