{
  "url": "https://moz.com/blog/help-us-brainstorm-fun-job-titles",
  "slug": "help-us-brainstorm-fun-job-titles",
  "title": "Help Us Brainstorm Fun Job Titles - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Hello, devoted Mozbers out there (Moz + Members). We're currently in the process of redesigning our business cards, and we want some amusing, fun, not at all corporate or stuffy-sounding job titles. Rand, Gillian, and the programmers are all pretty set with their creative titles, but Scott, Jane,…",
  "content": "Help Us Brainstorm Fun Job Titles Moz News By: Rebecca Kelley November 14, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley November 14, 2007 Help Us Brainstorm Fun Job Titles Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Hello, devoted Mozbers out there (Moz + Members). We're currently in the process of redesigning our business cards, and we want some amusing, fun, not at all corporate or stuffy-sounding job titles. Rand, Gillian, and the programmers are all pretty set with their creative titles, but Scott, Jane, Sarah, the future admin, and I all need your help. We need suggestions for awesomely bodacious and radtacular job titles. I'll run down the list of what we traditionally do in order to give you all a starting point: Scott: manages business development and client communications and partnerships Sarah: she's our legal lady--general counsel, the one phone call in case I unsuccessfully rob a liquor store, all that good stuff Jane: SEO, reputation management, social media, consulting, speaking, some blogging, rocking the accent Rebecca: SEO, social media, blogging, content management, consulting, speaking, driving Rand crazy Future admin: uh, admin tasks (answering phones, running errands, fielding questions, booking travel, event planning) Danny: self-proclaimed \"head intern;\" he does development and programming odds and ends Okay, you have your homework assignment. We need job titles! Think Rand Fishkin: Wizard of Moz, Gillian Muessig: Chief Cook and Head Bottlewasher, Mel Gray: Codeasaurus Tex, Jeff Pollard: Binary Czar. Those bastards already have their titles ready to go, so help out the ones in need! If we pick your suggestion, you'll receive a lovely prize (I'm thinking an envelope full of Rand's beard whiskers, but we could also throw a link your way or something). Start brainstorming! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Help Us Brainstorm Fun Job Titles"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Help Us Brainstorm Fun Job Titles"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}