{
  "url": "https://moz.com/blog/help-with-nomenclature-for-links-brand-mentions",
  "slug": "help-with-nomenclature-for-links-brand-mentions",
  "title": "Help with Nomenclature for Links & Brand Mentions - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Hey gang - short blog post on a topic our product and marketing teams have been noodling around. As many of you know, we've got our Linkscape index, which is crawled, processed and served out on a monthly basis (there's a new index about every 30 days). We also have a newer datasource, Blogscape,…",
  "content": "Help with Nomenclature for Links & Brand Mentions Moz Tools By: Rand Fishkin February 18, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 18, 2012 Help with Nomenclature for Links & Brand Mentions Moz Tools The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Hey gang - short blog post on a topic our product and marketing teams have been noodling around with. As many of you know, we've got our Linkscape index, which is crawled, processed and served out on a monthly basis (there's a new index about every 30 days). We also have a newer datasource, Blogscape, aka Freshscape (which is currently undergoing some repairs in Labs) which crawls a few million \"fresh\" RSS feeds and indexes full content. The goal of Linkscape is to present a search-engine size link graph, while the goal with Freshscape is to provide a more realtime, full-content index of links and mentions similar to what Google Alerts does. The problem is... what to call them? We're currently hard at work on a future iteration of the SEOmoz PRO platform that will include deeper integrations of both Linkscape and Freshscape data (so you can watch and competitively compare your wide link graph metrics as well as these fresher, primarily RSS-based links and brand mentions). As such, we need a way of segmenting these that makes sense to current and future users of PRO, and we'd love your input. The following polls have some of the names we like best right now for classifying Linkscape vs. Freshscape data: What Should We Call Links from our Blogscape/RSS Index? What Should We Call Links from our Linkscape/30-Day Index? If you have other suggestions or ideas, please feel free to include them in the comments. If there's one in particular that receives lots more thumbs up than anything in the poll, we might use your idea in the final version! Thanks very much for the help - can't wait to show you our new stuff (though it will be more than a few months until this is ready to roll out). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Help with Nomenclature for Links & Brand Mentions"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Help with Nomenclature for Links & Brand Mentions"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "Moz AI: Introducing Augmented Intelligence"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}