{
  "url": "https://moz.com/blog/help-ive-been-seo-sabotaged",
  "slug": "help-ive-been-seo-sabotaged",
  "title": "Help! I've Been SEO Sabotaged! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The following is a gross exageration of my reaction to an incident I experienced recently, the form of writing is intended to poke fun at my ridiculous reaction to it. So i'm doing some routine checking in on my inbound link numbers for our site, open up google webmaster tools and I see this : ...",
  "content": "Help! I've Been SEO Sabotaged! Blogging G By: George Davis April 17, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! G By: George Davis April 17, 2008 Help! I've Been SEO Sabotaged! Blogging This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. The following is a gross exaggeration of my reaction to an incident I experienced recently, and the form of writing is intended to poke fun at my ridiculous reaction to it. I'm doing some routine checking in on my inbound link numbers for our site, open up Google webmaster tools, and see this : Now, keep in mind this is a corporate site, with just 100 pages indexed by Google. A lot of people would be happy with these numbers. But, I am not happy. No no no, on the contrary, I am jacks sobbing, sore tear ducts... Why am I not happy? Because 3 days ago, that number looked like this : Ladies and gentlemen, we have just lost cabin pressure. To the layman, I just increased my inbound link numbers by 500%. But you and I both know better. You and I both know this is a very bad thing. On further investigation, I come to the inescapable conclusion that I have been violated by the flighty, mischievous brim of the black-hat of SEO. Yes officer, I am a victim of SEO Sabotage. I massaged my cold-sweaty mouse hand, loosened the knuckles which were frozen stiff, and clicked on the link to find a huge list of irrelevant sites, one after another. Casinos, kosher meat, viagra, guns, link directories, and Nigerian SEO companies...any reputable SEO's worst nightmare. I clicked on one of the links to find this : A quick source code search and I find my company's URL, cloaked, with the anchor text \"software download.\" There are thousands of these sites with varying keyword usage, including \"Better Rankings,\" \"Cheap Viagra,\" and, of course, \"Online Gambling\"...this pretty much tells me this is probably purposeful, malicious intent to ruin an otherwise white-hat SEO campaign. So here I am, wondering what the hell I'm going to do. We're talking about thousands of site here, so the thought of contacting the owners one by one does sound a bit daunting. I thought I'd share my experience with you guys and get some tips and/or whether or not this has happened to you before. Is there a support group for this? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Help!  I've Been SEO Sabotaged!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Help!  I've Been SEO Sabotaged!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "George Davis\n          \n            George Davis"
}