{
  "url": "https://moz.com/blog/heres-how-to-write-an-email-that-throws-off-a-whole-rooms-productivity",
  "slug": "heres-how-to-write-an-email-that-throws-off-a-whole-rooms-productivity",
  "title": "Here’s How to Write an Email That Throws off a Whole Room’s Productivity - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Sometimes getting attention via email is simply about being human, humorous and following through on your commitments.",
  "content": "Here’s How to Write an Email That Throws off a Whole Room’s Productivity Content Marketing | Email Marketing By: Katy Katz October 14, 2015 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Katy Katz October 14, 2015 Here’s How to Write an Email That Throws off a Whole Room’s Productivity Content Marketing | Email Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Let me take a minute to usher you down the (totally worth it) rabbit hole I took recently. It all started with a favorite on Twitter.I received a favorite on one of my tweets from a user called @hustlecon. If I’m being honest, most of the time favorites don’t fully capture my attention, but I was intrigued by the name of their conference. I took a quick look at their twitter feed and saw a ton of user conversation about an epic email they were sending out. Sign up to the @HustleCon newsletter just so you can read their thanks for subscribing email. It's worth it just for that.— Jason Bagley (@JBagley) August 25, 2015 Now, I’m a curious person and I had to know more. What was so great about this email that had marketers and business owners alike raising their hands in praise? I mosied over to the website and found a clean site with clear punch and personality. The websiteThey are a self-proclaimed “bunch of young’uns” that puts on an annual conference for startups, as the name would imply, with job titles like “Hustler” and “Creative.” And they undoubtedly have a grasp on content marketing basics. Subscribing to their blog is easy. It’s clearly the primary call-to-action on the site. They seem to be using the email subscription list to generate leads for their conference, but the newsletter guarantees a weekly content nugget promised to brighten my week. It decide it's worth a shot. After all, once a week doesn’t seem too overwhelming of a commitment to find out how truly great this email is. The emailWithin seconds of subscribing, I receive an email with the subject line, “Look what you did, you little jerk…” Risky move. But I grew up on Home Alone and I’m a sucker for a little inside humor. So the headline is great, but the email itself is the real gem. It’s edgy and chock full of personality. They truly are going above and beyond in attempting to demonstrate their excitement in my joining the email list. I mean buzzers, pushups, and tequila?! I feel so loved! Two of my team members have to come over to my computer to see what all of the commotion was about. I may not have been joining HustleCon with shots of tequila on top of my desk, but I was definitely enjoying my reading, loudly. The follow-upThe email also has a challenge to hit reply if anything isn’t up to par. Challenge accepted. Well, actually, at this point I’ve invested so much time, that I just want to give props. So I respond back with this: What do you know, as promised, I receive a swift response with video proof attached, as well as a tweet with evidence of the pushups.By now, I’ve invested a good 20 minutes into looking at and engaging with their brand. And I have my whole team talking about how great the email is and how we can adapt their idea for our own audience.The most impressive partThat in and of itself is impressive since, just as Rand Fishkin recently mentioned in a Whiteboard Friday, I’ve been slowly falling out of love with email as a platform in general. I know, I know. As a content marketer, I shouldn’t admit that out loud. But most of my subscriptions go straight to the trash can these days. Personally, I’ve been on the hunt for ways to spice up our own email campaigns so that they don’t suffer the same fate. But the clever email wasn’t what impressed me most about this whole chain of events. It was the follow-through. The brand took the time to interact with me personally. Now I feel invested with their brand and want to spread the love. They have truly mastered the ever-so-challenging art of showcasing a unique personality online that compels users to want to engage back. I don’t know about you, but I am definitely going to be looking into this conference next year. I can’t wait to see what else they have to offer. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Here’s How to Write an Email That Throws off a Whole Room’s Productivity"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Here’s How to Write an Email That Throws off a Whole Room’s Productivity"
    },
    {
      "level": "H2",
      "text": "The website"
    },
    {
      "level": "H2",
      "text": "The email"
    },
    {
      "level": "H2",
      "text": "The follow-up"
    },
    {
      "level": "H2",
      "text": "The most impressive part"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Katy Katz\n          \n            Katy Katz"
}