{
  "url": "https://moz.com/blog/heres-how-to-cut-your-mozcon-travel-costs-by-half",
  "slug": "heres-how-to-cut-your-mozcon-travel-costs-by-half",
  "title": "Here’s How to Cut Your MozCon Travel Costs by Half - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Tame your travel expenses by booking early and taking advantage of the savings usually offered to early birds.",
  "content": "Here’s How to Cut Your MozCon Travel Costs by Half SEO Events By: Damon Gochneaur July 27, 2016 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Damon Gochneaur July 27, 2016 Here’s How to Cut Your MozCon Travel Costs by Half SEO Events This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Marta Turek speaking at Mozcon 2015When it comes to digital marketing conferences, the choices are overwhelming. From Minnesota to Austin, Seattle, Miami, New York, Los Angeles, Europe, and Asia, there seems to be an event nearly every week of the year. To me, one conference stands out as not your typical marketing conference: MozCon. Every July, for three days, 1,500 people from across the globe descend upon Seattle for the event.When I speak with colleagues, I hear over and over how they avoid attending conferences in general because of the cost. From conference ticket to airfare to hotel accommodations, the expenses can add up quick. And if you’re a small agency owner (like me), a freelancer, or just a dedicated digital marketer footing their own bill, every expenditure matters and resources are eternally limited — myself included. So after attending MozCon 2014 and spending more than $3,000, including the event ticket, I figured there had to be a better way. And there is... In the last two years I've been able to dramatically trim the cost of attending MozCon, and most of the tactics I use can be used for any event. Small steps, big savingsEvent tickets: One of the biggest expenses for attending conferences is the event ticket. Simply put, there is no replacement for early planning. Whether it’s MozCon, ComicCon, or a Beyoncé concert, early-bird pricing is typically available and can result in substantial savings. For MozCon, specifically, the biggest savings can be had by taking advantage of super early bird pricing: $599; early bird pricing: $799; or becoming a Moz Pro Subscriber: $999. Bottom line, book early. Lodging: Seattle is an expensive city to travel to. While the public transportation makes getting around a breeze, finding a hotel to rest your head on for a reasonable rate can be a seemingly insurmountable task. There are other options. In the last 18 months, I’ve become the biggest fanboy for Airbnb. With a little bit of research and due diligence, you can find a shared room, a private room, or in my case an entire home to rent, and (surprisingly enough) at rates far more affordable than a hotel room. I’ll break down my exact costs for the trip below, but I was able to secure an Airbnb just a few miles from the convention center for significantly less per night than the cost of the host hotels. Additionally, when I factoring in the cost of catching an Uber each morning and afternoon, I was still spending far less per day than had I stayed at one of the host hotels. Want to lower your housing costs even further? Find a two or three bedroom Airbnb and split it with 1–2 roommates, which is exactly what I did. (Check the Capitol Hill, First Hill, Squire Park, & Hilltop neighborhoods, which are all fairly close and offer lots of options.) Airfare: I’m not going to pretend for a second that I’m some sort of amazing travel agent or have some sweet algorithm that helps me get the lowest airfare prices and deals. But I am smart enough to know that, like conference ticket prices, it pays to get airfare well in advance. Quick life hack: Google’s flight booking system is awesome in the fact that it will show you the cost of flying in/out at multiple dates/times so you can save yourself significant money by flying out at a less desirable time, like 7:30am on a Sunday morning like I did. If you have flexibility, traveling during some \"off\" hours can pay huge dividends in flight savings. How much money I saved (and you can, too)Here’s (my first) 2014 MozCon travel expenses: Conference Ticket: $1,000 (Eds. note: $999) Hotel: $1,500 Airfare: $500 Total: $3,000 For comparison sakes, here’s the 2015 travel expenses: Conference Ticket: $800 (Eds. note: $799) Airbnb: $400 (my share) Airfare: $320 Total: $1,520 Expenses for 2016, so far: Conference Ticket: $599 Airbnb: $642 (Sunday–Thursday) Airfare: $260 Total: $1,502 And if you’re asking me, having an apartment/house is a huge upgrade compared to any standard hotel room. Add in the fact that our Airbnb has a rooftop deck and balconies off every bedroom and the living room, and it’s nearly incomprehensible to me why anyone would stay in a hotel room. Best part, I just booked my Airbnb and flights last week, which means there’s still one to two weeks to take advantage of the timing window and reap significant savings.Another resource worth perusing: The Positive ROI of Conferences: A Deep Look at #MozConGet in your boss's ear Want to win your bosses appreciation? Come to her with the cost breakdown similar to what I highlight above, and you're sure to have helped your cause. I bet your pitch on attending MozCon, or whatever event you endeavor to attend, converts a little better. Find me at the MozCrawl, Ignite, or the Garage Party, because every dollar saved is one more dollar for cocktails. Care to share any ideas you have for saving money when traveling to events? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Here’s How to Cut Your MozCon Travel Costs by Half"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Here’s How to Cut Your MozCon Travel Costs by Half"
    },
    {
      "level": "H2",
      "text": "Small steps, big savings"
    },
    {
      "level": "H2",
      "text": "How much money I saved (and you can, too)"
    },
    {
      "level": "H2",
      "text": "Get in your boss's ear"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Damon Gochneaur\n          \n            Damon Gochneaur\n          \n            Damon Gochneaur"
}