{
  "url": "https://moz.com/blog/heres-how-to-create-a-product-page-that-converts",
  "slug": "heres-how-to-create-a-product-page-that-converts",
  "title": "Here's How to Create a Product Page That Converts - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Delivering a product page that delights customers and leads to increased conversions is easier than you think. Moosa Hemani brings us some no-nonsense advice when it comes to optimizing an e-commerce site that results in a positive user experience.",
  "content": "Here’s How to Create a Product Page That Converts E-Commerce SEO | User Experience (UX) By: Moosa Hemani May 8, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Moosa Hemani May 8, 2016 Here’s How to Create a Product Page That Converts E-Commerce SEO | User Experience (UX) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. [Estimated read time: 13 minutes] An effective e-commerce product page captures the audience’s attention and compels them to convert to paying customers. Many e-commerce businesses believe a product page is all about high-resolution images with detailed descriptions for each product. Although these are important areas that need to be considered, thinking that they are the only elements needed to win the game for you is overly simplistic. In this post, I'll discuss the elements that make a product page captivating for visitors. I'll discuss in detail the things you should consider doing on your product pages so that they stand out from the competition. Product URLs must be a priority Let me start out with something that's critical to get right, yet is often neglected: optimizing product URLs. Unfortunately, I know dozens of e-commerce stores that don't consider the URL to be part of a product page at all, much less one of the most important parts. Well, guys, they're wrong. Ignoring this vital fact can seriously impede your click-through-rate (CTR), especially in terms of organic searches. Remember, there are literally thousands of choices for a visitor once she decides to buy a product online. She will go for options that she's satisfied with. Let’s suppose a user runs a Google search and sees this in the results: Note: I've purposely hidden the titles and descriptions so you can focus on the URLs. Now, try and understand the psychology of a potential customer who has multiple available choices online. Look closely at the two URLs given above. Which one would you click if you were looking to buy men's shirts? Naturally, the first one — it's clear that upon clicking the link, you will directly land on the men's clothing section of an e-commerce site. The second URL, on the other hand, look like it will take you to a brand page — which may or may not offer the shirts you're looking for. (The second URL doesn't make it clear whether they're selling shirts for men or women.) Takeaway: SEO-friendly URLs aren't simply important because they'll give you better rankings in search engines; they also answer basic questions pertaining to the buyer's awareness stage. A URL must give a clear indication of where the user will land once he clicks it; therefore, it must be relevant to the search query. Think carefully about product titles Your titles should be SEO-friendly, but there's a very fine line between SEO-friendly titles and overly optimized title tags. Catchy and attractive titles can significantly increase the number of clicks. Let’s suppose you're searching for \"business plan consultant\" and all you see is a title loaded with different keywords that basically mean the same thing. Now compare this to another page that has the correct keywords to please potential buyers and search engines. Which page title would you click? The reason why I'd choose the first one is that its message is clear, and it's completely relevant to what I'm searching for. So, if the product page is stuffed with all the possible keywords that the audience could possibly search for, you're actually decreasing your chances of being clicked. Takeaway: Titles are important for search engines, but they're equally important for your target audience. Make sure the title for your product page is well thought out, relevant, and delivers the complete message in 65 characters or less. Always use high-resolution images A website's image section is one of the most important sections of a product page, as it's sure to capture the attention of visitors (provided that it is well-constructed). The clearer your product image, the more interest you can arouse in your visitors. A visitor is bound to look for the image of a product in order to make sure that it is, indeed, what he wants to spend his money on. When it comes to images on product pages, you should consider the following few things: Image size When I say high-resolution, I don’t just mean the image quality, but also the image size. The image should be of a size that lets users easily see the product details and understand what it would look like when they receive it at their doorstep. Images that are either too small or too large (in a way that doesn’t fit the screen) can negatively impact user experience, thereby leading them to leave the page. The best thing to do is to use images of the same size and allow website visitors to zoom in to take a closer look at the details. I like how Sophie & Trey present the images on their product page. They display two images of the same product side-by-side, and a visitor can get a closer look at the product by hovering the cursor over a specific area of the page. Multiple angles If you want users to buy your products, then you have to encourage them to make a purchasing decision by giving them all the product details they need to do that. Normal images are two-dimensional. If you take photos of your products from multiple angles, however, you can give your potential customers a more realistic of how your products look in person by presenting them virtually as three-dimensional images. For electronic products like cell phones, laptops or tablets, it's important to show visitors multiple angles so they can understand how long or wide a product is, how it looks up close, and how it will look and feel in their hand. If you have a fashion brand, then try showing the same dress of models with different looks. This will make it easier for the visitor to imagine how she will look in the dress she is looking at if you purchased it from your site. Takeaway: When you optimize your product pages, make sure the product images are high-quality and available in different angles. This will allow visitors to not only see what your products look like, but virtually get a sense for how they feel as well, thereby increasing the likelihood that they'll convert into paying customers. Product videos This one is simple, and becoming increasingly important in the world of e-commerce. Like it or not, videos can work wonders for fast sales. You don’t have to trust my words. Listen to the head of search at ao.com, who has tried it on her website and reaped the rewards of success: \"Video gives us the opportunity to wow our customers and this, in turn, delivers results. We have tested and proven that when someone watches our video reviews they’re 120.5% more likely to buy, spend 157.2% longer on the site, and spend 9.1% more per order. So my focus this quarter is to increase customers watching video. Simple.\" There are some common questions about video that come to mind, especially if you're looking at e-commerce from a technical point of view. For example, what's the best method to add videos? Should we use a CDN, upload videos on YouTube and embed the links on our website, or something else? This guide will help you answer those questions and more. Takeaway: Including product videos on your product pages is a trump card that leads to better conversions. If you're skeptical, invest in videos for a bit and see if your conversions improve. If so, create a budget for making high-quality product videos on an ongoing basis. Get creative with product descriptions The product page description is important from two aspects. First, it helps you with SEO. With unique, quality, and keyword-centric product descriptions, your chances of ranking for product-related keywords via search engines will be higher. Second, well-written product descriptions can engage visitors and encourage them to convert into paying customers. If you have a website with thousands of products, the common challenge is to write unique and high-quality product descriptions. While overcoming this challenge can be frustrating, you need to do it or you'll risk losing out on considerable amounts of potential traffic (and paying customers). Even if your target audience can read hundreds of words in the description section, my advice is to show only 60 to 80 words, and hide the rest under \"more.\" Takeaway: Following are a few of the things you need to keep in mind when creating product descriptions for your e-commerce website: You have to create unique and engaging product descriptions that allow users to convert into paying customers. Do not copy product descriptions from manufacturers' websites, as doing this will kill your conversion rates. Either invest time on creating product descriptions for each of the products, or hire talented people on a freelance project basis to help you with it. Make sure to keep the quality in check. These are the few ideas to keep in mind while creating product descriptions that are not only SEO-friendly but also enhance user experience. Provide quantity and color selection options From personal experience, I can tell you that I bounce from product pages if options for color selection or purchasable product quantities are either unavailable or difficult to find. I know people who actually pay higher prices to other manufacturers/retailers that have this option available. The whole idea is to make it easy for the user to find and buy multiple products at the same time, instead of forcing him to come back and buy again. Also, if you have a product that is available in different colors, it's better to create it as one product with the option to choose three different colors instead of three different products. Takeaway: The ideal product page means little to no frustration for the visitors. User reviews can work wonders for your business There are two different mindsets in the e-commerce industry as it regards reviews. One view is that there shouldn’t be a review section on the product page, as most people don’t really leave reviews, and an empty review page is unappealing. On the other hand, some believe there should be a user review page, as it will provide some extra unique content to the page. I don’t think either of the above is the correct method of implementing user reviews. I'm a strong advocate of using a strategy like the following for reviews: Send an email to all your happy customers and offer them a 10–20% discount if they're willing to leave a genuine comment on your product page about their purchase. Another idea is to gamify reviews in a way that would encourage buyers to leave reviews on the different product pages on your website in a way that benefits them. Takeaway: User reviews are very important as they strongly impact visitors' buying decisions, but implementing them with yet another plugin could be a mistake. The idea is to deploy a smart strategy and adjust it as needed. Don't forget your social sharing buttons Having prominent and easy-to-use social sharing buttons on your product pages encourages users to share products with their social circles. This will not only increase your numbers, but the returning social traffic from this activity can bring in more conversions for your website. Takeaway: Encourage visitors to share your products within their social circles by rewarding them with freebies every now and then. Be smart with the \"add to cart\" button This is the most important element of the page from the perspective of conversion optimization. The \"add to cart\" button must be easy to find; otherwise, you'll risk losing potential customers. The fashion brand Lulu's websites provides us with another excellent example of how the \"add to bag\" button can be effectively used to drive sales on product pages. The main color theme of the website is black, but if you focus on the add to bag button, you'll notice it stands out because it's pink. Takeaway: The \"add to cart\" button needs to stand out from the overall color scheme of the page so the user can easily identify it and proceed towards the checkout. Cross sell and upsell You can always add elements on your product page that will help you cross-sell and upsell stuff to get the most out of a customer. This is a great example of cross-selling by Nordstrom. I don’t think their placement is outstanding at the moment, but when you're implementing this on your product page you can do some testing to see what works best for your audience. Takeaway: Consider showing related products together with the product that the user intends to buy (cross-selling) or selling related products as a package (upselling). An e-commerce website is incomplete without live chat The numbers speak for themselves. If you're a business that supplies products to several countries, try using live chat software that supports multiple languages to help you build better relations with overseas clients. Takeaway: Do I really need live chat software on my website? An e-commerce business should quit pondering this question and start investing in live chat. Pricing This one is a personal favorite. There's no serious e-commerce website on earth that won't add the price on the product page or will make it hard to find. So, why are we even talking about this in the first place? That's because as a business you should remain mindful of a few things when including pricing on product pages: Make prices clear and easy to read. There are different pricing strategies you can try. I wrote a detailed article on the subject a while ago and you can read it here: 4 Pricing Strategies for SaaS Startups to Increase Conversion Rate (applicable to e-commerce, as well). Experiment with adjusting pricing according to the scarcity principle and you'll see an overall improvement in conversion rates. In the above example, the company is using the \"magic of the number nine\" technique on their website. Takeaways: Keep the prices on your product page simple, clear, and readable. Try different pricing tactics that work within your industry, such as the \"number nine technique\", the \"discount on bulk order\" offer, and the \"scarcity principle.\" Be trustworthy The buying cycle starts with a single question and moves forward when it gets answered. While the potential customer is on the product page deciding whether or not they should buy the product, the most important question running through their mind is \"Why should I trust this company?\" At Workplace Depot, we use this trust signal throughout the website (including the product pages) which is why our conversions over the months have only grown. Having a trust signal on the product page is important, but where to put it is tricky and can only be assessed via A/B testing. Try placing the trust signals on different parts of the page and test it against the data to see which place works well with your target audience. Takeaway: Quality trust signals are important and need to be included throughout your e-commerce website in order to increase overall business conversions. Page load time I always advise my e-commerce clients to go with a minimalistic design because less clutter allows websites to load quickly. Slow page loads will kill your SEO and dramatically decrease your conversions. This infographic by Kissmetrics nails it perfectly: Takeaway: In e-commerce, every second counts. Make your product pages clean and light. Visitors don't have patience for slow websites. Mobile If your product pages are not mobile-friendly, you're likely losing fifty percent of your prospective customers. The same factors above apply for mobile, but remember: folks are even more distracted on mobile devices, so using concise, clear messaging with large, easy-to-read fonts is your best bet. Conclusion Product pages are often neglected as businesses focus on optimizing their e-commerce sites for long-tail keywords at the expense of the user. Don't make this mistake. Focus instead on optimizing your product pages by keeping user experience at the forefront of all your actions, and you'll very likely be rewarded with higher conversions. If you think I've missed something, please let me know by adding it in the comments section. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Here’s How to Create a Product Page That Converts"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Here’s How to Create a Product Page That Converts"
    },
    {
      "level": "H2",
      "text": "Product URLs must be a priority"
    },
    {
      "level": "H2",
      "text": "Think carefully about product titles"
    },
    {
      "level": "H2",
      "text": "Always use high-resolution images"
    },
    {
      "level": "H3",
      "text": "Image size"
    },
    {
      "level": "H3",
      "text": "Multiple angles"
    },
    {
      "level": "H2",
      "text": "Product videos"
    },
    {
      "level": "H2",
      "text": "Get creative with product descriptions"
    },
    {
      "level": "H2",
      "text": "Provide quantity and color selection options"
    },
    {
      "level": "H2",
      "text": "User reviews can work wonders for your business"
    },
    {
      "level": "H2",
      "text": "Don't forget your social sharing buttons"
    },
    {
      "level": "H2",
      "text": "Be smart with the \"add to cart\" button"
    },
    {
      "level": "H2",
      "text": "Cross sell and upsell"
    },
    {
      "level": "H2",
      "text": "An e-commerce website is incomplete without live chat"
    },
    {
      "level": "H2",
      "text": "Pricing"
    },
    {
      "level": "H2",
      "text": "Be trustworthy"
    },
    {
      "level": "H2",
      "text": "Page load time"
    },
    {
      "level": "H2",
      "text": "Mobile"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Common Mistakes E-commerce Websites Make Using JavaScript"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Moosa Hemani\n          \n            Moosa Hemani\n          \n            Moosa Hemani"
}