{
  "url": "https://moz.com/blog/heres-how-meaningful-content-updates-increased-traffic-by-57",
  "slug": "heres-how-meaningful-content-updates-increased-traffic-by-57",
  "title": "Here’s How Meaningful Content Updates Increased Traffic by 57% - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It’s no big secret that dwell time has grown as a vital SEO metric for content publishers across a wide spectrum of industries. For our site, one of the largest consumer health websites in the world, time on page is a top priority.In fact, we have a dedicated multi-department engagement team who is…",
  "content": "Here’s How Meaningful Content Updates Increased Traffic by 57% Content Marketing | On-page SEO | Advanced SEO By: Ryan Purtill January 22, 2016 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Ryan Purtill January 22, 2016 Here’s How Meaningful Content Updates Increased Traffic by 57% Content Marketing | On-page SEO | Advanced SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. It’s no big secret that dwell time has grown as a vital SEO metric for content publishers across a wide spectrum of industries. For our site, one of the largest consumer health websites in the world, time on page is a top priority. In fact, we have a dedicated multi-department engagement team that is constantly testing and tweaking design, content, and programing elements of our site. This team has the singular goal of providing the ultimate user experience, and one vital metric for measuring user experience is time on site. I wanted to share with you an initiative of the team that has already resulted in a nearly 10% increase in average visit duration and a 57% increase in traffic to affected pages. Article length and session durationThe project began with an analysis of article length. We looked at about 4,800 health articles on our site and compared the average word count to session number, bounce rate, and session duration. A look at the data: One key finding was word count and average session duration (ASD) had a direct positive correlation. In fact, for every 125 words we added, we noticed a 10-second increase in ASD. That is, until an article hit 1,125 words: The impact was far less significant. This trend was consistent across our platforms. (Of course, this is not a magic number for all sites, as user intent varies, but we do recommend performing a similar analysis on your site.) Relevant content to add?Using the data above, we had strong evidence to support revisiting articles with word count under 1,000 words and adding content to them until they hit the “sweet spot” of 1,125 words. The more difficult step was determining exactly what content to add. It was important for us to increase article word count in a meaningful way. Any additions to our content must truly enrich the user experience and provide new information that’s engaging and highly relevant to our audience. This is where having a multi-department team made a big difference. The team first looked to see what other tests could be pulled in to increase word count. One standout was the use of “prevalence data\": adding an indicator of how likely a symptom is indicative of a condition. For example, if someone lands on our page displaying possible causes for a rash, they might be relieved to see that it’s probably not SARS, which only affected 8 people in the U.S. in 2014. Our initial prevalence data tests showed an increase in ASD of about 3%. We’d also been testing adding real-life user questions about medical issues to our clinical content. So, in addition to reading about the symptoms, causes, treatments, and other encyclopedic information about a condition, a user will also get a doctor’s perspective on a practical question about managing the condition. Here is an example from a page on grief: Pages with Q&A additions saw an increase in dwell time of about 2.5%. After adding prevalence data and user Q&As to shorter articles, we looked to SEO content and keyword research. We conducted content audits to identify related search queries the original article didn’t cover. Our editorial team then had writers supplement the original article with content in those new areas. Where to find related search queries?If you're hoping to supplement existing content to address related searches, I’ll walk you through our process. First, it’s important to know that related search queries can come from a variety of different sources. One of the most obvious is the related searches offered at the bottom of a SERP. But your journey shouldn’t stop there. Take a look at pages ranking above or around you. Did they cover something you didn’t? Can you present information in a clearer, more engaging, or more comprehensive way than the competition did? If so, that’s a great place to start. If you’re lucky enough to have an engaged social community, use it. Our audience is very vocal, so we reviewed our social feedback for themes/content areas our audience was looking for and included them in our additions. Here’s an example of some earache remedies that our community was mentioning, but we weren’t covering: Are there any long-tail keywords you rank on the the bottom of first page for? Use SEMRush or another SEO competitive analysis tool to check. You may have a great opportunity to start winning on that keyword with expanded content.Also, keyword research comes in handy for finding related queries that are appropriate to the article you’re supplementing. We used a combination of online keyword tools, including SEMRush and Google Keyword Planner, to uncover related search terms worth including. Remember, your article can’t be all thing to all users. Trying to cover all related searches, or including related searches that aggressively change the tone or direction of the article, can make your page look unfocused and disconnected—which will negatively affect the user experience. Expected and unexpected resultsAs we expected, we saw an increase in session duration as articles were updated with related content. So far, we’ve gotten about a 10% lift for updated pages (U.S. desktop). Here are some of our ASD highlights: We also saw some unexpected results that thrilled us. U.S. desktop traffic to updated pages jumped significantly as we saw positive movement on search engine result pages for some highly competitive head tail keywords, including first position rankings for “stomach ulcer” and “iron deficiency anemia.”Traffic to our iron deficiency anemia page grew by 114% since the update:Unexpected SEO results continued to flood in as the project rolled on: A nearly overnight six-position jump from 8th to 2nd position for “hernia,\" and a jump to the fourth position for “high potassium hyperkalemia.” Organic Positions for “Hernia” (The red dot indicates day of update) Organic Positions for “Gallstones” In retrospect, the organic traffic boost makes perfect sense, as this project combined a number of SEO best practices that simply provided the best experience for our end users, including: refreshing older content using viewing habit data from our user base to optimize content including high-volume related queries to ensure content was relevant expanding page content to cover more queries providing a more comprehensive result for any single query using engaging design for digestible content Together, these elements provided a more meaningful product for our audience. This project will continue to roll out in 2016, and is a great reminder of what can happen when you make decisions with actionable data and put your user first. Oh, and if you’re wondering, this article is exactly 1,125 words. (Eds. Note: Before editing, that is.) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Here’s How Meaningful Content Updates Increased Traffic by 57%"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Here’s How Meaningful Content Updates Increased Traffic by 57%"
    },
    {
      "level": "H2",
      "text": "Article length and session duration"
    },
    {
      "level": "H2",
      "text": "Relevant content to add?"
    },
    {
      "level": "H2",
      "text": "Where to find related search queries?"
    },
    {
      "level": "H2",
      "text": "Expected and unexpected results"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ryan Purtill\n          \n            Ryan Purtill"
}