{
  "url": "https://moz.com/blog/heres-how-a-pricing-tweak-enabled-us-to-increase-sales",
  "slug": "heres-how-a-pricing-tweak-enabled-us-to-increase-sales",
  "title": "Here’s How a Pricing Tweak Enabled Us to Increase Sales - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When attempting to optimize your site for conversions, price tweaks are but one element that must be considered.",
  "content": "Here’s How a Pricing Tweak Enabled Us to Increase Sales Marketing Psychology By: Stephanie Kable August 11, 2016 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Stephanie Kable August 11, 2016 Here’s How a Pricing Tweak Enabled Us to Increase Sales Marketing Psychology This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. As the owner of a website that offers private tutoring, I'm always looking for ways to optimize our processes in order to increase leads and sales. The original offerFor years, we offered an inexpensive 30-minute trial lesson so prospects would be able to check out our services and, if they liked it (and 80% did), purchase a package of English lessons. This way, we were able to filter the prospects for those who were serious about learning English and committed enough to pay a small amount to try our services. However, we were faced with two head-scratching realities: 1. Conversions were low: Were we missing out on prospects who were serious but not ready to make a payment (even a small one) right away? 2. Most of our competitors offer a free trial lesson: Were these prospects going to our competitors because they couldn't try us for free?What changedAt the end of 2015, we decided to change our policy and offer a free 15-minute trial lesson. The idea of the trial lesson was still to make a first contact with the student, introduce him/her to one of our native English teachers, demonstrate how we work, and show the student we could help them improve their English. At the end of the trial lesson, the prospective student received a feedback report that included an evaluation of their English speaking ability as well as suggestions for getting it to the next level.When we compared the numbers from the first quarter of 2016 with those from the first quarter of 2015, we noticed the following:1. Increased conversion rate from traffic: An increase in the rate of conversions from traffic (50% more leads). We were now engaging more with our website's visitors. 2. Decreased conversion rate from trials: A decrease the rate of conversions from trial lessons. That is, a smaller percentage of trial lesson students decided to buy a course. (Instead of 80% of our leads choosing to continue taking English lessons by purchasing a lesson package, as they did in Q1-2015, only 60% chose to do so in Q1-2016.)This oddity was actually expected since the free offer doesn't ask for the same level of commitment. The prospects who register on our website without being required to pay don't always fully follow the process we have in place for them. Once registered, they might not always book a lesson; when they book a lesson, they might not always attend their lesson. A real effort must be made to make sure that each person that registers has a real intention, at minimum, to book and attend a lesson.If offering a free lesson worth the return? This experiment is not over and we still need to optimize our processes and address some of the issues we've uncovered so far. Overall, at this stage, we can say that the increase in purchases due to the trial lesson change is not significant. However: 1. We get a lot more leads: It's up to us to nurture these leads until they are ready to work with us2. We serve our prospective students better: They appreciate the fact that they can talk to us and try our services before giving us any credit card informationWe now have a greater margin of improvement, and we can work with more leads. But we must put the right processes in place to make sure these leads feel that we are fully committed to help them improve their English. Every business needs a lead magnet, a free offer that will help them build a prospect list. We already provide free ebooks and a free English level test, but feel that no offer compares to being able to sample the product or service that is available for purchase. For now, we'll continue to keep our eyes on metrics, including conversion rates and costs, as well as work on optimizing our processes. Also, we will evaluate whether or not the free offer reinforces our brand — which is built on trust, commitment, and customer satisfaction.How has your brand handled similar challenges? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Here’s How a Pricing Tweak Enabled Us to Increase Sales"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Here’s How a Pricing Tweak Enabled Us to Increase Sales"
    },
    {
      "level": "H2",
      "text": "The original offer"
    },
    {
      "level": "H2",
      "text": "What changed"
    },
    {
      "level": "H2",
      "text": "If offering a free lesson worth the return?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Turn Marketing Into Meaningful Relationships — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Catering to User Behavior Shifts During Times of Economic Turbulence — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Close More Sales With Emotion-Driven SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Stephanie Kable\n          \n            Stephanie Kable\n          \n            Stephanie Kable"
}