{
  "url": "https://moz.com/blog/here-39-s-how-multi-location-businesses-can-compete-effectively-for-organic-traffic",
  "slug": "here-39-s-how-multi-location-businesses-can-compete-effectively-for-organic-traffic",
  "title": "Here’s How Multi-Location Businesses Can Compete Effectively for Organic Traffic - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Creating city-specific pages for your multi-location business could increase traffic and conversions for your brand.",
  "content": "Here’s How Multi-Location Businesses Can Compete Effectively for Organic Traffic Local SEO By: Nick Van Huis February 9, 2016 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Nick Van Huis February 9, 2016 Here’s How Multi-Location Businesses Can Compete Effectively for Organic Traffic Local SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. To help a dental client with 11 locations better compete in multiple locales, we created “City Service Pages” (CSPs) for two of their locations. Completely distinct from the existing service pages, these CSPs are engineered to drive niche traffic from local users by utilizing more specific long-tail searches. Instead of simply listing the services offered, as is often done on location-based landing pages, we were able to optimize individual landing pages based on their targeted communities.To drive the niche traffic we desired, we first conducted keyword research to understand the broader terms for which users were searching. Using SEMrush, we researched short-tail keywords that drove the largest amount of traffic. We did this because we knew adding a local qualifier to the short-tail keyword would drop the amount of traffic driven by a short-tail keyword—in some instances to the extent that the traffic would be too low for auditing tools to properly show keyword performance in terms of monthly search volumes, competition, and other important keyword metrics. Notice the difference in search volumes between \"orthodontist\" and \"canton orthodontist\":(Image pulled from the SEMrush dashboard.)(Image pulled from the SEMrush dashboard).Theoretically, we knew that \"Canton orthodontist\" would drive traffic to its respective CSP, but the volume was low enough that auditing tools could not discern any relevant data. By researching short-tailed keywords, we were able to find the keyword that drove the most potential traffic. This allowed us to drive decent traffic, while still catering to a niche audience.Once this process was complete, we optimized site content to reflect the following keyword structure: “city name + service” or “service + city name.” Including the city names helped us avoid cannibalizing traffic from other CSPs or the site’s generic service pages. When creating the CSPs, our initial focus was on onsite optimizations in order to get the pages to rank, with internal links to other related CPSs being included on the pages as well. In the end, we were able to create CSPs optimized to drive niche traffic in specific geographies. Anticipated problemsWe knew going in that creating these pages would divert traffic from our main location-based landing pages, and possibly decrease overall traffic to the locations in general. We knew this because we would be diverting traffic from the location pages that were optimized with short-tail keywords to the more niche pages. Essentially, we would be segmenting the audience into two groups: users that were in \"research mode\" and users that were more likely to convert. For example, someone that searched for \"orthodontist\" could be searching for several reasons. They could be looking for the definition of orthodontist. They could be looking for orthodontist schools, or news about orthodontists. It was difficult to discern what the user was trying to achieve by searching \"orthodontist.\" If a user was searching for \"Canton orthodontist,\" we assumed they were looking for an orthodontist in their area, meaning they were more likely looking to make an appointment. The CSPs were created for those types of users, ones making actionable searches. Also, we anticipated the drop in traffic because we knew the new pages were optimized using keywords that drove less traffic than the short-tail keywords used previously. But by capturing more niche traffic from searches using long-tail keywords, we were confident we could drive more users to the site that were further down the conversion funnel. Data considerationsThe optimized CSPs were implemented on August 10, 2015. The data we collected from Google Analytics compares traffic from August 10, 2015 – September 30, 2015 with traffic from June 19, 2015 – August 9, 2015. A new website for the client was launched August 27, 2015, which may have affected some of the data shown below. Google Analytics tracked resultsLocation #1:Location #2:As was expected, traffic to the main location-based landing page decreased for Location No. 1, but overall organic traffic—organic traffic driven to all CSPs—increased. For Location No. 2, not only did overall organic traffic increase, but traffic to the main location-based landing page also increased. Location No. 2 drove more users that bounced less and viewed more pages per session, whereas Location No. 1 drove more users that viewed more content and stayed on the site longer.The attention metrics (measuring average time on site and pages per session) increased for both locations. The average session duration for Location No. 2 dropped, but the bounce rate also dropped, and its pages per session increased.The bounce rate for Location #1 increased marginally, but users visiting the site via their CSPs were more likely to view a greater amount of content as well as spend more time on the site. Users were viewing more content and staying on the site longer, indicating to us that the optimized content was engaging users. They were taking time to read it and click through to other content. The most significant takeaway was the number of new patients acquired increased for both locations. Location No. 1 saw a 24% increase in new patients, while Location No. 2 experienced an increase of 50%. The increase was attributed to more qualified users being driven to the site. The CSPs were created in order to drive more niche traffic that was more likely to convert, and the fact that the number of new patients increased for both locations indicated that the pages worked as hypothesized.What we learnedThe creation of City Service Pages proved successful for both locations. The segmentation of services into tightly focused subject matter landing pages drove more traffic to the site. The traffic featured a relatively large number of “convertible” users who used long-tail keywords in search. This resulted in a large spike in new business for both locations. By creating service pages optimized for each physical location and specific, location-based services, multi-location businesses can successfully compete on a hyper-local level with single-location competitors in their area. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Here’s How Multi-Location Businesses Can Compete Effectively for Organic Traffic"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Here’s How Multi-Location Businesses Can Compete Effectively for Organic Traffic"
    },
    {
      "level": "H2",
      "text": "Anticipated problems"
    },
    {
      "level": "H2",
      "text": "Data considerations"
    },
    {
      "level": "H3",
      "text": "Google Analytics tracked results"
    },
    {
      "level": "H2",
      "text": "What we learned"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Nick Van Huis\n          \n            Nick Van Huis\n          \n            Nick Van Huis"
}