{
  "url": "https://moz.com/blog/heres-how-to-kick-your-web-host-to-the-curb-and-never-miss-a-beat",
  "slug": "heres-how-to-kick-your-web-host-to-the-curb-and-never-miss-a-beat",
  "title": "Here’s How to Kick Your Web Host to the Curb and Never Miss a Beat - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Selecting a new web host, even under duress, is a much simpler process when you're prepared.",
  "content": "Here’s How to Kick Your Web Host to the Curb and Never Miss a Beat Technical SEO By: Sherry Gray April 28, 2016 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Sherry Gray April 28, 2016 Here’s How to Kick Your Web Host to the Curb and Never Miss a Beat Technical SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. In nearly every business website owner's life, the time comes when you have to switch servers. Most of us start small with what we can afford, assuming we can scale up as we grow. At some point, we outgrow the web host and wind up with slow, limited service and an outdated back office — or worse — an update that doesn't support your processes and makes a mess of everything.Before I became a writer, I worked for many years at a small web hosting company. Part of my job (which had a lot of parts; you know how it is) was helping customers move on and off our proprietary software. It consisted of a semi-custom website loaded with features for member organizations.Back in the dark ages (2006-ish), migration was a great deal more complex — making their data fit our fields for import sometimes required manually rewriting all the code. Without the tools and platforms we now have, it often took months to get customer data reformatted for migration to a new host. What a nightmare!Things are a lot different today, but in some ways, the complexity of platforms and devices makes migration potentially more confusing. A decade ago, we were still in the early stages of smartphones, and all mobile sites were redirects to uncomplicated m. sites. Tablets didn't even exist. We didn't have to worry about mobile optimization and compatibility issues like we do now for a huge variety of devices, sizes, and operating systems.If you’re worried about the possibility of having to move your site, you should be. Issues caused by a move can cause slow load times and affect SEO, disrupt business operations, and undermine consumer confidence. The bigger the site, the greater the risk you are taking that the move will impact your search engine rankings.In a blog post, the research director at Gartner, Gregor Petri wrote, “It is often difficult (lengthy and expensive) for user organizations to switch suppliers, often because after some time the software becomes so closely linked with the way the organization works that saying goodbye to the vendor becomes virtually impossible.”How to avoid cloud lock-inVendors can hold your website hostage in several ways, and avoidance is your best defense. You really don’t want to find out when it’s time to move that you don’t own your own data, graphics, architecture, or proprietary functions (such as code you paid to have written).My first piece of advice is pretty simple and applies to everything you put your signature on, ever: Read the fine print before you sign.Choose a cloud vendor that uses open source code to make it easier to migrate, if you must.But, of course, you already have a website.It’s big, it’s gnarly, and it’s jam-packed with multimedia content, cool interactive features, and a nested navigation system that would make M. C. Escher weep.Crafting an exit strategyBefore you need to move, be ready. Here are five things you can do to always be prepared for the worst. I’m just going to assume you already have your contract in hand and are checking the details.Step #1: Always have up-to-date backupsIt doesn’t happen often, but hosting companies do go out of business. Don’t panic. Most web hosts make regular backups, so in the unlikely event yours goes down in flames, you can be back online in no time. The first point in your exit strategy is having an up-to-date backup ready.Step #2: Research migration toolsFinding the right migration tool is often a matter of doing your homework. Picking the right tools — or set of tools — will ensure a seamless transition.Step #3: Pick a new destinationIf you suddenly lose your web host, scrambling to find a new one can lead to mistakes. Make a short list of potential vendors that are a good match for your business in terms of the costs, the software, the compatibility, and other pertinent details.Step #4: Get your SEO in orderWhile you should keep your SEO on-point in general, if you’re considering moving to a new server, you need to make darn sure it’s clean.Starting with a well-optimized site will make any transition much easier.Step #5: Evaluate your featuresYou may be relying heavily on integrated software and custom programming. Talk to your programmer in advance about whether all the bits and bobs that make your website functional will plug-and-play on a new system.In most cases, you’ll have plenty of time to prepare to move to a new server without making a mess of your SEO. You’ll be able to create a sandbox where you can test all your features and verify your data and architecture before going live.Besides, if you're like most businesses, you website is already on a new, updated server, right? If not, you really need an exit plan. If you published a set-it-and-forget website years ago, you are likely missing out on a lot of conversions.Ideally, you want to be able to switch servers without missing a beat, even if a hurricane takes out your hosting facility or you suddenly hit a bandwidth wall. It’s always a good idea to have a plan B. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Here’s How to Kick Your Web Host to the Curb and Never Miss a Beat"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Here’s How to Kick Your Web Host to the Curb and Never Miss a Beat"
    },
    {
      "level": "H2",
      "text": "How to avoid cloud lock-in"
    },
    {
      "level": "H2",
      "text": "Crafting an exit strategy"
    },
    {
      "level": "H3",
      "text": "Step #1: Always have up-to-date backups"
    },
    {
      "level": "H3",
      "text": "Step #2: Research migration tools"
    },
    {
      "level": "H3",
      "text": "Step #3: Pick a new destination"
    },
    {
      "level": "H3",
      "text": "Step #4: Get your SEO in order"
    },
    {
      "level": "H3",
      "text": "Step #5: Evaluate your features"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sherry Gray\n          \n            Sherry Gray"
}