{
  "url": "https://moz.com/blog/heres-how-personalized-emails-helped-turn-our-brand-around",
  "slug": "heres-how-personalized-emails-helped-turn-our-brand-around",
  "title": "Here’s How Personalized Emails Helped Turn Our Brand Around - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If you're looking to build a lasting connection with your customers, becoming a personal, human brand is a great place to start.",
  "content": "Here’s How Personalized Emails Helped Turn Our Brand Around Content Marketing | Email Marketing | Branding By: Nathan Kontny April 19, 2016 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Nathan Kontny April 19, 2016 Here’s How Personalized Emails Helped Turn Our Brand Around Content Marketing | Email Marketing | Branding This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. We run a Software as a Service business called Highrise that recently spun-off from Basecamp. As soon as we started looking at our users and some of the things they did, I noticed folks canceling their Highrise account a day after creating it. They didn't even bother to create any data. Just in, \"Nah,\" and out.We had to find a way to fix this.Luckily, by using a technique uncovered via our onboarding emails, we were able to remedy the problem. We did it using insight from a secret tool in our arsenal: Moz's Followerwonk.It has helped us go from customers replies that read \"I heard your company was shutting down\" to \"Kudos to you my friend for pioneering the new wave of transparent marketing, really what a great job.\"But first, let me provide some background.People connect best with people, not faceless companiesOn October 14, 1987, Jessica McClure, better known as \"Baby Jessica,\" fell 22 feet down an eight-inch diameter well when she was just 18 months old. The news of the fall and recovery efforts that followed captivated the United States. Fifty-eight hours later, she was rescued, but not before more than $700,000 was raised to support Baby Jessica's rehabilitation efforts, including multiple surgeries.That number, $700,000, seems unusually large, doesn't it?Especially when you think of how many babies die each year in the United States: 23,000 in 2014. Around the world, 2.9 million babies die in their first month. And we spend very little to help them.George Lowenstein, a professor of Economics and Psychology at Carnegie Mellon University, wanted to find out what causes such a difference in generosity for a case like Baby Jessica vs. all the other deserving children. Lowenstein is one of the early founders of the nascent field behavioral economics. You'll find his research in best-selling books like Made to Stick and Black Swan. He figured if we knew why a Baby Jessica could command all our attention, then maybe we could influence other important things that need our attention.His research team first paid a group of random participants $5 each, then surprised them with a follow-up charity request. They were asked to donate a portion (or all) of that $5 back to the charity, Save the Children.The study first tested two different campaign letters. The first group's letter mentioned all sorts of horrible and vital statistics about problems affecting kids in Africa: Food shortages in Malawi are affecting more than three million children. In Zambia, severe rainfall deficits have resulted in a 42% drop in maize production from 2000. As a result, an estimated three million Zambians face hunger. Four million Angolans — one-third of the population — have been forced to flee their homes. More than 11 million people in Ethiopia need immediate food assistance. The second letter was about one individual named Rokia: Any money that you donate will go to Rokia, a 7-year-old girl from Mali, Africa. Rokia is desperately poor, and faces a threat of severe hunger or even starvation. Her life will be changed for the better as a result of your financial gift. With your support, and the support of other caring sponsors, Save the Children will work with Rokia’s family and other members of the community to help feed her, educate here, and provide her with basic medical care and hygiene education as well.Rokia's letter raised twice as much money.But the study had more surprises. When people were given both letters, they gave 40% less than when the letter about Rokia was given alone.It's as if the statistics were causing people to become less generous.So they generated another test with two new groups.The gave the first new group a series of math questions to figure out and asked the second group, \"When you hear the word ‘baby’ what do you feel?\" The researchers were \"priming\" each group to either be analytical or feeling.Then they sent everyone in both groups Rokia's letter.Again, the results were similar to the first test: The \"feelers\" gave almost twice as much money as the people in the analytical group.This study, with 32,000 citations, supports the thinking that folks connect with others on a human and empathetic level vs. as a statistic or a variable in an analytical calculation.If I look at the mass, I will never act. If I look at the one, I will. — Mother TheresaThe value of being a 'human' brandA few years ago, Basecamp announced they wanted to focus on their core business and either sell off Highrise or spin it off. Unfortunately, the news created rumors that Highrise was shutting down. Our competitors did nothing to quell these rumors, which fueled an exodus of customers.Even folks who signed up would email us that they wanted to check out Highrise but still canceled because they heard the company was shutting down.We needed to do something to break through all this negative momentum. We needed to do something that would help us stand out so folks would notice what was really going on, that Highrise had now spun-off to get the resources it needed and was in really great hands.Well, along this time I used Moz's Followerwonk to see who my Twitter followers were, as I was curious about them.I didn't see anything out of the ordinary in the results, which included the descriptive job-related words \"software,\" \"web,\" \"developer,\" etc. But then I saw \"husband\" and \"father.\" That was interesting.It dawned on me that a big part of my life was shared by all these other folks who follow me on Twitter. But I rarely talk about it. I never connect with customers or anyone on the internet about being a parent.So I started changing how I communicate.For example, the Highrise homepage has a letter about what I learned working for my dad at a golf course pro shop for years.In the emails I sent out to everyone about our latest features, I would typically share a little something that was going on at home.In the onboarding emails I send to new users, I have a template (I use Highrise templates and Broadcast) that's the same for everyone about where to find help watch some videos, but I send out a new blast each day.Before it goes out, I take the time to craft a new section at the bottom of the email about my day, my family, the weather — whatever is important to me in that moment.The reaction has been awesome.A couple recent newsletters didn't have anything about my family, and folks started to notice!@natekontny have the family pictures been omitted from the @highrise update emails intentionally? just noticed love seeing them, wd love to have you on my fatherhood podcast if you'd be willing https://t.co/EHMHvx6sGg— Mike Sudyk (@sudyk) And here's a slightly condensed version of a reply I recently received from got from a customer I had emailed: Nathan I got to say what an incredible email that was. To be honest under normal circumstances I would have just deleted the email after a quick parse through... but MAN! I mean that is the best piece of personal marketing I have ever seen. I really got to say it just kind of connected me to what you were saying. You opened up about your weekend, your 2 year old's love of your trip to the aquarium, and the weather. I mean, like wow... Cudos to you my friend for pioneering the new wave of transparent marketing, really what a great job. Thanks for reaching out my friend and hope to talk soon! Ps. Weather was crazy up here on the weekend! We got 2 feet of snow dumped in one night, after just having our spring melt get started. Also aquariums are great! My wife and I had one of our first date's ever at [an aquarium]. Definitely recommend if you're ever in the area, your 2 year old would love it! What's interesting about this user is he's a trial customer, and he's told me he's actually leaning on remaining with his current CRM until we can support some specific needs he has for his cell phone. But still, he took the time to write in, inquire about some needs he has and tell me about his first date with his wife? He even sent me photos. Not only that, but he replied later with: \"I'm going to make sure to give Highrise a chance anyways over the next couple weeks to see how it pans out.\"A user that was about to give up on us thought twice because of the email I sent him. And now I get emails like this all the time.What has all of this done for our business? We've done a number of things to give our business the medicine it needed including a ton of rapid continuous improvement of the product, but a big win for us has been getting people's attention in their inbox with personal, human messages.Not only is it now rare to get an email from someone thinking our business is shutting down, but Highrise is now growing a ton again.Personal connectedness reaches beyond products and servicesAs one of the 2.9 billion people with access to the Internet, you've probably received or have sent an onboarding email. We send these out all the time to try and redirect people's attention back to our apps after they get their first look around.An onboarding email is meant to be a reminder — \"Hey, you signed up for this thing. Here is how to go back to where you started.\"Many smart companies have taken onboarding emails up another notch by using them to help their users become badasses at the things they want to do.But still, most companies end up sending out glorified press releases to communicate with their customers. Their emails sound like something created by a robot created or a group of faceless executives who wanted to make sure all the stats about their software were mentioned.For us at Highrise, we simply let people know we're humans on the other side the emails we send. It's working really well for us.What about your brand? Have you tried sharing personalized messages in your emails? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Here’s How Personalized Emails Helped Turn Our Brand Around"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Here’s How Personalized Emails Helped Turn Our Brand Around"
    },
    {
      "level": "H2",
      "text": "People connect best with people, not faceless companies"
    },
    {
      "level": "H2",
      "text": "The value of being a 'human' brand"
    },
    {
      "level": "H2",
      "text": "Personal connectedness reaches beyond products and services"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Nathan Kontny\n          \n            Nathan Kontny\n          \n            Nathan Kontny"
}