{
  "url": "https://moz.com/blog/heres-how-im-using-moz-content-for-mining-local-link-opportunities",
  "slug": "heres-how-im-using-moz-content-for-mining-local-link-opportunities",
  "title": "Here's How I'm Using Moz Content for Mining Local Link Opportunities - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Searching for new workflows to help you build those local links? Take a look at how one SEO is using Moz Content to uncover content and linking opportunities.",
  "content": "Here's How I'm Using Moz Content for Mining Local Link Opportunities Content Marketing | Local SEO | Link Building By: David Farkas May 25, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: David Farkas May 25, 2016 Here's How I'm Using Moz Content for Mining Local Link Opportunities Content Marketing | Local SEO | Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Moz Content will be retired on November 21, 2016. After much deliberation, we arrived at the difficult decision to shift away from content marketing software back to our core of SEO. For more information, head here. Creating content for local link building can be intimidating. Sure, you know your business. You know your area, but do you know what locals want to read about? You can always guess, and you might strike gold. My guess is you don’t have the time, resources, or budget for guesswork. I don’t either, which is why I like to go in educated. Enter Moz Content. Even if you don’t have a Moz account, Moz Content allows you to audit any website and find its most popular content. You can figure out which pages and posts have the most shares, the most links, and the sort of reach each page might have. You can go much more in-depth with the paid version of the tool, and it’s absolutely worth the money. But this post is about using the free version to remove the intimidation factor from local-based content, so we might as well start slowly. By the end, you should have a good idea how to create local content that resonates with your audience and attracts links. Local links To my mind, the best links come from relevant websites, but there are (at least) two types of relevance: Industry-based Local So, for this article, let’s say you own an auto repair shop in New Haven, Conn., and you want to build links. You’re just starting, so maybe you don’t have the time or the budget to build a fantastic piece of content about auto repair, the kind that draws links from gearhead hobbyists, dealership blogs, and parts manufacturers. Local links should be your priority. Local links can be easier to be build and there’s not as much of a barrier to entry. But you still must create a useful, engaging piece of content that people want to read. You don’t have to guess, though. You can use the free version of the tool to come up with great ideas for local content, and you’ll have numbers to back it up. For this hypothetical auto shop in New Haven, I didn’t analyze a single hypothetical competitor. Instead, I analyzed sites focused on New Haven. I wanted to analyze three things: An official city website or a reputable tourism website to see what the big dogs are doing right; A popular local site or blog to see how small websites are appealing to locals; Content from a big, national brand that writes area-specific content about multiple cities to see how national brands are trying to get links and shares from regional-based content. Here are the three sites I analyzed and the content ideas they gave me: Site #1: VisitNewHaven.com The first site I analyzed was VisitNewHaven.com. It’s full of tourist information, meaning it probably has a good handle on why people enjoy New Haven, and it knows what they like about it. Heck, many New Haven residents probably use it, too. It’s full of information about local events, businesses, and websites. I thought it was a good start. So, I put the URL into Moz Content: When I scrolled down to view \"popular pages,\" I saw that, other than the home page, the annual events page had the most links. The dining and nightlife pages did OK, too, so we’ll file that away for later use. We’re after links, and the annual events page has the most links, so it’s a good place to start. I clicked on the analysis for that page: Reach isn’t great, and it doesn’t have many links, but it beats anything else on the site, so I decided it was worth a look. People like this page enough to link to a tourism website, so they’re doing something right. Here’s what the annual events page on VisitNewHaven.com looks like: There’s little text here, but it does the job, providing relevant, up-to-date info about annual events with appropriate links. Since there’s little here, you could make something better. If it’s good enough, you could probably even get your first link from VisitNewHaven.com, especially if you credit them for inspiring you. Content Idea: Build a guide to local events from your point of view. You could build one for a complete year or make several and target them to winter, spring, summer, and fall tourists. To one-up this piece of content, you’d have to write a paragraph about each event, and give local insight. You’d already have an outreach list, too. You could email the organizers of each event you mentioned and see if they want to link to your guide. You know people are interested in annual events, and by one-upping this page, you could generate at least five relevant, local links. When you’re just starting, five links are an excellent bounty. Site #2: ConnecticutLifestyles.com Next, I did an audit for ConnecticutLifestyles.com. It has good content, and it does well in Google search results. It’s not backed by a city government or tourism board, but it’s about as good as you'll find for a local website that’s not a business blog. I plugged in the URL: Next, I scrolled down to look at popular pages: I found that recipes dominated their other blog posts. They had the most shares and links, even when there weren’t many shares or links. Clearly, Connecticut audiences are interested in authentic food. Content Idea: Offer some recipes. Even if you own an auto shop, you still eat food. You probably have family recipes, or you can get them from friends, family, and employees. Content that focuses on local recipes can work for almost any local business. The recipes must come from you or your employees. So, you could publish a few recipes, or you can make a guide to spicy Connecticut food or Connecticut desserts and link to recipes from other authentic Connecticut sites. You could even try to replicate the food from your favorite restaurants. You might even get them in on the action. As long as you focus on authentic recipes, coming from authentic Connecticut residents, you have a good shot at building links. People care about recipes. We have the proof. They outperform all other content on ConnecticutLifestyles.com. Site #3: Movoto Next, I analyzed Movoto’s New Haven section. Movoto is a real estate website, but they also pump out local-based content that strokes the egos of local residents and earns plenty of links and shares. You’ve probably seen your friends share some of their content on Facebook. Movoto puts a lot of money into earning shares and links from locals, so I thought they were a good site to analyze. I plunked the URL into Moz Content: Immediately, I looked at this section of Movoto’s most popular pages: And we’re not seeing many links. That’s a bummer. But we are seeing plenty of shares on one post. You might have guessed it, based on the previous two websites. An article about restaurants is in the lead. Here’s what it looks like: These Movoto articles might not be getting the links they do in other cities, but knowing that a list of 15 restaurants blows everything else away might give you some ideas. Content Idea: This piece of content features a quality photo for each restaurant. They could be stock photos, but they look authentic. It also gives each restaurant’s Yelp score, with a paragraph about the food. And that’s it. Chances are, you eat food every day. You might not be a food critic, but you’re qualified to talk about why you like your favorite restaurants. All you’d have to do is take photos, write something more in-depth, and keep it authentic. Hear me out. Restaurants write about their own food all the time, and it often comes off as salesy. As a non-food-related, local business, you’re writing about the food you like. You’re not trying to sell it. That puts you at an advantage, because you’re inherently trustworthy. Plus, you could likely get a link from most restaurants you write about. This wouldn’t have to be a huge piece of content. It would just have to be better than an article that’s 15 paragraphs and 15 photos. That’s doable. Putting it all together So, what’s the real reason I analyzed three websites for content ideas? I wanted to see if I could combine three ideas into something unique. You could find success with a single idea from any of these websites I audited, but I wanted to dig a little deeper. So, in the VisitNewHaven audit, dining and nightlife were popular, although not as popular as annual events. With ConnecticutLifestyle and Movoto, recipes and restaurants blew away all the competition. You could combine them all into: A piece that shows New Haven’s favorite foods based on ConnecticutLifestyle’s recipes; The best restaurants to find those foods in New Haven; The best annual events for foodies in New Haven. Basically, you’d make a post that highlights annual food-based events. Within the post, you’d highlight the participating restaurants and food vendors and then talk about the New Haven favorites they serve. Heck, you could even link to recipes for those foods. That post seems like a win in my book. You’d have a big list of restaurants, food vendors, event sites, tourism sites, and lifestyle blogs to contact for links as well. Creating content for local link building need not be overwhelming or scary. With just an hour or two of extra research, you can find out what people in your area are reading about. Then, no matter your industry, you can come up with an idea for local content that kills the competition. I always advocate starting small. I recently wrote a post about building links at the neighborhood level and working your way up. You can use Moz Content for local link building at any level. If you start small, armed with the knowledge of what a local audience wants, you’ll be creating bigger and better content in no time. You have the tools. They’re free and at your disposal. You simply have to get started. What about you? Have you tried Moz Content yet? Do you have other tools/workflows you'd recommend? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Here's How I'm Using Moz Content for Mining Local Link Opportunities"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Here's How I'm Using Moz Content for Mining Local Link Opportunities"
    },
    {
      "level": "H2",
      "text": "Local links"
    },
    {
      "level": "H2",
      "text": "Site #1: VisitNewHaven.com"
    },
    {
      "level": "H2",
      "text": "Site #2: ConnecticutLifestyles.com"
    },
    {
      "level": "H2",
      "text": "Site #3: Movoto"
    },
    {
      "level": "H2",
      "text": "Putting it all together"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "David Farkas\n          \n            David Farkas"
}