{
  "url": "https://moz.com/blog/heres-how-app-store-optimization-can-work-for-your-brand",
  "slug": "heres-how-app-store-optimization-can-work-for-your-brand",
  "title": "Here’s How App Store Optimization Can Work for Your Brand - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The abundance of apps within the Apple App Store and the Google Play Store makes them both great and scary places to run a business. Despite the plethora of choices, however, a brand can find a home and thrive in the app store.\nHowever, it is the job of the app publishers and marketers to make that…",
  "content": "Here’s How App Store Optimization Can Work for Your Brand Search Engines | SEO Tools | Mobile SEO By: Bailey Mezan February 4, 2016 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Bailey Mezan February 4, 2016 Here’s How App Store Optimization Can Work for Your Brand Search Engines | SEO Tools | Mobile SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. The abundance of apps within the Apple App Store and the Google Play Store makes them both great and scary places to run a business. Despite the plethora of choices, however, a brand can find a home and thrive in the app stores. However, it is the job of the app publishers and marketers to make that mission a reality through (a) higher engagements and conversions amongst app store visitors, and (b) a viable ASO plan for long-term retention in the Apple App Store and the Google Play Store. (Eds. note: From here forward, we'll refer to the Apple App Store as \"AAS\" and the Google Play Store as \"GPS.\") The obvious benefit of app store optimization in a mobile app store listing is that it maximizes app store visibility and conversions, giving you more downloads from the users who are the most likely to engage with your app. Maybe not as obvious are some additional benefits that can have an even larger impact on your app’s overall performance: acquiring relevant, long-term users, building better data for in-app optimization, and offsetting the costs associated with paid campaigns. All come from defining and targeting a relevant user base with an optimized app store listing. Effect #1: Acquire relevant users Consider a car company that positions its minivans for anyone looking for a car. While their number of eyeballs are increasing, potential buyers without large families would probably not consider purchasing a minivan, thereby making engagement with these buyers un-impactful to their conversion rates. Instead of targeting families specifically when marketing their minivans, they are blindly targeting everyone. However, this is often how many app publishers position their apps in the app stores. Much like the minivan scenario, this mistake shows in the number of conversions both long- and short-term. Similar issues arise when positioning your mobile app for discovery before a broad or untargeted audience. Even if visibility of your app is high, the conversion rates, engagement, retention and monetization will be much lower than with appropriate positioning. The key to positioning your app before your most relevant audience can be achieved through testing, tracking and analyzing all data acquired within both the AAS and the GPS. It is important to note the need to separately measure and test for iOS and Android because the structure of their app listings have significant differences. For example, in addition to selecting the best keywords, it is important to test creative for conversion. Listings in Google Play place emphasis on the icon and the “short description” that appears only on the device. With the AAS, there is more emphasis on creative like screenshots and preview videos. Tools such as Gummicube’s Datacube software allow you to find and test your target audience, through professional keyword selection, A/B testing and content authoring. This smart way of tracking and testing will allow you to hone in on, and speak to, your most valuable customer. Sixty-five percent of app downloads are the result of a search in the app store. Therefore, it is absolutely crucial that marketers and publishers are aware of what does and doesn’t work for a particular app. There are a number of important metrics for testing and evaluating the do's and don’ts of your specific app: Global and category ranking: Your competitors matter; using apps such as Appstatics can help you stay in the know on your fellow developers' rankings within the app store. Ranking for specific keywords: Smart app marketers will set up a keyword ranking system to track the best target keywords for their target audience. Creative optimization testing: Ikonica allows you to carry out visual testing such as split icon tests, screenshot tests and live focus groups. Targeting and acquiring relevant users for your mobile app improves key performance metrics that would otherwise be stagnant or degraded due to poor targeting. Effect #2: Generate better data for app optimization If potential buyers took your minivan on a test drive and didn't buy it, you might conclude something was wrong with the minivan. Likewise, with mobile apps. If user activation is extremely low, it could be due to a poor onboarding experience or a general disconnect between user expectations and user experience. Acquiring users who are not in your target audience may be the result of an overly broad app store listing or an app title and description that isn’t targeted. As previously mentioned, this can skew the conversion data. So, while marketers may have concerns of a poor onboarding experience, the true issue is faulty target marketing. In this scenario, making a content change as simple as swapping the keywords and features in your app title can make a world of difference in an app's success. A proven format for app titles in an Apple app listing is “Name of App - Feature No. 1, Feature No. 2.” With Google Play app listings, your title is limited to 30 characters, so make good use of this space to highlight your most important feature or keyword. Again, testing these keywords through companies specializing in ASO is a great way of tracking and monitoring the success of each component of your app store listing. User onboarding is only one metric affected by acquiring users who are not a good fit for your app. Engagement, retention, and monetization are all negatively impacted by acquiring the wrong users. An example of this would be the search results in the AAS for “Facebook games:” When searching the AAS for “Facebook games,” there are results showing games that integrate with Facebook, but there also results that are not relevant to this search. The app listings are positioned for discovery in irrelevant search results instead of in sections actually searched by their target audience. Publishers and marketers who try to gain customers by positioning their app in unrelated genres will pay the ultimate price. Even if this hack works in the short term, there are long-term deficits that will hurt the lifespan of an app. The long-term effect of a publisher’s poor use of the app listing is simple: Installs impact the data across virtually all of an app’s internal metrics, making it hard to analyze and understand the in-app data being generated. Before investing in changes to user onboarding, monetization, or campaigns, make sure you are acquiring the types of users your app is built for, which starts by using the correct copy in the app store listing. Copy testing is critical to successfully running an app campaign. The main elements to consider are the territories where your app is listed. Marketers should also test copy regionally. Also, since the AAS and the GPS function differently in how they present apps within search, it is important to test separately for each platform. We will look at each element of copy within the app listing below, with specific commentary illustrating where Apple and Google differ: App title: The title tag is the gateway to your app in both AAS and GPS. Make sure it is concise and descriptive, and that it explains the function of the app. App description: The App description is the final push that will lead to the conversions and it is your leverage for best identifying the purpose of your place in AAS and GPS. GPS uses a special “short description” that appears only on Android devices; it is this short description that appears in app search results. This is not only important from a keyword optimization standpoint (Google crawls your short description), but also to get users to click through from the search results to your app page. Once they get to your app page, your long description must clearly and effectively explain what the app is, as well as what it does in order to convince users to download. Apple does not leverage a short description in search listings. However, the long description is important for similar reasons.Creative call-to-action: Testing the CTA in your screenshots is also very important. Carrying through the key features and benefits, especially if you can highlight important keywords, can have a huge impact on your conversion rate. Google Play offers its own A/B testing solution that can implement tests live in the store; but the downfall to this approach is that when you run a negative live test, it can impact key metrics like click-through rates. This, in turn, can most definitely impact your app search rankings. To maximize the upside and limit the downside to this type of testing, consider leveraging third-party tools or black box focus group style tests before going live with changes in the store. For example, in the event of a campaign, tools such as SparkPage will allow you to continuously A/B test copy and message sequences, and and use push and email to convert active users, leading to conversion optimization. This app is especially useful for user onboarding during a campaign, as it will allow you to directly test subject lines, copy, images, and CTAs. Reference: SparkPage Keep in mind that the work you do in AAS and GPS make up one facet of the mission for conversion optimization. Between 16% - 21% of apps are discovered through browsing on the internet and other websites. This means that when the customer takes the steps to actually find your app, it should not be a treasure hunt, but a simple copy and pasting of words. To acquire and maintain the right customer, without making them work too hard, techniques such as message matching will allow you to micro-test within the app store. For app marketers, it is critical that all copy is correlated between in-store copy and titles, and out-of-store copy such as on landing pages, so that customers can be sure they are in the right place. Effect #3: Offset the cost associated with paid campaigns Mobile app install ads are run $2 or more; engaged users cost multiples of that. Mobile app cost per install (CPI) campaigns have been the go-to strategy for successful mobile apps like Clash of Clans and Candy Crush, and implementing a sound ASO strategy can complement your paid user acquisition results. The math is simple and compelling: If the lifetime value (LTV) of acquired users is more than your average CPI, you win. Tapping into organic search traffic is hugely valuable. Acquiring one user at $2 and one user through organic search results in a cost per user of $1, and will essentially double the number of installs derived from your budget for paid user acquisition. By acquiring more users organically, you drive down the overall cost of acquiring a user. Organic acquisition can serve to subsidize paid user acquisition, enabling profitable campaigns in more expensive channels (more downloads) or increasing the spread between LTV and CPI. Building a successful referral marketing campaign for a mobile app requires planning, creativity, and expansive knowledge of the past successes and failures in this sphere. App marketers and developers must make all the right moves in order to achieve their campaign’s goals. The AppVirality dashboard helps marketers and developers to create, manage, and optimize their referral programs, and to do so directly from their web dashboard. Best practices for implementing referral programs include: Using push notifications: Push notifications act as an ongoing referral program for follow-ups post-campaign. Inviting your friends: Uber is an excellent example of a company who uses their customers' networks as a brilliant referral program. By using push notifications to send discounts to customers for sharing, they are able to engage, promote, and expand simultaneously. Using newsletters and email as social media touch points: While your app isn’t online, the web can still act as direct line to reaching your customers, during a campaign and beyond. Incentivizing creatively: You don’t need to use cash rewards. For example, Dropbox used extra space as incentive for customer’s referring friends rather than money Reference: AppVirality The overall impact of referral campaigns can be huge during and after the program is implemented. However, the success you achieve is dependent upon how you utilize your existing resources and creatively formulate new ones. A key aspect to successful campaigning is implementing seamless integration. This will ultimately define your ability to retain customers. Seamless integration is the process by which a new feature of an application is added without causing complications in your customer’s ability to use the system. Conclusion AAS and GPS will always be highly competitive, complex spaces. However, there are positives that can help guide us through the many nuances of acquiring and retaining users within the app stores: Continuously test your target audience through professional keyword selecting, A/B testing, and content authoring.With the combination of an increase in installs from organic search traffic and an increase in users acquired via a more cost effective CPI campaign, you can vault an app into the top of the app charts, driving even more visibility, organic traffic, and organically acquired users to your app.Optimizing an app store listing as part of an ongoing app store optimization strategy has a bigger effect on a mobile app than simply more downloads.With ASO, you can drive more valuable users to your app, providing better insight and data for app optimization, and this helps to offset the costs of your paid campaigns leading to even higher rankings across the app stores. What's been your experience with ASO? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Here’s How App Store Optimization Can Work for Your Brand"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Here’s How App Store Optimization Can Work for Your Brand"
    },
    {
      "level": "H2",
      "text": "Effect #1: Acquire relevant users"
    },
    {
      "level": "H2",
      "text": "Effect #2: Generate better data for app optimization"
    },
    {
      "level": "H2",
      "text": "Effect #3: Offset the cost associated with paid campaigns"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Bailey Mezan\n          \n            Bailey Mezan"
}