{
  "url": "https://moz.com/blog/heres-how-we-found-success-by-using-a-pr-tactic-for-agency-outreach",
  "slug": "heres-how-we-found-success-by-using-a-pr-tactic-for-agency-outreach",
  "title": "Here’s How We Found Success By Using A PR Tactic For Agency Outreach - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Ready to take outreach beyond email and phone calls?",
  "content": "Here’s How We Found Success By Using A PR Tactic For Agency Outreach Public Relations By: Liam Curley December 17, 2015 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Liam Curley December 17, 2015 Here’s How We Found Success By Using A PR Tactic For Agency Outreach Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. This article highlights a direct marketing campaign we launched at Supremo. Yes, old-fashioned direct marketing may well be the devil, but I wanted to put this forward to the community because I think the campaign can be recycled for PR and outreach campaigns, too.Before I get into the details of what we did, it’s probably good to start with who we are and why we launched this campaign. Supremo is made up three directors, each of whom has a different strong suit: marketing, design and development. While working as freelancers, often on the same projects, we decided that as a team we could create something greater than the sum of our parts. An agency was born.We had a handful of clients that we could pull over from our previous work, but we needed more. While the long-term plan was to focus on inbound marketing to grow our business, a medium to long-term plan wasn’t going to help us in the short term to get more business. Two of us had domains with fairly decent DA, and we’d redirected them to our new site, but it was going to take time to see this all filter through to positive search rankings and organic traffic.We needed work.We settled on a direct marketing campaign that would be highly personalized and focused.The kind of work we eventually want to do is big content pieces, focusing on things like data visualizations and interactive infographics. The challenge: It’s hard to get that kind of work unless you can present a solid track record of success, which, being a startup, we don't have.For this campaign, our aim was to try and tap into PR agencies that offered content marketing and outreach services, but didn’t have any designers or developers working in-house. We identified 30 PR agencies that met this criteria in Manchester, where we’re based. We wanted to sell white label web design and development services to PR agencies, but these agencies had never heard of us. Also bear in mind that our budget was limited to $600. So, how did we grab their attention? Keep reading to find out. The Willy Wonka campaign We wanted to send our targets something that would encourage them to take action and engage with us on our platform. We all love the Charlie and the Chocolate Factory book and film, so we decided to use the \"golden ticket\" theme to entice people to visit our website. First, we identified 30 fancy-looking chocolate bars that each had a sleeve where we could insert a golden ticket. We found the chocolate at Melt. Next, we needed to create a golden ticket, or better yet, find someone online to make customized golden tickets for us. We found that person on Etsy. Stacy produces Willy Wonka tickets for parties. We got in touch with her to ask if she’d make 30 for us and customize each one. She agreed. We created copy for the ticket based on the original text. Each ticket was addressed to the individual we were targeting at the agency and contained a unique code. Here’s the copy we used on one ticket:“[You] are the lucky finder of this Golden Ticket from Team Supremo. Present this ticket at the website gates of Supremo – Head to www.supremo.tv/wonka-golden-ticket and enter this code [...]. In your wildest dreams, you could not imagine the marvelous surprises that await you.”OK, we may have over-sold the proposition a little, but it’s a bit mysterious and creates an element of intrigue. How could you resist heading to the website to see what was there and, hopefully, find out who sent this chocolate bar?The next element of the campaign was the web page. We wanted to create a personalized page for each target so that they landed they landed on the initial page where they entered their code. They would then be greeted by name and presented with a video telling them about who we are and how they would benefit from working with us.We didn’t end up creating the personalized video for each target, as we weighed the benefits of doing that against the added production time and judged that the minimum viable product was to get one video made for all targets. Once the target entered the page, they could watch the pitch video from us, read our selling points, then fill in their details if they wanted us to contact them by phone to organize a meeting.Because each user had a unique code, we set up an email alert for when that code was entered. After a short period of time, we emailed them to ask about the chocolate if if we hadn’t heard from them yet.You can check the page out for yourself here www.supremo.tv/wonka-golden-ticket and enter the code \"mozzer.\" The results Within two weeks of launching our campaign, 14 people had entered the codes, and every one of them had played the pitch video. That's a response rate of 47 percent, which is significantly better than any direct campaign we've ever been involved with. And we now have have meetings lined up with three of our targets.Fourteen PR agency directors visited our website and watched a video of us pitching our services directly to them. We didn’t force them to visit nor click the play button. Rather than pushing our business on them as traditional direct marketing does, I believe we earned their attention.The thought and effort we put into the campaign was clear. We were obviously a small agency. These chocolate bars were nice, but we’d bought them online and they weren’t branded up as Supremo. We couldn’t have possibly sent this to hundreds of targets. The people we sent this to were thoughtfully selected and our approach made that obvious. I think that’s the reason the campaign was a success.And what about the budget? Thank you for asking. Well, here’s the breakdown of costs: Chocolate - $265 Packaging - $36 Golden ticket - $230 Postage – $53That adds up to a total cost of $584. Bringing the campaign to outreach The reason I wanted to share this campaign with the Moz community is that I think it could be a great one for bloggers for use for outreach. Now, there may be those of you who say, “This is nothing new. The Willy Wonka campaign is merely a PR campaign, and outreach is just a term used by SEOs for PR”. Well yeah, that may be the case, but there are two points I want to make: The campaign was effective without being expensive. Any small business could find $600 to run this campaign using a big piece of content with a lot of potential. Outreach is simply another worked for PR, but outreach related to digital marketing often amounts to emailing a few people. A campaign like this one goes much further to build the type of connections that cannot be earned via email.This post represents my call for us to invest as much creativity and energy into our PR as we do in our content. I can honestly say the outreach for our Willy Wonka campaign was by far more fun than spending days scheduling personalized emails to bloggers. I hope you'll try this technique (or a similar one) for your brand. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Here’s How We Found Success By Using A PR Tactic For Agency Outreach"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Here’s How We Found Success By Using A PR Tactic For Agency Outreach"
    },
    {
      "level": "H2",
      "text": "The Willy Wonka campaign"
    },
    {
      "level": "H2",
      "text": "The results"
    },
    {
      "level": "H2",
      "text": "Bringing the campaign to outreach"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Liam Curley\n          \n            Liam Curley\n          \n            Liam Curley"
}