{
  "url": "https://moz.com/blog/hey-google-im-over-here-a-301-experiment",
  "slug": "hey-google-im-over-here-a-301-experiment",
  "title": "Hey Google, I'm Over Here! (a 301 Experiment) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Recently, I made the difficult decision to change the domain name of my blog and consulting website. It had to be done; the old name just didn't make sense anymore, no one could spell it, and it was terrible for SEO. Of course, I knew all of the rules of successful 301 redirection, in theory, but…",
  "content": "Hey Google, I'm Over Here! (a 301 Experiment) Search Engines By: Dr. Peter J. Meyers October 30, 2007 Table of Contents Copied! By: Dr. Peter J. Meyers October 30, 2007 Hey Google, I'm Over Here! (a 301 Experiment) Search Engines Recently, I made the difficult decision to change the domain name of my blog and consulting website. It had to be done; the old name just didn't make sense anymore. No one could spell it, and it was terrible for SEO. Of course, I knew all of the rules of successful 301 redirection in theory, but when it came to putting theory into practice, I found myself dreading pulling the switch. There have been plenty of good articles on SEOmoz and elsewhere about the technical aspects of 301 redirection, but I felt a lot of uncertainty about the timeline of re-establishing my presence on Google (inbound links, PR, etc.). So, I decided to track my progress daily, mostly to calm my own paranoia, but also as a bit of a case study in what a 301 redirection process looks like. I finally finished collecting data when my PageRank was established over the weekend, and this article is a recap of my experience. Technical Details The site itself is relatively small (my business blog, primarily), but has steady traffic and had established PR and a healthy number of inbound links for its size. The site is powered by PHP/MySQL, and I used Apache rewrites for redirection. The new domain was registered less than two months before the transfer and had no history (according to the Internet Archive), so it was \"new\" in every sense of the word. The transfer itself happened on August 22, 2007. I should also add that I did 3 things immediately upon relaunch: (1) I established a new sitemap and profile in Webmaster Tools. (2) I reached out to everyone in my community who linked to me and announced the change, requesting that they update their links to the new domain. (3) I updated all of my RSS/Feedburner links to the new domain. Results: Indexed Pages So, let's talk data: the figure above shows Google's daily count of the indexed pages from the transfer until the end of data collection. Google began spidering pages on the site within less than a week of the transfer, and the indexed page count jumped to 111 (exceeding the original count of 91) on September 4th, just 13 days after the transfer. Of course, since the site is primarily a blog, the total number of pages have increased consistently over time. Results: Inbound Links Although the graph over the full course of the experiment looks a bit different than the last one, inbound links also surged 13 days after transfer, jumping up to 739. Unlike indexed pages, there was no gradual increase in the preceding two weeks; the count simply registered all at once. Just a note: In the interest of keeping the graphs consistent, I left in the numbers after the count was restored, but due to an anomaly that temporarily bumped my inbound link count over 10,000, had to cut the graph off artificially. Results: PageRank Finally, the one troublesome piece of data that held up this entire experiment: on October 27th, as part of Google's recent shuffle, the new domain finally registered a PageRank, jumping back to the original PR of 5. This was an overnight jump, and is consistent with Google's past practice of updating PRs on a roughly quarterly basis (ignoring the recent update drought). Does PageRank Matter? The PR graph raises an obvious question: how did my site fare with two months of being treated as a non-entity by Google? The previous data gives the first part of the answer: even without verified PageRank, Google obviously recognized and indexed my site. More importantly, the site started to appear in search results almost immediately upon being indexed. In the first two weeks, a search for the site's name pulled it up within the top 10. In addition, I conducted a bit of an experiment within the experiment. During the month of October, I coined two phrases on my blog: \"Google threshold\" and \"midstream usability.\" Both appeared near the top of Google search results within 1-2 days of the entries initially being posted, a clear sign that Google was treating the site kindly. Sometimes, It's Good to be Scared In this Halloween season, it's good to remember that a little fear isn't always a bad thing. You should never go into something as important as a domain change with too much confidence, but I hope that this case study illustrates that, properly planned, a full 301 redirection doesn't have to be too scary. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Hey Google, I'm Over Here! (a 301 Experiment)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Hey Google, I'm Over Here! (a 301 Experiment)"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}