{
  "url": "https://moz.com/blog/hidden-data-in-googles-keyword-tool-5051",
  "slug": "hidden-data-in-googles-keyword-tool-5051",
  "title": "Hidden Data in Google's Keyword Tool - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "After reading about how posting in the main blog would be a bit flaccid this week, I figured I would give YOUmoz blog a test run with something that I noticed a few months back. This might be of interest to you and get the blood rushing to your head or it mi...",
  "content": "Hidden Data in Google's Keyword Tool Keyword Research By: Chris Goulet September 2, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Chris Goulet September 2, 2008 Hidden Data in Google's Keyword Tool Keyword Research This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. After reading about how posting in the main blog would be a bit flaccid, I figured I would give the YOUmoz blog a test run with something that I noticed a few months back. This might be of interest to you and get the blood rushing to your head or it might not, but I thought it was worth a post here to see if any of you had noticed it. Most of us use the Google Keyword Tool multiple times a day to help with the keyword research and discovery process. If you are a working SEO stiff like me, then 99% of the time you will just export the data as a CSV and go on to a spreadsheet to tweak and sort the data into hard numbers you can use. Well, a few weeks back I copied a single keyword from the results in the tool and noticed that the 'ctrl+c' appeared to be capturing numbers from the Google's 'Advertiser Competition' bar column as well. When you paste that keyword into your spreadsheet it is accompanied with '1-3' and what looks to be the CPC of that keyword. Copy of Google's Results Pasted Spreadsheet Results I haven't really tried to figure out what benefit or what advantage that could be gained from knowing what this number is (with the exception of those who run an AdWords campaign and are actively trying to keep it up), so I was hoping I could stimulate some discussion here and have this post swollen with your comments. If I wasted you time, sue me, but just don't talk to Sarah first, 'cause if you do you'll probably win. Cheers! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Hidden Data in Google's Keyword Tool"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Hidden Data in Google's Keyword Tool"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Chris Goulet\n          \n            Chris Goulet\n          \n            Chris Goulet"
}