{
  "url": "https://moz.com/blog/higher-organic-click-through-conversion-rates-rankings",
  "slug": "higher-organic-click-through-conversion-rates-rankings",
  "title": "Hacking Your Way to 5x Higher Organic Click-Through Rates (and Better Conversion Rates & Rankings, too) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Click-through rate is incredibly valuable, but often overlooked when it comes to optimization. Larry Kim is here to let you in on his secret formula to achieving optimum CTR on content that didn't do so well, with boosted conversions and rankings on the side.",
  "content": "Hacking Your Way to 5x Higher Organic Click-Through Rates (and Better Conversion Rates & Rankings, too) Keyword Research | Advanced SEO | Conversion Rate Optimization (CRO) By: Larry Kim May 3, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Larry Kim May 3, 2016 Hacking Your Way to 5x Higher Organic Click-Through Rates (and Better Conversion Rates & Rankings, too) Keyword Research | Advanced SEO | Conversion Rate Optimization (CRO) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. [Estimated read time: 13 minutes] Last month we discussed why organic CTR is kind of a big deal. I believe that click-through rate is tremendously valuable and that achieving above-average CTRs can lead to better rankings, particularly on long tail queries. But even if you don't believe click-through rate can impact rankings, optimizing for a higher CTR still means you're optimizing toward the goal of attracting more clicks. More clicks means more traffic and higher conversion rates — because if you can make people more worked up about your product/solution, that carries through to conversions, leads, and sales. All great, important things! So what the heck — why isn't every SEO obsessed with raising organic click-through rates like myself and many other PPC marketers are? Why isn't CTR optimization a bigger deal in organic search today?For starters, it's ridiculously hard to tell what your organic CTR is for a keyword. Thanks, Google. In the Search Analytics section of the Search Console, Google only gives you a sampling of 1,000 queries. Because you only have access to a sample of keywords, you can't arbitrarily find out a CTR for any individual keywords. It's much easier to find our your CTR in paid search with AdWords. You can type in any word and find out what your CTR is for that word. Another challenge preventing CTR from being a bigger deal today is Google Analytics, which hasn't provided keywords to us for years. You can figure out the number of impressions and clicks for your top 1,000 pages, but the limited query data (1 percent of total) is a killer. It might be easy to see your CTR data, but it's hard to know whether what you can see is good or not. Also, many people just don't realize how much leverage there is in increasing CTR. Donkey headlines (bottom 10%) tend to do around 3x worse than average, whereas unicorn headlines (top 10%) tend to do around 2x better than average. By converting donkeys to unicorns, you might not realize that by boosting your CTR could increase clicks to your site by 5x. And one final important point (and yet another reason to kill your donkeys!): low CTRs typically also lead to low conversion rates — this is true for both organic and paid search. You can easily test this out yourself by analyzing your own website data. Conversion Rate vs. CTR for one of my customers.Introducing Larry's High CTR Pyramid SchemeLet's look at a graph that shows the click-through rate by rank for my 1,000 keywords obtained through Google Search Console: The blue curve shows the CTRs on average for any given spot for all keywords. But that's an average. An average includes all the top performers (unicorns) as well as the worst performers (donkeys). There is considerable variance here. The top 10 percent (the unicorns) have CTRs that are more than double the average (~55 percent vs. ~27 percent in first position). The bottom 10 percent (the donkeys) have organic CTRs that are three times lower than average (~27 percent vs. ~8 percent in first position). This is such a great opportunity. But it's hard to realize just how great your CTR can be. You can increase clicks by as much as 5x or even 6x by identifying your crappiest keyword donkeys and making them into high CTR headline unicorns, rather than stupid \"optimized\" title tag formulas — like: Main Keyword, Long-Tail Keyword Variation 1, Long-Tail Keyword Variation 2. This is a title tag optimization formula from ancient times — we're talking B.H. (Before Hummingbird). This is no longer necessary because Google is now much better at inferring query intent. Welcome to the new world. To help you adapt, I’ve developed a repeatable SEO workflow to turn your donkeys into unicorns. Behold! It's Larry's High CTR Pyramid Scheme! Here's how it works. Detecting your donkeys This whole process starts by finding your underperforming content donkeys using another of my hacks — Larry's Donkey Detection Algorithm. Download all of your query data from the Search Console or Google Analytics. Next, graph CTR vs. Average Position for the queries you rank for organically and add a trend line, like this: The red line here is your average click through rate. You want to focus ONLY on the keywords at very bottom of your curve. You don't want to turn any of your unicorns into donkeys. You only want to turn your donkeys into unicorns! Now you can sort by secondary metrics, such as conversion rates, if that's what you care most about. Which of those donkeys have the highest conversion rates? Focus on these first because when you're able to turn that page into a traffic unicorn, it will also convert more! If you care most about engagement, then you can filter by that metric. If you can improve the CTR of this page, then you can be reasonably confident that more people will engage with your content. Your content is a diamond in the rough — or a great book with a terrible cover. Now is the time to polish your diamond and help it become exceptional. Warning: Don't go crazy reoptimizing your titleImage courtesy of FoxThis is important. You shouldn't change the title tag over and over every week because this will cause problems in your quest for a magical cure to your donkey blues. For one, Google will think your title is being dynamically populated. For another, you're just guessing, which is probably why you have this CTR issue. Also, multiple changes will make it hard to get a good reading on why the CTR changed. Is it due to the title tag change or is it something else entirely (a SERP change, a competitor change, seasonality, etc.)? If you keep changing it, you won't have enough statistically significant data to make a data-driven decision. Additionally, your ranking position could change, which would also further screw up things. Bottom line: Don't just go and change titles willy-nilly. We can make a unicorn — we have the technology! To improve your organic click-through rate, you'll need to collect some data. You can do this by creating ads on Google AdWords for no more than $50. You're going to create an ad pointing to the page you're reoptimizing using 10 different headlines. The reason you need 10 headlines is so you can discover your statistical unicorn, the headline with a CTR that stands above the rest in the top 10 percent. Think of it like a lottery where the odds of winning are 1 in 10. Your odds of winning are much greater if you buy 10 lottery tickets instead of just one, right? You can absolutely create more headlines; 10 is just the minimum. If you really want to do this well, writing 12, 13, or 14 headlines dramatically increases the odds that you'll find a unicorn. Don't half-ass your new headlines Image courtesy of FoxI can't stress this enough: You really have to try out different headlines. It can't be the same headline, just with insignificant little changes (e.g., commas in different places, different punctuation, upper case vs. lower case). Pop quiz: How many headlines do you count here? 1. How to Write a Book Fast 2. How to Write a Book FAST 3. How to Write a Book…FAST 4. How To Write A Book...Fast! 5. How to write a book, fast. Did you say 5? WRONG! No, the answer is 1. These aren't different headlines. They're just different punctuations and capitalizations. You have to REALLY change the headlines. Write your headlines using different personas. Who is the person speaking to the reader? Is it the bearer of bad news? The hero? The villain? The comedian? The feel-good friend? Also change emotional trigger in your headlines. You can use emotional drivers like amusement, surprise, happiness, hope, or excitement: Source: Plutchik's Wheel of Emotions Other emotions include anger, disgust, affirmation, and fear. All four of these can become huge winners. Vary your headlines. Get super creative! What keywords should you choose?Add the keywords that you were hoping to appear for when you created the content, along with keywords you're currently ranking for using query data from Google Analytics. Set those keywords to the broad match keyword match type. Broad match is the default keyword match type and reaches the widest audience. It makes your ad eligible to appear whenever a user’s search query includes any word in your key phrase, in any order, and any synonyms. For example, if you use broad match on \"luxury car,\" your ad might be displayed if a user types \"luxury cars,\" \"fast cars,\" \"luxury apartments,\" or even “expensive vehicles,” which doesn’t include any of the terms in your keyword. Broad match will, in a way, act like RankBrain does — testing your headlines against a diverse set of queries, including related terms. It's a perfect keyword sample set. 10 awesome tips to help you write outstanding headlinesUltimately, you want to think about three things when writing your ads: your target customer; the persona you want to use to speak to them; and what emotionally-charged words you can use to incite action. Steve Rayson of BuzzSumo recently shared some great research on the five elements of viral headlines. Here's what your headlines need to have: Emotional Hook: This could be a certain emotional word or superlative — words like: amazing, unbelievable, shocking, disgusting, or inspiring. Content Type: This tells the reader exactly what your content is — is your content images, quotes, pictures, or facts? Topic: Think of this as your keyword — it could be something evergreen like \"content marketing\" or more news-oriented like a Google algorithm update or SERP test. Format: This sets the expectation of the format your content will be in, whether it's a listicle, quiz, ebook, or something else. Promise Element: The reader benefit — tell the reader why your content will solve a problem, make them smarter or better at something, or that it provides vital information they need to know. Here are five additional tips: Choose your words wisely: Go either extremely positive (e.g., best, greatest, biggest) or negative (e.g., stop, avoid, don't) with your headline word choices. Be specific: Make it clear to the reader what your content is about. Be unique: Show some personality. Create content that nobody else is doing (or improve on what others have already done). Dare to be different from your competitors. Create a sense of urgency: What will the reader learn, lose, fail at, or miss out on it they don't click right now? Be useful: How does clicking on your content benefit the reader? So let's go back to our earlier headline example, How to Write a Book Fast. Based on this advice, what are some new headlines you could test? How about: Write Your Book Fast: X Trusted Time-Saving Tips X Surprising Tricks Nobody Told You About Writing Books Fast How to Finish Writing Your Book 5x Faster Write Fast Right Now: What Published Authors Don’t Want You to Know X Ridiculously Easy Steps to Write Your Book Faster What’s the Secret of Writing Great Books Fast? X Inspiring Tips That Will Help You Write Your Book Faster This Unusual Book Writing Technique Will Make You Write Faster Your Book is Doomed: How I Write Way Faster Than You Which one of these do you think would win our ad test? The answer may just surprise all of us. How would you reoptimize this headline based on this advice? I'd love to see your ideas in the comments. Where to run your adBy now you may be saying, \"Larry this is great, but I'm a little worried about how much this all will cost. Any suggestions to keep costs down?\" YES! We're just targeting English speakers. So you can save money by taking advantage of countries with lower CPCs. Rather than running ads in New York City, where CPCs would likely be very expensive, maybe you could set up your ads to appear only in Canada (which has 29 percent lower CPCs on average than the U.S.) or in Ireland (which has 40 percent lower CPCs on average). Prepare your Unicorn DetectorMake sure to set your ads to rotate evenly. You want to ensure that all 10–14 of your ads have a chance to run. Before analyzing your results, you'll want at least 200 impressions per ad. This is actually the number of impressions Google AdWords uses before ascertaining a quality score, but more is better. Also, you should bid to a specific position (e.g., bid to position 3, 4, or 5) using flexible bid strategies. That way you don't have to compare CTRs where one ad had a CTR of 20% in position 1 but a 2% CTR in position 8. Now you can analyze your results and see which headline had the best CTR. Pretty easy, huh? Usually one of your 10 ads will be a unicorn. However, if all the CTRs turn out the same (e.g., 2% vs. 2.1%) throw them all out and try out more headlines. Your goal is to find an outlier, a headline that generates 2x, 3x, or 4x higher CTR than the rest. Did it work? Now we've reached the end. We've identified the donkeys. We have a workflow for auditioning new possible headlines. And we've identified the winning headlines. Now what? You just swap them out. Replace your donkey title with the winning unicorn headline from your PPC ad test, and put it live. To determine whether you've succeeded, track the number of clicks to the page to ensure that your CTR has indeed increased. This is a ridiculously easy, low-risk, high-return strategy with a high probability of success because the new headline is battl- tested and should do just as well organically. Conclusion: Say no to low CTR Guys, this is crazy. First of all, think about all the SEO tasks you have to do. None of that is easy. It's all manual work. Just take link building as one example. You're hoping for other people to link to you to help you rank better. In the end it's very much a hit-or-miss approach to SEO because you have no control over whether you actually get the link (or if it will even help). Also, link building is more of an art, and one that some people just don't have the skills to do properly. Plus, when done poorly, bad link building can kill your rankings. Here, the workflow — my High CTR Pyramid Scheme — is all within your own control. This is more like on-page SEO, changing titles and text, but this is a more methodical, data-driven way of doing it. Optimizing for CTR is very leveraged. You can 5x your CTR if you're successful in turning a donkey into a unicorn. There's even more bonus points because it should result in ever better rankings, which should result in even more clicks. And your conversion rates will improve. I personally believe that CTR is calculated both at a query/page and at the domain level (like domain and page authority in link building). Since we can't have CTR data for every possible page/query, it makes sense to have something to fall back on. So by killing off your CTR donkeys, you're improving your domain CTR score, which should help rankings of all the other pages on your site. There's a famous Abraham Lincoln quote: \"Give me six hours to chop down a tree and I will spend the first four sharpening the axe.\" Well, if I had one hour to spend on SEO, I would spend that one hour finding and fixing my donkey headlines, turning them into unicorn headlines. Hour for hour, I'm convinced you have a really great return here. Your odds of winning the organic CTR lottery are 1 in 10. So go buy 10 lottery tickets! Are you optimizing for CTR? If not, why? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Hacking Your Way to 5x Higher Organic Click-Through Rates (and Better Conversion Rates & Rankings, too)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Hacking Your Way to 5x Higher Organic Click-Through Rates (and Better Conversion Rates & Rankings, too)"
    },
    {
      "level": "H2",
      "text": "Why isn't CTR optimization a bigger deal in organic search today?"
    },
    {
      "level": "H2",
      "text": "Introducing Larry's High CTR Pyramid Scheme"
    },
    {
      "level": "H2",
      "text": "Detecting your donkeys"
    },
    {
      "level": "H2",
      "text": "Warning: Don't go crazy reoptimizing your title"
    },
    {
      "level": "H2",
      "text": "We can make a unicorn — we have the technology!"
    },
    {
      "level": "H2",
      "text": "Don't half-ass your new headlines"
    },
    {
      "level": "H2",
      "text": "What keywords should you choose?"
    },
    {
      "level": "H2",
      "text": "10 awesome tips to help you write outstanding headlines"
    },
    {
      "level": "H2",
      "text": "Where to run your ad"
    },
    {
      "level": "H2",
      "text": "Prepare your Unicorn Detector"
    },
    {
      "level": "H2",
      "text": "Did it work?"
    },
    {
      "level": "H2",
      "text": "Conclusion: Say no to low CTR"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Larry Kim\n          \n            Larry Kim\n          \n            Larry Kim"
}