{
  "url": "https://moz.com/blog/high-quality-links",
  "slug": "high-quality-links",
  "title": "What are the Makings of a High-Quality Link? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "What links are considered “high quality”? Find out from link building expert, Paddy Moogan, who talks you through link relevancy, link diversity, link authority, and the sustainability of your link building efforts.",
  "content": "What are the Makings of a High-Quality Link? Link Building | Whiteboard Friday By: Paddy Moogan April 16, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Paddy Moogan April 16, 2021 What are the Makings of a High-Quality Link? Link Building | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. What links are considered “high quality”? Find out from link building expert, Paddy Moogan, who talks you through link relevancy, link diversity, link authority, and the sustainability of your link building efforts. Whiteboard Friday is going on Spring Break! We'll be back with new episodes in just a few short weeks, but in the meantime, be sure to check out Paddy's recent update to The Beginner’s Guide to Link Building for more link building tips: Read the Guide! Click on the whiteboard image above to open a high resolution version in a new tab! Video Transcription Hi, Moz fans. Welcome to another edition of Whiteboard Friday. I'm Paddy Moogan. I'm the co-founder of Aira, a UK-based digital agency. Today, I'm going to talk about link building, in particular what are the makings of a high-quality link. So we're going to talk about link relevancy, link diversity, and link authority, and then also talk a little bit about the long-term of link building, how you can think about making it sustainable, and how to make sure that what you're doing now is going to work in the future — how to approach doing that as well. Link relevance Page relevance So firstly, let's talk about relevance. So we're going to start with page relevance. The key thing to keep in mind here is thinking about your target audience for your product or your service. Think about what kinds of pages would be relevant to them. What kind of content would they read? What kind of articles would they save online and go off and try and search for? Because once you've done that, you've got the kind of relevance that's really, really important here. So, for example, if you sell coffee beans online for an online store and you get a link from a page that's about how to brew White's coffee, that's exactly the kind of page that your target audience — that you're selling coffee beans to — would probably read and enjoy, and seeing your link there gives them the chance to see your brand and possibly click through to your website as well. So really think about your target audience for your product or your service and think about what kind of content they will be reading and what they would enjoy online. Those are exactly the kind of pages you should be trying to get links from, and that's the key to relevance here. Topical relevance The next key to relevance is about what happens on your website, so what kind of content you publish and produce that then goes and get links. So, for example, if you're Coffee Beans Inc. selling coffee beans online and you produce a piece of content that's the most searched-for car brands by state, it could be a great piece of content, it could be visual, it could be interactive, it could be really interesting, and then you get lots of links to it from lots of different car sites, but if those car sites aren't relevant (which they aren't to Coffee Beans Incorporated), these links might not mean as much as they could do otherwise. So that's what's really important to remember when publishing content on your website that then goes and gets links. Now this kind of thing isn't a problem if you do it occasionally or you do a random idea, have a bit of fun, do something that's a bit different, a bit quirky. There's nothing wrong with doing that, but don't do it over and over and over again. The majority of the content on your website, and the majority that you then go and build links to, should be as close as possible to what you do as a product or as a service, and therefore relevant to your target audience, because when you do that, you're getting more than just links. You're getting your brand in front of the right kinds of people that could then become customers in the future as well. Link diversity Now, next up: diversity. So what we're talking about here is a few different ways to think about diversity of your link profile, how to make sure that profile is as natural as possible, and to make sure it's as high quality as possible. New links vs. existing So firstly, if you've got a site here that gets lots of links from different domains, that's great. Now if you get a link from the same domain again, and then the same domain again over here, so you've now got two links from the same domains twice, that's not really a problem. That's something that's actually a good thing to have, especially if that domain is high quality. However, at the same time, you do need to be thinking about getting links from lots of different domains. So these ones are all great or high quality, but also think about how to get links from others as well, because ultimately links from new domains show Google that you truly are a high-quality website, and you truly are a site worth linking to. Because if you're getting links from the same sites over and over again, whilst it may not be a problem, it's not as high quality as getting links from lots of new domains as well. So try and keep that in mind. So when you're targeting new links, make sure you're going after the ones that you haven't already got, as well, and — importantly — the ones that your competitors don't have. That's really, really important as well. Type of linking page Secondly, linking diversity, we want diversity in the type of page that links to us. So, for example, is a blog linking to you? Is it a news website? Is it a forum? Is it a chat site? Whatever it is, you want lots of diversity in there as well. You don't want to be getting links from the same kinds of sites over and over and over again. You want plenty of diversity in there to show to Google that you are actually a high-quality website as well. So when you're thinking about how to build links, try not to limit yourself to just one type of website. Of course, nothing wrong with getting links from the same ones over and over again, but make sure you're expanding your reach as much as possible and getting links from lots of different types of sites as well with your content. Position of link Thirdly, the position of a link on a page as well, and this is something which is probably something just to keep an eye on rather than worrying about it too much. But what people can do is look at the position of a link on a page — it could be in the sidebar, it could be in the footer, it could be in the body -- and they would look at that and that may affect how much equity that passes across that link as well to you. So, for example, if you're getting lots and lots of links from website footers, that's not exactly a prime location for someone to actually click on and come through to your website. So lots and lots of those may not mean quite as much as links from the main body of a website where people can see it front and center. So again, not something to worry about too much, but something just to keep in mind when looking at your link profile. If you've got too much of one of these, then that may not be a great sign to Google, and you may want to take a closer look at what's going on there and the reasons why. Link authority And finally, authority. So what we're talking about here is how much strength, authority, link equity a domain can pass to you from their own. So rather than just saying that your site is in the middle here and you've got links from these sites, we're saying, \"Well, who links to them?\" How many great links have they got and therefore how much strength have they got to pass along to you as well, because that's ultimately how you can influence your rankings and influence your organic search but getting links from sites that have authority themselves. It's a combination of relevancy, diversity, and authority that can make up a quality link. Now, of course, there's lots and lots signals Google can use here. There are hundreds, possibly thousands of variations of those signals. But it's a combination of these that are likely to mean the most to you as a link builder. Link sustainability Finally, we'll just talk a little bit about the long term here. Now a few principles to keep in mind because these kinds of things are the kinds of things to think about and to keep in mind, but ultimately you want to think of it bigger than that. Quality over quantity So, for example, quality over quantity. Ultimately, you want to be getting links that are as high quality as possible, that tick as many of these boxes as possible, rather than just getting as many links as you possibly can. It's always about the quality. Links mean different things to different sites Also, links mean different things to different sites. So, for example, one link to one brand, that same link to a different brand could have very different effects on their organic search and their organic rankings. So remember that everyone is different here. There's not a fixed rule for any of this. Every link profile, every domain, and every website is different. So the links that you get from one site might be very different to another as well. Make your website link worthy This is a really important one. Focus on making your website link worthy. What I mean by that is making sure that you're not just going out and asking for links and getting every single link possible, but people are naturally linking to your website as well. What will make people link without even thinking about it? The best links you can get and the most high-quality links you can get are the ones that you didn't even ask for, the ones that someone has linked to you with because you're a good site, you're a good product, you're a good service, you've got a great piece of content. Those are ultimately the high-quality links you want to pursue and go after. Google uses lots of signals We talked about a couple of them here that they may use, but they use many of them in link building as well. They can use user signals. They can, of course, use technical or on-page signals. All sorts of things going on there. So don't focus too much on links alone. Think about the other side of this as well. If you're building lots of links to sites that are fundamentally broken, they're slow, they're not responsive, no amount of links will fix those issues. So remember there's a lot more going on here than just links. Does the link make sense? Finally, does the link make sense? That's one of the ultimate sense checks to see if a link is high quality or not. If it looks like it makes sense to you and it says, okay, well, actually my coffee bean company is getting links from a White's coffee article, that makes sense. This one, not so much. So ultimately, don't be afraid of getting outside of the tools, getting outside of the metrics and using your own instinct, using your own experience to figure out does this link make sense for my site or my clients or my business. If it does, then ultimately it's probably going to be a good quality link. If you're looking at it and thinking, \"Oh, I'm not really sure why we've got that kind of link,\" then you maybe want to actually think about whether you actually want more of those kinds of links in the future. Conclusion So that's it for this week's Whiteboard Friday. I'm Paddy Moogan. If you want to drop me a message, I'm @paddymoogan on Twitter. You can also go to aira.net and drop me an email as well. Also drop some comments below and I can get back to you if you've got any questions. Thanks for joining and have a good day. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What are the Makings of a High-Quality Link?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What are the Makings of a High-Quality Link?"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Link relevance"
    },
    {
      "level": "H3",
      "text": "Page relevance"
    },
    {
      "level": "H3",
      "text": "Topical relevance"
    },
    {
      "level": "H2",
      "text": "Link diversity"
    },
    {
      "level": "H3",
      "text": "New links vs. existing"
    },
    {
      "level": "H3",
      "text": "Type of linking page"
    },
    {
      "level": "H3",
      "text": "Position of link"
    },
    {
      "level": "H2",
      "text": "Link authority"
    },
    {
      "level": "H2",
      "text": "Link sustainability"
    },
    {
      "level": "H3",
      "text": "Quality over quantity"
    },
    {
      "level": "H3",
      "text": "Links mean different things to different sites"
    },
    {
      "level": "H3",
      "text": "Make your website link worthy"
    },
    {
      "level": "H3",
      "text": "Google uses lots of signals"
    },
    {
      "level": "H3",
      "text": "Does the link make sense?"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Paddy Moogan\n          \n            Paddy Moogan\n          \n            Paddy Moogan"
}