{
  "url": "https://moz.com/blog/historical-link-analysis-is-here",
  "slug": "historical-link-analysis-is-here",
  "title": "Historical Link Analysis is Here! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Demonstrating the effectiveness of your link building strategies can be challenging. With our new Historical Link Analysis feature you can track changes in your link profile over time, relative to your competitors.",
  "content": "Historical Link Analysis is Here! Moz Tools S By: Samantha Britney December 22, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! S By: Samantha Britney December 22, 2011 Historical Link Analysis is Here! Moz Tools The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Season's Greetings, fellow Mozzers! As if this month hasn’t been exciting enough with the release of Custom Reports and Branded Keywords, today we have a special surprise for you. You asked for it, and we are happy to deliver. Introducing Historical Link Analysis for PRO! (Photo credit: Dana Pleasant Photography) Being able to see your link metric data over time helps demonstrate the effectiveness of your link building strategies. And hey, who doesn’t like to see progress? Read on to see how this new feature works. Subdomain Link Metrics This update to the Links section is full of lots of little goodies. Not only are we now storing your campaign link metrics over time, but we have also added Subdomain Link Analysis metrics for you and your competitors. Historical Data Charts What matters most in viewing historical metrics is how you are faring against your competition. For each metric, you can view historical data over time in comparison to your competitors. This way you can distinguish between the effects of your hard work to improve your link metrics and fluctuations that affect the entire index. You can view historical data via the History tab or by using the menu link next to a given metric on the Summary tab. You can also export all historical data to a CSV file. You may notice that we have made a few additional improvements to the Link Analysis section, including: adding Total External Links to Root Domain Metrics (to align with what is reported in Open Site Explorer) moving Link details to a separate tab for better readability updating the Summary PDF report to include Subdomain metrics Linkscape Index Updates Your link analysis metrics will continue to be updated every time a new index is released. With the rollout of this feature we'll now be able to store your data from previous indices as well, starting with data from the October 28th index. However, this data only goes back as far as you campaign does. When you create a new campaign, we'll only begin storing link metrics for you and your competitors from that point forward. In order to give you the best data, we’re continually improving our Linkscape crawlers and the data they return to the Index. As indices change, it’s possible that your metrics may change as a result of what is included in one index vs. another. This may occur even if a site’s link profile hasn’t changed at all. I encourage you to check out Rand’s Linkscape Index blog posts (released with each new index) to better understand additional factors that could affect your metrics. Best practices indicate that you should always compare your progress against your competitors, versus solely comparing to your past performance. Let Us Know What You Think We hope these product updates bring a little cheer to your holiday season. As always, we would love your feedback! Feel free to share your thoughts, or holiday stories, via a comment on this post. Happy holidays! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Historical Link Analysis is Here!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Historical Link Analysis is Here!"
    },
    {
      "level": "H2",
      "text": "Subdomain Link Metrics"
    },
    {
      "level": "H2",
      "text": "Historical Data Charts"
    },
    {
      "level": "H2",
      "text": "Linkscape Index Updates"
    },
    {
      "level": "H2",
      "text": "Let Us Know What You Think"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "Moz AI: Introducing Augmented Intelligence"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Samantha Britney\n          \n            Samantha Britney\n          \n            Samantha Britney"
}