{
  "url": "https://moz.com/blog/holiday-2020-local-seo-tips",
  "slug": "holiday-2020-local-seo-tips",
  "title": "My 8 Best Local SEO Tips for the 2020 Holidays - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Whatever your business can offer to support local shoppers’ aspirations for a safe, comfortable, happy holiday season at home is commendable at the end of a very challenging 2020. Local SEO expert Miriam Ellis shares eight local search marketing tips will help you make good connections that serve…",
  "content": "My 8 Best Local SEO Tips for the 2020 Holidays Local SEO | E-Commerce SEO By: Miriam Ellis September 29, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis September 29, 2020 My 8 Best Local SEO Tips for the 2020 Holidays Local SEO | E-Commerce SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Image credit: DoSchu “No place like home for the holidays.” This will be the refrain for the majority of your customers as we reach 2020’s peak shopping season. I can’t think of another year in which it’s been more important for local businesses to plan and implement a seasonal marketing strategy extra early, to connect up with customers who will be traveling less and seeking ways to celebrate at home. Recently, it’s become trendy in multiple countries to try to capture the old Danish spirit of hygge, which the OED defines as: A quality of coziness and comfortable conviviality that engenders a feeling of contentment or well-being. While this sometimes-elusive state of being isn’t something you can buy direct from a store, and while some shoppers are still unfamiliar with hygge by name, many will be trying to create it at home this year. Denmark buys more candles than any other nation, and across Scandinavia, fondness for flowers, warming foods, cozy drinks, and time with loved ones characterizes the work of weaving a gentle web of happiness into even the darkest of winters. Whatever your business can offer to support local shoppers’ aspirations for a safe, comfortable, happy holiday season at home is commendable at the end of a very challenging 2020. I hope these eight local search marketing tips will help you make good connections that serve your customers — and your business — well into the new year. 1) Survey customers now and provide what they want Reasonably-priced survey software is worth every penny in 2020. For as little as $20/month, your local business can understand exactly how much your customers’ needs have changed this past year by surveying: Which products locals are having trouble locatingWhich products/services they most want for the holidaysWhich method of shopping/delivery would be most convenient for themWhich hours of operation would be most helpful Which safety measures are must-haves for them to transact with a businessWhich payment methods are current top choices Doubtless, you can think of many questions like these to help you glean the most possible insight into local needs. Poll your customer email/text database and keep your surveys on the short side to avoid abandonment. Don’t have the necessary tools to poll people at-the-ready? Check out Zapier’s roundup of the 10 Best Online Survey Apps in 2020 and craft a concise survey geared to deliver insights into customers’ wishes. 2) Put your company’s whole heart into affinity If I could gift every local business owner with a mantra to carry them through not just the 2020 holiday shopping season, but into 2021, it would be this: It’s not enough to have customers discover my brand — I need them to like my brand. Chances are, you can call to mind some brands of which you’re highly aware but would never shop with because they don’t meet your personal or business standards in some way. You’ve discovered these brands, but you don’t like them. In 2020, you may even have silently or overtly boycotted them. On the opposite side of this scenario are the local brands you love. I can wax poetic about my local independent grocery store, stocking its shelves with sustainable products from local farmers, flying its Black Lives Matter and LGBTQ+ flags with pride from its storefront, and treating every customer like a cherished neighbor. For many years, our SEO industry has put great effort into and emphasis on the discovery phase of the consumer journey, but my little country-town grocer has gone leaps and bounds beyond this by demonstrating affinity with the things my household cares about. The owners can consider us lifetime loyal customers for the ways they are going above-and-beyond in terms of empathy, diversity, and care for our community. I vigorously encourage your business to put customer-brand affinity at the heart of its holiday strategy. Brainstorm how you can make meaningful changes that declare your company’s commitment to being part of the work of positive social change. 3) Be as accessible and communicative as possible Once you’ve accomplished the above two goals, open the lines of communication about what your brand offers and the people-friendly aspects of how you operate across as many of the following as possible: WebsiteLocal business listingsEmailSocial channelsFormsTexts/MessagingPhone on-hold marketingStorefront and in-store signageLocal news, radio, and TV media In my 17 years as a local SEO, I can confidently say that local business listings have never been a greater potential asset than they will be this holiday season. Google My Business listings, in particular, are an interface that can answer almost any customer who-what-where-when-why — if your business is managing these properly, whether manually or via software like Moz Local. Anywhere a customer might be looking for what you offer, be there with accurate and abundant information about identity, location, hours of operation, policies, culture, and offerings. From setting special hours for each of your locations, to embracing Google Posts to microblog holiday content, to ensuring your website and social profiles are publicizing your USP, make your biggest communications effort ever this year. At the same time, be sure you’re meeting Google’s mobile-friendly standards, and that your website is ADA-compliant so that no customer is left out. Provide a fast, intuitive, and inclusive experience to keep customers engaged. With the pandemic necessitating social distancing, make the Internet your workhorse for connecting up with and provisioning your community as much as you can. 4) Embrace local e-commerce and product listings Digital Commerce 360 has done a good job charting the 30%+ rise in online sales in the first half or 2020, largely resulting from the pandemic. The same publication summarizes the collective 19% leap in traffic to North America’s largest retailers. At the local business level, implementing even basic e-commerce function in advance of the holiday season could make a major difference, if you can find the most-desired methods of delivery. These could include: Buy-online, pick up in-store (BOPIS)Buy-online, pick up curbsideBuy online for postal deliveryBuy online for direct home delivery by in-house or third-party drivers Here’s an extensive comparison of popular e-commerce solutions, including which ones have free trials, and the e-commerce column of the Moz blog is a free library of expert advice on optimizing digital sales. Put your products everywhere you can. Don’t forget that this past April, Google surprised everybody by offering free product listings, and that they also recently acquired the Pointy device, which lets you transform scanned barcodes into online inventory pages. Additionally, in mid-September, Google took their next big product-related step by adding a “nearby” filter to Google Shopping, taking us closer and closer to the search engine becoming a source for real-time local inventory, as I’ve been predicting here in my column for several years. Implement the public safety protocols that review research from GatherUp shows consumers are demanding, get your inventory onto the web, identify the most convenient ways to get purchases from your storefront into the customer’s hands, and your efforts could pave the way for increased Q4 profits. 5) Reinvent window shopping with QR codes “How can I do what I want to do?” asked Jennifer Bolin, owner of Clover Toys in Seattle. What she wanted to do was use her storefront window to sell merchandise to patrons who were no longer able to walk into her store. When a staff member mentioned that you could use a QR code generator like this one to load inventory onto pedestrians’ cell phones, she decided to give it a try. Just a generation or two ago, many Americans cherished the tradition of going to town or heading downtown to enjoy the lavish holiday window displays crafted by local retailers. The mercantile goal of this form of entertainment was to entice passersby indoors for a shopping spree. It’s time to bring this back in 2020, with the twist of labeling products with QR codes and pairing them with desirable methods of delivery, whether through a drive-up window, curbside, or delivery. “We’ve even gotten late night sales,” Bolin told me when I spoke with her after my colleague Rob Ousbey pointed out this charming and smart independent retail shop to me. If your business locations are in good areas for foot traffic, think of how a 24/7 asset like an actionable, goodie-packed window display could boost your sales. 6) Tie in with DIY, and consider kits With so many customers housebound, anything your business can do to support activities and deliver supplies for domestic merrymaking is worth considering. Can your business tie in with decorating, baking, cooking, crafting, handmade gift-giving, home entertainment, or related themes? If so, create video tutorials, blog posts, GMB posts, social media tips, or other content to engage a local audience. One complaint I am encountering frequently is that shoppers are feeling tired trying to piecemeal together components from the internet for something they want to make or do. Unsurprisingly, many people are longing for the days when they could leisurely browse local businesses in-person, taking inspiration from their hands-on interaction with merchandise. I think kits could offer a stopgap solution in some cases. If relevant to your business, consider bundling items that could provide everything a household needs to: Prepare a special holiday mealBake treatsOutfit a yard for winter playTrim a tree or decorate a homeBuild a fireCreate a night of fun for children of various age groupsDress appropriately for warmth and safety, based on regionCreate a handmade gift, craft, or garmentWinter prep a home or vehicleCreate a complete home spa/health/beauty experience Plant a spring garden Kits could be a welcome all-in-one resource for many shoppers. Determine whether your brand has the components to offer one. 7) Manage reviews meticulously Free, near-real-time quality control data from your holiday efforts can most easily be found in your review profiles. Use software like Moz Local to keep a running tally of your incoming new reviews, or assign a staff member at each location of your business to monitor your local business profiles daily for any complaints or questions. If you can quickly solve problems people cite in their reviews, your chances are good of retaining the customer and demonstrating responsiveness to all your profiles’ visitors. You may even find that reviews turn up additional, unmet local needs your formal survey missed. Acting quickly to fulfill these requests could win you additional business in Q4 and beyond. 8) Highly publicize one extra reason to shop local this year “72% of respondents...are likely or very likely to continue to shop at independent stores, either locally or online, above larger retailers such as Amazon.” — Bazaarvoice I highly recommend reading the entire survey of 12,000 global respondents by Bazaarvoice, quantifying how substantially shopping behaviors have changed in 2020. It’s very good news for local business owners that so many customers want to keep transacting with nearby independents, but the Amazon dilemma remains. Above, we discussed the fatigue that can result from trying to cobble together a bunch of different resources to check everything off a shopping list. This can drive people to online “everything stores”, in the same way that department stores, supermarkets, and malls have historically drawn in shoppers with the promise of convenience. A question every local brand should do their best to ask and answer in the runup to the holidays is: What’s to prevent my community from simply taking their whole holiday shopping list to Amazon, or Walmart, or Target this year?Whatever your business can offer to support local shoppers’ aspirations for a safe, comfortable, happy holiday season at home is commendable at the end of a very challenging 2020. I hope these eight local search marketing tips will help you make good connections that serve your customers — and your business — well into the new year.My completely personal answer to this question is that I want my town’s local business district, with its local flavor and diversity of shops, to still be there after a vaccine is hopefully developed for COVID-19. But that’s just me. Inspiring your customers’ allegiance to keeping your business going might be best supported by publicizing some of the following: The economic, societal, and mental health benefits proven to stem from the presence of small, local businesses in a community. Your philanthropic tie-ins, such as generating a percentage of sales to worthy local causes — there are so many ways to contribute this year.The historic role your business has played in making your community a good place to live, particularly if your brand is an older, well-established one. I hear nostalgia is a strong influencer in 2020, and old images of your community and company through the years could be engaging content.Any recent improvements you’ve made to ensure fast home delivery, whether by postal mail or via local drivers who can get gifts right to people’s doors.Uplifting content that simply makes the day a bit brighter for a shopper. We’re all looking for a little extra support these days to keep our spirits bright. Be intentional about maximizing local publicity of your “extra reason” to shop with you. Your local newspaper is doubtless running a stream of commentary about the economic picture in your city, and if your special efforts are newsworthy, a few mentions could do you a lot of good. Don’t underestimate just how reliant people have become on the recommendations of friends, family, and online platforms for sourcing even the basics of life these days. In my own circle, everyone is now regularly telling everyone else where to find items from hand sanitizer to decent potatoes. Networking will be happening around gifts, too, so anything you get noticed for could support extensive word-of-mouth information sharing. I want to close by thanking you for being in or marketing businesses that will help us all celebrate the many upcoming holidays in our own ways. Your efforts are appreciated, and I’m wishing you a peaceful, profitable, and hyggelig finish to 2020. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "My 8 Best Local SEO Tips for the 2020 Holidays"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "My 8 Best Local SEO Tips for the 2020 Holidays"
    },
    {
      "level": "H2",
      "text": "1) Survey customers now and provide what they want"
    },
    {
      "level": "H2",
      "text": "2) Put your company’s whole heart into affinity"
    },
    {
      "level": "H2",
      "text": "3) Be as accessible and communicative as possible"
    },
    {
      "level": "H2",
      "text": "4) Embrace local e-commerce and product listings"
    },
    {
      "level": "H2",
      "text": "5) Reinvent window shopping with QR codes"
    },
    {
      "level": "H2",
      "text": "6) Tie in with DIY, and consider kits"
    },
    {
      "level": "H2",
      "text": "7) Manage reviews meticulously"
    },
    {
      "level": "H2",
      "text": "8) Highly publicize one extra reason to shop local this year"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}