{
  "url": "https://moz.com/blog/holiday-video-2014",
  "slug": "holiday-video-2014",
  "title": "Happy Holidays from Moz - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Join in the holiday fun with this video about some new office holiday traditions from Moz.",
  "content": "Happy Holidays from Moz Moz News By: Felicia Crawford December 24, 2014 Table of Contents Copied! By: Felicia Crawford December 24, 2014 Happy Holidays from Moz Moz News Ah, the holidays! This is the time of year when we give our thanks and make our wishes, when new and old meld happily together like hot buttered rum and Grandma's pistachio fudge. There's been a lot of newness this year for Moz. As the smilin' face behind live chat, I've had the good fortune to meet many of you as you embark upon your Mozzy journey for the first time. And throughout 2014 alone, we welcomed more than two dozen new Mozlings into our family! With all this wonderful change, we've added a few things to our list of office holiday traditions. Party with us as we celebrate the old and the new, the weird White Elephant gifts and the lumpy sweaters from your aunt, and all the good intentions and warm, fuzzy feelings of the season! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Happy Holidays from Moz"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Happy Holidays from Moz"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Felicia Crawford\n          \n            Felicia Crawford\n          \n            Felicia Crawford"
}