{
  "url": "https://moz.com/blog/holy-sht-i-joined-twitter",
  "slug": "holy-sht-i-joined-twitter",
  "title": "Holy Sh*t, I Joined Twitter - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Sigh. After much badgering, cajoling, nudging, and subtle threatening from my coworkers, colleagues, friends, and Jane (yes, Jane gets her own category--she badgered me a lot), I finally joined the Twitter. Much like Jane did when she begrudgingly joined, I'll take you through the terrifying…",
  "content": "Holy Sh*t, I Joined Twitter Social Media By: Rebecca Kelley September 3, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley September 3, 2008 Holy Sh*t, I Joined Twitter Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Sigh. After much badgering, cajoling, nudging, and subtle threatening from my coworkers, colleagues, friends, and Jane (yes, Jane gets her own category--she badgered me a lot), I finally joined the Twitter. Much like Jane did when she begrudgingly joined, I'll take you through the terrifying process of nervously dipping a toe into the murky, frigid depths of the Twittersphere. This morning, Jane shared with me some amusing Twitter messages some folks were sending to each other. I had thought about joining Twitter in the past but never really cared much for the service. To me, there's not much appeal to typing \"@soandso lol listening to Marky Mark and the Funky Bunch and thought of you.\" It all seems kind of pointless, right? I mean, I certainly don't care what my friends ate for breakfast, when they clipped their toenails, why the line at the bank is taking so long, and so on. Nor do I expect anyone to care about my trivial musings. Thus, I stubbornly backed into a corner and remained a staunch anti-Twitterer (Twit? I have no idea) while all of my coworkers and colleagues hopped on the bandwagon. (Except you, Jeff. Stay strong.) As part of a not-so-subtle \"eff you\" to Twitter, I recently joined Plurk and started playing around on it. Plurk, I'm told, is \"like Twitter,\" only it's on a timeline. I like Plurk--you earn \"karma points\" for being active on the site and for referring friends, and the more karma points you get, the more stuff you can unlock (like profile templates, Plurk mascots, and various emoticons). I fancy myself the Jane Copland of Plurk--currently I have almost 60 karma points and I've enjoyed getting to know some folks on the site. The more I used Plurk, the more I (sort of) understood why people use Twitter. Sure, I'm still a casual Plurk user--I barely use it on nights and weekends--but nonetheless, I enjoy sharing links, using the site for social media marketing, and just typing random sentences and thoughts. Likewise, I enjoy the sort of information my Plurk buddies share with me. And thus, my Twitter hatred softened a bit. I started to see the non-attention whore benefits of being on Twitter, like sharing links and getting traffic to your site or to your blog posts, sharing viral marketing and social media marketing efforts, polling your colleagues or using Twitter to do research for a report or article, learning SEO tricks and tips, and hell, even using the site to write your presentations or articles for you. Okay, I'll admit that from a marketing perspective, it makes sense to join Twitter. So I did. I tried to register @squishee and discovered that someone had already nabbed it. Damn. Next I tried @rkelley, to no avail. I started to panic. Was I so late to the Twitter party that I wouldn't be able to register a damn user name? Oddly enough, however, the least original and what I thought would be the most common option, @rebeccakelley, was available, so I claimed it. To my surprise, I was already following a couple people (Dave Naylor and Michael McDonald), and one person (Mike McDonald) was following me. I couldn't figure out how that could have happened until I realized that these folks probably sent me a Twitter invite many moons ago, so when I finally relented and joined they were automatically added as my friends. The vast, unexplored horizon With my bare bones profile officially live, I published a Plurk message stating that I had finally joined Twitter, then I went to lunch. When we came back Jane Twittered to her 596 followers that I had finally gotten off my ass and joined. And wouldn't you know it, just like that I received over 30 freakin' emails notifying me that \"so and so\" is now following you on Twitter!\" Geez, that was fast. I'm a little scared. Dear God, I've opened Pandora's Box So, I'm on Twitter. Though I know what to use it for, I don't know how to use it. My phone is a Razor knockoff that's partially broken, so I don't see myself using it to send out Twitter messages any time soon. I'm told that Twitter is all ghetto slow and has been breaking a lot lately, so I don't even know what features I can use and which I shouldn't touch with a ten foot pole out of fear of incurring the wrath of the mighty fail whale. I'm like your grandpa who takes your advice and gets an email address so you can more easily correspond with him...and then you realize that he registered \"bobbyspappy@aol.com.\" And now he only sends you chain letters, animated greeting cards, and <no subject> 20-size font emails that are inconsistently capitalized and talk about his latest mole checkup at the doctor. Still, I'm optimistic. Jane's only been using Twitter since March of this year, and by now she seems like a seasoned vet. Hopefully my learning curve will be just as sharp. I don't think I'll become Twitter obsessed (unlike a lot of SEOs, I enjoy time away from the Internet and often spend at least one day every weekend offline), but hopefully I'll learn to like it and appreciate its benefits. I think my inaugural Twitter message (Tweet? Twoot? Twit? Argh...) will be to link to this post...let's see what happens, shall we? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Holy Sh*t, I Joined Twitter"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Holy Sh*t, I Joined Twitter"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}