{
  "url": "https://moz.com/blog/hot-tip-dont-poison-your-customers",
  "slug": "hot-tip-dont-poison-your-customers",
  "title": "Hot Tip: Don't Poison Your Customers - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I had an experience this week that I thought was a perfect case study in what not to do with Adwords.  Background: I have Celiac's Disease (short explanation: Gluten—a protein found in wheat—has approximately the same effect on me that salmonella would have on your average person).    My dad has…",
  "content": "Hot Tip: Don't Poison Your Customers Paid Search Marketing (PPC) M By: MikePiper September 19, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! M By: MikePiper September 19, 2008 Hot Tip: Don't Poison Your Customers Paid Search Marketing (PPC) This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I had an experience this week that I thought was a perfect case study in what not to do with Adwords. Background: I have Celiac's Disease (short explanation: gluten—a protein found in wheat—has approximately the same effect on me that salmonella would have on your average person). My dad has Celiac's also. As you can imagine, we frequently email each other back and forth about gluten-free products we've found that are actually edible. (Creating a varied/enjoyable/healthy diet that involves literally no wheat or wheat flour is rather difficult.) So it's no surprise that the ads across the top of my Gmail are frequently for gluten-free products. Recently, the ad at the top of my Gmail was as follows: \"Gluten free pizza crust - www.pillsbury.com - It's pizza night! Make it quick & easy with Pillsbury® pizza crust.\" I like pizza. Pillsbury products are tasty. [Click] I landed here. I think, \"Cool, that looks pretty good. Err, wait a second. It doesn't mention that it's gluten-free. That's odd. You'd think they would mention that. Guess I should check.\" I clicked and searched around on the Pillsbury site for a few minutes, unable to find any information as to ingredients. (Pillsbury is already losing points in my head for poor usability…) Eventually I gave up, took the product name and Googled it + \"ingredients.\" Found this page. First ingredient listed? Wheat flour. Super. Jerks. Not only are they completely wasting money advertising a product to me that I literally cannot eat, they're also wasting my time bringing me to a worthless page, and further, they're making me search around before I can even determine whether or not I can eat the product they're trying to sell me. Just imagine if I had believed their ad and bought/eaten the pizza crust! Talk about killing your brand equity. Lessons? Make darned sure your landing pages are relevant to your ad copy. Automatically-generated keyword lists can be riskier than you might think. On wasted clicks, you may be losing much more than just the money you spent on the click. Mike Piper is one of the creators of the Joomla Made Simple tutorial course. He also writes about taxes and is the author of the 3-Minute Guide to LLC vs. S-Corp vs. C-Corp. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Hot Tip: Don't Poison Your Customers"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Hot Tip: Don't Poison Your Customers"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "MikePiper\n          \n            MikePiper"
}