{
  "url": "https://moz.com/blog/how-our-agency-survived-year-one",
  "slug": "how-our-agency-survived-year-one",
  "title": "How Our Agency Survived Year One - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "These are the lessons I learned while building Greenlane Search Marketing: some \"outside\" thinking on ways to make your digital marketing agency or department successful.",
  "content": "How Our Agency Survived Year One SEO Basics By: Bill Sebald May 22, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Bill Sebald May 22, 2014 How Our Agency Survived Year One SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. There are some things in life you don't truly understand until you experience them. I was given plenty of parenting advice when my son was born, but it only took me so far. Nothing prepared me for the first time our baby decided to roll over… right off the bed onto the floor (luckily we had a pile of laundry serving as a cushion). If you've never been a parent, you simply don't have a lot of personal experience to draw from. It's a complete trial by fire, full of missteps, emotions, and anxiety. In a way, starting Greenlane was a similar experience. Greenlane Search Marketing, LLC is my startup boutique SEO agency. It started in 2005 as a sole proprietorship consulting practice. It was my baby, and I had to let it grow up. Now it's a partnership between myself and a long-time colleague Keith Urban (not the singer). However, differing from the parenting example, I did have some practical experience to guide me this time. I ran an SEO department in a major digital marketing agency. Regardless, it became very clear we didn't know a thing about truly running an agency. We were new parents. What to expect when you're expecting We expected to be busy. We knew we'd make mistakes, and we thought we had a solid business plan in place. In the end we were busier than expected, made more mistakes than we care to admit, and our plan fell apart on a weekly basis. But I'm proud (and relieved) to say we're successful. We have a great staff of smart SEOs and digital marketers. We have happy clients. We have a great network of people to tap into. We're profitable, targeting half a million in fee revenue by the end of 2014. We survived year one, where 25% of startups crash. We're on yet another phase of growth, with our legal and taxation items well managed, our employment under control, and the company as a whole being positioned to overcome year two. For me, that's an enormous win. Specifically, what was our secret? Hell if I know. But I think it's this fuzzy formula: Take what you hear, mixed with what you've experienced in life, multiplied by your best guess, and divide by quick, brave decisions. But we also had a motto, one that became our backbone: \"Always make it better!\" Making it better for you and your clients This is a post about some of the more conceptual, \"outside the normal\" things we implemented to constantly improve our company from the start. These are based on my life experiences and recent business victories. My hope is that this will serve as fodder for your own company, even if you're not the proprietor. This post is not about tax management, or accounting, or filings—this is about the day-to-day behavioral things that can make your digital marketing company a great place to be, to the benefit of you and your clients. And to sprinkle in a little fun, since I said life experience fed into many of our first year decisions, I'll supplement each section with something from my own awkward photo album. On to the tips… #1 - Think about your group experiences For those who played team sports, remember when your parents said, \"One day this will make you better at your job!\" Go tell them they were right. Working as a team is an invaluable skill, improved only through experience and introspection. We've all engaged in group experiences, from grade school to our earliest jobs. Everyone has some kind of group or department participation to draw on. Maybe it's as simple as cub scouts, a yearbook committee, or in my case, a rock band. Additionally, we've all either seen—or have been—the flunky in the group, doing the least amount to make the group as a whole succeed. There's also the opposite—a \"Johnny-Come-Lately\" who shows up with good intentions but sticks a giant crowbar into the gears, grinding progress to a screeching halt. We've seen the drama and anger that comes from personalities that just don't mix. Nothing slows down momentum more than an unfocused crew rowing in different directions. An agency is no different. You will always have bosses, clients, and employees that behave or think differently than you. You simply need to learn how to overcome. Someone once told me you can't be a boss and a friend. I've never disagreed with something so hard in my life. A friendship presents an amazing bond of trust. At Greenlane we've carefully selected co-workers who we enjoy being around. We all have different talents and roles in the company, but you see virtually no instances of \"pulling rank\" over anyone else. There's a respect that drives each of us to do a good job for each other. It creates more open and creative dialogue. If you don't feel like you have anything to prove, you can more easily pause, listen, and learn. We don't want to let each other down, but we all feel empowered to counter an idea without fear. The best idea wins, and our clients (as well as ourselves) become more educated. We've nurtured a really powerful environment. The bigger your group, the harder this is, but certainly not impossible. We take the same approach with bringing on clients. We call them partners—a term I took from an old gig. Just as we are being paid to help businesses be successful, their actions have a lot of bearing on our success as a vendor—not to mention our own happiness. I'll often tell a prospective partner, \"just as you're auditioning us, we're auditioning you too.\" That could come off cocky, but any prospects we lost for that statement were probably not going to last in the long run. In fact, I ask all prospective clients to first read our website, where we openly talk about the kind of clients we're looking for. About two-thirds return super qualified, with the remainder vanishing forever. Those that return often say, \"you are exactly what we're looking for.\" It's a bit like online dating. I wish we could say we've never lost a client due to poor performance. We have. Two of them actually. But in retrospect, this provided good lessons on where we needed to improve. In one case it was due to never being on the right wavelength to begin with, and the other was simply based on poor communicating. We largely (and swiftly) pivoted internally to make sure we never make those mistakes again. As a company, we were all just rowing the wrong way. Catching it early allowed for a very quick adjustment. By the way, I'm well aware that some internal hierarchies don't allow you to have a say on the clients that come in. While that is unfortunate, it is also common. But what's to stop you from climbing the totem pole and pleading your case? The TL;DR tips: Don't just act like you're interested in every word of your clients and employees, truly be interested. This is their time to talk, and your time to pause, listen, and ask valuable questions. Work together! Ask your clients questions. Let them understand it's your job to pull information out of them. Don't be a yes man; be a friendly challenger in order to get everyone nodding in the same direction. Work with your team, not against them. If you're not actively on the account and their day-to-day work, be careful not to break the flow of the meeting throwing out ideas that counter the direction the account managers want to go. Get yourself on the same page, even if you're the boss. Have a postmortem on every lost employee or client account, and drop your defenses. Try to figure out what could have been improved as a group. You've been an SEO for over 15 years? Good for you. Now sit down and listen to everyone else's ideas. Be an equal. #2 - The people you meet could become important I'm often asked how we perform lead generation. Our primarily lead source is our network. Keith and I are very lucky in that regard, both coming from the big agency world. Big agencies seem to organically create seedlings that go off to start new companies or work with other established businesses. From former clients to former co-workers, developing serendipity every chance you get, should be a 24/7 goal. You never know when someone you've met will hit it big. If you leave a good impression, they may invite you to their next party. Digital marketing is one of those rare industries. There are millions of lawyers and accountants, as well as designers. There are relatively few SEOs, PPC experts or affiliate marketers. Make the right impression and your name will get passed around quickly. If you have a bad reputation, or are generally unliked, the word spreads just as fast. I've picked against vendors for my clients (or when I worked in-house) simply based on how phony they came off. I'll probably have this put on my tombstone because I say it so much, \"Perception Is Reality.\" Let that one sink in. It doesn't mean \"fake it,\" but be genuine and supportive. I wrote a post that I still think about often. It was called \" Create Your Own SEO Serendipity.\" I don't know how, or where, or why I started doing it, but I've been in the \"serendipity\" game for a long time. \"Karma\" might be a possible synonym. Building up your network is one part of the puzzle, but building it so you're memorable is a whole other piece that may require a bit of introspection on your end. In hindsight, I spent my entire professional career mirroring my personal life—be good and helpful to everyone you meet. Sure you get burned if others take advantage, but when a referral comes in from an old colleague, I'm thrilled. It's that warm feeling that makes \"doing business\" pretty damn fun. The TL;DR tips: Stay in touch with everyone you can by any means necessary. The tiniest little gestures—like endorsing a skill or expertise on LinkedIn, or buying someone a beer at a convention—can sometimes bring you top of mind when you need it most. In my experience job titles don't necessarily mean everything. Personality and kindness go further. Always be willing to support someone's little needs. Free advice or work can turn into major opportunities. Answer everyone's emails, tweets, texts, whatever. Very few of us really can't find the time. Don't just wait for people to call you. If you generally feel good about all your encounters, there's nothing wrong with reaching out and saying, \"Thanks for the great talk at the meetup last night. I wanted to see if I could help you solve that problem we were talking about.\" Create serendipity every day. Create serendipity every day (worth mentioning twice!!!). #3 - Hire people smarter than you Around 2009, I remember the CEO of GSI Commerce said this at a company meeting I attended (paraphrasing)—\"I built this company by hiring people smarter than me.\" This off-hand comment was a real wake-up call for me. He's since sold his company to eBay, and moved on to restart something new. If this tip helped make someone a billionaire, there must be something to it My partner and I didn't read many business books. Personally, I tried, but rejected most of them. I stubbornly refused to buy into some of the concepts. However, there were a few where I recognized common threads. Books like Good to Great, How To Think Like A CEO, The Outsiders, and The Corner Office didn't have a \"fake it until you make it,\" or \"kill or be killed\" lesson. Instead, they highlighted leading by example, taking calculated risks, being human, and learning from everyone around you. We candidly tell our prospects that we hire people with unique experience for the sole purpose of supporting the clients. We reveal that Keith's background is in data and analytics, Mike's is in design and development, Jon's is in PR and outreach, and so on. We're not all experts at everything. We're very clear that any of our team may work on an account dependent on a given strategy. It's honest and realistic, and goes over well with prospects. Meanwhile, in the office, we have a lot of co-mingling, where each teammate may join another to work out a specific problem. I'm the old dog in the group, but I'll tell you the honest truth—I learn something every day from this team. The client wins, my company improves, and my own personal development grows. What more could anyone want out of a job? The TL;DR tips: Let smarter (or more experienced) people help guide you. It's a win-win situation for everyone involved. Don't act like you know it all. Your employees and your clients will see right through this. If you don't know the answer, let your clients know that you may have someone in your fold that might have the answers. When your company is hired, so is your entire organization. There's nothing wrong with this! Encourage your team to speak their mind, take a chance, and kick your ass. When they do, give them a high-five. #4 - Don't be so serious Last but not least, have fun. Keith and I don't need to remind ourselves why we took this risk. It's fun every day. Business is a game, and we're enjoying our time on the field. No more toxic relationships, no more loss of control, and no more sitting in the \"peanut gallery\" watching other people do it wrong. Be serious enough to hit your deliverables, make your marks count, and help your clients win. But why not do it with a smile? I've always heard that working in marketing and advertising is one of the most stressful jobs you could have. It doesn't have to be. We didn't build our company with a textbook or a degree. The more I experience, the more I see most people in our field didn't follow a rule book either. Great businesses are managed by CEOs who take chances, with varied personality traits and levels of intelligence—something school doesn't necessarily teach anyway. For years I thought I'd have to be an \"American Psycho\" type business-genius with an MBA, a big vocabulary, a clean haircut, and a country club membership. I have none of those. In the end, I honestly believe we were guided by our own experience, serendipity, and common sense. It's been a great ride so far, with a lot more learnings—and laughs—to be had. Besides, if the business folds tomorrow, at least I achieved the biggest thing on my bucket list. So there's that. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Our Agency Survived Year One"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Our Agency Survived Year One"
    },
    {
      "level": "H2",
      "text": "What to expect when you're expecting"
    },
    {
      "level": "H2",
      "text": "Making it better for you and your clients"
    },
    {
      "level": "H2",
      "text": "#1 - Think about your group experiences"
    },
    {
      "level": "H4",
      "text": "The TL;DR tips:"
    },
    {
      "level": "H2",
      "text": "#2 - The people you meet could become important"
    },
    {
      "level": "H4",
      "text": "The TL;DR tips:"
    },
    {
      "level": "H2",
      "text": "#3 - Hire people smarter than you"
    },
    {
      "level": "H4",
      "text": "The TL;DR tips:"
    },
    {
      "level": "H2",
      "text": "#4 - Don't be so serious"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Bill Sebald\n          \n            Bill Sebald\n          \n            Bill Sebald"
}