{
  "url": "https://moz.com/blog/how-to-leverage-investment-in-video-to-build-more-links",
  "slug": "how-to-leverage-investment-in-video-to-build-more-links",
  "title": "How to Leverage Investment in Video to Build More Links - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Video can be an expensive and time consuming investment. In this post, I outline nine ways in which video can be used to augment and enhance link building activity, with the goal of giving you more ammunition to secure an investment in video as part of a wider inbound marketing strategy.",
  "content": "How to Leverage Investment in Video to Build More Links Link Building By: Phil Nottingham June 17, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Phil Nottingham June 17, 2013 How to Leverage Investment in Video to Build More Links Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Video can be an expensive and time-consuming investment. For small businesses especially, the cost of producing video will always have to be weighed against other marketing investments, and the sad truth is that video can be a tough sell — especially when the ROI from its significant expense is hard to predict or quantify.I think part of the problem is that most marketers (including SEOs) don’t have a very good understanding of the value that video can provide for them; they see virality, branding, and perhaps increasing conversion rates as the extent of it. Video as a media type, however, has potential on which few people capitalise: the ability to secure fantastic, high quality links back to your site.In this post, I want to outline nine ways in which video can be used to augment and enhance link-building activity, with the goal of giving you more ammunition to secure an investment in video as part of a wider inbound marketing strategy.1. Using video as a media type within interactive contentThe kind of content you need:Video is a media type — a form of content delivery — rather than a “type of content” as such. As the old adage goes, “form follows function,” and this is exactly the approach you should be taking when working out the best way to present a creative idea.Pages where video is part of the overall sum of a multimedia interactive can be extremely engaging, and as such generate a lot of links.For example...http://cloudsovercuba.com/ is a fantastic microsite that uses mixed media to tell the story of the Cuban Missle Crisis. While this was not likely created with links in mind, the page has managed to secure 1,920 links from 266 link root domains (according to OSE).Two guides from Simply Business, The Small Business Guide to WordPress and the Small Business Guide to YouTube were created with link buidling in mind and include embedded videos within each interactive flow chart. These are currently at 179 and 22 linking root domains respectivelyThe technical implementation required:If you’re building a multimedia webpage that can’t realistically be viewed through an iframe on another site, where you choose to host your video ultimately doesn’t matter.Your main focus should be making the content lightweight, quick to load, and mobile friendly. Therefore, either using the HTML5 <video> tag to display video or embedding all videos through iframes is normally the best way to go, though many other JavaScript-focused implementations are also fine. JavaScript libraries such as popcorn.js can help you do some really cool things with embedded video, such as changing the way pages look based on playback time.2. Using video as link baitThe kind of content you need:Things that go viral socially don’t actually correlate all that well with things that get lots of high quality, equity-passing links. This is because there is a subtle difference between the kind of things you’re happy to share socially and the kind of things you’re happy to include on your own site through embeds/referring links. If someone embeds your video on their site — it has to be because they want their readers to stop looking at their own content and spend time watching yours instead.If your explicit goal is to get people to embed and link to your video content, Dollar Shave Club or Old Spice should not be the standards you aspire to. Instead, you should be looking to create something that provides value for a specific target demographic and the content must be informative, entertaining and succinct.In many instances, this ends up looking something like a video infographic. A great example of this done successfully of late is from CCN, who created an excellent piece on relative salaries which has accrued 43 linking root domains.The technical implementation required:When people embed videos from YouTube, Vimeo, or any other social video platforms, they don’t typically link to the domain of the creator in the process, but instead, the profile of the user on the YouTube/Vimeo domains. This is fantastic for the platforms themselves, but clearly sub-optimal for any business trying to do SEO and build links back to their site in order to improve rankings. While these social video platforms are a fantastic way to seed your content and get it in front of a wider audience, you don’t want the likes of YouTube taking your link equity.Therefore, if you’re creating video link bait — you should (at least during your initial period of outreach) ensure the version of the video embedded on your site is seen as the de facto “canonical” by self-hosting or hosting with a paid third-party online video hosting provider.I’ve been lucky enough to try out all of the providers below:To save you the hassle of research, I’d estimate that in 90% of circumstances, Wistia is by far the best solution (unless you’re a large media house looking to serve advertising off your embedded videos, in which case you should look at Brightcove). Wistia has the best tool available for marketers and offers it at an extremely reasonable price. (Note: I’m not being paid or otherwise compensated by Wistia for saying that; I’m just saying it because right now it’s true. If any other online video platform starts outperforming Wistia in terms of their offering, I’ll be sure to let you know.)After you’ve set up your hosting, you need to ensure that you embed your video in such a way that anyone who clicks an “embed this video” button is given an embed code which will feature a referring href attribution link to the appropriate page on your site where the video lives.Unfortunately, no online video provider currently offers this as a standard feature (although I know this is in the pipeline for Wistia), so for now, this means you’ll need to manually customise the embed codes for videos you’re trying to use as link bait.I have a built a tool which will automate this process for you. The “With textarea in textarea” option is what you should choose for the embed on your own site, while the “without double textarea” is the option you should choose when putting together an embed code to send to outreach prospects.3. Build links off the back of your YouTube presenceThe kind of content you need:While marketers should think of YouTube primarily as a network for increasing brand awareness, if you have videos with a viral/social element that are also likely to generate a number of links, then YouTube can be a useful platform to generate leads for link building.The technical implementation required:Anyone who embeds a YouTube video of yours should be seen as a really solid link prospect, as they’ve essentially already linked to your content. Oftentimes, a gracious and thankful outreach email to anyone who does embed your YouTube videos can be a great way to both build relationships and convert those YouTube embeds into links back to your own site rather than to youtube.com. One angle I particularly like to use when reaching out is suggesting that sites “swap the YouTube video embed for a high quality HD embed that doesn’t include ads,” and then providing them with an alternative, securely hosted video iframe embed which includes a followed attribution link underneath the video. To work out who has previously embedded or linked to your YouTube videos, you can use a combination of YouTube Analytics and Open Site Explorer. The video below runs through the process of finding out where your videos have been embedded:From here, you should also put the following URL variations through Open Site Explorer to find out where your video has been linked to but not embedded (replace the ID string with your own):http://www.youtube.com/watch?v=dQw4w9WgXcQhttp://www.youtube.com/watch?v=dQw4w9WgXcQ&feature=player_embeddedhttp://www.youtube.com/watch?v=dQw4w9WgXcQ&feature=relatedNote — if your “link bait” videos have a social/viral element to them, you can put them on YouTube and follow the process above after your period of outreach with a securely hosted video (as detailed in the “using video as link bait” section).If you have access to a significant budget for promotion and outreach, paying for viral seeding can be a useful way to generate further link prospects from your YouTube videos. I recommend using Unruly Media for such a service.4. Advertise your content library and permission assetsEveryone hates YouTube ads. The meme above got 1597 upvotes on Reddit and hit the front page, which is more or less proof of objective fact in internet terms.However, I think this opinion is so widely held not because YouTube ads necessarily suck, but because online video advertising is still a young industry that has yet to mature. The majority of larger companies place their TV adverts on YouTube and pay for seeding, rather than bothering to create content specifically for the platform and target a specific audience accordingly.One way in which YouTube ads could be more effective is by advertising a free content library or permission asset — like an email list — rather than a specific product or service that costs money.This way, you can improve visibility of the content in which you’ve already invested and hopefully build additional second-order links to it through this increased awareness.The kind of content you need:YouTube ads can be as long as you like, but users will always have the option of clicking away 5, 15, or 30 seconds into the playback (dependent on the specific ad placement). Therefore, you essentially need to grab the attention and interest of the audience within the first 5 seconds, and then effectively communicate the core message to entice clicks by the 15 and 30 second marks. Put simply, your videos will need to sell the virtues of your content quickly, efficiently, and in an entertaining way.The technical implementation required:Export your content with the appropriate settings and upload to YouTube. From there, you’ll need to tie your AdWords to your YouTube account and then begin defining the target audience to which you want to advertise.5. Use video to improve and augment page typesThere is some evidence to suggest that by simply using video to improve the quality of your commercially focused pages, you are likely to generate more natural links across the board.Check out the screenshots from the Majestic Historic Index below for appliances online and Zappos — sites that have both invested heavily in product video to improve their page types:Zappos.com:appliancesonline.co.uk:The kind of content you need:To a greater or lesser extent, what we’re talking about here is product videos - i.e. videos created to provide information on a specific product or service.Product videos are most effective when they take an audience member from a place of initial interest further down the path toward conversion by engaging on a personal level with the likely questions and concerns of the interested party. These videos should be mostly informational rather than promotional, more “shopping channel” than “TV ad.”The technical implementation required:If you’re creating videos to improve and augment specific pages on your site — e.g. videos for specific products — then these videos should always be either self-hosted or securely hosted using a third-party provider (e.g. Wistia) as mentioned previously.This is because these videos will likely only make sense within the context of the pages for which they’re created, and therefore won’t provide much value for an audience finding your content through YouTube search or recommendations. Additionally, by hosting such content on YouTube, you can risk your site being outranked by the instance of the video on youtube.com for branded queries relating to the specific product or service covered in the video. For more information on this problem, check out my post on building a video SEO strategy.For this kind of content, you should also be trying to get video rich snippets in order to drive more clicks from the search results pages. This can be achieved either through implementing schema.org mark-up, or by submitting a video XML sitemap. See here for more information on implementation.6. Support your blogging strategyThe kind of content you need:Video for blogs should be primarily informational with reasonably soft branding. “Talking head” videos are perfect for this and if you have the resources, supplementing the footage with screencasts and/or animated graphics is often a nice way to break up the flow and provide interest.In order to make it scalable and require minimal editing, I’d normally recommend trying to do these videos in one take with minimal scripting prior to recording the content. Watch the video from Wistia feat. MC Fishkin which explains exactly how Moz manages its creative process to scale the creation of Whiteboard Friday videos with minimal effort.The technical implementation required:The hosting for your blogging videos should be determined by the answers to a couple of questions.1. Which is more important to you - greatest possible exposure to your content or individuals only viewing the content in the context of your own site?The two are fundamentally dichotomous. If you want maximum exposure, your content should be hosted on YouTube, where it will rank well in the search results (normally those for youtube.com, not for your site) and also be visible throughout the YouTube platform. If you want users to only add comments on your site, within your community framework as opposed to YouTube’s; or are keen to re-target visitors with PPC, then self hosting will be the more appropriate option for you.2. Is there any search volume on YouTube for the topics you are covering?This can be worked out using the YouTube Keyword Tool. Be advised that data from the YouTube keyword tool is fairly inaccurate, but the relative indicators of search volume should give you a pretty good feel for whether there is any demand for the content you will be creating. If there is search volume, that’s fantastic and your videos will likely get some good traction on the YouTube platform should you wish to host there. If there’s no search volume, then having your videos on YouTube likely won’t provide much additional value for you. If the latter is true, you’ll always be better off self-hosting your videos (or using a secure third-party solution as explained previously), since this way you can drive all traffic to your own site rather than to youtube.com.You generally shouldn’t think about doing both. If you decide to self-host your content and also put it on YouTube, this strategy just gives individuals the option of viewing and linking to content on YouTube rather than your own site, while failing to undertake the primary activity that will help boost your YouTube rankings — namely, embedding your YouTube videos and driving views through those embeds. Rather than giving you best of both worlds, it can actually give you the worst of both worlds.7. Create video content for other sitesVideo content can get you top-tier guest posts and linking opportunities. If you’re able to show a proven history of creating valuable and interesting video content for your own site and others, pitching for guest-post opportunities on top sites becomes so much easier than the standard cold approach.The kind of content you need:In many ways, the kind of content you’d use to guest post will have a very similar form factor to the kind of video you’d normally include on your own blog — mostly “talking head\" focused.Interviews of your customers/authorities in your industry often work really well here, because the videos can also act as ego bait. If you can make an individual look really professional on camera in a way they would be unable to do themselves, it can be really easy to get some great links from them for doing so.If you have the resources or skills, you can also create product videos for commercial partners or build ads for content created by others (someone did this for Distilled, for free, and you can bet I gave them a few links).The technical implementation required:Ultimately, as long as you get a link, the way in which a video is embedded on someone else's site shouldn’t matter to you.However, if the target in question is not particularly amenable to linking out to you, one of the best ways to encourage them is to only provide the webmaster with an embed code for the content, rather than the raw video file. This means securely hosting the content with a platform like Wistia, enabling domain restrictions and then including a text link back to your site at the end of the embed code (as covered above in Idea 2, using video as link bait). In the vast majority of instances, webmasters won’t bother to tweak the embed code and remove the link, whereas if they take the embed code themselves from the instance of the video on a social platform (YouTube/ Vimeo etc.), the embed code will not include an attribution link back to your site with it as standard.8. Build a content series for social video platformsBlip.tv and dailymotion.com will give you really high authority (DA93 and DA97), followed profile links if you can a get content series accepted onto the platform and with the relevant user status.The kind of content you need:For both of these sites, you will need regularly publish content covering a specific theme that is completely non-branded or commercial in nature. You’ll also need to create different videos for each platform. There is a stringent editorial process to get accepted to either site, and unless your content is relevant to their target audiences, you won’t be granted the Dailymotion motionmaker status (which includes a followed link) or a blip.tv channel profile.Creating a content series specifically for a single link is obviously a huge investment in time and money, but remember that the benefit here will be brand awareness and hopefully referring traffic, too. If you’re in a particularly “tricky” niche to which it's difficult to build links, but you have a lot of expert knowledge within your company, this might be a useful technique for you to leverage.The technical implementation required:None. You just need to ensure your content is exported in 16:9 at a decent frame size (I normally recommend 1280x720 HD) and uploaded to the respective platform.9. Boost PR efforts with video news releasesThe kind of content you need:The purpose of a video news release is to support a press release with ancillary information that gives further context around the story in question.Video news releases are a particularly useful asset for any PR campaign, since they allow your story to make it to the top of a journalist's pile. Reporters don’t always have the time to write up articles for every interesting pitch, but with a video release you’re essentially doing half the work for them. All editors need to do with a VNR is put together a supporting paragraph, embed the video and then click publish.The technical implementation required:Video news releases should always be hosted on YouTube, since the majority of sites are comfortable with embedding YouTube videos on their site and know how to get an embed code from a video on youtube.comThe best practice is just to include a link to the YouTube instance of the video within your initial outreach email. If your contact gets back to you in a positive way regarding the story, you can ask for a “credit link” for the video pointing back to your site.That's my nine!I hope you found this post useful! Do you have any other good ways to build links with video? If so, please do hit me up in the comments! I’d love to hear about any new ideas. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Leverage Investment in Video to Build More Links"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Leverage Investment in Video to Build More Links"
    },
    {
      "level": "H2",
      "text": "1. Using video as a media type within interactive content"
    },
    {
      "level": "H4",
      "text": "The kind of content you need:"
    },
    {
      "level": "H4",
      "text": "The technical implementation required:"
    },
    {
      "level": "H2",
      "text": "2. Using video as link bait"
    },
    {
      "level": "H4",
      "text": "The kind of content you need:"
    },
    {
      "level": "H4",
      "text": "The technical implementation required:"
    },
    {
      "level": "H2",
      "text": "3. Build links off the back of your YouTube presence"
    },
    {
      "level": "H4",
      "text": "The kind of content you need:"
    },
    {
      "level": "H4",
      "text": "The technical implementation required:"
    },
    {
      "level": "H2",
      "text": "4. Advertise your content library and permission assets"
    },
    {
      "level": "H4",
      "text": "The kind of content you need:"
    },
    {
      "level": "H4",
      "text": "The technical implementation required:"
    },
    {
      "level": "H2",
      "text": "5. Use video to improve and augment page types"
    },
    {
      "level": "H4",
      "text": "The kind of content you need:"
    },
    {
      "level": "H4",
      "text": "The technical implementation required:"
    },
    {
      "level": "H2",
      "text": "6. Support your blogging strategy"
    },
    {
      "level": "H4",
      "text": "The kind of content you need:"
    },
    {
      "level": "H4",
      "text": "The technical implementation required:"
    },
    {
      "level": "H2",
      "text": "7. Create video content for other sites"
    },
    {
      "level": "H4",
      "text": "The technical implementation required:"
    },
    {
      "level": "H2",
      "text": "8. Build a content series for social video platforms"
    },
    {
      "level": "H4",
      "text": "The kind of content you need:"
    },
    {
      "level": "H4",
      "text": "The technical implementation required:"
    },
    {
      "level": "H2",
      "text": "9. Boost PR efforts with video news releases"
    },
    {
      "level": "H4",
      "text": "The kind of content you need:"
    },
    {
      "level": "H4",
      "text": "The technical implementation required:"
    },
    {
      "level": "H2",
      "text": "That's my nine!"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Phil Nottingham\n          \n            Phil Nottingham\n          \n            Phil Nottingham"
}