{
  "url": "https://moz.com/blog/how-much-do-you-know-about-use-yahoos-site-explorer-and-link-research",
  "slug": "how-much-do-you-know-about-use-yahoos-site-explorer-and-link-research",
  "title": "How Much Do You Know About / Use Yahoo!'s Site Explorer and Link Data - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Yahoo!, through both Site Explorer and their advanced link search operators, provides the most robust link data currently available on the web. Despite this offering, and in spite of some excellent blog posts and resources on this subject (1, 2, ...",
  "content": "How Much Do You Know About / Use Yahoo!'s Site Explorer and Link Data SEO Tools By: Rand Fishkin August 12, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 12, 2008 How Much Do You Know About / Use Yahoo!'s Site Explorer and Link Data SEO Tools The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Yahoo!, through both Site Explorer and their advanced link search operators, provides the most robust link data currently available on the web. Despite this offering, and in spite of some excellent blog posts and resources on this subject (1, 2, 3), it seems that not everyone doing SEO professionally is familiar with how to use Yahoo!'s data to the fullest extent. Even worse, we might not all be aware of how critical it is to measure, quantify and review links. This post is going to take a stab at solving some of these issues and determining if there's more that needs to be done. Let's start with a quick poll: How Important is / How Much Do You Use Yahoo!'s Link Data ( surveys) Now that you've voted, let's explore what Yahoo! offers in terms of link data. To start with, they've got two ways of accessing links - via Site Explorer, which provides a unique interface for browsing link data, and the normal web search engine, which lets you apply many more advanced parameters and modifiers to your link-based queries. Yahoo! Site Explorer: There's only a few basic features here, which includes the ability to see: A list of links that point to a given URL A list of links that point to a given fully-qualified domain (e.g., southernfood.about.com, www.seomoz.org, or reddit.com) A list of links that point to a given pay-level domain (e.g., *.about.com, *.seomoz.org, or *.reddit.com - including all their respective subdomains) A modifier that removes links coming from internal pages, either on the fully-qualified or pay-level domain Using Site Explorer is simple - just enter a given URL and go (or type a standard link or linkdomain search query into Yahoo! Search and you'll be re-directed). You'll be given options to modify the domain parameters and exclusions in the results. Yahoo! Site Explorer Link Search for NBCOlympics.com The biggest weakness is the tragic lack of crucial data pieces, including: Ordering - the links are given in \"no particular order\" according to Yahoo!'s public representatives, though SEOs generally believe that they tend to show more important links before less important links (but certainly not in order from most to least valuable/popular/important/etc) Nofollow Included - in a tragic move, nofollow'd links are included in the list with follow'd links, and no differentiation exists between the two, forcing SEOs to do their own research page by page to find which links the engines might actually be counting. Target URL - unless you choose link to only a given URL, you don't get to see which page on a domain/subdomain a particular link points to Anchor text - no anchor text is provided to show the linking term/phrase/alt tag that pointed to the page Importance metrics - no indication of how valuable/important a particular link or domain might be is provided. Obviously, Google's PageRank would be a strange one to show here, but Yahoo! used to have their own link graph based value - webrank - which was quickly discontinued (way back in 2004, I believe) Despite these weaknesses, it's at least valuable for browsing through a site's links and attempting to get rough information on the types of sites and pages pointing to the URL/domain. If you want more, you can always click through to each individual link for some of this additional data (though this is a time-consuming process). Yahoo! Search: Despite the fact that Site Explorer is meant to be the flagship link searching product, Yahoo!'s normal query system actually provides far greater functionality. This includes the ability to get: A list of links to individual pages or entire domains (link:http://www.yourdomain.tld) or (linkdomain:yourdomain.tld) Lists that exclude pages from certain domains (-site:domainx.com) or (-site:.co.uk) Lists that exclude pages with certain keywords (-keyword) or (-intitle:keyword) or (-intext:keyword) Lists that exclude pages/domains with certain attributes (-inurl:keyword) Lists refined to certain domain extensions (site:com.tr) Lists refined by geographic region (region:europe) Lists refined by keyword inclusion (+keyword) or (intext:keyword) or (intitle:keyword) Lists of pages that contain links to other pages or domains (linkdomain:domainx.com, linkdomain:domainy.com) For a full list of these modifiers and how to apply, I recommend Ann Smarty's brilliant post at SEJournal - Advanced Link Operators to Explore Your Competitor's Backlinks. Using Yahoo! Search to explore links requires modifying the standard link queries. If you simply use a query structure like \"linkdomain:nbcolympics.com\" (to see links to a domain) or \"link:http://www.nbcolympics.com\" (to see links to an individual page), you'll be redirected to Site Explorer. You need to combine these queries with additional parameters in order to get data from Yahoo! Search. Yahoo! Search query for links pointing to NBCOlympics.com that contain \"Beijing\" in the URL The weaknesses here are the same as those for Site Explorer - no link targets, no anchor text, no importance metrics. I won't completely re-hash, but the only real advantage over Site Explorer is the ability to refine the query, and the only weakness (from Y!SE) is the lack of a TSV export function. How I Use Yahoo!'s Link Data: To me, links are a fundamental part of SEO, and inseparable from the optimization and analysis process. Since Yahoo!'s data is the most consistent and valuable currently available (as Google made their link query useless in 2003 and MSN disabled theirs earlier this year), I'm a very heavy user for tasks like: Determining the approximate number and strength of a site's links (to help uncover what role link strength/weakness is playing in rankings & search traffic) Tracking relative link growth/shrinkage over time (this is why our SEO Analytics tracks both Yahoo! & Yahoo! Site Explorer numbers) Uncovering links that could be causing potential problems (paid links, spammed links, low quality, etc.) or drops in rankings (not necessarily because they made a site fall just by existing, but because their value might be removed) Finding links that point to 404'ing pages Determining the relative link popularity of a given page on a site compared to others Investigating the links to a domain or page we're considering getting a link from Finding links to competitors that outrank a client for potential acquisition Finding links that point with less than ideal anchor text that we can request modifications to Researching a site's internal link structure to find problems or opportunities Checking links between link partners or multiple sites owned by an entity Probably 100s more (seriously, I'm in there 3X a day or more when doing SEO stuff) Some questions: How do you employ Yahoo! Site Explorer and Yahoo! link searches? What tasks do you complete with this data? What features are sorely missing (or poorly implemented)? What do you think Yahoo! gets out of Site Explorer? (Don't get me wrong, I love it; I just don't get the business case) Since it's such a critical tool for me, I'm fascinated to know how others leverage the service. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Much Do You Know About / Use Yahoo!'s Site Explorer and Link Data"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Much Do You Know About / Use Yahoo!'s Site Explorer and Link Data"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}