{
  "url": "https://moz.com/blog/how-to-respond-to-a-subpoena-for-user-information",
  "slug": "how-to-respond-to-a-subpoena-for-user-information",
  "title": "How to Respond to a Subpoena for User Information - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If you have a site that includes user-generated content, you may one day receive a subpoena asking you for personally identifying information about your users. Receiving a subpoena can be intimidating and you often don't have a lot of time to respond. This post is designed to give you some…",
  "content": "How to Respond to a Subpoena for User Information E-Commerce SEO By: Sarah Bird November 3, 2008 Table of Contents Copied! By: Sarah Bird November 3, 2008 How to Respond to a Subpoena for User Information E-Commerce SEO May It Please the Mozzers, I sincerely hope no one reading this ever needs this information. However, I have been asked privately for advice on this topic by industry folks so I thought I'd write a quick post on the topic. If you have a site that includes user-generated content, you may one day receive a subpoena asking you for personally identifying information about your users. Receiving a subpoena can be intimidating and you often don't have a lot of time to respond. This post is designed to give you some high-level steps to follow. 1. Make Sure It's Actually a Subpoena If it includes the word \"subpoena\" and the name of a court in the header, and asks you to provide documents or testimony at a certain date and time, then it's probably a subpoena. If it includes the words \"warrant,\" then you have fewer and different options about how to respond. Call your attorney right away if you're presented with a warrant and keep a list of documents/articles searched and/or seized. If it doesn't include the words \"subpoena\" or \"warrant\" in the title, then it's probably just a cease and desist letter. Cease and desist letters are still important to pay attention to, but they don't have the force of a court of law behind them. How to respond to a cease and desist letter entirely depends on your individual circumstances and is beyond the scope of this post. 2. Determine the Information Being Requested Usually, a subpoena includes a request for certain documents or information. Read the document carefully to determine what the litigating party wants from you. Sometimes a subpoena only requests your testimony and sometimes it requests both documents and testimony. After you know what kind of information is being sought, you can decide whom you need to notify, if anyone, and whether you should object to the subpoena. 3. Objecting to a Subpoena Ignoring a subpoena is risky and you should probably consult an attorney before doing so. If you ignore the subpoena and you don't file an objection with the Court, you may be ordered to pay expensive legal fees. In very, very rare cases, people have gone to jail for failure to comply with subpoenas. If you want to object to the subpoena, you need to file a document called a \"Motion to Quash\" with the Court. After reviewing your Motion and the litigant's response to it, a judge will decide whether you have to comply with the subpoena and how. He may cancel it altogether, or merely limit the amount and type of information you must supply. Here is a list of issues to consider if you are thinking about objecting to or ignoring a subpoena: Does the court issuing the subpoena have authority to compel you to respond to the subpoena? First of all, it is important to realize that most subpoenas are not filed with the court or signed by a judge before they are sent out. Attorneys, as officers of the court, are authorized to send subpoenas without getting prior court approval. The court only steps in if there is a problem or concern and only if asked. Although attorneys can send subpoenas, they only have as much authority as the court administering the lawsuit. If the court doesn't have jurisdiction or authority to send you a subpoena, then neither does the attorney who issued it. Generally courts lack the jurisdiction to compel individuals/companies located out-of-state. Thus, a person served a subpoena in Washington by an out-of-state court is generally not bound to appear or turn over documents. The out-of-state litigant must ask the Washington courts to issue a subpoena to the Washington resident. There is an important exception: for federal criminal subpoenas, there are no jurisdictional restrictions. If you think that the court issuing the subpoena may not have jurisdiction over you, contact your attorney. You can decide together whether you should ignore the subpoena because the court lacks jurisdiction. Were you properly 'served'? There are strict rules about how subpoenas can be delivered. The law requires that you receive (were \"served\") with the subpoena in a specified way. If you aren't properly served, then the subpoena is invalid and you don't have to comply with it or file a Motion to Quash. Service requirements vary according to jurisdiction and the subject is too complicated to address in this blog post. Typically, service must either be in person or by certified mail. If you have doubts, you should consult with an attorney to see if service was proper. However, lack of service isn't usually a strong objection; eventually the litigant will find a way to serve you properly if he or she really wants you to respond. On the other hand, if the litigant was just trying to intimidate you by improperly sending you a subpoena, your failure to respond is often the end of the dispute. Thus, if you are certain that you were not served properly and you're also reasonably certain the litigant won't go through the trouble of properly serving you in the future, you may ignore the subpoena. Talk with your attorney before deciding to ignore any subpoena. Notify the people whose information is being requested so they have the opportunity to object. The subpoena probably requests that you provide the litigant information about one or more of your anonymous users. Litigants usually want to know IP addresses, real names, email addresses or any other potentially personally identifying information. You, your users, or both can challenge the subpoena by filing a Motion to Quash. While you may not want to spend the time and money to object to a subpoena, your users might want to. Give your users the chance to object to the subpoena by notifying them. It is likely that the only way they will find out about the subpoena is if you tell them about it. It's true that in some states and in some circumstances, you may not have a legal obligation to notify users. However, it's a good thing to do anyway. Your users have a limited right to anonymous speech and the best thing to do is to give them the opportunity to protect that right. When you receive a subpoena, it may include a cover letter accusing your users of terrible things. You may feel sympathy for the alleged victim. That's only natural. However, there are usually two sides to every story. Treat your users fairly by giving them the opportunity to tell their version of events to a judge. While there is no single, universal test, judges often consider the following factors when deciding whether to cancel or limit a subpoena for potentially personally identifying information: Has the person bringing the lawsuit shown that he has viable legal claims? Does the subpoena request specific information, or broad and potentially voluminous information? Are there other ways for the litigant to get the information that don't require compromising someone's anonymous speech rights? Did the litigant make any attempt to notify the anonymous target of the subpoena? How badly does the litigant need the information? If you can raise legitimate concerns about any of these factors, then you may have a basis to challenge the subpoena. If the date and time is merely inconvenient, call the attorney who sent you the information. If you object to the subpoena merely because the date and time is inconvenient, call the attorney who sent the subpoena and ask for a new, mutually convenient time. If you demonstrate that you are willing to cooperate and the attorney isn't in a time bind based on other deadlines, the attorney will usually comply with reasonable scheduling requests. You usually don't need to go to court in order to resolve simple problems like these. Keeping the lines of communication open will help resolve issues. The subpoena is asking for so much information and it would be extremely burdensome to gather all the data and comply with the subpoena. You may be able to object to the subpoena if it is \"oppressive or unreasonable.\" If the litigant is requesting vast amounts of information, or information that would be very difficult to get and of little value, your attorney may be able to persuade the judge to modify the subpoena. The judge may limit the amount or type of information to be gathered. This involves filing documents with the courts so it is best if you get an attorneys' assistance. Revisit your privacy policy and terms of service prior to acting. Prior to deciding whether to respond or to notify your users, revisit your privacy policy and terms of service. If the policy and/or agreement states that you will provide notice to users, then you must do so. Double check to see if your privacy policy and/or terms of service permit you to turn over private information in order to comply with lawful subpoenas. If you promised never to share personally identifiable information, then you may be legally obligated by that promise to fight the subpoena. Don't be afraid to oppose a subpoena. Remember, judges don't usually review the substance of a subpoena before an attorney sends it out. You should take a subpoena seriously, but you don't have to cave in just because it is written in fancy legalese. Again, I hope you never have to use the information in the post, but in this litigious, web.20 world such subpoenas are increasingly prevalent. I hope you're now a little more prepared to handle the situation if it happens to you. Best Regards, Sarah Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Respond to a Subpoena for User Information"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Respond to a Subpoena for User Information"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Common Mistakes E-commerce Websites Make Using JavaScript"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sarah Bird\n          \n            Sarah Bird\n          \n            Sarah Bird"
}