{
  "url": "https://moz.com/blog/how-to-pitch-seo-to-potential-clients-and-employers-whiteboard-friday",
  "slug": "how-to-pitch-seo-to-potential-clients-and-employers-whiteboard-friday",
  "title": "How to Pitch SEO to Potential Clients and Employers - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": " In this week's Whiteboard Friday I talk about pitching SEO to potential clients and employers. This post describes the common elements that unite the successful pitches I have witnessed and describes how you can use them to your advantage. Also, I shaved my beard and now look like a 12-year-old…",
  "content": "How to Pitch SEO to Potential Clients and Employers Whiteboard Friday By: Danny Dover August 12, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Danny Dover August 12, 2010 How to Pitch SEO to Potential Clients and Employers Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In this week's Whiteboard Friday I talk about pitching SEO to potential clients and employers. This post describes the common elements that unite the successful pitches I have witnessed and describes how you can use them to your advantage. Also, I shaved my beard and now look like a 12-year-old boy. (I don't recommend that as a pitch tactic.) Video Transcription Hello, Mozzers. My name is Danny Dover. I do SEO here at SEOmoz. Today for Whiteboard Friday, I'm going to tell you about something that I think is extremely important, and you should, too. Pitching SEO. By pitching SEO, I mean presenting the idea of SEO to either potential clients or to potential employers. So when I am giving this pitch, I have a few key points I make, and then I'm going to go through a couple of rebuttals that people usually make back to me. The first key point that I make, and I always, always do this because it is very important, is to acknowledge the snake oil salesman. SEO is an industry where there are a lot of people who just kind of suck. They do a very poor job of service and it makes the entire industry look bad. So, you need to acknowledge those people exist so that the person who is hearing the pitch takes into consideration what you are saying. You're acknowledging that, yes, they are correct. But there is also this alternative that they might now know about. My favorite way of doing this is you just acknowledge it and then explain why, what proof you have to show that is not how you do your service, be it past clients or testimonials or actual data you can show from your results. I prefer the latter if possible. Number two. Strategies are easy but tactics are hard. A lot of times when I am explaining SEO, I will come into contact with someone who is like, \"Oh, yeah, I get it. You've got to build links and content.\" They're absolutely right. That's correct. That's what you have to do. But what they are talking about are strategies. Bigger ideas. Building content, that is just a broad idea. The actual content you write and the way you do it and the way it is formatted, those are tactics. In SEO, I think that the strategies are easy. They are easy to comprehend. They're big and they make intuitive sense. But the tactics are hard. My favorite example of this is URL rewrites. The idea is yes, we're going to make all the URLs go from here to here. It turns out that doing that can be very, very troublesome, and you run into lots and lots of side cases just like anything you do with programming. So, I always try to acknowledge that yes, the strategies are easy, but you are going to probably want a specialist so that you make sure you nail all your tactics. Number three. PPC and SEO equals the top of the conversion funnel. To be completely honest, there are other things at the top of the conversion funnel as well. There's email. There's direct traffic. There are lots of other things. The two that I focus on are PPC and SEO. PPC is pay per click, which is the ads you pay for in search engines and elsewhere and SEO being search engine optimization, of course. These are both tops of the funnel. So, you can either chose to pay on an ongoing basis for PPC and get some traffic that way, or you can do it through SEO and if you adhere to best practices, it can be free for you. Just learn how to do it once, continue with the best practices, and it costs you no money. The nice thing about this is that, while 90% of budgets go to PPC, only 10% of clicks go there. The reverse of that is only 10% of budgets approximately go to SEO, but 90% of clicks from users are going to organic results and search engines. Huge opportunity here and if you do it right, it won't cost you a dime. The next one, rebuttals. When I am giving this pitch, there are a couple of responses I get from people that I think are very genuine and they make a lot of sense. These are the rebuttals they give, and then how I help deconstruct that a little bit. The first one being SEO takes too long. They are absolutely right. SEO does take a long time. The way I break down SEO in my head is into popularity, which is links, and relevancy, which is onsite, although there is an element of links in that too. I'll write a little bit more about this in the blog post below. The idea being that SEO takes too long. That's true, but not for on page. If you want to just do on page optimizations, you can have a lot of opportunity to boost traffic quickly. Just do on page to start with. Another trick like that is just installing a site map if they don't have one. I've seen that this is easy to do. You can have an automated generator do it. Submit it to the engines, and within a week or so you'll see results on that assuming they've never had one before and other variables are not acting awry. Number two, it will happen organically. This is one of my favorites. People will say, \"Oh yeah, we're building links anyway. There's variety in our content. We have professional writers. So it's just going to happen organically.\" That is not true. I thought the same thing with my dating life. Yeah, it will just happen organically. No, it's not happened organically. Same thing with SEO. You can try to do all these things, but unless you have some focus, some actual goals, and some plans, it's just not going to happen. Search engine optimization, you're not optimizing anything. You're just letting it happen. So by putting in just a little bit extra effort, you can get a lot more results. That's usually what I use there. The last one is, \"I'm too busy.\" That's something I can totally understand. Learning SEO is a complicated process. But, it turns out you can have other people do this for you. If you are trading it for money, you can just pay someone to do a little bit on it, SEO for you, do an SEO audit, and give you some recommendations. Or you can trade, you can do some bartering or something else. You can just make it happen. So, yes, being busy is an excuse, but not with the potential there is to make a lot of money with SEO and a lot of conversion on that. That's all the time I've got today. I appreciate all of you paying attention, or some of you. Not that guy. I appreciate it, and I'll talk to you next week. Bye. Video transcription by SpeechPad.com Tweet If you have any other advice that you think is worth sharing, feel free to post it in the comments. This post is very much a work in progress. As always, feel free to e-mail me if you have any suggestions on how I can make my posts more useful. All of my contact information is available on my SEOmoz profile under Danny. Thanks! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Pitch SEO to Potential Clients and Employers"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Pitch SEO to Potential Clients and Employers"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Danny Dover\n          \n            Danny Dover\n          \n            Danny Dover"
}