{
  "url": "https://moz.com/blog/how-to-make-your-seo-real-seo",
  "slug": "how-to-make-your-seo-real-seo",
  "title": "How To Make Your SEO - REAL SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Online marketers are anxious to see how the recently announced Google Penguin 2.0 update will impact their website marketing. For people who don’t closely follow Google’s algorithm updates, Penguin updates look for unnatural link patterns that might be a signal of inappropriate SEO tactics. In my…",
  "content": "How To Make Your SEO - REAL SEO Advanced SEO By: Chad Hill June 13, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Chad Hill June 13, 2013 How To Make Your SEO - REAL SEO Advanced SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Online marketers are anxious to see how the recently announced Google Penguin 2.0 update will impact their website marketing. For people who don’t closely follow Google’s algorithm updates, Penguin updates look for unnatural link patterns that might be a signal of inappropriate SEO tactics. In my opinion, the guidance that Google provides around big updates is vague and difficult to interpret. As a result, many bloggers fan the flames by being deliberately provocative, trying to create a sense of panic and alarm to get attention. Creating panic around a Google update is pretty easy to do. I’ve been following the Google updates since the very first one and my answer to Google Penguin is what I like to call REAL SEO. I chose “REAL SEO” because real content is what Google wants, and SEO people love acronyms! No fear or panic needed with REAL SEO, just practical advice. R is for Research All SEO projects should start with research and not just keyword research. Jamming unnatural keywords like “pain free dentist in springfield” into your written content is no longer a tolerable SEO tactic. The aim is to produce content that is genuinely useful to the audience. REAL SEO research considers both keywords and the audience. There are several keyword tools that you can use, the easiest of which is the Google Adwords keyword tool. Make sure you select exact match when you run your keyword search. Your goal is to find keywords that are: Relevant to your business Suitable for the type of content you want to produce Have an interested audience as evidenced by the number of searches on the keyword Not so hot, in terms of competitiveness, that you have little chance of getting your message through the crowd of other online marketers. Research helps you build your editorial plan for content on your website and your promotional plan for attracting attention on other websites and social media. E is for End-user Value REAL SEO is all about creating content that others will appreciate and use. Use your keyword research, editorial plan and promotional plan to figure out what you can create that others haven’t. Of all the content on the web, how much do you think is horribly written or executed? Just because it’s been done doesn’t mean it’s been done well. It’s OK to look for inspiration from what’s already out there and do it better. A few suggestions: Content Types: Articles Blogs Newsjacking Whitepapers or Guides Infographics Videos Podcasts Press releases Engagement in forums Approach: Opinion Controversy Help and advice How-to Reviews Compare and contrast Humor Make sure you stay true to who you are. If you’re naturally funny, don’t be afraid to use humor in your content. If you aren’t, don’t. Write something controversial (controversial does not mean offensive), pose questions, ask for opinions, create a sense of urgency or alarm. Sometimes it’s OK to create a sense of alarm—just not about Google updates! A is for Analyze Analysis is a critical part of REAL SEO. There are three main places where you need to analyze: During the research phase – Once you have your keywords and themes, make sure you haven’t lost sight of your audience. It’s easy to get very focused on keywords and forget your goal of creating content that will be interesting to real people. During the content creation phase – Tune the content for audience and the search engines. Both are important. For audiences, make sure you have well-written and structured content. Use images if it is a blog post. For search engines, make sure your target keyword is present and that you include your meta data and rich snippets. After content is published and shared – Before Penguin, we could focus on search engine rankings and keyword referral data. Like it or not, changes to Google Analytics and Google’s crack down on search ranking data has limited these metrics. Who hasn’t been frustrated by seeing “keyword not provided” at the top of your analytics keyword data?! With REAL SEO we don’t have to rely on those limited metrics! We can analyze results by looking at these metrics in Google Analytics: The number of web pages that are getting traffic The length of time visitors stay on the website The call to action conversion rate L is for Launch After you’ve developed your content, you must execute a program that promotes that content across the web. A big part of launching a program is looking for ways to attract links to your website. Not easy of course, but a very important step for SEO. Google and Matt Cutts would have you believe that people link to websites out of the goodness of their hearts. That may be true for a very select number of very high profile websites, but the regular guys have to work a little harder and smarter. Here’s a list of ideas to help you launch your content and/or get your business mentioned on other sites: Guest Blog - Use resources like Blogger Link Up to get notified of guest blog opportunities. Technorati is also a good resource for finding niche blog sites with guest post opportunities. Contribute to articles - sign up for HARO (Help a Report Out) and engage with writers who will mention your business name and point to content on your site. Post on BizSugar - allows you to share links to interesting content, including information you’ve posted on your website and on other sites. Use social media to post links to websites where your content has been published. It’s OK to occasionally post links to your website but social media will do nothing for your business if all you do is promote content on your website. Use YouTube for videos - Video blogging is easier than you think. This infographic breaks it down for you: Email Marketing - Send a notice about your content to your email contacts and include a link to the content. The more places you share your content, the better chance you have of attracting backlinks. Real backlinks. The kind of natural link profile that Google loves! Conclusion As we face the latest big update to Google, we need to continue to evolve our practices so that the fear of substantial issues with our SEO can be reduced. It appears that businesses that were penalized by Penguin 2.0 hadn’t heeded the warnings from previous updates. I’m using my REAL SEO methodology to make sure that my team is clear on the new rules of SEO and understands how to improve what we do for our clients on a daily basis. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How To Make Your SEO - REAL SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How To Make Your SEO - REAL SEO"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Chad Hill\n          \n            Chad Hill"
}