{
  "url": "https://moz.com/blog/how-to-use-comparative-knowledge-of-links-mozrank",
  "slug": "how-to-use-comparative-knowledge-of-links-mozrank",
  "title": "How to Use Comparative Knowledge of Links and mozRank - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "One of my favorite, easy-to-use features in Linkscape is the ability to compare pages and domains side-by-side to see which ones have earned what relative quantities of links. For example, I was curious to see how people linked to SEOmoz (since we're on a .org and I see lots of links to .com).…",
  "content": "How to Use Comparative Knowledge of Links and mozRank SEO Tools By: Rand Fishkin October 7, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 7, 2008 How to Use Comparative Knowledge of Links and mozRank SEO Tools The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. One of my favorite, easy-to-use features in Linkscape is the ability to compare pages and domains side-by-side to see which ones have earned what relative quantities of links. For example, I was curious to see how people linked to SEOmoz (since we're on a .org and I see lots of links to .com). Linkscape to the rescue: Obviously, www.seomoz.org is the most linked-to and highest mozRank of the pages, but it's fascinating to see what percentage of folks link to seomoz.org (with no www) and to www.seomoz.com (which, thankfully, we own and redirect). I can then take a look at some more interesting data in the advanced report, specifically the number of unique domains pointing links at those different sites: (BTW - see how 7.79 is only 11.99% of 8.82? Crazy, but that's how the logarithmic scale works. Good to think about next time you're comparing mozRank or PageRank for URLs or domains) We'd be losing out on quite a bit of external link juice if we didn't own/redirect these domains properly. Furthermore, seeing those stats on the number of unique domains that actually sent the links is utterly fascinating (and something we've never had access to before). I think domain diversity of links is a phenomenal stat just on its own. There's another key application here that I've been leveraging on some client campaigns of late - the ability to check out multiple pages for a single domain and better judge how to use them for keyword targeting. I'll walk through the process I use: Step 1 - Run a query at Google for the keyword phrase + the site. For this example, I'll use link building site:seomoz.org. I can take that list of links and go to step 2... Step 2 - Plug them into Linkscape's Comparison: Step 3: Smack Self on Head - Seriously, it's like I've got dumb written all over me. Of course most external links point to the link building guide (an updated version is set to be re-released in the next 3 weeks, BTW!), and of course no one links to the blog category! If I had any brains at all, I would get my internal links (and all the mR I've built up there) lining up with my external links and point them at the link building guide. I'll bet I could get some much better rankings for the search phrase link building in the engines and probably drive a lot more high value traffic. Now obviously, this won't always be so simple to implement. For us, it's just a matter of adding more internal links to the guide and maybe changing the name of the blog category so we're not keyword cannibalizing. For your site, it might be a more involved process. Nonetheless, the power of comparing reliable, trustworthy link data is immense. I'm not at liberty to show the client site we recently used this on, but I know they're getting a lot of really high value, high converting traffic thanks to the data uncovered. BTW - I don't want to make it out that Linkscape is the only way to do this. Technically, you can do some of these processes (minus a few of the metrics and the domain diversity stuff) using advanced link queries at Yahoo!. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Use Comparative Knowledge of Links and mozRank"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Use Comparative Knowledge of Links and mozRank"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}