{
  "url": "https://moz.com/blog/how-to-improve-your-rankings-with-semantic-keyword-research",
  "slug": "how-to-improve-your-rankings-with-semantic-keyword-research",
  "title": "How to Improve Your Rankings with Semantic Keyword Research - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Don't forget about semantic keyword research to help you focus your content and and improve your rankings.",
  "content": "How to Improve Your Rankings with Semantic Keyword Research Keyword Research By: Neil Patel April 16, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Neil Patel April 16, 2012 How to Improve Your Rankings with Semantic Keyword Research Keyword Research The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. From Google’s Panda, Search Plus Your World and Venice updates, in the last year alone the SEO landscape has changed. And while that means your SEO strategy will change, too, there is one thing that remains the same…keywords. Keywords remain important to your content and link strategies. But there is one change coming down the Google pipeline that will change keywords…semantic search technology and the human element. What is semantic search? Basically, semantic search is technology that tries to determine what users mean when they type in a certain keyword. They explore the semantics of those words…or the meaning behind them. For example, if someone typed in “laptop” do they mean: That they want to buy a laptop? Have one repaired? Upgraded? Are they even talking about a computer, but something entirely different? In the real world most people don’t search with one keyword…additional keywords give additional clues. Even then search engines aren’t always right. Google guesses because all it has to go on are the keywords you enter into their engine. Semantic search will look at how those words relate to each other and look for clues on how you entered them…location being crucial. Say you used Google search on your smart phone to find “laptop repair.” Semantic search will recognize your location via your GPS on your phone and deliver you “laptop repair” results based on location. In other words, results related to “laptop repair + [your city].” How does this impact SEO? In your SEO campaigns semantic search means you will have to identify the right keywords based upon user intent in the real world…and then create content around those terms. This is where the semantic keyword research comes in. In the world of keyword research you simply sought out the keywords with the highest search volume. The meaning between your list of keywords and the content you created was equal. There was a one to one relationship. “SEO strategy tools” meant “SEO strategy tools.” In the semantic keyword world, you build a database of keywords that are full of meaning...”SEO strategy tools” could be used in four different contexts. Your job is to figure out how. What are the advantages of semantic keyword research? Having a database of semantic keywords to create high-converting blog posts is one advantage…but there are other benefits, like improved CTR and PPC optimization as Wordstream explained: Higher click-through rate – Whether it’s in your emails, landing pages, text ads or blog posts, highly-targeted semantic keywords will improve your CTR. When all these elements of the conversion funnel are aligned semantically…your results will go through the roof. Lower minimum bids – Higher relevance and targeted action with your content due to semantic keyword enhancements will lead to lower minimum bids on your PPC campaigns. Higher quality score – When you achieve high relevance around your semantic keywords…the search engines will reward your content with a high quality score that leads to better rankings. Tools you can use to find semantic keywords Employing a semantic keyword plan is crucial. But how do you come up with those keywords? Here are five approaches to use…including recommended tools. Using Google advanced search Google’s advanced search results provide a quick way to generate some semantic keywords. Just type in a query like “laptop discount codes” and click “Show search tools”: Then click “related searches”… …and then you’ll see all of the semantic terms for “laptop discount codes”: As you can see from the results above, when searchers think of “laptop discount codes” they are thinking in specific terms of a brand for the most part. In other words, the term “laptop” was changed into a brand…giving you semantic options. And don’t forget to use Google Instant for further ideas on keywords: By the way, all those keywords are completely different than what you got in the “related search.” Now let’s look at a reverse case of semantic keyword use. In this case we’ll look up the term “laptop repair”: “Laptop repair” is synonymous to screen repair, brand laptop repair and even different ways of looking at repair like “troubleshooting.” And this is where it gets interesting. Look at the Google Instant version of “laptop repair” and you see this: You get all the options related to location. Keep in mind that your job isn’t simply to scoop up all of these up. You have to decide what people are thinking when they search with these terms. In some cases it will be obvious…in others it won’t be so obvious. That’s what semantic keyword research is all about. You can refine your results with Google Insights for Search where you can narrow keywords down via categories, for instance. Semantic keyword research with bookmarking tags If you want to find out how some searchers think about keywords, examine how tags are used at social bookmarking sites like Delicious. Here’s a search on their database for my blog QuickSprout: As you can see, there are a total of 578 posts that have been bookmarked in Delicious. To examine the tags that people use to bookmark that content…in a sense, seeing how people are viewing the content and giving you an inside track to their mind…look at how people created “Stacks,” “Links” and “Related Tags.” You can perform the same process on new social bookmarking sites like Diigo, Pinterest and Licorize. Again, it’s important to think through how to use these keywords and not just scoop them up. Building a semantic keyword cloud through social monitoring tools Using social media monitoring tools to track the mentions of your brand is pretty common and an effective way to stay on top of the competition and conversation. Using these same tools for semantic keyword research is just as effective to build a cloud of keywords around a particular sentiment. For example, in Social Mention search a keyword you type in. Here I used “Virgin Atlantic.” Then you can get a quick look at the top keywords being used around the brand. Other social mention tools you can use to help you build a cloud of semantic keywords are TweetDeck, Raven Tool’s Social Monitor and Technorati. Optimizing semantic keywords around trends A great strategy to keep in front of the public and at the top of search engines is to optimize your semantic keywords around a trending topic. This means you have to keep your eyes on high-volume topics. Here are the tools to do that: Google Trends – This is the obvious place you should check first. Ice Rocket – Search the latest buzz on blogs through this search engine dedicated to blogs. While you will see what’s hot on the blogosphere…one thing you won’t see is any older posts. Trendrr TV – And if you want to keep on top of what’s hot on TV, then Trendrr is the place you need to look. TweetVolume – While it’s offline for the moment, sign up to be the first to use this powerful tool to see popular keywords and trends on Twitter. Gathering semantic keywords through social search When it comes to researching on the social web, the first place I always look for keyword ideas is TwitterSearch. The way to use it is to look up a keyword like “SEO strategies.” Then look at what people are tweeting about that keyword phrase: What you want to find is how people are using that term. So look at the words surrounding the keyword…and then decide how to use it to build your own semantic keywords. OpenBook – This site will let you see what people are sharing on Facebook. And just like Twitter Search, look at the context on how the keyword is used to determine query intent: Conclusion There are dozens of tools out there you can use to build a semantic keyword cloud. Hopefully you understand the approach that I’m recommending so that you can then apply these principles to other tools. Keep in mind that as much as semantic keyword research is about finding actual keywords you can use in your SEO campaigns…it’s just as much about building a complete profile of your target customer. And the better you can understand your target customer the better your campaign results will be! What other tools do you use to create semantic keyword groups? About the author: Neil Patel is the co-founder of KISSmetrics, an analytics provider that helps companies make better business decisions. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Improve Your Rankings with Semantic Keyword Research"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Improve Your Rankings with Semantic Keyword Research"
    },
    {
      "level": "H2",
      "text": "What is semantic search?"
    },
    {
      "level": "H2",
      "text": "How does this impact SEO?"
    },
    {
      "level": "H2",
      "text": "What are the advantages of semantic keyword research?"
    },
    {
      "level": "H2",
      "text": "Tools you can use to find semantic keywords"
    },
    {
      "level": "H3",
      "text": "Using Google advanced search"
    },
    {
      "level": "H3",
      "text": "Semantic keyword research with bookmarking tags"
    },
    {
      "level": "H3",
      "text": "Building a semantic keyword cloud through social monitoring tools"
    },
    {
      "level": "H3",
      "text": "Optimizing semantic keywords around trends"
    },
    {
      "level": "H3",
      "text": "Gathering semantic keywords through social search"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Neil Patel\n          \n            Neil Patel\n          \n            Neil Patel"
}