{
  "url": "https://moz.com/blog/how-to-stop-vbulletin-ruining-your-website",
  "slug": "how-to-stop-vbulletin-ruining-your-website",
  "title": "How to Stop vBulletin from Ruining Your Website - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In my opinion VBulletin is by far the best forum software but it can create some problems for your website.Most sites work very hard on creating good quality content but once they add a forum the site will attract a lot of user generated content and low value pages.The first thing you need to do is…",
  "content": "How to Stop vBulletin from Ruining Your Website On-page SEO P By: Patrick Altoft February 8, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! P By: Patrick Altoft February 8, 2007 How to Stop vBulletin from Ruining Your Website On-page SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. In my opinion, vBulletin is by far the best forum software, but it can create some problems for your website. Most sites work very hard on creating good quality content, but once they add a forum the site will attract a lot of user-generated content and low value pages. The first thing you need to do is make sure that your directory indexes are set in your htaccess file. This means that yoursite.com/forum will redirect to yoursite.com/forum/index.php, rather than just showing a page with a list of all the files. Make sure you do this for every single directory in your site. Secondly, you should use robots.txt to remove all the low quality pages. Here is the file you need to use: User-agent: *Disallow: /forums/archive/Disallow: /forums/admincp/Disallow: /forums/attachments/Disallow: /forums/calendar.phpDisallow: /forums/clientscript/Disallow: /forums/cpstyles/Disallow: /forums/customavatars/Disallow: /forums/customprofilepics/Disallow: /forums/faq.phpDisallow: /forums/images/Disallow: /forums/install/Disallow: /forums/includes/Disallow: /forums/login.phpDisallow: /forums/misc.phpDisallow: /forums/member.phpDisallow: /forums/modcp/Disallow: /forums/memberlist.phpDisallow: /forums/newreply.phpDisallow: /forums/newthread.phpDisallow: /forums/private.phpDisallow: /forums/register.phpDisallow: /forums/sendmessage.phpDisallow: /forums/signaturepics/Disallow: /forums/sendpm.phpDisallow: /forums/search.php Each website will only have enough trust to get a certain amount of pages indexed. Don't fill the index with low quality pages. Some people might want to index members profiles; that's fine. I just chose not to at the moment. To remove any pages already indexed, simply upload the robots.txt and visit the strangely hard to find and almost mythical Google Console. If you have any questions on how to implement these changes, please post in the comments. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Stop vBulletin from Ruining Your Website"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Stop vBulletin from Ruining Your Website"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Patrick Altoft\n          \n            Patrick Altoft"
}