{
  "url": "https://moz.com/blog/how-to-make-newsworthy-content-part-2",
  "slug": "how-to-make-newsworthy-content-part-2",
  "title": "How to Make Newsworthy Content: Part 2 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Content marketing expert Amanda Milligan is back with three more ways to make your content more newsworthy.",
  "content": "How to Make Newsworthy Content: Part 2 Whiteboard Friday | Content Marketing | Public Relations By: Amanda Milligan November 12, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Amanda Milligan November 12, 2021 How to Make Newsworthy Content: Part 2 Whiteboard Friday | Content Marketing | Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Content marketing expert Amanda Milligan is back with three more ways to make your content more newsworthy. If you haven't seen part one, be sure to check it out! Click on the whiteboard image above to open a larger version in a new tab! Video Transcription Hi, everyone. Welcome to another edition of Whiteboard Friday. My name is Amanda Milligan, and I am back with a part two for how to make newsworthy content. So when I made part one, I was working at Fractl, and I talked about three things. Let's see I remember them. It was data, emotion, and impact as three elements you need to be considering when creating newsworthy content. Those are still important. If you haven't seen that Whiteboard Friday, check it out after this one. It doesn't need to be in any particular order. Now I work at Stacker. stacker.com is a publication, but it's also a newswire. So like the AP for breaking news or Reuters for financial news, Stacker is a newswire for data journalism. So I work on the brand side though, where we partner with brands. They underwrite content, and we syndicate it to our newswire. I've been talking to the team, since I'm still relatively new, and they told me that these are three additional things that they consider when they are creating content for their publishing partners. So it was fascinating to get their take on this, and I'm really excited to share this with you. Is it serviceable? So let's just dive in. Three things to consider. The first is if the content is serviceable. Basically, all that means is how can it help the reader. So as marketers, we're actually already pretty good at this. This is like the how-to content of the world just with more of a news spin. So it's not going to be your standard blog post. It's going to be more along the lines of how do you take something practical that's happening to people, that's also newsworthy, which we can get into exactly what that means. This will overlap with a lot of these other different qualities. So if it's serviceable and it's also adding context to a greater story, if it's serviceable and also based on new data, or it's based on an emotional component or it impacts a lot of people, those things all help it be newsworthy. Is it contextualized? The second is contextualized. This is something that Stacker really excels at and I find fascinating. So we can't break news as marketers. That's not our job. We're not in the business of doing really quick reporting off of big events. That's just not what we're doing. So contextualizing is taking a look at what's trending, what people are talking about, what's happening and thinking about the other angles, the other perspectives that tell a more comprehensive story to that. This has worked really well. I think it's something that all brands should be considering when they're following like if you have those websites or blogs that you follow in your niche, thinking about what those kind of like top news stories are and how you can add to the conversation. Is it localized? Finally, localized. So this one is near and dear to my heart because I actually have a journalism degree even though I never became a reporter. I learned localization in college. I took a class called reporting that was extremely difficult. It was the weed out class for the journalism degree. The first time I got an A and I got my article run in the college newspaper, it was from localization. There was a national story about how doodling can help improve your concentration, which I thought was interesting and kind of contrary to what you would normally think. I called up local experts, like people at the university, neuroscientists, and I said, \"Hey, I just saw this report come out. Do you agree with it?\" They were thrilled to talk to me about it, and they told me all about how they absolutely believe that that's true, that they doodle when they are listening to presentations. Anyway, it's not that the data was any different or anything. It's that it was localized. It was that it mattered to the people who were reading it because it was being corroborated by people in their own community. So localization can be a huge asset if you're a brand that has a brick-and-mortar or not. If you specialize in certain areas, if your customers live in certain areas, localizing content can really speak to them in a way that the national content might not. An example story So I just ran through those things. So let's do a little exercise. This is a statistic I saw recently. The median home price for an existing home in August of 2021 increased by 15% compared to 2020. So this is from the National Association of Realtors. It's a statistic I saw. The exercise I want to do is let's try to come up with angles, not even necessarily the ones that you're going to run with for the story, but to brainstorm in that direction. 1. Serviceable So serviceable. How do you take a statistic like this and consider the serviceable angles? So I have written, \"Where are the most affordable places to live?\" So if we're finding that home prices are going up, it's a practical, helpful thing to know where it could actually be affordable to move. If people are thinking about moving, they're like, \"I don't know if it makes sense to do that.\" At least now they can have their options. Then going a little deeper or even just like a different way of approaching the same conversation is what an average home looks like in X place at X price. So you're taking those increased prices and you can show examples of what a home looks like. I've seen projects like this before. You probably have too. But it's a different way of illustrating the same useful point, which is where could I actually see myself living. That's what makes it serviceable. You're giving them information that they can actually act on later. So those are some serviceable angles. 2. Contextualized Contextualizing. So there's a lot to unpack in this stat. I believe this was a Forbes article I was reading, and they go into a little bit of detail about some of the context. But there are other ways to dive into the context. Even without reading the story, what I was thinking about was: What is the average down payment now? So if the home prices are increasing, presumably the down payment costs are increasing. What I remember the article saying was that that's always the biggest hurdle, or not always, most of the time the biggest hurdle, especially for first-time home buyers, is the down payment. It's a big sum of money. So how much is that increasing, and what does that look like for the average person? What does that amount of money equate to in the rest of your life? How long would it take to save that amount of money? These are all contextualizing details that make it feel a little bit more relevant to you. Then I said, \"How does this compare to the average student loan debt for a person?\" So just telling a greater financial, like personal finance story. The way the team at Stacker thinks about contextualizing is you're comparing it to similar things. So things may be historically is the quickest way to do it. Like how has this been in the past? But also different things that are still relevant. That's where student loans come in. It's not just in a vacuum. Your financial situation is impacted by multiple elements, and it's good to get a full picture of that. 3. Localized Finally, localizing. So how have prices changed? So this is the average in general. But have they changed in different states at a different rate? Which states has the price increased more? Which states maybe have stayed the same or maybe have dropped? That's not being illustrated by a national statistic. What local programs exist for first-time buyers? This is a great combo of serviceable and localized. So if you are a first-time home buyer and you're thinking, \"I have no idea how I'm going to do this now because COVID happened. I don't know how I'm going to afford a house.\" An article that shows them all of their options, tells them what localized programs there are for first-time home buyers is extremely relevant and serviceable and local, and that is where you get the sweet spot of newsworthy content where publishers are really going to want that information. So consider these as potential angles to brainstorm when you're coming up with content ideas. Final tips Consider the data Also consider what I talked about last time, which is data. We're all about data. If you can use original data in your story or take existing data and draw new conclusions and tell new stories with it, that's gold. Consider emotion Emotion, does it have an emotional impact? Impact, meaning how many people does it affect. All of these things are great, great lenses to come up with fantastic newsworthy content. Thank you so much for listening to this and taking the time. If you have any questions, feel free to reach me on Twitter. I'm @millanda, and my email is amilligan@stacker.com. I love talking about this stuff. Please reach out if you have any questions and thank you so much again. Video transcription by Speechpad.com. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Make Newsworthy Content: Part 2"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Make Newsworthy Content: Part 2"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Is it serviceable?"
    },
    {
      "level": "H2",
      "text": "Is it contextualized?"
    },
    {
      "level": "H2",
      "text": "Is it localized?"
    },
    {
      "level": "H2",
      "text": "An example story"
    },
    {
      "level": "H3",
      "text": "1. Serviceable"
    },
    {
      "level": "H3",
      "text": "2. Contextualized"
    },
    {
      "level": "H3",
      "text": "3. Localized"
    },
    {
      "level": "H2",
      "text": "Final tips"
    },
    {
      "level": "H3",
      "text": "Consider the data"
    },
    {
      "level": "H3",
      "text": "Consider emotion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    }
  ],
  "author": "Amanda Milligan\n          \n            Amanda Milligan"
}