{
  "url": "https://moz.com/blog/how-to-create-authentic-local-content-at-scale",
  "slug": "how-to-create-authentic-local-content-at-scale",
  "title": "How to Create Authentic Hyperlocal Content At Scale - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Creating local content is hard enough, but when you're a nationally based business, it seems impossible. The key? Discovering and utilizing local content creators.",
  "content": "How to Create Authentic Hyperlocal Content At Scale Local SEO | Content Marketing By: Megan Hannay - @ZipSprout January 24, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Megan Hannay - @ZipSprout January 24, 2017 How to Create Authentic Hyperlocal Content At Scale Local SEO | Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The \"why\" and \"how\" of sourcing local talent from national HQA recent report on national-to-local marketers mentions that, with the exception of email marketing, “enterprise brands are struggling to make digital as effective as traditional tactics and media” for local branches’ ad dollars. With locally focused email newsletters, it’s generally easier to automate locally targeted sales or events. On the other hand, local content is much more essential for local SEO and social media engagement, and this is where enterprise brands have not yet fully conquered the local space. For national brands, accumulating content that resonates with locals in each individual market is an excruciating task. Not even the best of researchers or the slyest of copywriters can match the value of a local’s knowledge base. Meanwhile, local partners may not have the time or the storytelling know-how to create quality local content. Content without topic knowledge is generic; content without storytelling chops is ineffective. Herein lies the problem for local: How do you plan quality, shareable articles, videos, and digital media with a local focus at a national scale? The answer: Find locals to create content about their region. As Ronell Smith recently wrote, SMBs have the content creation advantage when it comes to local know-how, but I respectfully disagree with Ronell on his preference for local brands topping local content SERPs. Generally, I’d prefer the best local content to top my searches, and many national startups are disrupting local habits for the better (think Uber v. your local cab company). National, online brands will never be able to replace the helpful salesperson down the street, and franchises will never be the first choice for dinner with friends from out-of-town, but there is a space in the market for enterprises, especially if they’re willing to take the time to mingle with local creatives. The three methods in this post have varying SEO side effects, depending on the tactics used. While local content is a boon to local rank, a “sponsored post” on a local news source won’t have the same effect on your rankings. But while SEO is a factor to consider in content creation, it’s not the only reason in town. Good ‘local’ marketing doesn’t always mean scaling standardized national content and messaging to every market; rather, this post posits that ‘scaling local’ means developing targeted resources that resonate in each market. 1. Patronize local mediaPR is not the only way to work with journalists anymore. Many media publications both large and small are adding content creation services to their revenue stream. Sometimes this means sponsored content, where a piece is commissioned (and labelled as such) by a for-profit partner. In other cases, journalists are working with brands to bring their talent for story to commercials, website content, or other branded media. According to a 2014 Pew Research report, “the largest component of the growing digital news world is the smaller news site. A large majority of them are less than a decade old, about half are nonprofits, most have staffs of five or fewer and many also rely on volunteer and citizen contributors. Their greatest area of focus is local news coverage.” One such example at the local scale is Bit & Grain, a North Carolina-focused long-form publication, whose pieces are supported by its founders’ storytelling productions for brands and nonprofits. I spoke with the weekly publication’s three cofounders on their revenue generation experiences, 18 months post-launch.Cofounder Ryan Stancil explained that they’re still experimenting with revenue generation models, but that content production and creation is their most successful funding tool so far.“People need help telling their story,” Stancil said. He added that their work-for-hire is both very different and very similar to the pieces they create for Bit & Grain. It’s different in that it’s commissioned storytelling, but it’s the same level of quality they bring to their weekly pieces. A sampling of Bit & Grain’s local fare.Stancil brought up their recent sponsored piece on a local restaurant as an example. While clearly labelled as “sponsored content,” the piece received the same aesthetic care and storytelling craft as any article in the publication. Stancil’s cofounder, Baxter Miller, echoed a similar sentiment in their sponsored content process.“If anyone came to us about doing a sponsored content piece, we would vet them as much as anything we put on our editorial calendar,” she said “And really the process is much the same.” I also spoke with Shawn Krest, the managing editor of local publication Raleigh & Company, which began as a fun side project/playground for Raleigh, NC-area journalists and has evolved into a blog-like online publication. The site was acquired by Capitol Broadcasting Company in August of 2015. While Raleigh & Company covers the same region as Bit & Grain, the publications’ similarities end there. Raleigh & Company’s subject matter is more irreverent, with pieces poking fun at Presidential candidates, and others interviewing NFL recruits who will never see game day. Plus, Raleigh & Company’s copyeditors have no qualms about the first person appearing in its columns.“We’ve had pieces where writers really open up and talk about issues they’re dealing with,” Krest said. “Addictions, things like that. I feel like when Raleigh & Company is at its best, you see the writer sort of bleeding on the keyboard as they’re writing.”Local journalism is going niche in a way that daily newspapers couldn’t. For brands, this is another potential win, as you’re able to zero-in on a narrow audience in your city of choice. Like Bit & Grain, Raleigh & Company is open to sponsored posts, but Krest is not willing to lose the tenor of the publication to satisfy a sponsor, as he explained when the blog was acquired by Capitol Broadcasting Company. “We said at that first meeting, ‘we use the F-word and we’re not going to stop,’ and they were fine with that,” he said. “The first time they wanted us to look more like the local news, it would not work.\"While as different as Eastern and Western NC barbecue, Bit & Grain and Raleigh & Company have similar limitations to their branded content philosophies. This shouldn’t be a problem for companies seeking true neighborhood flavor in their local content. For brands who want a bit more control, a collaborative approach with an influencer may be a better option. Finding local journalistsLocal media is transforming. For some, this is a frightening prospect; for others, it’s a moment of opportunity. During the recent Sustain Local Journalism conference, which I attended, a few local writers and publishers gathered in Montclair, NJ to discuss the biggest issue currently haunting their industry: how to keep funds flowing. While some local news sites, such as Philadelphia’s Billy Penn, have found success through events, many at the conference agreed that revenue diversification was the only way forward. Not every local writer will want to craft a piece for a brand, but others are willing to work with the enterprise in order to support their own local efforts. Here are a couple online lists of local media sites: Columbia Journalism ReviewMichele's ListThough both lists fall short of the total, as neither has Bit & Co. or Raleigh & Company among their publications.2. Capture the photographer next door: Partner with local influencersInfluencer marketing is nothing new, but it is under-utilized for local campaigns. Whether they’re Insta-famous or a YouTube personality, every influencer calls somewhere home. And for local content creation, audience size is a secondary metric. The biggest offering local bloggers or vloggers provide is a local perspective and content creation experience.My favorite rule of thumb when approaching bloggers (credit to a presentation by Molly McKinley of Adwerx): Give before you ask. And \"gifts\" don’t have to be free products. They don’t even have to be physical items. Can you invite local bloggers to an upcoming company event? Do local offices receive event tickets in exchange for local sponsorships? Maybe you could allocate a budget to sponsor their existing local interests. For enterprise-size brands, links and shares of smaller bloggers can offer a big boost to their SEO and/or social media accounts. At ZipSprout, we’ve developed locally focused content by interviewing bloggers about their favorite area restaurants and day trips. Local bloggers have both neighborhood and content creation know-how. While your competitors chase the influencers with the biggest following, consider first seeking the voice that matches your brand. Finding local influencersBloggers and influencers are typically organized categorically, so I have to go back to some of the prospecting lessons I learned from my cofounder, link builder Garrett French, to find influencers based on location. I find success using phrases a local would have on their blog, such as: \"here in philadelphia\" intitle:\"blog\"From which I found:A PR & events blogA Philly couponerSometimes it helps to get a bit more specific, since many bloggers don’t have the word “blog” on every page. So I tried: \"here in philadelphia\" intitle:\"my dog\"From which I found:A Philly lifestyle bloggerWant a local photographer? Try: \"here in philly\" inurl:\"instagram.com\"Photo by @bkerollis, a Philadelphia-based blogger and choreographer, on Instagram. Of course, you can search for #Philadelphia on Instagram, but Google conveniently sorts (somewhat) by post popularity. 3. Brand Y x City Z = Local dataIt’s not just “the top 10 cities for” — find local data in context with national trends. Good narratives find the context and connection to bigger stories. What does your data from City X say about how that area stands out from the crowd? At ZipSprout, we’ve reported on the top corporate sponsors in a particular geographic region, finding that local news and tech companies, followed by national banks, are the most widespread donors to local nonprofits and events in Raleigh/Durham, North Carolina. We also visualized the most frequently used words in local organization’s \"about\" pages. Thanks to our data, we can write a similar article, but with very different results, for cities all over the U.S. It can take some developer time, but local data can be automated on city pages. What’s the most popular Starbucks order in Omaha, Nebraska? What’s the most frequently rented Hertz car from the Dallas/Fort Worth airport? What are the most and least popular times to ride a Lyft in NYC? Locally focused blog posts and landing pages can be fun. Showing customers we know they’re unique says a lot about a brand’s local presence, without saying anything at all. Conclusion: Write local, rightIf you really want to have hyperlocal visibility, in the SERPs and in local publications, you need hyperlocal content, at scale. The Woodward and Bernstein-style newsroom may soon be old fashioned, but we’re also in an age that appreciates authentic, quality storytelling, and local branches often don’t have the personnel or resources to develop local content. Neighborhood know-how can’t be fudged, so why not partner people who can tell your brand’s story with a local accent? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Create Authentic Hyperlocal Content At Scale"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Create Authentic Hyperlocal Content At Scale"
    },
    {
      "level": "H2",
      "text": "The \"why\" and \"how\" of sourcing local talent from national HQ"
    },
    {
      "level": "H3",
      "text": "The answer: Find locals to create content about their region."
    },
    {
      "level": "H2",
      "text": "1. Patronize local media"
    },
    {
      "level": "H3",
      "text": "Finding local journalists"
    },
    {
      "level": "H2",
      "text": "2. Capture the photographer next door: Partner with local influencers"
    },
    {
      "level": "H3",
      "text": "Finding local influencers"
    },
    {
      "level": "H2",
      "text": "3. Brand Y x City Z = Local data"
    },
    {
      "level": "H2",
      "text": "Conclusion: Write local, right"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Megan Hannay - @ZipSprout\n          \n            Megan Hannay - @ZipSprout\n          \n            Megan Hannay - @ZipSprout"
}