{
  "url": "https://moz.com/blog/how-to-create-a-prioritized-seo-action-plan",
  "slug": "how-to-create-a-prioritized-seo-action-plan",
  "title": "How to Create a Prioritized SEO Action Plan - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "One of the best ways to be an effective consultant is to make your recommendations as actionable as possible. But a full SEO review often raises a LOT of potential issues and their solutions, which can be intimidating to clients. Clients and managers will be much more likely to implement your…",
  "content": "How to Create a Prioritized SEO Action Plan SEO Consulting By: Kristina Kledzik January 13, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Kristina Kledzik January 13, 2014 How to Create a Prioritized SEO Action Plan SEO Consulting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. If you spend a few hours on any SEO blog, you'll learn all about how to review a website, identify SEO problems, and propose solutions. But proposing solutions alone doesn't get them fixed. Clients and managers will be much more likely to implement your recommendations if you propose clear, concrete action plans that prioritize steps based on expected cost and benefit. It's helpful to include a spreadsheet at the end of each audit that looks something like this: A five column table probably doesn't look too intimidating, but when you get down to it, there's a lot of work involved in arriving at the right piece for each column, so I want to go over each step thoroughly (letters correspond to columns on the table): Writing concrete actions Prioritizing recommendations Identifying resources needed Estimating costs Compiling pieces for final ranking A. Writing concrete actions The difficult part of our job is figuring out the what and the why, so we often leave off the time consuming yet simple last step: how. For example, many SEO reports might something like this: We crawled your site and found a number of broken internal links that are creating 404 errors and losing PageRank. By checking your internal links and correcting any broken links, you will retain PageRank, increasing rankings across the site, and create a better experience for your visitors. That covers what the problem is and why you should fix it, and broadly outlines what you should do to fix the problem. But imagine that you're a web developer who read that report: did someone just tell you to spend days clicking all the links on your site looking for 404 errors?! As experienced SEOs, many of you reading this probably jumped slightly in your seats. No, you did not just ask them to manually go through the site - there are so many tools that can do that for them! Just run a Screaming Frog crawl and look for 404 errors! But the truth is, as knowledgeable as web developers are, there are many tips and tricks of SEO that they don't know about. Even if they do know about Screaming Frog, consider how much more helpful this report is: We crawled your site and found a number of broken internal links that are creating 404 errors and losing PageRank. By checking your internal links and correcting any broken links, you will retain PageRank, increasing rankings across the site, and create a better experience for your visitors. We have compiled a list of all broken links across the site, their location, and their anchor text. We recommend that you review these and either remove the link or find an appropriate live page to direct visitors to. Without this last step, you're relying on a savvy web developer to do the manual labor for you. With this last step, you're allowing the project manager to pass on your solution to an intern and forget about it. Even if it technically costs the company more to pay you for those 15 minutes of work than their developers, it prevents mistakes and dramatically increases the chance of the work actually getting done. Whenever you're creating an action plan, don't stop at high level solutions. Outline the steps it will take to complete the plan, and do as many of the steps as you can yourself. B. Prioritizing recommendations This step is vital, yet rarely included. As easy-to-implement as your actions may be, passing on over 20 actions to any group may seem overwhelming. Where do they start? What will get them the most traffic for their efforts? If your client or manager wants traffic or revenue estimations, that'll take some time (and deserves its own forecasting blog post). But most clients I've worked with are fine with a high/medium/low scale. What counts as high, medium or low? I've ranked the most common issues that I find while reviewing clients' sites from largest impact to least. Just be sure to modify the final high/medium/low ranking based on how widespread the problem is. 1. Penalties You probably already knew this, but: always fix penalties first. If your site is under penalty, any other SEO fixes will have less of an impact. And there's always the worrisome possibility that the penalty will lead to bigger/worse penalties (i.e. an algorithmic penalty could lead to a manual review, a manual penalty could lead to a manual review of other issues, an unresolved penalty could receive harsher punishment). Clients and managers are much more willing to invest in regaining traffic they once had than making changes to get more traffic. If you can spot and prove a penalty, it should be easy to identify value lost and how much more they will gain from unpenalized rankings than they will lose from fixing the problem. 1a. Manual penalties Manual penalties typically cause results to drop a set number of places in rankings. To check for a manual penalty, search for the site's brand name. If it isn't ranking #1, you probably have a manual penalty on your hands. To remove a manual penalty, you'll have to submit a reconsideration request with Google. Lewis Sellers put together a great post detailing how to do this thoroughly (otherwise, your request will be denied). 1b. Algorithmic penalties Algorithmic penalties still get the \"high\" prioritization, but are usually less severe than manual penalties. Unlike manual penalties, algorithmic penalties won't knock your rankings evenly across keywords, but you'll see an overall drop in organic search traffic.To identify an algorithmic penalty, look through Moz's handy log of algorithm changes to find which changes Google implemented right before or during the site's organic traffic decrease. They include links to articles, which should help you find a solution for the penalty. Note: There's a difference between algorithmic penalties and changes. A penalty is when Google's algorithm determines that you have done something against the rules and ranks your sites' pages lower than they would otherwise rank. Fix the core issue, and your site can start to rank well again. But when algorithms change, there's no way to \"regain\" lost traffic. The landscape has just changed. Here's an example: if your site is getting less traffic because Hummingbird answers the query above search results, there's nothing you can do or fix to get your traffic \"back.\" Instead, you have to be a marketer rather than an SEO. What's the site's core strength? How can you move your efforts towards more fruitful channels? 1c. Potential penalties Unsurprisingly, potential penalties should be prioritized below active penalties, but make sure that you handle them before other recommendations. What do I mean by \"potential\" penalties? If you notice keyword stuffing, doorway pages, or unnatural links, but don't see any proof of current penalties, it's only a matter of time before your site takes a hit. These are much harder to convince website managers to invest in. They are spam tactics that are most likely paying off, so fixing them will take time and effort and may very well hurt organic traffic. That said, it's incredibly important that you fix them as soon as possible. It's much harder to recover from a penalty than it is to prevent one. Plus, as an SEO you may very well lose respect (or your job!) if you let a penalty hit while you're on duty. 2. Pages that don't rank Broken links, incorrect redirects, or low quality/seemingly duplicate content will often cause Google to miss pages or ignore them completely. Site owners often incorrectly assume that this has to do with keyword targeting when they can't find their page for a relevant search term. But there's nothing that content can do to make up for not being in the index in the first place. 2a. Poor link structure Most commonly, a page won't make it to Google's index because: There are no links to it There are supposed to be links to it, but they're broken There are 302 redirects to it, so the original URL stays in the index There is one link to it at the bottom of a 3,000 word article with 300 exit links Navigation is 100% JavaScript that loads text after the page is loaded, so Google can't read it In all of these cases, Google either can't find the page or doesn't think that it's important enough to add to its index. This is easy enough to fix on a one-off basis, but you don't want to have to keep checking for lost pages. The best way to make sure that all pages are found is to build a solid navigational structure that links to all pages on the site so that you're not relying on body links for content to be found. 2b. Duplicate or extremely low-quality content If Google thinks that a page contributes nothing to the world wide web, it may choose not to rank your page unless you search for the URL explicitly. Historically, this would happen when a page had almost no content (less than 50 words) or was very clearly keyword stuffing, so always make sure that a missing page is readable and has enough text content that Google can understand its meaning. You can check to see what Google can read on a page by loading Google's cache of a page, in the text-only version. You're more likely to run into duplicate content issues, though. If Google finds two pages on the web that have nearly identical content in the body of the page, Google will choose one page as the \"original\" and ignore the rest. To check to see if you have duplicate content, copy a long string of text from a page and search for it in quotes. You or your client may have accidentally kicked your own content out of the search index if you: (Ecommerce sites) Shared product content by taking the manufacturer's description. In this case, add your own review or work to encourage visitor reviews. Google will not punish you if only a portion of your page is duplicate content. (Content-based sites) Syndicated your content on more authoritative sites without getting a rel=\"canonical\" back to your page. If you have done this in the past, reach out to get those canonical tags, and make sure to make that a standard part of all syndication. (International corporations) Shared content aimed at different countries. This is a bigger issue, so check out Kate Morris's recommendations around international SEO. Note: If you find duplicate or low-quality content that still is ranking, fixing it is still a high priority. It means that the page has enough authority to overcome the issue, but if you create unique, valuable content, the page will do much better in search engine results pages. 3. Confusing content As smart as search engines are, they're still machines that try to match searchers' queries with your content. Pages are most likely to rank well when they make it clear which questions they're answering, by clearly focusing on one to two subjects per page, and using a similar vernacular to searchers' queries. 3a. Keyword targeting Most keyword research posts I read start from nothing, assuming that you have a topic in mind but haven't written content yet. The truth is, most of us are editing content that's already live, so it's more about verifying that the text was written well than it is about coming up with a list of target keywords. The first step to verifying keyword targeting is reviewing a page and figuring out what questions it's answering. Then ask yourself, \"if I had this question, how would I search for it?\" Write up a thorough list of possible queries, both based on the words that are already in the page's text and other words that you think are relevant. If you're an in-house SEO, look through forums and other user-created content to move away from your internal speech patterns. Cyrus Shepard wrote an awesome ebook on identifying keyword groups that should help you with this. Next, search for those terms in Google Keyword Planner. Do they get traffic? Does the keyword planner recommend similar, but more popular keywords? If the content is very different from what people are actually searching for, this is a high priority issue. Google understands synonyms, but it doesn't rank them as well as direct matches. If the content is not ideally targeted, this is still a good recommendation, but it's a lower priority. 3b. Topic cannibalization Even if each of your pages is perfectly targeted, you may find that you're targeting the same queries with multiple pages. In SEO, we've typically covered this topic with \"keyword\" cannibalization, but with Google working to understand meaning more than individual words, the problem really comes in when you have two pages that both apply to the same queries, and Google thinks your site should only occupy one results place. When you review pages for keyword targeting, make sure that you don't end up with the same list of keywords for multiple pages. If you do, consider combining them for one stronger page (301 redirects, please!). 4. Other technical issues Once you've made sure that your site isn't being penalized, all pages are indexed, and content is understandable, other issues are much less pressing. Prioritization of those issues has more to do with how extreme the problem is, and how many pages are effective. Run through Geoff Kenyon's complete Technical SEO Audit Checklist to identify these issues, and prioritize accordingly. C. Identifying resources It's fairly easy to identify the general department that will handle an action, but slapping up \"Dev Team\" for all HTML-related changes might not be the most efficient allocation of resources. Action plans are much more helpful when you start by learning about all available resources to make sure you assign tasks correctly, make sure that you include all resources needed on the spreadsheet, and understand a bit about their workload and work speed. Know All Available Resources If you're in-house, this probably isn't an issue. If you're a consultant, though, you have a very limited view of resources available. Unless you directly ask for a list of internal teams, tools, and agencies, you'll usually only hear about the internal teams that do high-level work, like the content team, web development team, and creative team. But what about the interns, the tools, the outside agencies? When you mis-assign work to a more in-demand team, team members will often recognize that an intern or tool can do the work and hand it off accordingly. But busier teams take longer to get to projects, so you'll end up waiting weeks for the dev team to clean up broken links, only to have developers had the project off to an intern the second it lands on their to-do lists. To be as efficient as possible, make sure that you assign tasks to the department or team member who will be able to work on it as fast as possible and/or for the lowest cost. You don't necessarily need to know of all employees and their skills, just make sure that you have a comprehensive list before you assign them yourself, or ask an employee who knows the lay of the land, like a project manager, to go through your list with you. Include all needed resources Many SEO recommendations seem very technical, but require a bit of writing or design work. When you add action items like \"rewrite page titles,\" or \"move this link into the top navigation,\" you're asking for more teams to be involved than just the development team. In these cases you have two options: do the writing or design work yourself (which makes your recommendations very actionable; I do this often myself) or make sure that you identify all resources needed and include them in the spreadsheet. Understand how quickly resources can complete tasks This is a tricky step, because no one will tell you that, say, their design team is slow. It's better to ask questions about past projects: Last time you designed a new navigation, how long did the brainstorming take? Are employees often interrupted from their long-term goals to complete short-term assignments? Information like this will help you select resources and estimate cost. Going back to the example of fixing broken links, the web development team may be able to fix them programmatically, but they might not get around to it until next month, and it'll take them a day to write the code. Meanwhile, there may be an intern who is quick and efficient and has free time right now. Many teams (especially developers) like to take the most \"efficient\" route, but your organic traffic will do much better if you complete tasks as quickly as possible rather than as efficiently as possible. D. Estimating cost I used the word \"cost\" here because money is the most universal way to compare effort spent between employee involvement, outside resources, and tools. However, most SEO recommendations require manual labor, often carried out by in-house workers, in which case companies may be more used to measuring in terms of time to implement or effort. Your \"cost\" will make much more sense if it's in the same format that they're used to seeing. Again, most companies are happy with a scale of high/medium/low, but if you have enough experience with the company, more precise estimates will make it easier to prioritize actions. E. Prioritizing SEO actions The final prioritization decision should take into account all of the pieces above, plus the company culture and goals. Notice that I didn't say SEO goals. You should prioritize SEO actions that compliment all goals for the company, including (but not limited to) SEO goals. If the content team is already rewriting product pages, start on keyword targeting before you worry about reworking the navigation. Integrating SEO wins into current projects is one of the best ways to minimize budget. In addition to explicit goals, you should also think about what will make your team and management feel that the project has been successful. If you're working with an agile team that's used to quick wins and/or a company that is skeptical of the value of SEO, you should start with easy-to-complete tasks that turn the needle immediately. If you're working with a company that takes a bit more time to complete projects, you may want to start them on big plays right away, to make sure they get maximum SEO value for the few projects they're able to complete. As brilliant as you may be, you won't retain clients unless they see the wins. Is all this effort worth it? Yes. Being a consultant or an employee requires much more than simply doing your job; you will look a million times smarter if you're more effective. Plus, your coworkers/clients will love you for it. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Create a Prioritized SEO Action Plan"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Create a Prioritized SEO Action Plan"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "A. Writing concrete actions"
    },
    {
      "level": "H2",
      "text": "B. Prioritizing recommendations"
    },
    {
      "level": "H3",
      "text": "1. Penalties"
    },
    {
      "level": "H4",
      "text": "1a. Manual penalties"
    },
    {
      "level": "H4",
      "text": "1b. Algorithmic penalties"
    },
    {
      "level": "H4",
      "text": "1c. Potential penalties"
    },
    {
      "level": "H3",
      "text": "2. Pages that don't rank"
    },
    {
      "level": "H4",
      "text": "2a. Poor link structure"
    },
    {
      "level": "H4",
      "text": "2b. Duplicate or extremely low-quality content"
    },
    {
      "level": "H3",
      "text": "3. Confusing content"
    },
    {
      "level": "H4",
      "text": "3a. Keyword targeting"
    },
    {
      "level": "H4",
      "text": "3b. Topic cannibalization"
    },
    {
      "level": "H3",
      "text": "4. Other technical issues"
    },
    {
      "level": "H2",
      "text": "C. Identifying resources"
    },
    {
      "level": "H3",
      "text": "Know All Available Resources"
    },
    {
      "level": "H3",
      "text": "Include all needed resources"
    },
    {
      "level": "H3",
      "text": "Understand how quickly resources can complete tasks"
    },
    {
      "level": "H2",
      "text": "D. Estimating cost"
    },
    {
      "level": "H2",
      "text": "E. Prioritizing SEO actions"
    },
    {
      "level": "H2",
      "text": "Is all this effort worth it?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Sins of an Agency: Parting Ways With Our Biggest Client"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "8 Prep Steps for Better Local Business Client Meetings"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kristina Kledzik\n          \n            Kristina Kledzik"
}