{
  "url": "https://moz.com/blog/how-to-use-six-google-analytics-reports-to-complete-a-website-content-audit",
  "slug": "how-to-use-six-google-analytics-reports-to-complete-a-website-content-audit",
  "title": "How to Use Six Google Analytics Reports to Complete a Website Content Audit - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I'm a big believer that no good content marketing strategy should begin without a comprehensive audit of the website’s current performance. The simple reason is that you cannot plan ahead if you do not already have a great understanding of where you currently are. In this article, I will show you…",
  "content": "How to Use Six Google Analytics Reports to Complete a Website Content Audit Content Marketing | SEO Analytics | SEO Reporting By: Daniel Hochuli February 18, 2016 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Daniel Hochuli February 18, 2016 How to Use Six Google Analytics Reports to Complete a Website Content Audit Content Marketing | SEO Analytics | SEO Reporting This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I'm a big believer that every good content marketing strategy begins with a comprehensive audit of the website’s current performance. The simple reason is that you cannot plan ahead if you do not already have a great understanding of where you currently are.In this article, I will show you how a content audit with six important Google Analytics reports can help you make some smart decisions about the health of your current site, what your audience wants from your content, and how you can benchmark your performance for future content marketing efforts.The six reports include the following: Channels reportLanding Page reportNew vs Returning Visitor reportFrequency & Recency reportSite Search reportBehavior Flow reportNow, these aren’t the only reports you should use in your content audit, and you don’t need to be a Google Analytics doyen to gather insights from these reports, you just need to know what you’re looking for.For the above-mentioned reports, we will aim to answer the following questions about content on your website: How is my audience finding my content? (Channels report) Which content piece is performing the best in terms of traffic, engagement, and conversion? (Landing Page report) What should my content performance benchmarks be? (Landing Page report) Do I need to prioritize building an audience; or should I nurture my existing audience? (New vs. Returning report) How many pieces of content do I need to create a month? (Frequency & Recency report) What are the topics I should be talking about, but are not? (Site Search report) Is my content successful at driving business transactional goals? (Behavior Flow report) What is the value of my content? (Behavior Flow report)First, though, some housekeeping: In order to create a comprehensive content audit in Google Analytics, you need to create some Advanced Segments.Advanced SegmentsAdvanced Segments allow you to separate the data into any number of important groups. For the task at hand, I would normally create two primary Advanced Segments and call them Converters and Non-converters.A Converter is any visitor who has completed a Goal, Transaction, or Event on your site, while Non-converters are visitors who did not complete one of these key performance indicators (KPIs). The reason I segregate these audiences for a content audit is to keep a focus on what behavior or content is creating lead/sales opportunities and what is not.To create an Advanced Segment for visitors who completed a Goal, click the \"+ Add Segment\" tab:Then go to \"New Segment\" and click \"Conditions.\" Where it says \"Ad Content,\" type in \"Goal Completions\" to be greater than zero per session. Then select \"OR\" and type in \"Transactions\" to be greater than zero per session.For comparison's sake, you can make a \"Non-converters\" Advanced Segment with the same Conditions, except use \"=\" in step 3 instead of \">\".Caveat: If you don’t have any Goals or Events set up in your Google Analytics account, then these Advanced Segments will not be much use to you. But don't despair. Instead, look to segment your visitors by softer goals, such as those who visited your content (for example, your blog) and those who did not. To do this, go to \"Conditions\" in the Advanced Segment menu, then choose the \"Landing Page\" dimension; \"starts with\" and the blog’s location, for example, \"/blog/.\"Again, you can also flip this to see the behavior of all visitors who did not visit the blog by choosing the same Condition but selecting \"does not contain.\"This audience can tell you a lot about why your blog is not capturing these people and what you could do to drive more traffic to these URLs.Save these Advanced Segments as you will need them in some of the following reports.CalendarThe second housekeeping feature is pinning down a consistent time frame to assess the reports. I like to use two-time frames to compare performance in a content audit:The last three monthsThe last 12 monthsThese two time frames allow us to factor in things such as seasonality, which can potentially affect traffic numbers, but you can use whatever time frames best suit your business and content.Ok, now on to the six reports.1. Channels reportWhere is it? ACQUISITION > ALL TRAFFIC > CHANNELSQuestions it will answer: How is my audience finding my content? Which channels are creating the most leads?This report is useful for understanding where your visitors are coming from and which channels are the most effective sources for your content.Using your \"Converter\" Advanced Segment, you can see which channels are driving the best quality of traffic and conversions to your website. This can help you identify where you need to improve your content marketing.Two key things to look out for in the Channels report are:Which channels are delivering the most traffic to your site?Which channels are delivering the best quality traffic to your site?There is a difference. For quantity, look at the Acquisition metrics; for quality, consider the Behavior metrics and the \"Goal Conversion Rate.\"For example, if you are pushing your content out on your social media channels and are seeing high bounce rates and a low Average Session Duration, this could mean your social media audience is not finding the content they want. Or, it could also mean that the content they see on your site does not properly represent what your social media snippets are promising.Alternatively, it could indicate that your content may not be displaying well on mobile devices (where most social media traffic tends to come from), and is giving users a bad mobile experience. All of these insights can help you better optimize your content distribution strategy.Another example: If you are getting a lot of traffic from the \"Email\" channel but not many conversions, this tells you that you might need to improve your call to action (CTA) in your email marketing.Also, keep a keen eye out for weekly or monthly patterns in traffic in the line graph under the \"Explorer\" tab. If, for example, you are seeing a spike in traffic every Thursday, look at which channel is bringing in that traffic and try to figure out why that’s the case.Likewise, if you send out a monthly eDM on the 20th of each month and see a huge spike in traffic on the same day, check the Channels report to confirm that the spike is coming from Email.2. Landing Pages reportWhere is it?BEHAVIOR > SITE CONTENT > LANDING PAGESQuestions it will answer: What is the most popular content (in terms of performance)? What type of content to create for your audience?What benchmarks should you set for future content efforts?The Landing Page report allows you to see some real performance results around the content currently on the website. If, for example, all your blog content is housed under the same sub-folder (\"/blog/\"), then a quick way to check the top-performing content is to use the search bar in the report and paste in that section of the URL (for example, ‘/blog/). Using this search bar will only show you URLs that contain ‘/blog/’ on the site.Those who have a tidy content management system (CMS) might be able to view this directly in the \"Content Drilldown\" report instead.So, what are you looking at with this report? Simply put, the pages where visitors first land on your website from an external source (such as social media or Google). The top 10 pages are ranked by the number of sessions. Do you see any patterns in terms of topics, site location, content type? These could be indicators of what content your audience finds valuable.Next, look at the Behavior metrics for these top 10 posts. How is the audience engaging in terms of Bounce Rate and Avg. Session Duration? Your goal is to think how you can improve these numbers?Now, select your \"Converters\" Advanced Segment to see which pages are bringing in the highest converting audience, which is important if your goal for content is to drive leads from the blog.Following this assessment, take note of the channels that are driving traffic to these top-performing blog posts. For example, pushing something on Outbrain or a paid sponsored Facebook post is likely to drive more traffic than an organic post. You need to be wary of this, as amplification techniques can manipulate the results.To find which channels are creating the most successful content, click on the blog post URL in the report and then select \"Secondary Dimension\" and type in the words \"source/medium.\"This deeper report will tell you which channels are driving the most traffic to that specific blog post.You now know which pages are performing best in terms of traffic, engagement and conversions, and which channels are bringing in these audiences. Your final step is to set some content marketing benchmarks.The Landing Page report will give you the average figures for Traffic, Bounce Rate, Avg. Session Duration, and Conversions (if you have Goals set up). If this is your first content audit, take these averages as your quarterly benchmarks. They are your KPIs for the next quarter. Your goal is to improve all these results over the next three months.For example, the last three months' performance was 21,000 sessions. This equates to 7,000 sessions a month. Your benchmark should be 7,000 sessions with the goal to surpass this. Adjust each quarter and if you are doing things right, you will see a steady climb in metrics over time.Note that the Landing Page report uses Sessions instead of Pageviews. A Session starts when a user first lands on your website, while a Pageview counts all views of that page anywhere in the visitor’s path through your site. As most visitors find your content externally and only tend to consume it once before leaving that page, Sessions is a more reliable indicator that your content is working.I have seen other content strategists use Unique Users and Users to measure performance. I feel these are a good way to measure the human experience on your website over time. It is a matter of preference.3. New vs. returning visitors reportWhere is it? AUDIENCE > BEHAVIOR > NEW vs RETURNINGQuestions it will answer: Depending on your marketing goals, this report shows you how successful your content is at building brand awareness (new visitors) or nurturing an existing audience (Returning visitors).The New vs. Returning report is vital if you’re looking to understand which type of content marketing strategy to pursue; especially for content marketing goals that revolve around audience growth (e.g., brand awareness, email signups, and engagement).This report is not so much focused on leads and sales as it is on giving insights related to building and nurturing an audience higher up the conversion funnel. It’s an important report because it reveals whether your current content is doing a good job at introducing your brand to potential customers.To start, I like to make this report simple to read by clicking the pie-shaped symbol so I can see the split.The insights of this report depend on your business goals.New audiences: Businesses such as startups or bloggers should look to increase the percentage of new audiences to their site. Likewise, if your goal for the next three months is to build brand awareness through content, you will want to aim to increase the percentage of new visitors to your site as a KPI. Increases in this area indicate that your content is reaching new eyeballs. Moreover, consider the customer lifetime value (CLV) of your product or service. If the product or service you sell does not normally require a second visit in a three-month period (for example, it is usually a one-off purchase or service such as smash repairs or annual insurance quote or university course enrollment), then you should also focus on bringing in new audiences (and therefore new leads) to your site.Returning audiences: On the flip-side, if you have an established content strategy, a recognizable brand name or your site has a membership or login wall, you will want to ensure you have a healthy percentage of Returning visitors. This audience needs to find content that is compelling and consistent. The value of the Returning visitor is that these people are likely consistent consumers of your content or regular purchasers of your product. They are also potential advocates for your brand. We will look closer at Returning visitor behavior in the Frequency and Recency report.Once again, use your Converter and Non-converter Advanced Segments to see which group of visitors is helping the business attain its goals on your site. This can help you realistically plan a content path that drives conversions.Look specifically at your Returning audience visitors that are non-converters. These are people are usually your most loyal content consumers. Their behavior is strange. They keep coming back to your site again and again but are not converting. Why?Perhaps they love your content, but have no need for your product? Perhaps your UX from the blog to a product page is not smooth? Perhaps they are waiting for you to develop a product they actually want? Perhaps your content is appealing to a demographic you had not considered being a customer? Here is an opportunity to make some real change to your business.These people are a captured audience of loyal followers that will be the easiest to convince to convert if only you can figure out what they need to complete their buyer journey. So look at what this audience is doing and think about how their behavior can influence your actual business decisions.4. Frequency & Recency reportWhere is it? AUDIENCE > BEHAVIOR > FREQUENCY & RECENCYQuestions it will answer: What is the optimal amount of content I need to create each month?The Frequency and Recency report simply shows you how often your audience returns to your website in two ways:The average amount of times (sessions) a visitor has on your siteThe average amount of days between these sessionsWhen you first open this report, you will see that the first row of the ‘Count of Session’ table will have by far the most traffic. This is because it also includes all New visitors to your site. You will want to filter these out. You really only want to see the behavior of Returning Visitors. You will need to create a \"Returning Visitor\" Advanced Segment.Once this is set up, your session numbers for \"1\" in the \"Count of Sessions\" report should be zero.Count of Sessions report: This report will tell you the number of sessions the average Returning Visitor had on your site. Look for patterns in volume. For sales and leads, the goal here is working out how to reduce the number of sessions per visitor. For audience acquisition and nurture goals the task is the opposite, how can you increase the number of sessions per visitor?Days Since Last Session report: This report can help you plan how much content you need to create per month. For example, if you notice you are seeing spikes in returning traffic between 8–14 days, this could mean people are coming back to consume content once a fortnight. Likewise, if 15–30 days has a spike, this could correlate with your monthly eDM.Often you will notice that the zero bar shows the largest amount of traffic. This means that most Returning Visitors \"return\" to the website within 24 hours. Now, this is certainly possible is someone comes to the blog, reads content, then leaves the site to research reviews of your product before returning on the same day to make a purchase.However, if you have your Advanced Segment filtered by \"/blog,\" the more realistic pattern of behavior is that they came to the site to read the blog, then left the tab on their browser open for longer than 30 minutes. At this point, the session expires. If, after that half hour, they return to the tab to view more content, they will be counted as a new session.Such behavior is perfectly normal, but keep it in mind when looking at the Frequency and Recency report, as it can play with your results.5. Site Search reportWhere is it? BEHAVIOR > SITE SEARCH > SEARCH TERMSQuestions it will answer: Identify what your audience wants from your content What they are struggling to find on your website What content topics are missingThe Site Search report looks at what visitors to your website type into the search bar within your website. It is a good indicator of what your audience wants to do on your site or what they are struggling to find.Most websites are built with audience intent in mind, which means the results in the Site Search report only reflect a fraction of the visitors to your site. As a result, what you find in this report should not dictate your content marketing topics but it is worth looking at how many times people are typing a common word or phrase into the search bar.An example is a client of mine, which is a university: When we looked at the Site Search report, we saw regular searches for words like \"unit guide,\" \"Handbook,\" and \"unit guides,\" which told us that people researching what the university offers were finding it difficult to find content about their courses and potential study paths.Our solution was to make the university course handbook available to download on the homepage. Searches for the handbook plummeted. Likewise, audiences searched for \"important dates,\" \"timetable,\" and \"calendar.\"Again, what this told us was that people wanted to see what events were ongoing for a particular month at the University, but they could not find where this content was housed. Thus, we created a widget on the site that allowed visitors to find events and exam times.Think of the Site Search report as a visitor \"feedback\" section of your site. It allows you to identify gaps in your current content strategy or user-experience problems with the website.6. Behavior Flow reportWhere is it? BEHAVIOR > BEHAVIOR FLOWQuestions it will answer: Where is your audience going after they have landed on your blog page? Has the content been successful in driving people to the next stage of the funnel?We, as content marketers, often put so much time and effort into driving traffic to our content that we don't put much thought into what happens after they've consumed it. I've been guilty of this many times and when it comes to assessing content performance, I would use Behavior metrics such as Bounce Rate or Avg. Session Duration and make assessments on content performance from there.While these metrics are important, your assessment of the content performance is only half done, simply because as such metrics don't really give you any insight into one of the most important questions content marketers need to be answering: How is content contributing to the success of my business? This is where the Behavior Flow report can be useful.All content marketing campaigns need to have goals attached to them. By goals, I mean what is it that you want the content to do for your site and business? They could be to drive leads, email subscriptions, or whitepaper downloads. One of those goals could even just be traffic going to a specific page.Ask yourself, which pages on your website would you consider a \"conversion\" page? These are pages where, if someone lands on them, they have shown 'customer intent' and are a potential lead.My opinion is that a conversion page is any page on your site that allows for the researching of your product/service or business. Of course, these include your product pages, but could also include your Contact Us, About Us, or Case Studies pages.Testimonial pages may be another one, as visitors here show they are researching your business and your body of work. Therefore, they might be considering you or your product.In the case of the Behavior Flow report, you want to see how many visitors from the content that you produce go on to visit one of these \"conversion\" pages.Let’s look at a scenario: If someone comes to your blog via Facebook, they might consume the blog content and then choose to visit your Case Studies page, I would consider this experience a soft goal conversion for your content marketing campaign. Why? The blog content did its job of moving the visitor to consider you or your product. What you do with this information is up to you, but your next step could be to re-market to this visitor with more content or even your product via Facebook pixel Re-targeting.To use the Behavior Flow report, you need to set a filter to only see the \"blog\" URLS. Do this by clicking the cog wheel and filling out the Customize Dimension Items:Next, select a URL that you want to review in the \"Starting Pages\" column. Then start looking for those \"conversion pages\" in the chart.In the example below, we can see that two visitors landed on the \"who-we-are\" pages and one visitor filled out a form and received the \"Thank-you\" page screen.In total, the Behavior Flow report shows this blog post was essentially responsible for three conversions.These conversion pages must then be weighted in terms of value. If you suppose that a visitor to About Us is worth $5 to the business (2 visitors x $5 =$10) and the Thank You page is worth $150 (=$150), then you can surmise that this piece of content made your business $160. This report is valuable for ascertaining a potential ROI and content budget for future campaigns.There are many factors that can influence a user’s behavior path and it is up to you to A/B test the performance of such behavior. Play around with the CTAs on the site for three months and then measure the performance of those CTAs in the Behavior Flow report.ConclusionIn order to get better results from your Google Analytics data, I highly recommend you look into some more advanced content metrics such as setting up Events and Goals that align with your business, as well as creating specific UTM cookie campaigns to enable successful A/B testing of things like headlines and social snippets.I've had great success using the plan detailed above. I'm certain you can do the same.Please share your thoughts in the comments below. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Use Six Google Analytics Reports to Complete a Website Content Audit"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Use Six Google Analytics Reports to Complete a Website Content Audit"
    },
    {
      "level": "H2",
      "text": "Advanced Segments"
    },
    {
      "level": "H2",
      "text": "Calendar"
    },
    {
      "level": "H2",
      "text": "1. Channels report"
    },
    {
      "level": "H2",
      "text": "2. Landing Pages report"
    },
    {
      "level": "H2",
      "text": "3. New vs. returning visitors report"
    },
    {
      "level": "H2",
      "text": "4. Frequency & Recency report"
    },
    {
      "level": "H2",
      "text": "5. Site Search report"
    },
    {
      "level": "H2",
      "text": "6. Behavior Flow report"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Daniel Hochuli\n          \n            Daniel Hochuli\n          \n            Daniel Hochuli"
}