{
  "url": "https://moz.com/blog/how-to-explain-domain-authority",
  "slug": "how-to-explain-domain-authority",
  "title": "Best of Whiteboard Friday 2021: How to Explain Domain Authority to a Non-SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Do you ever have to explain the importance of Domain Authority to clients or co-workers who have little or no SEO experience? If so, this week’s Whiteboard Friday host — Andy Crestodina — walks through how to get your message across successfully.",
  "content": "Best of Whiteboard Friday 2021: How to Explain Domain Authority to a Non-SEO SEO Basics | Whiteboard Friday By: Andy Crestodina December 10, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Andy Crestodina December 10, 2021 Best of Whiteboard Friday 2021: How to Explain Domain Authority to a Non-SEO SEO Basics | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Next up in our top three 2021 Whiteboard Friday episodes, in this installment from February, Andy Crestodina walks through how to get your message across successfully if you ever have to explain the importance of Domain Authority to clients or co-workers who have little or no SEO experience. Click on the whiteboard image above to open a high resolution version in a new tab! Video Transcription SEO is actually really hard to explain. There are so many concepts. But it's also really important to explain so that we can show value to our clients and to our employers. My name is Andy Crestodina. I'm the co-founder of Orbit Media Studios. We're a web design company here in Chicago. I've been doing SEO for 20 years and explaining it for about as long. This video is my best attempt to help you explain a really important concept in SEO, which is Domain Authority, to someone who doesn't know anything at all about SEO, to someone who is non-technical, to someone who is maybe not even a marketer. Here is one framework, one set of language and words that you can use to try to explain Domain Authority to people who maybe need to understand it but don't have a background in this stuff whatsoever. Search ranking factors Okay. Here we go. Someone searches. They type something into a search engine. They see search results. Why do they see these search results instead of something else? The reason is: search ranking factors determined that these were going to be the top search results for that query or that keyword or that search phrase. Relevance There are two main search ranking factors, in the end two reasons why any web page ranks or doesn't rank for any phrase. Those two main factors are, first of all, the page itself, the words, the content, the keywords, the relevance. SEOs, we call this relevance. So that's the most important. That's one of the key search ranking factors is relevance, content and keywords and stuff on pages. I think everyone kind of gets that. But there's a second, super important search ranking factor. It's something that Google innovated and is now a really, really important thing across the web and all search. Links It's links. Do these pages have links to them? Are they trusted by other websites? Have other websites kind of voted for them based on their content? Have they referred back to it, cited it? Have they linked to these pages and these websites? That is called authority. So the two main search ranking factors are relevance and authority. Therefore, the two main types of SEO are on-page SEO, creating content, and off-site SEO, PR, link building, and authority. Because links basically are trust. Web page, links to web page, that's kind of like a vote. That's a vote of confidence. That's saying that this web page is probably credible, probably important. So links are credibility. Good way to think about it. Quantity matters. If a lot of pages link to your page, that adds credibility. That's important that there's a number of sites that link to you. Link quality Also important is the quality of those links. Links from sites that they themselves have many links to them are worth much more. So links from authoritative websites are more valuable than just any other link. It's the quantity and the quality of links to your website or links to your page that has a lot to do with whether or not you rank when people search for a related key phrase. If a page doesn't rank, it's got one of two problems almost always. It's either not a great page on the topic, or it's not a page on a site that is trusted by the search engine because it hasn't built up enough authority from other sites, related sites, media sites, other sites in the industry. The name for this stuff originally in Google was called PageRank. PageRank Capital P, capital R, one word, PageRank. Not web page, not search results page, but named after Larry Page, the guy who kind of came up with this, one of the co-founders at Google. PageRank was the number, 1 through 10, that we all used to kind of know. It was visible in this toolbar that we used back in the day. They stopped reporting on that. They don't update that anymore. We don't really know our PageRank anymore, so you can't really tell. So the way that we now understand whether a page is credible among other websites is by using tools that emulate PageRank by similarly crawling the internet, looking to see who's linking to who and then creating their own metrics, which are basically proxy metrics for PageRank. Domain Authority Moz has one. It's called Domain Authority. When spelled with the capital D and captial A, that's the Moz metric. Other search tools, other SEO tools also have their own, such as SEMrush has one called Authority Score. Ahrefs has one called Domain Rating. Alexa, another popular tool, has one called Competitive Power. They're all basically the same thing. They are showing whether or not a site or a page is trusted among other websites because of links to them. Now we know for a fact that some links are worth much, much more than others. We can do this by reading Google patents or by experiments or just best practices and expertise and firsthand knowledge that some links are worth much more. But it's not just that they're worth a little more. Links from sites with lots of authority are worth exponentially more. It's not really a fair fight. Some sites have tons and tons and tons of authority. Most sites have very, very little. So it's on a curve. It's a log scale. It's on an exponential curve the amount of authority that a site has and its ranking potential. The value of a link from another site to you is on an exponential curve. Links from some sites are worth exponentially more than links from other smaller sites, smaller blogs. These are quantifiable within these tools, tools like Moz, tools that emulate the PageRank metric. And what they can do is look at all of the pages that rank for a phrase, look at all of the authority of all of those sites and all of those pages, and then average them to show the likely difficulty of ranking for that key phrase. The difficulty would be more or less the average authority of the other pages that rank compared to the authority of your page and then determine whether that's a page that you actually have a chance of ranking for or not. This could be called something like keyword difficulty. I searched for \"baseball coaching\" using a tool. I used Moz, and I found that the difficulty for that key phrase was something like 46 out of 100. In other words, your page has to have about that much authority to have a chance of ranking for that phrase. There's a subtle difference between Page Authority and Domain Authority, but we're going to set that aside for now. \"Squash coaching,\" wow, different sport, less popular sport, less content, less competitive phrases ranking for that key phrase. Wow, \"squash coaching\" much less competitive. The difficulty for that was only 18. So that helps us understand the level of authority that we would have to have to have a chance of ranking for that key phrase. If we lack sufficient authority, it doesn't matter how awesome our page is, we're not likely to ever rank. So it's really important to understand one of the things that Domain Authority tells us is our ranking potential. Are we sufficiently trusted to be able to target that key phrase and potentially rank for that? That's the first thing that the Domain Authority defines, measures, shows. The second thing that it shows, which I mentioned a second ago, is the value of a link from another site to us. So if a super authoritative website links to us, high Domain Authority site, that Domain Authority in that case of that site is showing us the value of that link to us. A link from a site, a brand-new blog, a young site, a smaller brand would have a lower Domain Authority, indicating that that link would have far less value. Conclusion So bottom line, Domain Authority is a proxy for a metric inside Google, which we no longer have access to. It's created by an SEO tool, in this case Moz. When spelled with a capital D, capital A, it's Moz's own metric. It shows us two things. Domain Authority is the ranking potential of pages on that domain. And secondly, Domain Authority measures the value of another site should that site link back to your site. That's it. Hope this was helpful. Feel free to pass this along to anyone that you're trying to explain this to. Add to it. Let us know in the comments. Hope this was useful, and it was a huge pleasure and honor to be able to make a Whiteboard Friday for Moz. Again, Andy from Orbit Media. Thanks, everybody. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Best of Whiteboard Friday 2021: How to Explain Domain Authority to a Non-SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Best of Whiteboard Friday 2021: How to Explain Domain Authority to a Non-SEO"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Search ranking factors"
    },
    {
      "level": "H3",
      "text": "Relevance"
    },
    {
      "level": "H3",
      "text": "Links"
    },
    {
      "level": "H4",
      "text": "Link quality"
    },
    {
      "level": "H2",
      "text": "PageRank"
    },
    {
      "level": "H2",
      "text": "Domain Authority"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    }
  ],
  "author": "Andy Crestodina\n          \n            Andy Crestodina\n          \n            Andy Crestodina"
}