{
  "url": "https://moz.com/blog/how-seo-clients-endup-having-the-same-issues-and-asking-the-same-questions-its-not-about-seo-but-about-the-people",
  "slug": "how-seo-clients-endup-having-the-same-issues-and-asking-the-same-questions-its-not-about-seo-but-about-the-people",
  "title": "Why Clients Have the Same Issues/Questions - It's Not About SEO... But About the People! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I really enjoyed the recent Whiteboard Friday about Top 5 SEO Questions from SEOmoz customers and I was surprised by mainly two things: \n\n1. Most of the questions were basic",
  "content": "Why Clients Have the Same Issues/Questions - It's Not About SEO... But About the People! Public Relations By: Aleyda Solis June 13, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Aleyda Solis June 13, 2011 Why Clients Have the Same Issues/Questions - It's Not About SEO... But About the People! Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I really enjoyed the recent Whiteboard Friday about Top 5 SEO Questions from SEOmoz customers and I was surprised by mainly two things: 1. Most of the questions were basic As Cyrus commented in the video some of the questions were basic and focused on the \"technical\" (non-content) fundamentals of SEO. I think that this doesn't mean by any means that the SEOmoz community is not technically savvy: during my SEO consulting experience I have found that even with large organizations that have a strong Web development and system administration team these same \"basic\" errors -that cause the questions- still happen. Sometimes it is because SEO recommendations are seen as a set of activities that should only be performed once (when you provide them and afterwards are forgotten), instead of guidelines that should be integrated into the overall development process to validate any new web work. 2. The same questions are asked in other very different countries, languages and markets I used to work with clients focused on the travel, education and online gaming sectors, with SEO processes mainly in Spanish (for Spain and Latin American countries) and in English (for the UK and USA). Now I work for the local business market in Spain. And still, the SEO questions that are asked are pretty much the same. No matter which sector, language or country. I felt totally identified with the questions of that Whiteboard Friday because the day-to-day support I have given usually cover those same issues. It was definitely interesting to find out how the members of one of the strongest online SEO communities usually ask the exact same basic questions that I have been asked by my SEO clients –something that I wouldn’t expect-. Then a couple of days ago Dana Lookadoo tweeted a SEO “suggestion” that I related with these kind of issues: More and more Web developers, Web designers and even \"traditional\" marketers are getting interested on SEO, which is great, but instead of doing what you recommend they start following any SEO advice they find online... that even if it is about a generally effective technique (don't even mention when it's a black hat or smoke selling stuff), its implementation can ruin your SEO efforts simply because it doesn't fit into your specific process. So I commented to her how sad it was for me to find out that SEO consultants from the other side of the world find the same \"basic\" issues and Dana, wisely answered me: I think her answer shows a fundamental truth in our work: The usual problems we find are not caused by the complexity of the own SEO process, but by a human behavior related issue. It has to do more with the way we think and make decisions and this is why these issues are found in any sector, language or country. Moreover, the fact that our clients usually don’t see this principle can explain why it seems that even very experienced, business savvy marketers or business owners –those who make the decision to hire you as a SEO consultant and start a SEO process- have problems to consistently “relate” their “offline” business strategy with the SEO one. This happens because they fail to clearly see that SEO is much more than a set of technical and content “tricks” that you can use to rank well on search engines. They don’t see that SEO should “reflect” and work along well with their “offline” marketing strategy and correspond to their customer trends and behavior, since at the end of the day, it is about the people (their target market) that the website should be looking to attract and convert. Because of this, at the end of the day, the marketing manager of a large company and the local business owner usually end up asking the same basic SEO strategy related questions. Some of them are questions that have to do more with the business and less with SEO, that I would have never thought of being asked. For example, some of them are: 1. I'm starting a new business: Could you please suggest some SEO friendly names? Issue Background: A client was going to start a new business –I’m not talking about buying a new site, but to create a whole company- and in order to select the name of its new business wanted me to perform a keyword research to suggest him SEO friendly names. Solution: I asked the client if he really wanted to name his new business prioritizing SEO instead of branding principles he could be recognized with. I explained that if his brand (and domain) didn’t include highly relevant keywords, it didn’t mean the site wouldn’t be able to rank well: through an effective website architecture along with well organized, relevant content and many other on-page optimization techniques I could make sure the site is relevant and attractive not only to search engines but to the users. Additionally, I commented how it seems that Google is going to stop putting so much weight to the keywords on the domain and that the best was to base the SEO strategy in long-term principles. 2. I don't want to be related with a type of business but I want to rank with its keywords. Issue Background: A very niche but highly profitable line of business of the company started to get bad reputation because of fraudulent activities of the competition with that service. This service was practically known by a very specific term. Other companies stopped using that term to refer to this service they also provided to prevent being related with the well-known fraudulent activities of the competition. My client did the same in the “offline” world –eliminated any reference to that line of business using the term that had bad reputation- but asked me if he could still ranking in the search engines with it… even if he wanted to eliminate any reference to it from the website. Solution: I asked him to extrapolate the situation to the “offline” world. If he didn’t specifically add that term in the company advertising materials there wouldn’t be any possibility that his target market would know he provided it and get any benefit from it. The same happened in the online world. If he eliminated the term completely from the website, search engines and users wouldn’t have any means to identify that it’s relevant for that term. He asked me if there was any “technical trick” that could prevent that to happen and I answered that if he wanted to add to its reputation problem a search engine penalization one and possibly lose the site’s rankings there was always a way… but not a business consistent one, since even if he didn’t mind to be penalized, if visitors would reach its site with a term that was not shown in the content at all they possibly would feel deceived and leave the page. I suggested that he could keep an internal but visible and well optimized, quality page on its site describing that he had previously given that type of service, using the term he wanted to rank with, providing proof and warranties of his services, explaining how his business was different from the competition and why visitors should trust his business. 3. My business has diversified. I have internal sections in my site featuring the different areas where I provide my services but I want to keep ranking for a specific set of them with my home page. Issue Background: The client business had started providing a specific service in one city, so the home page featured it –since it was all what the company had-. After sometime the home page started to rank for those specific terms. A couple of years later the company had diversified and provided the same service for a dozen of cities. They enabled specific sections of the site for each one of them. The problem was that for the initial city they still were ranking with the Home Page. They had also enabled an internal section for it with unique content, so they had a content cannibalization problem. Sometimes they were ranking for that city related terms with the Home Page, others with the internal page. When asked to optimize the Home Page for more general business terms –and avoid the cannibalization problem- the client refused since he didn’t want to lose the Home Page rankings for the specific city related terms. Solution: I showed the client how the city internal page that was ranking for a very similar keyword than the home page had much better conversion rate since it gave much more information and arguments and optimized conversion channels to visitors. I also mentioned the client how the fact that the home page was optimized for that city specific terms instead of more general (but very relevant) ones, was preventing the possibility to rank with them which represented a very good (and feasible) SEO opportunity. Finally I commented how we could gradually optimize the Home Page for those general keywords and give more “signals” to search engines (from inside and outside the site) indicating how the most relevant page for the city related keywords was the internal one that would start gaining more popularity and ranking instead of the home page. If my assumptions are right some of you should have received similar questions from your clients! Have you? If so, have you suggested other ways to fix these same problems? Which other “fundamental” SEO strategy related questions that you would like to share have you been asked? Image under Creative Commons license taken from Flickr. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why Clients Have the Same Issues/Questions - It's Not About SEO... But About the People!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why Clients Have the Same Issues/Questions - It's Not About SEO... But About the People!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Aleyda Solis\n          \n            Aleyda Solis\n          \n            Aleyda Solis"
}