{
  "url": "https://moz.com/blog/how-can-ses-and-seos-work-together-to-improve-understanding-and-fight-spam",
  "slug": "how-can-ses-and-seos-work-together-to-improve-understanding-and-fight-spam",
  "title": "How Can SEs and SEOs Work Together to Improve Understanding and Fight Spam? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A lead came to me with a site that was using hidden keywords in the same colour as its background. He also stuffed other pages on his website full of keywords in the serious hope that this would enable him to rank for each of those keywords (i.e. a few hundred keywords per page). Imagine the…",
  "content": "How Can SEs and SEOs Work Together to Improve Understanding and Fight Spam? Public Relations By: Gabriel Goldenberg January 14, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Gabriel Goldenberg January 14, 2008 How Can SEs and SEOs Work Together to Improve Understanding and Fight Spam? Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. A lead came to me with a site that was using hidden keywords in the same colour as its background. He also stuffed other pages on his website full of keywords in the serious hope that this would enable him to rank for each of those keywords (i.e., a few hundred keywords per page). Imagine the blackhat spam circa 1997 and you would get an idea of the site I was looking at. Besides wanting to know what I thought of his site, he asked whether I thought he should buy something like 100,000 visitors for $100 to increase his Alexa ranking. I was polite and gave him a bunch of free suggestions to clean things up and improve the user experience. I also pointed out that hardly anyone besides webmasters looked at Alexa, and as he wasn't looking to bring webmasters to his site, ranking high at Alexa wouldn't provide a very good ROI. Never mind explaining that the \"traffic\" would likely consist of pop-up ads.. All this got me thinking, \"What could SEs and SEOs do together to improve the wider community's understanding of search and search marketing, as well as to fight spammy SEO and \"traffic\" providers?\" Some of the benefits that working together might provide include: Creating a demand for serious, high-quality SEO services Reducing wannabe spam and thus preventing eventual real spam (as the wannabes get educated and improve their spam techniques) Preventing SEOs from getting a bad name when people buy \"hits\" to 'increase their alexa' Focusing designers on better user experience What do you guys think SEs and SEOs can do in terms of working together, with the goal of improving the community at large's understanding of search, search marketing, and spam/spammy search marketing? I look forward to seeing your comments (and thumbing the good ones up ;) ). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Can SEs and SEOs Work Together to Improve Understanding and Fight Spam?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Can SEs and SEOs Work Together to Improve Understanding and Fight Spam?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Gabriel Goldenberg\n          \n            Gabriel Goldenberg\n          \n            Gabriel Goldenberg"
}