{
  "url": "https://moz.com/blog/how-much-does-google-make",
  "slug": "how-much-does-google-make",
  "title": "🥇 How Much Does Google Make? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Google made $58.8 Billion in revenues in 2013. This post is based on Google's 2010 revenues of $29.3 Billion, and it attempts to illustrate just how much money that is.",
  "content": "How Much Does Google Make? Public Relations By: Dr. Peter J. Meyers June 29, 2011 Table of Contents Copied! By: Dr. Peter J. Meyers June 29, 2011 How Much Does Google Make? Public Relations Since this post was written in 2011, Google's revenues have roughly tripled: Since this post was written in 2011, Google's revenues have roughly tripled. In 2014, Google made $65.67B in revenues. In 2015, Google made 74.5B. In 2016, Google made 89.46B. For fiscal year 2017, Google reported revenues of $110.8 Billion. In 2018, Google made 136.22B. Now, it’s easy to say that number and smile and nod like we understand how much money it is, but I doubt any of us really appreciates the sheer enormity of what we’re talking about. So, I thought it might be fun to try to illustrate exactly how much money Google makes. Let’s Write It Out This may sound obvious, but I think writing the number out is an important first step. The financial industry has a way of using shorthand to hide gigantic numbers. They can say things like “We only made $1B in profits last year!” with a straight face, as if they’re implying “C’mon, guys, it’s just a 1 (the smallest non-zero integer there is) followed by a ‘B’ (only the 2nd letter in the alphabet). It’s hardly anything!” So, let’s write it out in all its glory, just to keep from fooling ourselves: The color scheme has no significance – I just thought it was pretty. You can’t prove I didn’t. $29B = 29 Taj Mahals One of the most famous homes ever built, the Taj Mahal has ample living space at 500,000 square feet and 16 bathrooms. According to the internet, building your own Taj Mahal today would run you just over $1B US Dollars. Google could build 29 every year: Even if Larry, Sergey, and Eric each have a summer and winter Taj Majal, that still leaves 23 for the rest of the staff to live in. $29B = 17,000 Bugatti Veyrons The most expensive production car of 2011, according to Forbes, is the Bugatti Veyron 16.4, coming in at a sticker price of just $1.7M. Google could drive 17,058 of these bad boys off of the lot, but let’s call it an even 17,000, after your trade-in and destination fees. This is a Bugatti Veyron (yeah, it’s pretty sweet): The Bugatti Veyron 16.4 is listed as 106.7 inches long. Parked end to end, 17,000 Bugattis would be roughly 150,000 feet or just shy of 29 miles of luxury car: Somehow, that picture above just doesn’t do the number justice. Let’s say that we reduced each Bugatti to a 4x2-pixel red rectangle. Here’s what 17,000 of them would look like from space: Go ahead, count them if you want. I’ll wait. As of Q1 2010, Google employed 20,621 people full time, so each and every Google employee could be driving a Bugatti 9 months of the year, with just enough left over for gas. $29B = 3.6B Justin Bieber Albums If a Bugatti isn’t your style, maybe you’d like the latest Justin Bieber album, “Never Say Never” – it retails for $7.99 on iTunes. The cover looks something like this (the lightning bolts are magical Bieber aura): If you were Google, you could buy a copy of the album for just 3,600,000,000 (3.6B) of your closest friends. I guess the other half of the Earth is out of luck… Don’t worry, rest of Earth, there’s always next year. Google’s revenues jumped 27% in Q1 of 2011. $29B = A Lot of Money In summation, I leave you with one of my favorite clips from Spaceballs (PG-13). So, what does any of this mean for SEO? I’m no anti-Google conspiracy theorist, but I do believe that money talks, and $29,000,000,000 is a lot of conversations. Google is going to protect its interests, and we have to stop being surprised when they do. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Much Does Google Make?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Much Does Google Make?"
    },
    {
      "level": "H2",
      "text": "Let’s Write It Out"
    },
    {
      "level": "H2",
      "text": "$29B = 29 Taj Mahals"
    },
    {
      "level": "H2",
      "text": "$29B = 17,000 Bugatti Veyrons"
    },
    {
      "level": "H2",
      "text": "$29B = 3.6B Justin Bieber Albums"
    },
    {
      "level": "H2",
      "text": "$29B = A Lot of Money"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}