{
  "url": "https://moz.com/blog/how-to-live-blog-for-links-and-notoriety",
  "slug": "how-to-live-blog-for-links-and-notoriety",
  "title": "How to Live Blog for Links and Notoriety - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Live blogging is equal parts exhilarating, nerve wracking and pressure filled. You need to think fast and use both sides of your brain as you soak in and spit out information at the same time. I imagine that a live blogger probably looks very similar to cookie monster to other conference goers as…",
  "content": "How to Live Blog for Links and Notoriety Blogging By: Jeff Sauer October 24, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Jeff Sauer October 24, 2013 How to Live Blog for Links and Notoriety Blogging This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Apple has an announcement that makes the whole world skip a beat. Thousands of journalists and fanboys gather in an auditorium in Northern California to hear the big news and millions of us follow along from the comfort of our computers. Those of us watching along are among the first to know what products are coming out and how our lives will be enriched, almost as if we are sitting in the room and listening to Tim Cook speak while soaking in his Keynote slides. We feel connected to the event because some brave and kind soul is sitting in that audience, snapping photos and pecking away on their computer, formulating a story for the web that is published in near real-time. They are our trusted proxy, our window into the future. They are the live bloggers that we have unknowingly come to love. Live blogging is equal parts exhilarating, nerve wracking and pressure filled. You need to think fast and use both sides of your brain as you soak in and spit out information at the same time. I imagine that a live blogger probably looks very similar to cookie monster to other conference goers as you pound away furiously at your computer and snap countless photos of the speaker. It's also incredibly addicting, almost like running a marathon; You set out to do it once and swear you will never do it again. Then after short time off, you are training for the next big race. Now that I have several live blog posts under my belt, I wanted to share with you the benefits of live blogging and 10 simple steps that you can use to get started. Benefits of Live Blogging Live blogging a major conference or event provides several benefits to those who take on the commitment of sharing a story with the world. As you can probably tell from the title, some of the benefits include gaining links to your website and general notoriety for you and/or your company. Here are some more of the benefits to live blogging: Social Media Engagement If you are live blogging an event or conference with hundreds to thousands of attendees, chances are that this event is important to those in attendance. There will be a large number of photos being snapped, hashtags added to tweets and copious notes taken that outline every word said by the speakers. Those who can combine photos, notes and opinions into a consolidated blog post will find themselves in an ideal scenario for content discovery, because you are presenting to a highly engaged, captive audience. By writing about the event as it is happening and sharing to conference hashtags, you will have a great chance of receiving many retweets, favorites and shares. Strong Likelihood of Receiving Links You may also gain links from summary posts or email newsletters featuring a roundup of articles written about the event, often from high authority domains. For example, I was able to obtain a link from Search Engine Land after live blogging SMX Advanced 2013 by simply answering their request for links to any live blogs of the event. Another example comes from Matt Cutts himself, where he shares his live \"waving\" of the 2010 Google I/O conference (side note: Google Wave was really only in 2010? Seems like 100 years ago). You'll notice that his post not only included his own content, but also links to other live blogs of the event. Had any of us live blogged the event on our sites, we may have received the coveted Matt Cutts Get out of Jail Free card! Disclaimer: The chances of there truly being a get out of Google Jail free card are about the same that I will be hired for my Photoshop skills. In other words, not very likely. Fish Where the Fish Are While Striking the Hot Iron People will be most interested in what you have to say while the event or conference is taking place. By publishing a live blog post in a timely manner, you are both fishing where the fish are and striking while the iron is hot, which places you in an ideal position for content discovery and promotion. Even better, you can provide real value to those in attendance by sharing your thoughts as the event is taking place. Your thoughts can be even more valuable than the handwritten notes taken by attendees. As a live blogger, you have a chance to write history in your own voice. Speaker Introduction Through Flattery When I live-blogged an event for MnSearch where John Doherty was speaking, I made sure provide a thorough overview of John's talk, including screen shots of his slides and photos of the crowd taking in the presentation. When we search today for \"John Doherty MnSearch\" guess what shows up? Our live blog from the event. By recapping John's presentation and sharing his key points, I have provided value to him that lives on well beyond his short stay in Minnesota. That may come in handy should I ever need to reach out to John in the future. And For Those of You Watching at Home… When it comes to national conferences only a handful of those interested attending will actually make it to the event. The rest of us are sitting at our work desks following a hash tag through a window in our favorite Twitter client. Many conference viewers will read all of the tweets and click all of the links to relevant information about the conference. If you can be one of the first links that they see, then you increase your chances of being shared by these conference viewers. Conference followers likely have a much better Internet connection than those at the conference, so they can help you spread your content even further. You Get Over Your Writers Block By live blogging the presentation of another person, you can write a quality blog post packed with information, and it won't take that long to get it done. You can follow the format of their presentation, use their words to share interesting quotes, and have a clear introduction/conclusion based on the presentation you are watching. By having a clear beginning-middle-end for a blog post, you can avoid time-consuming activities like writer's block and indecisiveness. Bonus: If you share up-front with readers that you rushed the post out the door for their benefit, they will be more forgiving of minor spelling errors and poorly formatted sentences. They may even be friendly enough to suggest edits! Live Blogging Tools: What You Need to Get Started Now that you are convinced of the power of live blogging, it's time for your turn. Here is what you need to get started: 1) Choose a Target Event/Conference Conferences with a savvy social media audience are a good place to start, because you know that they will be capable of discovering your post. Make sure that you understand the confidentiality of what is being shared in the presentation. If you are specifically told not to share certain information, leave it out of your live blog post. The best live blog subjects are exclusive presentations containing information that is not readily available. Keynote speakers tend to be the best researched, rehearsed and inspiring part of the conference, so they make especially good live blog subjects. Both product announcements and keynotes will use a presentation structure that can be easily followed in your blog post. 2) Pick an Aisle Seat in the Front of the Crowd While you take photos of the speaker and their slides, you do not want to be taking photos of the top of heads in front of you. By sitting on the aisle, you can reach out your hand to take photos without alienating those behind you. 3) Use a Camera With Zoom Functionality Even though smart phone cameras are getting better zoom functionality, I highly recommend a point and shoot camera with an easy to use zoom function. By zooming in on the subject of focus, you can eliminate distractions from your photos and potentially reduce file sizes. 4) Photo Editing and Cropping Software It's surprisingly difficult to take a perfectly framed photo of the speaker on stage. Because of this, you can make your post look more professional by straightening and cropping images before you post them on the web. While I use Aperture on my Macbook to accomplish this task, I actually recommend iPhoto for photo editing due to ease of use and it doesn't drain battery life. You can also crop images within your smart phone if you do not have the patience to edit on your computer. 5) Draft Your Post in an Offline Blog Editor This is my strongest recommendation of them all. You need to use a blog editor to write the majority of your post. Don't try to live blog with a mobile app, a word document, a note taking program or posting directly to your blog's web interface. The reason is simple: you can write your entire post in the editor and submit to your blog when done. Desktop editors ensure that you will not lose any progress due to a lost Internet connection, and you can upload directly to your blog when done. I use a tool for Mac computers called Mars Edit, which provides me full ability to add photos and words to my posts. When I am ready to push to the web, this information is sent directly to Wordpress as a draft blog post that is ready for publishing. This allows me to write 90% of the blog post before needing an Internet connection. Since most conferences are notorious for poor Internet connections, this feature is a lifesaver. Windows users will want to try the highly rated Windows Live Writer application for their blog writing needs. 6) Make Sure You Have a Quality Internet Connection Even with an offline blog editor to do the majority of the work, you will still need an Internet connection to push your blog post live. Since your post will have many images to upload, it is important that you find a high-speed Internet connection with upload capabilities. This may require leaving the main conference room and finding an area with a solid wifi connection. 7) Bond With the Event/Conference Hash Tag on Twitter and Google+ Before you even begin to start your live blog post, make sure that you introduce yourself to the conference hashtags on Twitter and Google+. By simply saying \"I am so excited to be live blogging today's keynote #conferencecon\" you will be making others aware that you will soon be bringing the awesomeness. This will pay off in the end. 8) Bring a Laptop With a Long Battery Life This one has burned me a few times (both figuratively and literally). If you are blogging an event, make sure that your laptop is either connected to a power source or that you are closing applications to preserve battery life. Both times that I live blogged the Google Analytics Summit, I ran into an issue where my photo editing software drained my battery before I could get the post published. This meant that I had to close up my computer and find a power source outside of the main auditorium, wasting valuable time along the way. 9) Share Final Post With Communities You shouldn't limit the sharing of your live blog post to just a Twitter hashtag. Try looking at relevant communities on Google+ and write an introduction about why your live blog post is important to read. Do the same with LinkedIn, Facebook, Twitter, Stumbleupon, Reddit or any other community that may find your recap of the event to be useful. You never know which network will be a hit. 10) Spread the Wealth If you are not the only person live blogging, make sure to share the work of others alongside yours. Doing so will make you look unbiased and you gain goodwill from the others who worked as hard as you at posting. This provides benefit to all parties involved and elevates everyone to a higher level of notoriety. Final Thoughts on Live Blogging When it comes to benefitting from publishing a live blog, time is of the essence. The sooner you get your post up and running, the better chances you have of capturing the attention of conference attendees. My goal for a live blog post is to get complete information posted on the web within 1-2 hours of the time the presentation takes place. If you can complete your post in a timely manner, you may find yourself among the most shared sources for the entire conference. Once conference attendees go back to their offices, your opportunity for reaching them becomes limited. The key to live blogging is to start early and promote often. Your Turn Now it's your turn. The next time you go to a conference or a local event, I expect to see you live blogging what you see! Many of us would give up an entire day to earn a few more links. I'm only suggesting that you give up a few hours. That's a small price to pay for links and notoriety. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Live Blog for Links and Notoriety"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Live Blog for Links and Notoriety"
    },
    {
      "level": "H2",
      "text": "Benefits of Live Blogging"
    },
    {
      "level": "H3",
      "text": "Social Media Engagement"
    },
    {
      "level": "H3",
      "text": "Strong Likelihood of Receiving Links"
    },
    {
      "level": "H3",
      "text": "Fish Where the Fish Are While Striking the Hot Iron"
    },
    {
      "level": "H3",
      "text": "Speaker Introduction Through Flattery"
    },
    {
      "level": "H3",
      "text": "And For Those of You Watching at Home…"
    },
    {
      "level": "H3",
      "text": "You Get Over Your Writers Block"
    },
    {
      "level": "H2",
      "text": "Live Blogging Tools: What You Need to Get Started"
    },
    {
      "level": "H3",
      "text": "1) Choose a Target Event/Conference"
    },
    {
      "level": "H3",
      "text": "2) Pick an Aisle Seat in the Front of the Crowd"
    },
    {
      "level": "H3",
      "text": "3) Use a Camera With Zoom Functionality"
    },
    {
      "level": "H3",
      "text": "4) Photo Editing and Cropping Software"
    },
    {
      "level": "H3",
      "text": "5) Draft Your Post in an Offline Blog Editor"
    },
    {
      "level": "H3",
      "text": "6) Make Sure You Have a Quality Internet Connection"
    },
    {
      "level": "H3",
      "text": "7) Bond With the Event/Conference Hash Tag on Twitter and Google+"
    },
    {
      "level": "H3",
      "text": "8) Bring a Laptop With a Long Battery Life"
    },
    {
      "level": "H3",
      "text": "9) Share Final Post With Communities"
    },
    {
      "level": "H3",
      "text": "10) Spread the Wealth"
    },
    {
      "level": "H2",
      "text": "Final Thoughts on Live Blogging"
    },
    {
      "level": "H3",
      "text": "Your Turn"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jeff Sauer\n          \n            Jeff Sauer\n          \n            Jeff Sauer"
}