{
  "url": "https://moz.com/blog/how-to-stay-creative-seo-content-strategy",
  "slug": "how-to-stay-creative-seo-content-strategy",
  "title": "How to Stay Creative With an SEO-Driven Content Strategy - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There are ways to remain creative even within a grander, primarily SEO-driven strategy. Here, let's dive into six tips to ensure you don't have to sacrifice your own creative freedom for the sake of organic growth.",
  "content": "How to Stay Creative With an SEO-Driven Content Strategy Content Marketing | SEO Copywriting By: Caroline Forsey May 11, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Caroline Forsey May 11, 2020 How to Stay Creative With an SEO-Driven Content Strategy Content Marketing | SEO Copywriting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. When I first joined HubSpot's blogging team in January 2018, I loved our writing process. Once a month, we all met in a conference room with a list of ideas on Google Docs which were pitched one-by-one (intricate, I know). The process was extremely creative, iterative, and collaborative. Of course, it was also often a matter of guess-and-check. Plus, brainstorming can be a bit of a selfish process. The ideas I pitched in those meetings, I pitched in part because I wanted to write them and because I was interested in them as a reader. I could only hope our audience would be interested as well. While we developed a pulse for understanding what our readers liked from reviewing top viewed posts from the past, our process didn't enable us to develop content that matched what our potential readers wanted from us. So, just a few months into 2018, our team pivoted and created a brand new SEO-driven content strategy to address our inability to move forward. Take a look at the organic growth we've seen as a result of that strategy over the past two years: How did we do it? To start, the blogging team partnered with the SEO team. The SEO team now delivers a fresh Search Insights Report (what we've come to affectionately call the \"SIR\") to us every quarter, which are packed with blog topics vetted for search potential. We diligently move down the list, assigning individual blog topics to be written or updated by writers on the team. From the graph above, you can see the almost immediate growth we expereinced as a result of this new strategy. Within two years, we more than doubled the keywords for which we rank on page one. As Editor of HubSpot's Marketing Blog, this left me with a bit of a void. I was thrilled to see the results of the SIRs and recognized how they helped us reach new audiences and rekindle our organic traffic, but, from a personal perspective, I missed the creativity that came with pitching big-risk ideas and watching them pay off. (Believe it or not, articles like \"What Is Semi-Structured Data?\" wasn't exactly what I dreamt about publishing when obtaining my English degree.) However, I've learned over the past year that there are ways to remain creative even within a grander, primarily SEO-driven strategy. Here, let's dive into six tips to ensure you don't have to sacrifice your own creative freedom for the sake of organic growth. 1. Enlist the help of experts to spark creativity while ensuring posts are still keyword-driven. A few months ago, I tackled the topic of first versus third party APIs. While I am confident in writing about our product line, \"Force quit\" is about the extent of my software knowledge (option+command+esc, for those wondering), so I dreaded writing the post. It was both daunting and not particularly inspiring to me as a writer. Of course, I could've written this post the way I've written about plenty of other dry topics — by sludging through it, chugging copious amounts of coffee, and listening to Spotify to make it a little more \"fun\". However, when I began writing the post, I wasn't impressed with my work. Since I didn't fully grasp the concept, it was surface-level and ambiguous. If a marketer stumbled across it, they wouldn't learn much. To solve for this issue, I reached out to a few IT specialists at HubSpot and ended up speaking to two developer support specialists. I even met with one of them via Zoom to further discuss the intricacies of APIs, and recorded the meeting to transcribe later on. Suddenly, I felt like an investigative reporter. I collected quotes from experts in the field, drafted up a new post that made sense to both myself and the developer support specialists, and published it. I was incredibly proud of the piece because I felt I'd worked as a liaison between the developer world and the marketing world, making the whole concept of APIs a little clearer to my team while ensuring it remained accurate and tactical. If you're feeling frustrated by a topic you don't feel comfortable writing about, don't hesitate to reach out to experts — even within your own company. Their passion for the subject will fuel your desire to write the piece from a more human angle. Remember, keyword-driven content still leaves plenty of room to angle the piece in a number of interesting directions, as long as the insight you're providing aligns with the intent of the keyword you're targeting. 2. Interview leaders in various industries and tell their stories. Over the past year, I've spoken to happiness researcher and speaker Shawn Achor on how happiness leads to success, Harvard professor Amy Edmondson on psychological safety in the workplace, and leadership consultant Simon Hazeldine on using performance psychology to get ahead in the workplace, among many others. These posts, which enabled me to synthesize complex psychological issues and translate them into tactical strategies for marketers, allowed me to exercise my creative muscle. I interviewed experts via email or on the phone, and used their responses to craft meaningful, coherent narratives. Ultimately, I never felt more \"in the flow\" than I did when writing these posts. Your industry undoubtedly has leaders that interest you. If you're a marketer in the catering or hospitality industries, consider speaking to top chefs in the area. Alternatively, if you're a marketer for an e-commerce website, try reaching out to e-commerce consultants to get quotes about the future of the industry. It's not impossible to align your own interests with business impact, even if those interests are outside the scope of traditional marketing. As someone who's personally interested in psychology, for instance, I was able to find the intersection between psychology and workplace performance, which helps our readers grow in their own roles. Including feedback from experts can also give you a competitive advantage in the SERPs. For instance, we published \"HubSpot Marketers Give 6 Tips for Fighting Burnout\", on January 20, 2020, and within one month, it already had over 5,000 views. This piece, over time, will likely perform better than a more generic \"how to fight burnout\" piece without the expert angle. Ultimately, it's important to consider who you're interested in speaking with and how that expert's experience might align with your audience's interests, and brainstorm ideas from there. 3. Find the human connection. As marketers, we're often tasked with writing about less-than-thrilling topics, particularly if these topics are part of a keyword-driven strategy. For example, take a quick glimpse at some of the pieces we've seen on our SIR in the past: These titles are helpful for our readers, but presenting the information in a creative way becomes difficult. I often tell new writers on the team that you can find an interesting human angle to any topic, no matter how boring it may seem, which makes writing about the topic more exciting and offers more ways for readers to connect with the piece. The easiest way to find the human angle is to consider the reader's point of view when searching a topic on Google. Start by asking yourself, \"why would I ever search for this topic?\" Searches don't happen in silos. Nowadays, Google is increasingly trying to continue a \"searcher's journey\" through People Also Ask boxes, People Also Search For panels, and Related Search links at the bottom of most SERPs. These features enable searchers to rethink their search and find similar, relevant answers to other questions they might have. Ultimately, anyone searching for one keyword is searching for that keyword as part of a larger marketing and business strategy. As a content creator, it's critical you find the bigger picture element and use these new SERP features to tell more creative, holistic stories around the topic at hand. For instance, recently I wrote a post on how to embed videos in emails. The body of the post itself, I knew, allowed for little creativity — it was essentially a brief step-by-step guide to embedding video. However, I could still find space for creativity in my introduction, and I knew that meant developing empathy for my reader. I started by imagining the motivation behind any marketer searching \"how to embed video in email\". They are likely someone who's struggling to increase CTR or email subscriptions, so I introduced the topic with a brief, big-picture overview on why email is important for a business's bottom line (in case you wanted to know, it’s because 87% of businesses use video in their marketing tactics). Then, I empathize with the reader, acknowledging that sprucing up your emails isn't always easy, and neither is embedding videos — particularly since major email clients don't support video embeds. Suddenly, a topic I'd initially found boring became exciting to me because I could sense the urgency and real-world impact that publishing the piece and answering the reader's query would have. In essence, what they’re really asking is \"How can I continue creating engaging content for my audience?\" That's a human angle to which I think we can all relate. 4. Use multimedia to freshen up old content. If you're struggling with a particularly dry topic, you might evoke creativity by adding multimedia elements like podcasts, YouTube videos, images, or graphs — all of which open up new traffic opportunities since you can generate image traffic through the SERPs as well. These designs can help you stay engaged when writing the piece, and can also help your post rank on Google, since search engines prefer multimedia components such as images or video. For instance, we embedded a video in \"How to Create An Incredibly Well-Written Executive Summary [+ Example]\". Readers have the option of reading my post, but alternatively, they can watch the discussion take place on-screen. Of course, multimedia depends on your budget. We aren't able to add a video to every post we produce. However, there are plenty of simpler forms of multimedia that are free, such as embedded images and graphs. Additionally, if you're interested in other aspects of marketing besides writing, this is a good chance to expand your professional portfolio and learn a new skill as well. 5. Frame your content from a unique angle that differentiates it from other search results. It's important to note: not all posts need to agree with what's already on the SERPs for you to rank. For instance, my colleague Lestraundra wrote \"10 Reasons Why You Don't Need a CRM\". This article currently ranks on page one for the search query \"you don't need a CRM\" ... but the article actually explains why you do need a CRM, in a playfully sarcastic way. We managed to rank well while also giving readers something they weren't expecting. You might consider similar provocative arguments you can make, as the uniqueness (and sometimes controversy) of your writing will enable you to rise up the ranks on the SERPs while providing fresh, interesting content to your audience. 6. Engage with your readers in real life whenever possible. On one particularly uninspiring day, I set up a 30-minute chat with a customer to learn more about her personal marketing challenges. As we spoke, I realized how out-of-touch I'd become with some of our readers’ primary struggles. For instance, she was a team of one, which meant while she understood the importance of blogging, she didn't always have time to develop an in-depth strategy since she was juggling content creation for social media, email marketing, and PR for her small business. When I got back to my desk, I had no problem writing my assigned post about free social media analytics tools, because I understood the real-world importance of this post for that reader's daily life. Ultimately, she didn't have time to research the pros and cons of various tools, and she didn't have a budget for anything fancy. The inspiration and creativity I felt that day derived from my in-person interaction with my reader. Of course, it's not always possible to set up a call with a customer, but there are plenty of other options for engaging with readers. For instance, you might consider creating a poll for your social media audience, engaging with readers in a Twitter chat, or sending a survey to your readers in an email newsletter to learn more about what they want from your brand. Conclusion Ultimately, it can be difficult to stay creative when your department is primarily focused on using technical SEO to achieve major goals. And, of course, you'd never want to entirely forgo SEO for the sake of creativity, since that prevents you from reaching a larger audience and ensuring your content is useful and actionable for your readers. Nonetheless, if there's anything I've learned over the past two years as a result of our new strategy, it's that analytics and creativity can, indeed, work hand-in-hand. Ideally, with these six tips, you'll be able to inspire some creativity in your daily process. Feel free to comment below with your own thoughts — I'd love to hear them! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Stay Creative With an SEO-Driven Content Strategy"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Stay Creative With an SEO-Driven Content Strategy"
    },
    {
      "level": "H2",
      "text": "1. Enlist the help of experts to spark creativity while ensuring posts are still keyword-driven."
    },
    {
      "level": "H2",
      "text": "2. Interview leaders in various industries and tell their stories."
    },
    {
      "level": "H2",
      "text": "3. Find the human connection."
    },
    {
      "level": "H2",
      "text": "4. Use multimedia to freshen up old content."
    },
    {
      "level": "H2",
      "text": "5. Frame your content from a unique angle that differentiates it from other search results."
    },
    {
      "level": "H2",
      "text": "6. Engage with your readers in real life whenever possible."
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Caroline Forsey\n          \n            Caroline Forsey\n          \n            Caroline Forsey"
}