{
  "url": "https://moz.com/blog/how-to-take-advantage-of-the-coming-web-20-crash",
  "slug": "how-to-take-advantage-of-the-coming-web-20-crash",
  "title": "How to Take Advantage of the Coming Web 2.0 Crash - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A favorite quote from last week:\n\nEvery single person working in the media today who experienced the dot-com bubble in 1999 to 2000 believes that we are going through the exact same process and can expect the exact same results—a bust. It's déjà vu all o...",
  "content": "How to Take Advantage of the Coming Web 2.0 Crash Marketing Industry By: Rand Fishkin August 13, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 13, 2007 How to Take Advantage of the Coming Web 2.0 Crash Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. A favorite quote from last week: Every single person working in the media today who experienced the dot-com bubble in 1999 to 2000 believes that we are going through the exact same process and can expect the exact same results—a bust. It's déjà vu all over again.... I can assure you that after this next collapse, nobody will think of the dot-com bubble as anything other than a prelude. I'm actually in a camp that disagrees with most of what Mr. Dvorak has to say (like Marshall), but I'll play along. Let's say the bubble is only a year or two away from bursting and imagine how that hypothetical world would function. STEP 1: Investors Flee from Public Internet Stocks This is typically the first step - some bad news comes out of Yahoo!, Google, Microsoft, IAC & Amazon all in the same few week span and stock market traders start selling shares at losses like it's going out of style. Remember how the stock market works, though - no one's bidding on what they think the value of a stock is, nor are they bidding on what they think others think it's worth. The stock market prices shares based on what other investors think other investors think (yes, you read that right). It's all about the opinions of the opinions of others - hence the Random Walk theory. STEP 2: Private Investors & Venture Capital Gets Squeemish With the possibility for massive valuations from a public offering diminished, private money retreats into hiding. This, combined with the Wall St. losses create - STEP 3: Investment, Marketing, R&D and Overall Growth Screech to a Halt When money starts drying up externally, companies of all kinds freeze spending, start layoffs and kill development projects. In the last dot-com crash, we saw plenty of irrational spending freezes - freezes even on those spends that had a positive ROI - simply because management didn't want the association with the doomed \"Internet sector.\" STEP 4: Eveyone Goes Out of Business This is the part I hate. Companies large and small declare huge losses and, often, Chapter 11. Why? Because all of that development they've done and all of those products and service they provide suddenly aren't doing much of anything because none of the other companies are buying. The irony is - the stock market and the private investors will hold up the companies' failures and closures as evidence for why their withdrawal of money (up in Step 1 & 2) were wise moves, when, in fact, they were the catalysts for the events, not the fortune tellers they'll claim to be. STEP 5: Enterpreneurs Start from Scratch All those scrappy, smart, out-of-work programmers and biz-dev leaders will pout for a few months, then eventually find a job, oftentimes in startup environments with little to no capital. Over time they'll produce the next Google/YouTube/Facebook, investors will come flocking back and the cycle of boom will begin anew. Here's what doesn't happen during the above process: Users don't stop searching the web for products, services & information Said users don't stop clicking search ads They don't stop being influenced by online branding They don't stop buying (unless the macro-economy has gone to hell at the same time, but even then, many of them will still be buying) Remember when Frankie told us that \"the only thing we have to fear is fear itself?\" Truer words were never spoken - and they're just as relevant to the dot-com collapse as they were to the stock market crash. But, if there's nothing we can do to stop investor pessimism, at least we can profit from it. So, now that we know what's coming, how do we take advantage of it? Build a Rainy Day Investment Fund - you'll need to have some cash to keep going through potentially tough times, but if you can spend while others have to save, you'll be in beautiful shape. Operate Properties in Multiple Spheres - consulting is a great gig while times are good, but a downturn can mean a lot of irrational halting of expenditures, so make sure you've got some pre-determined business ideas into which you can invest yourself. Select Sectors with Immunity - In the offline economy, alcohol and funeral homes are good examples of businesses with cyclical immunity. The online world has plenty, too - ecommerce (remember that no one stops buying online just because investors think Internet stocks are a poor choice), adult content, news, luxury goods - these are all consumed with little regard to the economic perception of the web. Spend When Others Slack - If the ad market on the web suddenly dries up (as it did last crash), you can sweep in and grab a lot of very juicy ads at far below market value, and get a massive ROI on them. Release Positive News - The media will want to harp on the downturn for a while, but they'll also be looking to temper that with good news, so if you can make your business stand out during a slow period, you've got a great chance to be in the press. Gobble Up Competitors - If memory serves, acquiring Internet properties in 2002 was like taking candy from a baby. Get ready for that market again by keeping your eye on companies and sites with real value who might have overextended themselves but have great potential to rise again. I'm sure you've got more tips for how to prosper in a downturned market - please do share. If Dvorak's right, at least we'll know what to do when the Silicon Valley party goes to bed. p.s. Back from vacation and gearing up for San Jose SES next week. So much email to slog through.... ugh. And thanks to Brian for the great link round-up. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Take Advantage of the Coming Web 2.0 Crash"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Take Advantage of the Coming Web 2.0 Crash"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}