{
  "url": "https://moz.com/blog/how-to-use-tumblr-for-seo-and-social-media-marketing",
  "slug": "how-to-use-tumblr-for-seo-and-social-media-marketing",
  "title": "How to Use Tumblr for SEO and Social Media Marketing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Many people overlook Tumblr, but it has tremendous potential for SEO and social media marketing. I myself was slow to adopt it as a social media platform, but once I started using it I became hooked by its power and simplicity. Hopefully by the end of this post, you'll feel the same.",
  "content": "How to Use Tumblr for SEO and Social Media Marketing Social Media By: Takeshi Young September 18, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Takeshi Young September 18, 2013 How to Use Tumblr for SEO and Social Media Marketing Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. An introduction to Tumblr There are so many social media platforms out there today that online marketers have to be concerned about when promoting content online, that it can be easy to overlook some of the important ones. Tumblr is one of those social networks which is often overlooked, but which has tremendous potential for SEO and social media marketing. I myself was slow to adopt Tumblr as a social media platform, but once I started using it I became hooked by its power and simplicity. Hopefully by the end of this post, you'll feel the same. In this post today I will be covering 1) What Tumblr is and how it works, 2) The benefits of Tumblr compared to other social networks, and 3) Actionable advice on how you can use Tumblr for online marketing, including specific content ideas. Sounds good? Let's get started. Why should I care about Tumblr? Before we get too far, let me provide some stats about Tumblr which should help put things into perspective: 130.5 million blogs on Tumblr, as of August 2013 28th highest traffic site on the web according to Comscore 300 million unique monthly visitors according to Yahoo 50% of Tumblr users are under the age of 25 53.5% of Tumblr visitors are female As you can see, the numbers are massive. There are now over 130 million Tumblr blogs (known as \"tumblrogs\"), which makes Tumblr the largest hosted blog platform on the web, compared to the 70 million blogs hosted on Wordpress.com. It has 300 million monthly visitors, basically 15% of all Internet users. And it has a demographic that is unique in that 50% of the users are under 25, many of whom are teenagers (whereas teens are reportedly ditching Facebook in droves). Big brands have taken notice of this too. In May, Yahoo purchased Tumblr for $1.1 billion (the largest purchase of a consumer Internet company since Google bought YouTube), and many of the world's largest brands already have a presence on Tumblr. Clearly, if you're not on Tumblr by now, you're falling behind the curve. What is Tumblr? So what the heck is this Tumblr thing anyway? It can be hard to describe Tumblr because it combines the functionality of many different kinds of sites. The way I like to think of Tumblr is as a cross between Wordpress and Facebook-- Tumblr has all the blogging functionality of a blog platform such as Wordpress, but also includes all the features of a social site such as hashtags, following, sharing, and liking. Tumblr is similar to Pinterest in many ways, except instead of multiple boards you have a single blog. So although Tumblr is one of the most popular blogging (or microblogging) platforms on the web, it goes beyond just being a blog and allows users to share and like each other's content, follow other Tumblr blogs, and discover new content through hashtags. It's a blog platform with built-in social functionality and incredible viral potential. The benefits of Tumblr Ok, so now we have a better idea of what Tumblr is and why it's important, but what are the benefits of Tumblr compared to other social networks and blogging platforms? There are 5 key benefits: 1) Dofollow links First the biggie. Links from Tumblr, unlike most other social networks are dofollow. Tumblr is at its core a blogging platform, and you have full control of how your tumblrog appears, including using dofollow links on your site. Where things get interesting is when you consider the social aspect of Tumblr. Tumblr has social sharing functionality (called \"reblogging\" in Tumblr parlance) built right in, and if you have a popular post it will be reposted to many other tumblrogs. The thing is that each of these reblogs is a dofollow backlink to your original post! That means if you have a post that is reblogged 100 times, your tumblr blog just got 100 dofollow backlinks! For even more fun, you can include a link within the post itself. By doing so, both your original post on Tumblr, and the site linked to within the post will receive the backlinks. Just imagine if every time your content got shared on Facebook, all those shares were dofollow backlinks. Wouldn't that be nice? With Tumblr, this is the case. The same is also true with Google+ (Pinterest also recently dofollowed their links), but Tumblr has a more active user community and it's much easier to have your content go viral on Tumblr. Of course, you will want to be careful about what kind of anchor text you're using in this post-Penguin world, but if you're looking for some easy, dofollow backlinks, Tumblr is the place to get them. 2) Great content discovery Another great benefit of Tumblr is that it has a great content discovery system built into it, thanks to its use of hashtags. If you're ever looking for great images or memes, try searching Tumblr for the hashtag, and you'll find some good material. The great thing about Tumblr is that people actually use hashtags for content discovery (unlike, say, Facebook). This means that by using relevant and popular tags, it's super easy for your content to get discovered on Tumblr, even if you don't have many followers. I have literally created brand new tumblrogs from scratch, and received dozens of reblogs for my content, even though I had zero followers. And remember, on Tumblr reblogs are dofollow backlinks. This is definitely not the case on social networks such as Facebook, where your content probably isn't going to get a lot of love unless you already have a large number of followers. 3) Content testing ground Another use for Tumblr is as a content testing ground. If you do a lot of social media marketing, you probably have tons of memes and images that you are considering posting to your Facebook page, or you if you create your own memes you may have different variations of a meme that you might want to test. One of the ways that I like to use Tumblr is as a testing ground for new content that I've created. Tumblr's dashboard is chronological like Twitter vs the more curated approach of Facebook's news feed, and the upshot of this is that you can post a lot more content at once to Tumblr than you would want to on Facebook. Tumblr fans are more forgiving of less-than-outstanding content because they can simply scroll past it, similar to how users browse Pinterest. This makes Tumblr a great place to post a lot of content to find which pieces perform the best. Then you can take the most popular pieces and repost them to your other social media profiles such as Facebook. And all the content you produce on Tumblr has a chance of being discovered later, thanks to the use of hashtags. 4) Microsites Tumblr is the most popular microblogging platforms on the planet, which also makes it an ideal platform for setting up microsites. You won't get the same amount of flexibility as you would with say a self-hosted Wordpress blog, but tumblrogs are quick to set up, simple to manage, and free. And if you want to switch from using a tumblr.com subdomain to your own domain name, it's easy to switch to a domain name you own in the Tumblr settings. Using Tumblr for microsites is a great way to build up a collection of web properties with decent PageRank that you can then point back to your main site. If you consistently post high quality content, it's easy to get these tumblrogs to PR2 - PR4 within a few months. Microsites are also a great option if your main brand is super serious, and you don't necessarily want to associate it with memes and other silly content that does well on Tumblr. 5) Branding Last, but certainly not least, Tumblr is another tool in your arsenal to promote your brand online. In addition to the other major social sites such as Facebook and Twitter, Tumblr provides another opportunity for you to establish your web presence. It's another chance for your to engage with fans, build relationships with potential customers, and get your brand name out there, especially if you want to target a younger demographic. As the online marketer Pat Flynn always says, the best marketing strategy online is to Be Everywhere. Content ideas for Tumblr Hopefully by now you're convinced of what a great opportunity Tumblr is for link building, content marketing, and branding. You may have even gone ahead and created your own tumblrog. Good work. But what kind of content does well on Tumblr? Tumblr, like most other social sites, is a visual medium. That means that captivating images and pictures will do better on Tumblr than long form text. If you're already conducting successful social media campaigns on sites such as Facebook and Google+, then reusing the same content you're posting there is a good strategy. If you want some specific example of content to post on Tumblr, here are 4 types of content that I've found perform extremely well Tumblr: 1) Memes Memes are my favorite type of content to promote on social media. Memes are just the ideal type of content for people to consume and share via social media channels, and they're viral almost by definition. You can have a lot of success just by curating funny memes related to your niche that you find across the web, but the greatest potential lies in creating your own. If you want to try your hand at making memes with some serious viral potential, check out this post I wrote for the Moz blog. 2) Photos/illustrations As with Pinterest and Facebook, compelling images are some of the most popular pieces of content on Tumblr. This is especially true since there is a huge userbase of teenagers with attention spans that are shorter than even most Twitter addicts. Creating great photos isn't easy, but it's not impossible to do if you have a access to a DSLR. Even if your camera equipment isn't up to snuff, apps such as Instagram can take your ordinary photos and give them a vintage feel that appeals to the teen and hipster demographic. Drawings and illustrations also do very well on Tumblr, and if you have an in-house graphic design team, definitely leverage that. Even if you don't have graphical talent, you can go to sites such as Fiverr, Upwork, and DeviantArt to get custom artwork created for you that's specific to your niche. If all else fails, you can just curate other people's photos and artwork and see some results, but always be mindful of any copyright issues, and give credit where credit is due. 3) Quotes Quotes are an amazingly easy type of content to create that surprisingly few marketers are taking advantage of. Quotes are great because they're simple to create, even if you don't even have any graphical talent. Just take an inspirational quote, put it over an attractive image (or even just a plain background), and you suddenly have a piece of content that can go viral not just on Tumblr, but on sites like Facebook, Pinterest, and Google+ as well. It's super easy. 4) Animated GIFs Like Google+, Tumblr allows you to use animated GIFs in your posts. These are incredibly popular with Tumblr users. Now, creating animated GIFs is beyond my abilities, but it's really simple to just take existing animated GIFs, add a clever caption to them, and post them on your tumblrog. Instant backlinks, guaranteed. When my client asks me why their rankings fluctuate every day, I’m like… For a great example of this, check out the This Advertising Life Tumblr. It's an incredibly funny site, and has a PageRank of 5 to boot. You can easily find great animated GIFs to use by searching Tumblr for tags such as \"animated GIF\" or simply \"GIF\". There are also sites such as ForGIFS which contain nothing but funny animated GIFs. Wrap-up Tumblr is one of the largest social media and blogging platforms in the world, yet it is often ignored by online marketers. Hopefully this post has showed you why you should add Tumblr to your marketing mix, as well as provided you with concrete content ideas you can use to drive success on your tumblrog. I have built dozens of Tumblr blogs over the past year, and I can guarantee you that if you use the content ideas above, and post on a consistent basis, you will be able to build up a large following on Tumblr and build some strong backlinks to your sites, as well as promote your content and build your brand online. If you have any questions, feel free to post in the comments or hit me up on Twitter. You can also check out more of my ramblings on my blog. This post was adapted from a presentation I delivered at SMX Toronto. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Use Tumblr for SEO and Social Media Marketing"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Use Tumblr for SEO and Social Media Marketing"
    },
    {
      "level": "H2",
      "text": "An introduction to Tumblr"
    },
    {
      "level": "H2",
      "text": "Why should I care about Tumblr?"
    },
    {
      "level": "H2",
      "text": "What is Tumblr?"
    },
    {
      "level": "H2",
      "text": "The benefits of Tumblr"
    },
    {
      "level": "H3",
      "text": "1) Dofollow links"
    },
    {
      "level": "H3",
      "text": "2) Great content discovery"
    },
    {
      "level": "H3",
      "text": "3) Content testing ground"
    },
    {
      "level": "H3",
      "text": "4) Microsites"
    },
    {
      "level": "H3",
      "text": "5) Branding"
    },
    {
      "level": "H2",
      "text": "Content ideas for Tumblr"
    },
    {
      "level": "H3",
      "text": "1) Memes"
    },
    {
      "level": "H3",
      "text": "2) Photos/illustrations"
    },
    {
      "level": "H3",
      "text": "3) Quotes"
    },
    {
      "level": "H3",
      "text": "4) Animated GIFs"
    },
    {
      "level": "H2",
      "text": "Wrap-up"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Takeshi Young\n          \n            Takeshi Young\n          \n            Takeshi Young"
}