{
  "url": "https://moz.com/blog/how-google-will-use-social-media-to-impact-organic-search",
  "slug": "how-google-will-use-social-media-to-impact-organic-search",
  "title": "How Google Will Use Social Media to Impact Organic Search - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": " It’s going to happen – Google will start interpreting the social link graphs to influence their organic search results. In my opinion, the following is a strong look into how Google will begin interpreting social media. I came to this conclusion based on current and historical algorithm tendencies…",
  "content": "How Google Will Use Social Media to Impact Organic Search Social Media By: Ross Hudgens April 28, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Ross Hudgens April 28, 2010 How Google Will Use Social Media to Impact Organic Search Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. It’s going to happen – Google will start interpreting the social link graphs to influence their organic search results. In my opinion, the following is a strong look into how Google will begin interpreting social media. I came to this conclusion based on current and historical algorithm tendencies and, based on that, how it can rationally be applied to social media. The Social World and the Current State of the SERPs Twitter acts just as link exchange occurred before Twitter ever existed, just in dramatically higher volume. The kinds of links exchanged are the same as they were when internet was restricted to blogs and news aggregators. Because of this, any distribution of the non-social (see: payday loans, insurance, etc) is unusual, and large link spikes or unusual link profiles will be quickly noticed and devalued, if not de-indexed for their transgressions. For these exact reasons, many areas of SEO will remain virtually unchanged. The avenues of business that remain unfriendly to conversation will remain that way, and because of that, social media integration will mean little to nothing to these regions. However, in verticals where content is king, linkbait is the meal of choice and “the conversation” means everything, the Twitter world will have to be taken very seriously. User Trust, Profile Age & the Power of the @ Symbol Just as Google uses several variables to measure website trusts, similar factors will come into play to leverage profile trust, and how it will impact the SERPs. The “trust level” of a user can be weighed by various factors: Follower count – Like links on the internet, not every follower is made equal. If we can determine what user has a legitimate user count, so can Google. Things like follower interaction & the followed-to-following count of its followers can be weighed to determine how trustworthy the web has determined this Twitter account to be. Use of @accountname – The volume of your @accountname appearances on Twitter is a strong indicator of trust. This can be unsolicited user interactions or retweets of content. Even if someone is making 15,000 cold interactions with fake followers to increase this, it takes some sort of trust for the act to be reciprocated. The ratio and volume of these occurrences are strong indicators of account trust. Account age – this variable is more important in non-social sectors, so it may not weigh as heavily on Twitter. However, it seems likely that this will play some part. Twitter, working with Google, could automatically provide trust to those accounts Twitter deems as “confirmed accounts”, as they will often receive immediate following spikes that are unnatural to other users. For those that have to grind to accumulate real following counts, age seems like something that may be a bigger part of a natural trust growth cycle more than the actual account date of birth itself. Account Theme – we all have things we tweet and discuss more than others. After a while, there are definite themes that run through our profiles. Just as how Google establishes link neighborhoods, there will be strong account leans that establish a SEO link by Rand Fishkin as preferable to a SEO link posted by Chad OchoCinco. Why, When, How – Social Media Implementation in the SERPs So what incentive do the search engines have to implement these factors into the search results? We know that they are always looking into more ways to make the results better and improve user experience. By using real-time accurately, and not just as a tweet stream, there is a better chance for the engines to actively return the most current, relevant result to their user base. Improving News Aggregation The best way the engines can immediately provide the end user with the most current, relevant data is in news streams. Due to the immediacy of news, search engines are in a constant battle to unveil the most up to date, relevant content as it happens. They constantly spider the biggest news sites, but the problem with the current system is that these media outlets, which have strangleholds on news aggregation, are not always the most topical, relevant result for the engines. Even though you will frequently see a spindle of five or so good results in the SERPs, how these rank will always have to do with domain authority and on-page SEO over which one is actually the best article in and of itself. By using Twitter as an influencer in this regard, Google can do a better job of delivering the top results that the common public sees as the authority article for a news piece. Occasionally, the world will find a breaking news source that is dramatically different, and much less authoritative, than many of the bigger name news aggregators. Twitter has the ability to create instant trust for many of these sources, based on retweets and trusted dissemination of the information. How We Link Out Has Changed Bloggers don’t link out as much – or in the same way - as they used to. Due to Twitter and Facebook, there is less “thanks for sharing this great content” ego boosts for dropping a cool funny video or awesome Infographic. Major bloggers just don’t do that anymore, and if at all, not nearly at the same volume. More socially-worthy pieces never get touched by bloggers, because we’re already dropping it on our Twitter feeds and sharing on Facebook. This has changed the way we link out on the web and how we show we “trust” a website. For Google to get a true appropriation of how their users view the web, they have to incorporate these new psychological linking tendencies into the SERPS. When? I don’t work at Google, so I have no real way to prophesize when rollouts of this kind will happen. But it will happen. The only real, educated guess we can make is that it’s coming closer every day. Real time search results continue to improve. However, for Google to implement Twitter completely into its search engine, it has to be able to handle a new cumulative mass of constant, pounding data. In February, Techcrunch reported Twitter having reached 50 million new tweets a day. That’s a lot of data to analyze. If anyone can do it, though, it’s Google. What about Facebook's Open Graph? Although the data on Facebook is largely closed off to Google's spiders, the impact of Facebook's newly announced open graph could be worth communicating in the SERPs. New, publicly interpretable \"like\" numbers could be used as votes of trust in the similar fashion to the above Twitter metrics. However, there are several factors that make the Open Graph far from ever being implemented, if at all. First, Google sees Facebook as a threat, and seems to be against the privacy dilemmas the graph presents. Secondly, this is a brand new annoucement, so implementation of data of this sort is likely much further away from ever being implemented. Twitter has been around 2006, so Google has had more time to interpret and mold how, if it all, they will implement this service into their search results. What does that mean for us? Given the above points, I’m not sure it changes anything. The less trust Google feels it has it’s in the rollout of this algorithm tweak, the less impact it will have on the SERPs. Google’s speed tweak supposedly will impact less than 1% of searches. This has the potential to be considerably higher, but for the socially-focused webmaster, few things have changed. Create great, viral content worthy of being spread, and you’ll see the same positive results. As a Google Webspam Engineer once said, “Best practices”. But remember, best practices doesn’t make perfect, perfect best practices makes perfect. Ross Hudgens is a Senior SEO Analyst for Single Grain. He is the head blogger at the Single Grain Blog and also actively blogs on his personal website, RossHudgens.com. You should follow him on Twitter here. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Google Will Use Social Media to Impact Organic Search"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Google Will Use Social Media to Impact Organic Search"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ross Hudgens\n          \n            Ross Hudgens\n          \n            Ross Hudgens"
}