{
  "url": "https://moz.com/blog/how-to-build-backlinks-using-your-competitors-how-broken-pages",
  "slug": "how-to-build-backlinks-using-your-competitors-how-broken-pages",
  "title": "How to Build Backlinks Using Your Competitors’ Broken Pages - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "With a little analysis and some thoughtful outreach, your brand could grab the opportunities your competition is neglecting.",
  "content": "How to Build Backlinks Using Your Competitors’ Broken Pages Link Building By: Thomas Caulton September 28, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Thomas Caulton September 28, 2016 How to Build Backlinks Using Your Competitors’ Broken Pages Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. We all know building backlinks is one of the most important aspects of any successful SEO and digital marketing campaign. However, I believe there is an untapped resource out there for link building: finding your competitors' broken pages that have been linked to by external sources. Allow me to elaborate. Finding the perfect backlink often takes hours, and it can can take days, weeks, or even longer to acquire. That’s where the link building method I've outlined below comes in. I use it on a regular basis to build relevant backlinks from competitors' 404 pages. Please note: In this post, I will be using Search Engine Land as an example to make my points. Ready to dive in? Great, because I'm going to walk you through the entire link building process now. First, you need to find your competitor(s). This is as easy as searching for the keyword you’re targeting on Google and selecting websites that are above you in the SERPs. Once you have a list of competitors, create a spreadsheet to put all of your competitors on, including their position in the rankings and the date you listed them. Next, download Screaming Frog SEO Spider [a freemium tool]. This software will allow you to crawl all of your competitors website, revealing all their 404 pages. To do this, simply enter your competitors' URLs in the search bar one at a time, like this: Once the crawl is complete, click \"Response Codes.\" Then, click on the dropdown arrow next to \"filter\" and select \"Client Error 4xx.\" Now you'll be able to see the brand's 404 pages. Once you've completed the step above, simply press the \"Export\" button to export all of their 404 pages into a file. Next, import this file into to a spreadsheet in Excel or Google Docs. On this part of the spreadsheet, create tabs called \"Trust Flow,\" \"Citation Flow,\" \"Referring Domains,\" and \"External Backlinks.\" Now that you’ve imported all of their 404 pages, you need to dissect the images and external links if there are any. A quick way to do this is to highlight the cell block by pressing on the specific cell at the top, then press \"Filter\" under the \"Data\" tab. Look for the drop-down arrow on the first cell of that block. Click the drop-down arrow, and underneath \"Filter by values,\" you will see two links: \"Select all\" and \"Clear.\" Press \"Clear,\" like this: This will clear all preset options. Now, type in the URL of the competitor's website in the search box and click \"Select all.\" This will filter out all external links and just leave you with their 404 pages. Go through the whole list, highlighting the pages you think you can rewrite. Now that you have all of your relevant 404 pages in place, run them through Majestic [a paid tool] or Link Explorer [a freemium tool] to see if their 404 pages actually have any external links (which is what we're ultimately looking for). Add the details from Majestic or Moz to the spreadsheet. No matter which tool you use (I use OSE), hit \"Request a CSV\" for the backlink data. (Import the data into a new tab on your spreadsheet, or create a new spreadsheet altogether if you wish.) Find relevant backlinks linking to (X’s) website. Once you've found all of the relevant websites, you can either highlight them or remove the ones that aren’t from your spreadsheet. Please note: It's worth running each of the websites you're potentially going to be reaching out to through Majestic and Moz to find out their citation flow, trust flow, and domain authority (DA). You may only want to go for the highest DA; however, in my opinion, if it's relevant to your niche and will provide useful information, it's worth targeting. With the 404s and link opportunities in hand, focus on creating content that’s relevant for the brands you hope to earn a link from. Find the contact information for someone at the brand you want the link from. This will usually be clear on their website; but if not, you can use tools such as VoilaNorbert and Email Hunter to get the information you need. Once you have this information, you need to send them an email similar to this one: Hi [THEIR NAME], My name is [YOUR NAME], and I carry out the [INSERT JOB ROLE – i.e., MARKETING] at [YOUR COMPANY'S NAME or WEBSITE]. I have just come across your blog post regarding [INSERT THEIR POST TITLE] and when I clicked on one of the links on that post, it happened to go to a 404 page. As you’re probably aware, this is bad for user experience, which is the reason I’m emailing you today. We recently published an in-depth article regarding the same subject of the broken link you have on your website: [INSERT YOUR POST TITLE]. Here's the link to our article: [URL]. I was wondering if you wouldn’t mind linking to our article instead of the 404 page you’re currently linking to, as our article will provide your readers with a better user experience. We will be updating this article so we can keep people provided with the very latest information as the industry evolves. Thank you for reading this email and I look forward to hearing from you. [YOUR NAME] Disclaimer: The email example above is just an example and should be tailored to your own style of writing. In closing, remember to keep detailed notes of the conversations you have with people during outreach, and always follow up with people you connect with. I hope this tactic helps your SEO efforts in the future. It's certainly helped me find new places to earn links. Not only that, but it gives me new content ideas on a regular basis. Do you use a similar process to build links? I'd love to hear about it in the comments. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Build Backlinks Using Your Competitors’ Broken Pages"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Build Backlinks Using Your Competitors’ Broken Pages"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Thomas Caulton\n          \n            Thomas Caulton\n          \n            Thomas Caulton"
}