{
  "url": "https://moz.com/blog/how-to-know-if-a-prospect-is-ready-for-ppc",
  "slug": "how-to-know-if-a-prospect-is-ready-for-ppc",
  "title": "How to Know if a Prospect is Ready for PPC - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If your agency provides PPC services, one of the best answers you can add to your repertoire for discussions with prospects is \"not yet.\"",
  "content": "How to Know if a Prospect is Ready for PPC Paid Search Marketing (PPC) | Online Advertising By: Kirk Williams August 20, 2015 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Kirk Williams August 20, 2015 How to Know if a Prospect is Ready for PPC Paid Search Marketing (PPC) | Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Agencies are like wolves. Or maybe sharks. Or wolf-sharks. If I were a prospective client, I would have some fun. I would walk into a pay-per-click (PPC) conference, announce “I’m looking for someone to do my PPC. Who is the most qualified?” and then walk out, snickering to myself as the sound of growing chaos exploded behind me.I mean, digital marketers are no different than other industry's sales people, right? Our livelihoods depend on getting clients. However...It is my opinion as an agency owner who also runs the sales department (as well as the billing, scheduling, and coffee-making departments. I'm in this by myself, OK?) that there are times to dissuade a prospect from getting into PPC.There are undoubtedly agencies out there who never say “no” to a potential client waving money at them. Too small? No problem. We’ll just match our work on your account to your undersized pocketbook. Crappy website? No big deal. Sign here.To do this, we will look at two questions. Why should you persuade someone to wait to begin PPC, and when should you consider dissuading them?PART 1: Why you should dissuade a prospect from PPCLet me be clear: The answer is rarely “no” when telling unprepared prospects they're not ready to dive into PPC. The answer is typically “not yet.” There is a crucial difference between those two. The first sends the prospect into the arms of your competition; the second causes them to have an increased interest in your more honest, detailed analysis. A curious prospect is a listening prospect. Here are four reasons why there are times to tell a prospect “not yet” when they ask if they can hire your PPC services:Reason #1: It helps improve the reputation of PPCWhen someone dives into PPC, throwing money into poorly managed, disorganized campaigns, we end up with a businesses who later says “Nope, I tried it and it didn't work” to PPC providers.There are times when PPC is truly not for everyone (see Part 2 below). If we can distinguish between those businesses/verticals where PPC isn’t ideal and those where PPC was simply mismanaged, we can help improve PPC's reputation among SMBs.Reason #2: It creates a positive brand experienceThis goes hand in hand with the previous point. Leaving an endless field of corpses in your wake clues people in that you have the potential to harm their business. Unlike The Walking Dead, these “corpses” you’ve wronged can talk on social media and review sites about your brand.We all get an estimate wrong here and there, but a continual supply of SMBs who feel you’ve mishandled their money, when the real problem was that they weren’t yet ready for PPC, can only serve to hurt your brand.Reason #3: It builds loyaltyIt sounds counter-intuitive, but “real talk” tends toincrease your credibility in your prospect’s eyes. Let me put it in a way that an agency can understand. Pretend that you’re in discussion with two automation software companies. You (agency): \"Here’s my monthly spend. It is spread among X clients. What can your software do for me?\"AUTOSOFT1 (sales-focused): “Oh MAN, let me show you how all of these other agencies have saved thousands every day. We'll save you 2,300 hours per week. You will be sipping out of a coconut on a beach next week. Sign this contract for six months, and let’s see what happens.\"AUTOSOFT2 (client-focused): \"If I can be straightforward with you here, we’ve seen agencies at your size struggle to make automation profitable. I don’t want to dissuade you, but it wouldn’t serve either of us if you tried it and then walked away frustrated in six months. If you’re not ready to dive in, I would completely understand. Here is a goal to shoot for in account growth. We’ve seen an ideal initial client spend of X at X number of clients. I’ll keep checking in on a monthly basis if it's okay. Once you get to where you want to be, we can go from there.\" In this first example, the client tries it out after having been promised the moon by the agency, but then receives only an asteroid. They walk away frustrated with everyone involved. This is exactly why I hate case studies for selling PPC (and lay out my reasons for that here: Why the Case Study Needs to Die When Selling PPC).In contrast, the prospect who sees the agency (second example) genuinely show concern for them may not come around immediately; but when they are ready to give PPC a try, you can bet they will remember the agency who was honest with them.Reason #4: It's the right thing to doA final reason for dissuading a prospect is, well, it’s the right thing to do if they’re not ready. If you know it is not the right time for them to do PPC, then you should probably tell them. Or warn them, then walk them through the process with eyes wide open.I just had a similar experience taking on a new SMB client. Here's what I told them:“You are in a new market, which intrigues me. There’s not a lot of competition, so there’s a ton of potential, but it’s untested. This might not work out with the profit margin you have. Here are my recommendations.\"I broke a dozen sales \"rules\" right there, but I did land the client. PART 2: Four times you should dissuade a prospect from PPCHopefully, I’ve convinced you that there are times to dissuade a prospect from jumping whole hog into PPC. Practically, let's talk about what that looks like. Here are four times you should dissuade a prospect from PPC: Time #1: Their budget is too smallOne tip-off that it may not be the right time for your prospect to start PPC that their idea of a budget and reality do not intersect. To help you assess whether are not this is the case, find the answers to these questions:What are average cost-per-clicks (CPCs) in their vertical? How much does the prospect spend on other forms of marketing? Does the prospect balk at both your management fee and the ad spend fee paid to Google? Are they going to constantly try to nickel and dime your fees? I often get asked what is the lowest budget I will consider taking on for a new account. I like to respond with something like this: “I will take a client on at $5 per month in ad spend, but here is my pricing structure.\" That tends to help weed out clients who aren’t ready for PPC budget-wise. With rising CPCs in most verticals, and management fees rising, it is getting more and more difficult for a client to dip their toes into the water with PPC. This is especially unfortunate for small businesses in competitive markets.Time #2: Their website gives visitors a poor experienceA crucial part of any PPC strategy is considering the client-facing side of it, specifically the landing page. If the client’s website is a giant 404, there's not much success to be had. I’ve told prospects “I’d love to help you, but at this point I think it would be cost-prohibitive to begin advertising until we can upgrade the website experience of your prospective visitors.\" Another option here that allows you to have your cake and eat it too is using a landing page solution like Unbounce. (I love Unbounce. I really do. I get no kickbacks for saying that. It's reasonably-priced, easy-to-use, great-looking software that deserves to be mentioned.) This allows you as the PPCer to control the gate to the prospect’s terrible website. Time #3: Their conversion goals are unrealisticThis is a big one. If your prospect has unreasonable expectations from the beginning, you can bet they will not be forgiving when you fail to reach those unrealistic conversion goals. It’s tempting. You’re on the phone with a great sounding opportunity. They’re unhappy with their current agency (which always puts me on alert), and want to see what you can do. Oh, and their goals are crazy. Increase sales by 200% in three months (when the last three years they've only seen 20% growth). To me, this isn’t backing away from a challenge. It is recognizing foolishness and running from it. Ain’t nobody got time for umpteen calls about unrealistic goals not being reached for the next three months (before hopping to the next agency).Time #4: Their strategy is poorly developedA final possible reason for dissuading or putting on hold a prospect interested in PPC is a poorly developed strategy. What I mean by this is not that they have to have a perfect understanding of how PPC will fit into their marketing plan, but that they demonstrate no understanding (or worse, a skewed understanding) of how PPC will fit in with their other marketing efforts. Of course, here is a great opportunity to educate the prospect. Rather than saying “Let’s sign you on and then figure it out,” it will be worth everyone's time and energy to ensure you are on the same page with where PPC fits into the business marketing strategy. If you don’t do this, you may consistently find yourself being measured by dissimilar marketing achievements, or fighting unnecessary battles for budget. I’ve found that simply discussing strategy expectations helps me learn more about the prospect, and helps them learn more about how PPC works. We both walk into the relationship with a clearer picture of reality than if we had blindly jumped into it with the goal of figuring it out as we go.As you can see, saying \"not yet\" is far different than saying no. In my experience, the ideal client is always appreciative when you show an honest, genuine concern for their brand. What about you? Have any insights to add? Leave them in the comments below, or tweet them to me @PPCKirk. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Know if a Prospect is Ready for PPC"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Know if a Prospect is Ready for PPC"
    },
    {
      "level": "H2",
      "text": "PART 1: Why you should dissuade a prospect from PPC"
    },
    {
      "level": "H3",
      "text": "Reason #1: It helps improve the reputation of PPC"
    },
    {
      "level": "H3",
      "text": "Reason #2: It creates a positive brand experience"
    },
    {
      "level": "H3",
      "text": "Reason #3: It builds loyalty"
    },
    {
      "level": "H3",
      "text": "Reason #4: It's the right thing to do"
    },
    {
      "level": "H2",
      "text": "PART 2: Four times you should dissuade a prospect from PPC"
    },
    {
      "level": "H3",
      "text": "Time #1: Their budget is too small"
    },
    {
      "level": "H3",
      "text": "Time #2: Their website gives visitors a poor experience"
    },
    {
      "level": "H2",
      "text": "Time #3: Their conversion goals are unrealistic"
    },
    {
      "level": "H2",
      "text": "Time #4: Their strategy is poorly developed"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kirk Williams\n          \n            Kirk Williams\n          \n            Kirk Williams"
}