{
  "url": "https://moz.com/blog/how-google-has-made-it-so-difficult-for-new-local-ppc-campaigns",
  "slug": "how-google-has-made-it-so-difficult-for-new-local-ppc-campaigns",
  "title": "How Google Has Made it so Difficult for New Local PPC Campaigns - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When I started out working in PPC and managing accounts I, like most people I’m sure, obsessed over quality scores. From the start it was obvious how important quality scores were but the problem was, for most new local PPC accounts targeting unbranded keywords, I couldn’t get above the quality…",
  "content": "How Google Has Made it so Difficult for New Local PPC Campaigns Paid Search Marketing (PPC) By: Will Craig February 4, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Will Craig February 4, 2013 How Google Has Made it so Difficult for New Local PPC Campaigns Paid Search Marketing (PPC) This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Quality Score Obsession When I started out working in PPC and managing accounts I, like most people I’m sure, obsessed over quality scores. From the start it was obvious how important quality scores were but the problem was, for most new local PPC accounts targeting unbranded keywords, I couldn’t get above the quality score of 4… I had carried out all the best practices – my keywords were in tight ad groups, I had ad extensions, my landing pages were ideal for the ads and the ads were all relevant. I spent hours testing new ads, keyword matches and placing keywords on the landing pages, but nothing happened. Today, with plenty of experience in PPC, my advice is if everything is setup as it should be and nothing changes with your quality score after a couple of tests just give up on testing, it’s not your fault. Give It Time You shouldn’t stress over your keywords quality scores until they have at least 500 impressions. Even when you see a below average ad relevance on your keywords this may be a complete and utter lie. We have had this happen for terms where the keyword is in the ad title and it doesn’t get much more relevant than that! New Accounts Quality Score When you set up a new account in AdWords your quality score is based on the history of these keywords in paid search. Sadly, not everyone who has carried out PPC on these keywords is going to be as good as you! Google sent out millions of AdWords vouchers to website owners across all industries to encourage them to try out Pay Per Click. These vouchers are of little/no cost to the new website owner so why wouldn’t they try their hand at PPC? So, they set it up and they throw all their keywords in one group with a poor ad and landing page. Then they saw their ad on the search pages and they were proud of themselves; rightly so because they had got their ad on Google! But unfortunately for the rest of us this contributes to those keywords now having a historical quality score and those embarrassingly low keyword quality scores are reflected in our new account. Free Vouchers That Come at a Cost On the search network you want your ads to appear in the top 3, with top 3 ads allowing us to include ad extensions and provide more information to encourage users to click on the ad. However, in new accounts making the top 3 comes at a higher cost. Example: Ad Position = Max Cost Per Click (CPC) Bid X Quality Score Company A is competing in an industry where the top 3 PPC ads are from established accounts with a quality score of 10/10 and their maximum CPC bids are: Company X £2.02 Company Y £2.01 Company Z £2.00 Therefore when your quality score for this particular keyword is 4/10 you are going to have to pay 2.5 times more - £5.00 to make it into the top 3 ads! So hypothetically for that £75 free voucher you got from Google, when wanting your ads to appear in the top 3 you get the fine total of 15 clicks! OK, so fair enough it was a free voucher and these were free clicks, who cares? The problem is once the voucher is spent it becomes the website owner's own money being used. With small businesses in particular they often see any money they put in wasted with little return and choose to give up on their PPC venture. Google's Response Sadly, there is not much we little guys can do other than persevering and throwing lots of money at it until we see the quality scores improve and the costs go down. One of the guys in the office recently submitted the question to Google and got the exact response we expected – spend more in your account, up your budgets and eventually one day, in the future, your quality score will improve once you have a good CTR. You can see the response we received about what we could do below: Conclusion There is no doubt that PPC is a beneficial form of advertising, but Google is making it harder and harder for small businesses to compete and reap the benefits. Thanks to this initial poor keyword history forcing people to bid high, we are likely to continue to see more and more new PPC startups give up on it. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Google Has Made it so Difficult for New Local PPC Campaigns"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Google Has Made it so Difficult for New Local PPC Campaigns"
    },
    {
      "level": "H2",
      "text": "Quality Score Obsession"
    },
    {
      "level": "H2",
      "text": "Give It Time"
    },
    {
      "level": "H2",
      "text": "New Accounts Quality Score"
    },
    {
      "level": "H2",
      "text": "Free Vouchers That Come at a Cost"
    },
    {
      "level": "H3",
      "text": "Example:"
    },
    {
      "level": "H3",
      "text": "Ad Position = Max Cost Per Click (CPC) Bid X Quality Score"
    },
    {
      "level": "H2",
      "text": "Google's Response"
    },
    {
      "level": "H3",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Will Craig\n          \n            Will Craig\n          \n            Will Craig"
}