{
  "url": "https://moz.com/blog/how-to-make-seo-an-unfair-competitive-advantage-for-your-business",
  "slug": "how-to-make-seo-an-unfair-competitive-advantage-for-your-business",
  "title": "Yup, SEO Can Be A Competitive Advantage - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Another great post from Jason Cohen popped onto my radar yesterday entitled \"Startup Competitive Advantages the Work.\" As a passionate (OK, maybe obsessed is the right word) startup guy and someone who loves SEO, I couldn't help but want to jump into the fray with ...",
  "content": "Yup, SEO Can Be A Competitive Advantage SEO Basics By: Rand Fishkin July 21, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 21, 2010 Yup, SEO Can Be A Competitive Advantage SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Another great post from Jason Cohen popped onto my radar yesterday entitled \"Startup Competitive Advantages that Work.\" It's definitely worth a read, even if you're not at a startup. As a passionate (OK, maybe obsessed is the right word) startup guy and someone who loves SEO, I couldn't help but want to jump into the fray with some thoughts on how the field we're in - domination of the organic search results - can be an unfair, competitive advantage for businesses that know how to wield it. The core of Jason's post is below: The first step is admitting you have a problem. Last week I detailed the most common misconceptions about competitive advantages, so go read that if you haven't already. To summarize: Anything that can be copied will be copied, including features, marketing copy, and pricing. Anything you read on popular blogs is also read by everyone else. You don't have an \"edge\" just because you're passionate, hard-working, or \"lean.\" The only real competitive advantage is that which cannot be copied and cannot be bought. Like what? And he's got a number of terrific answers, but SEO, and more broadly, phenomenal organic web marketing, isn't among them. Before I tackle why I think it belongs there, let me explain the difference between \"good\" SEO and defensible, \"competitive advantage\" style SEO. \"Good\" SEO means You have a solid quantity of unique, quality content that users and customers will find useful. Your pages and links are crawlable, indexable and generally search friendly. You've done your homework with keyword research and update it regularly (monthly - quarterly) as new terms/phrases rise/fall in demand. You've engaged in some decent link acquisition campaigns, garnering links from a few authorities in your industry, some blogs, maybe a few article sites, press releases, link exchanges and the like to the point where you have similar metrics to your competition. You've engaged in social media and have profiles on the major sites, have a few tweets every week that point to your site and a few hundred fans on Facebook. In other words, you've followed best practices, done the \"right\" things and while an SEO audit might reveal some missed opportunities and an error here or there, you'd generally come away with an \"A\" on your SEO report card. \"Competitive Advantage\" SEO means Your site produces content people love to visit and love to share in a scalable, hard-to-replicate way Your on-site SEO is \"best of breed.\" Note: This isn't much different than good SEO - on-page/on-site optimization is unlikely to ever be a competitive advantage. Your keyword research is baked into the content generation process. The material your site produces fulfills keyword demand just as, or even before it exists by tapping into the subconscious of the web and the culture of ideas/questions in your industry/niche. Website owners and content creators have a powerful psychological incentive to link to your work frequently, just as those who participate/contribute to the social web are incented to share via their network of choice. Some Examples of \"Competitive Advantage\" SEO Sites: StackOverflow Yelp Wikipedia LinkedIn Mashable Last.fm NY Magazine Amazon Cheezburger Network Wordpress AllRecipes SmashingMagazine All of these have content pouring out of them, generated rapidly, scalable, and in time with query demand. They have broad networks of patrons and participants that incent the spreading and sharing of their content through links and social networks. They employ content+SEO+sharing in a high-return equation that's nearly impossible for competitors to match. I'll illustrate: That's not to say they can't be beaten, but runner B (a new competitor) is going to have to go dramatically faster than runner A (the market leader) if they want to catch up before runner A sees them coming and turns up the jets. SEO Can Be a Competitive Advantage This is my argument for why the level of truly great SEO I described above, belongs on the list of unfair competitive advantages. It's massively hard to duplicate It's prohibitively expensive to buy (and just buying the link influence signals violates guidelines) It requires tremendous creativity paired with exceptional execution and a time-bounded network effect (all of the sites I mentioned have dramatically increased their lead over time and continue to do so) It's certainly not the only option, but it can have a dramatic impact. If you're starting a company, starting an SEO campaign or just want to renew your vision for how your site will go from ranking for a few keywords to becoming a dominant market player, it's, at the least, a strategy worthy of consideration. p.s. If you're interested in some more practical SEO advice this morning, my slide deck from the Blueglass LA conference - Strategic SEO Link Analysis - may be able to scratch that itch. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Yup, SEO Can Be A Competitive Advantage"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Yup, SEO Can Be A Competitive Advantage"
    },
    {
      "level": "H3",
      "text": "The first step is admitting you have a problem."
    },
    {
      "level": "H2",
      "text": "\"Good\" SEO means"
    },
    {
      "level": "H2",
      "text": "\"Competitive Advantage\" SEO means"
    },
    {
      "level": "H2",
      "text": "Some Examples of \"Competitive Advantage\" SEO Sites:"
    },
    {
      "level": "H2",
      "text": "SEO Can Be a Competitive Advantage"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}