{
  "url": "https://moz.com/blog/how-to-use-pr-tactics-to-build-links-from-infographics",
  "slug": "how-to-use-pr-tactics-to-build-links-from-infographics",
  "title": "How to Use PR Tactics to Build Links from Infographics - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I have always evangelized that SEOs should align their efforts much more closely with PR professionals. Unlike SEOs who would build APIs in text editors for fun, PR pros tend to be extroverted, good at forging relationships, and generally excellent at harvesting contextual links from quality sites…",
  "content": "How to Use PR Tactics to Build Links from Infographics Content Marketing H By: Howard Brown July 12, 2011 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! H By: Howard Brown July 12, 2011 How to Use PR Tactics to Build Links from Infographics Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I have always evangelized that SEOs should align their efforts much more closely with PR professionals. Unlike SEOs who would build APIs in text editors for fun, PR pros tend to be extroverted, good at forging relationships, and generally excellent at harvesting contextual links from quality sites (I know – I married one). This week, an interesting email came in to one of our blog sites focusing on fashion trends demonstrated this perfectly. Typical blog contact forms are flooded with PR reps looking to get their client's products mentioned in a post, either through a direct request or an invitation to a launch party or blogger event. This particular message was different – although the tone was decidedly from the PR-esque, it was actually sent by an SEO sharing an infographic: Summer time is almost here and I have the perfect fashion guide for you and your readers. This infographic has the top 12 must-haves for the summer from wooden platform clogs and cut-out tops to coke bottle sunglasses. I really feel that your readers will enjoy this, would you be interested in featuring this on your blog? Just check it out and post it on your site, blog or on Twitter. It's not the most elegant email, and the associated infographic wasn't very well-executed either, but you get the idea – instead of merely posting the image to an infographic aggregation site and hoping it would be shared, the SEO actually took the initiative and sent it directly to bloggers. It's a perfect variation on what PR professionals do each day to gain press coverage, but with the added benefit of gaining quality links. Why Infographics are perfect for blog-based link building I conservatively estimate that 90% of what we read on industry blogs and news sites originates from press releases and PR contacts. That may be cynical, but journalists and bloggers are as cash-strapped and pressed for time as they ever have been, and the most respected and well-funded media outlets have time to practice traditional journalism (i.e. conduct research, fact-check that research, and engage in a proper editorial process). This is one reason why well-designed infographics are a win/win for brands and bloggers. Infographics give sites valuable eye-candy and boil down the most essential elements of complicated stories. They're easy to add to sites, and the better ones look great. For these reasons, your efforts promoting great infographics are bound to be much more successful, statistically-speaking, than more traditional link requests. Refining the Process Personalization & Warmth – Sending a warm, witty email may feel odd if you live in the tech world, where short, to-the-point messages are the name of the game. While some brevity is still valued, you've got to pour some sugar on your outreach to get your infographic placed. Embed Code - Add embed code to the email, and offer it readily on the target page. If you're using Wordpress, you can install a terrific plugin by Embed Anything that makes offering and snatching embed code dead easy. Proper Domain Branding – The example infographic is branded, but lists no domain name. This means that if bloggers choose to download and upload the image to their site without offering a link, you won’t get many direct visits from the effort, either. Take no risks – always brand with a domain name, such as in this one created by OnlineMBA.com: http://mashable.com/2011/05/13/corporate-tax/ note from SEOmoz: infographic added 7/20 by Demand Results in response to requests in comments. About the Author William Tyree is a marketing technologist and writer, and is currently Vice President of Marketing for DemandResults, creator of SEO for Salesforce. He has worked as a marketing and technology strategist in a variety of industries, including B2B software, entertainment, healthcare, legal, large nonprofit, eGovernment and food & beverage. His writing has been published in Harvard Review, The Atlantic, Japan Inc and elsewhere. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Use PR Tactics to Build Links from Infographics"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Use PR Tactics to Build Links from Infographics"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Howard Brown\n          \n            Howard Brown"
}