{
  "url": "https://moz.com/blog/how-can-the-value-of-top-of-funnel-channels-be-measured-whiteboard-friday",
  "slug": "how-can-the-value-of-top-of-funnel-channels-be-measured-whiteboard-friday",
  "title": "How Can the Value of Top-of-Funnel Channels be Measured - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Marketing efforts at the top of the funnel, like PR and content marketing, are notoriously hard to measure in terms of their value. In today's Whiteboard Friday, Rand offers three ways you can perform that measurement, as well as some perspective about \"serendipitous marketing.\"",
  "content": "How Can the Value of Top-of-Funnel Channels be Measured SEO Basics | Whiteboard Friday By: Rand Fishkin November 21, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 21, 2014 How Can the Value of Top-of-Funnel Channels be Measured SEO Basics | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Rand has talked many times about what he calls \"serendipitous marketing,\" where the work we do at the top of the funnel can take winding and often unexpected paths to conversions. One of the most common questions about content marketing, public relations, and other top-of-funnel efforts is how to prove their value. In today's Whiteboard Friday, Rand offers up three ways you can attempt those measurements, along with a bit of perspective you can bring to your clients and higher-ups. For reference, here's a still of this week's whiteboard! Video transcription Howdy, Moz Fans, and welcome to another edition of Whiteboard Friday. This week we're going to talk about the value of top of the funnel demand creation, sorts of channels and tactics, and how you can actually measure the value behind them. I'm guilty of doing something. I'm going to own up to it. A lot of the time when I talk about these kinds of tactics, stuff that sits at the very top of the funnel that creates that demand or interest in your potential target market, I call them serendipitous and unmeasurable channels. It is true that many of them are very serendipitous, but it's not entirely true that they're completely unmeasurable. They're just very, very hard to measure, but not impossible. So today I'm going to walk you through that, not because I actually expect you to go and try and do this with every one of those serendipitous, hard to measure channels, but because I think you need to, as a marketer, have this in your toolbox and in your knowledge kit so that when your CMO, your boss, your client, your manager, your team says, \"Hey how do we know that xyz is producing returns,\" you can say, \"Actually, we don't know that.\" Or, \"We proved it once, and we have the data from then. We continue to believe that it will drive investment. But here's how tough it is to measure, and this is why we continue to invest in it and believe in it as a channel even though we don't have the proof.\" So bear with me for a second. You've got your classic marketing funnel. Top of funnel stuff is like creating that awareness of the issue, the problem, the challenge, your industry. Your middle of the funnel is where you're showing off your solution. The bottom of the funnel is usually where you're convincing folks to convert and then trying to retain people. So this is fairly simplistic. Most marketers are familiar with it. The stuff that fits into this creating awareness bucket, that very top of funnel demand creation, those are things like: public relations, getting in news and media and press coverage; a lot of social media engagement, especially social media that is not directly tied to either supporting your product or pushing your product is in that bucket; a lot of conferences, events, trade shows, booths; certainly all those coffee and beer meetings that you might have with people in your field, people outside of your field, and people who are curious; a lot of those serendipitous meetings. Anything that it fits into what we call top of funnel, which I actually like the shortened acronym there TOFU, TOFU content marketing. Much of the content that content marketers invested in and create is designed to be kind of above the funnel, before people are actually interested in your product or solution. Actually, this includes a lot of things that are brand advertising focused, that are just creating awareness of who you are as a company and that you exist, without specifically talking about the problem folks are facing or your solution to that problem. So proving the value of this stuff is insanely hard. Let's use public relations as an example. The classic yard stick that PR professionals have traditionally reported on are number of stories and the quality of those stories and pieces, and where they've been published. That's a lot like in the SEO world reporting rankings and traffic. They're very high level metrics. They're sort of interesting to know. But then you have to have the belief that they connect up, that the rankings and the traffic are going to connect up to conversions, or that getting all those print pieces on the web, getting those links, or whatever is going to convert. This is tough. The way to prove the value of this is you basically have these three options. You can segment, meaning that you segment by something like an industry vertical, by the demographics of your target, pr by geography. I'll give you an example of this. So Moz might say, \"Hey, we really think that among urban professionals in the technical marketing fields, that is who we're going to bias all of our public relations efforts to over the next year.\" So we're going to tell our PR firm, our in-house PR person, \"Hey, that's what we want you to focus on. Get us the publications that are relevant to those folks, that are read by them on and off the Web. That's where we want to be.\" This is interesting, because it means that we can then in the future actually go and measure like, \"Well yeah, we had this kind of a result with that particular group that we targeted with PR.\" We had this much lower result with this other group that we didn't target with PR, that we could the next quarter or the next year. This is one way of doing it. Geography actually is the most common way that I see a lot of startups and technology companies doing this. They basically focus all their efforts around a particular city or a particular state or region, sometimes even a country, and they'll do this. At one point, I actually did run a split test using Sweden and Norway, which were places where I visited several people from Moz over the course of a couple years, spoke at some conferences and events, and then we looked at our traffic from those countries, our coverage in those countries, our links from those countries, and eventually our conversions from those countries. We did see a lift, kind of suggesting to us that maybe there was some value in those conferences. Number two, the second way to do this is you can invest in a channel or tactic for only one of your product lines. If we're at Moz, we're going to say, \"Hey, you know what? We're going to do a lot of public relations for Followerwonk specifically, but we are not going to do it for our SEO products. We're not going to do it for Moz Local. But let's see how that goes.\" This is another sort of segmentation tactic and can be effective. If you see that it works very well for one particular product, you might try repeating it for others. Then the third one is that you can invest for a limited period of time. Now what's sad is this one is kind of the most common, but also the worst by far. The reason it's the worst by far, at least usually, is because most of the work that goes into any of these types of channels, think about it, press and PR, or a coffee and a beer meeting, or going to conferences and events, oftentimes takes a long time to show its value. It builds upon itself. So if I'm doing lots of in-person meetings, some of those will filter back and build on themselves. If you hear about Moz from one or two people in Seattle, well, okay, that's one signal. If you hear about it from 10, that's another thing. That might have a different kind of impact on how our brand gets out there. So this time period stuff I really don't recommend and usually don't like. There are cases where it can be okay. In all three of these, though, what makes it so incredibly challenging is that we have to be able to observe a number of metrics and then try and take the segments that we're supposed to be looking at, whether that's time or a product or a vertical or geography, and we want to observe metrics like traffic. We might try to look at mentions, especially for PR and branding focused stuff. We might look at links. We might look at conversion rate and total conversions. Then we have to try and control for every other thing that we're doing in our marketing that might or might not have affected those metrics as they apply to these channels. This is why honestly that control bit is so hard. Who's to say whether public relations are really because we did a big PR effort and we talked to a lot of folks? Or is it because our products got a lot better, customers started buzzing about us, and the industry was turning our way anyway? We would have gotten 50% of those mentions even if we hadn't invested in PR. I don't know. This is why a lot of the time with these forms of marketing, my bias is to say, \"You know what? You need to use your educated opinion, and you need to believe in and invest in the quantity of serendipity that you believe you can afford or that you can't afford not to do, rather than trying to perfectly measure the value that you're getting out of these.\" It's possible, but it is tremendously challenging. These are some ways that you can try it if you'd like to. I'd love to hear from all of you in the comments, especially if you've invested in this type of stuff in the past or if you have other ways of valuing, of figuring out, and of convincing your managers, your clients, your bosses, your teams to go put some dollars and energy behind these. All right everyone, we'll see you next week for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Can the Value of Top-of-Funnel Channels be Measured"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Can the Value of Top-of-Funnel Channels be Measured"
    },
    {
      "level": "H2",
      "text": "Video transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}