{
  "url": "https://moz.com/blog/how-much-has-link-building-changed-in-recent-years",
  "slug": "how-much-has-link-building-changed-in-recent-years",
  "title": "How Much Has Link Building Changed in Recent Years? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I get asked this question a lot, and I find myself giving the same answer, even though I've been asked it probably dozens of times in the last two years. I'll show you why in this post.",
  "content": "How Much Has Link Building Changed in Recent Years? Link Building By: Paddy Moogan May 6, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Paddy Moogan May 6, 2015 How Much Has Link Building Changed in Recent Years? Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I get asked this question a lot. It's mainly asked by people who are considering buying my link building book and want to know whether it's still up to date. This is understandable given that the first edition was published in February 2013 and our industry has a deserved reputation for always changing. I find myself giving the same answer, even though I've been asked it probably dozens of times in the last two years—\"not that much\". I don't think this is solely due to the book itself standing the test of time, although I'll happily take a bit of credit for that :) I think it's more a sign of our industry as a whole not changing as much as we'd like to think. I started to question myself and if I was right and honestly, it's one of the reasons it has taken me over two years to release the second edition of the book. So I posed this question to a group of friends not so long ago, some via email and some via a Facebook group. I was expecting to be called out by many of them because my position was that in reality, it hasn't actually changed that much. The thing is, many of them agreed and the conversations ended with a pretty long thread with lots of insights. In this post, I'd like to share some of them, share what my position is and talk about what actually has changed. My personal view Link building hasn't changed as much we think it has. The core principles of link building haven't changed. The signals around link building have changed, but mainly around new machine learning developments that have indirectly affected what we do. One thing that has definitely changed is the mindset of SEOs (and now clients) towards link building. I think the last big change to link building came in April 2012 when Penguin rolled out. This genuinely did change our industry and put to bed a few techniques that should never have worked so well in the first place. Since then, we've seen some things change, but the core principles haven't changed if you want to build a business that will be around for years to come and not run the risk of being hit by a link related Google update. For me, these principles are quite simple: You need to deserve links - either an asset you create or your product You need to put this asset in front of a relevant audience who have the ability to share it You need consistency - one new asset every year is unlikely to cut it Anything that scales is at risk For me, the move towards user data driving search results + machine learning has been the biggest change we've seen in recent years and it's still going. Let's dive a bit deeper into all of this and I'll talk about how this relates to link building. The typical mindset for building links has changed I think that most SEOs are coming round to the idea that you can't get away with building low quality links any more, not if you want to build a sustainable, long-term business. Spammy link building still works in the short-term and I think it always will, but it's much harder than it used to be to sustain websites that are built on spam. The approach is more \"churn and burn\" and spammers are happy to churn through lots of domains and just make a small profit on each one before moving onto another. For everyone else, it's all about the long-term and not putting client websites at risk. This has led to many SEOs embracing different forms of link building and generally starting to use content as an asset when it comes to attracting links. A big part of me feels that it was actually Penguin in 2012 that drove the rise of content marketing amongst SEOs, but that's a post for another day…! For today though, this goes some way towards explain the trend we see below. Slowly but surely, I'm seeing clients come to my company already knowing that low quality link building isn't what they want. It's taken a few years after Penguin for it to filter down to client / business owner level, but it's definitely happening. This is a good thing but unfortunately, the main reason for this is that most of them have been burnt in the past by SEO companies who have built low quality links without giving thought to building good quality ones too. I have no doubt that it's this change in mindset which has led to trends like this: The thing is, I don't think this was by choice. Let's be honest. A lot of us used the kind of link building tactics that Google no longer like because they worked. I don't think many SEOs were under the illusion that it was genuinely high quality stuff, but it worked and it was far less risky to do than it is today. Unless you were super-spammy, the low-quality links just worked. Fast forward to a post-Penguin world, things are far more risky. For me, it's because of this that we see the trends like the above. As an industry, we had the easiest link building methods taken away from us and we're left with fewer options. One of the main options is content marketing which, if you do it right, can lead to good quality links and importantly, the types of links you won't be removing in the future. Get it wrong and you'll lose budget and lose the trust if your boss or client in the power of content when it comes to link building. There are still plenty of other methods to build links and sometimes we can forget this. Just look at this epic list from Jon Cooper. Even with this many tactics still available to us, it's hard work. Way harder than it used to be. My summary here is that as an industry, our mindset has shifted but it certainly wasn't a voluntary shift. If the tactics that Penguin targeted still worked today, we'd still be using them. A few other opinions... \"I definitely think too many people want the next easy win. As someone surfing the edge of what Google is bringing our way, here's my general take—SEO, in broad strokes, is changing a lot, *but* any given change is more and more niche and impacts fewer people. What we're seeing isn't radical, sweeping changes that impact everyone, but a sort of modularization of SEO, where we each have to be aware of what impacts our given industries, verticals, etc.\" - Dr. Pete \"I don't feel that techniques for acquiring links have changed that much. You can either earn them through content and outreach or you can just buy them. What has changed is the awareness of \"link building\" outside of the SEO community. This makes link building / content marketing much harder when pitching to journalists and even more difficult when pitching to bloggers. \"Link building has to be more integrated with other channels and struggles to work in its own environment unless supported by brand, PR and social. Having other channels supporting your link development efforts also creates greater search signals and more opportunity to reach a bigger audience which will drive a greater ROI.\" - Carl Hendy \"SEO has grown up in terms of more mature staff and SEOs becoming more ingrained into businesses so there is a smarter (less pressure) approach. At the same time, SEO has become more integrated into marketing and has made marketing teams and decision makers more intelligent in strategies and not pushing for the quick win. I'm also seeing that companies who used to rely on SEO and building links have gone through IPOs and the need to build 1000s of links per quarter has rightly reduced.\" - Danny Denhard Signals that surround link building have changed There is no question about this one in my mind. I actually wrote about this last year in my previous blog post where I talked about signals such as anchor text and deep links changing over time. Many of the people I asked felt the same, here are some quotes from them, split out by the types of signal. Domain level link metrics \"I think domain level links have become increasingly important compared with page level factors, i.e. you can get a whole site ranking well off the back of one insanely strong page, even with sub-optimal PageRank flow from that page to the rest of the site.\" - Phil Nottingham I'd agree with Phil here and this is what I was getting at in my previous post on how I feel \"deep links\" will matter less over time. It's not just about domain level links here, it's just as much about the additional signals available for Google to use (more on that later). Anchor text I've never liked anchor text as a link signal. I mean, who actually uses exact match commercial keywords as anchor text on the web? SEOs. :) Sure there will be natural links like this, but honestly, I struggle with the idea that it took Google so long to start turning down the dial on commercial anchor text as a ranking signal. They are starting to turn it down though, slowly but surely. Don't get me wrong, it still matters and it still works. But like pure link spam, the barrier is a lot more lower now in terms what of constitutes too much. Rand feels that they matter more than we'd expect and I'd mostly agree with this statement: \"Exact match anchor text links still have more power than you'd expect—I think Google still hasn't perfectly sorted what is \"brand\" or \"branded query\" from generics (i.e. they want to start ranking a new startup like meldhome.com for \"Meld\" if the site/brand gets popular, but they can't quite tell the difference between that and https://moz.com/learn/seo/redirection getting a few manipulative links that say \"redirect\")\" - Rand Fishkin What I do struggle with though, is that Google still haven't figured this out and that short-term, commercial anchor text spam is still so effective. Even for a short burst of time. \"I don't think link building as a concept has changed loads—but I think links as a signal have, mainly because of filters and penalties but I don't see anywhere near the same level of impact from coverage anymore, even against 18 months ago.\" - Paul Rogers New signals have been introduced It isn't just about established signals changing though, there are new signals too and I personally feel that this is where we've seen the most change in Google algorithms in recent years—going all the way back to Panda in 2011. With Panda, we saw a new level of machine learning where it almost felt like Google had found a way of incorporating human reaction / feelings into their algorithms. They could then run this against a website and answer questions like the ones included in this post. Things such as: \"Would you be comfortable giving your credit card information to this site?\" \"Does this article contain insightful analysis or interesting information that is beyond obvious?\" \"Are the pages produced with great care and attention to detail vs. less attention to detail?\" It is a touch scary that Google was able to run machine learning against answers to questions like this and write an algorithm to predict the answers for any given page on the web. They have though and this was four years ago now. Since then, they've made various moves to utilize machine learning and AI to build out new products and improve their search results. For me, this was one of the biggest and went pretty unnoticed by our industry. Well, until Hummingbird came along I feel pretty sure that we have Ray Kurzweil to thank for at least some of that. \"There seems to be more weight on theme/topic related to sites, though it's hard to tell if this is mostly link based or more user/usage data based. Google is doing a good job of ranking sites and pages that don't earn the most links but do provide the most relevant/best answer. I have a feeling they use some combination of signals to say \"people who perform searches like this seem to eventually wind up on this website—let's rank it.\" One of my favorite examples is the Audubon Society ranking for all sorts of birding-related searches with very poor keyword targeting, not great links, etc. I think user behavior patterns are stronger in the algo than they've ever been.\" - Rand Fishkin Leading on from what Rand has said, it's becoming more and more common to see search results that just don't make sense if you look at the link metrics—but are a good result. For me, the move towards user data driving search results + machine learning advanced has been the biggest change we've seen in recent years and it's still going. Edit: since drafting this post, Tom Anthony released this excellent blog post on his views on the future of search and the shift to data-driven results. I'd recommend reading that as it approaches this whole area from a different perspective and I feel that an off-shoot of what Tom is talking about is the impact on link building. You may be asking at this point, what does machine learning have to do with link building? Everything. Because as strong as links are as a ranking signal, Google want more signals and user signals are far, far harder to manipulate than established link signals. Yes it can be done—I've seen it happen. There have even been a few public tests done. But it's very hard to scale and I'd venture a guess that only the top 1% of spammers are capable of doing it, let alone maintaining it for a long period of time. When I think about the process for manipulation here, I actually think we go a step beyond spammers towards hackers and more cut and dry illegal activity. For link building, this means that traditional methods of manipulating signals are going to become less and less effective as these user signals become stronger. For us as link builders, it means we can't keep searching for that silver bullet or the next method of scaling link building just for an easy win. The fact is that scalable link building is always going to be at risk from penalization from Google—I don't really want to live a life where I'm always worried about my clients being hit by the next update. Even if Google doesn't catch up with a certain method, machine learning and user data mean that these methods may naturally become less effective and cost efficient over time. There are of course other things such as social signals that have come into play. I certainly don't feel like these are a strong ranking factor yet, but with deals like this one between Google and Twitter being signed, I wouldn't be surprised if that ever-growing dataset is used at some point in organic results. The one advantage that Twitter has over Google is it's breaking news freshness. Twitter is still way quicker at breaking news than Google is—140 characters in a tweet is far quicker than Google News! Google know this which is why I feel they've pulled this partnership back into existence after a couple of years apart. There is another important point to remember here and it's nicely summarised by Dr. Pete: \"At the same time, as new signals are introduced, these are layers not replacements. People hear social signals or user signals or authorship and want it to be the link-killer, because they already fucked up link-building, but these are just layers on top of on-page and links and all of the other layers. As each layer is added, it can verify the layers that came before it and what you need isn't the magic signal but a combination of signals that generally matches what Google expects to see from real, strong entities. So, links still matter, but they matter in concert with other things, which basically means it's getting more complicated and, frankly, a bit harder. Of course, on one wants to hear that.\"- Dr. Pete The core principles have not changed This is the crux of everything for me. With all the changes listed above, the key is that the core principles around link building haven't changed. I could even argue that Penguin didn't change the core principles because the techniques that Penguin targeted should never have worked in the first place. I won't argue this too much though because even Google advised website owners to build directory links at one time. You need an asset You need to give someone a reason to link to you. Many won't do it out of the goodness of their heart! One of the most effective ways to do this is to develop a content asset and use this as your reason to make people care. Once you've made someone care, they're more likely to share the content or link to it from somewhere. You need to promote that asset to the right audience I really dislike the stance that some marketers take when it comes to content promotion—build great content and links will come. No. Sorry but for the vast majority of us, that's simply not true. The exceptions are people that sky dive from space or have huge existing audiences to leverage. You simply have to spend time promoting your content or your asset for it to get shares and links. It is hard work and sometimes you can spend a long time on it and get little return, but it's important to keep working at until you're at a point where you have two things: A big enough audience where you can almost guarantee at least some traffic to your new content along with some shares Enough strong relationships with relevant websites who you can speak to when new content is published and stand a good chance of them linking to it Getting to this point is hard—but that's kind of the point. There are various hacks you can use along the way but it will take time to get right. You need consistency Leading on from the previous point. It takes time and hard work to get links to your content—the types of links that stand the test of time and you're not going to be removing in 12 months time anyway! This means that you need to keep pushing content out and getting better each and every time. This isn't to say you should just churn content out for the sake of it, far from it. I am saying that with each piece of content you create, you will learn to do at least one thing better the next time. Try to give yourself the leverage to do this. Anything scalable is at risk Scalable link building is exactly what Google has been trying to crack down on for the last few years. Penguin was the biggest move and hit some of the most scalable tactics we had at our disposal. When you scale something, you often lose some level of quality, which is exactly what Google doesn't want when it comes to links. If you're still relying on tactics that could fall into the scalable category, I think you need to be very careful and just look at the trend in the types of links Google has been penalizing to understand why. The part Google plays in this To finish up, I want to briefly talk about the part that Google plays in all of this and shaping the future they want for the web. I've always tried to steer clear of arguments involving the idea that Google is actively pushing FUD into the community. I've preferred to concentrate more on things I can actually influence and change with my clients rather than what Google is telling us all to do. However, for the purposes of this post, I want to talk about it. \"General paranoia has increased. My bet is there are some companies out there carrying out zero specific linkbuilding activity through worry.\"- Dan Barker Dan's point is a very fair one and just a day or two after reading this in an email, I came across a page related to a client's target audience that said: \"We are not publishing guest posts on SITE NAME any more. All previous guest posts are now deleted. For more information, see www.mattcutts.com/blog/guest-blogging/\". I've reworded this as to not reveal the name of the site, but you get the point. This is silly. Honestly, so silly. They are a good site, publish good content, and had good editorial standards. Yet they have ignored all of their own policies, hard work, and objectives to follow a blog post from Matt. I'm 100% confident that it wasn't sites like this one that Matt was talking about in this blog post. This is, of course, from the publishers' angle rather than the link builders' angle, but it does go to show the effect that statements from Google can have. Google know this so it does make sense for them to push out messages that make their jobs easier and suit their own objectives—why wouldn't they? In a similar way, what did they do when they were struggling to classify at scale which links are bad vs. good and they didn't have a big enough web spam team? They got us to do it for them :) I'm mostly joking here, but you see the point. The most recent infamous mobilegeddon update, discussed here by Dr. Pete is another example of Google pushing out messages that ultimately scared a lot of people into action. Although to be fair, I think that despite the apparent small impact so far, the broad message from Google is a very serious one. Because of this, I think we need to remember that Google does have their own agenda and many shareholders to keep happy. I'm not in the camp of believing everything that Google puts out is FUD, but I'm much more sensitive and questioning of the messages now than I've ever been. What do you think? I'd love to hear your feedback and thoughts in the comments. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Much Has Link Building Changed in Recent Years?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Much Has Link Building Changed in Recent Years?"
    },
    {
      "level": "H2",
      "text": "My personal view"
    },
    {
      "level": "H2",
      "text": "The typical mindset for building links has changed"
    },
    {
      "level": "H2",
      "text": "Signals that surround link building have changed"
    },
    {
      "level": "H3",
      "text": "Domain level link metrics"
    },
    {
      "level": "H3",
      "text": "Anchor text"
    },
    {
      "level": "H2",
      "text": "New signals have been introduced"
    },
    {
      "level": "H2",
      "text": "The core principles have not changed"
    },
    {
      "level": "H3",
      "text": "You need an asset"
    },
    {
      "level": "H3",
      "text": "You need to promote that asset to the right audience"
    },
    {
      "level": "H3",
      "text": "You need consistency"
    },
    {
      "level": "H3",
      "text": "Anything scalable is at risk"
    },
    {
      "level": "H2",
      "text": "The part Google plays in this"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Paddy Moogan\n          \n            Paddy Moogan\n          \n            Paddy Moogan"
}