{
  "url": "https://moz.com/blog/how-seo-and-the-moz-helped-to-save-my-life",
  "slug": "how-seo-and-the-moz-helped-to-save-my-life",
  "title": "How SEO and The Moz Helped to Save My Life! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I've officially hit my 1 year anniversary as an official SEO! Writing a YOUmoz post (This is my 2nd one) to commemorate it was always in the back of my head.  I would like to thank nicchenet for writing this anniversary post to ACTUALLY motivate me to write MY Thank You to SEOmoz.org.",
  "content": "How SEO and The Moz Helped to Save My Life! Public Relations A By: amoore-71965 March 27, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! A By: amoore-71965 March 27, 2009 How SEO and The Moz Helped to Save My Life! Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I've officially hit my 1 year anniversary as an official SEO! Writing a YOUmoz post (This is my 2nd one) to commemorate it was always in the back of my head. I would like to thank nicchenet for writing this anniversary post to ACTUALLY motivate me to write MY Thank You to SEOmoz.org. 1 year and 4 months ago (November of 08), I was in one of the toughest positions of my life. 3 months prior to November of ‘08, I had moved from Cincinnati back to the state I love so much and where I attended college – South Carolina—Go GameCocks. So...I had just quit a great job to move 600 miles for what I thought was an even BETTER job. As of November of ’08 this great job now owed me over $3000 in back pay. So what did I do???I quit without another job, money or place to stay, all while being recently engaged. I was, however, able to cuss out the owner of the company in front of everyone—It was a great Bob Knight moment for me because, as Coach Knight put it best, I’m not here to debate things with you (and walked out). I worked as a barista to get by, and 2 months later I somehow landed an interview for an “in-house SEO specialist job” for a website in the Charleston area. Being a kick ass interviewer, I figured I would try the old “Fake it until you Make it” thang out of desperation. I called my mom, who referred me to her “Web Specialist” whose name was Brendan. We talked and he gave me some good advice for the interview, but by far his best piece of advice was to go and check out SEOmoz.org. Without this direction I am 100% positive that things in my life would be completely different… and not in a good way. I want to thank you immensely, Brendan! It was time to put that ole college degree to use and CRAM my brain with a bunch of SEO knowledge that I would soon forget! I studied EVERYTHING I COULD in that week leading up to my interview, checked out the FREE tools and even ran some reports. In my preparation for my interview, I kept thinking about a quote from George Costanza from Seinfeld: “Jerry, just remember, it's not a lie if you truly believe it.” Thanks to everyone at SEOmoz, my personality, and my boss's belief that I was willing to work hard to find answers, I landed the job as SEO specialist, along with the highest pay level I had ever achieved ( I was 25). BTW, those free SEOmoz reports I printed out got me HUGE BONUS POINTS FOR THE JOB. My days in the service industry were over!! But my true dilemma had just begun….. I was NOT an “SEO specialist.” I knew that my boss was going to quickly notice if our rankings and web traffic were not increasing. I had just faked it… so I told myself it was time to MAKE IT. So I went back to the place that helped me get my job, SEOmoz, read some more, and started to make recommendations based on my readings. In my first full year as an “SEO Specialist” I have been able to save our company over $20,000 in PPC spending, increase our rankings for hundreds of keywords by literally 100%, bring in a significant increase in e-commerce sales, and increase the amount of visitors to our website by 15%. I started to have friends asking me to do the same “magic” to their websites, then I started accepting cash to do so, then I started accepting so much cash that I HAD to open an LLC for consulting and tax ID purposes. Things were going great until the economy went into a CatastraF***. My boss explained that 6 people, out of a company of 10, were to be fired in the second week of 2009. I thought for sure I was done since I was still the “new guy” or last hire. Oh how SEO and the moz saved me once again…we fired EVERY programmer but 1 and decided to keep the lone SEO because “I was able to bring in sales, save money and really make a difference to our bottom line,” as my boss put it. I was shocked, thankful, sad and happy all at the same time. So here is my thank you to SEOmoz. Thank you for giving me a job, thank you for helping me EXCEL at my job, thank you for helping me keep my job, thank you for letting me become an independent consultant/entrepreneur, and thank you for saving my future marriage! Rand - I did not know about your creed to answer nearly all e-mails personally when I emailed you February 13th with the title “I knew you wouldn't read the RE: Thank you to the MOZ.” It’s always humorous when someone you look up to replies back with a “Thank you and I don’t know what to say!” Maybe he didn’t know what to say because I started my email by saying “Rand you must be the coolest Mother*** alive, best Marketer and all around SEO Legend.” Man, do I love a good Happy Hour! Upon further review… I stand by those words. Rebecca - Your humor is top notch and right in line with what I call “funny.” You have a great knack for tying value and humor together. I need to thank you personally for introducing the word “Honeyhole” into my vocabulary…I use that word quite a bit now but have yet to try or see the tasty sandwich joint you speak of. Jane - You are no longer with the moz but I read this old post not too long ago and could not stop laughing thanks to this gem: “When the 'About Us' is virtually incomprehensible, it isn’t because I am stupid. It is because the site offers nothing and the marketing team doesn't want to let you know it.” Danny Dover - Do you still have that mustache? If so, it's time to start grooming it for the next level of stache. Your current series on How to Start an Internet Business has helped me out greatly as I move forward with my Internet business Great Scott - Your WBF editing skills are great… I really appreciate this Gangsta WhiteBoard Friday freeze frame probably most of all Tom - You look exactly like my good friend Alex from London (Sidcup) You still have the best title for an article on reputation management: “Treat me Mean, I Need the Reputation” - saucy and possibly sadistic?? Will - You look like my good friend Alex’s older brother—are you 6ft 4, too? The older brother is the better looking of the two. I will make no judgments…just observations… Sarah - I sent my friend in law school a link to your writings and he has been hooked ever since. I still think the best piece advice you have ever given was in the post Collecting Past Due Payments: “Sometimes it's better to just let go. Never forget that we're emotional beings and often get carried away by them. Don't let your feelings of anger, guilt, and revenge drive you to pursue a debt beyond what is permitted by debtor's laws or just good financial sense. Learning to let go is also an important skill that needs to be developed over time. “ WORD And that’s what I am going to do…let this post go because it is already too long! There is so much more hard work that goes into the moz than the people I just mentioned, and I thank you greatly as well! One last thing..and this goes out to the community that makes up the moz…you are great because y’all provide JUST as much value to a blog post as the initial blog post itself. Guess it’s time to get that Advanced Training DVD & Pro Membership when I return back from my Honeymoon! Cheers - Adam Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How SEO and The Moz Helped to Save My Life!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How SEO and The Moz Helped to Save My Life!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "amoore-71965\n          \n            amoore-71965"
}