{
  "url": "https://moz.com/blog/how-every-ecommerce-site-should-do-online-marketing",
  "slug": "how-every-ecommerce-site-should-do-online-marketing",
  "title": "How Every eCommerce Site Should Do Online Marketing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Back when I first started my online store, I had no idea AT ALL about SEO and ranking. I just figured that if I threw up a store, they would come. This was 2011, mind you, not 2001! As I started to try and rank my store, however, things got ugly. I no longer run that store, so I’m going to be…",
  "content": "How Every eCommerce Site Should Do Online Marketing E-Commerce SEO By: Shabbir Nooruddin October 10, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Shabbir Nooruddin October 10, 2013 How Every eCommerce Site Should Do Online Marketing E-Commerce SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Back when I first started my online store, I had no idea AT ALL about SEO and ranking. I just figured that if I threw up a store, they would come. This was 2011, mind you, not 2001! As I started to try and rank my store, however, things got ugly. I no longer run that store, so I’m going to be really transparent with all the details - I’ve literally got nothing to hide. My niche was \"reusable sandwich bags.\" If you are not familiar with that, they are basically fabric baggies that you can wash and reuse so you throw out less plastic baggies. In hindsight, the only research and reasoning I did before jumping into that niche was: \"Well, it’s a go green thing, and people are going green, so people are going to love it. Yeah!\" Picture me hiding my face in shame. I’m picturing you laughing so hard you can barely stay in your seat. Anyway, whenever I searched for terms like \"reusable sandwich bags,\" \"reusable snack bags,\" and \"reusable bags\" (I had those too), one particular behemoth dominated the rankings. The screenshots below are using MozBar’s SERP overlay, searching using Google US non-personalized results: (Anyone else notice that Amazon's ad has \"sandwich\" misspelled?) Note the sweet domain authority and page authority numbers - they’ve even outranked Amazon, Google’s best-buddy for product related searches. At this point, I decided to start my journey learning the ins and outs of SEO and inbound marketing. Armed with this new knowledge, I started to take apart Reuseit.com’s awesome SEO campaign to see what they were doing (and if I could replicate it). Shall we dive in? We’ll look at the entire site itself and how it got links. (These aren’t ALL the factors that make a site rank, obviously, but they are the most actionable ones, so I’m putting them here). First, the entire site itself: A quick glance at my handy PageRank Status toolbar for Chrome indicates that the home page has an impressive toolbar PR of 5. A quick WhoIs lookup showed that the domain was registered all the way back in July 2002, which meant it’s had a LOT of time to get comfortable and cement itself in Google’s rankings. Great content: They have a blog that they update regularly with SOLID content and an in-depth resource section Plugging the domain into Open Site Explorer showed some even more impressive results: Key takeaways: PageRank: Not a make-it-or-break-it factor anymore, but it’s a good back-of-the-napkin way to see what you are up against when researching a niche. A toolbar PR of 5 is a formidable opponent, not one to mess with unless you have a GIANT marketing budget and have found the next best thing after sliced bread. If you can get to this position, you are doing something right. Domain Age: The longer you are in the game, the harder it is to outrank you - provided you have been doing SEO right. Guys like these were smart, did phenomenal marketing, and 10 years down the line, they are nearly immovable. If you can manage to last this long, your position will invariably improve. Domain age isn't a make it or break it factor, but there has been quite a lot of debate about it in the SEO world. This post covers the topic in more detail. Great content: Their blog is updated with a new value-adding post every 3-5 days. That is really impressive! Each blog post and each resource article is potential link bait. Also, Google loves fresh content, so the more they update and the more they post, the stronger their rankings get. Try to update your website as much as you can. Even if you don’t have a blog, add an articles section at the very least. Try to post a new article here and there. Not only will this add value for your visitors, but it will also keep you fresh in Google’s eyes. Singling out the one thing that I was competing against them for, let’s see one of their product pages for a reusable sandwich bag: Look at that: 167 reviews! That is an insanely high amount for a product on a (relatively) niche store. Not only is the blog keeping their content fresh, but so are the product pages, which are usually the toughest kinds of pages to rank. They’ve also got a decent number of pins and likes, and the description is unique, too (I know this because I’ve seen the manufacturer descriptions). Backlink Profile: This is the crazy part. They have 1,432 linking root domains (just to the homepage) with 50,930 links! Granted, some of those links might be from the site itself, but still - most small niche ecommerce guys like me would consider building 100 links a massive achievement! So now to take apart the backlink profile. The first link that shows up in OSE (as seen in the screenshot) is from National Geographic, a crazy-high authority site that has a domain authority of 97! How do you think they got that link, you ask? Have a look at the article that they were featured in: They had a powerful message, identified a pressing problem, and presented a viable solution. The right mix of these factors was their secret sauce for getting a truckload of press - which meant links from tons of authority sites! Have a look at their press page: The actual page is maybe 4 or 5 times longer than what could fit in my screen above the fold. That’s an incredibly amount of press! Even if the press coverage was print, or no longer live, just the amount of latent links (as Rand likes to call them) they must have received was amazing. So how do you and I replicate this? Craft a message that aims to solve a problem in your niche. You could have the most boring product in the world, in the most boring niche, but a little bit of creativity will go a LONG way if you can solve problems present in these niches. A great way to do that? Look through forums and see what kind of questions keep coming up (credit to Pat Flynn for this nugget). If you can find a creative enough way to solve a problem, you essentially have a message: We can solve this problem! It’s as simple as that. With the right mix of marketing and getting word about you to the right people, you can get the same kind of press - even if it’s only from authority publications in your niche - but it’s still authority PR. How else did they get so many links? The answer: fantastic customer service and outreach. We already saw how their press outreach was, but what about outreach to bloggers and other internet users? They started an ambassador program. Because their message was so powerful, they actually got people to sign up for their ambassador program and promote their message (with their business, too!). If you can create a message that resonates so well with your customers, you have a winner on your hands. For the remainder of their links, I’m sure they had the standard fare of directories, link pages, a guest post here, and there, but as you can see, what really set them apart was their fantastic message and the way they conveyed it. Conclusion Granted that these aren’t the only factors that influence a site’s ranking and marketing, there are still some key takeaways that every online store owner should incorporate in their inbound marketing strategy: Be in it for the long run Have fresh content Create a message and sell your product through your message Hmm, this is starting to look a lot like content marketing... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Every eCommerce Site Should Do Online Marketing"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Every eCommerce Site Should Do Online Marketing"
    },
    {
      "level": "H2",
      "text": "Key takeaways:"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Common Mistakes E-commerce Websites Make Using JavaScript"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Shabbir Nooruddin\n          \n            Shabbir Nooruddin\n          \n            Shabbir Nooruddin"
}