{
  "url": "https://moz.com/blog/how-to-steal-from-your-favorite-writers",
  "slug": "how-to-steal-from-your-favorite-writers",
  "title": "How to Steal from Your Favorite Writers to Make Your Copy Sing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "How often do you sit down to read a book and find yourself hooked within the first few sentences? Or even the first few words? I would venture to bet the answer is \"not often.\"In fact, I find that the books which turn out to be my favorite in the end typically take at least 50-100 pages to “pick up…",
  "content": "How to Steal from Your Favorite Writers to Make Your Copy Sing Content Marketing | Blogging | SEO Copywriting By: Katy Katz April 5, 2016 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Katy Katz April 5, 2016 How to Steal from Your Favorite Writers to Make Your Copy Sing Content Marketing | Blogging | SEO Copywriting This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. How often do you sit down to read a book and find yourself hooked within the first few sentences? Or even the first few words? I would venture to bet the answer is \"not often.\"In fact, I find that the books which turn out to be my favorites typically take at 50-100 pages to “pick up pace.” But we expect that when we read a good book. We come to the table knowing what we’re signing up for. We’ve already made a commitment.We don’t have that luxury in digital marketing. And we definitely don’t have it when we’re writing for a brand. You typically don’t get hours of intimate interaction to sell your story. You have to grab your reader’s attention right off the bat.It takes one-tenth of a second to form a first impression, whether that impression is of a person, an ad on the subway, or a tweet from a company. Digital marketing is like the jacket cover of a book, the sales pitch you might say.(Image SOURCE)You have to put your best foot forward with every word you write.So how do talented writers create interesting content for online consumption? What is the magic recipe they use to ensure we hang on every word, laugh at every joke, and scroll all the way down to the illustrious bottom of the page?Some writers are naturally talented and can punch out riveting content in their sleep. The secret, however, is that most writers use some sort of formula, one that includes a combination of writing best practices and solutions that work for their particular readers.Building a formula can take some skill and a lot of time. If there’s one thing I don’t like to do, it is spending a lot of unnecessary time on something when there is a faster and better way to do it. Bring on the growth hacks!So I’ve pulled together a few tricks you can use right away to craft content that will make your favorite writers proud and, more importantly, engage your readers!Steal from your favorite writersBefore you throw digital stones at me, I’m not talking about stealing ideas, or information, or any of the actual meat of your favorite writers' content (although there are instances where that type of “inspiration\" is appropriate to act on, too, as long as you properly cite your material).While drawing inspiration from competitors may help you come up with content ideas, it won’t help you improve your own creation process. The way to get better at writing is to copy the structure of content used by your favorite writers.Take a blog post you were really impressed with — something that you stuck with all the way to the bottom —and break it down to its smallest elements.It’s time dust off those primary school skills and create an outline of what the blog post included in its introduction, body, and conclusion. And I’m not just talking about blogging best practices (we’ll get to those in a bit). What about the writing did you connect with?Some questions to get you started include:How did it draw you in? Was it a relatable story or quote? Did it use common or formal language? Did it have compelling statistics? How many points did it use to support the thesis? How long were the sentences, paragraphs, and the post itself? Did it have humor, or passion, or another form of craveable content? (Image SOURCE)Break the post down, paragraph by paragraph, and build an easy-to-follow template to replicate with your own writing.Build templates from well-written contentDemian Farnworth of Copyblogger is a writer whose work I really enjoy reading, for example. Here is a post he published recently about writing trustworthy content. As you can see, right off the bat there are some standout things he did to help draw you into the post.A style template based on this post would look something like this:Introduction: He uses a relatable story (in this case about an actor everyone knows) which speaks to the article’s thesis. Second section: This post almost has an “intro part two” with an explanation for how the story applies to this concept, an introduction of the thesis, and a call-to-action right off the bat. Body: There is a list of 10 digestible sections with brief supporting paragraphs and informative takeaway points. The points provide further application of the story from the first section. Conclusion: He closes with a quote that summarizes the thesis, provides a simple call-to-action, and remind the reader of their relationship with the writer. Style: He uses a conversational tone with storytelling best practices, including sprinkling tactile words and quotations throughout the copy. Format: The post has brief paragraphs (one to two sentences long, on average), frequent, descriptive headlines, only a few paragraphs between the headlines, bulleted lists, block quotes, and is about 1,500 words. Apply the templates to your own writingGoing through the exercise of building a template from your favorite content will help you digest what goes into a truly well-written post. And it will turn an elusive concept into an actionable strategy. Plus, as a bonus, it only took me 10 minutes to read the post and put the list together — so you can do it quickly, too!And don’t stop with just one writer or one blog post — you’re not getting off that easy. Go through different blog types (e.g., lists, comparisons, interviews, case studies) in various industries. You get bonus points if you find something that doesn’t directly pertain to you, but is so well-written that you can't stop reading it.Pull out the common themes, formats, and styles from the templates you create. You will find that the more you practice like this, the easier it will be to set up your own outlines when you sit down to write.You will also start to see that there truly is a method to the madness of good writing, and it’s not just about learning basic grammar (though that is important!). The best writers have a purpose for each paragraph of their content.Stop making everything about youThe cold, hard truth is that your website is not about you. We all know those people who only like to talk about themselves. Even when they do let you get a word in, they don’t actually listen to what you’re saying. You can see it in their glossed-over eyes that they are just using the time to plan what they will say next.That’s how your visitors feel when you spend the whole time talking at them about features instead of talking to them about benefits. This is one of the hardest concepts I’ve found for businesses to grasp, but it can mean the difference between mediocre content and great writing.Uncover the actual benefits that your business provides to your ideal customer — don't just list the features of your product or service. Reveal the outcomes for the consumer. When you start thinking about benefits, you can write content for your readers about your readers — instead of writing it for yourself about yourself.You may have seen Simon Sinek’s TED talk about “the why.” In the words of Mr. Sinek,This concept works in marketing because the why is about connecting. The why gives your readers a point of alignment. The \"what\" just fills in the details.I would actually even tweak this point a step further, however, to say “they buy why it’s important.” This distinction is necessary to understanding the concept that they buy “why you do it” because it is aligned with their purpose — not the other way around.Use a template to remember the basicsI’m going to assume that if you are reading a post on YouMoz, you’ve been at least introduced to the basics of writing for the web. And more than likely, you know SEO and web principles inside out. You can recite in your sleep how to:Write for a person and a stage in your buyer’s journey Use headers, short paragraphs, and lists Use long-form and short-form content Utilize SEO best practices like keywords, meta descriptions, and H1 tags Cite relevant content with outbound links Include a call-to-action But a funny thing can happen when we sit down to write an actual piece of content, especially if we’ve been doing it for a while: We can get too comfortable, try to move too fast, and forget some of the basics.One way to ensure that you don’t leave the important aspects listed above out of your blog is to keep a content marketing checklist handy. After all, in marketing, good writing is that which is discovered, digested, and acted upon. These principles will help you get discovered in the first place. So don’t let your efforts to become the next Ernest Hemingway thwart your grasp of the basics.Keep the checklist handy, but don’t start with it. This will hinder your creative process and could lead you down that ugly path of just writing for search engines (see the next point). Stick to the templates to get your writing flowing, then verify your work with the checklist.Don’t simply write for humans; write for your humansLast, but far from least, write for the people in your audience. This means not only writing for humans (instead of search engines), but writing for your humans.Take the time to add personal information to your personas and ideal customer profiles. When you have details, language, and quotes, you can build out stories in your content that grab your readers from the beginning and leaves them thinking, “Hey, I’ve been there, too!”This is not easy to do because it takes time and a little grunt work. You may even have to pick up the phone and call a few of your customers (gasp!). But I promise that you will be rewarded in the end. You will learn more about your customers (always a good thing) and your writing improve. When you blend SEO best practices with old-fashioned, good writing, you will make content magic. Your readers will go beyond reading to the bottom of the page. They will enjoy what they’ve read, share it with friends, and come back for more.Have you used any tricks or tools to get better at writing? I’d love to hear about them in the comments below! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Steal from Your Favorite Writers to Make Your Copy Sing"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Steal from Your Favorite Writers to Make Your Copy Sing"
    },
    {
      "level": "H2",
      "text": "Steal from your favorite writers"
    },
    {
      "level": "H3",
      "text": "Build templates from well-written content"
    },
    {
      "level": "H2",
      "text": "Apply the templates to your own writing"
    },
    {
      "level": "H2",
      "text": "Stop making everything about you"
    },
    {
      "level": "H2",
      "text": "Use a template to remember the basics"
    },
    {
      "level": "H2",
      "text": "Don’t simply write for humans; write for your humans"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Katy Katz\n          \n            Katy Katz"
}