{
  "url": "https://moz.com/blog/how-to-use-search-engines-web-data-to-conduct-a-comparative-analysis-of-brands",
  "slug": "how-to-use-search-engines-web-data-to-conduct-a-comparative-analysis-of-brands",
  "title": "How to Use Search Engines & Web Data to Conduct Competitive Brand Analysis - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This week, the SEOmoz crew and I are heading to Pubcon in Las Vegas for one of the search industry's more advanced conferences. However, before departing, I felt an irresistable urge to do some coverage of a tough competition shaping in the world of search marketing...",
  "content": "How to Use Search Engines & Web Data to Conduct Competitive Brand Analysis Competitive Research By: Rand Fishkin December 2, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 2, 2007 How to Use Search Engines & Web Data to Conduct Competitive Brand Analysis Competitive Research The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This week, the SEOmoz crew and I are heading to Pubcon in Las Vegas for one of the search industry's more advanced conferences. However, before departing, I felt an irresistable urge to do some coverage of a tough competition from the world of search marketing and use it to illustrate how search-savvy analysts can use the engines to get insight about multiple brands in an industry. The inspiration for this comes from two sources, both worth a read - this interview from Lee Odden with Kevin Ryan & Kevin Heisler from Search Engine Strategies & SearchEngineWatch, respectively - and this one - SEL vs. SEW: And the Winner Is? by Matt McGee. The interview suggests to me that there's is considerable defensiveness, hubris and contention over the competing conference series, and Matt's post (along with the water cooler gossip of lots more threads on the subject) tells me the search industry is particularly fascinated by the conflict (no surprise, as our niche has a seemingly unquenchable thirst for drama). First off, I want to take issue with Matt McGee's post. Matt's an incredibly smart guy, but I think he does a bit of disservice by using a single metric to calculate a brand's reach in comparison to another. Yes, comparing feed subscriptions through Bloglines over time is a reasonable data point to use, but when so much information is available at our fingertips, shouldn't we go all the way? Here's how I'd analyze competing brands in the search marketing space: First, you want to see where the overlaps are between the businesses. From the chart above, I'd say that SEW and SELand are directly competitive, as are SMExpo, SES & Pubcon. The other businesses target similar groups, but probably don't overlap to the same degree. The founding year is very important, because it will help us as we look at comparative data to make guesses about the speed of growth or stagnation. Here's a key to the data columns above: URL - the domain of the various properties (note that I've shortened these to fit) G#s (6m) - the number of Google results for a search for the domain name (including the extension) for the last 6 months, excluding the domain itself. Here's an example of how to perform this search - \"searchenginewatch.com\" -site:searchenginewatch.com G#s (3m) - as above, but for only the last 3 months GBlog (All) - a Google Blog Search for the domain name, excluding the domain itself, on the default settings (no particular timeline) GBlog (1m) - as above, but for only posts that have appeared in the past month GPR - PageRank of the domain homepage as reported by the Google Toolbar This data gives us insight into the prevalence of mentions for the various domains. By referring back to this data, we can draw some conclusions about domain and brand popularity in general, including the respective brand penetration and saturation as well as an idea of who's \"gaining\" ground and how quickly. Again, some quick bullet points to explain the columns: URL - This is the same as the above chart. MS Links - Live says they're shutting down their link searches again in a few weeks, so I'm lucky to have this data. The format used for the search is +linkdomain:searchenginewatch.com -site:searchenginewatch.com to remove internal links. QUICK NOTE - The numbers here jump around so much that they may not be valuable. I just ran 3 queries for the searchenginewatch domain and got results ranging from 600K to 3.5million. Yahoo! Links - This link data comes courtesy of Yahoo! Site Explorer, where the search is performed with the parameters that include external links onyl to any page on the domain. The numeric data here appears far more reliable than the Microsoft/Live link data. Trati Auth - This is Technorati's Authority number, which derives from the number of individual, unique blogs that have linked to a site in the past 90 days. GfdSbs - Google's feed subscriber numbers, which can be found by searching for domains inside Google Reader. BLSbs - Bloglines' subscription numbers which derive, as above, from searches performed inside Bloglines. This data is a bit more domain and SEO-centric, but it also tells a great story about the success of the various domains from a web marketing perspective. Link data and feed subscribers are going to be highest for sources reporting the news and offering popular blogs, but even the secondary sites make for interesting comparisons between one another. Key to the Above Chart: Brand Name - this is the exact term or phrase I used to perform queries. In some cases, such as \"search engine strategies\" and \"information world review,\" it appeared from the results that many mentions were meant to be general, rather than representative of the brands, but I've included the data nonetheless. G#s (6m) - A search at Google, restricted to the last 6 months, for the brand name term or phrase. G#s (3m) - As above, but for only the last 3 months. GBlog (All) - A Google Blog Search for the brand term/phrase using the default settings (no time frame). GBlog (1m) - As above, but limited to blog posts from the last 1 month. As much as the website metrics are valuable, the brand names themselves can sometimes provide even more insight. After all, not everyone is going to use the domain name when talking about a conference series or brand, nor will they all link. Thus, looking at brand mentions over the past few months can provide valuable competitive analysis. The numbers in this last chart come from the posted member numbers on pages like SEWatch Forum Members, Sphinn Members, an educated guess about WebMasterWorld, & SEOmoz's internal figures. The \"user engagement\" data is a pure guess on my part, based on the amount of user-generated content and activity on the sites. The last column, brand recognition, is also a pure guess, based on my experience of talking to, emailing, and visiting folks in the search marketing world. This kind of data is valuable because it helps us realize the level of interaction users have with these various sites on a regular basis. Not every site is going to have data like this, but if you're analyzing competing domains that offer user engagement, don't overlook this information. Takeaways from this analysis: Third Door's Search Engine Land property is clearly a runaway hit. According to nearly every metric above, it's taken only a year to grow to a size similar to SearchEngineWatch, though the latter had a ten year lead. Search Marketing Expo isn't yet of comparable size to Pubcon or SES, but again, the growth rate over the past 6 months (the first SMX was June of 2007) would indicate that if it stays on this path for 2-3 years, it could leapfrog both. It would appear that Third Door Properties and SEOmoz both have faster growth curves than either of the other two (although SEOmoz doesn't really compete directly with any of these sites). Between the two, however, Third Door is clearly on the faster path of growth. Revisiting these numbers in 6 and 12 months would probably be incredibly interesting :) Hopefully this example serves not only to satiate the curiosity of search marketers wondering about the X vs. Y battles, but also illustrates how to perform a more robust competitive analysis on domains and brands. BTW - As a pre-emptive strike against the inevitable, let me point out that I have good cause not to trust any data from Alexa, QuantCast or Compete, and I would suggest that savvy brand analysts stay away from these services until they prove themselves to have greater accuracy. FULL DISCLOSURE: Although we at SEOmoz don't directly profit from any of the conference series or businesses mentioned above, we have had professional and financial relationships with all three organizations in the past, and have currently active relationships with both Pubcon & Third Door Media's properties. p.s. Joe still has a few tickets left for shows in Vegas tomorrow night, so if you're itchin' to see Spamalot or Blue Man Group, make sure to visit his blog. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Use Search Engines & Web Data to Conduct Competitive Brand Analysis"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Use Search Engines & Web Data to Conduct Competitive Brand Analysis"
    },
    {
      "level": "H2",
      "text": "Try our SEO Competitive Analysis tool"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Actually Be Better Than Your Competitors in the Eyes of Choosy Customers"
    },
    {
      "level": "H3",
      "text": "SEO Gap Analysis — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Daily SEO Fix: Competitive Link Research"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}