{
  "url": "https://moz.com/blog/how-to-cheat-your-way-to-eyecatching-facebook-ads",
  "slug": "how-to-cheat-your-way-to-eyecatching-facebook-ads",
  "title": "How To Cheat Your Way To Eyecatching Facebook Ads - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This post will look at Facebook ad images and understanding why particular ones stand out so that you can apply the lessons to your own Facebook campaigns. At Trialreach I do a lot of multivariate analysis of Facebook ads and it is important to learn from what is working on other ads to feed my…",
  "content": "How To Cheat Your Way To Eyecatching Facebook Ads Social Media By: Firstconversion.com January 22, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Firstconversion.com January 22, 2013 How To Cheat Your Way To Eyecatching Facebook Ads Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. This post will look at Facebook ad images and understanding why particular ones stand out so that you can apply the lessons to your own Facebook campaigns. At Trialreach I do a lot of multivariate analysis of Facebook ads and it is important to learn from what is working on other ads to feed my multivariation beast. If you are new to Facebook advertising, I recommend this one hour video from Shoemoney - it’s entertaining and educational in equal measure and even though it’s quite old, it is still relevant Consider your Ads Against the Whole Facebook Page It’s not enough to create a great ad; you have to create an ad that looks great on the page, sitting next to its competitors. It is easy to jump in and start creating ads, but your starting point should be a look at the Facebook landing page and the ads that appear there. You will notice it’s noisy as hell and difficult for an advert to stand out. This is why the image part a Facebook ad is so critical. There are two basic tactics I like to use at the start of a campaign: 1. Create multiple profiles to monitor what is being shown to target demographics Create a few different profiles that map to the people you target, so that you can see what types of ads and advertisers are targeting your group. As an example, I am advertising to women in India and they get shown a very different set of ads than I would get sitting here in London. 2. Keep a scratch pad of ads that stand out I keep a scratch pad of ads that catch my eye in a powerpoint document so I can analyse and work their techniques into my own ads. My Approach: Visualise a Facebook Ad funnel Images play the greatest part in attracting the eye and the text is what attracts the click. I view the three distinct parts of the Facebook ad as a funnel – Image to attract the eye > Title to confirm the ad is relevant to the user > Body Text to attract the click. Obviously this can vary, but this approach stems from the fact that if people glaze over your ad because your image sucks, they never get to see the sales part of your message So what tactics can you use to make your images stand out? 1. Use Brand This RSPB ad stood out because it has an element from nature but also has RSPB three times in the ad. The fact that they included their logo in the image drew my eye. Nissan manages to get three brands and a TM into their ad. (They also completely break the Facebook ad guidelines with “click here to win it”, but if you spend as much as Nissan does, you may get to break the rules). What I also like about this image is the shark fin in that it generates a gut-level, visceral response to the image. Another example from Topman, hammering home their brand and incentivising action with a competition. Marin does the same with a big, bold logo, blasting their brand and cleverly challenging a very competitive set of people to a quiz. 2. Use Time and Scarcity Sky makes use of a classic CRO trick of scarcity to encourage users to sign up, repeating the “last chance” message in the image and the body copy. Capital One focuses on time in this ad and include the call to action in the image. The timeframe is so short that they are almost daring people to click and see if they get a response in one minute. 3. Use Free Here Sky use Free to draw attention. What I like about both Sky ads is that they each focus on the single concept that they are trying to get across and do not dilute the message of specific ads. 4. Use Surrealism and Humour You can’t have British advertising without a bit of surrealism! This is a clear case for the funnel approach – the footballer kicking the green cow has nothing to do with betting text but it draws the eye to make people read the title and text. The British Prime Minister is used in a surreal picture to attract the eye. He is a polarising politician and many people would have a gut level reaction to his image. (You could imagine a Texas gun shop using images of Barack Obama to the same effect). . Here BlaBlaCar photoshop a very well recognised image into something that looks wrong to catch your eye 5. Be a Vampire If you don’t have anything interesting to say about yourself, use someone else’s news. I have never heard of doddleme but I do know that the GoPro is an awesome camera, so it attracted me to their ad. 6. Use Cartoonish or Distorted Images People will be scanning the page, rather than reading, so over emphasising parts of your image can help to attract attention. This cartoon stood out from the stock photo ads around it. I quite like the visual impact of the arrows. 7. Use headshots Close ups of pretty women looking straight at the camera seem to do quite well. But I’m sure you knew that already. I liked this ad from Zara as an alternative to the headshot, with the camera pointing straight out. 8. Use Colour An easy way to stand out is to play with the colour pallete. Facebook is blue and white and has very cold tones. Greens, Oranges and Reds stand out. This is one of my favourites ads. This ad catches attention with the image and then the very minimal text encourages people to click through to find out more about the promise. This yellow stood out a mile on the page. This green background stands out and the half-dressed women also help to draw the eye. This would not have stood out except for the red line around the image. The contrasting colour outline worked on me. The yellow close up shot really stands out. I also love how evil this ad is – attracting the eyes of fat people with food and then selling them weight loss products. The quote and the third person text are also concepts worthy of testing in your own ads. Here is an example of three images I am currently trying out on one of my campaigns. We were using the hands image by default before starting multivariate testing. The green woman works best for click throughs but the doctor has the best actual goal success rate. The hands perform relatively poorly. So CTR is not everything, you have to keep an eye on your ultimate goal. More on that in the future... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How To Cheat Your Way To Eyecatching Facebook Ads"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How To Cheat Your Way To Eyecatching Facebook Ads"
    },
    {
      "level": "H2",
      "text": "Consider your Ads Against the Whole Facebook Page"
    },
    {
      "level": "H3",
      "text": "1. Create multiple profiles to monitor what is being shown to target demographics"
    },
    {
      "level": "H3",
      "text": "2. Keep a scratch pad of ads that stand out"
    },
    {
      "level": "H2",
      "text": "My Approach: Visualise a Facebook Ad funnel"
    },
    {
      "level": "H3",
      "text": "1. Use Brand"
    },
    {
      "level": "H3",
      "text": "2. Use Time and Scarcity"
    },
    {
      "level": "H3",
      "text": "3. Use Free"
    },
    {
      "level": "H3",
      "text": "4. Use Surrealism and Humour"
    },
    {
      "level": "H3",
      "text": "5. Be a Vampire"
    },
    {
      "level": "H3",
      "text": "6. Use Cartoonish or Distorted Images"
    },
    {
      "level": "H3",
      "text": "7. Use headshots"
    },
    {
      "level": "H3",
      "text": "8. Use Colour"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Firstconversion.com\n          \n            Firstconversion.com\n          \n            Firstconversion.com"
}