{
  "url": "https://moz.com/blog/how-to-read-a-resume",
  "slug": "how-to-read-a-resume",
  "title": "How to Read and Review Resumes - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "And now for a little departure from your regularly scheduled SEO posts - for a foray into hiring and recruiting.  We have been doing a lot of hiring recently at SEOmoz and lots of people have inquired what we look for in candidates.  The truth is, we really try to give everyone a chance, but this…",
  "content": "How to Read and Review Resumes SEO Copywriting L By: Leah Candelaria-Tyler July 20, 2011 Table of Contents Copied! L By: Leah Candelaria-Tyler July 20, 2011 How to Read and Review Resumes SEO Copywriting Hey SEOmoz Blog readers! Please be advised - this is NOT an SEO tech-fiend blog. This evening, I want to draw your attention to another SEOmoz tool. If you have ever wondered just how we found all the great people that make SEOmoz so awesome, here is a blog on how to read a resume for the tech-world, which, as you know, is very popular these days. There are also some tips for those of you tech-savvy peeps applying for jobs and wondering how to make your resumes sparkle! So, to set the mood, let's imagine it’s summer, graduates are graduating, selling their extra long sheet sets, and ironing their one good, clean, crisp white shirt. Hiring season has begun! The evidence is in the résumés we’re receiving for our open Software Engineering positions. With recruiting efforts in full-swing, the pool is deep as it is wide. As we begin to review and sift through the seemingly endless stacks, we find that the we are comparing new CS grads to seasoned engineers. Knowing who makes a better candidate with even this distinction is not as black and white as one might think. While one candidate might have everything you need, the other just seems cooler and capable of learning more than the other candidate already knows. What to do? Google? Yes, you Google. And yes the web is rich with “how to write a successful résumé” forums, and even paid sites, but a search for “how to read a successful résumé” yields scrawny results, particularly in the tech world. I would send you to those sites, however pebbles are more interesting. So here we are again, trying to make the web a better place with yet another resource! Luckily, I was able to sit down with Kate Matsudaira and pick her brain on recruiting techniques. Below are practices Kate uses to sift through résumés, and, tips for those that are in the process of writing their résumé. For skimmers, the TIPS in blue are for those writing their résumé, and the numbered sections are for those who are reading them. Hawt Points and Red flags are in, well, red. How do you know who is interview worthy? 1. Reading and Deciphering The most important question to ask yourself when reading a resume is: is it easy to distill information about this candidate? Candidates can certainly brag about themselves, but knowing when you are looking at something that is actually good and not a messy mud puddle can be hard to discern. Here are some hawt points and the way in which to read into them: Hawt Points • Objective. Sometimes software engineers want to be project managers. Know who actually wants the job you’re offering. • Experience. Where have they been and do you like where they have been? Have they included dates of employment? How many jobs have they held in the last year? Relevant experience? • Skills, Languages & Technologies. Are they versed in the capacities listed in the requirement section of your job post? Are they too expert sounding in too many languages? Did they list MS Office Suite? • Projects. Do they include the duration of the projects they have listed, as well as people they probably worked with on these projects? • Education. Did they go to an exceptional school? Complete their degree? If they didn’t, what was their GPA? Honors, awards, scholarships? Achievements? • Outside of Work. Do they list their interests and activities? Do they appear to exhibit a sense of passion for the work you are asking of them? TIP: The simpler the better. The recruiter’s job is hard enough, how about making it easier on them? Spell checking shows that you pay at least a little attention to detail, as does pretty formatting. But remember to hit the main points: Jobs, Education, Skills, and if it seems applicable, projects (including the duration of the projects), and accomplishments (such as graduating with honors or that you won 1st place at the Google Code Jam.) 2. Record of Promotion If the candidate has moved up the ladder, successfully filling multiple roles while at one company, that’s probably something worth noting. Here’s a an example: TIP: If you are creating your résumé and want to know what to show off, let the world know that you have an interest in yourself, and are genuinely, well, awesome! Show you have been promoted. Recruiters like that stuff. It also shows that people like you and what you do. Even if it was merely a change in job title and not an increase in pay. 3. Know the Good Companies from the Bad This might seem obvious, but successful companies usually have strong employees behind them. How did they get those strong employees? Well, they are all American Gladiators… or they have a rigorous hiring process. Sexy 80's American Gladiators Photo Source If a candidate has worked somewhere you know hires only REALLY good people, they are probably worth checking out. Also, don’t forget about the little guys! They might be small and new – but they tried! Not sure? Sometimes their mission statements, or job postings showcase the type of employees they hire. We do, and so do lots of other people out there. Next time you are looking at a resume, check out the companies your candidates worked for and see what THEY looked for in a candidate. You can also look at their current employees in similar roles on LinkedIn to get a feel for the caliber of talent they were looking for. TIP: You will probably be Googled, so you might want to take that Facebook photo down. You know which one I am talking about. Oh, and set up a LinkedIn account and start networking! (If you build it, they will come.) Be sure to fill in as much information as possible, and start networking with people you meet in interviews, it lets the recruiter know you are interested (and helps them remember you (*wink*). 4. School is Cool Obviously, if you are hiring for a tech position and the candidate went to a top computer science program and earned advanced degrees in Computer Science, Linguistics, Physics, Mathematics…. they are probably pretty dang smart. But don’t overlook those that have high GPAs from the lesser-known schools! A degree is still an accomplishment – especially if they graduated Cum Laude with a GPA higher than 3.7, honors, or additional degrees. Those folks are extremely interview-worthy and these are impressive achievements; it shows they worked hard and take pride in their work. Isn’t that what you want in a candidate? TIP: Wondering if you should include your GPA on your résumé? If you received below a 3.5 GPA, then you may not want to showcase it on your résumé. But above a 3.5? Heck ya! Show your stuff and pump it up with activities, honors, awards, and personal achievements. That is an accomplishment and there are people who pay attention to these details. At SEOmoz, we have interviewed candidates with otherwise unimpressive resumes because the candidate’s achievements at school or in their personal lives warranted a phone screen. Their dedication was simply too impressive to pass up! As an aside, school is way cool, but it isn't necessarily everything a candidate has to offer. If you take all of those hawt points listed above, and they exceed your expectations without even looking at their education, bring them in! Did you know that SEOmoz's own CEO dropped out of college? Some people are just really smart, motivated and super dedicated, and that says a lot about character. 5. Trophies, Patents, Awards and Certificates Not everyone receives a fancy award or honor, so those are good to look at, especially fellowships, grants and scholarships. If someone else is willing to pay them for something amazing they did, you might find them worthy of a few peanuts, too. It also shows that the candidate is willing to go that extra mile to prove they have mad skills. And that’s what you should be looking for, right? Ask yourself, “What do they do outside of work?” Are they involved with Startup Incubator as a finalist or member, have they participated in industry events such as Google Summer of Code, Startup Weekend, or have they attended conferences, or presented at conferences. (pssst....hidden TIPS are in this paragraph!) TIP: Get yourself awarded? No seriously, if you are amazing, then apply for a grant, or enter a contest! It’s not just for mom, it’s for your future (barf!) Show passion and achievement outside of what you get paid to do. “It’s more about the achieving nature of the person than the achievement.” Kate Matsudaira. 6. Projects and Mad Skills Instead of being impressed by a long list of known technologies, an example of how the candidate has used them is way more impressive. Let's pretend we are looking for someone with experience in building a house using a hammer, screwdriver, nails and screws. A better resume would list how they used the tools (hammer, screwdriver, nails and screws), is a manner such as this: \"My last project was building a house. For this project I used a hammer, a screwdriver, nails and screws.\" Savvy? Also, the cover letter is the best place to discover if a candidate is looking to work vs. looking to fulfill a passion. If the developer is truly passionate about being a developer, then he/she’s probably working on side projects or learning a new language. These are things to look for in an application. If an interviewee told us they created a webpage especially for their interview, it wouldn’t be the first time, and there hasn’t been a time we didn’t consider them for the position. What scientist doesn’t like proof? TIP: Flaunt it if you got it! In a meeting with Andrew Maguire, founder of InternMatch, he referenced a really interesting write up on an innovative way to draw attention to your mad skills. The concept: Kill the Cover Letter. Although this relates to interns looking for internships, it’s really not a bad idea all across the board. You can always write up a traditional cover letter and refer them to your nifty digital “cover letter”. Then you would really be cool, especially if there are multiple Tweets and Likes proving it. It’s a socially driven world, get with it! 7. Lesser Known and Used Ideas and Strategies If you don’t use a platform like Jobvite, take advantage of Survey Monkey. Have them answer all the generic make-it or break-it questions you have before contacting them. You can also ask them questions that are geared toward the kind of culture you are trying to maintain, or even create. You know, weed out the pen sniffers and the too secretive, secret Santas. Creepy Secret Santa Photo Source When you find yourself completely stumped on a candidate, it’s better to err on the side of giving them a chance. In fact, at SEOmoz, we worry about missing good people while only depending on their resumes as a filter. This is when the survey comes in handy. You can format it to do the 1st interview for you, and control your interview process. Here are some of the questions from our survey: Where do you want to be in 5 years? How would working at SEOmoz help you meet those goals? What project do you consider your greatest success and why? Tell us about a mistake you made recently that you learned a lot from. What do you love best about being a software engineer? Why did you apply to SEOmoz? Is there a particular product/feature/technology you want to work on? Why do you think you'd be a great fit at SEOmoz? Please provide a link to a page you consider to be the funniest on the internet. 8. The moral of the story... The suggestions listed above are derived from implemented practices here at SEOmoz. While we would like to say that our process is flawless, it is in fact organic. Depending on your recruiter, these tips could really scale down the otherwise arduous task of locating that awesome fit! An interesting outcome in utilizing these practices, especially the survey, is that you’re uncovering a personality that may or may not fit, or may not fit in the cover letter or resume format, and therefore on your team! A Few Red Flags: When reviewing resumes there are lots of things to look for in a resume, but there are also some things that may make you raise your eyebrows. Below are some of the things that can raise doubts in our mind (so if you are writing a resume be sure to avoid them). Of course, never let one or more of these prevent you from talking to a candidate, since good people do write bad resumes; however some of them may warrant additional questions and investigation. The never - ending resume. No one cares about your high school job unless you just graduated or are still in high school. TIP: If you have a lot of work experience, only include the most relevant if not the most recent positions. The Expert at everything. What did Anonymous say? Oh yeah, “An expert is someone who knows more and more about less and less, until eventually he knows everything about nothing.” TIP: If you suggest that you’re an expert at everything you do, you have nothing to learn. Often times, the experts are not who recruiters are looking for. They tend to be, well, know- it-all’s. The job jumper Unless you are a time bender like Hiro Nakamura, no one should have 20 jobs in 3 years. TIP: Um, don’t be a job jumper. You’re not only wasting your employer’s time, but your time. Obviously you're not happy with what you are doing, so find something new. The endless list of accomplishments (liars, freeloaders, scrubs): Unless you actually saved a litter of puppies from certain death on your way to work while juggling 10 cups of coffee – don’t say you did. It’s lame, and if someone else helped you with that project, it’s good karma to extend those kudos. TIP: Figure out what you have to offer. If you feel like you don’t have anything to show for yourself, express it as a goal in your cover letter. If you do have a ridiculous amount of accomplishments within a very limited time span, chances are we won’t consider you, because it's next to impossible. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Read and Review Resumes"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Read and Review Resumes"
    },
    {
      "level": "H2",
      "text": "How do you know who is interview worthy?"
    },
    {
      "level": "H3",
      "text": "1.  Reading and Deciphering"
    },
    {
      "level": "H3",
      "text": "2. Record of Promotion"
    },
    {
      "level": "H3",
      "text": "3.  Know the Good Companies from the Bad"
    },
    {
      "level": "H3",
      "text": "4.  School is Cool"
    },
    {
      "level": "H3",
      "text": "5.  Trophies, Patents, Awards and Certificates"
    },
    {
      "level": "H3",
      "text": "6.  Projects and Mad Skills"
    },
    {
      "level": "H3",
      "text": "7.  Lesser Known and Used Ideas and Strategies"
    },
    {
      "level": "H3",
      "text": "8.  The moral of the story..."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Anatomy of Addictive Content"
    },
    {
      "level": "H3",
      "text": "Humans vs. Robots: Picking the Best Audience for Your SEO Content"
    },
    {
      "level": "H3",
      "text": "How to Stay Creative With an SEO-Driven Content Strategy"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Leah Candelaria-Tyler\n          \n            Leah Candelaria-Tyler"
}