{
  "url": "https://moz.com/blog/how-to-appear-in-googles-answer-boxes-whiteboard-friday",
  "slug": "how-to-appear-in-googles-answer-boxes-whiteboard-friday",
  "title": "How to Appear in GOOGLE'S ANSWER BOXES - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Featured snippets are here to stay, and they're proving to be an important goal in the never-ending quest for rankings. In this Whiteboard Friday, Rand explains the 3 types of featured snippets and how you can best position yourself to grab those coveted spots in the SERPs.",
  "content": "How to Appear in Google's Answer Boxes Advanced SEO | Search Engines | Whiteboard Friday By: Rand Fishkin September 23, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 23, 2016 How to Appear in Google's Answer Boxes Advanced SEO | Search Engines | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Featured snippets are the name of the rankings game. Often eclipsing organic results at the top of the SERPs, \"ranking zero\" or capturing an answer box in Google can mean increased clicks and traffic to your site. In today's Whiteboard Friday, Rand explains the three types of featured snippets and how you can best position yourself to grab those coveted spots in the SERPs. Click on the whiteboard image above to open a high-resolution version in a new tab! Video Transcription Howdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week, we're going to chat about answer boxes, those featured snippets that Google puts in ranking position zero, oftentimes above the rest of the organic results, usually below some of the top ads, and sometimes they can draw a ton of the clicks away from the rest of the 10 results that would normally appear in Google's organic ranking. Now, thanks to our friends up at STAT in Vancouver — Rob Bucci specifically, who did a great presentation at MozCon, he delivered some really interesting research — and so we know a little bit more about the world of featured snippets. Specifically, that there are three kinds of featured snippets or answer boxes, if you prefer, that appear in Google's results on both mobile and desktop. Now, Rob used desktop-based, but in my research I checked through all the examples that I could find, and the same featured snippets that we saw in desktop were replicated on mobile. So I think this is a pretty one-to-one ratio that's going on here. The three were paragraphs, lists, and tables. I'll show you examples of all of those. But globally, we're talking about 15% of all queries in STAT's database that came up with one of these answer boxes. Paragraphs So I did a search here for \"Istanbul history.\" You can see that Wikipedia is not just ranking number one, they're also ranking number zero. So they have this nice featured snippet. It's got a photo or an image that'll appear on the right-hand side on desktop or on top of the text in mobile, and then the snippet, which essentially tries to give you a brief answer, a quick answer to the question. Now, of course, this query is pretty broad, I probably want to know a lot more about Istanbul's history than the fact that it was a human settlement for 3,000 years. But if you want just that quick answer, you can get those. There are paragraph answers for all sorts of things. These are about 63% of all the answer boxes are in paragraph format. Lists Lists look like this. So I search for \"strengthen lower back,\" I get, again, that image and then I get — this is from wikiHow, so quality, questionable — but back strengthening exercises. They say, number one, do pelvic tilting. Number two, do hip bridges. Number three, do floor swimming. Number four, do the bird dog exercise. That sounds exciting and painful. This is from an article called \"How to Strengthen Lower Back,\" and it's on wikiHow's URL there. These lists, that are usually in numeric or they can be in bullet point format, so either one can appear, they're about 19% of answers. Tables And then finally, we have ones like this. I searched for \"WordPress hosting comparison.\" These tables show up in a lot of places where you see a comparison or a chart-type of view. In this case, there actually was a visual of an actual graph, and then performance of the best WordPress hosting companies, the name, the account type, the cost per month. This is from wpsitecare.com. Again, this was ranking, I believe, number two or number three and also ranking number zero. So this is sort of great. I can't remember who was ranking number one, but they're ranking ahead of the number one spot, as well, by being in this position zero. Via WPSiteCare in Google's results These are about 16% of answers, so really close on tables and lists. This is via STAT's featured snippet research, which I will link to. It's a great PDF document that you can check out from Rob that I'll point to in the Whiteboard Friday. Also worth checking out is Bill Slawski's post on how Google pulls structured data from websites' tables. In addition to knowing this about featured snippets, that, hey, it's a fairly substantive quantity of things, it can also jump you above the rest of the results, and there are these three different formats, we had a bunch of questions and we keep getting them on, \"How do I get in there?\" I actually have some great answers for you. So not only has Rob and his team been doing some research, but we've done some research and some testing work here at Moz, and Dr. Pete has done a bunch. So I do have some suggestions, some recommendations for you if you're going to try and get into these featured snippets. Best practices to appear in the answer box/featured snippet 1. Identify queries in KW research that, implicitly or explicitly, ask a question. You actually need to do your keyword research and identify those queries that implicitly or explicitly are asking a question. The question needs to be slightly broader than what Google can deliver directly out of Knowledge Graph. So for example, if you were to ask, \"How old is Istanbul,\" they might say \"3,000 years old.\" They might not even give any citation at all to Wikipedia or any other website. If I were to ask, \"How old is Rand Fishkin,\" they might put in 37, and they might give absolutely no citation, no link at all, no credit to any page of mine on the web. Again, very frustrating. So these are essentially queries that we're looking for in our keyword research that are slightly broader than a single line or single piece of knowledge, but they do demand a question that it's being answered. You can find those in your keyword research pretty easily. If you go into Keyword Explorer, for example, and you use the suggestions filter for our questions, virtually all of those are. But many things, like Istanbul history, it's an implicit question, not an explicit one. So you can get featured snippets for those as well. 2. Seek out queries that already use the answer box. If the competition's doing a poor job, these are often easy to grab. You want to seek out queries that already use the answer box. So again, if you're using a tool like Keyword Explorer or something — I believe STAT does this as well — where they will identify the types of results that are in the query. You're looking for these answer box- or featured snippets-types of results. If they are in there and someone else already owns it, that means you can usually leapfrog them by providing a better-formatted, more accurate, more complete, or higher-ranking answer. So if you're ranking number three or number four and the number two or number one result is producing that answer box and you reformat your content (and I'll talk about how we can do that in a sec), you reformat your content to meet one of these items, the correct one, whichever one is being triggered, you can leapfrog them. You can take that position zero away from your competition and earn it for yourself. It's especially easy when they're doing a poor job. If they've got a weak result in there, and there are a lot of these that are very weak today, you can often take them away. 3. Ranking #1 can help, but isn't required! Google will pull from any first page result. Ranking number one is helpful, but it is not required. Google will pull from any first-page result. In fact, you can test this for yourself. Very frequently, if you do a query that pulls up an answer box and then you take the query string and you add \"&num=100\", or you change your settings in Google Search such that Google shows 50 or 100 results, they are often going to pull from a lower-down result, sometimes in the bottom 30 or 40 results rather than the top 10. So Google is essentially triggering this answer result from anything that appears on page one of the query, which is awesome for all of us because it means that we could be ranking number 6, 7, 8, 9, 10, and still get the answer box if we do other things correctly, like... 4. Format and language are essential! Match the paragraph, or table, and use the logical answer to the query terms in your title/caption/label/section header. Format and language. These are essential. The language means the language used. We need to use the terms and phrases a little more literally than we would with a lot of other types of keyword targeting, because Google really, really seems to like, if I search for \"strengthen lower back,\" they are showing me an article called \"strengthen lower back,\" not \"back strengthening for newbies\" or that kind of thing. They are much more literal in most of these than we've seen them be, thanks to technologies like RankBrain and Hummingbird, with other kinds of queries. We also need to make sure that we're matching the paragraph, the list, or the table format and that we're using a logical answer to those query terms. That answer can be in the title of your web page, but it can also be in the caption of an image, the label of a section, or a section header. In this case, for example, part three of this article was back strengthening exercises. That's where they're pulling from. In this case, they have \"City of Istanbul\" and then they have history and that's the section. In this case, it's the performance chart that's shown right at the top of the web page. But they will pull from inside a document. So as long as you're structured in one section or in the document as a whole correctly, you can get in there. 5. Be accurate. Google tend to favor stronger, more correct responses. You want to be accurate. Google actually does tend to favor more accurate results.I know you might say, \"How do I know I'm being accurate? Some of this information is very subjective.\" It is true. Google tends to look at sources that they trust to look for words and phrases and structured information that matches up many, many times over across many trusted sites, and then they will show results that match what are in those trusted sites more often. So for example, many folks point out, \"What about in political spheres where there might be arguments about which one is correct?\" Google will tend to prefer the more accurate one from a scientific consensus-type of basis or from trusted resources, like an NPR or a Wikipedia or a census.gov or those kinds of things. Not necessarily from those domains, but information that matches what is on those domains. If your census numbers don't match what's on the actual census.gov, Google might start to trust you a little less. 6. Entice the clicks by using Google's maximum snippet length to your advantage. This is less about how to rank there, but more about how to earn traffic from it. If you're ranking in position zero, you might be frustrated that Google is going to take those clicks away from you because the searcher is going to get the answer before they ever need to click on your site, thus you don't earn the traffic. We've seen this a little bit, but, in fact, most of the time when we rank number zero, we see that we get more traffic than just ranking number one by itself. You're essentially getting two, because you rank number zero plus whatever normal or organic position you're in. You can entice the click by using Google's maximum snippet length to your advantage. Meaning, they are not going to put all the different numbered answers in the lists here from wikiHow, they're only going to put the first four or five. Therefore, if you have a list that is six or seven or eight items long, someone has to click to see them all. Same thing with the paragraph. They're only going to use a certain number of characters, and so if you have a paragraph that leads into the next paragraph or that goes long with the character count or the word count, you can again draw that click rather than having Google take that traffic away. With this information at your disposal, you should be armed and ready to take over some of those result number zeros, get some answer boxes, some featured snippets on your side. I look forward to hearing your questions. I would love to hear if you've got some examples of featured snippets, where you're ranking, and we'll see you again next week for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com Track which SERP features drive traffic to your site. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Appear in Google's Answer Boxes"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Appear in Google's Answer Boxes"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Paragraphs"
    },
    {
      "level": "H2",
      "text": "Lists"
    },
    {
      "level": "H2",
      "text": "Tables"
    },
    {
      "level": "H2",
      "text": "Best practices to appear in the answer box/featured snippet"
    },
    {
      "level": "H3",
      "text": "1. Identify queries in KW research that, implicitly or explicitly, ask a question."
    },
    {
      "level": "H3",
      "text": "2. Seek out queries that already use the answer box. If the competition's doing a poor job, these are often easy to grab."
    },
    {
      "level": "H3",
      "text": "3. Ranking #1 can help, but isn't required! Google will pull from any first page result."
    },
    {
      "level": "H3",
      "text": "4. Format and language are essential! Match the paragraph, or table, and use the logical answer to the query terms in your title/caption/label/section header."
    },
    {
      "level": "H3",
      "text": "5. Be accurate. Google tend to favor stronger, more correct responses."
    },
    {
      "level": "H3",
      "text": "6. Entice the clicks by using Google's maximum snippet length to your advantage."
    },
    {
      "level": "H4",
      "text": "Track which SERP features drive traffic to your site."
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}