{
  "url": "https://moz.com/blog/how-we-fixed-the-internet",
  "slug": "how-we-fixed-the-internet",
  "title": "How We Fixed the Internet (Ok, an Answer Box) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Last year, Google introduced answers boxes scraped from the index. I didn't like one of mine, so I tried to change it. Months later, something finally happened.",
  "content": "How We Fixed the Internet (Ok, an Answer Box) On-page SEO | Advanced SEO By: Dr. Peter J. Meyers March 11, 2015 Table of Contents Copied! By: Dr. Peter J. Meyers March 11, 2015 How We Fixed the Internet (Ok, an Answer Box) On-page SEO | Advanced SEO Last year, Google expanded the Knowledge Graph to use data extracted (*cough* scraped) from the index to create answer boxes. Back in October, I wrote about a failed experiment. One of my posts, an odd dive into Google's revenue, was being answer-fied for the query \"How much does Google make?\": Objectively speaking, even I could concede that this wasn't a very good answer in 2014. I posted it on Twitter, and David Iwanow asked the inevitable question: Enthusiasm may have gotten the best of us, a few more people got involved (like my former Moz colleague Ruth Burr Reedy), and suddenly we were going to fix this once and for all: There Was Just One Problem I updated the post, carefully rewriting the first paragraph to reflect the new reality of Google's revenue. I did my best to make the change user-friendly, adding valuable information but not disrupting the original post. I did, however, completely replace the old text that Google was scraping. Within less than a day, Google had re-cached the content, and I just had to wait to see the new answer box. So, I waited, and waited… and waited. Two months later, still no change. Some days, the SERP showed no answer box at all (although I've since found these answer boxes are very dynamic), and I was starting to wonder if it was all a mistake.Then, Something Happened Last week, months after I had given up, I went to double-check this query for entirely different reasons, and I saw the following: Google had finally updated the answer box with the new text, and they had even pulled an image from the post. It was a strange choice of images, but in fairness, it was a strange post. Interestingly, Google also added the publication date of the post, perhaps recognizing that outdated answers aren't always useful. Unfortunately, this doesn't reflect the timing of the new content, but that's understandable – Google doesn't have easy access to that data. It's interesting to note that sometimes Google shows the image, and sometimes they don't. This seems to be independent of whether the SERP is personalized or incognito. Here's a capture of the image-free version, along with the #1 organic ranking: You'll notice that the #1 result is also my Moz post, and that result has an expanded meta description. So, the same URL is essentially double-dipping this SERP. This isn't always the case – answers can be extracted from URLs that appear lower on page 1 (although almost always page 1, in my experience). Anecdotally, it's also not always the case that these organic result ends up getting an expanded meta description. However, it definitely seems that some of the quality signals driving organic ranking and expanded meta descriptions are also helping Google determine whether a query deserves a direct answer. Put simply, it's not an accident that this post was chosen to answer this question.What Does This Mean for You? Let's start with the obvious – Yes, the v2 answer boxes (driven by the index, not Freebase/WikiData) can be updated. However, the update cycle is independent of the index's refresh cycle. In other words, just because a post is re-cached, it doesn't mean the answer box will update. Presumably, Google is creating a second Knowledge Graph, based on the index, and this data is only periodically updated. It's also entirely possible that updating could cause you to lose an answer box, if the new data weren't a strong match to the question or the quality of the content came into question. Here's an interesting question – on a query where a competitor has an answer box, could you change your own content enough to either replace them or knock out the answer box altogether? We are currently testing this question, but it may be a few more months before we have any answers. Another question is what triggers this style of answer box in the first place? Eric Enge has an in-depth look at 850,000 queries that's well worth your time, and in many cases Google is still triggering on obvious questions (\"how\", \"what\", \"where\", etc.). Nouns that could be interpreted as ambiguous also can trigger the new answer boxes. For example, a search for \"ruby\" is interpreted by Google as roughly meaning \"What is Ruby?\": This answer box also triggers \"Related topics\" that use content pulled from other sites but drive users to more Google searches. The small, gray links are the source sites. The much more visible, blue links are more Google searches. Note that these also have to be questions (explicit or implied) that Google can't answer with their curated Knowledge Graph (based on sources like Freebase and WikiData). So, for example, the question \"When is Mother's Day?\" triggers an older-style answer: Sites offering this data aren't going to have a chance to get attribution, because Google essentially already owns the answer to this question as part of their core Knowledge Graph.Do You Want to Be An Answer? This is where things get tricky. At this point, we have no clear data on how these answer boxes impact CTR, and it's likely that the impact depends a great deal on the context. I think we're facing a certain degree of inevitability – if Google is going to list an answer, better it's your answer then someone else's, IMO. On the other hand, what if that answer is so complete that it renders your URL irrelevant? Consider, for example, the SERP for \"how to make grilled cheese\": Sorry, Food Network, but making a grilled cheese sandwich isn't really that hard, and this answer box doesn't leave much to the imagination. As these answers get more and more thorough, expect CTRs to fall. For now, I'd argue that it's better to have your link in the box than someone else's, but that's cold comfort in many cases. These new answer boxes represent what I feel is a dramatic shift in the relationship between Google and webmasters, and they may be tipping the balance. For now, we can't do much but wait, see, and experiment. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How We Fixed the Internet (Ok, an Answer Box)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How We Fixed the Internet (Ok, an Answer Box)"
    },
    {
      "level": "H2",
      "text": "There Was Just One Problem"
    },
    {
      "level": "H2",
      "text": "Then, Something Happened"
    },
    {
      "level": "H2",
      "text": "What Does This Mean for You?"
    },
    {
      "level": "H2",
      "text": "Do You Want to Be An Answer?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}