{
  "url": "https://moz.com/blog/how-to-cook-up-a-social-media-automation-dish-using-one-simple-ifttt-recipe",
  "slug": "how-to-cook-up-a-social-media-automation-dish-using-one-simple-ifttt-recipe",
  "title": "How To Cook Up A Social Media Automation Dish Using One Simple IFTTT Recipe - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I started to look around for a quick and easy way how I could use IFTTT so that after I published a new post on my blog IFTTT would automatically with the click of a button share this blog post on my Twitter, Facebook, Google+ AND LinkedIn page. Here is how you cook up a completely automated social…",
  "content": "How To Cook Up A Social Media Automation Dish Using One Simple IFTTT Recipe SEO Tools By: Matt Ahlgren November 8, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Matt Ahlgren November 8, 2013 How To Cook Up A Social Media Automation Dish Using One Simple IFTTT Recipe SEO Tools This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I am sure you all have heard of IFTTT (If This Then That) and I won't go into too much detail. IFTTT has been called a \"digital duct tape\" as it lets you create powerful and automated connections, or \"recipes\" as they call it, between different services using \"if-this-then-that\" based statements. I started to look around for a quick and easy way how I could use IFTTT so that after I published a new post on my blog IFTTT would automatically with the click of a button share this blog post on my Twitter, Facebook, Google+ AND LinkedIn page. Here is how you cook up a completely automated social network sharing dish using a simple to use IFTTT recipe. You might want to customize this recipe a bit, for example you might want to automate the sharing on your social networks minus your Twitter account where you might want to create a manual and custom update about your latest blog posts. Cooking Instructions: Difficulty: Easy Preparation time: 15 minutes Cooking time: Almost instant Serves: 5 social networks (Twitter, Facebook, LinkedIn, Google+ & App.net) Ingredients you need: Buffer account [Free]. IFTTT account [Free]. Gmail address [Free]. 1. Go and create a free account over at Buffer, verify your account and setup and connect your social networks. The following social networking sites are currently available on their free account plan: Twitter Facebook LinkedIn Google+ App.net Make sure that the social network you want to have automatically updated are set to update by default (i.e. there should be tick next to each one in the dashboard). If you have set up Buffer correctly, it should look something like this. Tip: Buffer’s default setting is to shorten shared links using buff.ly and to add UTM tracking parameters on shared links. To disable these simply go to link shortening under settings and un-check these options. 2. Next step is to create a free account over at IFTTT. Verify your account and when that is done go to your IFTTT channels and activate the Gmail and Feed channels. 3. The next step is to create a new IFTTT recipe. This is where the serious cooking preparation begins. 4. For the \"if this\" part of the recipe you select the Feed as the trigger channel, and choose the New Feed Item as the trigger. Then, enter in your blog RSS feed. (If you have a WordPress blog you add /feed/ to the end of your blog’s URL, for Tumblr you add /rss and for Blogger you add /feeds/posts/default to the end of your blog’s URL.) Tip: On WordPress you can also provide feeds to only specific categories. 5. Next, you click the Create Trigger button. That completes the \"if this\" part of the recipe. 6. For the \"then that\" part of the recipe, select the Gmail as the action channel, and choose the Send an email as the action. This is important! For the To Address you have to use your secret Buffer email address. Copy it and paste it in as the to: address. For the Subject use: {{EntryTitle}} - NEW on the Blog! - NEW on the Blog! is totally up to you to change, it can say whatever you want, or it can go before {{EntryTitle}} for example: New blog post - {{EntryTitle}} and for the Body use: {{EntryUrl}}<br> @now The <br> tag creates a new line break in the email, and @now tells Buffer to share the updates straight away. 7. Click the Create Action button, you will be asked to give your IFTTT recipe a description, and click the Create Recipe button. There you have it. Whenever you publish a new blog post it will appear in your RSS feed, this is the trigger for IFTTT to via Gmail alert Buffer and Buffer will automagically share your blog post across your social media networks. Bonus Cooking: With your newly accomplished IFTTT skills you can easily setup the below recipes to automatically add your blog post as a bookmark on Diigo and Delicious. How do you use IFTTT? I would love to hear about your favorite IFTTT recipe or recipes, feel free to share them in the comments below. Happy cooking! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How To Cook Up A Social Media Automation Dish Using One Simple IFTTT Recipe"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How To Cook Up A Social Media Automation Dish Using One Simple IFTTT Recipe"
    },
    {
      "level": "H2",
      "text": "Cooking Instructions:"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Matt Ahlgren\n          \n            Matt Ahlgren\n          \n            Matt Ahlgren"
}