{
  "url": "https://moz.com/blog/how-to-leverage-youmoz-for-your-website-brand-problem-fame",
  "slug": "how-to-leverage-youmoz-for-your-website-brand-problem-fame",
  "title": "Making YOUmoz Work for You (and your clients) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "YOUmoz has been a fantastic experiment and one that we're really proud of. The community at YOUmoz is knowledgeable, dedicated and committed. We couldn't ask for more. With the growth of the UGC portal and an ever-increasing amount of traffic from search and referring links pointing to YOUmoz…",
  "content": "Making YOUmoz Work for You (and your clients) Moz News By: Rand Fishkin July 8, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 8, 2007 Making YOUmoz Work for You (and your clients) Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. YOUmoz has been a fantastic experiment and one that we're really proud of. The community at YOUmoz is knowledgeable, dedicated and comment-happy (a terrific trait). We couldn't ask for more. With the growth of the UGC portal and an ever-increasing amount of traffic from search and referring links pointing to YOUmoz content, we thought we'd better illustrate how you can best leverage YOUmoz for a variety of results. Driving Visitors to Your Blog/Site Possibly the most valuable (or, at least, oft-utilized) part about YOUmoz is its ability to entice SEOmoz readers over to your site. If you write something great, or, better yet, 3-4 great posts, you'll find that readers will be hungry for more. Great content demands attention and the readers here at SEOmoz are some of the most participatory on the web - if you write a few great posts, they're very likely to come to your blog and subscribe, knowing that your content is especially worthwhile. BTW - So will the mozzers; and, when we love a blog, we often link over to it in our posts (particularly the roundups) :) Building Your Personal Brand in the SEO World Through contributions at SEOmoz and YOUmoz, several names in the search world have become more visible. You can follow in this path - contributing great posts that can help to make your name or your company's brand more visible to marketers, technologists & the rest of the wide audience here on SEOmoz. Soliciting Input from Fellow Search Marketers As I've done in the past and many folks have done at YOUmoz, you can leverage the ability to contribute posts as a way to request the input of the highly participatory community on the site. If you're confused about how to best tackle a specific issue, need assistance in identifying good resources on a subject or simply want a broad group discussion around an important topic, SEO/YOUmoz is a superb resource. The quality of input here often exceeds major search forums, though I still think there's excellent advice to be had in this arena at Cre8asite forums as well. Exposing Flaws or Faults in Major Websites Not surprisingly, with SEOmoz garnering a wide swath of readership in the webdev and web marketing world, a post here can influence or, at the least, attract the attention of folks who actually work on the product/site/service you're concerned about. I'm always shocked when I do a post on something from companies like Wufoo, Reddit or NY Magazine and then get an actual response from someone who works there (usually through email). Linkbaiting/Viral Marketing Since SEOmoz posts, like those at other well-read blogs, are paid attention to by so many influencers (bloggers, journalists, site owners, social media enthusiasts), a post on an exciting new project, site, feature, news item, etc. can help to drive serious link love to that source. While YOUmoz currently has nofollow on outbound links (to discourage posting for link purposes only), we'll be removing those nofollows if the blog post makes it to the SEOmoz blog (currently a task Rebecca handles). Thus, even if you're getting buried at Digg, SEOmoz can give you the ability to help market to a desirable audience. Obviously, since Rebecca's hand-editing the submissions, we won't allow wholesale shilling, but we're also not nearly as anti-marketing as a place like Digg. Making Your Profile at SEOmoz More Valuable Profiles at SEOmoz appear to be used for everything from link love (remember that if you earn 100 mozpoints, we remove the nofollow from your profile page) to reputation management - user pages appear to rank very well at both Google & Yahoo! And, if you're itching to get onto the top 50 list, YOUmoz posts earn between 6-30 thumbs. Attracting the Attention of the Engines It's true - SEOmoz is read by lots of folks at the search engines. Now, of course, this certainly has its drawbacks, as YOUmoz & SEOmoz are probably not great places for discussing the latest exploits available to black & gray hats. It also restricts me from publicly discussing the best text link brokers or less-than-pure-white link building services. However, it does afford folks like yourself the ability to expose major issues to the engineers and analysts at Google, Yahoo!, Microsoft & Ask. I'm not just talking about Matt Cutts, whom I'm personally shocked has time to read the blog (certainly flattered though) or Susan Moskwa (Hi, Susan!). At nearly every conference I attend, I'll find folks who work at search engines that have SEOmoz in their feedreader. Just a warning, though, don't title your posts \"Hey Tim Mayer, why don't you answer my emails?\" That's probably not going to get posted (unless Matt Cutts is the author) :) Hopefully, these strategies will help to make your YOUmoz optimization a little easier. And (thanks to a suggestion from the crew) as an added refresher/bonus, I'll walk you through how to make a YOUmoz post (because every Sunday post needs a cartoon, right?): STEP 1: Decide on a Topic Your topical focus will have a lot to do with your personal needs - do you want to share a great new technique for optimization, social media participation, analytics, landing page design or writing better ad copy? Maybe you're interested in sharing your latest website launch and getting critical feedback from the community - you can show off what you've built, so long as you're creating value for the readers by also sharing how you did it and how you expect to successfully market it. You might even want to share some news that no one's discovered, or an angle that few are discussing. The sky's the limit on blog content, so long as it's useful to the SEOmoz audience. Imagine yourself reading your post - if you can picture yourself smiling, shaking and nodding your head and thinking \"Wow. This is great stuff,\" the post is probably a hit. FYI - You'll find a place to author posts on your sidebar once you're logged in, like this: STEP 2: Create Graphics SEOmoz doesn't currently support uploading your graphics or images to our server directly (too much risk of malicious behavior), so you can use free image hosting services, Flickr, or your own site to hold graphics. I highly recommend graphics because they make a post so much more interesting to read. Even a screenshot of a website, a search query or an analytics graph can make a huge difference. My typical process is simply taking a screenshot (on 99% of Windows boxes this is done by holding alt+print screen), pasting it into Photoshop, and cutting or reducing to size - Photoshop's image reduction usually produces fairly clean, readable images. The maximum pixel width on SEOmoz is 500 pixels, so keep that in mind as you're producing graphics. STEP 3: Create a Title & Select a Category As with any social media site, blog or newspaper headline, the title is going to influence the number of readers who are drawn to your post. Since so many SEOmoz readers use feeds or the tracker (SEOmoz & YOUmoz each have their own) to choose what to read, you're best off writing a title that captures attention and accurately describes the contents. And yes, on occassion, Rebecca will re-write a title if she thinks yours is just awful. We'll also re-clasify posts if we feel you're not submitting to the appropriate category, so don't worry too much about which one to choose. STEP 4: Write Your Post Writing quality is everything - if you can engage your readers effectively and create that head-nodding, gotta-share-this-with-my-buddies feeling, your post will produce exceptional returns. Watch the master - Brian Clark - at work to see how it's done. STEP 5: Submit to YOUmoz The submission process is simple - just enter your text (you can use the WYSIWYG editor or submit in HTML) and hit submit. You can even save your posts as drafts and come back to them later. If you are authoring your post inside YOUmoz, I recommend frequently hitting \"save\" so as not to risk losing your precious work. STEP 6: SEOmoz Reviews In somewhere between 1-30 hours, Rebecca or myself will read and approve or reject your post. We do get quite a bit of spam at times, and we're also commonly rejecting very poorly written entries (apologies to some of our ESL submitters - we appreciate your work, but it's very tough for our audience to comprehend the writing style at times). If we like the post, we send it over to YOUmoz - it's only if we absolutely love it to death that it goes straight to the main blog. After a day or two in YOUmoz, if your entry gets lots of great thumbs, comments and attention, we'll promote it to the main blog. Don't be discouraged if you don't make the main blog, though, we have very high standards, as you can see from the ratio of promoted to non-promoted (about 1/25) and YOUmoz itself is a valuable marketing and information tool. That's All! Just like any other UGC or social website, SEO/YOUmoz provides value largely in relation to the effort you put into it. A lousy post that you threw together in 10 minutes that looks more like a question you'd ask at a forum won't provide much value (and is likely to be tossed in Rebecca's trash bin). However, top notch posts that make it to the blog and attract links, readership, comments and attention to your site/issue/discovery can have remarkable effects. Of course, if you have any suggestion or questions about YOUmoz, feel free to ask them in the comments below. If it relates to your particular submission, you can feel free to email Rebecca, too. UPDATE: Matt's made a quick change to YOUmoz and now all posts authored by members who have more than 100 mozpoints total will not include \"nofollow\" on outbound links, just like profile page links. If you've ever wanted some link juice from SEOmoz, now's your chance to earn it :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Making YOUmoz Work for You (and your clients)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Making YOUmoz Work for You (and your clients)"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}