{
  "url": "https://moz.com/blog/how-to-outsource-content-thats-worth-reading",
  "slug": "how-to-outsource-content-thats-worth-reading",
  "title": "How to Outsource Content (That's Worth Reading!) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Pretty much every SEO guide says that quality content is a key component to success. That’s great, but if your writing skills are a little bit lacking, that usually means getting someone else on board.\n\nHiring freelancers has been covered a fair bit on this site, but not too much has been said…",
  "content": "How to Outsource Content (That&#39;s Worth Reading!) Content Marketing S By: Sam Wright September 20, 2011 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! S By: Sam Wright September 20, 2011 How to Outsource Content (That&#39;s Worth Reading!) Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Pretty much every SEO guide says that quality content is a key component to success. That’s great, but if your writing skills are a little bit lacking, that usually means getting someone else on board. Hiring freelancers has been covered a fair bit on this site, but not too much has been said about how to get the best out of those who deal with copy. This post should hopefully provide some helpful tips, as well as some resources to get you started. There's never too much information When I first started out I got a job writing for a well-known business magazine. One of my earliest features was on a company that manufactured boxes. I didn't care too much at the time – I was just happy to be getting paid to write, no matter how dull the subject. However, the person I was due to interview pulled out at the last minute, leaving a two-page gap in the issue. This wouldn't normally matter but several adverts had been sold on the back of the feature, meaning that if it was scrapped then thousands of pounds would have been lost. So I went ahead and wrote it anyway. All the information I had to go on was an out-of-date website. No media pack, press releases, interviews with other publications – nothing. Needless to say, my feature was terrible. No matter how hard I tried to make it interesting, there were no details or facts to back it up. The next day, I interviewed the head of a different firm. We spent ten minutes on the phone, I got a few great quotes and wrote up a piece in half the time the last piece had taken. It was bumped up to lead feature and I got a pat on the back. The thing to learn from this is that the more information you can give your writers, the better the copy they'll produce. If they are putting together content for a new homepage, a few minutes on the phone and a few links to competitors will make all the difference. If you're commissioning an article, explaining why, who it's for and what you hope to achieve with it means that everybody is on the same page right from the beginning. Writing the brief One advantage of hiring content creators as an SEO is that the brief often writes itself. You've already done a lot of the heavy lifting in terms of keyword research so you know pretty much what to expect. The template I use can be downloaded here to give you an idea of what else to include. If your writer is new to SEO, get them to read through SEOmoz's Perfectly Optimised Page. It's as good a starting point as any. Until relatively recently, I was sceptical about hiring writers with no SEO experience, but as long as you give specific instructions in your brief on where you want the keyword to appear, there should be no problems. If you have a house style guide, send it over as well. This outlines any specific rules for terminology and grammar for your site, such as whether to use $, US$ or 'dollars' and 'houmous' or 'hummus'. These might seem like small things, but consistency makes all the difference to how professional and readable your content is. The Guardian newspaper may be known as 'The Grauniad' due to frequent typos, but its style guide is still regarded as one of the best. Where to find your writers Freelance sites The world is full of great writers who&'d love a chance to prove themselves. Upwork and People Per Hour are all well-known freelance sites, but there's definitely a few things to watch out for. Don't accept the cheapest bid whatever you do. As a rule of thumb, 3-400 words of well-researched, detailed copy takes me about an hour. There are lots of people on there willing to write 500 words for $2-3. Trust me, they won't be any good. Even if they're from India or another outsourcing hotspot, the volume of words they'll need to produce to make a decent wage will compromise quality every time. Poor communication can also be an issue. Only choose bids that address the points you make in full. If in doubt, arrange a phone or Skype call so you can speak to them in person. Once you've got your content, don't be afraid to ask for revisions. Keep them clear and reasonable though – no one wants to be asked to make their copy 'more sparkly' (true story) or to write an extra 500 words free of charge. Students Another great option is Studentgems. This is UK-based, but jobs can be placed by anyone worldwide. I have a real soft spot for this site, mainly as I got my first copywriting gig through it after I graduated. It can be a little more expensive than Upwork et al, and good communication is even more important as this may be their first professional job, but I've always found the people I've hired are enthusiastic, talented and desperate for feedback. In a similar vein, it can sometimes work to contact universities or colleges direct. I studied on the University of East Anglia’s creative writing course, and I often hire recent graduates for various projects. Goldsmiths and Manchester are well thought of too. It's hard for students to break into the creative industries. Sure, they might need a bit more nurturing than a typical freelancer, but they're a fraction of the price and desperate to impress. If you do go down this route, set any deadline well before your own so you can find an alternative in case things go wrong. It's not happened to me yet, but I'm always willing to err on the side of caution. Industry experts This is a little more hard work but the results can be fantastic. Finding an expert in the field you're looking to write about is pretty straightforward – a Google search is usually enough. However, these people are usually time poor, so writing content for you at a rate well below what they usually earn is pretty much a non-starter. Instead, you can get them to endorse your copy. For example, a GP may be willing to check a healthcare article is factually correct, and let his name be used. If you pay £20-30 for what may take him 15 minutes, it'll be worth his while. The content may have been written for you by another freelancer, who can then make any revisions. Obviously, this approach isn't ideal for everyday link building due to the cost. But what it can do is get your copy – and link – on to authoritative sites that wouldn't normally be interested, such as high circulation magazines or blogs. Research, as ever, is key before you make the decision. Blink SEO is a leading web content and SEO agency based in Norfolk, UK. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Outsource Content (That&#39;s Worth Reading!)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Outsource Content (That&#39;s Worth Reading!)"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sam Wright\n          \n            Sam Wright"
}