{
  "url": "https://moz.com/blog/how-to-get-more-comments-on-your-articles",
  "slug": "how-to-get-more-comments-on-your-articles",
  "title": "How To Get More Comments On Your Articles - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Content from users can provide real value. This post will arm you with tips to help increase your user comments by more than simply \"having a call to action\" or \"writing compelling content.\"",
  "content": "How To Get More Comments On Your Articles Blogging By: Jacob Klein September 4, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jacob Klein September 4, 2012 How To Get More Comments On Your Articles Blogging The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. If you've spent any amount of time reading up on content creation, you've most likely seen a post or two with a similar title to this one. In my experience, these articles are typically littered with buzz-phrases such as \"have a call to action\" or \"write compelling content\" and consist of 30+ overlapping ways to do either of those things. While asking your readers to comment and creating comment-worthy content are certainly important concepts to understand, I'm going to assume you're already on-board and looking for something a bit more actionable. Why are comments important? The benefits of user generated content are obvious to most. Not only are you generating additional unique, (hopefully) on-topic content for your pages, comments may even contribute to your article's freshness score. While it's debatable whether the number of comments on a page is directly correlated with higher rankings, we all understand the value of having more fresh, relevant content on a page to say nothing of user engagement and community building. No matter how in-depth your keyword research is, you'll never be able to naturally incorporate every iteration of a key phrase onto your landing page - and you wouldn't want to anyhow. With user generated comments, you're able to get some of those alternate queries (long-tail or otherwise) without having to shoehorn them into your on-page copy. Let me give you an example of this in action: The highlighted text isn't actual copy from the page itself. It's from one of the comments towards the bottom of the page. Google has determined that this page is relevant to the query in part because of a comment that includes text that the webmaster hadn't even thought to include on the page. Would the page have ranked without the comment? Possibly. But to me, an example like this shows that Google clearly uses comments to help determine page relevance. In a competitive space where most competing pages look startlingly similar, you're going to need any edge you can get. I'm sure you've all had the experience of landing on an article after searching for something only to \"ctrl + F\" your way to the comments section to find your answer. Content from users can provide real value, and this article will arm you with tips to help increase your user comments. Actionables Okay, so maybe you didn't need much convincing as to the importance of user generated content. You're here because you want to read something you haven't read before about getting users to comment on your posts. Over the last 10 years, I've founded several fan community pages covering such nerd-tastic staples as Magic the Gathering, Nintendo, and Game of Thrones (yes, ladies, I am that cool). While building these communities, I've picked up a few tricks for attracting article comments that I thought I'd share with the Moz community. 1. Make it as easy as possible to leave a comment Does \"website\" really need to be a required field? Are your CAPTCHA images harder to solve than a Rubik's cube? Sometimes the effort it would take to comment on your blog outweighs the potential user benefits. Take a look at each field and ask yourself \"is this a hoop I'd be willing to jump through to leave a comment on a blog I've never visited before?\" Most users are wary about giving out an email address, so assure them that their data won't be used for anything other than unique identification or just let them login using Twitter of Facebook (more on that below). In the end, you should be mostly concerned with their username, email address (to distinguish their comments from others, gravatars etc), and the comment itself. Anything else is a barrier to entry that should be scrutinized and broken down wherever possible. 2. Comment placement So many widgets, so little real estate. If I didn't know any better, I'd think that the end of a blog post is the hottest piece of property on the net these days. After you've pumped your full author bio, social buttons, \"other articles you might like,\" opinion disclaimer, and multiple ad units, the comment section often ends up an entire page screen below the actual content. I know, I know, it's tough to demote any of these widgets because of course ad placement is important; of course, \"related content\" and extra pageviews are important, but if you're truly serious about getting the conversation going on your article, then you should consider giving the comment section a more prominent position on the page. At the very least, give users an anchor jump at the end of the article that reads \"Leave a Comment\" or \"Join the Conversation\" and bumps them down to the appropriate level. 3. Social logins If for whatever reason you simply must require users register for commenting (a rather large barrier to entry) consider allowing them to log in using the social media accounts they're already using. If you're running Wordpress, this can be done by installing one or two plugins of your choice. Simple Facebook Connect will get the job done and the Twitter version will do the same. If you're looking for a more comprehensive solution (all social networks), try Social Login. Social logins on custom CMS' obviously vary and can be achieved using OAuth and following the developer instructions from Facebook and Twitter. There's also the all inclusive Disqus comment system that you've probably already seen in use on many blogs. Not only does this offer users a 1-click login option for commenting and other community activities around your site; this option also gives your users an automatic avatar and social identity. Comments coming from a person with a traceable identity are almost surely of higher quality than those coming from completely anonymous users. And hey, once they're logged in with Twitter or Facebook, it stands to reason that the chances of someone sharing your page on one of those networks increases considerably. 4. Profiles, Awards, and Rankings You've probably used (or been used by) a piece of ego bait in a link building campaign and the same principles of human nature apply to community building. In-depth profiles, award systems, and commenter rankings are great ways to encourage your contributors to keep coming back for more. A simple database comment count for each individual is all that is required for deployment. Attach fun titles such as \"Youngling,\" \"Aspirant,\" or \"Padawan\" to these values and you'll not only please current commenters, but you'll also give readers a way to gauge that person's standing within the community. Grab the Top Contributors plugin for Wordpress and show your top commenters some love. You could also display \"X-Year Club\" awards on user profiles or a \"She's Over 9000aaaand!\" badge for your most ambitious contributors. Anything you can do to give your loyal commenters a feeling of community and importance will encourage more comments. 5. Join the conversation This one's a no-brainer. Respond to comments on your articles. You took the time to write the piece, so get in there and stand by it! Keep the conversation rolling with questions of your own and address things you may have glossed over in your initial publishing. Try highlighting author comments so that they stand out a bit. This immediately communicates to readers that the author is paying attention and will most likely respond to their comment if they take the time to write one. The reality is that articles with comments get more comments. Articles without comments have trouble getting initial comments. The difference between 0 comments and a handful can mean everything. Who wants to be the first person to comment on a post? Each new user post offers an entry point for new lines of discussion. Help get the chain reaction going by helping the initial conversation to get started. 6. Email notification on reply With great power comes great responsibility. If a loyal reader has given you their email address and contributes to your site on a regular basis, the last thing you want to do is lose their trust. You've got their email address but no one wants a \"quarterly site update\" or \"Jan 1st Happy Birthday\" email from every website they've ever commented on, right? But what most people would probably be okay with is a notification that their thoughtful comment has just received an equally thoughtful reply thus giving them the chance to respond. Try Comment Reply Notification for Wordpress if you're looking to add this feature to your blog. You can choose to alert everyone on the thread whenever anyone replies or limit it to personal replies. You could also allow users to choose for themselves with a simple checkbox as they reply. Disqus also offers this feature. 7. Tracking your progress For many blogs it will be obvious when the influx of new commenters come in, but on larger sites it might be more difficult to track your progress. One simple and universal way to track your progress is to set up a Google Analytics goal associated with a new comment. Here are some instructions on how to do this. You can also easily set up GA event tracking any number of ways using the Raven GA config tool. Have you found other effective methods of attracting commenters? Try some of the above and leave a comment below! Oh, and don't forget to \"create compelling content\" and \"have a call to action.\" Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How To Get More Comments On Your Articles"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How To Get More Comments On Your Articles"
    },
    {
      "level": "H2",
      "text": "Why are comments important?"
    },
    {
      "level": "H2",
      "text": "Actionables"
    },
    {
      "level": "H3",
      "text": "1. Make it as easy as possible to leave a comment"
    },
    {
      "level": "H3",
      "text": "2. Comment placement"
    },
    {
      "level": "H3",
      "text": "3. Social logins"
    },
    {
      "level": "H3",
      "text": "4. Profiles, Awards, and Rankings"
    },
    {
      "level": "H3",
      "text": "5. Join the conversation"
    },
    {
      "level": "H3",
      "text": "6. Email notification on reply"
    },
    {
      "level": "H3",
      "text": "7. Tracking your progress"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jacob Klein\n          \n            Jacob Klein"
}