{
  "url": "https://moz.com/blog/how-pornhub-is-bringing-its-agame-sfw",
  "slug": "how-pornhub-is-bringing-its-agame-sfw",
  "title": "How PornHub Is Bringing its A-Game (SFW) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Despite dealing with a sensitive subject, PornHub is doing a great job marketing itself. This (safe-for-work) post takes a closer look at what they are doing.",
  "content": "How PornHub Is Bringing its A-Game (SFW) Social Media | Branding By: Javier Sanz July 23, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Javier Sanz July 23, 2014 How PornHub Is Bringing its A-Game (SFW) Social Media | Branding The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Editor's note: While the images in this post are free of graphic content, there are many suggestive references to potentially objectionable material. It has come to my attention how PornHub is marketing itself. It is one of the biggest pornographic websites, and I have no idea who is behind their online marketing strategy, but hats off to their team because they're stepping up the porn websites' game to the next level. Let me detail here some of their latest actions and you will understand why I'm so impressed.A bit of context: porn still seen as taboo? 'The Internet has taken porn mainstream' stated Aurora Snow, a retired porn star when EJ Dickson, editor from The Daily Dot asked her about sexting and amateur porn as causes that have contributed to not see porn as a taboo. In her interview, in which the main topic covered is her participation as speaker in a conference at Harvard, she points out how many porn industry A-list names have jumped to commercial and mainstream channels ('James Deen is in a movie with Lindsay Lohan, Sasha Grey is on Entourage'). It's totally OK if you don't know any of these names, but it can give you an idea on how p0rn is now more accepted in our society.Mobile first: unlimited videos... but only for mobile devices Global mobile traffic reached almost 800,000 Terabytes just during last year 2013 and it's estimated to double that figure in the current year, according to the research provided by Statista/Cisco. If that wasn't enough, increase of smartphone ownership went from 35% in 2011 to 56% in May 2013 (source). Even if those figures are not specific to the PornHub's specific business, we could take the latest statements from Hulu's CEO pointing out that despite of starting as a desktop app, 50% of their five million subscribers are running their service only through devices (smartphones, tablets). After many years of selling adult entertainment content through network TV channels, and from there going to home desktops, the porn business knows that nowadays mobile screens are becoming part of our daily routine. And what did PornHub do? Delete any kind of restriction for its mobile users by removing the five videos per day limit still enforceable in their desktop version. What happened then? Take a look to some of the reactions on Twitter. Let's not forget to mention the peak of 15,000 mentions in Twitter (you can see it in Topsy screenshot of the next section). On average they don't go beyond 3,000 - 4,000 mentions per day.PornHub masters Twitter and social media is its playground If there are Twitter accounts for things as weird and eccentric such as one for the Big Ben tweeting what time is it, or accounts that only tweet once per year, why shouldn't a porn site have its own bizarre Twitter account? Would you be more likely to stablish a conversation between an impersonal company account or would you be more likely to talk if you know who is behind the screen? I guess the second answer is your choice, right? Instead of having a team account, PornHub in Twitter is ' PornHub Katie', what is the name of its Community Manager. The same strategy adopted from its related website, YouPorn and Jude, YouPorn Community Manager. By giving a quick look into their timeline you will see that they know how to play the Twitter game, and how friendly the conversation they can engage in. They are not they typical conversations that you would have in a open public space though. Not going to include here some of their latest tweets but you can nose around some of their idiosyncrasy (though not all of their tweets are appropriate for all workplaces). To have deeper insights based on data and not only in my unbiased opinion (I'm more than a follower of their tweets, I'm a devotee!), let's take the first three competitors for the 'adult' category provided by Similar Web. By analysing them through Topsy, we can see that that effectively xVideos and xHamster can't compare with PornHub in terms of Twitter presence. If there is another website that is starting to do great on it, that's YouPorn. But oh surprise, YouPorn belongs to the network of PornHub. Would you retweet a high-level erotic photo? PornHub knows that you are not likely to do that. Instead, they clearly know how virality works and images are their aces up the sleeves. These are some of their latest memes that you can find if you are following them through Twitter. Are they not great? Do you think you could it better? Well, today's your lucky day. Late in 2013 they announced a campaign in order to look for a Creative Director to join them for a year. Their goal? Launch an all-publics national advertising campaign that can be channeled through mainstream media. Nonetheless, it's not always sunny in Pornland. With such initiative any designer, or even non-designers, could blame them for doing a spec-based design contest. Spec what? No other thing but ' any kind of creative work (...) submitted (...) by designers to prospective clients before taking steps to secure both their work and equitable fees', as described in NoSpec.com. In other words, they are using royalty-free content submitted that was created painstakingly by designers around the world. Pas cool. Hijacking trends has also place in its timeline, no matter if it's about the latest Cinco de Mayo festivity, Rihanna news or if it's about the SuperBowl. They are pretty conscious about when a porn website might be more 'needed' in someone's life, and that's the reason they started to offer no video limit on…. Valentine's Day. A community of people openly admitting to like p0rn? Apple has a huge amount of people that spread their love for the products they make. Buffer is engrossing a community of startup transparency thanks to some of their latest initiatives like the open metrics dashboard powered by Baremetrics or their open salaries posts. Ryan and the team at Product Hunt really care about the power of a 'true engaged community', and 'not just acquire additional users'. At the end, it seems 'easy' to grow a community if what you do is good enough. But what happens if your product is porn? What in the beginning seems to be a difficult challenge, growing a porn community in the 21st century is now easier than ever. People are not afraid of showing what they like, even if it's porn. Sexuality is a dish present in everyday TV shows, parents are aware of sexual education to their children, sex is not a topic to avoid any more in many cases. Would you invite your followers to send you nude pics? Would you take a send a nude pic that you know is going to be shared to 300 K porn fans? PornHub jumps right in when it's about talking to the community and make them participants of PornHub history. In case you feel curious, you can head off to Twitter to get some of the most imaginative and sexy responses and replies to these kind of contests. Totally NSFW, everyone. You were warned.Mother nature and porn viewing insights: best allies to get backlinks How does a porn site earns links from 'normal' sites? By 'normal', I mean non-erotic or non-sexually explicit at all websites. On one side, PornHub seems to take the role that OkCupid started a while ago with their blog. OkTrends was a blog collecting all original researches and insights from the dating site by giving shape to the 'hundreds of millions of OkCupid user interactions'. PornHub has named it 'PornHub Insights' and it's delightul if you love data and some erotic references. Extra points: spotted what are two of their favorite tools for visualization: Infogr.am and Tableau And on the other hand, they have partner up with the Mother Nature by promising to donate one tree for every 100 videos viewed in the 'Big Dick' category. Result? 2294. Trees? No, no yet. 2294 referral external backlinks according to the data from MajesticSEO. I tend to think that everyone does things right, but do we really believe they care that much about nature, or it's just a 'gimme some backlinks and promo' kind of thing? I have my doubts, but by taking a look to the backlink profile from PornHub and the previous mentioned competitors, it seems Mother Nature is great for some link-building. In comparison with its competitors xVideos and xHamster, there is no presence in their 20 best performing backlinks of other content different than p0rn. 'Translate me this into other words, Javier'. Well, it's not about the trees is about getting the attention of Cosmopolitan, BetaBeat, Gawker, Huffington Post, Vice, GQ and a long list of mass media audiences.Linkbaiting? Also well covered in PornHub Type 'pornhub + justin bieber' into the search box of your preferred search engine, and check it out. Certainly a SERPs output quite different from similar search queries featuring other famous like 'pornhub + paris hilton' or 'porn hub + kim kardashian' (not going to link them, but you can look up by yourself). ' We are not interested in hosting any Justin Bieber's sex tapes (...) It's nothing against Selena Gomez, we just don't approve of all of Bieber's gross behavior – spitting on fans, driving dangerously and endangering people, and just being a real jerk' were some of PornHub VP's comments when he was asked about what position PornHub if it was offered to buy or license a possible video leak. Respectful approach… or just another marketing strategy? Because they might not be interested in such a great asset for their video collection, but they don't hesitate to target the beliebers, hordes of Justin's fans no doubting on go to your jugular if you address no nice words against their Messiah. By the way, were you impressed with PornHub's performance against its competitors on Twitter? Wait to be speechless when you see the analysis between the 35 million-visits/day-porn-website vs the canadian singer personal account (54 million Twitter foll... Beliebers).PornHub knows its personas and goes for them Great marketers have pointed out the importance of setting up the personas you are trying to target within your marketing strategy. A great piece about understanding who is behind the screens can be found also through this same site, written by Mike. Don't bookmark it, all we know you won't end up reading it, so do it now. ' Research and develop who are my personas will take some of my time', you say. If it's well done, for sure. But have you thought what such a great resource are you going to have? You establish who is your ideal user / visitor / reader, and you create a plan to get his attention. And by 'attention', I mean their clicks, their time to spend on your site, their comments, etc. Let's be precise, their money. Does Machinima mean anything to you? It didn't to me until I watched one of their Youtube videos (kind of NSFW) promoting PornHub. I typed 'pornhub' in Google's famous video platform to check out what other content PornHub was hosting besides their interviews of personalities within their industry. Machinimia's h1 tag describes its business as 'next generation video entertainment network for the gamer lifestyle and beyond'. Their services go from 'monetization of your channel, grow your audience and expand your reach to new platforms'. With most of its partners belonging to the video-game industry, they are able to deliver and work with these impressive figures. 'Ok, now I know a bit more about these video-gamers, but how does it is relate with PornHub?' Glad you are wondering that too. I must be honest, and say that I have been quite reluctant to the vloggers thing - I just prefer written content where you can read or scan what's being said at your own pace - but after seeing that in just two days Machinima had 700,000 views in a video only featuring PornHub's initiative, I might change my opinion about vlogging. After watching the video, and seeing more about what's the kind of audience Machinima is targeting, don't you find so many correlations and similarities with Pornhub's audience? 'Innovation' is also possible in the porn industry A quick analyis of search queries made by their visitors and daily sharing the weirdest ones? They got it. Some 'machine learning' to create a porn search engine that guess what kind of videos you are likely to enjoy? They have it too. Not PornHub main site, but a little brother. I don't know if it can be considered as 'innovation', but as I have pointed out before, posts researching, analyizing about what kind of sexual genres are the most viewed, what are the sexual preferences for certain USA regions and football matches impact their visits figure depending if you team is winning or losing, is certainly something you don' t expect from a porn site. And yep, they are on that too through PornHub Insights. In terms of marketing, promotion, buzzing, if all the porn sites out there would take their business as seriously as the PornHub is doing, marketing friends, we would have such a big pool of opportunities to learn. Because as I read while ago in Jordi's post, 'porn sites are the best places to learn about conversion' and I would add about online marketing too. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How PornHub Is Bringing its A-Game (SFW)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How PornHub Is Bringing its A-Game (SFW)"
    },
    {
      "level": "H2",
      "text": "A bit of context: porn still seen as taboo?"
    },
    {
      "level": "H2",
      "text": "Mobile first: unlimited videos... but only for mobile devices"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "PornHub masters Twitter and social media is its playground"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "A community of people openly admitting to like p0rn?"
    },
    {
      "level": "H2",
      "text": "Mother nature and porn viewing insights: best allies to get backlinks"
    },
    {
      "level": "H2",
      "text": "Linkbaiting? Also well covered in PornHub"
    },
    {
      "level": "H2",
      "text": "PornHub knows its personas and goes for them"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "'Innovation' is also possible in the porn industry"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Javier Sanz\n          \n            Javier Sanz\n          \n            Javier Sanz"
}