{
  "url": "https://moz.com/blog/how-to-break-bad-news-to-your-seo-clients",
  "slug": "how-to-break-bad-news-to-your-seo-clients",
  "title": "How to Break Bad News to Your SEO Clients - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It is an unfortunate, but ultimately unavoidable situation for any independent professional: something went wrong, and now you need to break the bad news to your client. In the SEO world, this can happen for a multitude of reasons. From a situation as simple as you being late with your deliverables…",
  "content": "How to Break Bad News to Your SEO Clients SEO Consulting By: Anthony Mangia October 4, 2011 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Anthony Mangia October 4, 2011 How to Break Bad News to Your SEO Clients SEO Consulting This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. It is an unfortunate, but ultimately unavoidable situation for any independent professional: something went wrong, and now you need to break the bad news to your client. In the SEO world, this can happen for a multitude of reasons. From a situation as simple as you being late with your deliverables due to unforeseen circumstances to much bigger problems, such as loss in rankings because of algorithmic changes, or worse yet, penalization of a client's site, there are dozens of things that can go wrong in any given project or campaign. Breaking bad news to your client is always going to suck, but there are a number of things you can do to minimize the damage, maintain your relationship with your client, and move forwards: Don't go into denial. When you initially find a problem, or are presented with one, be up front about it from the very beginning. Get past the bad news quickly and start working towards a solution. This will minimize the amount of time the problem has to cause damage, and maximize the amount of time you have to start taking action. Be honest and progressive. If you are to work through the problem and salvage your relationship with the client, honesty is going to be important. If the problem was on your end, you're going to need to own up to it, however unpleasant of an experience that may be. If the problem was on the client's end, you're going to need to be honest as well so that they can address the issues internally and ensure that these problems don't continue to happen. Have an explanation for the problem. Don't go into your clients office or pick up the phone empty handed. The first question your client will ask is \"How did this happen?\" Having an explanation helps you figure out what steps to take moving forwards, and what changes you can make to avoid these problems in the future. Have a proposed solution. This is crucial. Soften your bad news with some upside. If you present a problem with no answer and no hope of finding one, it's going to be hard to walk out of the meeting on a positive note. Research the issue in depth. Don't just have an idea of how you can rectify the situation, but have an organized plan of attack that you can present and put into action immediately. Be realistic about the effects of the setback. Don't compound one mistake with another. Is the problem going to affect your workflow? Will you be running behind schedule trying to fix it, and will that affect the rest of your work? Be up front about these issues so you can avoid having to break even more bad news to your client in the near future. These tips will help you confront and resolve your issue, but what about preventing these situations from happening in the first place? Be transparent. The best way to minimize your risk is to be completely open about what you are doing and what the potential effects of your actions could be. Present your client with all of the possible strategic options and the risk involved with each option. At the end of the day, you're going to need to make a recommendation, but if your client is involved in the decision-making process, you share the responsibility with them. Minimize risk. Don't want to have to tell your client that his site got penalized? Don't want to have to explain that because of an algorithm update, the low quality links you've been building got devalued, and they fell off the face of the Earth for their prized keywords? Then avoid inherently risky strategies from the beginning. Build your website according to Google's best practices and build only high quality links, and you'll never need to have these types of conversations with your clients. Manage expectations. The most important thing I've learned in my SEO career is that whether you're working in-house or as a consultant, you're going to need to manage your SEO clients' expectations. Consistently under promise and over deliver, and your clients will always be satisfied. Don't promise #1 rankings. Tell them that first page results would be encouraging, and wow them with #1 results. Got a story about a time you had to break bad news to a client? What was it, how did you deal with it, and how did everything turn out in the end? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Break Bad News to Your SEO Clients"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Break Bad News to Your SEO Clients"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Sins of an Agency: Parting Ways With Our Biggest Client"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "8 Prep Steps for Better Local Business Client Meetings"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Anthony Mangia\n          \n            Anthony Mangia\n          \n            Anthony Mangia"
}