{
  "url": "https://moz.com/blog/how-not-to-judge-keyword-competition",
  "slug": "how-not-to-judge-keyword-competition",
  "title": "How Not to Judge Keyword Competition - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I have been witness to many instances wherein people have judged the competitiveness of a keyphrase by simply searching it in Google, and then checking the total number of search results. For them the total number of results is a measure of the competitiveness of a given keyphrase. I could have…",
  "content": "How Not to Judge Keyword Competition Keyword Research S By: saurav_kneoteric June 11, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! S By: saurav_kneoteric June 11, 2009 How Not to Judge Keyword Competition Keyword Research This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I have been witness to many instances wherein people have judged the competitiveness of a keyphrase by simply searching it in Google, and then checking the total number of search results. For them the total number of results is a measure of the competitiveness of a given keyphrase. I could have understood if they were people who are new to SEO, but I have also seen many SEO practitioners do exactly the same. This post will attempt to clear this misconception. I will be using ‘blue widgets’ as my keyphrase and the number of associated search results as an indicator. This will give everyone a better perspective of what I will be discussing in this post. If you perform a search for blue widgets as your keyphrase, this is what you should be seeing. The total number of search results in the red box is of particular interest because that is exactly where people go wrong. There are 17,100,000 results for our search term and many people would associate this number with the competitiveness of the keyphrase. If we go by the number, blue widgets seem to be a competitive keyphrase – 17,100,000 webpages to beat to get to the top. But if go by the sheer number, you will overlook a very crucial fact that needs to be accounted for and get it horribly wrong. When a search is made, search engines present results in their order of relevance. If you happen to browse through the results, you will notice that after a couple of search result pages the search listings start to lose relevance (unless it is a super competitive keyword). You start to see pages that are nowhere related to the searched term and only rank because they happen to mention one or two words of your searched term. Such pages are not competing to rank for your searched keyphrase but are part of the total results displayed. Therefore, using the total number of search results for a particular keyphrase to gauge its competitiveness is misleading. It is by no means an accurate guide. So what is the right way to do it? Anyone who is seriously targeting a keyphrase would naturally make use of it in the page title of the targeted page and in the webpage content. Also, they are most likely to use the keyphrase in verbatim form at least once. So while examining the competition of a keyphrase, you will need to concentrate on webpages that make use of the keyphrase in either one or all of these places. Based on this understanding, determining the ‘true’ competition of a keyphrase is only a matter of using the correct search operators. Type the keyphrase (the one for which you want to check competition) in Google beginning with speech mark – “blue widgets (in our case). This search query will refine the search results and will display webpages which make use of the keyphrase in verbatim form. It is quite noticeable that the total number of search results drop from 17,100,000 to just 24,000. This can be treated as an approximate indication of competition because there is still some noise left and needs to be filtered. The understanding that any serious attempt to target a keyphrase would begin with adding it in the page title will help us in excluding additional noise pages. All we need to do is ask Google to show webpages which not only contain the word in verbatim form but also appear in the page title. Here is how you do it: allintitle:”blue widgets This search query would effectively eliminate all irrelevant webpages, which until now were a part of your keyphrase competition quotient. You will now have webpages that are up against yours and a true indication of the competition for your targeted keyphrase. For people who like to dig things deeper, they could assess each webpage individually. Should you plan to do so, this is what you need to look for – webpages that make use of the keyphrase at the start of the page title and not in the middle or end. I have no empirical data at hand to prove it but keyword placement in the page title has shown to have an impact on search rankings. Note: You could use keyword research tools to check keyword competition, but the aforementioned steps will help you attach a number to keyword competition. On top of this, you would know for sure the webpages you are up against for each given keyphrase. You will be able to assess competing webpages and formulate a winning strategy based on your analysis. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Not to Judge Keyword Competition"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Not to Judge Keyword Competition"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "saurav_kneoteric\n          \n            saurav_kneoteric"
}