{
  "url": "https://moz.com/blog/how-low-can-number-one-go",
  "slug": "how-low-can-number-one-go",
  "title": "How Low Can #1 Go? (A Ranking Study) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We measured 10,000 Google SERPs to find out where #1 really ends up. It turns out that the top position actually covers a lot of land, and can be impacted not only by ads but many new search features. Post includes a full visualization of the data plus screenshots of the worst-case scenarios.",
  "content": "How Low Can #1 Go? (A Ranking Study) Search Engines By: Dr. Peter J. Meyers February 21, 2013 Table of Contents Copied! By: Dr. Peter J. Meyers February 21, 2013 How Low Can #1 Go? (A Ranking Study) Search Engines In the days of 10 blue links, getting a #1 ranking on Google was the ultimate goal. As advertising becomes more prominent, local and vertical results become more complex, and Knowledge Graph and other rich SERP features become more prevalent, though, a #1 ranking isn’t always what it used to be. We’ve seen a lot of anecdotes over the past year or two, but I thought it was time to ask the question – where, on average, does a #1 Google ranking appear on the page? Visualizing 10,000 #1 Rankings I’ll dig into the methodology in a minute, but let’s cut right to the chase – we measured the vertical (Y) position of the #1 organic ranking across 10,000 keywords during business hours (roughly 10am-5pm ET) on Wednesday, February 12th. The following visualization shows what we found: Embed this image: &lt;div style=&quot;width:604px;&quot;&gt;&lt;div&gt;&lt;a target=&quot;_blank&quot; href=&quot;https://moz.com/blog/how-low-can-number-one-go&quot;&gt;&lt;img width=&quot;600&quot; height=&quot;1037&quot; alt=&quot;How Low Can #1 Go?&quot; src=&quot;https://moz-static.moz.com/youmoz_uploads/1361381874_6a211570aa73fbf1e1ed214f0f39e302.gif&quot; style=&quot;border: #cccccc 1px solid; padding: 1px;&quot; /&gt;&lt;/a&gt;&lt;/div&gt;&lt;div style=&quot;text-align:right; font-size:11px; margin-right: 5px;&quot;&gt;Produced by &lt;a href=&quot;https://moz.com/blog/how-low-can-number-one-go&quot;&gt;SEOmoz&lt;/a&gt;. &amp;copy;2013.&lt;/div&gt;&lt;/div&gt; I’ll spell out a few stats, for the sake of accessibility and because not all of them fit neatly in the visualization: Y=157 – Top position without Google Plus Bar Y=221 – Average position of SERPs with no ads Y=358 – Average position of SERPs with 1 ad Y=375 – Average position across all 10,000 queries Y=482 – Average position of SERPs with 2 ads Y=493 – Average position of SERPs with 3 ads Y=976 – Lowest position in our data set (see below) Vertical position was well correlated with the number of ads that appeared at the top of the page (r=0.80), not surprisingly, but that doesn’t paint the whole picture. Rich SERP features are occupying more and more of the real estate. The Big “Winners” I thought it might be interesting to look at a couple of specific examples, so here are three “winners” – the queries with the lowest vertical positions for the #1 organic spot: 2nd Runner-Up: “Myrtle Beach Weather” (Y=869) Here’s an example of the latest weather forecast widget – add in just one ad, and the #1 organic listing on this page is almost nowhere to be seen. Note: all of these screenshots have been cropped horizontally but are displayed in their actual vertical size. 1st Runner-Up: “Family Portraits” (Y=876) This SERP combines two ads, both with links/extensions, plus a mega-block of images: 2013’s Winner: “Disney Stock” (Y=976) Our winner pushed the #1 organic position down to nearly 1,000 pixels, well below the fold on many screens. This was a perfect storm of ads plus an enhanced stock ticker plus News results: The Basic Methodology I want to briefly explain how the data was collected, for transparency’s sake. The 10,000 keywords were taken from Google AdWords keyword research tools, split evenly across 20 categories. Naturally, these keywords are probably more commercial than the “average” keyword, but they do represent a wide range of volume, competition, query length, etc. We did not count News results or Places blocks (local results that specifically say “Places for…”) as “organic”, but we did count video results (these are integrated now), and blended or “Pack” local results. The problem is that pack results are, at least within the DOM, very difficult to distinguish from organic – Google seems to count some as blended and some as “pure” local. This also gave Google the benefit of the doubt, which seemed only fair. The actual technology was a bit of a Frankenstein’s monster. Queries were crawled from a variety of IPs (and, presumably, data centers) with personalization off, and rendered automatically in a Chrome browser. The #1 organic ranking was detected programmatically and a new DIV ID was injected. This ID’s vertical position was measured via jQuery’s offset() function and was passed via AJAX to the proper database. We spot-checked measurements against screenshots – the approach was crude but effective. How Much Is #1 Worth? To be fair to Google, most of the #1 rankings we measured that were really pushed down were in the bottom 20th percentile. Many #1 rankings still have reasonably good on-screen real-estate. The trick is knowing where your own rankings fall. This is a very dynamic situation, and non-standard SERP features are becoming more common and more diverse. If you only see what your rank tracking tool tells you and celebrate staying in the “top” spot, but the top spot is below 3 ads, a stock ticker, 3 news links, and a Places block, you probably don’t have much to celebrate. This is why it’s critically important to actually look at your SERPs in the wild, and to keep an eye on “downstream” metrics, like your organic traffic. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Low Can #1 Go? (A Ranking Study)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Low Can #1 Go? (A Ranking Study)"
    },
    {
      "level": "H2",
      "text": "Visualizing 10,000 #1 Rankings"
    },
    {
      "level": "H2",
      "text": "The Big “Winners”"
    },
    {
      "level": "H3",
      "text": "2nd Runner-Up: “Myrtle Beach Weather” (Y=869)"
    },
    {
      "level": "H3",
      "text": "1st Runner-Up: “Family Portraits” (Y=876)"
    },
    {
      "level": "H3",
      "text": "2013’s Winner:  “Disney Stock” (Y=976)"
    },
    {
      "level": "H2",
      "text": "The Basic Methodology"
    },
    {
      "level": "H2",
      "text": "How Much Is #1 Worth?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}