{
  "url": "https://moz.com/blog/how-i-would-do-seo-for-rap-genius",
  "slug": "how-i-would-do-seo-for-rap-genius",
  "title": "How I Would Do SEO for Rap Genius - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A step-by-step approach to how Rap Genius can win the 'lyrics' SEO game and get ahead in a saturated market run by old dinosaurs.",
  "content": "How I Would Do SEO for Rap Genius On-page SEO By: Tom Harari December 7, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Tom Harari December 7, 2012 How I Would Do SEO for Rap Genius On-page SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. So You Won’t Confuse It with Just “Rap Music.” If you're into rap/hip-hop like I am and you spend a decent amount of time on the web, you may have heard of Rap Genius by now. If you haven't heard about it though, I highly suggest you check them out. RapGenius.com has quickly become one of my favorite sites to go to, and it can seriously suck up your time with how awesome it is. What is Rap Genius? According to Rap Genius’ About page: Rap Genius is your guide to the meaning of rap lyrics (basically the internet version of the nerd-ass “rap dictionary” dorm-mate you had in college). Image courtesy of Rap Genius About page Basically it’s a lyrics site primarily focused on rap music, but with a catch. Each line of a song is explained and demystified for those of us not familiar with what some rap terminology or references are all about. Even better, all explanations come from their users, who are encouraged to submit explanations and “up-vote” the best explanations by other members, in turn helping them gain RapIQ. Just recently, Rap Genius won the attention of Silicon Valley with a $15 Million investment from Andreesen Horowitz. Pretty exciting times for the boys in Brooklyn. What Does the (Rap) Lyrics Space Look Like Online? For starters, some of the really broad terms that relate to their niche have a good amount of search volume. Rap Genius ranks in top positions for ‘hip hop lyrics’ and ‘rap lyrics’; however, the real traffic potential comes from search terms around song names - the mid- and long-tail opportunities. Rap Genius has been able to go toe-to-toe with some of the big players for mid-tail searches What is Rap Genius Doing Well? Actually, they’re doing a lot of things well. For starters, their Lyrics pages is filled with all types of engaging social features that helps them stand out from all other identical lyrics pages on the web. These ‘Lyrics’ pages provide so much awesome content to their users, which inherently makes them shareworthy and linkworthy. A lyrics page that has 587 Facebook likes, 72 tweets, 7 +1’s, 12 LRD, and a PA of 45?!?! That’s what making your core product link-worthy looks like. Let’s examine a lyrics page a bit: Lyrics which are orange can be clicked to display a popup with annotations and explanations submitted by users. (Users can also upvote/downvote explanations.) Social share buttons up-front that work especially well when the counts are already high. A Spotify player on the right hand side to let you play the song (sometimes a Youtube video is used). Unique original content underneath the player on the right column that gives a brief overview of the song and some of the history around it. On the bottom of the page, there is a comments field where users can suggest a lyric correction or a suggestion. Below the fold on the right column is a “Props” section to all the users who helped explain the lyrics with links to their profiles and their respective RapIQ points. An \"embed\" button which displays a shareable code to help people link to the page. The link that is generated in the \"link to this song\" feature should probably generate links with alternating anchor text though to ensure a more natural looking backlink profile on the page - instead of having their users inadvertently hammering the same anchor text over and over. The link generated could also be tweaked with campaign parameters to gain even more data about referral traffic from the links created through this feature. Rap Genius relies heavily on its user base to comment and annotate lyric lines, so it only makes sense that they would employ Gamification techniques to build and establish their core product. Verified Artists are users who are themselves known rappers and who’ve teamed up with Rap Genius to annotate their own songs. Check out Nas’ profile page: Nas’ page has 27 links and 6 linking root domains. While personally I’d expect more from Nas, I’m not going to hate. Still, the profile pages are another awesome potential source of inbound links and shares. Internal linking is also well addressed throughout the site by having additional songs from the same album on the right side with good anchor text usage; as well as “Hot Songs” in the footer ensuring new content is properly linked to. All good stuff, for sure. So how does their visibility look for the site as a whole? Up and to the right is always a good sign, however, when compared to some of the larger players in the space, it doesn’t look as good: This chart isn’t entirely fair since both metrolyrics.com and azlyrics.com have been around much longer and have lyrics for all genres, not just rap. Still, both of those sites hold the top two positions for many keywords Rap Genius is targeting. Potential Keyword Lift When I pulled all of Rap Genius’ keywords from SEMRush and filtered down to just lyrics pages getting “lyrics” keywords, the average rank according the data was about 5.7. The monthly search volume for all of those keywords SEMRush identified totaled 7,023,266! Using iAcquire’s internal CTR numbers, if Rap Genius were to improve its rankings from the middle of the pack and into the top three positions, they could see well over 1.1 million additional visits from Organic Search monthly. Keep in mind that only takes into account “lyrics” keywords that point to lyrics pages. So how can Rap Genius increase its Domain Authority and Page Authority to compete with AZLyrics and MetroLyrics? Get That Authority I think the guys at Rap Genius understand the importance of linkable content and how that ties into their site’s Domain Authority. In fact, they’ve launched map.rapgenius.com which pinpoints locations made infamous by rap songs on a custom Google Map. This subdomain has over 21,000 total links and 108 linking root domains. Impressive. As time goes on, assuming Rap Genius continues to bring new ideas to the table, their Domain authority will grow. A few ideas which could help speed up the process: Stop the Bleeding I noticed that each lyric explanation provided by a user is stored on a separate URL, i.e. not the actual ‘Lyrics’ page. What’s interesting about this approach, whether intended or not, is that it helps them capture long-tail traffic for some seriously random queries. Ever remember a hot line to a song, but not remember the song name? Search for that line, and you’re bound to find Rap Genius in the #1 position. But it’s not the ‘lyrics’ page that ranks, it’s the ‘explanation’ page which is specifically about that one line. The words to that line are the main focus of the content and are also the first part of the Title tag. Given Rap Genius’ rising Domain Authority, it makes sense that these pages will rank #1 for specific rap line queries ahead of all their competitors, because they hyper-focus the page around that line. This method of placing explanations on their own unique page and then gracefully redirecting users to the specific line on the main ‘Lyrics’ page was in fact set up for ease of development and with user experience as their first priority. I asked Tom Lehman, Rap Genius co-founder while researching for this post: Email conversation included with Tom Lehman’’s permission Agreed. It is pretty sexy from a user experience stand-point. Search a line from a song, click the first result, get taken directly to the section of the song you searched, along with a popup explanation window. (I’m not convinced that everyone searching a line to a song is looking for the explanation to that line, but that’s another issue). My recommendation purely as a growth tactic would be to consolidate link equity for the 'Lyrics' pages by removing internal links to ‘Explanation’ pages, or at the bare minimum adding a nofollow tag to these internal links. Rap Genius may lose some rankings and traffic for random rap line queries in the short term; though I suspect if they were to have those explanations be crawlable and indexable content on the ‘Lyrics’ pages themselves, the ‘Lyrics’ pages could potentially rank just as well. Of course, they’d also be increasing the amount of original content on ‘Lyrics’ pages, adding further value to those pages. They should focus on strengthening the Page Authority of their ‘Lyrics’ page as number one priority to capture the top 1 or 2 positions for lyrics queries. Oh, They’re Making Movies? While Marlo Stanfield’s crew may not appreciate video recordings, Rap Genius’ audience loves engaging with video content One of the bonuses of having actual rap artists sign on to become ‘Verified Artists’ is that they provide video content explaining some of their own lyrics. Many people are accustomed to seeing video snippets in the SERPs when the search query is a song name. But how often do you see a video snippet when the query is a song name and “lyrics”? By placing the video on the ‘Lyrics’ page, they can potentially induce video snippets which would instantly set them apart from some of the dinosaurs in the industry. Imagine a SERP listing for a lyrics search that looked like this: Hypothetical SERP listing for Rap Genius with Video Snippet and Authorship To give their video assets the best chance at receiving video rich snippets, they should opt to use HTML5 players with Flash fallback and make use of video XML sitemaps, while wrapping everything in Schema.org markup. I also highly recommend Phil Nottingham’s advice on video SEO because it’s airtight. Notice how one of the keywords in Phil’s list of likely to induce a video snippet is ‘explanation’? Rap Genius should also start leveraging their ‘Verified Artists’ and a combination of Schema.org markup to get Artist Authorship next to their SERP listings. *See the hypothetical snippet above. Take a look at 50 Cent’s Google+ followers. That’s a lot of potential new audience members, who are probably pretty savvy and would appreciate the type of content Rap Genius brings to the lyrics space. And you thought it was only techies and Googlers on this weird social network by Google. 50 Cent has a verified Google+ account and is pretty ahead of the curve as not many other big names in the rap world are on the network. Yet. Co-Branding for New Audience Penetration Co-branding content syndication is a phenomenal way to reach new audiences who may not be exposed to the brand. Think of it like guest posting on steroids. SoundHound, especially, is a really cool app for identifying songs you hear, similar to Shazzam. Only better. By starting the app while a song is playing, it not only shows you the song information, but also the specific line of the song and it continues to move through the lyrics as the song is progressing. Unreal. Soundhound already lets users listen to the whole song on Rdio or download on iTunes. What if Rap Genius came to a deal with Soundhoud to let users click the individual line as it appears on the bottom and be shown Rap Genius' ‘Explanation’ content? With the content being clearly branded as provided by Rap Genius, imagine what starts to happen to branded traffic in search. A New Yorker Magazine State of Mind Andreesen Horowitz doesn’t just decide to invest in a lyrics company. They saw something special and unique in what Rap Genius set out to accomplish. To quote Mr. Andreesen himself: \"But that's just the start. It turns out that Rap Genius has a much bigger idea and a much broader mission than that. Which is: Generalize out to many other categories of text... annotate the world... be the knowledge about the knowledge... create the Internet Talmud.” For those of you unfamiliar with what the Talmud is, Rap Genius user AbominableHoMan explains it as: “First, there was the Torah. Everyone agreed that the Torah was pretty important, but no one knew (or could agree on) what it meant. Enter the Talmud: 6,000+ pages of lyrical breakdown, in book format. The main sections of the Talmud are the Mishnah, a terse legal code based on the laws in the Torah, and the Gemarah, a massive meta-discussion of the Mishnah!” If lyrical explanations are the Mishnah, then long-form content is the Gemarah. The authors of the Talmud would write pages upon pages debating questions of their time, and so should Rap Genius. Sort of. There’s already an audience interested in deeper, historical, and thoughtful discussion around hip hop: In fact, skimming through Quora can give you an incredible amount of ideas to explore, research, and write about in long-form. And you know people are interested since they are the ones who posted the questions to begin with and are following questions they’d like to hear an answer about. This isn’t going to be as scalable as employing user submitted explanations the way the 'Lyrics' section does currently. It means putting resources into qualified journalists who have the talent and experience to write long-form content, to leverage the ‘Verified Artist’ community, and to write thoughtful opinion pieces that really explore issues relevant to the Rap Genius community. To Sum It Up There’s no doubt that as a scrappy startup Rap Genius blew up by doing things the way a startup should. Now is the time to ride the momentum and take it a step further to kill the game. P.S. Get some more iCon The Mic King song lyrics in your catalog. He’s got a profile page already :] Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How I Would Do SEO for Rap Genius"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How I Would Do SEO for Rap Genius"
    },
    {
      "level": "H2",
      "text": "So You Won’t Confuse It with Just “Rap Music.”"
    },
    {
      "level": "H3",
      "text": "What is Rap Genius?"
    },
    {
      "level": "H3",
      "text": "What Does the (Rap) Lyrics Space Look Like Online?"
    },
    {
      "level": "H3",
      "text": "What is Rap Genius Doing Well?"
    },
    {
      "level": "H3",
      "text": "Potential Keyword Lift"
    },
    {
      "level": "H2",
      "text": "Get That Authority"
    },
    {
      "level": "H3",
      "text": "Stop the Bleeding"
    },
    {
      "level": "H3",
      "text": "Oh, They’re Making Movies?"
    },
    {
      "level": "H2",
      "text": "Co-Branding for New Audience Penetration"
    },
    {
      "level": "H2",
      "text": "A New Yorker Magazine State of Mind"
    },
    {
      "level": "H3",
      "text": "To Sum It Up"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Tom Harari\n          \n            Tom Harari\n          \n            Tom Harari"
}