{
  "url": "https://moz.com/blog/how-does-your-local-seo-market-compare-with-other-large-cities-out-there-11696",
  "slug": "how-does-your-local-seo-market-compare-with-other-large-cities-out-there-11696",
  "title": "How Does Your Local SEO Market Compare With Other Large Cities? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Recently, in my efforts to improve my business, I looked over the competition not only in my local Seattle SEO market, but also jumped over into other cities to gauge who's doing the \"right things\" out there in other cities.\nIn order to figure out which markets to examine with what little time I…",
  "content": "How Does Your Local SEO Market Compare With Other Large Cities? Keyword Research By: Brandon Na January 12, 2011 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Brandon Na January 12, 2011 How Does Your Local SEO Market Compare With Other Large Cities? Keyword Research This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Recently, in my efforts to improve my business, I looked over the competition not only in my local Seattle SEO market, but also jumped over into other cities to gauge who's doing the \"right things\" out there in other cities. In order to figure out which markets to examine with what little time I feel I have (despite having enough time to do a YOUmoz submission), I had to find which city seemed to be the \"most competitive\" in terms of SEO. So, how does one come up with a methodology that would determine this SEO competition index? Obviously, one could easily just pay the $99/mo to get SEOmoz Pro Membership which I did after I wrote this little piece, but instead I decided to add in factors that may not be 100% incorporated into the Difficulty Tool. I also wanted to see if my results would correlate with the Keyword Difficulty scores provided by Pro as well. Getting to my “old fashioned” way of building a competition index... First off, I could easily assume that the biggest cities out there are the most competitive. More people, the higher the competition, right? The law of the jungle might say there's many fierce SEO'ers out there clawing at each other in the Big Apple. (I can see it now with some random linking specialist jumping on top of another PPC guru who he accused of stealing a link at SMX Seattle later this summer) Of course, if this simple logic was true, New York City would naturally be #1, Los Angeles next and Chicago right after that. However, we know just because a big city is just that, a big city, it does not mean it's necessarily the most difficult to compete on various fronts. I'd argue after living in New York for a couple years that sometimes it's easier to be a computer engineer there vs. here in Seattle where the competition may be almost as fierce as it is in the jungle. More on that theory possibly in some other job forum. For the purpose of this article though, I'd say the industry of \"city specific SEO\" is complex to measure & is somewhat dependent on factors we may not even be able to decipher. Nevertheless, it shouldn't stop us from trying and let's just call this version 1 of this inquiry/analysis. Maybe this can be the start of future inquiries on how competitive it is to rank for more than just even our profession? Doctors in Orlando? Dentists in Denver? OK, so this may be one broad leap in generalization, but we've all made a living off of hypothesizing what the google keywords data tells us & here we go again. So, I did my keyword research using the kw tool adding in the top 25 cities I found by doing a quick search on “top 25 cities” to my little recipe. Next, I queried the tool a bit finding the inventory for each of the [city name] + “seo”, adding up various keywords related to each city. For example, if “denver seo” had also “denver seo firm” and “denver seo services” plus whatever else showed up with both “denver” and “seo” in it, I threw it into denver's mix of monthly inventory, I not only found out how many results were in the local searches clicking off “exact searches”, but also added in the global searches inventory. I did give the local exact searches 3X's the weight in my hypothesis. (this was a total swag, I admit, but just felt local searches were much more important as a gauge) I threw in the competition index Google provides for the keywords, added a little “total webpages found” index for each set of keywords (assuming we're competing against all those other pages for each kw) and finally mixed in the average PR for each of the sites in the top 10 for the city + seo. And “wallah!” Here's the top 10 General top line observations: The Top 2 Cities by Population were the most competitive after all, but Chicago fell to 4 behind the greatest tech city of them all (sorry all you Seattlites, I think there continues to be a reason why the Californians have an area called Silicon Valley & we're still more known for Bill Gates)As just stated, Silicon Valley did rank up there as I thought might be the case despite it being the 12th largest city in terms of population. I am equating “San Francisco” though as the representative of the Sillicon Valley area for this post's purposes. If we add “San Jose” to the mix, it could possibly even bump Los Angeles out of 2nd place or maybe even top New York.Denver, Boston & Seattle ended up being much more competitive than the size of their city populations respectively. Heres's a fuller list including Portland which was outside the top 25 cities in terms of population. I was being a little selfish and including the city just south of us here in Seattle for my own purposes. It's interesting since it doesn't rank below the the less competitive cities in either this ranking or SEOmoz's which I'll get to here in a second. *note: next to the city name is the estimated population rank Some notes about the results: As mentioned already, the methodology in calculating the \"most competitive SEO city\" is definitely NOT 100% scientific. I think there are some parts of the formula that where the logic breaks down. Nevertheless, in addition to giving a quick summary of what I did before providing the top line findings and the results themselves, here are more specifics about how I built this list: I decided on 4 different indexes that I would give each equal weighting of .25% They were:keyword competition indexsearches inventory indexwebpages returned for city name keyword phrase indexPR average of top 10 results index 1. Keyword competition indexI took all the different phrases that came up from doing a search on the [city name] + “seo” and added up the search inventory. I made sure that I checked off [Exact] for “Match Types” on the left hand side to limit the inventory and is a measure I trust more these days for the accurate true searches conducted for a keyword. I also “Include terms” [city name] + “seo” to make sure each city didn't have too many phrases that were simply just “relevant” according to google, but were actually including the city + seo somewhere in the user's query. Some cities had 23 different permutations whereas some just had one. I then calculated the keyword competition index based on the “competition” column that the tool provides as a default, but added it up and simply divided the total by the number of phrases. Unfortunately, I gave them equal weighting instead of giving the keyword phrase that has a .67 competition index with 600 queries twice the weight of a keyword phrase that had a .54 competition index with only 300 queries a month. So, this is probably a flaw in the formula. 2. Searches inventory indexI added up the inventory for both local and global of all the queries that came up for each city, but gave the local searches 3X's the weighting. Why I chose an arbitrary weighting of 3X's the local “exact searches” to add on top of the global searches inventory is just that as well: arbitrary. I simply just gave it the “gut check” and left it at that. The searches index was interesting since cities like LA had the highest, with Denver coming in 2nd. After gathering the totals for each, I simply divided each total by the biggest total number of queries which had an index of 1.0 (i.e., Los Angeles) and the lowest being “El Paso.” 3. Webpages returned for city name keyword phrase indexI simply just took the number of search results that came up for the simple google query (not on the adwords tool). Unfortunately, taking this number is inconsistent with my way of conducting the first two indexes. It would have taken forever to add up cities like Denver which literally had 23 different permutations of search keyword phrases with “denver seo” in it. Someone want to do it for me? 4. PR average of top 10 results indexFor the last part Index, I simply grabbed the PR rankings for the top 10 results and added them up. I divided them by 10 and then multiplied it by .25. Again, this was arbitrary and seemed right at the time because it was only worth 25% of the total. Fortunately, the indexes were averaging around 2-5 at the most and so it didn't create too much of a problem. However, if the PR's were higher, it may have thrown off the results a bit. Also, why each index deserved equal weighting wasn't necessarily always logical. The only 2 that were somewhat consistent were 2. and 3. since 1. and 4. were more google's index and my averaging of the PR's multiplied by .25. Lastly, when trying to figure out what inventory there was for each city, I took into account that some cities had “nicknames” like San Francisco. If there was a “like phrase”, I added in the keyword inventory which possibly helped “the bay area” a bit more. Another city like Los Angeles was bolstered by “LA SEO” as well. However, I'm not sure how many people would search on google “emerald city seo” realistically. Do New Yorkers search for “Big Apple SEO?” Sounds like a good name for a local SEO company. :) Let's look at how the rankings change if we use simply the “Keyword Difficulty” Scores: So, we can see with SEOmoz's Keyword Difficulty tool, L.A. jumps to the top. It makes sense given the number of searches that are done for \"los angeles seo\" and adding into it \"la seo\", etc. However, there are some bigger differences though with cities like \"fort worth.\" SEOmoz ranks it as 4th whereas with my \"home grown formula,\" I find it to be towards the bottom of this list. My gut tells me that I'm more correct, but maybe all the different parts of SEOmoz's tool is more accurate? Also, do we really think that \"San Francisco\", \"San Jose\" and \"Chicago\" all rank as low as they do with SEOmoz's tool? However, I found a couple other discrepancies with my own formula: a) I failed to include \"search engine optimization\", but if the numbers google provides for \"seo\" versus \"search engine optimization\" are true, both supposedly are searched on 9.14 million times a month around the world. Why are the numbers the same? Not sure, but for my leap in generalization purposes today, I'm thinking it may have a little to do with the fact that people don't want to type the long phrase and are getting used to just typing \"seo\". b) Also, there's a few Koreans with the surname of “Seo.” So, it would be somewhat interesting if you pulled out all the people who were looking for the \"seo family\" in seattle. Who knows? Korean Pop stars are quite popular and perhaps Danny and Keith Seo in Seattle are really popular out there in cyberspace. Nothing surprises me. Anyway, I put this out there for your benefit in your respective cities and also to help me clear up some assumptions I've had with some of the cities out there. Local Search will most likely continue to grow as the Internet replaces the phone books out there (wait a second, maybe it's already done that?). Maybe we'll start seeing articles here specific to each area, instead of the SEO world \"in general\" or talking about \"local seo\" applying to each region? I know there are many things that are specific to each region that are different for other parts of the country. For example, I added \"bay area\" to the \"san francisco seo\" queries because I believe the area is called that, but then again, as an outsider, maybe it's just us who call it \"the bay area?\" Also, I wanted to compare one of my methods in figuring out how difficult it is to rank for a particular keyword. I actually have a few other things I like to throw in the mix as well when I have time. At least with my findings today, I feel like doing it manually sometimes is important for personal edification (and possibly for client's too ;) Oh, also on the bottom of the list, there may be ripe opportunities for some SEO'ers out there to jump on. Unfortunately, my budget and time doesn't allow me to focus those areas, but for all you who have the extra time, maybe you'll enjoy this and can buy me a burger some day if we ever meat. Ooops, did I say meat? Sorry all you vegetarians. OK, that was bad. --- **Google's Adwords Keyword Tool Query Settings: (default) Locations: United States Languages: English Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Does Your Local SEO Market Compare With Other Large Cities?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Does Your Local SEO Market Compare With Other Large Cities?"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Brandon Na\n          \n            Brandon Na\n          \n            Brandon Na"
}