{
  "url": "https://moz.com/blog/how-do-you-role-your-seo",
  "slug": "how-do-you-role-your-seo",
  "title": "How Do You Role Your SEO? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Along with all the hot \"technical\" topics this year, like Universal Search and blended search in general, algo changes, social media, local and mobile search, and most recently Google's big crack down on paid text links, it also seems to have been a big year for background discussions... high on…",
  "content": "How Do You Role Your SEO? Public Relations By: Brian Brown November 12, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Brian Brown November 12, 2007 How Do You Role Your SEO? Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Along with all the hot \"technical\" topics this year, like Universal Search and blended search in general, algo changes, social media, local and mobile search, and, most recently, Google's big crack down on paid text links, it also seems to have been a big year for background discussions (with employment being high on the list of topics over the last 12 months or so). On one hand you have all the moves within the greater search industry, and on the other hand, the job market (including SEOmoz's Marketplace), both in regard to the needs and the opportunities. As an industry, the last of these is both exciting and important. The positive status of the career market further demonstrates the legitimacy of the industry as well as the continual strengthening of the foundation of search marketing. There are roles in PPC and those in SEO, roles as independents, often doing A to Z, to in-house positions or specialty roles in agencies, working within a team. November marks 6 months since I joined Netconcepts, so it seemed like a rather appropriate time to share some thoughts on at least one aspect of the search marketing career market that might be extremely relevant to SEOmoz readers--the role change of solo SEO to agency SEO. This is, after all, an industry filled with more than its fair share of solo practitioners, many of which have entered into search marketing from completely unrelated areas. And this may be of interest to those doing in-house work, or who are still in an unrelated position but are itching to make the jump. With all this talk about the great opportunities and the need for good, smart people, what's stopping you? Fear, moving out of your comfort zone, not sure you have what it takes, or something else? Let's explore this opportunity, but not with the standard \"Top 10 Reasons,\" but with a real live example. I started my own company, Identity Developments, back in 2003, initially as a web development firm--actually, starting the business after getting my first web design client. Maybe you started in the biz this way as well. Step back--before that, I was working in a completely unrelated area doing product management and new product development in, of all places, the office products industry [interjection from Rebecca: Wernham Hogg or Dunder Mifflin?]. I entered into the web world at zero and taught myself XHTML, CSS, and table-less design. Add this to a sales and marketing background and learning and adding SEO services to my portfolio was a logical step. 6 months or so ago, there was an opportunity for me to join Netconcepts. What would this mean and why would I do it? More importantly, why would you? Broaden Your Skills Your clients may be smaller players, or perhaps within one industry. Working in an agency will probably expose you to bigger names, bigger sites, more challenging experiences, diversity of industries, and even a greater variety of types of sites. Of course, if you are working in-house somewhere, the industry diversity will probably be a huge change. More than just your technical knowledge and skills, working within a team environment can expand and broaden your professional skills as well. Focus Certainly if you've been in the solo SEO role, you know how challenging it can be to attain that laser-like focus. For one, you may be wearing more hats than you can even count... consultant, analyst, link builder, copywriter, administrator, sales and business development--and if you are doing design and development, there are several more roles there, not to mention that you might also be head coffeemaker and lead-trash-taker-outer. These can all be great roles to play, but not being able to focus deeply on any one of them limits the level of complexity and difficulty you can take on or the level of mastery you can achieve. The good news though, is that if you are in this multi-role situation now, having this broad background or in-depth knowledge in any of these other areas will be an asset you can bring to the agency table. The challenge to SEO practitioners is to both master their craft and have a broad knowledge of everything else they come in contact with at the same time. Exponential Knowledge While the previous points are important, if you're like me, it is this last point that may lead your list, and perhaps one of the biggest reasons you continue to return to SEOmoz. Not to sound too cliché, but there certainly is a synergy that comes with working with others on a team. Something that seems to run through many in the SEO community is the desire to share knowledge and to participate with others. This, perhaps more than anything, is what sets the SEOmoz community apart from every other SEO site. The added benefit of working in an agency environment over going it alone is the ability to bounce ideas off of your teammates. Of course, by working in-house, if you are lucky enough, you may benefit from the team environment there as well. What may be harder to find though is exposure to the level of expertise that working within an agency can provide. This was, for me, both the prompt for exploring as well as accepting the opportunity to join an agency. Specifically, for me it was the ability to work with Stephan Spencer, the founder of Netconcepts, and PJ Fusco. Sure, I would love to work with Rand, but moving from Madison to Seattle wasn't an option. In an industry still so new, so young, and so constantly changing, right now search marketing agencies may not only provide a great career opportunity, but access to and the ability to work with leading experts, unlike any other industry. It's hard to imagine a better time to work in search marketing, and perhaps, a more perfect time to consider an agency role, especially when most agencies are seeking new talent to bring onboard. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Do You Role Your SEO?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Do You Role Your SEO?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Brian Brown\n          \n            Brian Brown\n          \n            Brian Brown"
}