{
  "url": "https://moz.com/blog/how-to-create-10x-content-whiteboard-friday",
  "slug": "how-to-create-10x-content-whiteboard-friday",
  "title": "How to Create 10x Content — Best of Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Have you ever tried to create 10x content? It's not easy, is it? Knowing how and where to start can often be the biggest obstacle you'll face. In this oldie-but-goodie episode of Whiteboard Friday, Rand Fishkin talks about how you can develop your own 10x content to help your brand stand out.",
  "content": "How to Create 10x Content — Best of Whiteboard Friday Whiteboard Friday | Content Marketing By: Rand Fishkin September 4, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 4, 2020 How to Create 10x Content — Best of Whiteboard Friday Whiteboard Friday | Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Have you ever tried to create 10x content? It's not easy, is it? Knowing how and where to start can often be the biggest obstacle you'll face. In this oldie-but-goodie episode of Whiteboard Friday, Rand Fishkin talks about how you can develop your own 10x content to help your brand stand out. Click on the whiteboard image above to open a high-resolution version in a new tab! Video Transcription Howdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week we're chatting about how to create 10x content. Now, for those of you who might need a refresher or who haven't seen previous Whiteboard Fridays where we've talked about 10x content, this is the idea that, because of content saturation, content overload, the idea that there's just so much in our streams and standing out is so hard, we can't just say, \"Hey, I want to be as good as the top 10 people in the search results for this particular keyword term or phrase.\" We have to say, \"How can I create something 10 times better than what any of these folks are currently doing?\" That's how we stand out. What is 10x content? 10x content is content that is 10 times better than the highest ranking result for a given keyword(s). Here are 119 Examples of 10x Content. Criteria for 10x content: It has to have great UI and UX on any device. That content is generally a combination of high quality, trustworthy, it's useful, interesting, and remarkable. It doesn't have to be all of those but some combination of them. It's got to be considerably different in scope and in detail from other works that are serving the same visitor or user intent. It's got to create an emotional response. I want to feel awe. I want to feel surprise. I want to feel joy, anticipation, or admiration for that piece of content in order for it to be considered 10x. It has to solve a problem or answer a question by providing comprehensive, accurate, exceptional information or resources. It's got to deliver content in a unique, remarkable, typically unexpectedly pleasurable style or medium. If you hit all of these things, you probably have yourself a piece of 10x content. It's just very hard to do. That's what we're talking about today. What's a process by which we can get to checking off all these boxes? Step 1 - Gain deep insight. So let's start here. First off, when you have an issue, let's say you've got a piece of content that you know you want to create, a topic you know you're going to address that topic. We can talk about how to get to that topic in a future Whiteboard Friday, and we've had some in the past certainly around keyword research and choosing topics and that sort of thing. But if I know the topic, I need to first gain a deep, deep insight into the core of why people are interested in this subject. So for example, let's do something simple, something we're all familiar with. \"I wonder what the most highly-rated new movies are out there.\" Essentially this is, \"Well, okay, how do we get into this person's brain and try and answer the core of their question?\" They're essentially asking, \"Okay, how do I figure out . . . help me decide what to watch.\" That could have a bunch of angles to it. It could be about user ratings, or it could be maybe about awards. Maybe it's about popularity. What are the most popular movies out there? It could be meta ratings. Maybe this person wants to see an aggregated list of all the data out there. It could be editorial or critic ratings. There's a bunch of angles there. Step 2 - We have to get unique. We know that uniqueness, being exceptional, not the same as everyone else but different from everyone else out there, is really important. So as we brainstorm different ways that we might address the core of this user's problem, we might say, \"All right, movie ratings, could we do a round-up?\" Well, that already exists at places like Metacritic. They sort of aggregate everything and then put it all together and tell us what critics versus audiences think across many, many different websites. So that's already been done. Awards versus popularity, again, it's already been done in a number of places that do comparisons of here's the ones that had the highest box office versus here's the ones that won certain types of awards. Well, okay, so that's not particularly unique. What about critics versus audiences? Again, this is done basically on every different website. Everyone shows me user ratings versus critic ratings. What about by availability? Well, there's actually a bunch of sites that do this now where they show you this is on Netflix, this is on Hulu, this is on Amazon, this you can watch on Comcast or on demand, this you can see on YouTube. All right, so that's not unique either. What about which ratings can I trust? Hang on a tick. That might not exist yet. That's a great, unique insight into this problem, because one of the challenges that I have when I want to say, \"What should I decide to watch,\" is who should I trust and who should I believe. Can I go to Fandango or Amazon or Metacritic or Netflix? Whose ratings are actually trustworthy? Well, now we've got something unique, and now we've got that core insight, that unique angle on it. Step 3 - Uncover powerful methods to provide an answer. Now we want to uncover a powerful, hard-to-replicate, high-quality method to provide an answer to that question. In this case, that could be, \"Well, you know what? We can do a statistical analysis.\" We get a sample set big enough, enough films, maybe 150 movies or so from the last year. We take a look at the ratings that each service provides, and we see if we can find patterns, patterns like: Who's high and low? Do some have different genre preferences? Which one is trustworthy? Does one correlate with awards and critics? Which ones are outliers? All of these are actually trying to get to the \"which one can I trust\" question. I think we can answer that if we do this statistical analysis. It's a pain in the butt. We have to go to all these sites. We have to collect all the data. We have to put it into a statistical model. We then have to run our model. We have to make sure that we have a big enough sample set. We've got to see what our correlations are. We have to check for outliers and distributions and all this kind of stuff. But once we do that and once we show our methodology, now all we have to do is... Step 4 - Find a unique, powerful, exceptional way to present this content. In fact, FiveThirtyEight.com did exactly this. They took this statistical analysis. They looked at all of these different sites, Fandango and IMDB users versus critics versus Metacritic versus Rotten Tomatoes and a number of other sites. Then they had this one graph that shows essentially the star rating averages across I think it was 146 different films, which was the sample set that they determined was accurate enough. Now they've created this piece of 10x content, and they've answered this unique take on the question, \"Which rating service can I trust?\" The answer is, \"Don't trust Fandango,\" basically. But you can see more in there. Metacritic is pretty good. A couple of the other ones are decent. Step 5 - Expect that you're going to do this 5 to 10 times before you have one hit. The only way to get good at this, the only way to get good is experimentation and practice. You do this over and over again, and you start to develop a sixth sense for how you can uncover that unique element, how you can present it in a unique fashion, and how you can make it sing on the Web. All right, everyone, I look forward to hearing your thoughts on 10x content. If you have any examples you'd like to share with us, please feel free to do so in the comments. No problem linking out. That's just fine. We will see you again next week for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com Interested in building your own content strategy? Don't have a lot of time to spare? We collaborated with HubSpot Academy on their free Content Strategy course — check out the video to build a strong foundation of knowledge and equip yourself with actionable tools to get started! Check out the free Content Strategy course! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Create 10x Content — Best of Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Create 10x Content — Best of Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "What is 10x content?"
    },
    {
      "level": "H2",
      "text": "Step 1 - Gain deep insight."
    },
    {
      "level": "H2",
      "text": "Step 2 - We have to get unique."
    },
    {
      "level": "H2",
      "text": "Step 3 - Uncover powerful methods to provide an answer."
    },
    {
      "level": "H2",
      "text": "Step 4 - Find a unique, powerful, exceptional way to present this content."
    },
    {
      "level": "H2",
      "text": "Step 5 - Expect that you're going to do this 5 to 10 times before you have one hit."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}