{
  "url": "https://moz.com/blog/how-to-hire-local-seo-agency",
  "slug": "how-to-hire-local-seo-agency",
  "title": "How to Hire the Best Possible Local SEO Agency for Your Business - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The best agency for your local SEO needs will be the one that’s there for you when things go right AND when they go wrong. This article will equip you with tips for finding just that kind of agency, to help you to take your local business on the best possible trek into the future.",
  "content": "How to Hire the Best Possible Local SEO Agency for Your Business Local SEO | SEO Consulting By: Miriam Ellis June 14, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis June 14, 2021 How to Hire the Best Possible Local SEO Agency for Your Business Local SEO | SEO Consulting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Local search marketing is a very strenuous hike. When you hire an agency to help with the varied tasks of local search engine optimization and offline-to-online marketing, you’re hoping to take an experienced guide along with you on the journey from trailhead, to setting up camp, to making the most of your company’s stay in your neck of the woods. Top of mind for your local business will certainly be increasing revenue. You know you’ll need better or broader local and localized organic rankings for this, perhaps more reviews, more clicks-to-call, more form submissions, more qualified website traffic, or an improved conversion rate to get there. But, I want to encourage you to start the search for a local SEO agency with a long-term relationship as the goal, rather than swift wins on specific metrics. The best agency for your local business will be the one that’s there for you when things go right and when they go wrong, for many years to come, because you’ve made a mutual commitment to traveling together and are both sharing the rewards success brings. This article will equip you with tips for finding that kind of agency, warn you of danger signs, and help you to take your local business on the best possible trek into the future. Your responsibilities to the local SEO agency you hire Fundamental: be sure you’re hiring a firm with local SEOs on board rather than just a general digital marketing agency. But, beyond this, you need to see that your partner is making a real commitment to your business in order for you to trust them and act on their advice. The other half of the relationship equation will be the commitments you are prepared to make. These five responsibilities belong in your backpack: 1. Know Google’s guidelines Before you begin your search for an agency, mark out 30 minutes on your calendar for slowly reading through the Guidelines for representing your business on Google. It’s as fundamental to what you’re about to do as looking at a trail map would be before heading off into Yosemite. If you don’t read the guidelines, you’ll be in danger of asking your agency partners to do things that would get your business into trouble with Google. More alarming, without knowledge of what Google allows local brands to do on their platform, you will have no idea if an agency you hire is engaging in activities that violate the guidelines, putting your company at risk of suspension, listing removal, and reputation damage. Don’t skip this step. You don’t have to be an expert in all the minutiae of weird scenarios businesses encounter when seeking guideline-compliance, but you do need a rough understanding of what Google permits, so that you and your chosen agency start from the same entry point of making smart marketing decisions with business longevity in mind. 2. Be honest about past mistakes If, through past ignorance of Google’s guidelines, you come to realize that your business made mistakes in its marketing, tell your agency partners. This could include mistakes that resulted in actions on Google’s part, such as listing suspensions or review removal. Or, it could include mistakes that Google has not yet noticed, such as creating listings for ineligible entities like P.O. boxes, or having staff post positive reviews of your business. Your agency will have the task of cleaning up, either before damage has occurred or after it’s already happened. It can be embarrassing to admit mistakes, but unless you make your marketers aware of any errors and problems you know of, they can’t help you with them, and they may cast a long shadow over your business if left unaddressed, undermining success. 3. Do your best to deliver on your end I’ve consulted with every type of local business from beekeepers to bookkeepers, and one of the most frustrating barriers to getting agency work completed is when clients fail to meet deadlines for deliverables. This widespread problem that can seriously strain business relationships because delays in delivery then delay expected successes. The client can end up blaming and quitting the agency for not meeting benchmarks, when failure is actually due to the local business missing deadlines. In fact, it’s a red flag to good agencies if a potential client has changed marketing firms repeatedly within a short timeframe, because enough time can’t have been given for the results of their local SEO work to bear fruit. If you or your staff have agreed to provide certain materials, such as spreadsheets of business information, content for new pages on the website, photos, or access permissions, do your best to deliver on time. Empathetic local SEOs understand that local business owners are some of the busiest people in the world, and an occasional delay is understandable, but if it becomes a pattern, it’s time to reassess the relationship. For example, if the business repeatedly fails to deliver text content to the agency, it may be that the business needs to expand the number of services for which it’s paying its marketers. Maybe the agency needs to provide a copywriter for the business so that work can begin moving ahead again at a good pace. 4. Base expectations on your expert’s appraisal of what’s possible The internet is crowded, and unless your business model is unique in its geographic market, it’s going to take time to see maximum ROI from your agency partnership. Some local SEO tasks can literally provide same-day boosts, but for others, it will take many months to see your investments start to pay off. Every marketing relationship should begin with a realistic appraisal of what experts at the agency believe is possible for the unique business — within a rational timeframe. This is the opposite of expectations like, “I want to rank #1 within two weeks.” Rather, it’s the foundation of a strategy that could take multiple years to fully roll out, meeting important benchmarks on a monthly or quarterly basis along the way so that growth is measurable and meaningful. It’s your responsibility to ask the experts you hire to map out what you should expect, based on your business model, your market, your market competitors, and the agency’s past experience. 5. When dealing with Google, expect change Your agency’s backpack contains all kinds of specialized knowledge, but they don’t control the forest. It’s Google, with their near-monopoly on local search, that rules their powerful platform, and they are continuously altering the terrain in both small and large ways. New rules, new features, emergent bugs, ongoing algorithmic updates, and new competitors setting up shop or upping their marketing games mean that you and your marketers can always expect change. It can be extremely alarming when Google alters something and your business experiences a drop in phone calls, traffic, visibility, or reviews. Communicate with your agency, and then extend a little patience while your marketers investigate the change and develop a list of actions, if any, that need to be taken. Warning signs of an undesirable local SEO agency As mentioned, local search marketing is a very strenuous hike, and what you don’t need in a traveling companion is an ill-equipped partner. There are three points of discovery at which you must assess whether an agency is a benefit or burden to your local business: before hiring, mid-relationship, and post-relationship. Watch out for these red flags: Before hiring Beware of any agency that cold-contacts you. You may receive phone calls or emails from marketing agencies claiming that something is wrong with your website or marketing that they can fix. You may be contacted by people claiming to have a special relationship with Google, or even to be from Google! People may follow you on social media and then try to sell you services. While good agencies do engage in legitimate advertising, the best local SEO agencies may get nearly all or all of their work via referrals from happy clients, industry peers, and the reputation they’ve built, preventing them from relying on cold contacts. Rather than responding to anyone reaching out to you out of the blue, it’s better for you to do the finding of your future marketing partners through your own research. A good way to start this process is to look up questions you have about local SEO in Google, see who has written answers that make sense to you, and then learn more about the author from their website, other articles, and social media profiles. Beware of any agency that promises you any kind of results. “I can get you #1 rankings,” is a huge red flag of a shady firm, because honest SEOs know they can’t make promises about platforms (like Google) that they don’t directly control. Beware of any agency that doesn’t meet your standards of accessible, prompt, professional communication. If a marketing firm is hard to reach before you hire them, expect this to continue even when you’re paying them, and never begin a relationship with a partner who is dismissive of your communications, unclear to you in their communications so that you don’t understand what they’re offering, rude, or inconsistent in their claims. Beware of agencies that only sell packages. While some services can be packaged up for general use by most local businesses, all local brands are unique, and good agencies should be offering you a customized strategy. Related to this, be cognizant of the size of the agency you’re considering. In my experience, small-to-medium local businesses are best served by small-to-medium agencies, rather than becoming just a number in an enormous client roster of a major brand. For example, a big website hosting company may offer a local SEO package, but you’re unlikely to have a unique identity to the people working at a brand this large, and shouldn’t expect to receive best-quality, personalized service when being fit into shoes thousands of others are wearing. Finally, and crucially, beware of any agency that indicates they will engage in a practice that you’ve learned violates Google’s guidelines. This is one reason it’s so important for you to equip yourself with that essential reading, so you can walk away from this headache before it begins. Mid-relationship It’s quite common for local businesses to have to work with more than one agency before finding an ideal fit. Sometimes, a relationship can start well, but changes in personnel at the digital marketing agency, changes in expectations, or growth of the business beyond the agency’s skill set can require reassessment of whether the partnership is still the best choice for the business. Take note if your agency becomes less communicative, fails to respond to emails or calls, or cancels meetings. If you notice a pattern, ask what has changed, give the agency the chance to correct course with you (including booking more of their time or offering you extra help to make up for past failures), but then consider moving on if dissatisfaction isn’t remedied. I’m personally such a local business fan that I’ve always considered it a tremendous honor to be brought into a good local business to advise them. Evaluate at regular intervals whether you feel like you and your business are being honored by your marketing partners. Finally, pay attention if benchmarks are repeatedly missed. For example, if your marketing partners tell you that they typically expect investment in review outreach to have doubled the rate at which you’re receiving reviews within one quarter, and four months go by without any improvement, request an explanation and weigh it well. Local SEO is experimental and demands patience and leeway, but if stated goals are consistently not met, your agency may not be up to the task at hand. Post-relationship If changes on either side of the relationship make it necessary to part ways with your agency, the ideal scenario is a mutually-respectful adieu in which the marketers wish the client well on the next phase of their journey, and the client has done nothing that would make it awkward to potentially work with these partners again in future — if they’d like to. I’ve seen from a distance some shockingly unprofessional business breakups, with accusations hurled on both sides, websites being held hostage, scathing reviews being left, foolhardy online revenge attempts, and even lawsuits. Unless something has happened to warrant legal action, it’s best to walk away with everyone’s dignity intact. There are many reasons why clients and agencies may be mismatched, but only edge cases warrant making a public scene that risks reputation damage to both houses. When a top quality local SEO agency can’t fulfill a client’s expectations or needs, a respectful environment may prompt them to refer the business to another firm they know and trust. When a client grows beyond what an agency can provide but has been happy up to that point, polite openness can greatly ease the parting. Rather than burning a bridge, try to keep it open so that good feelings on both sides exist for any future potential work together. Almost any agency will be sorry to see you go. You can remain an all-time favorite client of theirs if you agree to write a testimonial about whatever was good for your business in working with them, and they will love you forever if you refer other local brands to them that you think would be a good match for their services. If you stay friends with your former marketers, they may CC you when they see an opportunity for your business, and it’s definitely a plus for your brand if your marketers tell their big circle of colleagues, friends, and family about the great things your business offers. I’ve personally become a loyal customer of some of my best clients! 7 questions to ask a local SEO agency before you hire them Before inviting a marketer or marketing team to partner with your business, you’ll need to walk a mile or so with them. Conduct a thorough interview of one or more prospective agency reps, and document their answers to these seven questions, so that you can do a comparison to identify the best possible match for your needs. 1. Are your marketing practices consistent with all of Google’s guidelines? A good agency should be expert in the Guidelines for representing your business on Google, Google’s guidelines for user-contributed content — including reviews, and Google’s search quality evaluator guidelines, and should agree to adhere to them to avoid negative outcomes for their client. If you’re not convinced that a marketer you’re interviewing is conversant with Google’s policies, present a hypothetical question to them and see if their solution matches the guidelines. For example, if you ask the marketer whether you can get a Google My Business listing for a virtual office, they should tell you “no” and point you to the guidelines that forbid this. If a marketer knows the guidelines but suggests that you can get away with a violation because Google is asleep at the wheel, walk away. The marketer may be quite right, by the way, but they’re not a safe bet for your brand’s reputation. 2. Based on what you already know about my business and market, are my goals realistic? Provide a clear, concrete list of goals to the interviewee. Be specific about how many more search terms you want to rank for, how many more reviews you want, how many more phone calls, form submissions, leads, sales, etc. you want within a set timeframe. Before having an interview with you, a motivated agency will have conducted a modest amount of research on your business and its market. They may have run some reports. But don’t expect them to have done a full workup before being hired. What you want to hear at this stage is whether they feel your goals sound reasonable or are obviously unattainable, based on what they know so far. You want to hear them say that they will be able to provide a more reliable answer once they’ve put in the work as your hired partner. But also look out if they promise you everything off the bat — they could be overselling you just to get the job. 3. How much time will you invest in researching my market before creating my strategy? You won’t be hiring a local SEO who is already marketing a direct competitor in your city, so this means your partner will need time to learn about the community you serve. And, unless you hire a specialty firm that only works with your category of business, the agency will need time to learn about your industry. Beyond this, they will need the time to study the specifics of your unique business: its goods and services, its staff (including any in-house staff that may be contributing to marketing), its policies, history, and more. Time for all of this must be built into the informal agreement or formal contract. You should expect to be billed for it, and need to know how much time the agency considers reasonable for an initial period of study, with the understanding that they will be continuing to evaluate your brand and your market opportunities across time in order to continuously create strategy. At the bare minimum, unless you are hiring an agency solely for some small one-and-done service, your work with them should begin with a full business audit and a complete competitive audit so that strategy is based on data rather than guesses. 4. What will you need from me? Give the interviewee the chance to set clear expectations about the deliverables they will need from you and the time they may need to speak with you and your staff. Within this framework, establish what types and amounts of communications will be involved. Some local business owners want their marketers to take care of everything behind the scenes and only come to them with reports of problems or growth. They may be outsourcing this work due to genuine lack of time to learn about local search marketing. Other clients hire an agency to train them and their staff to become more self sufficient at many marketing tasks, in-house. These scenarios cover an extremely wide spectrum of communications needs. Be upfront about whether you want bare minimum communication, a regular schedule of strategy sessions, or formal training, and have the interviewee explain to you what commitments you’ll need to make on your end to facilitate this. And, of course, now is the time to request a full explanation of costs. Agency pricing structures differ tremendously, from itemized price sheets, to packages, to monthly retainers. Be realistic and firm about your budget, and see whether what you can invest is a good match for what the interviewee can provide in your joint pursuit of meeting goals. 5. May I see an anonymized client report? Every local business will have different expectations and needs concerning the reports their marketers deliver, but across the board, all brands need to be sure they will receive reports that are intelligible rather than simply overwhelming. Before you hire a local SEO, ask to see one or more anonymized, real client reports. Look at them thoroughly. Now is the time to ask questions about anything that’s in the reports that you don’t understand. Some clients want exhaustive reports that capture every iota of traffic and every search language permutation on every day of the week. Others prefer to see only high-level data with action items for the agency or client. Whatever your needs, be sure the style of reporting the marketers offer is a good match, both in terms of content and frequency, and that customization is possible if you need something that isn’t being provided in the samples. Feel free to ask the agency about the tools and software they use, and to do your own research of the quality of those products. You are also free to ask if the agency is white-labeling tools or has proprietary technologies. A good agency will be open and honest with their clients. 6. Can you show me the growth you’ve created for three other clients? Due to NDAs and client privacy, this information may also need to be anonymized, but you want to see a convincing account of growth for more than one client. Be on the lookout for whether the agency reports on vague metrics like doubling traffic, or concrete ones like doubling leads and revenue. If there’s a particular type of growth your business is pursuing, you can ask the agency to show you wins they’ve gotten in this area. If the agency keeps a public roster of their clients, ask if you can be put in touch with someone at a few of these businesses for a quick chat. Ideally, you’re hoping to hear a glowing recommendation from an existing client of the company you’re considering hiring. 7. What is your history and involvement in your own industry? Consider it a fundamental part of your interview process to go online and research the reputation of any marketer you might hire. Look particularly at the degree to which they are involved in education in the local SEO industry, because you will be hiring this person or team to educate you. Deeply-invested local SEOs will have a history of writing about this marketing discipline. They may have a blog, or contribute to industry blogs, have a podcast or videos, and speak at or host conferences. Look at their website, their social media profiles, reviews if they have them, and note what their peers and clients are saying about them. In addition to doing your own online research, now is a great time to ask the marketer a little about their own history. Why did they get into local SEO and what do they like about it? Do they have a philosophy that they can share succinctly and does it resonate with your company’s culture? Throughout the interview process, be keenly alert to how well any prospective partner communicates with you and the level of comfort they create, because it will set the tone of any future relationship. Mutual, sustained growth: so happy together After a long hiring journey, you’ve chosen your agency and have now set up camp together. You’ve become sharers in one another’s fates, and that’s exciting! Unless your local business is taking a complete hands-off approach to marketing, you’re about to learn a lot about local SEO. There are three things you can do to get the most from this business investment: 1. Ask questions I’m hoping that the agency you’ve engaged doesn’t communicate in jargon, but if they do, nip this unhelpful habit in the bud by being completely fearless about asking questions. Never, never be timid about this. If your marketer says, “We can increase CTR with a more compelling USP, but we need to focus on largest contentful paint first,” and you don’t hear the next three things they say because you got lost trying to parse this out, state clearly: “I’d prefer you avoid acronyms and jargon as much as possible so that we’re speaking the same language, and I’ll try to do the same when explaining my industry to you.” If there is anything your marketer says or sends you at any time that isn’t clear or contains words and phrases you don’t recognize, you’re the smart one for asking them to back up and explain until you’re completely comfortable with what’s being proposed, reported, or discussed. 2. Communicate dissatisfaction and satisfaction openly Don’t let resentment quietly build over dissatisfactions you have with your agency. If something isn’t meeting your standards, please speak up early and often so that your marketers aren’t in the dark about how to best serve you. As a local SEO, I watch this silent curse fuel the majority of negative online reviews and think to myself how much distress could be avoided if customers politely voiced complaints at the time of service. In your relationship with your marketer, your frank feedback when something isn’t right is essential! On the flip side, when a goal is met, take a moment to thoughtfully thank your local SEO. I’ve had lovely clients send me gifts as an extraordinary celebration for services rendered. That’s extremely kind, but a simple, “This really went well and I’m very happy with your work,” is an amazing psychological boost to the marketers who are working so hard for your brand’s success. 3. Grow your own local SEO knowledge You’re paying your marketers for their expertise, but your business can only benefit if you develop a working acquaintance with local search marketing that enables you to brainstorm initiatives with a confident command of the terrain. The best local SEO firms will do all they can to study your consumer base and geography, but they will never know your business or community quite like you do. If you can pair your deep market intelligence with some study of what’s possible online, you will become a much stronger company leader. Don’t know how to get started? Read The Essential Local SEO Strategy Guide and excite your marketers at your next meeting! To round up, hiring a local search marketing partner is the first step toward the business growth you desire, and you’re expecting to learn a lot. What you might not know is that your agency is likewise planning to learn a lot from you. Local SEO is one grand experiment, and smart agencies learn from every single client. It’s through working on your website, listings, reviews, social platforms, and other assets that marketers make thrilling discoveries, hone skills, and experience gratifying professional success. It’s this mutual hunt for success, in fact, that safeguards and inspires growth in the client-agency relationship. Teaming up can turn the very strenuous hike of local SEO into a navigable pathway strewn with exciting rewards. With commitments to earning trust over time, finding the right levels and styles of communication, learning together, and a basic grounding in reciprocal respect, this is a partnership you can build your local business on, and from, for years to come. Image credits: Franck Michel, Nathan Gibbs, Lisa Pompeo, Paula Reedyk, and Jason Pratt. Tweet your questions and comments about local SEO hiring using #MozBlog! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Hire the Best Possible Local SEO Agency for Your Business"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Hire the Best Possible Local SEO Agency for Your Business"
    },
    {
      "level": "H2",
      "text": "Your responsibilities to the local SEO agency you hire"
    },
    {
      "level": "H3",
      "text": "1. Know Google’s guidelines"
    },
    {
      "level": "H3",
      "text": "2. Be honest about past mistakes"
    },
    {
      "level": "H3",
      "text": "3. Do your best to deliver on your end"
    },
    {
      "level": "H3",
      "text": "4. Base expectations on your expert’s appraisal of what’s possible"
    },
    {
      "level": "H3",
      "text": "5. When dealing with Google, expect change"
    },
    {
      "level": "H2",
      "text": "Warning signs of an undesirable local SEO agency"
    },
    {
      "level": "H3",
      "text": "Before hiring"
    },
    {
      "level": "H3",
      "text": "Mid-relationship"
    },
    {
      "level": "H3",
      "text": "Post-relationship"
    },
    {
      "level": "H2",
      "text": "7 questions to ask a local SEO agency before you hire them"
    },
    {
      "level": "H3",
      "text": "1. Are your marketing practices consistent with all of Google’s guidelines?"
    },
    {
      "level": "H3",
      "text": "2. Based on what you already know about my business and market, are my goals realistic?"
    },
    {
      "level": "H3",
      "text": "3. How much time will you invest in researching my market before creating my strategy?"
    },
    {
      "level": "H3",
      "text": "4. What will you need from me?"
    },
    {
      "level": "H3",
      "text": "5. May I see an anonymized client report?"
    },
    {
      "level": "H3",
      "text": "6. Can you show me the growth you’ve created for three other clients?"
    },
    {
      "level": "H3",
      "text": "7. What is your history and involvement in your own industry?"
    },
    {
      "level": "H2",
      "text": "Mutual, sustained growth: so happy together"
    },
    {
      "level": "H3",
      "text": "1. Ask questions"
    },
    {
      "level": "H3",
      "text": "2. Communicate dissatisfaction and satisfaction openly"
    },
    {
      "level": "H3",
      "text": "3. Grow your own local SEO knowledge"
    },
    {
      "level": "H3",
      "text": "Tweet your questions and comments about local SEO hiring using #MozBlog!"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}