{
  "url": "https://moz.com/blog/how-can-mobile-seo-help-my-nonmobile-or-local-business",
  "slug": "how-can-mobile-seo-help-my-nonmobile-or-local-business",
  "title": "How Can Mobile SEO Help my Non-Mobile or Local Business? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We're often hearing about how mobile search volume is catching up to (or even overtaking) desktop search volume, so what do we do? The answer is more nuanced than you might think, and in today's Whiteboard Friday, Rand shows us a few ways forward.",
  "content": "How Can Mobile SEO Help my Non-Mobile or Local Business? Whiteboard Friday By: Rand Fishkin March 21, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 21, 2014 How Can Mobile SEO Help my Non-Mobile or Local Business? Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Google recently said that mobile search volume could exceed desktop search volume by the end of 2014. Don't panic, though; there's quite a bit more nuance to the trend than most people realize. In today's Whiteboard Friday, Rand helps us understand that nuance, and talks about how we can level-up our mobile game in ways that will benefit our businesses regardless of whether and when Google's forecast comes true. For reference, here's a still of this week's whiteboard! Video transcription Howdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week I thought it was very interesting that Google came out and said mobile search volume may exceed desktop search volume by the end of 2014, by the end of year 2014. So next year, 2015, we might be living in a world where there are more searches on mobile devices than there are on desktops and laptops, which is fascinating. But I think it's very important to take a few steps back and realize what's going on here and then apply and say, \"All right, how can mobile SEO, mobile search really help my business, even if I'm not a local-serving or a mobile-serving business?\" Well, all right. The first thing that I think is very important is in the statistic are some intricacies. They're not flaws or inaccuracies, they're just intricacies. Many searchers around the world, particularly in the regions that are growing the fastest, and we're talking about a lot of parts of Southeast Asia, the Mid-East, Africa, South America, underdeveloped parts of North America, and Europe even are getting mobile before they get desktops and laptops. It's also the case that many young people are using mobile devices before they're using desktops and laptops, particularly in age groups where they're not doing professional kinds of work yet. So it's often the case that you have to ask yourself, \"Well, who really are the people who are really accounting for this growth?\" It could very well be that they are not in your target demographic, psychographic, age range, all these types of groups, geographic groups. It's also the case that a lot of mobile devices now are offering a close-to-laptop experience. I mean one of the things that I was shocked by mobile not really changing all that much dramatically. It did have a lot of big changes and has had a lot of big changes on the world of technology and the world of how we use the Web and software. But one of the things that I was surprised about that didn't happen is that it hasn't taken away from those things. In a lot of ways that's because the experience is so close to what you get with a desktop and laptop, particularly with very advanced devices. You can do so many of the things, close to almost of the things that you could do with a desktop or laptop. I almost think of my mobile device as just as a smaller, slightly-less-convenient-for-long-typing laptop. It's pretty much like that. So as you're looking at the statistic, I think that a lot of companies, a lot of executives, a lot of marketing folks are going, \"Oh my god, what's our mobile strategy?\" It is good to be asking that question, but you might not want to panic. One of the things that we did recently at Moz is we took a look at what is the percent of people who have ever tried to access our websites via mobile devices, and it turns out the percent was shockingly low. It was like 3% or 4%, I think less than 4% of people even today, which is up only slightly from last year, when it was like 3.5%. Now it's like 3.7% or something of all of our visits come via any type of mobile device. We don't have responsive design or a great mobile experience on many of our pages, but we do on a few things, for example, on my personal blog, moz.com/rand. So we looked at, \"Hey, is there a difference between people accessing moz.com/rand, which is sort of very mobile-friendly versus the main blog, which is not mobile-friendly,\" because that might tell us something about our audiences. We looked and there is a difference. It's the opposite of what you would expect. The responsive-design-friendly one, my blog, gets an even lower percent of its traffic from mobile devices than the main Moz blog does. So really mobile is not, at least not yet our audience. We're still thinking about it of course, and in fact responsive design is on the list of the Inbound Engineering team. So in the next few months you should be seeing a mobile-responsive site for the very small percent of you who do like to browse Moz on mobile. Doing that type of work, figuring that out, and looking at trend lines as well can be really helpful. The other thing I might urge you to do is think very carefully about, \"Hey, I might want to be buying some advertising on places like Google and Facebook,\" and looking at the percent of those advertising bodies that are on mobile versus desktop, because it could be the case that you've just trained your customers. For example, Moz, maybe we've trained our customers not to browse us on mobile because we don't have a great mobile experience, and that's what biasing. So I would urge you to think about who these groups are, whether they're in your world, those kinds of things, before you go figuring out whether this is a critical question to answer. The chances are though eventually it will be an important question to answer, and when it is, you need to think a little bit about the mobile user experience and what a mobile user can do for your business, especially if you're not particularly focused on local or mobile types of searches today. So a mobile user has these sort of buckets that I like to put into what they're doing with their device when they perform searches in Google or in Bing. Those are sort of needs: I must find this place right now. I must get the hours for this. I must know when it's open. Their wants: I'm interested in this. I want to price compare something. Their curiosity: I think probably almost half of the queries that I do have to do with who was in what particular movie at a dinner table. I suspect many of you are the same. And then there are fun sorts of things as well, people looking for games, looking for distractions. I browse Reddit and Hacker News, which I guess is some combination between work and fun, a lot on my phone, particularly if I'm in a store with my wife and she's shopping and I don't need to go shopping right then. This is a little bit different in fitting into the classic informational, navigational, transactional models of search usage. But in mobile you can actually think of the vast majority of mobile queries falling into the informational and navigational. Transactional is still very low. E-commerce rates, conversion rates, email entry rates, a lot of those things where people do something and they enter data in and they complete some sort of call to action on mobile are still way, way, way lower than they are on desktop. The caveat to that being if you're targeting a group of folks who mobile is their primary or only device, be aware that these rates may be much, much higher. If you're dealing with US consumers who have mobile and have desktop/laptop, well, then transactional rates are likely to be much lower, and navigational and informational are most of the things that you're going to want to serve. Now, when it comes to mobile, I really think of mobile in a lot of the same ways that I think about social from a funnel perspective. So if I'm thinking about the marketing funnel and I have discovery, my first discovery of a brand, my first acknowledgement of its existence, and then my first experience, my first visit to that website, most of that mobile SEO should be done around these two things -- the discovery and the first experience. I'll talk about some tips and ways to do this. But what I really mean here is that you want visitors who come via these channels, who come via mobile search, in particular, to want to come back later, and that means providing an experience, providing a brand experience, providing a message that's really clear about what your company, product, information can offer them and why they should return in the future, why they should like you and trust you, why you're a good site for them to check out in the future when they might have more of those transactional things, because chances are they're not going to do them on that first mobile experience. Now, a few tips for mobile SEO. The first one maybe is the most critical. I worry most about that experience for informational and navigational searchers, and because I worry about that, there's actually a way to figure out which pages are the most important. So what I can do, you can sort in your Google Analytics or whatever analytic system you've got, you can sort pages receiving traffic from search engines by mobile device. Then you'll get kind of a list of URLs. You get that list of pages. These are the pages where Google sends traffic from mobile devices to my site today. Now, in addition to obviously fixing up and making sure that these mobile experiences are positive, the caveat to this is Google does have some biasing on mobile. So they do look and they'll say, \"Hey, this site is not providing a great responsive design. The pages aren't loading fast. It's not targeted to the geography that we know the phone is in,\" all these kinds of things, and so they may be actually reducing your mobile traffic. Thus, it might pay to do some experimentation on, \"Hey, let's take a group of these pages that are down here, that aren't receiving much traffic. Let's do some mobile SEO, and let's see what happens, see if we can't improve that. \" If that is the case, implementing some mobile SEO best practices, speeding up the pages, putting a responsive design in place, etc., if that can improve these, then you know what your opportunity cost is and where you might want to invest. The second thing, you'll see this as a mobile user, and many times pushing or forcing an app download on someone, while it does mean that you get them more into your fold potentially, assuming they ever use the app, it's rarely the best user experience. In fact, oftentimes some of the folks who've done some of the most extensive testing, the online dating world is one of these where they've done a lot of testing of this, what they've found is providing a great experience or pretty good experience on mobile through the Web for searchers and then having just a slight message that is, \"Hey, we have an app. You can do even more with our app,\" that kind of thing, almost like an advertisement on the website actually works better than sort of the experience you get from LinkedIn or Yelp, where every time you visit on your mobile device they try and force you to download. Now, LinkedIn and Yelp are very different because they are very mobile-centric and they do want that capture. Perhaps they are willing to sacrifice some of the usability and user experience. But you should be aware that Google might be looking at that, and if they're seeing that pogo-sticking, people jumping away from the Yelp or LinkedIn page back to the search results, remember they might be downgrading and not letting those pages rank so well over time. Third thing, even if you don't have responsive design, and there are still many, many companies like Moz who don't yet have responsive design, you can do a lot of things to improve the performance of your mobile pages, and that includes obviously speeding up download speeds, but limiting ads, particularly overlays. A lot of folks, especially in the technology and marketing industries and in a lot of B2Bs, have those popovers, the overlays that ask for an email capture or ask you to dismiss a message or those kinds of things, that can be a very frustrating experience on mobile because it's so hard to close those. You have to sort of zoom in on my phone and then like hit that little tiny x. Extremely annoying, you can see those pogo-sticking rates going up again. So even just surfing around with your mobile device on your own site, figuring out if you should turn those off, that can have a positive impact. Then number four, a lot of the testing that we've seen from folks who do conversion rate optimization is that with mobile limiting choice is even more valuable than it is on a desktop/laptop experience, and I think part of the reason for that is that you don't have the opportunity to do as much investigation as easily and as quickly on a mobile device as you do a desktop/laptop. So limiting the choice on all sorts of things, on navigation, limiting choice on calls to action, limiting choice on sharing, for example, it can be really helpful. So a lot of the time, with content marketers, what you're doing with mobile is trying to attract people whose first experience is going to be, \"Wow, this content is really interesting. I might share this. I might Tweet it. I might share it on Facebook. I might put it Instagram.\" Well, maybe Instagram not so much, but LinkedIn, Google+. So that is somewhere where we've seen some of the very, very smart content sites, people like BuzzFeed and Upworthy, what they do is they look at how mobile traffic shares, and they say, \"You know what? We're actually not going to have four buttons. We're only going to have one button. It's only going to be the Facebook Share button,\" or \"It's only going to be the Tweet button,\" or \"We're going to look at how the visitor came to the page, and then we're going to provide a sharing call to action based on that.\" So for those of you who are doing content marketing, you might want to consider limiting that choice as well. There's lots and lots of other things that we can do with mobile SEO, but I think this is a good starting point and, especially considering Google's announcement here, a timely one. So I look forward to all of the advice and comments down below, and we'll see you again next week for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Can Mobile SEO Help my Non-Mobile or Local Business?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Can Mobile SEO Help my Non-Mobile or Local Business?"
    },
    {
      "level": "H2",
      "text": "Video transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}