{
  "url": "https://moz.com/blog/how-to-remove-the-google-filter-when-searching",
  "slug": "how-to-remove-the-google-filter-when-searching",
  "title": "How to Remove the Google Filter when Searching - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Early last week, Google removed its 10 words per query limit, and increased this number to 32. Some suspect this was to combat MSN Beta's ability to search up to 32 words per query. Whatever the reason, the new systema appears to have re-openend an old chink in Google...",
  "content": "How to Remove the Google Filter when Searching Search Engines By: Rand Fishkin January 23, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 23, 2005 How to Remove the Google Filter when Searching Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Early last week, Google removed its 10 words per query limit, and increased this number to 32. Some suspect this was to combat MSN Beta's ability to search up to 32 words per query. Whatever the reason, the new systema appears to have re-openend an old chink in Google's sandbox armor. Searches performed with more than 16 words in the query now return what SEOs have been calling, \"non-sandboxed\" results. Sites that are currently suffering from the Google penalty that affects many recently (post-March 2004) optimized sites are revealed to be in the top SERPs (or in lesser cases, much higher in the SERPs than they are for the normal keyword search). Naturally, this doesn't mean any additional traffic for sandboxed sites, but it does allow SEOs a brief window to study the results Google is providing and try to find a reasonable difference between affected sites and non-affected sites. In order to get results for a 'normal' search, simply add 15, 14, 13, etc. -asdf onto your search query, as these additional parameters will not actually filter anything, but will get your search query up to the required number of terms. A sample of some searches I have already performed are listed here. As usual, a good thread on the subject is providing some insight and commentary over at SEOChat. Much thanks to Dazzlindonna for pointing this out to me through email while I was taking an NFL vacation from the world of SEO. I will be attempting to study the issue in-depth by comparing the results for as wide a variety of searches as I can. Hopefully I will be able to issue a report on the 25th (Tues.) or 26th (Wed.). Initial looks at the searches, however, suggest to me that the filter is not likely to be removed anytime soon. The results appear to be lower in quality on average than Google's normal results, which is bad news for those of us with a sandboxed site. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Remove the Google Filter when Searching"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Remove the Google Filter when Searching"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}