{
  "url": "https://moz.com/blog/how-to-use-memes-to-build-easy-backlinks-traffic",
  "slug": "how-to-use-memes-to-build-easy-backlinks-traffic",
  "title": "How To Use Memes to Build EASY Backlinks & Traffic - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Link building. Social engagement. Viral marketing. These are all topics that we grapple with as SEO professionals and inbound marketers, and it can be difficult to come up with strategies to achieve all this from project to project or from client to client. But what if I were to tell you that…",
  "content": "How To Use Memes to Build EASY Backlinks & Traffic Link Building By: Takeshi Young March 15, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Takeshi Young March 15, 2012 How To Use Memes to Build EASY Backlinks & Traffic Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Hey Mozzers, My name is Takeshi and I'm a Technical SEO Analyst for the in-house SEO team over at Become.com. During my spare time I like to work on my own projects, and lately I've stumbled across a technique that's been working surprisingly well for me involving memes. I hope you can take some ideas away from this post that you can incorporate into your own SEO and viral marketing campaigns! How To Use Memes to Build EASY Backlinks & Traffic Link building. Social engagement. Viral marketing. These are all topics that we grapple with as SEO professionals and inbound marketers, and it can be difficult to come up with strategies to achieve all this from project to project or from client to client. But what if I were to tell you that there's a simple strategy that you can follow to achieve all of these objectives, an easy formula where all you have to do is fill in the blanks, and watch the backlinks and social media traffic roll in? Interested? Read on. An Introduction To Memes What is a Meme? Memes, or more specifically internet memes, refer to any concept that spreads across the Internet. This can include stories, quotes, images, videos or audio, but for the purposes of this article we'll refer specifically to images. The word \"meme\" comes from the 1976 book The Selfish Gene by Richard Dawkins, where the term meant a unit of cultural knowledge that is passed between people. On the Internet, the term has come to be synonymous with funny images with clever (or not so clever) captions, first popularized by LOLCats. So why use memes? Memes have two important properties that make them the ideal tool for social media and link building campaigns. 1) Memes Are Viral The first property of memes is that they're viral. For all the power and potential of the Internet, most people use it primarily for entertainment and distraction, which is why sites like Facebook and YouTube are so popular, and companies like the Cheezburger Network have built entire Internet empires from funny pictures and videos. Memes are ideal fodder for entertainment on the web because they're quick and easy to consume, which is crucial given how short people's attention spans are. Memes are also typically humorous in nature, and people love sharing a good joke. Just look at your uncle who always mass-emails jokes to his entire contact list, or your friends spreading the latest \"What People Think I Do\" pictures on Facebook. People like being entertained, and if they find something particularly entertaining, they'll pass it along to their friends, who in-turn pass it on to their friends, and so-on and so-forth. That's how content goes viral. 2) Memes Are Easy To Make Ok, so memes have a lot of viral potential, but that doesn't get us anywhere if we can't make them. Fortunately, memes are easy to make, perhaps a lot easier than you think. All you need to make a basic image meme are the following: 1) A basic understanding of Photoshop 2) A sense of humor 3) That's it! If you don't know how to use Photoshop, fear not. There are free online tools out there such as Meme Generator and Quick Meme that allow anyone to whip up a meme in just a few seconds. The online meme creator on MemeGenerator.net Point two is a little trickier, but fortunately a sense of humor is something that can be improved with practice. One resource I've found particularly helpful for honing my sense of humor (such as it is) is the Humor Power blog, which provides excercises, contests, and case studies on how to strengthen your funny bone. The Meme Creation Process With the tools mentioned above and a good sense of humor, putting together memes is super simple, but how do you come up with ideas for a good meme? As Pablo Picasso said, \"Good artists copy, great artists steal.\" Coming up with a completely new idea that goes viral is very difficult, and to some degree a matter of luck. Borrowing an idea that is already popular and repurposing it for your audience is much easier. One of the best resources for finding memes is Know Your Meme, which is a veritable encyclopedia of internet memes. On Know Your Meme you can find a catalog of memes, popular memes, and the history behind the various memes that are floating around the web. Meme Generator and Quick Meme also have sections for popular memes as well. Take a look at some of the examples, find the ones that tickle your funny bone, and adopt it to suit your niche. Memes in a nutshell are formulas for jokes that you just plug in with niche specific details to fit your audience: The \"Dating Site Murderer\" Meme 5 Tips For Creating Memes Know your subject - The better you understand your niche, the easier it will be for you to create memes that are funny for your audience. Study the experts - Before I begin creating a meme, I like to immerse myself in that meme by browsing through 50 or so of the most popular memes of that type. Doing so gives me an idea of what others have done that's worked, and allows me to grok the particular joke formula and create my own variation. Make several drafts - If you've stumbled across a funny idea, it's helpful to come up with several versions of the joke to get just the right wording. Memes are a little like poetry: word choice is very important. When in doubt, go with the shorter option: brevity is the soul of wit. Ask for feedback - Sometimes it can be helpful to ask others for feedback on lines you've created to get another perspective on them. They may even have suggestions for alternatives that may be funnier than the original. However, use your own judgement to make the final call: everyone has a different sense of humor, if it's funny to you be confident and go with it. Have fun! - If you're having fun while creating your memes, it will help keep the creative juices flowing, and chances are your audience will have fun too once they read them. Don't take memes too seriously, they're meant to be silly Finding Trending Memes Doing the above is enough to get you some link juice and traffic (using the methods I'll detail below), but if you really want to create a meme that goes viral, you need to identify trending memes, new memes that are just starting to gain in popularity. This is because novelty plays a big part in viral marketing; not many people are going to want to share something that's three years old or that everybody's already seen. The best place I've found for discovering trending memes is Reddit. Reddit, if you're not familiar with it, is a social bookmarking site where people submit interesting content, which gets voted on by other users of the site. Many memes originate or are popularized on Reddit, and viral content generally ends up on Reddit first before it spreads to more mainstream sites like Facebook. If you check out what's popular on the Reddit homepage today, you'll get a good idea of what's going to be popular a week or two later on other sites. The strategy here is to find content that's gaining in popularity before your fans do, put your own twist to it, and then share it with them. Beyond that, it helps to just be aware of any funny content or memes that you run across while surfing the web. Are you starting to notice a certain image being shared a lot on Facebook? Is there a picture you've come across that was just hilarious? Chances are if you found it funny, so will your friends. Start thinking of how you can create your own version of that for your niche. Spreading Your Memes Ok, so far we've talked about how to create our own memes by taking a popular or trending meme, and then altering it so that it's applicable to our niche. Now let's talk about how you can use social networks to help your memes go viral. As you know, there are many social networks out there, and each has its own strengths and weaknesses. Let's take a look at the most popular ones, and see how they stack up. Facebook You can't talk about social networks without mentioning Facebook, simply because it's the largest one out there, by far. Facebook at last count had close to one billion users-- that's 1/6th the population of the planet, and 1/3rd of all Internet users! If you want to reach the greatest amount of people possible with your memes, you want to put them on Facebook. The downside with Facebook is that most people on Facebook don't have their own websites, and even if they do, they're probably not going to link to your content unless they're really moved by it. So unless you're lucky, you're probably not going to receive many backlinks from a Facebook viral marketing campaign. On the plus side, it's a great way to build your brand, get likes and fans for your Facebook pages, and drive massive amounts of traffic. As an example, this is a little image I put together for one of my salsa dancing websites: I had noticed that this meme was trending on Facebook, so I created my own version and posted it on our website's Facebook page. Within three days we had over 600 comments, 900 new fans, 3800 shares, and 6500 likes. This is with zero promotion, for something that I whipped up in Photoshop in 15 minutes. According to Facebook's analytics, the image has been viewed more than 400,000 times by over 200,000 people over the world. Now that's viral! A couple days later I made another image for a different niche and posted it on my wall. Within days it too had garnered 100 comments, 570 shares, and 1100 likes. Again, all I did was identify a trending meme, create a version of it that resonated with a specific niche, and posted it on Facebook. The magic of social networking did the rest. With a good meme, this is a simple feat to replicate. If you have a big enough social circle or fan page, just posting it there may be enough for it to go viral. If you don't have many connections on Facebook, then just seed the meme to the the top Facebook groups and pages for your niche. Then sit back and watch it spread. Twitter Twitter is a smaller social network than Facebook (roughly 300 million users), but it can still be a significant way of spreading viral content. Twitter is the social network I have had the least amount of experience with, so I won't say much about it here, but from my experience it can be difficult to spread content on Twitter unless you already have a big following. On the flip side, if your content is picked up by a big influencer, then it has the potential to spread far via retweets. Twitter has the same problem as Facebook concerning getting backlinks (unless you believe Tweets influence search rankings). Also, many niches don't have active Twitter users. Stumbleupon Stumbleupon users LOVE images and other quickly digestible content, and memes fit right into that category. Do submit all your memes to Stumbleupon. At close to 20 million users, Stumbleupon can send you thousands of visitors a day if your meme gets picked up, although the traffic tends not to be of very high quality. If you're monetizing with CPM ads, that's no problem, otherwise try to get them to subscribe to your blog so you can get them coming back. Pinterest I don't really use Pinterest because I don't meet the requisite number of X chromosomes, but Pinterest is hard to ignore because of its massive growth and 10 million+ users. Like Stumbleupon, Pinterest users love images and humor, so memes are a good a fit. The majority of Pinterest users are women, so keep that in mind as well. The only downside to Pinterest is that like all of the aforementioned social networks, all link back from Pinterest are nofollow. Where Are The Backlinks?? So far the sites I've mentioned will get you viral traffic and social engagement, but few backlinks. Let's take a look at a couple sites that will get you both. Reddit I already mentioned Reddit earlier as a place to spot trending memes, and it's a great place to submit them as well. Reddit has usurped Digg as the largest social news site in the world, with over 35 million unique visitors per month. You can submit memes to Reddit by submitting them to the appropriate subreddit (read: subcategory). If your submission makes it to the front page of that subreddit, you stand to get a lot of traffic, as well as a dofollow backlink. You can submit your meme to multiple subreddits, so do make multiple submissions as long as they're relevant and not spammy. Reddit users tend to be savvier than web users as a whole, and they don't like links that are overly self-promotional or commercial in nature, so keep that in mind when considering your submissions. Also, you have a much better chance of making it to the top of smaller subreddits and getting a backlink, however larger subreddits have higher pagerank and more users, so it makes sense to submit your memes to both. Tumblr Ok, I've saved the best one for last: Tumblr. If you don't have much experience with Tumblr, don't worry -- I hadn't really used it myself until recently (I'm a diehard Wordpress fanatic). However, after seeing how easy it is to spread content virally and build backlinks with Tumblr, I'm hooked. So what is Tumblr? The best way to describe Tumblr, is that it's a hybrid of a blog platform and social network. It's similar to Pinterest in many ways-- you can post content on your tumblrog (blog/pinboard) which other people can then like or reblog (re-pin/share) on their own tumblrs. The main difference is that with Tumblr, reblogs are DOFOLLOW. Think about that for a minute. Tumblr has all the viral potential of the other social networks mentioned above (they're closing in on 20 million users), but whenever your content is shared, you get a dofollow backlink. Imagine if every time someone shared your stuff on Facebook, or retweeted your tweets, or re-pinned your pins, you got a backlink. That's exactly what happens with Tumblr. It Gets Better But that's not all. Tumblr is the first blog platform/social network that I have seen where tags actually matter (ok, hashtags sort of matter on Twitter, but on Tumblr they're even more powerful). One of the main ways that users can browse for content on Tumblr is by searching for tags. They can also subscribe to tags so that any content that's tagged with their interests shows up in their dashboard (Tumblr parlance for news feed). As an added method of discovery, Tumblr shows a random tumblrog in the sidebar of everyone's dashboard. This is very powerful. All these features make it incredibly easy for your content to get shared with other people, even if you have a brand new blog with zero following. Case in point: just last week I started a tumblrog called Salsa Memes, and literally within three seconds of making my first post, I had two reblogs (read: backlinks) and one like. This is with a completely brand new site, with zero followers, and zero promotion. That something you just can't do with any other blog platform. As of this writing, the tumblrog has 87 reblogs, and another salsa dancing tumblrog that I put together a few days later currently has 42 reblogs. That's a combined 129 backlinks for two sites that are less than a week old, all completely white hat, without any effort or promotion on my part (there are some greyhat methods for exploiting Tumblr, but I won't go into those here). Now the one caveat about these links, is that they're not necessarily of the highest quality. Many blogs that reblog your content will have no pagerank, and will not be related to your niche. Additionally, reblogging by its nature generates a lot of duplicate content, so a lot of the links you may be getting may not even be indexed. However, these concerns aside, these links in sufficient quantity can add up. I started another tumblrog about a month ago that quickly went viral on Tumblr and Twitter, and within weeks had acquired a PageRank of 3. The tumblrog that inspired it, called Programmer Ryan Gosling (which was started only a few weeks earlier), currently has a PageRank of 5. Not bad for a two-month old blog full of geeky pick-up lines! Granted, both these blogs also have links from outside Tumblr, but that's the thing about memes, they spread like viruses (and the hundreds of Tumblr backlinks certainly don't hurt). Ryan Gosling bears a resemblance to a certain Mozzer in this pic One more thing about Tumblr before I wrap up-- like I mentioned earlier, Tumblr is part-social network too, which means people can follow your tumblrog to receive the latest updates from you. That means that the longer you keep producing memes, the more of a following you gain, and the further each new meme has the potential to spread. If you acquire enough followers, people will start submitting their own memes to you (just check the \"Let people submit posts\" box in your settings), allowing you to use UGC to build even more backlinks. Wrap-Up This post ran a little long, but hopefully it's inspired you to try your hand at creating your own memes to further your linkbuilding and viral marketing campaigns. And sign-up for Tumblr, you'll love it! Here are a few closing thoughts: Submit your content to ALL of the social networks mentioned above. Once you have something good, seed it on Facebook, Twitter, Stumbleupon, Pinterest, Reddit, and Tumblr. By spreading your memes wide, you have a better chance of going viral Feel free to explore other social networks beyond the ones I mentioned in this article to further your social reach If you create video related memes, you can submit them to YouTube, another massive traffic source Beyond social networks, use traditional outreach like e-mail and blogs to build solid backlinks Try not to overuse this tactic. Like anything else, the novelty wears off if everyone does the same thing over and over again (infographics, anyone?). Be original, be funny, create something of value, and make memes just one of the tools in your link building and viral marketing toolbox That's it! Happy memeing, and if you have any questions, please post them in the comments! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How To Use Memes to Build EASY Backlinks & Traffic"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How To Use Memes to Build EASY Backlinks & Traffic"
    },
    {
      "level": "H1",
      "text": "How To Use Memes to Build EASY Backlinks & Traffic"
    },
    {
      "level": "H3",
      "text": "An Introduction To Memes"
    },
    {
      "level": "H3",
      "text": "1) Memes Are Viral"
    },
    {
      "level": "H3",
      "text": "2) Memes Are Easy To Make"
    },
    {
      "level": "H3",
      "text": "The Meme Creation Process"
    },
    {
      "level": "H3",
      "text": "5 Tips For Creating Memes"
    },
    {
      "level": "H3",
      "text": "Finding Trending Memes"
    },
    {
      "level": "H2",
      "text": "Spreading Your Memes"
    },
    {
      "level": "H3",
      "text": "Facebook"
    },
    {
      "level": "H3",
      "text": "Twitter"
    },
    {
      "level": "H3",
      "text": "Stumbleupon"
    },
    {
      "level": "H3",
      "text": "Pinterest"
    },
    {
      "level": "H2",
      "text": "Where Are The Backlinks??"
    },
    {
      "level": "H3",
      "text": "Reddit"
    },
    {
      "level": "H3",
      "text": "Tumblr"
    },
    {
      "level": "H3",
      "text": "It Gets Better"
    },
    {
      "level": "H2",
      "text": "Wrap-Up"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Takeshi Young\n          \n            Takeshi Young\n          \n            Takeshi Young"
}