{
  "url": "https://moz.com/blog/how-to-name-a-webbased-business",
  "slug": "how-to-name-a-webbased-business",
  "title": "How to Name a Web-Based Business - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There's no doubt that naming a business, particularly an online business, is an incredibly frustrating task. A number of parallels can be drawn between this process and the web design hangups Matt discussed in July. Recently, a new friend from San Jose's SES show, John Anderson, ...",
  "content": "How to Name a Web-Based Business Online Advertising By: Rand Fishkin September 11, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 11, 2006 How to Name a Web-Based Business Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. There's no doubt that naming a business, particularly an online business, is an incredibly frustrating task. A number of parallels can be drawn between this process and the web design hangups Matt discussed in July. Recently, a new friend from San Jose's SES show, John Anderson, recounted his struggles publicly: I hope I never think about a company name again. Chao and I have collaborated since way back in 1999, and we’ve never had a single contentious discussion till we butted heads on the topic of company name – and by default association – our URL. It was painful, hugely educational experience... ...Yes, the name is and always will be a sacred word to us. Sure, it will ultimately be a single-word embodiment of our brand identity, but today, it is just one little tile in the mosaic of brand identity. Here’s the kicker… early on – that mosaic is sparsely populated with just traces of ideas, some alpha code, but no history, no customers, and no passionate community. When you see a mosaic of one tile, you just see one tile - so you want that tile to be shiny, beautiful on it’s own. This is the paradox of a startup naming exercise. I concede that this process is agonizingly harsh and oftentimes filled with animosity and self-doubt, especially as more people are involved in the process. We got lucky, stumbling on 'SEOmoz' after A) agreeing on what we wanted our brand to represent and B) searching for the shortest combination of words that got that point across and included \"SEO.\" Since then, it's been remarkably easy to grow into the name and have it absorb everything we hoped it would (though I sometimes wish SEO could be more inclusive of online marketing as a whole). Not everyone is so lucky, and since I've helped to name more than a few web-based businesses over the last 9 years, I thought it would be valuable to give a list of items I seek when creating a new one: The Ideal Name has no PeersWhen developing a name, it's preferable that a Google search for that unique term returns fewer than 2000 results. If you can find a name that produces absolutely no results whatsoever, you've got something truly amazing, especially if it fits the rest of the criteria. A completely unique name can be tracked, online and off, with remarkable accuracy, and there's never any confusion about the reference when it comes up in a blog, a conversation or a phone call. Zillow, eBay, Google, Skype & Firefox are all examples of \"peerless\" company names. Accurate Topical AssociationWhen you hear names like Ning, Frappr, Squidoo or Altria for the first time, there's no way to make an association between the word and what the company's field of operation. This is in contrast to firms like PayScale, Farecast, Travelocity and StumbleUpon. My preference has always been for names that have a topical relationship to the industry or focus of the firm - even if it's not completely obvious, it makes name recognition and association easier, even if you've only heard of the company once. In All Things, BrevityThe fewer the letters in the name, the happier I am. Frankly, this one is easy to explain - the shorter your name, the easier it is to type in the domain or perform a search. It also eases the process of spelling the name over the phone, writing it in emails, making it memorable, etc. Clear, Obvious SpellingThis one has been lost in the Web 2.0 generation, and even SEOmoz itself runs into spelling problems at times. Names like Amazon, Yahoo!, Gateway & IBM fit this criteria well, while Flickr, Del.icio.us, Last.fm and Digg are either seplled misleadingly, or make it difficult for unfamiliar users to type in their URL. UnregisteredObviously, owning the .com domain for your business name is critical - if someone already has it, the process to taking that name from them is long and arduous. It's also a good indicator that your name isn't entirely unique, so unless it's a case of cybersquatting and you can buy the name, keep searching. Keywords in the NameBeing an SEO, I can't help but be tempted to use keywords in the name and URL of a company. This works very well in certain instances, i.e. SEOmoz, Copyblogger, Findlaw, Open Directory, HowStuffWorks, etc. It's not universally applicable, though, and a healthy dose of common sense is required, so please don't try including \"jackson hole real estate\" in the name of your company. Brand WorthyBefore you have a name, you've got a business model and a unique brand identity - the qualities that set your business apart from its competitors. Before you decide on the name, make sure that it fits logically and emotionally with these ideals. I.e. Just because the name \"darkstar\" sounds cool, doesn't mean it fits with providing open-source access to physics data. In this case there's a logical connection with the subject, but a conflict with the brand. CharismaticThis is the toughest of all the criteria - a great name has to carry emotional power with it. Not everyone has to agree, and this criteria is frequently subjective, but the target of the charismatic quality IS NOT your users - it's you. If you (and your business partners) have a name that you believe in, that you want to represent you and that you feel confident and comfortable sharing with that mean uncle who's always giving you a bad time - bingo! You've got your name. I'd love to hear more ideas on naming conventions, and I'm sure there are more than a few Silicon Valley entrepreneuers who'd appreciate it, too. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Name a Web-Based Business"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Name a Web-Based Business"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}