{
  "url": "https://moz.com/blog/how-sitelinks-are-quietly-costing-you-conversions",
  "slug": "how-sitelinks-are-quietly-costing-you-conversions",
  "title": "How Sitelinks Are Quietly Costing You Conversions - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "“It’s official, Google is broken and my career is over. Time to hide under my desk.”\n\nA bit extreme? Yes. But, if you saw what I saw a month ago, your reaction would’ve been exactly the same. Let me explain.",
  "content": "How Sitelinks Are Quietly Costing You Conversions Technical SEO By: PracticeFusion March 19, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: PracticeFusion March 19, 2012 How Sitelinks Are Quietly Costing You Conversions Technical SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. “It’s official, Google is broken and my career is over. Time to hide under my desk.” A bit extreme? Yes. But, if you saw what I saw a month ago, your reaction would’ve been exactly the same. Let me explain. It was 5:55 pm and I was getting ready to go home after a good day’s work at Practice Fusion. “Let’s just do a quick Google search for Practice Fusion so I can give myself a high five before I head home.” That’s when the panic started. Here’s what my non-personalized search for Practice Fusion pulled up in position #1: Do you see what I see?! Ranking #1 for the term Practice Fusion isn’t our high-converting, very helpful homepage….it’s our rarely looked at, poor converting Executive Team page! OMG to the extreme! Plus, where the heck did our Google+ page go? First thought: “Breathe. Crawl out from under desk.” Second thought: “Maybe this has something to do with the fact that Google knows I’m in San Francisco.” “Let’s change that to ‘United States’ and see what happens.” Aww, that’s more like it. Seeing these results is like being reunited with a best friend, or some really good hot chocolate – it’s warm and soothes the soul. PracticeFusion.com is back on top, and our Google+ profile is showing up. Nice. Then I tried changing my city to Oakland, Palo Alto, Mountain View, and New York. Every time I got my good results. Why the heck was the location of San Francisco giving me such a hard time? “Are you responsible for this Lou Seal?!” “Okay. Good.” Still in a bit of disbelief I wandered over to Google Analytics to check a few things. First, I wanted to see where natural search visitors to our Executive Team page were coming from. Were most of them from San Francisco? Short answer: yup. Next, I wanted to see if the natural search visitors to the Executive Team page were coming in from the Practice Fusion keyword. It turns out that ALL visitors to the Executive Team page came in by searching for Practice Fusion. Clearly, something is happening. Or, as Martin Lawrence would say… Normally I’m all for Google local results, but this just seems wrong. Why would someone in San Francisco want to see our Executive Team page over our home page? It seems like a really bad user experience, especially since the Executive Team page has less authority (by far) than our home page. Executive Page Home Page Why was Google doing this? Was it something I said? Apparently, Google thinks that the Executive Team page will be a good result for people in San Francisco. But, why do they think this? The answer to this question is the same as the answer to “How many licks does it take to get to the center of a Tootsie Roll pop?” “The world may never know.” However, after a lot of research, here’s my best guess. And, believe me, it’s a bit surprising. Under certain conditions, Google will swap a sitelink for the main search result. Yup, I said it. Here’s how I tested it. On February 7th I went into the “Sitelinks” section of Google Webmaster Tools and demoted the Executive Team page as a sitelink for our homepage URL. I was working a hunch. After a few weeks went by, I looked at the results. Visits to the Executive Team Page from San Francisco As you can see, about a week and a half after demoting the Executive Team page from sitelinks, it no longer shows up as the first result (even if you’re in San Francisco) and the visits to that page go to zero. This must mean that Google feels comfortable bumping a sitelink up to the main search result! But why bump up the Executive Team Page? It’s only a guess, but it looks like it’s because of the sites linking to that page. Of the external sites with links pointing to the Executive Team page, 60% of them have “San Francisco” at least once on the page. Of the sites linking to our home page, only 29% of them mention “San Francisco”. Perhaps this is influencing Google. Conclusions Under certain conditions, Google will bump a sitelink up to the main search result. Potentially, and sneakily, costing you conversions. One of those conditions might be the content of the sites linking to you and the location of the person searching. Suggestion Look in analytics to find the landing pages for your branded searches. If they’re not going to your home page, it might have something to do with your sitelinks. Check it out, you might just save yourself some conversions. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Sitelinks Are Quietly Costing You Conversions"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Sitelinks Are Quietly Costing You Conversions"
    },
    {
      "level": "H3",
      "text": "Why was Google doing this? Was it something I said?"
    },
    {
      "level": "H3",
      "text": "Under certain conditions, Google will swap a sitelink for the main search result."
    },
    {
      "level": "H3",
      "text": "Conclusions"
    },
    {
      "level": "H3",
      "text": "Suggestion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "PracticeFusion\n          \n            PracticeFusion"
}