{
  "url": "https://moz.com/blog/how-a-viral-post-got-5-680-visitors-in-one-day-a-behind-the-scenes-look",
  "slug": "how-a-viral-post-got-5-680-visitors-in-one-day-a-behind-the-scenes-look",
  "title": "How a Viral Post Got 5,680 Visitors in One Day (a Behind the Scenes Look) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If you think creating viral content is beyond your grasp, think again. By following a few simple steps, you can vastly increase site traffic and social sharing.",
  "content": "How a Viral Post Got 5,680 Visitors in One Day (a Behind the Scenes Look) Content Marketing | Advanced SEO | Blogging By: Jeanne Pi July 13, 2015 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Jeanne Pi July 13, 2015 How a Viral Post Got 5,680 Visitors in One Day (a Behind the Scenes Look) Content Marketing | Advanced SEO | Blogging This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. It was pure joy and exhilaration as I monitored the traffic in real-time. Traffic coming in from all over the world. It felt freakin' AWESOME! 5,680 visitors on that first day... on a site that was less than a year old. It almost felt like I'd won the lottery, except I'd known it was going to happen. Not with 100% certainty, but I'd had enough confidence it was going to happen that I upgraded my server at the last minute. I'd heard enough horror stories about sites crashing due to an unexpected surge in traffic that I wasn't going to let it happen to me. So how did I do it? And how did I know a post I'd written was going to go viral? This is a case study of how I leveraged a data-driven content marketing strategy to get 5,680 visitors in one day. I will outline the steps I took to create the post, including the emails I sent to pitch major media outlets so you can see the exact language I used. But first, here are the stats for the first week that the post went live: Here are the sources of the referral traffic for that week. As you can see, the bulk of the traffic came from Hacker News and Twitter shares: This post made the front page of Hacker News, Fast Company, Inc., Mashable, TechCrunch, and VentureBeat (which also syndicated my content). I also garnered mentions in Forbes, Wired, CNN and Reuters. My post ended up getting over 1,600 social media shares (not to mention the thousands of shares on the above media outlets). It helped boost my domain PageRank to PR 4, and the post itself has a PR 5. According to Majestic's Site Explorer, this post currently has 1,745 external backlinks from 202 referring domains. But before I get to the exact steps I took to create this piece of viral content, it's important to point out why you would want to create data-based content. Why create data-based content? Because you'll like be creating something original. And because data-based content makes you more credible. There is so much regurgitated crap out there (many bordering on plagiarism) that if you can write quality content backed up by research and data, you are automatically more credible in the eyes of the reader. You can then further demonstrate your expertise in the area through an insightful analysis of the data. Neil Patel recently analyzed 614 posts he'd written on Quick Sprout and found that people love data: \"Out of all the text-based content I wrote on Quick Sprout, I noticed one thing. Blog posts that contained stats and data received 149% more social shares and 283% more backlinks.\" How to implement a data-driven content marketing strategy Step 1: Research You don't have to be totally original. You just have to bring more to the table. Brian Dean popularized the marketing strategy he calls the Skyscraper Technique. I won't go into details of the technique, but the steps are as follows: Find link-worthy content Make something even better Reach out to the right people In my case, I was lucky to have found my link-worthy (and data-driven) content fairly quickly. I had browsed through Hacker News and found a popular post by Dan Misener titled \"Kickstarter hides failure\". In reading his post, I found he had trouble scraping failed Kickstarter projects. Knowing how popular his post was on Hacker News, I knew that if I could get the information he was unable to obtain (improving on his work), then a lot of the same people would be interested. If you do not have time to browse through pages and pages of Hacker News or Reddit, you can set up Google Alerts to notify you when an article matching your keywords is found. For example, you can set up your alert like this: \"KEYWORD\" \"new study\" OR \"recent study\" OR \"new report\" OR \"recent report\" OR \"new research\" OR \"recent research\" OR \"new data\" OR \"recent data\" OR \"new experiment\" OR \"recent experiment\" site:.edu OR site:.gov [from Kane Jamison's presentation on Cost Effective Data-Based Content Marketing] You can also find if there is any academic research on your topic by doing a search on Google Scholar. Step 2: Collect the data Use/compile existing data You can use existing data you found during your research in Step 1 above. But if you have trouble finding relevant data or statistics, you can also look here: List of data repositories on Quora Data.gov federal datasets Datasets Sub-reddit Zanran.com statistical data search engine Collect raw data When collecting raw data, you need a plan which answers these questions: Who will collect the data? Where is the data to be collected, and will you have access to it? How will the data be collected (e.g., manually or scraped)? What kind of data will be collected (e.g., quantitative or qualitative)? What data points will be collected? What is the relevant time frame of the collected data? What is the deliverable for your project (e.g., spreadsheet)? When will the data be collected/delivered? For my project, I needed thousands of raw data points, so I outsourced the data collection to a freelance software developer I found on Upwork (formerly oDesk) using the above questions. If you are on a tight budget and are tech-savvy, you can do this yourself using Kimono Labs to Scrape the Web for Free. Step 3: Analyze I had previously written a related blog post that caught the attention of some major media outlets. It was in the comment section of this post where Professor Ethan Mollick of The Wharton School of the University of Pennsylvania took issue with how I analyzed the numbers: He asked for more data and offered to help me with the analysis. I jumped at the chance to work with him. Why? So I can leverage Professor. Mollick's expertise to not only help me analyze and interpret the numbers correctly, but to also help bring more credibility to my follow-up post. When doing the analysis on your own, however, you will be looking for patterns and insight to what these patterns might mean: Are there similarities? Are there disparities? Can you spot any trends? What logical conclusions can you draw from these patterns? Step 4: Create an infographic Once you have gathered all your data and did your analysis, you will decide what is the best format to present your conclusions. I chose to create an infographic. Why an infographic? Because it helps with generating traffic and branding. And since most people are visual learners, using an infographic to explain your data is more effective. The quickest and least expensive way is to use a free service like Piktochart to create your own infographic. This is what I did for my first post on Kickstarter. Other free infographic services include Infogram and Canva. But if you want a more professional design, as I did for my follow-up post on Kickstarter with Professor Mollick, you should hire a graphic designer. I hired mine through a design contest at 99Designs, but you can hire directly through freelance sites like Upwork The next step is to create a wireframe (the skeletal framework based on your data points) to give your designer an idea of how you want the infographic to look/flow. What I find helpful is to look for inspiration from other infographics. A great place to find a collection of infographics is Pinterest. Step 5: Write the post After all the data is compiled and analyzed, and the infographic is created, it's just a matter of writing the post that explains and interprets the results. The key here is to not write a dry report. I mean, who wants to read a research paper? We used an infographic to distill complicated data and presented it in an interesting and easy-to-understand format. At the same time, the writing itself needs to keep the reader interested and engaged. So I kept my writing simple, to the point, and conversational. Step 6: Perform outreach I have to credit Derek Halpern for introducing me to his Drafting Technique, where you basically find people who have a history of covering the topic you're writing about, then simply reach out to them. These bloggers and journalists have already shown interest in your topic. So, as long as the content you create is of high quality, you should have no trouble getting them to cover what you've created. Finding people who had covered a specific post For my first Kickstarter post, I simply reached out to journalists/bloggers who had covered Misener's post (by doing a Google search). Here is an example of the outreach email I sent and the reply: Finding people who had covered a particular topic I then used Google search to find out who has written about my post topic (Kickstarter) in the past (so they would more likely be interested in my pitch). Because the email is more general in nature, I gave them the reason why they should be interested in my post. Remember, it's all about the benefit to the reader/audience. They may not have time to read your post. That's why you must be able to grab their attention right away with the pitch. Here's the email pitch I sent to a Forbes contributor: And here is her reply to my email: Although she would not be covering my post this time around, she did tell me exactly what information she needed from me in order to do a write-up on this for Forbes. Remember Professor Mollick's offer to help me analyze the data? Well, now that I knew what I needed to get coverage from Forbes, I made sure that we had the answers to all the questions she asked. In other words, we were able to give her exactly what she wanted. The result? Two articles on Forbes.com. The takeaway? Listen closely when someone offers an explanation as to why your pitch is rejected, because they are also telling you exactly what they are looking for or need from you in order to turn that no into a yes. Reaching out to people who covered you previously Since I already had warm contacts with writers who covered my first Kickstarter post, I reached out to them again to let them know about the new post. This time, my email subject line was: \"New Kickstarter Research with Wharton Professor + INFOGRAPHIC\". Note that I picked each word very carefully and for a specific purpose: New lets them know that it's not rehashed information Kickstarter is the topic of the post most relevant to them Research, because journalists like to cover research. (People love data, remember?) Wharton Professor adds credibility, as Wharton is a well-respected university Infographic, people love infographics Needless to say, this email campaign received a lot more response than any of the others. Step 7: Promote, promote, promote The mistake many people make after creating content they hope to see shared widely is they do very little or no promotion publishing. Unless you already have a large audience, you must set aside time to promote your post, including: Emailing your list Using the \"Submit News\" or \"Got a Tip\" feature on relevant websites to tell them about your latest study or finding. If you are in the tech or the startup space, check out Submit.co for a huge list of sites where you can submit your post. Promoting your content on premium sites using paid services like Outbrain Building a buzz and engaging with people on social media using tools like BuzzBundle Conducting individual outreach to influencers who have shared or linked to similar content, using Ahrefs or Open Site Explorer Why you can do it, too At the time I wrote my Kickstarter posts, my blog was less than a year old and there was no traffic to speak of. What this experience has taught me is that anyone can achieve the same results by working smarter, not harder. Work smarter by leveraging proven content, research data, credible experts, and media relationships. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How a Viral Post Got 5,680 Visitors in One Day (a Behind the Scenes Look)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How a Viral Post Got 5,680 Visitors in One Day (a Behind the Scenes Look)"
    },
    {
      "level": "H2",
      "text": "Why create data-based content?"
    },
    {
      "level": "H2",
      "text": "How to implement a data-driven content marketing strategy"
    },
    {
      "level": "H3",
      "text": "Step 1: Research"
    },
    {
      "level": "H2",
      "text": "Step 2: Collect the data"
    },
    {
      "level": "H3",
      "text": "Use/compile existing data"
    },
    {
      "level": "H3",
      "text": "Collect raw data"
    },
    {
      "level": "H2",
      "text": "Step 3: Analyze"
    },
    {
      "level": "H2",
      "text": "Step 4: Create an infographic"
    },
    {
      "level": "H2",
      "text": "Step 5: Write the post"
    },
    {
      "level": "H2",
      "text": "Step 6: Perform outreach"
    },
    {
      "level": "H3",
      "text": "Finding people who had covered a specific post"
    },
    {
      "level": "H3",
      "text": "Finding people who had covered a particular topic"
    },
    {
      "level": "H3",
      "text": "Reaching out to people who covered you previously"
    },
    {
      "level": "H2",
      "text": "Step 7: Promote, promote, promote"
    },
    {
      "level": "H2",
      "text": "Why you can do it, too"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jeanne Pi\n          \n            Jeanne Pi"
}