{
  "url": "https://moz.com/blog/how-to-get-backlinks",
  "slug": "how-to-get-backlinks",
  "title": "How to Get Backlinks - Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A little creativity and smart tactics can uncover high-quality link building opportunities. This week, Britney Muller kicks off a new Whiteboard Friday series on modern link building.",
  "content": "How to Get Backlinks in 2020 [Series] - Whiteboard Friday Whiteboard Friday | Link Building By: Britney Muller June 26, 2020 Table of Contents Copied! By: Britney Muller June 26, 2020 How to Get Backlinks in 2020 [Series] - Whiteboard Friday Whiteboard Friday | Link Building Link building is never-ending in SEO, but a little creativity and smart tactics can help you ferret out great link opportunities from their hiding spots. In this episode of Whiteboard Friday, Britney Muller kicks off a series on modern link building (including the sage advice: let people choose their own anchor text!) Click on the whiteboard image above to open a high-resolution version in a new tab! Video Transcription Hey, Moz fans. Welcome to another edition of Whiteboard Friday. Today we are going to be looking at the easiest ways for you to get backlinks to your website. None of these involve content creation whatsoever. Really excited to dive into this. It will be part of a larger \"Link Building in 2020 Series and Beyond.\" So really excited to dive into some of the easiest things that you can do today to enhance your backlink profile. Let's take a look. No-brainer link building8 Ways to Get Backlinks in 2020 1. Unlinked brand, product, name, etc. mentions This is simply just going to Google, doing a search for these things within quotes, and looking at the first several pages of results to ensure that all of those results are linking back to your site. They likely are not, so those will be your opportunities to send a message or an email asking for the webmaster or the writer to provide a link back to your site with your mention. It's one of the easiest things to do. So is unlinked images. 2. Unlinked images This is a gold mine if you're working with a website that has a lot of proprietary images or really great graphic design, maybe you have infographics or some things that are special to the brand or the domain. Use Google reverse image search and put in the images that you think might have been taken or used on other websites. You will immediately see what those websites are and whether or not they link back to your site. So again, very similar to this first one. You're basically just asking for them to credit the website and link back accordingly. 3. Redirect your 404 pages with backlinks This is completely within your control. No outreach required. In fact, Moz Link Explorer provides this really, really easily within Moz Pro. You basically take a look at all of your pages that have backlinks, and you can filter by status code. You just change that to 400s, 404s, and you can see all of the pages to your website that currently have backlinks but the page is no longer there. All you want to do with that is just simply 301 redirect that old broken page to a new relevant page, and you're kind of saving that authority that is being sent to your site. So, so easy. A lot of people forget about that one. It's great. 4. Keep an eye on recently lost links The keyword here is \"recently.\" If you can engage with another website that has recently either by accident or changed things around on purpose on the page, you are more likely to reclaim your lost link. It's also just important to really understand why. Is that website going through a redesign? Have they gotten rid of pages? Did a competitor come in and provide a better resource than what you currently had? There are all sorts of reasons why you really want to identify what's going on. 5. Move backlink targets This is a new tactic that was recently brought to my attention by the brilliant Sarah Hollenbeck at Siege Media. They have a brilliant team. I highly recommend you checking out this article that's basically all about moving backlink targets, which has never really occurred to me, where you basically have backlinks to older resources or older content or products that you want to be restructured to newer or more important pages on your website. Sarah goes into great detail about this and can help explain just how you can do this successfully and what that means for your site. So really, really neat. I highly suggest that. 6. Sites that list competitors, but not you Check out sites that list competitors but not you. These might be resource pages or roundups of information of sorts. You can play around with this in Google as well by providing competitors within quotes and then minus your company or the website you're working on. It really starts to give you an idea of what websites might be great opportunities for a backlink, because you fit within that vein. It makes sense. 7. Sites that provide topic/industry + geo information Similarly, sites that provide topic or industry plus geo information, so again finding those resource pages, those roundups. Oftentimes you will see these on lots of .edu sites or even .gov. So you can do some different searches around if you were Columbia, outdoor clothing in Minnesota. Play around with this a bit. This could be in the Midwest, in the United States. You can change these words around and really start to identify some higher-quality link prospects. 8. Build relationships Lastly, build relationships. I cannot speak more highly about this. Just for your own career longevity and what you do in SEO and marketing in general, it is so important to develop genuine, real relationships with individuals that work in the industry, whether that be at other websites or just in the same vein of things. Not only can you bounce ideas off of these people and really get help with different things, but you get to help support the incredible things that they're working on. It's just an all-around, feel-good, help each other out situation. So if you're not already reaching out and building relationships, I highly suggest you do that. It's a lot of fun, and I can't stress enough there are so, so many good people within our industry it's incredible. ☑ BONUS: Let people choose anchor text! Lastly, we really want to take a modern look at link building practices in 2020 and beyond, and a big part of that goes around things like let people choose the anchor text for your backlink. Five or 10 years ago it was standard to request very specific anchor text for the keyword you wanted to rank for. It's not really the case anymore. Especially with the addition of BERT, Google has gotten so much more sophisticated in understanding text and language and websites that it's really unnecessary and might even cause problems to ask for those specific anchor link texts. Definitely take a look at this article we'll link to down below by David Farkas here, who wrote about link building lies. It's a really great article. We'll continue to build upon this series to provide you with some fresher information around link building today. I really look forward to hearing your comments and suggestions down below. Feel free to let us know what you liked about this, what you didn't like. If you have any great ideas, please let us know down in the comments, and I look forward to seeing you all next time. Thanks so much. See you. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Get Backlinks in 2020 [Series] - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Get Backlinks in 2020 [Series] - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "No-brainer link building"
    },
    {
      "level": "H3",
      "text": "8 Ways to Get Backlinks in 2020"
    },
    {
      "level": "H3",
      "text": "1. Unlinked brand, product, name, etc. mentions"
    },
    {
      "level": "H3",
      "text": "2. Unlinked images"
    },
    {
      "level": "H3",
      "text": "3. Redirect your 404 pages with backlinks"
    },
    {
      "level": "H3",
      "text": "4. Keep an eye on recently lost links"
    },
    {
      "level": "H3",
      "text": "5. Move backlink targets"
    },
    {
      "level": "H3",
      "text": "6. Sites that list competitors, but not you"
    },
    {
      "level": "H3",
      "text": "7. Sites that provide topic/industry + geo information"
    },
    {
      "level": "H3",
      "text": "8. Build relationships"
    },
    {
      "level": "H3",
      "text": "☑ BONUS: Let people choose anchor text!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Britney Muller\n          \n            Britney Muller"
}