{
  "url": "https://moz.com/blog/how-to-blog-successfully-about-anything",
  "slug": "how-to-blog-successfully-about-anything",
  "title": "How To Blog Successfully About Anything - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In order to create a successful blog, you must be passionately curious about the topic you're covering. Learn how to turn even the most uninteresting blog post topics into goldmines with these tips for successful bloggers.",
  "content": "How To Blog Successfully About Anything Blogging By: Tanner Christensen January 9, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Tanner Christensen January 9, 2013 How To Blog Successfully About Anything Blogging The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In order to create a successful blog, you have to be passionately curious about the topic you're covering. This notion was the central point of my Mozinar on \"Blogging Like You Mean It\" a few weeks ago, when I shared my personal story of blogging success. Here's a concise recap of the story, for those who missed it: I was once tasked with creating a blog on a topic I was completely uninterested in: television. At that time, there wasn't a TV in my home and I had absolutely no interest in television. In order to run the blog, I knew I had to find a way to approach the topic that would be interesting enough to make blogging feel less like work and more like fun. (That's the real trick to successful blogging, by the way: writing about things you are completely and naturally passionate about.) For this project, I was able to come up with a question that fully piqued my interest in the topic: \"How has television impacted the history of our culture, and how will it continue to do so in the future?\" With that one question, I was able to get interested in the topic, and eventually the blog started ranking in the top search results for some extremely competitive terms related to TV. Within a matter of weeks, we were writing articles that captivated people from around the globe and were even featured prominently on sites like The Guardian, AdWeek, New York Magazine, BuzzFeed, About.com, and Design Work Life. Today, the blog has been taken over by a remarkable, dedicated team at CableTV.com. After I shared this short story in my Mozinar, the number one question people had was: \"Can you give an example of exactly how to take an uninteresting topic and make it interesting?\" For this post, I'm going to do one better. We're going to quickly go over three examples of how to turn a not-so-exciting topic (whether it's for your day job or whatever else) utilizing websites submitted by readers on the official SEOmoz Facebook page. Rather than turn this into a basic list of top-fives or elaborate examples for each of these three websites, you're going to get a bit more of the actual insights every blogger should be following, regardless of context. It all starts with questions First off, any uninteresting topic can be made interesting by asking questions. Questions work remarkably well for two reasons: primarily, they give us clear purpose and direction in our efforts. When we're asking questions and actively pursuing the answers, our work suddenly becomes an opportunity to learn and grow, not just to get links or fill up pages on the web. Secondly, we, as bloggers, should focus on asking (and pursuing the answers of) questions because there is bound to be an audience for the content created around those questions; people who are looking for the same answers. These two facts alone make blogging become not only easier and more rewarding for us as writers, but also create an opportunity for us to create real, meaningful content that will easily create an audience that can rely on us. In an article for The Boston Globe titled \"Are we asking the right questions?\", Leon NeyFakh evaluates the work of Dan Rothstein, co-founder of Right Question Institute in Cambridge. Leon asserts that, \"Wielded with purpose and care, a question can become a sophisticated and potent tool to expand minds, inspire new ideas, and give us surprising power at moments when we might not believe we have any.\" With the power of questions in mind, we can start evaluating nearly any topic and turning out ideas for successful blog posts. Reader Simon Abramson suggested that we first look at the official blog of Wild Earth, which, as far as I can gather, is a company that takes people into nature to help them build self-reliance, confidence, and ecological resilience. This is certainly a topic I know very little about and am currently not very interested in, personally. The first step for any blogger (when covering any topic) should be to simply ask a lot of questions. If you're not sure where to start with the questions, focus on the 5 Ws: who, what, where, when, and why (and occasionally, how)? Who started the whole \"nature can help you as a person\" industry? What are the psychological effects of being in nature for any period of time? Where are the best places to go if you want to experience nature at its best? When are the best times in your life to go? Why should a busy office worker consider such an option? How does nature build confidence, from a biological perspective? Once you've asked as many questions as you can, try to find one or two that really sparks your interest. Personally, I'd love to look at the psychological effects of nature. With that one question alone a waterfall of other questions comes to mind, and every one of those questions is an opportunity for a blog post. As a blogger, you'll want to focus on a primary question, then let that question fuel other questions that will become your blog content. The more questions you ask around a central question, the more ideas you'll have and the easier your job will become. Use available resources for natural research So, questions become the central focus of our efforts and allow us to pursue things that not only interest us, but also that of our ideal audience. Now what? Next, do what comes naturally when you have a question: pursue the answers. If you don't have any questions off the top of your head, pursue other questions the same way you would pursue answers. This stage of blogging is what 60% of the work consists of: research. Plan on spending the majority of your blogging work schedule doing research, particularly reading. Keep in mind that your gift to readers is doing the research so they don't have to. Everything you write after this point on should be a concise, easy-to-consume version of whatever it is you spend all of your time researching. Where to start researching answers and additional questions we may not be asking yet? I like to utilize sites like Quora, Topsy, Google Alerts, and Google Blog Search (setup as an RSS feed). If our blog was about, say, a local housecleaning service – something like Marvelous Maids, a housecleaning company that serves St. Charles County in Missouri, as submitted by Moz community member Kathy Stamm Gage – and our primary question to turn that topic into something interesting was along the lines of, \"What's the science behind common cleaning chemicals?\", then our first task would be to explore the \"housecleaning\" category on Quora, which – believe it or not - is an actual thing. Immediately after visiting the Quora page, we should have a few ideas for additional questions we can then turn into blog posts. Now, sometimes you'll have topic that simply doesn't have much information or activity on Quora, in that event it's best to get clever (by asking \"instead of exploring the \"housecleaning\" page of Quora, what about \"germs?\") or move onto a resource that will certainly have more information (like a library). In this case, digging around the \"housecleaning\" section of Quora yields some really interesting results that already spark some blog post ideas. Questions such as, \"What are some housecleaning hacks?\" teach us that instant orange drink mix will clean the inside of a dishwasher just as easily as expensive cleaners, due to the citric acid. That can definitely be turned into a blog post. Moving on from Quora, we should begin exploring other resources. Our best power for blogging is all about quantity right now, especially if your blog is fairly small or just starting out. Focus on having a vast quantity of questions ready to go and be researched. Attempt to gather a very large quantity of resources you can utilize when exploring those questions as well. As another example, if we stick to the topic of housecleaning, we can take to Topsy and search for \"housecleaning chemicals\" to get a pretty good list of additional questions/topics worth researching. Including: \"How to clean your home using herbs rather than scary chemicals\" and \"A list of scary chemical cleaners to avoid.\" Curious about what either of those might entail? If you are, your readers will be too. The best questions, of course, come from you. You can easily open up doors to topics and things that do interest you about your original question/theme by being naturally curious. For me, the questions come easy. \"What chemicals do we really need to be worried about in common cleaning supplies?\" or, \"How sustainable are home cleaning supplies, really?\" or, \"Are things we hear about household cleaning chemicals fact or fiction?\" or even, \"If you were to add-up all of the various chemicals used in all of the supplies you use to clean your home, what would that list entail exactly?\" All questions I personally wouldn't mind researching in order to create compelling (and, most importantly: helpful!) content. These questions all provide instant blog posts that are pretty interesting, easy to research, related to a not-so-interesting industry, all discovered because we asked some simple questions and checked-out a few websites. Voila, blogging success is within our grasp! A vision of what we've covered We've touched on a few concepts that seem really basic, and yet we continue to see blogs that don't follow any of this pattern. The results speak for themselves, though: by pursuing things that are naturally interesting to us and finding answers for them, we're uncovering what a lot of people out there want to know as well. The problem that our readers have is that they don't have all of the time or ability to research like we can. That's also one of your greatest gifts to readers: putting in the time to learn about something so they don't have to. When you then reconstruct what you discover into an easy-to-digest blog post, or graphic, or video, or Tweet, you're establishing yourself as not only someone on their way to expert status, but you're also providing a true, can't-be-faked value. Even if your topic isn't naturally interesting to you (like nature programs or housecleaning), there are ways to make it interesting through natural discovery. Our last example of how this all works comes from Douglas Hodgson, who asked me to evaluate the business of eye care for Frontier Eye Care. Eye care is a naturally an interesting topic for me though, so I think this one will be a little easier than the last two. It's important and interesting to me because I was born with poor eyesight and because eyesight plays such a critical role in what I (and I'm sure millions and millions of others) do every single day. So, how do you take a topic like eye care and make it worth researching? What value could we possibly provide to people who are interested in the eye care industry? It's not so hard to come up with solutions when we make the topic really interesting by asking questions. How has technology affected eyesight and what does the future of technology hold for it? Is there a certain science to picking out the perfect eyewear? Post ideas flourish with just these few questions. What about a graphic illustrating the perfect angles and measurements to make (at home?) before picking a pair of sunglasses? We could even evaluate the history of eyeglasses used by famous figures. Maybe a post on how glasses or rigid gas permeable lenses are created and why 3D home printing may change that (will it though?), or what about an article explaining the countless factors that impact how our eyes develop as we grow (genetics, facial structure, encounters with bright lights, and so on)? The ideas can flow, some will certainly be winning topics, others will just be interesting for a handful of people. What we need to do as bloggers is remember that our goal is to focus on one primary approach or question, then find related questions either we have or other people have, and put in the work to do the research and come up with solutions. This is really basic stuff, I hope, but it's quite easy to forget or overlook. There are no worthwhile tricks to successful blogging outside of hard work, in my opinion. This approach not only allows you to learn a lot about your topic on your own, but it also sets you out as a clear, reliable resource in your industry. For any business or industry, that reputation can mean serious success. If you have additional questions or insights into this type of blogging strategy, I'd love to hear your thoughts either in the comments or on Twitter. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How To Blog Successfully About Anything"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How To Blog Successfully About Anything"
    },
    {
      "level": "H2",
      "text": "It all starts with questions"
    },
    {
      "level": "H2",
      "text": "Use available resources for natural research"
    },
    {
      "level": "H2",
      "text": "A vision of what we've covered"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Tanner Christensen\n          \n            Tanner Christensen"
}