{
  "url": "https://moz.com/blog/how-to-carve-out-marketing-strategies-by-mining-your-competitors-backlinks",
  "slug": "how-to-carve-out-marketing-strategies-by-mining-your-competitors-backlinks",
  "title": "How to Carve Out Marketing Strategies by Mining Your Competitors' Backlinks - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "You can do your own Watergate-style investigation, learning the secrets of your competitors' marketing strategies by scrutinizing their backlinks. Pivot tables in Excel can help you make sense of all that data, and this post will show you how.",
  "content": "How to Carve Out Marketing Strategies by Mining Your Competitors' Backlinks Competitive Research By: Annie Cushing August 13, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Annie Cushing August 13, 2013 How to Carve Out Marketing Strategies by Mining Your Competitors' Backlinks Competitive Research The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Image from the National Archives If you want to see how your competitors are gaining a strategic advantage, one of the best tactics to overtake them is to take a deep dive into their backlinks. They leave breadcrumbs behind that reveal their best tactics. Then pivot (no pun intended), glean ideas from their brilliance, and do it even better! Required skill: pivot tables If you don't know how to use pivot tables, you need to check out this video walkthrough. I teach you everything you need to know and then some. Download example pivot table I redacted my client's data from the pivot table in the Excel sheet, but you can get an idea of how I pulled together the data in the \"Raw Data\" tab and then see how I organized my pivot table in that tab. You can, of course, organize yours however you feel is best. But hopefully this will provide a good jumping-off point. I also sorted my pivot table by domain authority in descending order and then filtered out links from [free-subdomain].wordpress.com. You can download the Excel workbook from Dropbox. Steps to pull data together Step 1: Pull your site's (or client's) backlinks — using Open Site Explorer, Majestic SEO, ahrefs, or whatevs — as well as a few of your main competitors. Then pull them together into a formatted table. Step 2: Add another column and label it \"Site.\" What I typically do is add the domain (without the http:// or www to minimize noise) and double-click the bottom-right corner of the cell to fill down to the bottom of the data set. Rinse and repeat each time you add a new batch of backlinks. When you finish, you'll have a single table that contains a mashup of backlinks. Step 3: Extract the domains from the backlink URLs using the LEFT and SEARCH functions. If you haven't done this before, I demonstrate how in this video tutorial. (Or you can download the demo workbook from the post and just copy the formulas.) Step 4: Create your pivot table using these settings: Step 5: As a general rule, I don't like how Excel merely indents rows in the default, \"Compact\" pivot table format. In our data set here, where we have three different values pulled down in rows (Domain, Site, and URL). This can cause your rows to get really congested, and it can be hard to differentiate them. For this reason, if I pull multiple values into the Rows field list, I prefer the Outline layout. You can check it out in the Excel file download. To set your pivot table to \"Outline,\" click on any cell in the pivot table and go to Pivot Table Tools > Design tab > Layout > Report Layout > Show in Outline Form (Mac: PivotTable tab > Design > Layout > Outline Layout). Step 6: I pulled individual observations into text boxes to the left of the pivot table. I used text boxes for a couple reasons: I didn't want to mess up the heights of rows inside my pivot table. I could attach links to the text boxes that linked to the individual cells in the pivot table. Step 7: Dive into the data and start reverse-engineering strategies (using the observations I pulled out as a template, if you'd like). I can assure you there are many more to excavate from that data set! Video tutorial For you visual learners out there, I pulled together a 10-minute video walkthrough of some of the key steps I took to organize the data for analysis. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Carve Out Marketing Strategies by Mining Your Competitors' Backlinks"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Carve Out Marketing Strategies by Mining Your Competitors' Backlinks"
    },
    {
      "level": "H2",
      "text": "Required skill: pivot tables"
    },
    {
      "level": "H2",
      "text": "Download example pivot table"
    },
    {
      "level": "H2",
      "text": "Steps to pull data together"
    },
    {
      "level": "H2",
      "text": "Video tutorial"
    },
    {
      "level": "H2",
      "text": "Try our SEO Competitive Analysis tool"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Actually Be Better Than Your Competitors in the Eyes of Choosy Customers"
    },
    {
      "level": "H3",
      "text": "SEO Gap Analysis — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Daily SEO Fix: Competitive Link Research"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Annie Cushing\n          \n            Annie Cushing\n          \n            Annie Cushing"
}