{
  "url": "https://moz.com/blog/how-i-built-an-online-community-from-0-to-1500-members",
  "slug": "how-i-built-an-online-community-from-0-to-1500-members",
  "title": "How I Built an Online Community From 0 to 1500+ Members - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "One of the best ways to develop users’ engagement is through online community of target audience. Users’ engagement leads to repeated visits. Repeated visits lead to brand retention. Brand retention leads to brand loyalty and brand loyalty leads to more sales and leads. So if you want to increase…",
  "content": "How I Built an Online Community From 0 to 1500+ Members Social Media By: Himanshu Sharma October 27, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Himanshu Sharma October 27, 2010 How I Built an Online Community From 0 to 1500+ Members Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. One of the best ways to develop users’ engagement is through online community of target audience. Users’ engagement leads to repeated visits. Repeated visits lead to brand retention. Brand retention leads to brand loyalty and brand loyalty leads to more sales and leads. So if you want to increase your sales, leads or brand loyalty then you need to engage with your target audience. And what can be a better way to engage than to develop and run your own community of target audience. Here is what I did to build my community: Define your goals You need to ask yourself one question, why you need a community in the first place. How your community can help you in achieving your website/business objectives? Your objectives can be orders, sales, leads, adsense revenue, signups, downloads, branding, link building etc. For e.g. I wanted a community which engages with my main site eventeducation.com and help in increasing traffic and adsense revenue. Find Your Target Audience To build a community, you need people but not just any people. You need people who have interest in your industry or are a part of your industry and who can help in achieving your website/business objectives. You can find such people through industry forums and groups on social networking sites like Facebook, Orkut, LinkedIn, yahoo groups, Google groups, meetup.com etc. I wanted to build an online community for event professionals. So I looked for such communities on orkut. Determine your Community needs You need to build a network that not only helps you in achieving your business objectives but also satisfy the needs and wants of your target audience. Bringing your target audience from Facebook or Orkut to your site is not easy. So you have to give them very good reason to stay and network on your site. A very good way to understand your audience is to be there where they are now. Join their communities on social networking sites, socialize with them and actively participate in discussions for a week or two. By the end of second or third week, you will get a good idea of what your target audience like and want. After browsing several event communities on Orkut and Facebook, I realized that they provide limited functionality and features to network and I can come up with a better networking platform. Build your community plan Decide what will make your community unique. This is very important if you want people to migrate from their Facebook/Orkut/Linkedin community to yours. Decide what type of discussions you would like to have on your network. What will be the focus of your community? What will be the community guidelines? What type of contents you would like have on your network? How you will bring members? How you will promote your network? For e.g. I wanted a network where event professionals can create their profiles, network with other event professionals (add them as a friend, send and receive messages), start and participate in a discussion, upload event videos, upload event photos, post upcoming events, post blog posts, create groups etc. Get a networking platform I wanted to build a networking platform better than any Facebook or Orkut group page. So I needed lot of functionality and features. But I had no experience in building and hosting social networks. Also I didn’t have the time, inclination or capacity to develop a social network from scratch and then vigorously test and improve it forever. So I thought of borrowing the functionality from companies which are expert in building and hosting social networks. I eventually picked up ning.com. I was skeptical about the success of my community, so I picked up the free plan initially (at that time Ning used to provide free social networks). You however can build your own network from scratch if you have the capacity, time and inclination. Add contents to your network Once your network is ready, add tons of high quality contents to it. I put tons of event planning resources. This will later help you in getting your first set of members and repeated visits. Remember content can make or break your network growth in the early stages. Later your members will generate contents (UGC) for you. So then you can slow down in your content development. But high quality contents are very important esp. during the early stages of an online community. Get your first set of members Your first set of members is those who are part of your industry and who are known to you. I invited 40-50 people from my address book, plus 5-10 from various online communities I was a part of. In total I invited around 100 people. But only 5 people joined the community. This was really disappointing. I was expecting at least 30-40 members. For several days my new members did nothing on my network. It looked like they just built their profiles and abandoned them. So I posted a new discussion. One member replied back after few days. This motivated me and I started few more discussions. I even started interacting with the new members, welcoming them and saying ‘hello’. I had no prior experience in running a social network. I kept posting new discussions in a hope that members will participate. After a week or so, one or two member started replying back. Also at the same time I got around 10 new members. These 10 members were invited by my existing members. Later these 10 members invited people from their address book and then the chain reaction started. In just 6 months my network becomes the second largest event forum in the world with more than 1500 members from more than 100 countries. Here is the link to my network if you want to check out: eventplanningforum.net. The reason I faced so much problem in getting my first set of members is that I had no following to begin with. I was neither a recognized authority in the event management field nor did I have contacts with industry experts or top influencers. So if you want to build huge community in a matter of few weeks, get the audience (fan following) first. You can build huge fan following through your top notch contents and contribution to your industry. So if tomorrow Rand or Danny Sullivan wants to start a social network for SEOs, they can easily build huge community in matter of days through their authority and influence. Remember guys both of my sites eventeducation.com and eventplanningforum.net are my hobby sites. They are not my bread and butter. Nor I put any serious efforts or money to promote them. My main objective was to increase my adsense revenue which I achieved as my forum is now my top adsense referrer. :) My rival community is almost 8 times bigger than mine. But then they spend loads of money on its marketing and have a dedicated staff. And this is what I suggest. At some point you will feel that you can’t grow your community anymore without shedding some serious dollars. At that point you should develop a solid plan to promote your community through ads on Facebook, Linkedin, Orkut and industry specific sites. I hope you learned something from my first hand experience in social media. How did you grow your community and what problems you faced? Please share in the comments below. Ciao! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How I Built an Online Community From 0 to 1500+ Members"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How I Built an Online Community From 0 to 1500+ Members"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Himanshu Sharma\n          \n            Himanshu Sharma\n          \n            Himanshu Sharma"
}