{
  "url": "https://moz.com/blog/how-to-win-a-web-contract-from-a-big-company-that-has-their-own-web-department",
  "slug": "how-to-win-a-web-contract-from-a-big-company-that-has-their-own-web-department",
  "title": "How to Win a Web Contract from a Big Company That Has Their Own Web Department - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There are few things Web departments in big companies don’t understand. Let’s face it, large companies have full-size IT groups driving everything from backbone to extranet. So how can you win a web site deal from a big company? There two things that web dev teams in IT departments don’t yet…",
  "content": "How to Win a Web Contract from a Big Company That Has Their Own Web Department Social Media K By: Klikhir April 24, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! K By: Klikhir April 24, 2007 How to Win a Web Contract from a Big Company That Has Their Own Web Department Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. There are few things Web departments in big companies don’t understand. Let’s face it, large companies have full-size IT groups driving everything from backbone to extranet. So, how can you win a web site deal from a big company? There are two things that web dev teams in IT departments don’t yet understand: Social Media Sites and Web 2.0 Mashups. Most big companies deal with hundreds or thousands of resellers, agents, brokers, advisers, salesmen, and so on. Their modus operandi for communications is traditional expect for email. Marketing & Sales departments are usually the communications interface with the company, and their style of communication involves press releases, newsletters, emails, and call centre help lines. But in the new economy, companies are beginning to see the value of building MySpace types of communities for their own networks in order to bring about open ended, broad based communications. Typical features like Forums and Blogs and Article Posts that invite commenting represent massive benefits to companies wanting to build stronger relationships with the people who represent them. In turn, those agents (or users) are able to make friends with each other and build their own networks and communities within that market segment, using the internal email/friendmaking features of the site. If you can install and maintain an open source CMS like Joomla or Mambo, you may be in business. These content management systems have hundreds of plug ins available to produce a complete Web 2.0 Social Media Web Site, branded for each client, with an exclusive template. An example of a complete community platform of this type can be seen here at ccsboardroom.com – a site I produced for Corporate Behavioral Specialists P/L, to promote a National Management Education Initiative through community and relationship building. Note the company has a separate web site for its business. In making this sale, I showed the SEOmoz web site as part of the demonstration in the initial meeting! Big companies do not have the resources or know how to implement and operate a social media site. For these sites to work, you need people to moderate content, manage users, prune content, add new company-related content, and so on. This is where you can make a sale and add real tangible value to a big company. Offer them a customized, managed Social Media Platform to engage their agents, build relationships, and foster open and transparent communications. Sell them the idea that it’s MySpace and American Idol for their business agents--MySpace because of the social participation value proposition, and American Idol because each ‘user’ has an opportunity to be recognized within the community as a leader or expert in their field of expertise (not unlike YOUmoz).You can charge anywhere from $60k to $100k for putting together a solution like ccsbaordroom.com, which is based on Joomla open source CMS. Simply position the sale as a “managed communication solution” – which you manage – for a monthly fee over a 3 year contract. You should able to charge anything from $5k to 10k per month for this service. A skilled developer can put the modules together, customise a template, and be up and running in a week. In putting together CCSBoardroom, I used the following main Open Source components: Joomla - CMS hosted on Apache with MySQL Joomlaboard Forum Module - now called Fireboard AkoComment - Commenting/favouriting module Wordpress - for Colin Chodos Blog SOBI - for the Business Directories ExtCal - Events Calander Plug in Community Builder - Social Networking module (I'm publishing this information because I believe in sharing ideas and I hope we all derive some benefit from it.) Corporations and SMEs are desperately trying to embrace Web 2.0 social media technologies and platforms, yet they know little about it, how it affects their business, and how to implement coherent and valuable solutions. They know everything about shopping carts, third party payments, back end integration, and extranet document libraries and so on, but have yet to fully resource social networking frameworks. In the past three weeks, I have met with 4 major corporates to demonstrate and offer a social media platform not unlike SEO/YOUmoz or CCS Boardroom.com. In each meeting were 3 to 8 people all dazzled by the possibilities and potential impact social media platforms can play in their own niche community environment. One such company has 1400 insurance sales agents, all desperate for information and bi-directional flow with the communications department. Each meeting has resulted in further discussion and continued interest. None of these companies are able to take this type of project in house, and each is firmly interested in moving the relationship forward. I also positioned these platforms within the scope of SEO, assuring them that the increased activity on their new social networking site will have a major impact on traffic to their main company web site. I’ll keep you posted on the outcome when we win some business. I'm hoping the spin off future business from winning a Social Media Site contract will be some SEO work. Do you think Social Media Platforms are a viable proposition for big companies to improve relationship building with their Agents? Do you think having such a site will increase traffic to the main company ‘trading’ web site? Do you think a social media platform is the type of managed application you could sell to a big company? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Win a Web Contract from a Big Company That Has Their Own Web Department"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Win a Web Contract from a Big Company That Has Their Own Web Department"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Klikhir\n          \n            Klikhir"
}