{
  "url": "https://moz.com/blog/how-pagerank-works-why-the-original-pr-formula-may-be-flawed",
  "slug": "how-pagerank-works-why-the-original-pr-formula-may-be-flawed",
  "title": "How PageRank Works & Why the Original PR Formula May be Flawed - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "INTRO From Rand: Although my grandfather, Si Fishkin, has attended many industry events, provided coverage and helped with premium Q+A as well as some of our consulting work, this is his first post on the SEOmoz blog. Si was in town for the Thanksgiving holiday and generously contributed some time…",
  "content": "How PageRank Works & Why the Original PR Formula May be Flawed Search Engines S By: SiFishkin November 25, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! S By: SiFishkin November 25, 2007 How PageRank Works & Why the Original PR Formula May be Flawed Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. INTRO From Rand: Although my grandfather, Si Fishkin, has attended many industry events, provided coverage and helped with premium Q+A as well as some of our consulting work, this is his first post on the SEOmoz blog. Si was in town for the Thanksgiving holiday and generously contributed some time to the blog. Please welcome him! Last week, Rand posted a video and some diagrams that I believe may be misinterpreted or misleading. To help make PageRank more clear, I've enlisted his help to construct some diagrams that should help to explain the issue succinctly. First, a simple and general explanation of PageRank: For those who are curious, the original PageRank formula is documented here, and I also like Ian Rogers' PageRank explained, here. Below, I've shown how pages acquire PageRank: Next, a look at the ability of pages to pass PageRank: In order to understand PageRank deeply, a few examples follow, moving from simple to slightly more complex: In the original PageRank formula, link weight is divided equally among the number of links on a page. This may not hold true today, but is still valuable to understanding the original intent. Next, a more complex example that shows PageRank flow back and forth between pages that link to one another: Finally, an example showing how PageRank can be \"leaked.\" This diagram more accurately illustrates the concept Rand attempted to describe. The leak is not occuring due to a \"leaky bucket\" scenario, but rather, because PageRank that could be flowing to pages on the site is now lost to Wikipedia: The PageRank \"leak\" concept presented a fundamental flaw in the algorithm once it became public. Like Pandora's box, once those creating pages to rank at Google investigated PageRank's founding principles, they would realize that linking out from their own sites would cause more harm than good. If a great number of websites adopted this philosophy, it could negatively impact the \"links as votes\" concept and actually damage Google's potential. Rand and I both tend to believe that it is likely Google has changed and refined the PageRank algorithm many times. However, familiarity and comfort with the original algorithm is certainly a responsibility for those who practice optimization of Google results. As a caveat, I've included this graphic that Rand created several months ago for the blog to help show that while PageRank may present one way links as passing value, other concepts certainly exist. Several resources that proved valuable during my investigations into PageRank include: Google Page Rank Whitepaper from Ian Rogers Braintiques' Chapters on Google & PageRank The original Google paper - Anatomy of a Large-Scale HyperTextual Web Search Engine An impressively detailed PageRank Calculator from WebWorkshop I am currently working with Rand on another blog post about using nofollow to control the flow of PageRank. I hope to have that entry up soon. UPDATE: I've noted that many in the comments seem to be confused about the relationship between the information in this blog post and the PageRank Google shows in their toolbar. I have NOT studied the toolbar PageRank - this information relates only to the PageRank formula. The rounding and inconsistency of updates to toolbar PageRank makes it very difficult (perhaps impossible) to connect with the formula. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How PageRank Works & Why the Original PR Formula May be Flawed"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How PageRank Works & Why the Original PR Formula May be Flawed"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "SiFishkin\n          \n            SiFishkin"
}