{
  "url": "https://moz.com/blog/how-google-s-evolution-is-forcing-marketers-to-invest-in-loyal-audiences-whiteboard-friday-32200",
  "slug": "how-google-s-evolution-is-forcing-marketers-to-invest-in-loyal-audiences-whiteboard-friday-32200",
  "title": "How Google's Evolution is Forcing Marketers to Invest in Loyal Audiences - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As Google changes the SERPs, building a loyal audience is more important than ever. Learn effective tactics to create relationships and trust before you focus on SEO.",
  "content": "How Google's Evolution is Forcing Marketers to Invest in Loyal Audiences Whiteboard Friday | Search Engines | Marketing Industry By: Rand Fishkin April 17, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 17, 2015 How Google's Evolution is Forcing Marketers to Invest in Loyal Audiences Whiteboard Friday | Search Engines | Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Given Google's recent changes to SERPs and their April 21 mobile deadline, does SEO still come first? In today's Whiteboard Friday, Rand walks you through tactics you can use to build a loyal audience before you need to do SEO. For reference, here's a still of this week's whiteboard. Click on it to open a high resolution image in a new tab!Video transcription Howdy Moz fans and welcome to another edition of Whiteboard Friday. This week we're chatting on some of the changes that Google has made that are forcing marketers to invest more and more in building loyal audiences before they do SEO. This is kind of a reverse of years past where we could use SEO as that initial channel where we attracted visits who would become our customers, our email subscribers, our social media fans and followers. All of these things have kind of switched direction. Why move SEO later in the process? There are some reasons why. First off, Google has for a lot of broad, head of the demand curve queries, they've taken some of the value and equity away from those with things like instant answers and Knowledge Graph, along with lots and lots of other verticals. Knowledge Graph I do a search for \"plaid shirts\" and I get this instant answer showing me what a plaid shirt looks like and a Knowledge Graph. This is a fake example. I don't think they actually do this for plaid shirts yet, but they will. Personalization Personalization by history, we're seeing a ton of personalization. I think history is one of the biggest influencers on personalization. Google+ still is a little bit, but your search history and what you've clicked on in the past tends to be big predictors of this. You can see this in two areas, not just in the results that Google shows, but also in what they're suggesting to you in your Search Suggest as you type. Now, where Google is trying to predictively say, \"Hey, we think you're going to want coffee right now because we see that you stepped out of your office and you live in Seattle, and you are a human being. So you must want coffee.\" They have these ranking signals, that are relatively new over the past few years and certainly much stronger than in years past around user and usage data, around search volume and what you searched for using quality raters and human and manual controls. Signals that are heavily correlated with brand, even if brand itself isn't necessarily a ranking factor. Fewer results Of course, there are fewer results now. I don't know if you guys caught this, but I thought one of the most fascinating things that Dr. Pete showed off recently in his MozCast data set was that it used to be the case that Google would show 10 results even if they had a set of images, a news result, and a local pack. Now basically these count as individual results. So you're not getting 10 results on a page. If you've got images and a couple of news things, you're getting seven results that are web results. Ten domains appear, ten big domains, powerful domains, places like Amazon and Yelp and those kinds of things, at least for U.S. search results, appear on 17% of all page one queries. There are a little fewer results to work with and more results biased to these bigger, better-known sites. All of these things are contributing to this world in which doing SEO first and then earning loyalty through two other channels through SEO is really, really hard. It's making the value of having a loyal audience before you need to do SEO that much more valuable, which is why I figured we'd run through some of the tactics that you can use to build a loyal audience. This is actually a question from one of our Whiteboard Friday loyal audience members. Thank you very much. Much appreciated. How to build a loyal audience Some tactics to build loyalty, we talked about a few of these, but creating an expectation that you can consistently deliver upon is a huge part of how loyalty is created. Humans love to form habits. Thankfully for marketers, we're terrible at breaking those habits. Consistency If you can form a habit, you can create a loyal member of your audience, but this is very challenging unless you deliver consistency. That consistency needs to be created through an expectation. That could be when you publish. That could be what you're going to do. That could be the format of the content that you're providing. That could be how your solution or problem or product is delivered. But it needs to create those things in order to build that loyal audience. Reach your audience where they are Secondly, provide your content through the channels, the apps, the accounts, the formats that your audience is already using. If I say, \"Hey, in order to get Whiteboard Friday, you need to sign up for a Moz account first,\" the viewability of Whiteboard Friday is going to go down. If on the other hand, which we don't have this but we really should have it, there was a subscribe on iTunes and you could get each Whiteboard Friday as a podcast, gosh, that is something that many Whiteboard Friday viewers, in fact, many people in the technology and marketing worlds already have access to. Therefore it reduces the friction of subscribing to Whiteboard Friday. We might build more people into our loyal audience. This is definitely something to think about. You need to be able to identify those channels and then be there. Where SEO fits I'm saying don't start with SEO as your primary web marketing tactic anymore. I think we have to build into it. These challenges are too great. Not only are they too great, I think they could be overcome today, but they are growing. All of them are growing so substantially, instant answers and Knowledge Graph are becoming a bigger and bigger part of search results. Google Now is something that Google is pushing on so incredibly hard. I think they're going to be pushing it with new devices. They're clearly pushing it with app results inside of search results. I think these ranking signals are only going to get stronger. I think there's going to be more personalization. I think every one of these you can see an up and to the right trend. Therefore, when we do SEO, we have to think about it as, \"How do I earn a loyal audience and then use their amplification to help me perform in search?\" Rather than, \"How do I do SEO for my website to earn visitors that I can convert into a loyal audience?\" That's a new a challenge, a new paradigm for us. Be unique and memorable Craft a stylistically unique and memorable approach to solving your audience's problem. One of the things that I find is challenging in a lot of businesses that we talk to, that I get to interact with is that they think, \"Hey, we're the best player in this field. We're the best at doing this. Therefore, we should be able to earn a great customer audience.\" I think this ignores why marketing exists and ignores the power that marketing has and the power of influencing human beings overall. The best really is not necessarily enough. We are not perfectly logical creatures where we go, \"Hey, I am thinking about a new social media monitoring solution. I need to watch Twitter, Facebook, Google+, LinkedIn, and Instagram for my business. Therefore I'm going to create my criteria. I'm going to evaluate all 716 providers that are in the market today that fit my price range and those criteria. Then I'm going to choose effectively the best one. No, we're biased by the ones we've heard of, the ones our friends recommend, the ones we stumble across versus don't stumble across, the ones that have a loud voice, the ones that have a credible voice. These things bias us. Therefore, being stylistically unique and memorable have outsized power to determine whether people will become part of your loyal audience. More isn't necessarily better I've talked about this a few times, but I'm strongly of the opinion, especially when it comes to loyalty, that more content may actually be worse than better content. Moz publishes between 7 and 10 blog posts a week. That's a lot of content. I think there are weeks where we published 12 blog posts. For me to say this is a little odd. But the challenge here is prior to building a loyal audience. Once you have a loyal audience, you can start to expand that audience by reaching out and broadening the spectrum of content that you create, and you can afford to be a little more risk taking in that. When you are trying to build loyalty early on, you need to have that consistency of quality. People are going to return because you keep delivering great stuff again and again. When that suffers, your audience will suffer as well. If I watch my first three Whiteboard Fridays and then the fourth one is not great, I expect to lose a ton of those viewers. But if I have tens of thousands of people who are watching Whiteboard Friday and I deliver one bad one out of twenty, maybe I have a little more room to play there. Focus your efforts Focus. This is a big challenge because I think a lot of us think very broadly about who we want to appeal to, the types of content we want to create, the types of marketing we want to do. This is very challenging from a loyalty perspective because passionate fans tend to congregate around very, very focused causes and very focused creators of content or focused brands or focused organizations. Its much tougher to build that passion into a group of users if you're trying to appeal to a very broad set. That's just how it is. Don't forget engagement Lastly, but not least, this is very tactical, but I found it extremely powerful when a brand is starting out, when a project is starting out, to engage and respond as much as possible with your customers. That could be over social channels, that could be in comments, that could be in emails, that could be directly in outreach, whatever it is. But if you see someone who you can reach out to engaging with you, replying to them, talking to them, conversing with them in some way, forming a connection is extremely powerful. It especially is important for first interactions. I'm not going to say, \"You need to respond to everything all the time, always.\" If you can identify, \"This is the first interaction that we've had with this person,\" if you interact and if that interaction is positive, it can create loyalty just on its own. That's a lovely way to start scaling up from a small starting point. All right everyone, hope you've enjoyed this edition of Whiteboard Friday. We'll see you again next week. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Google's Evolution is Forcing Marketers to Invest in Loyal Audiences"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Google's Evolution is Forcing Marketers to Invest in Loyal Audiences"
    },
    {
      "level": "H2",
      "text": "Video transcription"
    },
    {
      "level": "H3",
      "text": "Why move SEO later in the process?"
    },
    {
      "level": "H4",
      "text": "Knowledge Graph"
    },
    {
      "level": "H4",
      "text": "Personalization"
    },
    {
      "level": "H4",
      "text": "Fewer results"
    },
    {
      "level": "H3",
      "text": "How to build a loyal audience"
    },
    {
      "level": "H4",
      "text": "Consistency"
    },
    {
      "level": "H4",
      "text": "Reach your audience where they are"
    },
    {
      "level": "H4",
      "text": "Where SEO fits"
    },
    {
      "level": "H4",
      "text": "Be unique and memorable"
    },
    {
      "level": "H4",
      "text": "More isn't necessarily better"
    },
    {
      "level": "H4",
      "text": "Focus your efforts"
    },
    {
      "level": "H4",
      "text": "Don't forget engagement"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}