{
  "url": "https://moz.com/blog/how-to-evaluate-guest-post-opportunities",
  "slug": "how-to-evaluate-guest-post-opportunities",
  "title": "How to Evaluate Guest Post Opportunities - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "James Agate presents the unofficial quality rater handbook for guest posting campaigns.",
  "content": "How to Evaluate Guest Post Opportunities Link Building By: James Agate June 5, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: James Agate June 5, 2012 How to Evaluate Guest Post Opportunities Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. With all the recent turbulence in the SERPs, many agencies and businesses are recognising the need to move budgets from the lower-end link building tactics to techniques like guest posting. Guest posting is very easy to get wrong though, as a technique it may well be considered high-quality but just like any other link building tactic, it's the execution which determines whether the links earned are high-quality (the devil is in the detail!). My main concern with all the hub-bub going on around guest blogging is that in say 18 months time when Google launches say, the Badger update, folks will have been buzzing along thinking they're building links that are Google-proof and then SMACK! they get hit by the update which filters out much of the low-quality guest posting that by then will probably be widespread. Even if you aren't doing guest blogging specifically to build links (and why would you when you consider all the other benefits to be reaped from this practice), the following factors are still worth considering. In the last post I published here on SEOmoz, I put some guest post outreach theories to the test and since then we've noticed a massive movement in the market with a number of the publishers we work with reporting more guest post submissions than ever before. As smart content marketers, we all need to make sure we're standing out with our outreach and keeping a keen eye on our quality radars when we are out placing guest posts on the web. Many of us will have seen Google's quality rater handbook which Google published to helps its army of human search quality raters improve the accuracy and relevance of their search results. This is well, the unofficial quality rater handbook for guest posting campaigns... Guest Post Quality Rater Handbook - Your field guide for evaluating guest post opportunities - Introduction Spammy links from poorly executed guest blogging campaigns have the potential to be your problem child links of the future. If you are doing any kind of link un-building for your clients or own websites right now then you will undoubtedly appreciate the need to be considered with your link building campaigns from here on out. The relevance and quality of the site Look for signs of integrity You need to be confident of the integrity of publishers you guest post to because you want to know they aren't going to compromise your link profile later down the road by deciding to overtly sell links perhaps (making it seem like you paid for your link as well) or open the floodgates to guest post submissions from anybody (dramatically decreasing the potential value of your post and lumping your site in with the rest who came to the party late!). Obviously you'll never be able to guarantee a link won't turn bad in future but you want to minimise the chance of this happening and observing some of the site criteria laid out here will help to do that. Signs of integrity: Established website Cited as an authoritative resource Operated by a thought-leader Clear editorial and business objectives A 'real' organisation behind the website e.g. physical address Look for social media activity (& other signs of life) An active presence on social media platforms and other general signs of life such as email newsletters give you a good indication that the site owner or publisher is at least attempting to be active within their community which would tend to suggest they are running a genuine website and will hopefully continue to publish for many years to come. Obviously this isn't a hard and fast rule since an active Facebook page now doesn't necessarily mean the blogger won't disappear in six months time but you will likely get a gut feeling about these kinds of things. Don't equate more social network profiles (and links to those profiles in the sidebar) as necessarily better, but rather look for the quality of interactions on those platforms. Additionally as we move towards a link landscape that looks set to include factors like AgentRank/AuthorRank, guest posting on a website that is operated by an individual or organisation with a high level of trust, expertise and perceived authority is going to put you way ahead of the curve - get into the mindset of 'who' you get links from rather than 'where'. Look for signs of a blogger or editorial staff A community blog is one thing (a good thing) but it is quite another to have a site which is little more than a relentless flow of junk guest post after junk guest post. A site without signs of regular editorial staff or in most cases one consistent blogger tends to raise alarm bells for me. Browse the about page to see what the deal is. A site without a driving editorial force behind it can often descend into little more than a blog \"for SEO\". Naturally there will be instances where a site is operated by a \"curator\" who doesn't necessarily do a great deal of day-to-day writing but you'll get the sense that they still drive the site behind the scenes and will still from time to time pen some of their thoughts. Look at their linking protocols A website which understands what guest posting is really about is one that trusts their contributors in the sense that they don't mind how many links you include in your article just so long as you are sensible with self-promotion. If post after post has nothing more than two bio links (and the site's guidelines on links prevent you from ANY links in the article) then we're heading once again towards the realms of a page that could potentially be perceived as being for SEO purposes. Where applicable, an authentic article is likely to have additional links and not just to the obvious choice (Wikipedia). Look at site structure The architecture of the website will be one of the crucial factors when it comes to the lifetime value that you get from the link. The further away (in terms of clicks) a page is from the homepage arguably the less valuable it becomes. If the website you are targeting has a poor structure then you face the prospect of a link that you are working hard to earn now, diminishing in value over time as it slowly falls almost entirely off the link graph. Would a link from this website make sense from a user's perspective? Relevance when it comes to guest posting doesn't necessarily mean \"a website in the same industry\", it should simply fulfill the above criteria and make sense from the user's point of view for example a link to an invoicing app would make sense on an SEO blog if for example the content brought the two topics together. In many industries, securing directly relevant links isn't necessarily a possibility because the other blogs in the space may well be competitors (not all industries are as friendly as us SEO folk remember!) Does the site publish guest posts from just about anyone? There is no real need to check the quality of every single site the link opportunity links out to themselves but a quick audit of the kinds of websites they've allowed to guest post in the past might be a good idea (a simple linkfromdomain: search in Bing will speed this up). One or two off-topic sites being linked out to is often completely natural and entirely forgivable but stuff like this doesn't sit right with me: (Name blurred to try my best to protect the individual and companies concerned.) This is a bio found by my team on a graphic design blog which had basically turned over its editorial calendar to anyone just about anyone interested in contributing. The task management link I can see the relevance for the user but \"nursing tops\"?? I'm not so sure. Interestingly, the page this bio was found on was recently de-indexed by Google which potentially indicates how Google feels about this kind of thing. Although that being said I have found other instances of this bio used by the guest blogger on other websites so I can't categorically say these bios are a bad idea - although common sense would suggest it is :-) Widespread irrelevant linking makes you wonder whether the publisher or blogger is prepared to whore out their blog literally to anyone willing to provide a morsel of content. These kinds of editorial practices make the website appear to be \"made for SEO\" so links may have a short-term value but long-term stability is somewhat more debatable. Lack of recent updates A fairly obvious factor to consider but the lack of updates (or even inconsistency of updates) can make a website unattractive from a guest posting perspective. Not only does it greatly diminish the chance of the publisher agreeing to your pitch because chances are their attention is elsewhere than their evidently unloved site, but it is also potentially an indication of the publishers lack of commitment to the project which may result in the site going offline next time the domain needs renewing, obviously rendering any link you earned redundant. In some situations this could actually be an opportunity though for example if a blogger has gone on a temporary hiatus or a planned break and it says so on the website, now's your chance to swoop in with a pitch to providing content for the site's triumphant return! More ads than content When a website owner chooses to disregard user experience in favour of a quick buck, it says a fair amount about their mindset and their ultimate aim. A smart publisher recognises that audience satisfaction and considerable, sustainable profits go hand in hand so when I see a site with advertising that quite frankly gets in the way of enjoying the content, it definitely concerns me. Far be it from me to determine how you monetise your website but when it comes to identifying good guest post opportunities, factors like this are definitely a key consideration. If you put your SEO hat on; excessive ads are a quality consideration of Google as since Panda they have \"the mechanism to evaluate the balance of ads versus original content on web pages\" see here and here. Whether you care to believe that a link can harm your rankings or not, a site which has been hit by Panda is probably unlikely to send much referral traffic either. Either which way you cut it, the opportunity looks less appealing when there is an excessive amount of advertising. See Google's best practices for ad placements for additional guidance: Irrelevant and (likely paid links) in the sidebar I've no interest in getting into a debate about the ethics surrounding paid links, it isn't the paid part that bothers me, it is the relevance that I am concerned with. Based on what we have seen so far from the Penguin update, one factor that links the pages that we've seen de-indexed (of the URLs we've analysed) are the ones that have considerable numbers of irrelevant and often spammy outbound links. Relevance is a key factor for \"future-proof\" link building. This I would think is on the basis that Google is assuming a lengthy list of irrelevant links is likely to be manipulative link building tactic given that if you removed SEO from the equation nobody would place a link on a page like that since few users would actually visit or use the page. Google can determine the location on the page of a link so yours (within your guest post) would be marginally more valuable but from a trust point of view, a website which overtly sells links to pass PageRank may not be the best place to publish your content. There's no hard and fast rule here because things like blogrolls can be perfectly legitimate (watch out though!). In reality, it goes back to the whole mindset and integrity thing which is that if a publisher is happy to sell links to just about anyone, load a page up with ads and so on, are they likely to be here in the future? Is all your hard work going to be for nothing when they burn their domain and move on to the next project? Be wary of the article submission form A website having an article submission form doesn't in itself categorise the quality of the site, however there are various 'blogs' out there which masquerade as a blog but are in reality little more than a thematic article directory. It can seem like an easy way to place guest posts just submitting your content via a submission form and whilst there are various really worthwhile blogs out there that you can submit to via a form, the mantra of an easy link being a less valuable link is definitely something you should be at least considering at this point. Bear in mind that if it is easy to submit then there may be hundreds or even thousands of posts in the queue before yours making the exercise a somewhat pointless one. We see the submission form as a flag, and I recommend you double check that you are otherwise satisfied with the quality, integrity and overall metrics of the website before you submit. Another point worth remembering is that if the blog has a submission form but no contact details it can be impossible to follow up on your submission to confirm the publication which means it was a complete waste of time in the first place. No contact details You do have to question why a website would not have contact details or at least a contact form. Not having a way to get hold of the individual or organisation behind the website is a real deal breaker because not only can you not pitch them (obviously) if you can submit via some kind of form (see above) then you can't follow up with them in the future. A lack of contact details in some instances broadcasts a fairly strong signal as to the site's intentions and overall operating policies because perhaps they don't want to be contacted because they don't wish to be associated with the content (probably not good) or because they are running so many other mediocre blogs and websites that they don't want the hassle of emails to deal with (probably not a good thing either). By and large, legitimate websites have contact details, and you want to guest post to legitimate websites. Thin, low quality content Another category of site that we have observed coming under heavy fire following Penguin was the article directory with many pages being de-indexed. A common characteristic of these pages (apart from the fact that none are currently indexed by Google) is that they have poorly written content, that is very brief and then contains between 1 and 3 keyword rich links to the same site. Was it the link pattern that got these pages flagged? The poorly written content? The lack of detail in the content? It is difficult to say with complete confidence but to ensure the longevity of the guest posts you are publishing, be sure to take a wide berth of any websites that appear to have practically no editorial standards. If you think logically and look historically, Google combats chinks in their armour one by one and given that it has hit article directories, one could assume that somewhere down the line, low-quality guest posts could be the next in line to be devalued. Richard Baxter's High-Quality Web Sites post is recommended reading at this point. The link metrics It can be very easy to approach guest posting purely from a link building for ranking perspective but it is advisable to examine the criteria outlined above in addition to the following metrics. In other words, take off your \"metric blinkers\" and without a doubt employ some flexibility because if you are focusing solely on getting links \"with a higher PageRank than your own website\" then you are probably approaching this link acquisition thing all wrong. There is no hard and fast rule when it comes to metrics as to what makes a good guest post opportunity, you will just want to ensure that each aligns with your current online marketing strategy and goals. Look at a range of metrics There are plenty of good reasons to get links from a site which doesn't necessarily fit perfectly within your box of criteria. Evaluating the strength of a link entirely based on one metric is a flawed strategy. Some metrics you might like to consider PageRank MozRank MozTrust Domain Authority ACRank Link count The key is to understand and identify a broad range of metrics that align with your strategy and current goals. If you are unsure try this infographic to see how the SEO community as a whole evaluates links. Link profile diversity If you have one of the mainstream SEO toolbars installed then you can see at a glance a website with a suspicious looking link profile e.g. 48,000 links but only three root domains linking. As part of our link evaluation process we always have a quick poke around the website's link profile to see where their authority is coming from. It is always a red flag for us when a site has a fairly ropey link profile because our aim is to score high-quality links that have longevity for our clients, with all the resources that are necessary to successfully link un-build, we don't want to be developing associations with sites that could do more harm than good long term. Generally speaking if you follow many of the guidelines outlined above, link profile diversity is unlikely to be an issue. Look at their advertising stats Many reputable online publishers produce resource packs and detailed pages specific to their prospective advertisers, this is often a gold-mine of data for link prospectors. See information such as traffic levels, subscribers, demographics and much more besides. Take what they say with a pinch of salt but by and large the data is usually quite accurate so the information provided can act as a good reference point. On a similar vein, advertising networks such as BuySellAds.com can also be useful way to evaluate the value of an opportunity and see various metrics at a glance. Does the link have revenue potential? If it aligns with the goals of your online marketing then it can be worthwhile evaluating guest post opportunities based on how likely the referral traffic is to convert. A tactic we have used successfully in a few industries is identifying guest post opportunities that have conversion potential by utilising the following methodology: Find 5-10 websites of clients you would like to work with One-by-one enter them into Open Site Explorer Since most comments are no-follow, select the option to filter by ‘only no followed’ You get a list of blogs that your prospects are engaged enough with to comment Identify common blogs (where a number of your target customers spend their time) Pitch them with your guest post – you get a strong industry link AND the traffic and conversion potential of a spot on a blog that is well-known to your target customer base. This technique isn't applicable in every industry and certainly isn't completely foolproof but it can help to identify the right websites to target in your industry. You get a list of blogs that potential customers read, know and respect – perfect for pitching to since you can say with some degree of certainty that time invested in creating content for this site will be worthwhile. Don't discount the newbie The point remains that you shouldn't don your metric blinkers and forget all about opportunities on slightly newer websites which are perhaps up and coming. These kinds of link opportunities will appreciate over time and when mixed with other more current link opportunities make for a potent guest posting campaign. Recommended reading Ross Hudgens talks Lifetime Link Value (LLV) How to evaluate link prospects James Agate is the founder of Skyrocket SEO - find out more about our content marketing & link building services and get signed up to the Guest Blogging Track for more guest posting best practices just like this, plus case studies, honest advice and more. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Evaluate Guest Post Opportunities"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Evaluate Guest Post Opportunities"
    },
    {
      "level": "H2",
      "text": "Guest Post Quality Rater Handbook"
    },
    {
      "level": "H3",
      "text": "Introduction"
    },
    {
      "level": "H3",
      "text": "The relevance and quality of the site"
    },
    {
      "level": "H3",
      "text": "The link metrics"
    },
    {
      "level": "H3",
      "text": "Recommended reading"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "James Agate\n          \n            James Agate\n          \n            James Agate"
}