{
  "url": "https://moz.com/blog/how-to-write-marketing-case-studies-that-convert",
  "slug": "how-to-write-marketing-case-studies-that-convert",
  "title": "How to Write Marketing Case Studies That Convert - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "From getting client buy-in to storytelling to repurposing the content, investing in case studies can have powerful and long-lasting benefits. Learn how to craft a compelling, converting case study from the content experts at Fractl.",
  "content": "How to Write Marketing Case Studies That Convert Content Marketing By: Kerry Jones November 28, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Kerry Jones November 28, 2017 How to Write Marketing Case Studies That Convert Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In my last post, I discussed why your top funnel content shouldn’t be all about your brand. Today I’m making a 180-degree turn and covering the value of content at the opposite end of the spectrum: content that’s directly about your business and offers proof of your effectiveness.Specifically, I’m talking about case studies.I’m a big believer in investing in case studies because I’ve seen firsthand what happened once we started doing so at Fractl. Case studies were a huge game changer for our B2B marketing efforts. For one, our case studies portfolio page brings in a lot of traffic – it’s the second most-visited page on our site, aside from our home page. It also brings in a significant volume of organic traffic, being our fourth most-visited page from organic searches. Most importantly, our case studies are highly effective at converting visitors to leads – about half of our leads view at least one of our case studies before contacting us.Assuming anyone who reads the Moz Blog is performing some type of marketing function, I’m zeroing in on how to write a compelling marketing case study that differentiates your service offering and pulls prospects down the sales funnel. However, what I’m sharing can be used as a framework for creating case studies in any industry.Get your client on board with a case studyMarketers shy away from creating case studies for a few reasons:They’re too busy “in the weeds” with deliverables.They don’t think their results are impressive enough.They don’t have clients’ permission to create case studies.While I can’t help you with #1 and #2 (it’s up to you to make the time and to get the results deserving of a case study!), I do have some advice on #3.In a perfect world, clients would encourage you to share every little detail of your time working together. In reality, most clients expect you to remain tight-lipped about the work you’ve done for them.Understandably, this might discourage you from creating any case studies. But it shouldn’t.With some compromising, chances are your client will be game for a case study. We’ve noticed the following two objections are common regarding case studies.Client objection 1: “We don’t want to share specific numbers.”At first it you may think, “Why bother?” if a client tells you this, but don’t let it hold you back. (Truth is, the majority of your clients will probably feel this way).In this instance, you’ll want your case study to focus on highlighting the strategy and describing projects, while steering away from showing specific numbers regarding short and long-term results. Believe it or not, the solution part of the case study can be just as, or more, compelling than the results. (I’ll get to that shortly.)And don’t worry, you don’t have to completely leave out the results. One way to get around not sharing actual numbers but still showing results is to use growth percentages.Specific numbers: “Grew organic traffic from 5,000 to 7,500 visitors per month”Growth percentage: “Increased organic traffic by 150%”We do this for most of our case studies at Fractl, and our clients are totally fine with it.Client objection 2: “We don’t want to reveal our marketing strategy to competitors.”A fear of giving away too much intel to competitors is especially common in highly competitive niches.So how do you get around this?Keep it anonymous. Don’t reveal who the client is and keep it vague about what niche they’re in. This can be as ambiguous as referring to the client as “Client A” or slightly more specific (“our client in the auto industry”). Instead, the case study will focus on the process and results – this is what your prospects care about, anyway.Gather different perspectivesUnless you were directly working with the client who you are writing the case study about, you will need to conduct a few interviews to get a full picture of the who, what, how, and why of the engagement. At Fractl, our marketing team puts together case studies based on interviews with clients and the internal team who worked on the client’s account.The clientArrange an interview with the client, either on a call or via email. If you have multiple contacts within the client’s team, interview the main point of contact who has been the most involved in the engagement.What to ask:What challenge were you facing that you hired us to help with?Had you previously tried to solve this challenge (working with another vendor, using internal resources, etc.)?What were your goals for the engagement?How did you benefit from the engagement (short-term and long-term results, unexpected wins, etc.)?You’ll also want to run the case study draft by the client before publishing it, which offers another chance for their feedback.The project teamWho was responsible for this client’s account? Speak with the team behind the strategy and execution. What to ask:How was the strategy formed? Were strategic decisions made based on your experience and expertise, competitive research, etc.?What project(s) were launched as part of the strategy? What was the most successful project?Were there any unexpected issues that you overcame?Did you refine the strategy to improve results?How did you and the client work together? Was there a lot of collaboration or was the client more hands-off? (Many prospective clients are curious about what their level of involvement in your process would look like.)What did you learn during the engagement? Any takeaways?Include the three crucial elements of a case studyThere’s more than one way to package case studies, but the most convincing ones all have something in common: great storytelling. To ensure you’re telling a proper narrative, your case study should include the conflict, the resolution, and the happy ending (but not necessarily in this order).We find a case study is most compelling when you get straight to the point, rather than making someone read the entire case study before seeing the results. To grab readers’ attention, we begin with a quick overview of conflict-resolution-happy ending right in the introduction.For example, in our Fanatics case study, we summarized the most pertinent details in the first three paragraphs. The rest of the case study focused on the resolution and examples of specific projects.Let’s take a look at what the conflict, resolution, and happy ending of your case study should include.The Conflict: What goal did the client want to accomplish?Typically serving as the introduction of the case study, “the conflict” should briefly describe the client’s business, the problem they hired you to work on, and what was keeping them from fixing this problem (ex. lack of internal resources or internal expertise). This helps readers identify with the problem the client faced and empathize with them – which can help them envision coming to you for help with this problem, too.Here are a few examples of “conflicts” from our case studies:“Movoto engaged Fractl to showcase its authority on local markets by increasing brand recognition, driving traffic to its website, and earning links back to on-site content.”“Alexa came to us looking to increase awareness – not just around the Alexa name but also its resources. Many people had known Alexa as the site-ranking destination; however, Alexa also provides SEO tools that are invaluable to marketers.”“While they already had strong brand recognition within the link building and SEO communities, Buzzstream came to Fractl for help with launching large-scale campaigns that would position them as thought leaders and provide long-term value for their brand.”The Resolution: How did you solve the conflict?Case studies are obviously great for showing proof of results you’ve achieved for clients. But perhaps more importantly, case studies give prospective clients a glimpse into your processes and how you approach problems. A great case study paints a picture of what it’s like to work with you.For this reason, the bulk of your case study should detail the resolution, sharing as much specific information as you and your client are comfortable with; the more you’re able to share, the more you can highlight your strategic thinking and problem solving abilities.The following snippets from our case studies are examples of details you may want to include as part of your solution section:What our strategy encompassed:“Mixing evergreen content and timely content helped usher new and existing audience members to the We Are Fanatics blog in record numbers. We focused on presenting interesting data through evergreen content that appealed to a variety of sports fans as well as content that capitalized on current interest around major sporting events.” - from Fanatics case studyHow strategy was decided:“We began by forming our ideation process around Movoto’s key real estate themes. Buying, selling, or renting a home is an inherently emotional experience, so we turned to our research on viral emotions to figure out how to identify with and engage the audience and Movoto’s prospective clients. Based on this, we decided to build on the high-arousal feelings of curiosity, interest, and trust that would be part of the experience of moving.We tapped into familiar cultural references and topics that would pique interest in the regions consumers were considering. Comic book characters served us well in this regard, as did combining publicly available data (such as high school graduation rates or IQ averages) with our own original research.” - from Movoto case studyWhy strategy was changed based on initial results:“After analyzing the initial campaigns, we determined the most effective strategy included a combination of the following content types designed to achieve different goals [case study then lists the three types of content and goals]...This strategy yielded even better results, with some campaigns achieving up to 4 times the amount of featured stories and social engagement that we achieved in earlier campaigns.” - from BuzzStream case studyHow our approach was tailored to the client’s niche:“In general, when our promotions team starts its outreach, they’ll email writers and editors who they think would be a good fit for the content. If the writer or editor responds, they often ask for more information or say they’re going to do a write-up that incorporates our project. From there, the story is up to publishers – they pick and choose which visual assets they want to incorporate in their post, and they shape the narrative.What we discovered was that, in the marketing niche, publishers preferred to feature other experts’ opinions in the form of guest posts rather than using our assets in a piece they were already working on. We had suspected this (as our Fractl marketing team often contributes guest columns to marketing publications), but we confirmed that guest posts were going to make up the majority of our outreach efforts after performing outreach for Alexa’s campaigns.” - from Alexa case studyWho worked on the project:Since the interviews you conduct with your internal team will inform the solution section of the case study, you may want to give individuals credit via quotes or anecdotes as a means to humanize the people behind the work. In the example below, one of our case studies featured a Q&A section with one of the project leads.The Happy Ending: What did your resolution achieve?Obviously, this is the part where you share your results. As I mentioned previously, we like to feature the results at the beginning of the case study, rather than buried at the end.In our Superdrug Online Doctor case study, we summarized the overall results our campaigns achieved over 16 months:But the happy ending isn’t finished here.A lot of case studies fail to answer an important question: What impact did the results have on the client’s business? Be sure to tie in how the results you achieved had a bottom-line impact.In the case of Superdrug Online Doctor, the results from our campaigns lead to a 238% increase in organic traffic. This type of outcome has tangible value for the client.You can also share secondary benefits in addition to the primary goals the client hired you for.In the case of our client Busbud, who hired us for SEO-oriented goals, we included examples of secondary results.Busbud saw positive impacts beyond SEO, though, including the following:Increased blog trafficNew partnerships as a result of more brands reaching out to work with the siteBrand recognition at large industry eventsAn uptick in hiringFeatured as a “best practice” case study at an SEO conferenceSimilarly, in our Fractl brand marketing case study, which focused on lead generation, we listed all of the additional benefits resulting from our strategy.How to get the most out of your case studiesYou’ve published your case study, now what should you do with it?Build a case study page on your siteOnce you've created several case studies, I recommend housing them all on the same page. This makes it easy to show off your results in a single snapshot and saves visitors from searching through your blog or clicking on a category tag to find all of your case studies in one place. Make this page easy to find through your site navigation and internal links.While it probably goes without saying, make sure to optimize this page for search. When we initially created our case study portfolio page, we underestimated its potential to bring in search traffic and assumed it would mostly be accessed from our site navigation. Because of this, we were previously using a generic URL to house our case study portfolio. Since updating the URL from “frac.tl/our-work” to “frac.tl/content-marketing-case-studies,” we’ve jumped from page 2 to the top #1–3 positions for a specific phrase we wanted to rank for (“content marketing case studies”), which attracts highly relevant search traffic.Use case studies as concrete proof in blog posts and off-site contentCase studies can serve as tangible examples that back up your claims. Did you state that creating original content for six months can double your organic traffic? On its own, this assertion may not be believable to some, but a case study showing these results will make your claim credible.In a post on the Curata blog, my colleague Andrea Lehr used our BuzzStream case study to back up her assertion that in order to attract links, social shares, and traffic, your off-site content should appeal to an audience beyond your target customer. Showing the results this strategy earned for a client gives a lot more weight to her advice.On the same note, case studies have high linking potential. Not only do they make a credible citation for your own off-site content, they can also be cited by others writing about your service/product vertical. Making industry publishers aware that you publish case studies by reaching out when you’ve released a new case study can lead to links down the road.Repurpose your case studies into multiple content formatsCreating a case study takes a lot of time, but fortunately it can be reused again and again in various applications.Long-form case studiesWhile a case study featured on your site may only be a few hundred words, creating a more in-depth version is a chance to reveal more details. If you want to get your case study featured on other sites, consider writing a long-form version as a guest post.Most of the case studies you’ll find on the Moz Blog are extremely detailed:How We Ranked #1 for a High Volume Keyword in Under 3 Months walks through the 8-step process used to achieve the impressive result called out in the headline.The Anatomy of a $97 Million Page: A CRO Case Study offers much greater detail and insights than the case studies featured on the Conversion Wizards site.The Roadmap for Creating Share-Worthy Content with Massive Distribution used one of our campaign case studies to illustrate our overall process for creating shareable widely-shared content.VideoHubSpot has hundreds of case studieson its site, dozens of which also feature supplemental video case studies, such as the one below for Eyeota.Don’t feel like you have to create flashy videos with impressive production value, even no-frills videos can work. Within its short case study summaries, PR That Converts embeds videos of clients talking about its service. These videos are simple and short, featuring the client speaking to their webcam for a few minutes.Speaking engagementsMarketing conferences love case studies. Look on any conference agenda, and you’re sure to notice at least a handful of speaker presentations focused on case studies. If you’re looking to secure more speaking gigs, including case studies in your speaking pitch can give you a leg up over other submissions – after all, your case studies are original data no one else can offer.My colleague Kelsey Libert centered her MozCon presentation a few years ago around some of our viral campaign case studies.Sales collateralAs I mentioned at the beginning of this post, many of our leads view the case studies on our site right before contacting us about working together. Once that initial contact is made, we don’t stop showing off our case studies.We keep a running “best of” list of stats from our case studies, which allows us to quickly pull compelling stats to share in written and verbal conversations. Our pitch and proposal decks feature bite-sized versions of our case studies.Consider how you can incorporate case studies into various touch points throughout your sales process and make sure the case studies you share align with the industry and goals of whoever you're speaking with.I’ve shared a few of my favorite ways to repurpose case studies here but there are at least a dozen other applications, from email marketing to webinars to gated content to printed marketing materials. I even link to our case studies page in my email signature.My last bit of advice: Don’t expect immediate results. Case studies typically pay off over time. The good news is it’s worth the wait, because case studies retain their value – we’re still seeing leads come in and getting links to case studies we created three or more years ago. By extending their lifespan through repurposing, the case studies you create today can remain an essential part of your marketing strategy for years to come. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Write Marketing Case Studies That Convert"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Write Marketing Case Studies That Convert"
    },
    {
      "level": "H2",
      "text": "Get your client on board with a case study"
    },
    {
      "level": "H4",
      "text": "Client objection 1: “We don’t want to share specific numbers.”"
    },
    {
      "level": "H4",
      "text": "Client objection 2: “We don’t want to reveal our marketing strategy to competitors.”"
    },
    {
      "level": "H2",
      "text": "Gather different perspectives"
    },
    {
      "level": "H4",
      "text": "The client"
    },
    {
      "level": "H4",
      "text": "The project team"
    },
    {
      "level": "H2",
      "text": "Include the three crucial elements of a case study"
    },
    {
      "level": "H3",
      "text": "The Conflict: What goal did the client want to accomplish?"
    },
    {
      "level": "H3",
      "text": "The Resolution: How did you solve the conflict?"
    },
    {
      "level": "H3",
      "text": "The Happy Ending: What did your resolution achieve?"
    },
    {
      "level": "H2",
      "text": "How to get the most out of your case studies"
    },
    {
      "level": "H3",
      "text": "Build a case study page on your site"
    },
    {
      "level": "H3",
      "text": "Use case studies as concrete proof in blog posts and off-site content"
    },
    {
      "level": "H3",
      "text": "Repurpose your case studies into multiple content formats"
    },
    {
      "level": "H4",
      "text": "Long-form case studies"
    },
    {
      "level": "H4",
      "text": "Video"
    },
    {
      "level": "H4",
      "text": "Speaking engagements"
    },
    {
      "level": "H4",
      "text": "Sales collateral"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kerry Jones\n          \n            Kerry Jones\n          \n            Kerry Jones"
}