{
  "url": "https://moz.com/blog/how-to-deal-with-the-problem-child-in-your-adwords-campaign",
  "slug": "how-to-deal-with-the-problem-child-in-your-adwords-campaign",
  "title": "How to Deal with the Problem Child in Your Adwords Campaign - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In my current role, I manage Google Adwords campaigns for a wide range of clients in a pretty diverse range of sectors – from charitable organisations to car insurance.  Almost without exception every client has a keyword which I call the problem child.  The problem child keyword is typically: very…",
  "content": "How to Deal with the Problem Child in Your Adwords Campaign Paid Search Marketing (PPC) H By: Helene Hall August 11, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! H By: Helene Hall August 11, 2008 How to Deal with the Problem Child in Your Adwords Campaign Paid Search Marketing (PPC) This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. In my current role, I manage Google Adwords campaigns for a wide range of clients in a pretty diverse range of sectors – from charitable organisations to car insurance. Almost without exception, every client has a keyword which I call the problem child. The problem child keyword is typically: very relevant (it expresses precisely whatever product or service they sell, with little or no ambiguity) high volume (albeit if only for that particular niche) has high advertiser competition high cost per click As such, the problem child keyword converts and accounts for a high percentage of the total conversions, BUT the cost per conversion is too high. Now, much as we’d like to simply get rid of this problem child, we can’t. Our client needs the volume this keyword generates and also wants to appear for this keyword for branding reasons. The client wants that keyword, and those conversions, and for it to cost less – so what’s a girl to do? Supernanny would probably elect to put the problem child on the naughty step. But seeing as keywords never apologise for misbehaving, I’d recommend that a more effective strategy might be to put that problem child in an ad group all on its own. This gives you ultimate control of that problem child. Once you’ve got this baby alone, your focus should be to get it knuckle down and work for you. Here are some of the techniques I use: Enter the keyword as broad, phrase and exact match. Over time you can see which works best for you and adjust your bids accordingly. Write yourself some killer ad copy. You’ve only one keyword, so you can be extremely tightly focussed. Experiment with position preference to see which position works best for you (NB: this may be a case of balancing volume with cost). Not done this before? See http://adwords.google.com/support/bin/answer.py?hl=en&answer=36482 Run a search query report and add in any negative keywords at an ad group level – if you’re dealing with just one keyword, you’ll find you can be far more ruthless with negatives as you won’t have to worry about the potential impact on other keywords. Create a bespoke landing page to maximise conversion. Is all this work really worth it for just one keyword? Obviously I think so, but let’s open it to the floor – anyone else care to share how they deal with the problem child in their campaigns? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Deal with the Problem Child in Your Adwords Campaign"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Deal with the Problem Child in Your Adwords Campaign"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Helene Hall\n          \n            Helene Hall"
}