{
  "url": "https://moz.com/blog/how-to-create-and-run-an-effective-scholarship-outreach-campaign",
  "slug": "how-to-create-and-run-an-effective-scholarship-outreach-campaign",
  "title": "How to Create and Run an Effective Scholarship Outreach Campaign - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "An effective scholarship outreach campaign begins with identifying the ideal audience, for your scholarship and for the links.",
  "content": "How to Create and Run an Effective Scholarship Outreach Campaign Link Building | Advanced SEO | Email Marketing By: Chris Dreyer November 6, 2015 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Chris Dreyer November 6, 2015 How to Create and Run an Effective Scholarship Outreach Campaign Link Building | Advanced SEO | Email Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. SEOs are always looking to develop cleverer ways to get links to their sites and those of their clients. A strategy that has been particularly effective for us is to create scholarship campaigns aimed at getting authoritative links from well-trafficked .edu domains. Although there is nothing inherently better about these TLDs (and there are certainly other ways to acquire them), they tend to have a greater impact for the time spent on a campaign, a lower cost per link acquisition and the secondary benefit of enhancing the images of our clients. Why scholarship campaigns are beneficial(It’s not just about links)As we mentioned before, there is nothing inherently better about an .edu domain compared with other TLDs. However, because of the specialized process for acquiring an .edu domain name and the authority that applicants who receive them naturally have, these domains tend to be far more beneficial to receive links from.Link building campaigns offering true user benefits while fulfilling secondary objectives are better investments of both time and money. A well-crafted, meaningful scholarship campaign can enhance a company's brand image while giving it visibility in search results.In the end, the business is not just paying to have links built to their site. They are also investing in their public image, which can pay dividends over and over again. Send the right signals People interested in the scholarship will follow the link to an informational page on your domain (which we’ll talk about later) and stay there to read requirements. As long as scholarship information is informative and helpful, people will linger. When people stay on site, signals like dwell time become more positive. This signals Google that the site is one where people want to stay and consume content. Increase visibility in social channels A rather large population of college-aged students is thoroughly attached to social networks. It is how a good portion of them get their news, stay connected with friends, make purchasing decisions, and consume entertainment. If a college student finds a page on your website offering free money for school, it is highly likely they will share the information with their network. Generate secondary links In addition to the actual .edu links you are going for, a good scholarship campaign can generate secondary links. These are generally earned links (i.e., unsolicited and naturally acquired) that happen as a side effect of your campaign. For example, news outlets might pick up on your activities and write a news story about them. (This is more likely to happen if you offer your scholarship to an underserved population.)Produce quality link placement and anchor textScholarship campaigns can be especially beneficial because of the quality link placements they generally produce. There are many subtleties of link placement that can influence search engine rankings. For example, an institution promoting your scholarship generally won’t stick a link in the footer of a page or another place without context. They are going to put it where their visitors are likely to see it, such as in the copy of a web page about outside scholarships—or, at the very least, in a list with other scholarships.Developing the scholarshipYour scholarship will have a primary and secondary goal:Primary goal: Get links from .edu domains Secondary goal: Earn secondary links from other websites (e.g., news outlets, social media, and bloggers) If you develop a scholarship that strikes a chord with the media, you can pick up great links from authoritative news sites. For example, Casey Meraz points out that one client was able to get some additional links from The Wall Street Journal as a result of a well-executed scholarship campaign. You'll need to figure out the following: Who can apply? How do they apply? Where do they apply? (Mostly likely, this will be your website.) What is the deadline? How will applications be reviewed? What is the value of the award? After that, you’ll tie it all together with a scholarship landing page on your website. Who can apply? Don’t make this too narrow, or you will limit the amount of websites who will promote your scholarship for you. For instance, if you make a scholarship that only law students can apply for, only law schools are going to be interested in promoting it to their students. Here are some good (broad) concepts to target: Underserved populations. Scholarships for single mothers, minorities, parents of children with autism, first in family to go to college, etc. Protected classes of people. Offering a scholarship targeted to one of these groups will garner a huge amount of press and the authoritative links that come with it. Stick with what you know: Pick a cause you believe in, and develop a scholarship related to supporting it. Don’t limit yourself to concepts directly related to your business, as tempting as it may be. Remember, one of the key objectives here (aside from getting .edu links) is to get a lot of exposure for your campaign. How will people apply? Figure out what the application process will be for your scholarship. Here are some ideas for your application process: Essay submission Campaign integrated with social media Special interest groups, such as veterans, farmers, and gun rights advocates Have applicants meet certain criteria (i.e., make the scholarship merit-based) Remember not to make your application process too strict. The more people you can appeal to with your scholarship, the greater amount of schools you will be able to reach out to during your promotion. Where will people apply?Regardless of whether you have people submit information online or print off a PDF form, have a page on your site where that can be accomplished. The important part is to make applying easy. In many cases, this will mean creating an online application.The best-case scenario would be to have a call-to-action button on your scholarship page that links right to the online application.What's the application deadline?Make sure you set a deadline for your scholarship because you will be potentially promoting it across hundreds of sites. It is a good idea to have your scholarship renew on an annual basis (or on some other schedule) so that the links you build don’t disappear. (Schools are not likely to keep a link on their site to any scholarship that can no longer be applied for.)How will applicants be reviewed? This will obviously depend on the application criteria. Make a clear outline of how submissions will be evaluated. The last thing you want is a bunch of angry applicants were confused about what they were supposed to do to be considered for the scholarship. A confusing application process may also turn schools off to promoting your scholarship. Describe to applicants how scholarship award winners will be chosen. You don’t have to get super detailed here. Just mention in your description when and how scholarship recipients will be chosen, and when they should expect to be notified of awards.What is the value of the award? The award has to be worthwhile. For example, no one is going to care about a $200 scholarship. At the very least, you should make it around $1,000 dollars, but shoot for something higher if possible.Also, keep the following in mind: Assuming that eligible people apply for your scholarship, make sure that you pick a pick a winner and that they actually receive the money for it (or the equivalent) Promote the scholarship winner to increase the image of your business now—and help you get a lead on next year's scholarship campaign Communicate with other schools that may be promoting the scholarship Tying it all together Once you have the cornerstone for your scholarship in place, you can start building the foundation of your link building campaign: the scholarship landing page on your website. This will give educational institutions all the information they need in order to link to the scholarship. The scholarship page should contain the following:A brief description of the scholarship All the elements outlined above Functionality for applying (or instructions for the same) Contact information for people with questions Any disclaimers or other language important for the process You can also put this information on other marketing materials (print, email, etc.) Just keep in mind that the structure of the scholarship, its promotion, and the page on your website are paramount. Finding link targetsNow that you have the meat of your scholarship squared away, the next step is to find educational institutions that will promote it. Ideally, you want authoritative colleges and schools with .edu domains. There isn’t really a right or wrong method for doing this (but there are more effective strategies and less effective ones). Strategies that have worked for us are outlined below and can be used for your purposes. You can also use your own network, including current and past affiliations with relevant schools, to ask for links.Use Boolean Operators to find scholarship pages Use specific search operators to find pages on the Internet that already have businesses listed as offering scholarships. For example, the following operator tells Google to look for URLs with \".edu\" and the exact-match keyword \"scholarships.\"Inurl: .edu “scholarships” This query gets us the results below. The benefit of looking for pages with this method is that you don’t have to go to an institution’s website and dig through their pages to find relevant scholarship information. Keep in mind, though, that this this is just one combination of Booleans Operators that may be helpful to you, and there are many others you may want to look at using.Just clicking on the first result for Iowa State University takes us to the institution’s financial aid page. Not all schools will have the same setup. Some may have pages devoted to certain types of scholarships, while others may lump all types of scholarship together. For the one below, notice the huge button that says “Privately Funded Scholarships.”Click through and bingo, you have your list of businesses inviting ISU students to apply scholarship money.Before we move on, check out the do-follow link the law firm below got from the ISU site by offering its visitors the opportunity to apply for a scholarship.Using the method above, find 10-12 (or more) scholarship pages with businesses listed. Record those business’ URLs, as you will need them to follow along with the next step of this process.Use Open Site Explorer to spy on businesses and find relevant domainsNot all businesses listed on scholarship pages are there as a result of link building campaigns. That is why it’s important to get a lot of businesses from multiple scholarship pages. The idea here is to find as many .edu domains as you can that have accepted private funding opportunities from businesses (and also provide links to the sponsors' websites). You can do that by looking for other .edu domains that may have linked to a business' website, which is what we will do with Open Site Explorer (OSE).Take the URLs from the businesses you found on the scholarship pages and plug them into OSE one at a time, which is a great tool that can show you all of the pages that link link to a domain.OSE will show you all of the links it can find to the page you paste into its user interface. Make sure you put the EXACT URL you found on the scholarship page into OSE. Otherwise, you may not find other .edu domains linking to that particular website. The default view will show you all links even from multiple domains. All you really care about are the root domains so use the check box “Group by sub-domain.” This will show you the top-level domains so that you can easily pick out the .edu ones.These are the domains that you will use as your targets for your scholarship campaign. The underlying theory is that these institutions have accepted another business’s offer of private funding for their students and they have put a link on their site. Why wouldn’t they accept yours as well? This strategy also helps you narrow down your search for targets. Now you know that the schools you reach out to are likely to give you what you want and you don’t have to cast a wide net. If you have found 10-12 scholarship pages and pulled businesses from those pages, you should have a lot to work with. This part is pretty tedious work but is necessary until you have a decent list of .edu domains for your outreach. Try to build up a list of a few hundred or more. Creating your master list for outreachThroughout this entire process, it’s important to stay organized. Start a spreadsheet and add the .edu domains to it. Add other columns for contact information.For example, add one column for emails and another one for phone numbers. For the most part, you will be sending emails during your outreach, but phone calls certainly are not off limits.If you’re at a loss for ideas on keeping your campaign organized or lack the tools needed, here’s a good post on the different strategies and tools available to help you organize your SEO mess.Contacts at these institutions will vary. When it comes to placing links on websites, most of the time you want to talk to a webmaster. However, in this instance you'll want to talk to a school’s financial aid department. This information can typically be found on the school’s financial aid pages (probably the same ones you pulled business information from). OutreachContacting schools to list your scholarship is your next task. In our experience, sustaining a targeted email outreach campaign over several months is the trick to a successful outcome. This is where that well-curated, expansive list of names you generated earlier will come in handy.Crafting your email Basically, you want to create an email that explains what the scholarship is and how the firm would like to make it available to a school’s current and potential students. You can make a template to work from, but stay away from automation. Below is a sample email we used for a law firm:Tailoring emails to the department or person receiving it will increase conversions. Note that the more schools you reach out to, the greater your chance of getting a decent amount of links is.Case studies and metricsWe’re firm believers in practicing applied SEO, not theoretical SEO. Below is some sample data from a scholarship campaign we performed for a client that was very successful. We promoted a scholarship for the Levin Law Firm. Here are the results:Referring domains acquired: 100 Cost per link acquisition: $10/acquired referring domain Amount of time for outreach: 3-5 months Amount of scholarship: $1,000 Conversion rate: 10% We used the strategy outlined above to find link targets for our clients. We then spent 3-5 months reaching out to schools, asking them to promote the scholarship on their sites. Below is a screenshot of OSE taken after the campaign ended. Note the amount of .edu domains linking to our client's scholarship page, along with the DA of each one.How many .edu links should you acquire? To move the needle on your site with links, you have to build a lot of them, even if they're from high-quality sources. In our campaigns, we’ve seen a conversion rate of 10-15%. That means if you reach out to 500 schools, you are going to end up with 50-75 referring domains. That's not a bad haul; but, as you can see, there is a lot of legwork required to to get there. With this model, you can also figure out what your cost per link is. If you spend the minimum recommended budget of $1,000 dollars on your scholarship, you are looking at anywhere from $10 to $20 per link. Sending emails as personalized as possible will help increase your overall conversion rate, and keeping the scholarship on an annual basis will ensure your links stick around for a long time. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Create and Run an Effective Scholarship Outreach Campaign"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Create and Run an Effective Scholarship Outreach Campaign"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Why scholarship campaigns are beneficial"
    },
    {
      "level": "H3",
      "text": "(It’s not just about links)"
    },
    {
      "level": "H3",
      "text": "Send the right signals"
    },
    {
      "level": "H3",
      "text": "Increase visibility in social channels"
    },
    {
      "level": "H3",
      "text": "Generate secondary links"
    },
    {
      "level": "H3",
      "text": "Produce quality link placement and anchor text"
    },
    {
      "level": "H2",
      "text": "Developing the scholarship"
    },
    {
      "level": "H3",
      "text": "You'll need to figure out the following:"
    },
    {
      "level": "H3",
      "text": "Who can apply?"
    },
    {
      "level": "H3",
      "text": "How will people apply?"
    },
    {
      "level": "H3",
      "text": "Where will people apply?"
    },
    {
      "level": "H3",
      "text": "What's the application deadline?"
    },
    {
      "level": "H3",
      "text": "How will applicants be reviewed?"
    },
    {
      "level": "H3",
      "text": "What is the value of the award?"
    },
    {
      "level": "H3",
      "text": "Tying it all together"
    },
    {
      "level": "H2",
      "text": "Finding link targets"
    },
    {
      "level": "H3",
      "text": "Use Boolean Operators to find scholarship pages"
    },
    {
      "level": "H3",
      "text": "Use Open Site Explorer to spy on businesses and find relevant domains"
    },
    {
      "level": "H3",
      "text": "Creating your master list for outreach"
    },
    {
      "level": "H2",
      "text": "Outreach"
    },
    {
      "level": "H3",
      "text": "Crafting your email"
    },
    {
      "level": "H2",
      "text": "Case studies and metrics"
    },
    {
      "level": "H3",
      "text": "How many .edu links should you acquire?"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Chris Dreyer\n          \n            Chris Dreyer\n          \n            Chris Dreyer"
}