{
  "url": "https://moz.com/blog/how-to-analyze-keyword-difficulty-tooless",
  "slug": "how-to-analyze-keyword-difficulty-tooless",
  "title": "How To Analyze Keyword Difficulty - Tooless! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There is a lot of information on the web on how to do the basics of SEO yet it took me years to figure out the right way to analyze Keyword Difficulty.  I think there are a few reasons for this. One being that it’s a difficult subject to explain and it’s a lot more complicated than it looks.  I…",
  "content": "How To Analyze Keyword Difficulty - Tooless! Keyword Research D By: DavidHorne June 29, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! D By: DavidHorne June 29, 2009 How To Analyze Keyword Difficulty - Tooless! Keyword Research This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. There is a lot of information on the web on how to do the basics of SEO yet it took me years to figure out the right way to analyze Keyword Difficulty. I think there are a few reasons for this. One being that it’s a difficult subject to explain and it’s a lot more complicated than it looks. I know there is a keyword difficulty tool from SEOmoz that pretty much automates a lot of the process but I still find I like to get waste deep in data and would rather evaluate my keywords by hand. I am going to explain my method of keyword difficulty particularly for Google but I was hoping others could post their methods in the comments after this post. Before I explain my method I always do this research with SEO for Firefox installed from SEOBook.com, it’s a great tool for assessing the serps at a glance. Listed below is my method for assessing keyword difficulty and the explanations of why I do it: For the purpose of this post I will use the keyword Basket Weavers as my primary. 1. Direct search for the keyword in Google (Ex. Basket Weavers) I do this because I want to see what kind of results are showing up for my keyword. A common suggestion is to search for the term in quotes so that you are finding a phrase match and are only evaluating the websites that are competing for that term but the fact of the matter is the websites that are competition are the ones that showing up for a naked search on your keyword with no search operators. No one is going to search for \"Basket Weavers\" so your only accurate competition is the regular keyword search in Google. I then look at the Page level links that show up on SEO for Firefox. I do it on the page level because those are the links contributing to those pages rankings and domain level links are not a good measurement of rankings as they can be deceiving. If I see a lot of low numbers within the XX's then I immediately know that this is not a super competitive keyword. 2. Allinanchor Search for keyword in Google (Ex. allinanchor: \"Basket Weavers\") Ok this is an interesting one that I don’t see done a lot. What I am doing is search for the sites that have the keyword directly in their anchor text. I believe that this is the single most important metric to ranking and is how I evaluate all the keywords I analyze. For me on page SEO is a given I am really only interested in the off page campaigns as I will always optimize my websites on page. By retrieving the websites with anchor text targeted backlinks for this keyword I know what general level of competition the keyword is. 3. Cross reference Allinanchor Search and Direct Search My reasoning for comparing the two is I want to see wither that keyword will require a strong backlink campaign and is dominated by link builders or if top ranking sites are more on the Authoriy Domain side and a lot of sites are ranking because they are giant hubs that touch on the subject. For example Wikipedia is a giant hub that shows up for Basket Weavers. That tells me that I will need to do a lot of work to surpass the authority sites dominating this keyword's serps but it is still achievable. When analyzing the sites that show up with allinanchor I like to look for a website that has only a few links (less than 5) and then go back to the direct search serps and look through them until I find that website. That then tells me if I beat that websites backlink campaign and optimize my sites on page elements, I will rank above that website in the serps. Something I noticed is that a lot of the time you will find that top ranking websites doesn’t show up for the allinanchor search. This is because they are ranking high for a closely related term so Google seems to also rank them high for your target term. This is interesting because at a glance it seems impossible to beat that top website but the allinanchor tells you that the website is not actively targeting that term it is just ranking for it as its related (easy to beat these sites). 4. Analyze the backlinks of the top domain in both searches This is the most crucial step. When analyzing the backlinks I use SEO Elite as I find it to be the best tool for the job but any backlink analyzer is fine. After I have fetched all the backlinks for the domain I sort the backlinks by Pagerank. I then use the tool to highlight all of the links that have keyword targeted anchor text in them and record their pageranks. I then add all the recorded pageranks together and record their RAPRS (Relevant Accumulative Page Rank Score). I also do the same for the direct search term to figure out what related search term its ranking for and what level of backlink power is allowing it to surpass a direct attempt at ranking for the keyword (usually very strong sites that are difficult to beat). Now that I have a RAPRS for the domains that I am attempting to surpass I know roughly the amount of link strength I need to surpass that competitor in the serps. If the score is to high then I move on to another keyword and evaluate it the same way until I find a top ranking site with a low score. Let me give you an example of how I calculate my RAPRS metric: Let’s say basketweaverman.com has 7 backlinks: fdwafaw.com PR 0 (anchor = Basket weavers) ofwakjfaw.com PR 0 (anchor = click here) basketit.com with PR 0 (anchor = new site!) basketman.com PR 1 (anchor = Basket Weavers) basketmww.com PR 1 (anchor = Basket Weavers) Basketlady.org PR 2 (anchor = Basket Weavers) Basketdog.com PR 4 (anchor = Basket Weavers) BasketBasketBasket.com PR 4 (anchor = Bag Maker) The RAPRS for this website would be: 0 + 1 + 1 + 2 + 4 So my RAPRS is 8. So if I get at least two relevant Pagerank 4 sites linking to me with the anchor text Basket Weavers then I should see some decent rankings. That is how I evaluate keyword difficulty I know it’s a very lengthily process to do for many keywords but I find a lot of amazing \"Low hanging fruit\" keywords that scared other SEO's off because they did not analyze the SERPS correctly to rank for! What do you think of this method and how do you analyze keyword difficulty? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How To Analyze Keyword Difficulty - Tooless!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How To Analyze Keyword Difficulty - Tooless!"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "DavidHorne\n          \n            DavidHorne"
}