{
  "url": "https://moz.com/blog/how-communication-resolves-internal-issues",
  "slug": "how-communication-resolves-internal-issues",
  "title": "How Communication Resolves Internal Issues - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When the stakes are high and everyone on your team dedicates themselves to the success of their clients, their company, their team, and their own personal development, it's critical that it's someone's job to own conflict resolution within the organization. Ron Garrett digs into the sticky issue of…",
  "content": "How Communication Resolves Internal Issues Marketing Industry By: Ron Garrett December 18, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Ron Garrett December 18, 2012 How Communication Resolves Internal Issues Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. After working at a handful of consulting agencies, as well as starting my own businesses, I have learned how to anticipate, spot, defuse, and resolve different levels of issues and interpersonal challenges in order to keep teams focused and on track. When the stakes are high and everybody on the team is dedicating themselves to the success of their clients, their company, their team, and their own personal development, it is critical that it's somebody's job to own conflict resolution within the organization - even if that person is you! Push yourself and your teammates to communicate early and often, even when the individual doesn't think the problem is easily solvable. From my experience, most issues arise from a lack of communication or a misunderstanding. Internal conflict and issues can lead to unhappy clients, unhappy employees, and unproductive teams. Over the years, I have learned that keeping people happy, focused, and efficient at their job while still making sure they have the ability to be creative, be heard, and express their passion/ability in a meaningful way is an art form, and today I will share some of the specifics around how I have managed this process successfully to date. This post was written for: Individuals that manage their own team or company Individuals whose job requires them to effectively interact with multiple teams/departments Individuals that manage client relationships Individuals who one day aspire to be managers themselves and want to set themselves up for success when they finally take that opportunity Clearly communicate the company's mission, vision, and culture (values) It's extremely important for a company to have a clearly defined mission, vision, and sense of culture (values). Equally crucial is to communicate these things on a somewhat consistent basis to the members of your team and to periodically review them to make sure that they are growing and evolving as your business grows. Regardless of whether you are a big fortune 500 company or a small three person team, it will serve you, your partners, and your employees well to have a sense of purpose, direction, and a core set of values from which to make decisions and keep everyone focused. Here are times and places within the organization you should look to communicate this information: During interviews, which can ensure that you are hiring individuals who are the right fit for your company On-boarding processes for new hires Company-wide meetings Team meetings Regular employee reviews (semi-annual, annual, etc..) Posting it visibly inside the office (by the entrance, in lunch areas, etc...) Grovo is a company doing a tremendous job at communicating their core values Company Values Board at the Entrance of Grovo For smaller businesses or managers of a team, it can be daunting to create a mission, vision, and culture. If this is not something your company has defined, you can start by making sure that whenever a new individual joins your team, someone is responsible for making sure that the employee has a clear understanding of why they were brought into the company. An example of a clear \"why\" for a SEO company could be: \"We hired you as an SEO consultant to handle anywhere between 3-5 clients of your own, deliver value for your clients, and retain and grow the relationship over time.\" Another example for an executive role could be: \"We hired you to research, build, and innovate upon a new marketing channel for our company. The goal for your role is to have this channel up and running within six months and expand into the European Market within 12-18 months.\" This immediately establishes a clear definition and direction for that individual, as well as begins to paint a picture of how their role fits in within the rest of the team. By clearly defining and communication the \"why\" to that individual, you avoid potential confusion and frustration by this team member down the road. Another added benefit of making sure every person on the team is clear in their role and what the company/team manager expects of them, is they will have a clear framework for making better decisions. They will know how to treat/work with their co-workers, have the ability to self reflect and up with solutions on their own, and encouraging others to live up to their full potential. This empowers people to solve their own issues by asking themselves “What would my company expect of me in this situation?” Effective communication creates problem solvers, NOT problem creators I often espouse to my colleagues that “just because we all speak English doesn’t mean we speak the same language.” I believe that taking into account the audience/person you are speaking to, as well as considering their specific listening, learning, and comprehension types is extremely vital in being an effective communicator. It is not enough just to talk AT someone. When you want a person or group of people to truly listen, process, and interpret what you are saying, you have to think about things from their perspective and demonstrate you've put thought into their considerations, not just what you plan to communicate. Below is a list of questions I ask myself before I attempt to communicate with another individual. What is this person's or group's communication type? (brief/succinct/to the point OR detail-oriented/needs lots of examples/very thorough) How much does this person or group value me as a person? How much do I think this person or group will value the things I say? Have I earned this person's or group's trust and respect? Is what I’m about to communicate applicable to this person or group? Have I spent time listening to them when they have communicated to me in a way they deemed meaningful? What mood is this person or group in? If I plan to communicate something at this time, will this person or group be focused on what I’m communicating? Do I want this person or group to find what I’m communicating to be memorable? If I want this person or group to take action off the back of what I’m communicating, how actionable am I making it? By creating a team of effective communicators and listeners, you create structured channels in which people can feel appreciated/understood and be effective. This is another efficient and productive way to instill a culture of problem solvers rather than problem creators at your company. Building a successful framework for creating, setting, and reviewing expectations Every company should build a framework for creating, setting, and reviewing expectations. This ensures that as people and teams grow, become more efficient/effective, and blow past existing targets, company expectations are growing alongside it in an organic way. This is also a great way to encourage personal development and growth. What a framework for creating, setting, and reviewing expectations looks like: Creating expectations (goals) When creating expectations (goals) for those within your organization, it’s important to map out what is required from the position, from the individual/team, and from the business. This will help define what success looks like. When defining expectations, it’s always important to leave an area of flexibility so that the person can help define expectations that match also match their passion/goals/strengths. Don’t just look to meet your needs, but create a win-win situation for the individual as well. Setting expectations for everyone at the company In both the world of consulting and working in-house, there is nothing more important than setting expectations (with the exception being delivering on your primary job competency). This applies to setting a client's expectations, setting your boss's expectations, and even setting up your own expectations. It’s important to make sure all expectations are clear, consistent, and that you regularly revisit them to make sure they haven’t shifted over time, otherwise before you know it, this could be you (see below). Painful right? Image Courtesy of Savage Chickens Below is a list of the items I find helpful when setting someone's expectations: Make sure you set aside dedicated time in your schedule for this task Pick an environment that allows for few or no distractions Make sure everyone who needs to be involved is a part of the process Be sure to preface the conversation by telling the individual the purpose of this conversation, why it’s important, who it’s important to, and how important it is Be explicit/extremely clear Make sure you are pacing yourself when you communicate expectations and aren’t speaking too quickly Find appropriate places to pause and ask the person or group, “Does all of what I’m communicating make sense?” Encourage and allow the person or group to ask questions should something not make sense (even if that means pausing the conversation momentarily) Once you have communicated all of this information to the person/group, take some extra time to have them communicate the information back to you. This is a great way to make sure they were listening and also keeps them engaged, especially when stakes are high (such as when deadlines have to be met, when reputation is on the line, or any type of sensitive situation is taking place). Below is an example of something I would say: “I appreciate your time this afternoon. Now that we’ve gone through expectations together, I wanted to make sure I was clear and we are all on the same page. Would you mind communicating back to me the expectations that I have laid out to the best of your ability?” Once you feel the person/group has taken in all of the information you have provided them and processed it, be sure to ask if they feel comfortable/confident living up to or exceeding those expectations. For example, I would say: \"That is exactly what I had in mind. Thank you for communicating that back to me. Based on what I have communicated today, do you feel like these are expectations you feel comfortable meeting or exceeding?\" Once you have a sense of whether or not the person/group feels confident they can meet or exceed expectations, don’t hesitate to get a commitment from them. Getting a commitment makes it real for most people. Once it becomes real, the person feels both a moral and professional obligation to live up to those expectations. I would conclude by saying: “That’s great to hear! We are proud to have you on our team. Can I get a commitment that you will work towards meeting or exceeding these expectations over the coming 60-90 days?” It is VERY, VERY IMPORTANT that with any verbal/written agreement between people, you must also leave room for flexibility. Any time you are too rigid, it puts people off or makes them feel like they can’t bring challenges, mistakes, or missed targets up to you in instances when they can’t meet expectations. That damages the communication and relationship between individuals/groups of people. “I want to be very clear that although these are the expectations we have for you right now, I also expect things to change because I know that nobody is perfect. What is more valuable to me than meeting expectations is ensuring that we maintain an open line of communication, so that in instances when expectations change or you're struggling to meet expectations, we can openly discuss it together and figure out a way to ensure your success here. How does that sound?” At the end of every such conversation, I want to ensure the person/group feels good about the meeting we had and feels like they have clarity, direction, and an open channel of communication to feedback on how they are doing moving forward. I will then find a way to talk about something a bit more light-hearted and loosen up the tone of the conversation. A great way to do this is to tell them something personal about yourself and then ask them something personal about themselves. \"Really appreciate you making time to have this discussion with me. Do you have any fun plans for this weekend? <PAUSE AND LISTEN.> Oh that sounds like fun. My wife and I are planning a trip to the mountains later this month to go fishing and get some fresh air. I can’t wait!” Reviewing expectations (goals) A great way to review expectations with people at your organization is to set-up a line manager meeting with them. This is an opportunity for each individual within the company to sit down in a one-on-one environment to discuss performance, personal goals, as well as struggles at work. Also set-up quarterly reviews to make sure that each individual is on track for meeting or exceeding agreed upon expectations (goals). Both types of reviews provide multiple touch points throughout the year to ensure things are on track and in areas where something is lacking, defining solutions to get back on track or reset expectations. Scaling communication: what happens as offices get bigger and/or open up in multiple locations? As companies grow and expand into new territories, communication, knowledge sharing, and time for one-on-one chats become more challenging to execute effectively. Image Courtesy of SpaceToday Make it easy Many organizations invest into tools such as BaseCamp, Yammer, or Chatter (if you are a sales driven organization). At Distilled, we have selected the Google ecosystem as our preferred method of centralized communication. Between Gmail for email, internal Google+ for social communication, Google Hangout for video chats, Google Chat for quick back and forth conversations, and Google Docs for collaborative efforts, it has proven to be a great way to keep in touch and keep and stay informed no matter where we work or how busy the work schedule. Example of how Distilled uses Google+ internally (to promote good work from employees) +Michael has done an incredible job at creating value for his clients. I received a phone call today from Client A and they mentioned how helpful, forward thinking, and valuable his recommendations have been. I just wanted to flag it up to the company on how awesome this was. Keep up the great work +Michael. Example of how Distilled uses Google+ internally (to crowd source ideas) I was looking at examples of social campaigns on Pinterest that have done well over the past 90 days. I found an interesting article about the demographics on Pinterest (insert link), great examples of content that have done well (insert link), and the providers that created the pieces (insert providers). It would be great to get everyone's feedback on social campaigns that have inspired them. Google Hangout (video chat) For conversations that are too complex for chats and email or require quick turnaround times/iterative feedback, I find picking up a phone or even better, using a platform like Google Hangout to video chat can be an effective platform for communication. Creating office hours It’s important to keep an open door policy and make yourself accessible to others within the organization, even if that means an open “digital” door policy. By creating office hours, you budget in time each week to have scheduled meetings/discussions with anybody who needs some of your time. This can be a great way to stay approachable, no matter your location or your schedule. Ways to make office hours time efficient and effective: Create 20 minute windows of time for each meeting (with the ability to request more time if needed) Have the person requesting the meeting send over an agenda prior to the meeting E-Mail any information or specifics over to the person should they need to do any preliminary reading or research Keep it simple I find keeping things simple is not always as easy as one might think, especially when communicating via text (email, chat, social, etc.). It's important to ensure that the message doesn’t get misrepresented and that the person receiving the communication has all of the context he/she needs to stay informed. The trick is being able to identify what the most critical bits of information that need to be conveyed are for the message to make sense while staying focused and succinct. Start off by prefacing the most important part of the email with a to the point message. At Distilled, we use TL;DR, which stands for \"too long; didn’t read.\" After TL;DR, put the point of the email in a one or two sentence snippet, so that even if the person doesn’t have time to read the entire email, they understand the important takeaways of the message Keeping E-Mails Simple using TL;DR (Too Long; Didn’t Read) Bob, TL;DR: We are hiring for a new position; I need someone to own this and would like to see if you are up for the task. We have recently seen the amount of retained clients go up significantly within the past 12 months and would like to continue to grow each office by a rate of 30% per year. In order to accomplish this, we need to hire 4 more consultants over the next 6 months. We noticed you referred our company 2 out of the last 4 people we have hired and would like to see if you’d be interested in reducing consulting work in order to focus more of your time on recruiting. If this is something you'd like to be a part of, let’s catch up early morning Friday. Thanks in advance and speak soon! Keeping a pulse on your organization As organizations grow, mature, and age, it’s important to keep a hand on the pulse of your company and its ever changing needs. Find ways to figure out what your organization needs in order to be successful and invest in infrastructure. So many organizations depend on people in order to solve problems and as a result, it's crucial to find solutions that connect people, create engagement amongst teams, and facilitate learning. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Communication Resolves Internal Issues"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Communication Resolves Internal Issues"
    },
    {
      "level": "H2",
      "text": "Clearly communicate the company's mission, vision, and culture (values)"
    },
    {
      "level": "H2",
      "text": "Effective communication creates problem solvers, NOT problem creators"
    },
    {
      "level": "H2",
      "text": "Building a successful framework for creating, setting, and reviewing expectations"
    },
    {
      "level": "H2",
      "text": "Creating expectations (goals)"
    },
    {
      "level": "H2",
      "text": "Setting expectations for everyone at the company"
    },
    {
      "level": "H2",
      "text": "Reviewing expectations (goals)"
    },
    {
      "level": "H2",
      "text": "Scaling communication: what happens as offices get bigger and/or open up in multiple locations?"
    },
    {
      "level": "H2",
      "text": "Keeping a pulse on your organization"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ron Garrett\n          \n            Ron Garrett"
}