{
  "url": "https://moz.com/blog/how-flash-affects-your-websites-ranking-with-seo",
  "slug": "how-flash-affects-your-websites-ranking-with-seo",
  "title": "How Flash Affects Your Website's Ranking with SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I recently talked to a prospective client about building his site to promote his photography services.  He wanted to use a service by blusites.com which charges no more than $400 for a completely built out site targeted to photographers all in flash.  This template was ridiculous for its price --…",
  "content": "How Flash Affects Your Website's Ranking with SEO Design I By: IndyMediaGroup September 18, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! I By: IndyMediaGroup September 18, 2008 How Flash Affects Your Website's Ranking with SEO Design This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I recently talked to a prospective client about building his site to promote his photography services. He wanted to use a service which charges no more than $400 for a completely built out site targeted to photographers...all in Flash. This template was ridiculous for its price -- shopping cart, blog, contact form, video and gallery uploads. He was almost ready to buy the template except the company limited the number of sub pages he could post galleries on. He wanted to use more pages to promote his specific photography services such as weddings, engagements, portraits, etc. In any case, he came to us wanting a near duplicate for close to $400...and also all in Flash. Being SEO-minded, I asked him if was interested in Flash just on the home page and on some of the other pages to display his photographic images so he could get ranked better...to which he replied that we could just throw some tags in the code to take care of that. At this point, I became a little irritated. Are semi internet savvy users STILL under the belief that SEO is something simple with tag coding and engine registrations? I started to talk about how tags were not a proven method anymore for ranking on the major engines, but was promptly cut off by mention of a fade effect as users go from page to page within his site. I understand that photographers need to have design-oriented sites moreso than most other businesses, just as a fashion designer would need to look really cool before he could say that his site loads faster than any other. BUT I do think that a company creating an entire vertical for photographers at $400 or less for websites built fully in Flash is taking away from the necessary functional part of the website. Rarely do you have visitors complain to you that the design on your site is problematic, but rather you'll get emails complaining about pages not loading or forms not working, etc. All in all, there's too much emphasis on fade effects and other Flash techniques that I can't imagine most of us are still in awe over. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Flash Affects Your Website's Ranking with SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Flash Affects Your Website's Ranking with SEO"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "IndyMediaGroup\n          \n            IndyMediaGroup"
}