{
  "url": "https://moz.com/blog/how-much-do-seo-consultants-agencies-charge",
  "slug": "how-much-do-seo-consultants-agencies-charge",
  "title": "How Much Do SEO Consultants & Agencies Charge? A Survey that Needs Your Help - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In the past few months, a number of folks have brought up this old blog post of mine on SEO pricing. The now 4-year-old content there is in dire need of refreshing, but I don't think that my personal opinion and experience are of acceptable quality to make for a compelling, useful upd...",
  "content": "How Much Do SEO Consultants & Agencies Charge? A Survey that Needs Your Help SEO Consulting By: Rand Fishkin December 6, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 6, 2011 How Much Do SEO Consultants & Agencies Charge? A Survey that Needs Your Help SEO Consulting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In the past few months, a number of folks have brought up this old blog post of mine on SEO pricing. The now 4-year-old content there is in dire need of refreshing, but I don't think that my personal opinion and experience are of acceptable quality to make for a compelling, useful update. Thus, I've created the following survey. If you own, manage or work at a consultancy/agency in the SEO or adjoining+overlapping fields, your participation is tremendously appreciated. UPDATE: The post with data from the survey originally on this post is now live - SEO Pricing: 600+ Agencies Share the Costs of Services & Pricing Models and includes the infographic below: The results from this survey will be made available to everyone in a blog post that will replace the old one in the next week. Company names and websites will be removed to help protect the privacy of those who've participated (and we're not asking for any highly sensitive items like revenues or client lists). It's my hope that this new resource can help agencies and consultants as they compare their prices to the distributions of others as well as helping buyers of SEO and inbound marketing services get a sense for the common cost structures associated with the field. Thanks for your contribution! p.s. As you might imagine, changing a survey that's been published and collected results is very hard. However, if you have feedback about the survey format or suggestions to improve it, we'll definitely take those into consideration for our broad industry survey, which we'll be launching again in early 2012. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Much Do SEO Consultants & Agencies Charge? A Survey that Needs Your Help"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Much Do SEO Consultants & Agencies Charge? A Survey that Needs Your Help"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Sins of an Agency: Parting Ways With Our Biggest Client"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "8 Prep Steps for Better Local Business Client Meetings"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}