{
  "url": "https://moz.com/blog/how-to-invest-in-seo",
  "slug": "how-to-invest-in-seo",
  "title": "How to Invest in SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Daniel walks you through a framework for investing in SEO, from answering how much to invest in the first place, through how to structure and measure the success of that investment.",
  "content": "How to Invest in SEO Marketing Industry | SEO Consulting By: Daniel Marks October 27, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Daniel Marks October 27, 2021 How to Invest in SEO Marketing Industry | SEO Consulting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Testing out a new paid marketing channel is relatively easy. You can assign someone in-house, allocate some test budget, and pretty quickly quantify the return on your investment. Testing out SEO can be quite a bit trickier: Results often take time (more than six months)If results do materialize, they’re often hard to quantify or attribute to any one projectIt’s more than just a financial investment — you'll usually need product resources as well There are exceptions but most companies can’t say: \"let's spend $10K on SEO over the next few months and see if there's potential there\". You have to take a leap of faith, and weighing that leap of faith against very quantifiable, much more immediate projects isn't always easy. I've seen this issue firsthand, first as a consultant at Distilled, then working in-house on SEO at Etsy, SeatGeek, and now Course Hero. So, here's my attempt at a framework for investing in SEO: Should you invest in SEO in the first place?How much should you invest in SEO?How should you structure your SEO investment?How should you measure your SEO investment? This post will not cover what SEO work is actually worthwhile, or how to determine your SEO strategy, or how to hire the right SEO, or what tools to use, etc. Those are all aspects of investing in SEO that very much depend on your unique context. That said, hopefully this framework will help you navigate those questions. Should you invest in SEO in the first place? The most relevant question here is, how big is the addressable search market? A company like Slack will have a relatively small addressable search market (there aren't that many searches that Slack really wants to rank for), whereas a company like Expedia has an enormous addressable search market (flights from Vancouver to Toronto or Montreal or Calgary, hotels with free breakfast in Vancouver, cheap motels in Vancouver, car rentals in Vancouver, etc.). Slack could always go all-in on content marketing and try ranking for top-of-funnel queries (anything related to communication, for example), but the intent of this traffic will usually be low. All companies have the option of targeting a large range of top-of-funnel queries. For example, Away could write about travel tips, Warby Parker could write about eye health, Workday could write about hiring, etc. However, this traffic isn’t usually very transactional and therefore lower value (though not worthless) The easiest way to estimate the size of your addressable search market is to look at competitors through a tool like Moz, SEMrush or SimilarWeb. To use an example, if I were at Tuft & Needle, I'd do something like this: 1. Look at organic search competitors within Moz’s True Competitor tool 2. Estimate the non-branded search traffic of those competitors with Similarweb or SEMrush Non-branded SEO visits/year (millions) Non-branded visits are visits that don't include the brand name (e.g. Casper). For instance, Casper receives 8.5 million visits per year from branded queries, but these don’t tell you much about your own search opportunity (though could be interesting from a brand perspective). 3. Assign a value to these visits by either using internal metrics (how much is a search visit worth to you?) or by considering the Adwords cost of this traffic via a tool like SEMrush: Using the largest competitor from the competitive set above, sleepfoundation.org, we can see that if you were to purchase their monthly SEO traffic via search ads, you’d need to pay an estimated $10.9 million per month or $2.14 per visit ($10.9/5.1). Therefore, by looking at these five competitors, we can conclude that: There are roughly 100 million search visits per year that are likely somewhat relevant to Tuft & Needle (the sum of search traffic to the five competitors).The value for each visit could be somewhere around $2.14The total value of search traffic available to Tuft & Needle could be somewhere around $214 million per year (100 million * $2.14) The above exercise should help you decide: Is SEO worth investing into in the first place? I’m certainly biased, but the answer to this will almost always be “yes”. It’s very unlikely that the right SEO investment won’t be ROI positive for most sites. I’d even posit that very few sites have ever over-invested in the right SEO to the point that their SEO investment dipped into ROI negative territory.How should we prioritize our SEO investment relative to other opportunities? How large should our SEO investment be? Even if you’re confident the investment will be ROI positive, investing in SEO might still not make sense if: You can't afford to wait for the pay off (often over six months)You can't find the right SEO talentYou have other, more compelling opportunitiesYou can’t provide the necessary resources to SEO (more on this later) How much should you invest in SEO? Let’s dig into this a bit and stick with the same example. If Tuft & Needle believes: The actual search market is only 25% as large as what the above exercise suggests (about $50 million per year instead of $200 million per year)They can capture 5% of that market with the right SEO investmentThey need to maintain that investment to maintain their market share They could justify spending $2.5 million per year on SEO (5% of $50 million). I don't know of many companies investing that amount into SEO — at $150,000 per person, that would be a 16-person SEO team. Therefore, I hope if nothing else, this exercise helps to illustrate how high the ceiling can be for even a non-SEO-centric company like Tuft & Needle. But the more exciting calculations involve SEO-centric companies like Thumbtack, Etsy, Pinterest, SeatGeek, Expedia, etc. For companies like this, which operate in enormous search universes, it's almost impossible to invest too much into SEO. Let's do some thought exercises. eBay's Ceiling According to SimilarWeb, SEO accounts for 22% of eBay's total site traffic. Let's say that it only accounts for half as much revenue since those visits are likely less valuable than direct or paid search visits. Based on their 2020 financials, that 11% (half of 22%) would amount to $280 million in net income per year (income not revenue): Let's conservatively say that the right SEO investment can increase their search income by 5%, that would represent an impact of 5% multiplied by $280 million, or $14 million per year. How many SEOs and engineers could you hire for that amount? Here's another thought: if eBay commissioned an SEO audit every single month, and each audit only produced one insight worth implementing, and that one insight increased their SEO income by only 0.1%, they could justify a price of $280,000 per audit ($3.3 million per year). Or forgetting about audits for a moment, do you think a team of SEOs ($3.3 mil can buy a lot of headcount) could generate one insight worth 0.1% in lift every month? Here’s another example: eBay spent over $2.5 billion on sales and marketing in 2020: And here is the rough breakdown of their traffic according to SimilarWeb: Traffic/channel to eBay.com according to SimilarWeb How much of that $2.5 billion should be spent on SEO? We can use our earlier estimate of SEO's 22% traffic share representing an 11% income share to guide this. Should SEO get 11% of eBay's marketing budget to match its share of income? 5%? 2%? At 1% that would represent an investment of $25 million per year. What could you do with a $25 million per year investment into SEO? Hire a 50-person SEO team of engineers, analysts, and SEO experts at $200,000 per year each ($10 million)Hire five agencies on retainer at $50,000 per month each ($3 million)Hire a 50-person team of strong content writers at $100,000 per year each ($5 million)Spend $2 million a year on toolingAdmire the remaining $5 million per year Okay, last one! Here are some recent case studies from SearchPilot outlining the impact of relatively small SEO projects: Reprioritizing of content on the page = 16% liftAdding internal links = 7% liftBringing content out of tabs = 12% liftAdding month and year to title tags = 5% liftAdding review schema markup = 20% lift Let’s say: Those projects only affect 20% of the site (a lift of 10% would actually be a sitewide lift of 10% * 20%)50% of your SEO work produces a liftThe average lift is 5%You ship two projects per month Those are pretty conservative assumptions, and yet would produce a sitewide SEO lift of 12% per year or about $34 million in income per year for eBay. The kicker to all of this is that the majority of SEO projects actually pay dividends for many years to come, so a 5% sitewide lift might be 5% per year for 3+ years. Now to be clear, the quality of your SEO investment is much more important than the size of it. If you hire a terrible agency for $50,000 per month, then devote some engineers to shipping every single one of their recommendations, you might be \"investing in SEO\", but you certainly won't see the returns you're hoping for. In fact, you'll likely torpedo future SEO investments as the company gradually starts to look at SEO as a whole with skepticism. Furthermore, a $25 million per year investment into SEO is overkill for all but a very small set of companies. In fact, I doubt there’s a single company in the world that invests more than $10 million per year in SEO (though some should). However, the above exercises are really to drive home two points: Even for a non-SEO-centric company (Tuft & Needle), the point at which their SEO investment turns ROI negative is likely quite far away.For an SEO-centric company (eBay), it’s almost impossible to over-invest in good SEO, one incremental insight is just too valuable to them. How should you structure your SEO investment? Now for the real question. By now you've hopefully bought into the case for investing in SEO, and are somewhat convinced by the previous exercises that you should probably do more than just commission a one-time SEO audit. But how do you actually structure your SEO investment? The TL;DR is: Hire a very strong SEO (or team of SEOs if budgets permit)Provide them with the resources necessary to execute the roadmap they lay out It really is that simple in theory, but both parts can often be hard in practice. Hiring a very strong SEO There is no surer way to sabotage an SEO program than to have the wrong person leading it. At minimum you'll be devoting resources to projects that don't drive much incremental traffic. At worst you'll give SEO a bad name within the rest of the organization and make it that much harder to invest in going forward. You'll end up with people who's framework for SEO is something along the lines of \"I know SEO is important but I don't think anyone really knows how to influence rankings all that much\". Good luck getting buy-in from those people. So what should you look for? In a nutshell, you'll likely want a small baseline of SEO experience and a solid helping of: Data savvinessIntelligenceWeb development knowledgeCommunication ability I would much rather hire someone with one year of SEO experience and a healthy dose of the above attributes than someone with 10 years of SEO experience but little of the above. In fact, I think many companies are better off turning someone with the above attributes into an SEO than trying to find an external SEO who meets those requirements. It is just so difficult to hire good SEO talent and it's not uncommon for roles to go unfilled for 1-2 years. In response to the difficulty of hiring good SEOs, one route I've seen companies take is having an engineering or product manager learn SEO and take it over, this has a few benefits: They are sometimes technical enough to ship things themselves if necessaryThey can effectively communicate with engineers and already have relationships with themThey have already been hired so are presumably a good fit for the non-SEO dimensions of the job (conscientiousness, work ethic, cultural fit etc.)Their product or engineering instincts will usually be very applicable to SEO Plus the primary benefit being: it might actually be faster to have someone internal learn SEO than to find the right external SEO candidate. Another approach to finding SEO talent if you yourself don’t have an SEO background would be to use a reputable SEO person in the interview process as a contractor. Providing them with the necessary resources There are many different types of resources your SEO program might depend on: Budget for tooling, working with an agency, hiring contractors etc.Writers for producing contentAnalysts for assessing the impact of SEO projects and monitoring the health of SEO metricsDesigners for helping with any type of user facing changeProduct managers for managing SEO related product workEngineers for shipping product dependent SEO work Some companies will need all of the above to really reach their SEO potential while others might only need one, you’ll need to work with your SEO team to figure out your unique resourcing needs. For reference though, the SEO opportunity for a company like Tuft & Needle will usually be very content oriented (writing articles to target top of funnel queries) whereas the opportunity for a company like Etsy will usually be very engineering dependent (never ending list of technical SEO opportunities). For the purpose of this discussion, we’ll focus on engineering resources but much of this can be applied to any type of SEO resource. The typical approach is to not earmark/dedicate engineering time to SEO. In theory this makes sense, you'll consider SEO projects against all other engineering dependent projects and weigh them against each other when allocating your scarcest resource, engineering time. In practice what happens is a very haphazard investment in SEO. Here's a common way this plays out: You decide to invest in SEO so you open an SEO role, you're able to fill it in 3 monthsThe SEO gets onboarded then does a site audit to generate an SEO roadmap, let’s say say this takes 2 monthsThe SEO is able to immediately pitch a couple projects from their roadmap (no delays waiting for quarterly planning to start or anything)Two SEO projects are committed to in the upcoming quarter, work starts on them in a month and they take another month to actually shipIt takes another couple months to see results but both projects end up having a positive impact The above, very optimistic, timeline is already 9 months long before you see any impact from investing in SEO and assumes: You fill the SEO role very quicklySEO projects are committed to immediatelyThe initial SEO projects produce a positive impact What if this quarter was particularly busy with other initiatives and you couldn't commit to SEO? Or the projects had made an impact but it was difficult to quantify? At minimum the whole timeline would have been elongated, at worst it would be harder to secure engineering resources going forward. The alternative is dedicated engineers. You can have an SEO PM, you can have your own SEO department, you can have the SEO folks live on the product side or the marketing side etc. - all of those permutations can work. The important piece is that you have dedicated engineers to quickly and consistently invest into SEO. As mentioned above, you can swap out “dedicated engineer” for “dedicated analyst” or “dedicated writer” and much of what was said still applies: figure out what resourcing your SEO strategy will require and make a long term commitment to provide those resources. How should you measure your SEO investment? SEO takes time. One of the most important requirements for SEO success is having appropriate expectations. You probably won't see results for 6+ months and some of those results will not be easy to quantify. BUT this should not be interpreted as a license for SEOs to never demonstrate their impact. It might take time but it shouldn't take over a year to start seeing some results and sure not all SEO projects will be quantifiable but many of them should be, especially early on when the credibility of your SEO efforts is most vulnerable. The main decision you have here is whether to measure SEO success on a project by project basis or a sitewide basis. If you’re expecting >50% growth from SEO efforts then you can just look at overall SEO driven revenue to measure success because this level of growth should cut through any noise. Proxy metrics such as rankings or traffic are helpful to keep tabs on but you'll ultimately want to measure SEO driven revenue to understand the real impact of your SEO work. Acquiring irrelevant rankings or low intent traffic won't do much for your business. For a site with a more established SEO traffic profile though, success might be a 20% lift in SEO traffic, or even less. The problem with using overall SEO driven revenue to evaluate this type of situation is that so many factors influence your SEO driven revenue that are outside the control of your SEO team: Competitive trends (SEO is zero sum, a new competitor will inevitably eat away at some of your traffic)Business trajectory generally (SEO isn't immune to a general decline in your business)Google changes (algo changes, new SERP features, increased ad prominence etc.)Search behaviour changes (maybe the keywords you rank for are simply less popular now)etc. Therefore, a 20% lift can easily get lost in the noise of all the above. For example, going from 40% YoY growth to 30% YoY growth might be a great success if the alternative was 10% YoY growth without SEO investment. The problem is knowing what growth would've been absent from your SEO investment. In such a situation, you'll want to lean more on the individual wins your SEO team is delivering rather than on overall traffic numbers. There are many ways to quantify individual SEO projects but in general, I’d recommend pairing your SEO team with some analytics support to measure individual projects and running SEO A/B tests when possible. Even if you take the project by project approach, I wouldn’t ignore overall traffic numbers, I would just take them with a grain of salt given how much is outside of the SEO team’s control. The reason growth is down this month might be attributable to inaction on the part of your SEO team but it could just as easily be due to some of the factors listed above. One approach you can take to contextualize overall traffic/revenue numbers is to compare your SEO growth rate to your \"branded growth rate\" to estimate your incremental SEO growth rate. Branded growth rate in this case would usually include any direct visits and any homepage visits (though you can include other brand heavy visits here, visits to your jobs page, about page etc.). By comparing your branded growth to your SEO growth, you can somewhat control for the non-SEO specific factors that might affect both: A new competitor should hurt both branded and SEO trafficA decline in the business or the quality of your inventory or the usability of your site should hurt both branded and SEO trafficA decline in demand for what you're selling should hurt both branded and SEO traffic To recap: SEO should be held accountable to a measurable impactYou should be patient (waiting >6 months to see progress is reasonable) but not too patient (waiting >1 year for any pay off is likely too long)If the expectation is that the impact will be large enough (>50%) to clearly cut through any variance in the data, then you can just look at overall SEO numbers to gauge success.If the expectation is that the impact might get lost in the variance of overall SEO numbers, I would focus more on the impact of individual SEO projects while still keeping a close eye on overall SEO numbers. Conclusion In summary, why investing in SEO can be hard: Results take a whileMany results are unquantifiable (a 2% site wide lift can be meaningful but also easily lost in the noise of traffic variance)The combination of the previous two points makes it hard to discern good SEO work from bad SEO work. Sure after a year of not seeing any results you might realize that the SEO direction you're on isn't working out but you've lost a year of potential SEO growth in the meantime.It usually requires your scarcest resource, engineering time Or to put all of this another way, here's how not to invest in SEO: Hire someone with a ton of great SEO experience who doesn't seem that strong otherwiseDo not allocate resourcing to SEO, put the onus entirely on your new SEO person to secure engineers or analysts or writersExpect the growth rate of overall SEO traffic or revenue to be meaningfully different within a few months of this person starting Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Invest in SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Invest in SEO"
    },
    {
      "level": "H2",
      "text": "Should you invest in SEO in the first place?"
    },
    {
      "level": "H2",
      "text": "How much should you invest in SEO?"
    },
    {
      "level": "H3",
      "text": "eBay's Ceiling"
    },
    {
      "level": "H2",
      "text": "How should you structure your SEO investment?"
    },
    {
      "level": "H3",
      "text": "Hiring a very strong SEO"
    },
    {
      "level": "H3",
      "text": "Providing them with the necessary resources"
    },
    {
      "level": "H2",
      "text": "How should you measure your SEO investment?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    }
  ],
  "author": "Daniel Marks\n          \n            Daniel Marks\n          \n            Daniel Marks"
}