{
  "url": "https://moz.com/blog/how-lucrative-is-auctionads",
  "slug": "how-lucrative-is-auctionads",
  "title": "How Lucrative is AuctionAds? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We have some, well, buddies over at BuddyTV, so I was interested to see that they were AuctionAds' May Publisher of the Month. \"Good for them,\" I thought, before going, \"Wait, what's AuctionAds?\"\n\nYeah, yeah, don't make fun of me. So I...",
  "content": "How Lucrative is AuctionAds? Online Advertising By: Rebecca Kelley May 15, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley May 15, 2007 How Lucrative is AuctionAds? Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. We have some, well, buddies over at BuddyTV, so I was interested to see that they were AuctionAds' May Publisher of the Month. \"Good for them,\" I thought, before going, \"Wait, what's AuctionAds?\" Yeah, yeah, don't make fun of me. So I don't know what AuctionAds is...give me a break, we've got a lot going on here at the MozQuarters (especially with Rand in China...in fact, the Moz Squad will be very busy today playing frisbee at the park tackling that task list he left for us). Anyway, I checked out their site and found a handy list of 10 Reasons to Run AuctionAds. Read it if, like me, you're a bit slow on the uptake and don't know what AuctionAds is. Basically, you sign up on their site to be an AuctionAds publisher and insert their ad code on your site. They show relevant eBay products to your visitors (relevant meaning related to your site's content), and you make money when a visitor clicks on the ad. I chatted with Neil Patel about AuctionAds because he's pretty familiar with the site, and he said that AuctionAds places a 30-day cookie on users who click through from your site, so during that time if they convert into a signup or win an auction you can get paid. According to Neil, sometimes you can get paid if the user simply bids on a product but doesn't win (apparently this depends on the geotargeting, the location of the user, and what version of eBay he or she is using). Neil said that AuctionAds is much better than Adsense if you have a lot of social media traffic, and he knows people who make over $10k/month with it. I'm not sure how well the platform is working for BuddyTV, but I did see the products they served me: I would think that more relevant products for BuddyTV would be TV shows on DVD, not audiobooks and sheet music. Oh well. Have any of you used AuctionAds? If so, how satisfied are you with the service? Does it bring a nice stream of revenue? P.S. Neil just fired me an email saying that AuctionAds takes no revenue cut--they pay out 100% to the publisher. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Lucrative is AuctionAds?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Lucrative is AuctionAds?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}