{
  "url": "https://moz.com/blog/how-seomoz-gained-1000s-of-visits-from-google-news",
  "slug": "how-seomoz-gained-1000s-of-visits-from-google-news",
  "title": "Using Google News Sitemaps to Attract Visitors - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Are you included in Google's News index? SEOmoz was virtually non-existent in Google News until last month. Learn what we did to fix it, and what you can do to get your own content indexed better by Google News.",
  "content": "How SEOmoz Gained 1000s of Visits from Google News (You Can Too) Mobile SEO By: Cyrus Shepard May 24, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Cyrus Shepard May 24, 2011 How SEOmoz Gained 1000s of Visits from Google News (You Can Too) Mobile SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Consider this image below from the SEOmoz Google Analytics account. Behold a sight rarely displayed in SEO blogs. Notice the similarities to a typical Kansas highway. Both are dead flat, contain no peaks or valleys, and are traffic free. Such was the sad state of SEOmoz’s referral traffic from Google News prior to April of this year. In truth, SEOmoz didn't really pursue traffic from Google News for several reasons. Google News never sent us significant traffic in the past In our minds, we don't consider ourselves a \"news\" organization Unlike news organizations, SEOmoz doesn't drive revenue through advertising What Changed Our Minds? In April, Rand’s post on White Hat SEO went nuclear. The blogosphere exploded with commentary and traffic poured in from all corners of the Internet. We recorded 8000 visits from Google News the first two days alone. The drought was over. But why that particular post? Rob Ousbey from Distilled pointed out that the few SEOmoz posts included in Google's News index all had one thing in common. They each contained a number in the URL. For example: ../blog/white-hat-seo-it-fing-works-12421 ../blog/google-told-you-so-12428 ../ugc/dissecting-local-seo-via-competitive-analysis-12284 Given the way Google News indexes content, this makes sense: “Display a three-digit number. The URL for each article must contain a unique number consisting of at least three digits… Please note that this rule is waived with News sitemaps.” - From Google (publishers) Help Our indexation was pure accident! By default, most SEOmoz blog URLs don't contain numbers. We decided to dispose of our previous perceptions and chart a proactive course in gaining visits from Google News. Here's how we did it - and how you can too. 1. Are You Newsworthy? Yes You Are You no longer have to be a big news player (or a spammer) to find your way in Google News. Google clearly states both blogs and news organizations alike qualify for inclusion. Ask yourself the following questions. Consider yourself a candidate if you meet the following criteria. Do you discuss current events? Is your content timely? Do you offer commentary? Is your blog itself newsworthy? These are some of the same qualifications that make for great content in any context. The number of categories in Google News is staggering. It includes topics as varied as business, education, humor and even ice hockey. There's room for everything in Google News. Love to write about hair? Yep, there's news for that. Don't sell yourself short. If you’re not already producing newsworthy content, you should. 2. Qualify Your Site Not everyone gets in Google News automatically. To see if you're already included in the index, perform a “site:” command within Google News using your domain. In our case, SEOmoz was already included. If Google hasn’t included your site in its news index, you can request inclusion. Rand addressed how to improve your chances of appearing in Google News in a recent PRO Webinar. He recommended improving your site's substantive metrics, including such factors as the number of inbound links and subscribers to your blog. Having a good user interface can also help. Again, even if getting in Google News isn't your focus, these are the same benchmarks for increasing your visibility on the Web in any market. 3. Get Your Content Indexed Google keeps its news index separate from its regular web index. Just because Google crawls your site and you appear in search results, doesn't mean your content is included in Google news. There are two ways to get your content included in the index: 1. Number your URLs (see above) or 2. Create a Google News Sitemap. The sitemap contains a number of advantages over simply numbering your URLs. Sitemaps allow you to tag your article with proper titles and publication dates. In addition to categorizing your content more accurately, sitemaps also give you the ability to annotate your content with metadata such as keywords or stock tickers. The downside is news sitemaps can be complicated to build if you lack development skills. Google dictates that your news sitemap should only contain articles published in the last 24 hours. So you'll want an automated system. In our case, Casey Henry was able to build a custom sitemap generator that met these specifications. If you run a blog using a third party platform, a number of good solutions exist for Wordpress, Joomla, Drupal and more. 4. Rise to the Top A number of great articles have been written about how Google News works and how to get indexed. Indexation relies on several factors: Topic Factors – How hot is the story topic? Last week it was The Governator, but it could be anything, even kittens. Story Factors – How relevant and fresh is your specific content to this topic. Publication Reputation – Sort of like Domain Authority, except specific to news publication. Timing is key to Google news. Paraphrasing from Rand's aforementioned webinar: \"If you break a big story first, you can see more traffic than you ever imagined from the first page of Google News.\" But timing a great story is hard to predict. What you can control are a number of on-page factors that improve your chances. For example, adding a good photo next to your headline increases the likelihood of Google displaying the photo, which also helps your CTR. Adding a unique video to your post (along with maintaining an active video sitemap) also improves your chances of rising to the top. Other best practices to consider include titles, article text, and more. This great interview with Josh Cohen highlights many of these techniques. 5. What About the Results? After we added a sitemap, Google News became the 4th largest referring traffic source for SEOmoz, bigger than Linkedin, StumbleUpon and Hacker News (but significantly behind Twitter, Facebook, and Google Image search.) In the last month, three different posts received over 1000 extra visits. Our future posts are \"primed\" for more. To be fair, this isn't a huge amount of traffic for a site like SEOmoz. The traffic has a high bounce rate and low conversion rate. That said, SEOmoz has not changed its content one iota to gain more traffic from Google News. We don't \"chase the algorithm.\" Were we to optimize our content towards this goal, our traffic would undoubtedly rise higher. Got a success story or more tips? Please share in the comments below. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How SEOmoz Gained 1000s of Visits from Google News (You Can Too)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How SEOmoz Gained 1000s of Visits from Google News (You Can Too)"
    },
    {
      "level": "H2",
      "text": "What Changed Our Minds?"
    },
    {
      "level": "H2",
      "text": "1. Are You Newsworthy? Yes You Are"
    },
    {
      "level": "H2",
      "text": "2. Qualify Your Site"
    },
    {
      "level": "H2",
      "text": "3. Get Your Content Indexed"
    },
    {
      "level": "H2",
      "text": "4. Rise to the Top"
    },
    {
      "level": "H2",
      "text": "5. What About the Results?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too"
    },
    {
      "level": "H3",
      "text": "Internal Linking for Mobile-First & Mobile-Only Indexing"
    },
    {
      "level": "H3",
      "text": "All About Fraggles (Fragment + Handle)"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Cyrus Shepard\n          \n            Cyrus Shepard\n          \n            Cyrus Shepard"
}