{
  "url": "https://moz.com/blog/how-do-i-find-a-good-seo",
  "slug": "how-do-i-find-a-good-seo",
  "title": "How Do I Find a Good SEO? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Whether you're looking for a consultant or an agency, finding a decent SEO is hard work. In today's Whiteboard Friday, Rand gives his tips for finding an SEO that will be the cheese to your macaroni!",
  "content": "How Do I Find a Good SEO? Whiteboard Friday By: Rand Fishkin February 15, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 15, 2013 How Do I Find a Good SEO? Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Finding a decent SEO is hard work, and the recommendations you get for selecting your perfect fit will vary as much as the people providing them. Whether you're looking for a consultant or an agency, you don't need to feel alone in your search! In this week's Whiteboard Friday, Rand walks you through his tips for finding an SEO that will be the cheese to your macaroni. Do you have any other tips you've used to find an SEO that we haven't covered? Leave them in the comments below! Video Transcription \"Howdy SEOmoz fans, and welcome to another edition of Whiteboard Friday. This week I wanted to actually take a question from one of our users in the community and that question was: \"How do I find a good SEO?\" They were hoping I would do a Whiteboard Friday on it. So here it is. I recommend a lot of things when people ask me for SEO assistance, consultants, agencies, that kind of thing, and I do it all the time. But I have a benefit of being in the industry for a long time and knowing a lot of people and usually knowing pretty well the people that I'm talking to or asking them a few questions to get those probing, in-depth answers that can let me know who I should recommend them to. This process is not particularly scalable, and certainly I can't have everyone just emailing me and ask. So please everyone who needs an SEO, don't email and ask me. But if you're looking for somebody, I would recommend a process similar to this. I would start with your network, meaning check out LinkedIn, check out people that you might know on Twitter and Facebook who have SEO or have SEO experience in their profile. You could even post something on these sites saying, \"Hey, does anyone have someone that they'd strongly recommend?\" I'm not saying that you go directly from this process to hiring someone, just that you can start with it, any of the web communities where you participate, your friends and family, business colleagues. Even local meet-ups, if you see that there is an SEO meet-up in your area, that might not be a terrible idea to actually go, meet some people, get friendly, especially if you find some folks in that community who don't necessarily offer SEO services – maybe they are in-house SEOs, they work for software companies, those kinds of things – but they will often have very good recommendations about who'd they suggest that you use. That's a great process, find sort of a neutral third party whose only interest is in helping you, but who knows the field well. That's what I'd be looking for here, more so than a direct consultant right away. Second thing, check out SEOs on the major marketing communities. If you don't have anyone in your network, you might try going to places like SEO blogs. I think SEO.alltop.com actually has a very good list of sort of all the popular and major sites in SEO, blogs in SEO. The SEOmoz Q&A certainly is a great place. This is actually one of my favorite features of Q&A now. There have been lots of people who have found their consultants and lots of consultants who have gotten work through Q&A. So I love that. Quora is actually a good place to participate. You can see lots of people both asking and answering SEO questions there. I think the people who tend to give really good answers on Quora also tend to be pretty darn good folks. I see Ian Lurie, for example, from Portent Interactive, which is a great company here in Seattle, giving a lot of good answers there. Some of those SEO forums, as well, if you see someone who not only the content of their answers, but the style of those answers. They are not reflexive or offensive. They don't get into arguments all the time. They're very open. They're empathetic. That's great. When you find people in these types of communities, that can be a good resource. Again, don't just think to yourself, \"Oh, well they don't do consulting, or they're out of my price range.\" That can be a good thing. You can reach out to them and get a recommendation. These are the kind of people you want to find to get that recommendation. Next, I want you to build a smart consideration set of the traits that matter to you, and this is certainly not exhaustive, these six, but these are traits that a lot of people have. So that could be I want someone who is very experienced, or I want someone who is relatively early in their career. I want someone whose background is they've been to college before, they've worked for several agencies, or I'm looking for an agency that has the background of having worked with several people in my field, or the opposite. A lot of times when they're seeking SEO consultants, they want someone who has no conflicting clients who are also in that field so that the links they build, the content they build, that work will all be for them exclusively and it won't be partnered out to several different folks. Geography and location can matter a lot. I would be cautious about thinking about this one. Just because someone is not in your geography doesn't mean that you necessarily can't get together with them in person. If they're willing to fly out to your location or those kinds of things, I would still put them in your consideration set. I think that at least one or two meetings in person is a great thing if you can accomplish it. But geography tends not to be super important for doing SEO kinds of work, other than being able to connect up in person and sort of shake each other's hand and that sort of thing. The agency consultancy size. Maybe you're looking for a one man operation or one woman operation. Maybe you're looking for a large agency that's inside a broader ad firm so they can serve lots of needs, that kind of thing. Price, obviously, is a consideration for a lot of people. And timing and availability. Can they start their work right now? How many people do they have available? All those kinds of things. You should add other things in this consideration set that matter to you. So, for example, values of the person might be really important. It might be very important to you that the person fits some particular criteria around what they've accomplished in the past or that they're very focused, they have a lot of skills on the content side as opposed to the linking side, or on the technical SEO side and the HTML and development side versus social media side. Whatever it is that matters to you, make sure to put that in your consideration set and consider people equally as you look through there. Then I'd go and I'd create a short list of SEOs from the recommendations that you got. I would also do it, even if you're sure, absolutely 100% sure. You're like \"You know what? This is the person for me. I just know that they're going to be the right one.\" At least talk to a couple of others. The perspectives that you'll get and the process of that interview is going to be very, very useful for you going forward and judging the work. You could find maybe you had your heart set on this person, but they turned out not to be right, and there was some reason. Just go through this process of at least vetting a couple of vendors. So I would ask them some things like some project specific questions, related to specifically what we're trying to accomplish here at our company and the rankings we're trying to achieve, the visibility we're trying to get, the people we're trying to draw in, the intent of the marketing that we're doing. Great, ask them project specific questions, but also ask them generic SEO knowledge questions. There is actually a great resource that Joel linked to in the blog post of sort of a ten question litmus test that I wrote for professional SEOs a couple years ago now, but I think can still be quite valuable. Get a reference or three, but be very careful in the references that you get. This is my experience, time and again, when reference checking vendors. You ask for a reference upfront, and you get people who they know will give a good reference. So really all you're saying is, \"Do you have two or three people who will always say nice things about you?\" That's not really a great reference check. This is what I would do. When you start talking to them, don't ask for references. Ask, \"What companies have you worked with? Who have been some of your clients over time?\" Make sure to write down that list, and you can prompt them. If they give you a couple, you can say, \"Oh, are there any others? Did you work with anyone in travel, anyone with a big site?\" Whatever the criteria you have. Then write those all down and go back to LinkedIn or your personal network, see if you know people at those companies. Reach out to them independent of getting the reference and ask, \"Hey, did you work with so and so? Were you happy with that experience?\" Going that direct route is much better. Then, I'll add this important caveat, very important caveat, which it's okay to get a couple of references that are not great. It really is. If you get one good reference from them and one of the people that you go back through your network says really good things about them, and you like them, and one other person that you've gone through your network says, \"Ah, we were not happy,\" that's okay. It's okay to have a couple of people. There is no way that you're going to do SEO consulting or agency work, any kind of consulting or agency work or services work and not have a few unhappy people in the past. I think that 100% happiness ratio is extremely rare, and even if they were happy at the time, oftentimes people become dissatisfied over time with things, and that could be not the agency's fault, the consultant's fault. So I wouldn't dismiss these, but I would consider them very carefully, balance them on the whole, and make sure that you know all the things that are going on. Oftentimes, in any type of a services organization, it's not one person's fault or always the agency or the service provider's fault. Oftentimes, fault lies somewhere in between the company and the agency. Then I would check out some online contributions too, places where they've contributed – blogs, social media, comments, those types of things. It tends to be the case that if you have people from the consultancy or the agency who've done stuff on the web that you can observe, you're seeing them in a little bit more of their natural setting, and you can see what I would call kind of behind the curtain of the polish that they present to you directly. That can be extremely valuable. So I love looking at sort of oh, I met someone at a conference and I thought they did a good job speaking, let go me check out some of their other presentations. Then I'll check out some of the stuff that they've done online. Boy, I get the sense that this person is kind of mean and rude on the Internet. I'm not sure that they're actually a match. That kind of information can be really interesting and really useful to you. You'll also get a sense for how knowledgeable they are. They can seem very knowledgeable in person, and then you go on the web and you sort of get this sense of, oh, actually this person seems to be giving bad advice or asking questions that don't seem like they know what they're doing. Unfortunately, because the SEO field is so easy to enter, you do have a lot of folks who just got started in the industry, maybe are looking for their first clients still, or folks who have been operating who may not necessarily be SEO experts, maybe they're great at other parts of web agency work but not SEO. Finally, my last piece of advice on this process, be very careful about choosing exclusively on price or experience. Now, price is an obvious one. You sort of go, \"Yeah. I'll get what I pay for and choosing the lowest price vendor might not be a great idea,\" and those kind of things. That's true. But experience is a dangerous one also. I see a lot of folks saying, \"Ah, you worked with our big competitor,\" or \"You worked with someone else in the field that we respect and admire, therefore, we're picking you.\" We lose track of all the other important traits and criteria. Just be cautious about that. I think that there is something to, whether you're hiring someone onto your team, we do a lot of hiring here, and one of the things that I see is relevant experience does not always trump sort of that excited newcomer. As long as they have the chops to do the work, sometimes that passion and that lack of experience can actually open up a lot of opportunity for you. So be careful about choosing on those alone, and hopefully this process will work for you. I would love if you're an agency or a consultant or someone who has found SEOs in the past and you have additional things that you'd like to add to a process like this, please include them in the comments below. I would love to see those. All right. Thanks everyone. Take care. We'll see you again next week for another edition of Whiteboard Friday.\" Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Do I Find a Good SEO?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Do I Find a Good SEO?"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}