{
  "url": "https://moz.com/blog/how-to-optimize-pdf-documents-for-search",
  "slug": "how-to-optimize-pdf-documents-for-search",
  "title": "How to Optimize PDF Documents for Search - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "PDF documents are often neglected in on-site SEO efforts. I consider that a mistake, as there is actually a large amount of potential in optimizing PDFs. The documents often contain good, unique, high-quality content that can be useful for search visitors. We know that search engines have gotten…",
  "content": "How to Optimize PDF Documents for Search On-page SEO By: Alex Fusman October 17, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Alex Fusman October 17, 2010 How to Optimize PDF Documents for Search On-page SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. PDF documents are often neglected in on-site SEO efforts. I consider that a mistake, as there is actually a large amount of potential in optimizing PDFs. The documents often contain good, unique, high-quality content that can be useful for search visitors. We know that search engines have gotten pretty good at crawling and indexing PDFs, and I personally see them in search results often. So it's important to make sure that you do what you can to increase their visibility in SERPs. I recently started a new project for a client with a large collection of PDFs on the company's website. The documents are tutorials, guides, product manuals, industry articles and promotional brochures. All of these are useful to visitors, but have little visibility because they don't rank in search results. As I started thinking about the best way to approach SEO for PDFs, I checked SEOmoz for tips and was surprised to find nothing on the topic in the last couple years (please correct me if I'm wrong about that.) So after doing some research, I came up with a checklist for PDF optimization. Checklist for PDF Optimization: Search-friendly filenames Keyword-optimized titles Informative, concise descriptions Company name in \"Author\" field Use several relevant keywords in \"Keyword\" field Make sure to fill out all available fields - there is an option to view \"Additional Metadata\" (in Adobe Acrobat) Add tags to and accessibility options to your document Don't forget about Alt tags for images Add links back to relevant pages on the main website Write-protect the document Offer HTML version of the document I use Adobe Acrobat to edit PDF documents so a couple of the instructions may be unique to that software, but I'm sure that other PDF software offers similar functionality. Search-friendly Filenames Treat the filename as you would treat the filename of any other webpage. Use words that are useful to users and consider search volume. If you neglect to specify a title, the filename will be shown as the title in the SERPs. Keyword-optimized Titles Again, approach the PDF document's title as you would approach the title tag of any other page. You know the drill. This title will be displayed on the SERP. You have the same character limit as you do with a regular title tag. Informative, Concise Descriptions The Description field in a PDF document is equivalent to the meta description in any other page. This will be displayed in SERPs beneath the Title. You have the same character limit as you do with a meta description. Author Field The PDF document settings let you specify an author. In most cases it's appropriate to use your company name, though I have no data to indicate that this field has any bearing on search results. Still, it's good form to fill everything out completely and in a professional manner. There is no downside to using a person's name as the author, though if your goal is brand-building, using the company name may be more appropriate. Keyword Field This is equivalent to meta keywords, so approach it in the same fashion. It may not be a ranking factor in the major search engines but it's still good form to complete this field with some relevant keywords. Complete All Available Fields In Acrobat, there is an option to view Additional Metadata. Make sure to fill out every field - the more complete your document is, the more data you give search engines for successful crawling, indexing and ranking. Also, different search engines may look for different meta fields, so you don't want to leave any blank. Add Tags and Accessibility Features This is a lesser-known feature that can make a difference. In Adobe Acrobat, you can go up to the Advanced menu and find a sub-menu for Accessibility. The options within this sub-menu will let you add functionality for your document to be read by screen readers and magnifiers. You should also be able to add Tags in order to better categorize your document. Alt Tags for Images Yes, it's possible to include \"alt\" tags on images within your PDF, so don't forget about those. Approach them the same way you would any on-site image tagging. Don't Forget About Links Remember that you should be treating your PDF document much like you would treat any HTML page. Make sure to add a link back to your website for crawlers and users alike. Another benefit is that other websites may host copies of your PDF too, if it's useful, and a link in the document will give you a nice backlink. This can be especially useful for deep links, since PDFs are often relevant to specific pages or products on your site. Write-protect the Document On that note, you want to make it difficult for others to edit your documents, both for protection of your intellectual property and for preservation of the links back to your site. If someone decides that your PDF manual on assembling a sofa is useful enough to host on their own site, you don't want them to edit out your link and insert their own. Consider Offering HTML Versions Though there are some benefits to PDFs, it's fairly safe to say that these days you could reproduce pretty much everything with HTML & CSS. So it may be a good idea to offer your PDF documents as regular pages too. This has several benefits - primarily, better crawlability and higher usability. Many people try to stay away from clicking on PDF documents due to the inconvenience of opening a PDF reader when they're just trying to browse your site. Also, it often locks the Back button, which is annoying. On the other hand, if your documents are valuable and useful, having them in PDF format makes it easier for people to distribute and print them. Offering multiple ways for users to interact with your content can mean the difference between engagement and abandonment. When doing SEO work for clients, in-house or for yourself, it's almost inevitable that you'll come across PDF documents at some point. Although they're easy to overlook, make sure you don't neglect to optimize them for search. You may be surprised at the results you get from getting PDFs ranked and hosted on other sites. I now have this PDF optimization checklist hanging up on the wall at work and I suggest that you add it to your arsenal of SEO checklists as well. It's likely to come in handy from time to time. Please add your comments from your own experiences with optimizing PDFs and add anything that I may have missed! About ExpertiseOnline - Alex is the founder and manager of SEO at the Chicago SEO company, ExpertiseOnline. With several years of experience in agency-side and in-house internet marketing, he created his own firm which serves small and medium sized businesses. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Optimize PDF Documents for Search"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Optimize PDF Documents for Search"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Alex Fusman\n          \n            Alex Fusman"
}