{
  "url": "https://moz.com/blog/how-google-personalization-ushers-in-a-new-age-of-search-spam",
  "slug": "how-google-personalization-ushers-in-a-new-age-of-search-spam",
  "title": "How Google Personalization Ushers in a New Age of Search Spam - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Personalized Search: The Next SEO FrontierThere is a reason folks from Yahoo were discussed in The Wisdom of Crowds. I doubt anyone involved in determining the future of a major search engine's modus operandi has not read that book. If the crowd is truly wiser, one would assume that Google would…",
  "content": "How Google Personalization Ushers in a New Age of Search Spam Search Engines By: Everett Sizemore February 5, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Everett Sizemore February 5, 2007 How Google Personalization Ushers in a New Age of Search Spam Search Engines This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Personalized Search: The Next SEO Frontier There is a reason folks from Yahoo were discussed in The Wisdom of Crowds. I doubt anyone involved in determining the future of a major search engine's modus operandi has not read that book. If the crowd is truly wiser, one would assume that Google would use data gathered from millions of personalized search results and search history accounts to influence the organic results that \"everyone\" sees when signed out of their Google account. Presuming then that Google uses the aggregate data in this way (they may not be now, but it is coming...) we can expect to see tactics such as: Whitehat: Encouraging your loyal users (perhaps those who subscribe to your newsletter or feed?) to sign up for a Google account because you know they will be visiting your pages and thus telling Google that you are relevant to them through the search history tool. Grayhat: Setting up multiple Google accounts and signing in from different IP addresses, searching for your keywords and clicking on your listing (even if you have to dig 40 pages deep), thus telling Google that your website is relevant to that keyword search. Other forms might include clubs where a group of SEOs agree to search Google while signed in and click on each other's results for certain keywords. Blackhat: In the same way that affiliate parasites trick people into paying their commissions by popping up a window and overwriting their cookies, some clever blackhats are likely to use similar tactics to trick Gmail users into searching Google for a term and clicking on a listing. It could occur so quickly that the user wouldn't even know it happened. All they know is there is a new pop-up or pop-under window, not that they went through a Google SERP to get there. MarketingHat: Trust me, you will be seeing A LOT MORE commercials that tell you to \"Google\" this or that and click on the link to their website. Maybe if enough of us post ways to game/spam the personalization train, Google will reconsider their recent decision to \"Ramp Up Personalized Search\". So how 'bout it? Can you think of more ways which SEOs might use to benefit from the fact that so many more searchers are going to be using personalized search and search history? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Google Personalization Ushers in a New Age of Search Spam"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Google Personalization Ushers in a New Age of Search Spam"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Everett Sizemore\n          \n            Everett Sizemore\n          \n            Everett Sizemore"
}