{
  "url": "https://moz.com/blog/how-social-media-can-supercharge-your-seo",
  "slug": "how-social-media-can-supercharge-your-seo",
  "title": "How Social Media Can Supercharge Your SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Social media and SEO both have the potential to boost collective success for your digital marketing strategy. The Moz social media manager, Hannah Waye, takes you through how SEOs and social media teams can collaborate to help supercharge your SEO efforts.",
  "content": "How Social Media Can Supercharge Your SEO Social Media By: Hannah Waye May 31, 2023 Table of Contents Copied! By: Hannah Waye May 31, 2023 How Social Media Can Supercharge Your SEO Social Media When working in social media, it can feel like you exist worlds away from SEO. And as an SEO, social media may feel like something that isn’t quite relevant in your day to day. But as with all things marketing, both of these digital marketing tactics have the potential to boost collective success. As a Social Media Manager, I’m here to tell you how you as an SEO can collaborate with your social media team in order to help supercharge your SEO efforts. What is a social media strategy? A social media strategy is a document that outlines your organization’s social media goals, along with how you will achieve them, both through top-level strategy and on-the-ground tactics (i.e., what you actually do). A strategy is the foundation of how your organization approaches being on social media. Social media vs. search engine optimization Social media involves owning accounts and having an active presence on social media channels like Twitter, Instagram, Facebook, LinkedIn, TikTok, and YouTube, with the goal of driving brand awareness and engagement, or increasing traffic and conversions. On the other hand, search engine optimization (SEO) is a set of practices designed to improve the appearance and positioning of web pages in organic search results, resulting in increased website traffic and exposure to your brand. Do links from social media improve your SEO? Links from popular social media platforms such as Facebook are \"no-follow\" links, meaning they do not send link authority directly to your site. PageRank is Google's algorithm that ranks web pages based on the quantity and quality of external backlinks. However, gaining no-follow links from high-quality domains is still extremely important. In the past, marketers ignored “no-follow” links, as they did not have any impact on organic ranking, but the “no-follow” attribute isn’t completely useless. A well-balanced backlink profile consisting of both followed, and no-followed links will appear more natural to Google and other search engines. Another benefit of \"no-follow\" links is the referral traffic that they can provide. Although search engines will not follow links with the attached HTML \"no-follow\" attribute, users can click them to reach your site, giving you more traffic! While no-follow links do not provide the same boost to your site's backlink profile as followed links, Google still likes to see them as a part of your site's backlink profile, and they offer a valuable source of referral traffic. The SEO benefits of increased brand awareness The primary SEO benefit of brand awareness that your social media strategy can drive is the boost you can see in \"branded\" organic search volume and clicks. Not every user encountering your brand on their Instagram or TikTok feed will click through to your site — in fact, most won’t. Most people will mentally file away your brand name and products only to perform a Google search for your company name or products after the fact, i.e. a branded search. This is especially true if your social messaging is solid and memorable. For many sites, especially newer ones, a branded search can represent a large portion of your organic traffic. 5 ways social media can improve your SEO There are five ways that a robust social media presence can help improve your SEO: Amplify website content through social channels to reach new audiences Your website content may be great, but you need to drive eyes to it somehow! Sharing your content, like blogs or guides, on social media is a win-win-win: You're building positive brand sentiment by providing content that answers people's questions.You're driving more users to your website.The positive response toward your content on social media sends signals to the social algorithms and therefore often shows it to new people. One way we do this at Moz is with this very blog! Anything the Moz Blog publishes is promoted on our social media channels, which not only drives traffic but puts valuable content right in front of our audience for them to get immediate insights from. Create and share infographics in social posts and blog articles In my experience, people love nothing more on social media than a classic infographic. Sharing information in bite-sized, colorful, and visually appealing ways will result in shares, engagement, and traffic to your website. Plus, they're versatile — include them in your blogs, and you can use them on your social media posts! Every Whiteboard Friday episode that we publish here at Moz gets its own accompanying infographic. This is a great way to resurface a well-loved episode, and give people more value up front. Build relationships with customers One of the core tenets of social media is that it's a two-way street. As you get started, you as a brand need to provide valuable content to your audience without asking them for anything in return. Once you've cultivated goodwill with your audience, you now have a relationship in which you provide value, build that favorable currency, and then you're able to cash in on it in exchange for traffic or follow-throughs on your CTAs. While our social media philosophy is that everything we put on social media has some form of value to our audience, we also make it a point to create content that doesn’t explicitly ask for anything, like clicking links or purchasing our product. Sometimes that’s providing them with information, and sometimes that can look like making them laugh. Optimize your profiles on social channels and lead audiences toward your website A simple but effective way to lead audiences to your website is to make it easy to get to! Ensure you optimize your social channels and keep a link to your website in each profile. If you need to house multiple links, use a “link in bio” service, but always make sure a quick shortcut to your website stays front and center. This strategy is something we use on our Instagram. Instead of constantly changing the link based on what we’re promoting that day or just wasting the opportunity the link in bio provides, we have a link in bio tool through Sprout Social that lets us showcase all the links that are tied to each of our posts. Target users who are more likely to convert to your site. Conversion and engagement metrics are great for SEO! With social media, you should always know who you're trying to reach and how you're going to do so. One audience you should target on social media is people you know are ready to convert. Have different posts for different audiences as a part of your content mix, and include more mature leads further down the funnel. These become easy wins because they convert and engage once they hit the website, which is helpful for SEO metrics. We know that the majority of people are coming to Moz for beginner SEO education, so we make it a point to really highlight those resources, such as our Beginner’s Guide to SEO or our How to Rank Checklist, knowing they will always see a lot of traffic and engagement. Build relationships between your social media and SEO teams A strong relationship between your social media and SEO teams is crucial. You can trade information about high-performing topics that can inform strategy on both sides or allow you to make reactive changes to your tactics based on opportunities. Schedule a monthly one-on-one with your respective counterpart in your organization to connect and fill each other in on pertinent information. With this information, you’re now armed to go out and make this happen for yourself! Take this as an opportunity to connect with your social media team and find new and innovative ways to collaborate and drive results for both social media and SEO. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Social Media Can Supercharge Your SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Social Media Can Supercharge Your SEO"
    },
    {
      "level": "H2",
      "text": "What is a social media strategy?"
    },
    {
      "level": "H2",
      "text": "Social media vs. search engine optimization"
    },
    {
      "level": "H2",
      "text": "Do links from social media improve your SEO?"
    },
    {
      "level": "H2",
      "text": "The SEO benefits of increased brand awareness"
    },
    {
      "level": "H2",
      "text": "5 ways social media can improve your SEO"
    },
    {
      "level": "H3",
      "text": "Amplify website content through social channels to reach new audiences"
    },
    {
      "level": "H3",
      "text": "Create and share infographics in social posts and blog articles"
    },
    {
      "level": "H3",
      "text": "Build relationships with customers"
    },
    {
      "level": "H3",
      "text": "Optimize your profiles on social channels and lead audiences toward your website"
    },
    {
      "level": "H3",
      "text": "Target users who are more likely to convert to your site. Conversion and engagement metrics are great for SEO!"
    },
    {
      "level": "H2",
      "text": "Build relationships between your social media and SEO teams"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    }
  ],
  "author": "Hannah Waye\n          \n            Hannah Waye\n          \n            Hannah Waye"
}