{
  "url": "https://moz.com/blog/how-googles-search-suggest-instant-works-whiteboard-friday",
  "slug": "how-googles-search-suggest-instant-works-whiteboard-friday",
  "title": "How Google's \"Search Suggest\" (Instant) Works - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Google's Search Suggest automatically recommends popular searches as you type your query into the search field. Does anyone watch Whiteboard Friday? Let's examine how Google determines these results and why they are important.\n\n\tIn this week's Whiteboard Friday, Rand suggests how you can use these…",
  "content": "How Google's \"Search Suggest\" (Instant) Works Whiteboard Friday By: Rand Fishkin March 15, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 15, 2012 How Google's \"Search Suggest\" (Instant) Works Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Google's Search Suggest automatically recommends popular searches as you type your query into the search field. Let's examine how Google determines these results and what factors go into influencing them. In this week's Whiteboard Friday, Rand suggests how you can use these instant recommendations to leverage your brand, or business. Please leave you comments below with your own suggestions! As part of the test mentioned in the video, we'd love to have your help running the query \"Does Anyone Watch Whiteboard Friday\" We'll watch the results for search suggest/instant and see what happens. Here they are just prior to publication of the blog post: Video Transcription Howdy, SEOmoz fans! Welcome to another edition of Whiteboard Friday. This week we're talking about the very exciting topic of search suggest, also known as Google Instant or Google Suggest. Bing actually does this as well. So do search engines like DuckDuckGo. Even places like Quora and Wikipedia are starting to do this so that as you type a query, so I started typing \"Does anyone . . . \" and Google has suggested things to me that perhaps I might want to search for. Curious things like, \"Does anyone still use MySpace?\" Well, maybe I am interested in that. \"Does anyone use MySpace anymore?\" Well, thank you, Google, that's quite repetitive of you. \"Does anyone live in Greenland?\" Well, yes, there are at least a few people. \"Does anyone use Google+?\" Nope, nobody. I'm just kidding. Hopefully, at least all of you watching Whiteboard Friday are using Google+. These suggestions are interesting from two perspectives. Number one, they're interesting because sometimes negative things can show up in here as you start searching for a business name. Things like scam or fraud or, I don't know, illegal activity or criminal or something like that, bad stuff can come up. Occasionally, SEOs will receive calls from clients or potential clients seeking to have that altered. Or you might be trying to control the reputation for your own business or your own name, making sure that search suggest is controlled so that the queries that show up in here, the phrases that are suggested by Google, are good ones. The second thing, of course, that is really, really interesting is thinking about this from a branding perspective. So I'll give you an exciting example. For years and years, if you started a search, let's make our own little search box here, if I started a search for SEO, the first thing that would come up, at least in most of the United States, was Seoul. Seoul, Korea, which is the capital there and the most common flight destination. Now, that's interesting, but there were other things that would come up - SEO book, SEO guide. Then as SEOmoz started to become a brand, SEOmoz would become suggested in there, which we thought was tremendously exciting and we really liked that. Then, over time, that actually moved up, and today, at least in most of the United States, although interestingly enough not Seattle because we have a lot of Korean-Americans here in Seattle who fly back and forth to Seoul and I think we have a direct flight as well, so Seattle has a lot of searches for Seoul compared to most of the rest of the country. SEOmoz is now the number one suggested result under SEO, which resulted when that shift happened. You could actually see the search traffic, if this was the line in our analytics for how much traffic we were getting for our branded keyword, that actually shot up within a couple days of that becoming the number one term. It went from, if I remember correctly, this was about a year and a half, two years go, it went from number three to number one, which is super cool. Really, really interesting stuff. This search suggest is influenceable, and it is something that over time through branding you can change the words and phrases that show up here. Let's talk about the signals that Google is using inside of search suggest. So, first off, query volume. If lots and lots of people start searching for \"Does anyone else watch Whiteboard Friday,\" how about we all search for that. Wouldn't that be cool? Should we do a test? Let's do a test! Oh, that's a great idea! All right. So try searching \"Does anyone watch Whiteboard Friday?\" I tell you what. I will Tweet some links and share some stuff on Google+, and we'll see if we can't get some people searching for this particular phrase and we'll track how many. I'll use a bitly link and share it. In fact, I'll put the bitly link in this Whiteboard Friday so that we can actually test this. What you'll see, what you'll probably see, is with a few hindered to a couple thousand searches from across the US, about 50% of SEOmoz's traffic is here inside the US, folks who watch Whiteboard Friday, and the other 50% is from other countries all around the world, which is awesome. What you'll see is that may start to show up inside of these results over time. Now this is happening because query volume is something that the engines look at and they see, hey, people are searching for this. Let's start to suggest it. Now, be very careful, because Google did, in fact, have even a particular relationship with Amazon's Mechanical Turk a few years ago. There was a representative at Mechanical Turk who was contacted by Google and Google said, basically, hey we want to know if anyone's asking for search suggest influencing, that kind of thing. Google has gotten a lot more sophisticated about this, so you can bet that today they're probably using things like unique verifiable accounts, independent users. You know, if I go and search from my computer 100 times, that's probably not going to make a big difference, but if 500 people all around the Seattle area all start searching, you can bet that \"Does anyone watch Whiteboard Friday?\" will probably show up pretty highly in these results at least in this geographic area. Which gets to the second point, the second input, and that is the geography of the searchers themselves. Now interestingly we actually ran a test here at SEOmoz a while back, where I had about 1000 people around the world search for a phrase, and that was \"travel blog\" and then the word that my wife's blog actually \"Everywhereist.\" I wanted to see if search suggest actually had an influence on ranking position. So, essentially, does putting the brand name here, will that bump up the rankings of a site? It did not appear to, at least in this example. But what it did do is show me that very quickly this would pop into search suggest, and it popped into geographic areas where I had lots of followers or friends who searched for that, which is really, really interesting. It suggests strongly that the geography is influential but that you don't necessarily need that many users searching for a particular phrase in order to get it included in here. Now, obviously, there is black and gray hat things you could do with this. Don't do that. Don't try it. You're going to get in trouble. Google obviously does some scrubbing of these results anyway, so it is going to get caught very quickly. But if you can naturally do it, through branding, through product naming, through social sharing, through content marketing, through all sorts of forms of inbound marketing, then this is something you can change. Finally, and interestingly, the keyword a phrase mentions, and what I mean by mentions is actually mentions on the Web. So particularly in news and fresh content seeing the word, right, seeing the word \"travel blog Everywhereist\" appear or seeing the word \"Does anyone watch Whiteboard Friday?\" appear, so this video for example, as this blog post goes out and the phrase \"Does anyone watch Whiteboard Friday?\" appear across the Web as RSS feeders pick it up and people start searching for it and all those kinds of things. That will influence the search suggest as well. I am betting that Google does something where they verify both geographically and through unique users, and they look for keyword phrases and mentions. So if something is being searched for, but no one is talking about it on the Web, that might be a little odd. But if something is in the news, especially in news headlines, and it's popular, it's in lots of sources, and it's getting search volume, then it's probably going to make its way into search suggest. Hopefully this Whiteboard Friday has helped you to understand how Google is doing this stuff, and I look forward to seeing you again next week. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Google's \"Search Suggest\" (Instant) Works"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Google's \"Search Suggest\" (Instant) Works"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}