{
  "url": "https://moz.com/blog/how-to-choose-the-right-domain-name",
  "slug": "how-to-choose-the-right-domain-name",
  "title": "How to Choose a Domain Name - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "How to choose a domain name: make it brandable, pronounceable, short, intuitive, bias to .com, avoid names that infringe on another company, use broad keywords, and if not available, modify.",
  "content": "How to Choose a Domain Name SEO Basics | Whiteboard Friday By: Rand Fishkin July 15, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 15, 2016 How to Choose a Domain Name SEO Basics | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Howdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week we are going to chat about how to choose a domain name. Maybe you're starting a new company, a new brand, or have an existing brand you're trying to take online. Either way, you're going to need a website. Click the image to open a high-resolution version in a new tab!Domain names have a massive impact all over the web in terms of click-through rate, from search to social media results, to referring links, to type-in traffic, brandability, and offline advertising. There's a huge wealth of places that your domain name impacts your brand and your online marketing, and we can't ignore this. 1. Make it brandableBrandable, meaning that when you hear or see the domain name, it sounds like a brand. Which means that hyphens and numbers are a real problem because they don't sound like a brand. They sound generic, or strange. For example, if we wanted to create a pasta website that has pasta recipes and sells some pasta related e-commerce products on it, Pasta-shop.com would be hard to brand, say, or remember. PastaAficionado.com sounds brandable, is unique, but quite challenging to say. PastaLabs.com would be amazing because it has a scientific connotation to it, is very brandable, unique, memorable, and stands out. 2. Make it pronounceableYou might be thinking, \"Rand, why is it so important that it's pronounceable? Most people are going to be typing it or clicking a link.\"It matters because of \"processing fluency\". A cognitive bias that human beings have where we remember (and have more positive associations with) things that we can easily say and think about. That includes pronounceability in our own minds. This is going to vary on the language and region that you're targeting. If you can't easily say the name, you're going to lose processing fluency, memorability, and the benefits of brandability that you've created. 3. Make it shortLength matters because of the processing fluency that we talk about above. The fewer characters a domain name has, the easier it is to type, say, share, and the less it gets shortened on social media sharing platforms and search results. Shorter is better. 4. Bias towards .comI know, it's 2017. Why are we still talking about .com? The internet's been around 20-plus years. Why does .com matter so much when there are so many TLD extension options? The answer is, .com is the most recognized and most accessible TLD. Cognitive fluency dictates that we should go with something easy, that people have an association with, and .com is still the primary TLD. If you want to build up a very brandable domain that can do well, you want a .com. Probably, eventually, if you are very successful, you're going to have to try and go capture it anyway, and so I would bias you to get it if you can. If it's unavailable, my suggestion would be to go with the .net, .co, or a known ccTLD. Those are your best bets. A known ccTLD might be something like .ca in Canada or .it in Italy. 5. Avoid trademark infringementYou have to be careful because it's not whether you think your domain name could be confused. It's whether you think a judge in a jurisdiction, where a company might take legal action against you, would consider your domain name confusable. This can also create brand confusion, which is hard for your brandability. You should talk to an attorney or a legal professional if you have real concerns. Trademark owners can attempt to sue a domain name owner, who's owning the domain legitimately and using it for business purposes, and that sucks. 6. Make it intuitiveA good domain name gives people a strong idea of what a website will be about. Being able to look at a domain name and say, \"Oh, they probably do this. This is probably what that company is up to\" is a big win. PastaPerfected.com, for example, is pretty obvious, intuitively about pasta, and anyone could figure that out. 7. Use broad keywordsKeywords in a domain name can help with the cognitive fluency biases, but also from an SEO perspective. Google has been biasing away from these exact match and partial match domains, but the anchor text you get from people linking to your domain can help. If you can get a keyword mention in your domain name that helps make it obvious what you're website is about, go for it. But if you're trying to secure a keyword rich or a keyword targeted domain, I would stay away from those in 2017. They don't carry the weight that they used to and have negative associations (with users and search engines) that you should avoid. For example, I would not purchase a domain name like; RecipesForPasta.com or BuyPastaOnline.com. I would instead, go for something very broad like Gusto.com. Think about Amazon.com or Google.com, which clearly has no association with what it is. These are very well-branded but don't have keyword richness to them. It's more of a creative association, just like \"gusto\" means \"taste\" in Italian. So I might be tempted to go in that direction instead. 8. It's okay to append or modify itIf your domain name is not available, it's okay to go out and add a suffix or a prefix. It is okay to use an alternate TLD extension, like we talked about previously, and it's okay to be a little bit creative with your online brand. For example, let's say my brand name is Pastaterra. Maybe I've already got a shop somewhere maybe in the Seattle area and I have been selling pasta at my shop and now I'm going online with it. Well, it is okay for me to do something like ThePastaterra.com, or PastaterraShop.com, or even Pastaterra.net. With these rules in mind, I would love to hear from all of you about your domain choices, domain name biases, and what you think is working in 2016. Hopefully, we'll see you again next week for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Choose a Domain Name"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Choose a Domain Name"
    },
    {
      "level": "H2",
      "text": "1. Make it brandable"
    },
    {
      "level": "H2",
      "text": "2. Make it pronounceable"
    },
    {
      "level": "H2",
      "text": "3. Make it short"
    },
    {
      "level": "H2",
      "text": "4. Bias towards .com"
    },
    {
      "level": "H2",
      "text": "5. Avoid trademark infringement"
    },
    {
      "level": "H2",
      "text": "6. Make it intuitive"
    },
    {
      "level": "H2",
      "text": "7. Use broad keywords"
    },
    {
      "level": "H2",
      "text": "8. It's okay to append or modify it"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}