{
  "url": "https://moz.com/blog/how-i-made-1349050-with-adsense-last-november",
  "slug": "how-i-made-1349050-with-adsense-last-november",
  "title": "How I Made $13,490.50 With Adsense Last November - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "How I Made $13,490.50 With Adsense Last November Online Advertising By: Orion Group November 14, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Orion Group November 14, 2012 How I Made $13,490.50 With Adsense Last November Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Black Friday: Thanksgiving’s Annual After-Party It’s almost here--the shopping party that consumers have been waiting for since last Christmas! As the unofficial opening of the holiday shopping season, the Friday after Thanksgiving or “Black Friday” is hands-down THE most promoted day of the year. For decades Black Friday has been recognized by retailers as the point they begin to turn a profit, or move from the red into “the black.” According to the National Retail Federation, Black Friday and holiday sales can account for up to 40% of annual retail sales for many business sectors, making it crucial for them to have valuable deals for shoppers. More recently the annual shopping party has expanded to “Cyber Monday,” when consumers jump online and grab holiday bargains from their computers, tablets and smartphones. It’s also the day that retailers finally announce their absolute best deals of the year, offering their hottest savings on toys, electronics, apparel, jewelry, housewares and more. But more than that, it’s the time of year when consumers want to know about each and every door-buster and early-bird sale, ASAP. They fervently begin the hunt, hoping to find deeply discounted Black Friday ads as soon as they are leaked. How I Leveraged Black Friday Fever and Made $13,500 in Just One Month Recognizing a profitable opportunity, I created a website that gives people what they want: early intel about Black Friday discounts and hot items. Meet ThanksgivingBlackFridayAds.com (TBFA), a website focused solely on publishing leaked Black Friday ads and circulars weeks before they are printed and distributed in the media. Traffic spikes at TBFA every year just after Halloween, when shoppers start thinking about holiday sales. Visitors flood the site hoping to get an early peek at the ads to plan their Black Friday shopping day. In its third year (last year), TBFA continued to gain strength. It’s a healthy site through the holidays and sits basically idle other months of the year. The year-over-year growth of TBFA had been extraordinary until this 2012 Black Friday because of a Google penalty. (Yes, I tried removing bad links, uploaded a disavow list, apologized and then resubmitted the site for reconsideration, but I have a feeling Google is putting off the reconsideration until they know it's too late for me this year... I submitted the reconsideration request on Oct 19th and followed up again on Oct 31, but still have not heard a word from Google.) This year, organic traffic is down 95% due to the penalty. It doesn't help either that Yahoo/Bing decided to globally deindex almost any site that had the words \"Black Friday\" in its domain name too. For the past three years I had consistently tracked a 500 to 1,000% boost in site activity, each year attracting more visitors than projected. Wisely, I had decided to implement the most optimized tools and technology to meet the growing demand. Last November TBFA easily served 5.9 million pages to 413,458 visitors within the 30-day month. At the height of our traffic surge, it served approximately 600 concurrent users up to 900 pages per minute. I was prepared for the traffic rush. Visitors never saw an increase in average page load times, even when the site was under heavy load, as documented here: https://pagodabox.com/case-studies/scale-wordpress-case-study. Anyways... having a strong, established site with a growing audience, the next challenge was to quickly and efficiently monetize the opportunity. I implemented Adsense--a free Google product that allows a site like ThanksgivingBlackFridayAds.com to earn money when visitors click on Google ads. Ads compete in an auction, and Google automatically selects and places the ones that have the best revenue potential for each site. Earnings are determined on a Cost Per Click (CPC) basis, where the site is paid when a visitor clicks on a display ad. Not all ads earn at the same rate. Payouts vary daily due to advertiser budgets, site content, and the actual ads that visitors click. My Best Performing Ads Fact: The ad with the most impressions had the most clicks, earning the most revenue. By far, the 468x60 display ads placed in the middle of the blog posts made the most revenue, followed by the 728x90 leaderboards placed at the bottom of each page displaying Black Friday ad scans. I was surprised to find that a 160x600 skyscraper ad with the best Clickthrough rate (CTR) didn’t generate the most money. Most likely, this was because of daily variances in ad pricing. Another Success Metric: Ad Request RPM Revenue per thousand impressions (RPM) projects the estimated earnings a site can accrue for every thousand ad impressions it receives. An RPM doesn't show how much a site has actually earned. Instead, it calculates the approximate value of ad impressions by dividing estimated earnings by the number of page views, impressions, or queries received (a.k.a. ad requests), then multiplying by 1,000. Ad request RPM = (Estimated earnings / Number of ad requests) x 1,000 Example: if a site earns an estimated $60 from 15,000 ad requests, the Ad Request RPM would be ($60 / 15,000) x 1,000 or $4.00. My best-performing ad, measured in RPMs, was a Skyscraper along the right column sidebar, appearing on only a handful of the pages. This ad spot definitely stands out from the rest, since it had the highest Ad Request (CTR), the lowest CPC and the highest RPM. With more experimentation, I’ll be able to bring about the maximum ROI for that ad placement. I Made Even More Money Working With Affiliate Sales My revenue stream for TBFA wasn’t limited only to Adsense. I also made plenty of money working with affiliate advertisers who gained sales from exposure on my site. Google Affiliate Network Whenever a visitor clicked on an offer and purchased from a Google-placed affiliate advertiser, I earned performance fees for helping those quality advertisers drive conversions, or sales. This revenue is above and beyond what I earned from Adsense. PepperJam, LinkShare, Commission Junction, Skimlinks & Amazon Associates Similar to Adsense, publishers put text links, banner ads and coupons codes on their sites. With PepperJam and Skimlinks and such, I earned a commission with each placement on my site that led to a sale. Amazon Associates is basically the same, but works on a lucrative sliding commission scale. The more an advertiser sells and ships as a result of the ad on my site, the higher the commissions I’m paid. Of all the affiliate programs, I made the most, by far, from Amazon. You Can Do It, Too The holiday season is prime time to maximize web traffic, engage with your audience, and make some money. Sites are seeing plenty of traffic from several sources like email, referrals from links and ad placements, organic searches and more. And, those referrals are looking to buy, so it’s an optimum time to cash in on those ad clicks and commissions from affiliate sites. Working with affiliate programs is an easy process and doesn’t take much time. Give it a shot, test the ad placements, and tweak your system as you go to up your performance level. So, was this blog post helpful to you? Did my $13,490 payout make you want to monetize your website as a new revenue stream? Anything you think I could have done differently or added for better performance? I’d love to hear your thoughts and am happy to answer any questions. Just leave a reply for me in the comments section below. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How I Made $13,490.50 With Adsense Last November"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How I Made $13,490.50 With Adsense Last November"
    },
    {
      "level": "H2",
      "text": "Black Friday: Thanksgiving’s Annual After-Party"
    },
    {
      "level": "H2",
      "text": "How I Leveraged Black Friday Fever and Made $13,500 in Just One Month"
    },
    {
      "level": "H3",
      "text": "My Best Performing Ads"
    },
    {
      "level": "H3",
      "text": "Another Success Metric: Ad Request RPM"
    },
    {
      "level": "H2",
      "text": "I Made Even More Money Working With Affiliate Sales"
    },
    {
      "level": "H3",
      "text": "Google Affiliate Network"
    },
    {
      "level": "H3",
      "text": "PepperJam, LinkShare, Commission Junction, Skimlinks & Amazon Associates"
    },
    {
      "level": "H2",
      "text": "You Can Do It, Too"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Orion Group\n          \n            Orion Group"
}