{
  "url": "https://moz.com/blog/how-to-rank-well-without-inlinks",
  "slug": "how-to-rank-well-without-inlinks",
  "title": "How to Rank Well Without Inlinks - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The idea that you cannot be found on the web if there are no inlinks to one's site was recently the subject of a debate between myself and a fellow geek. My response was that one does not need ANY links to have a good ranking. This myth about inbound links (at least in my view it's a myth) is silly.",
  "content": "How to Rank Well Without Inlinks Link Building D By: davidseo March 6, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! D By: davidseo March 6, 2009 How to Rank Well Without Inlinks Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. The idea that you cannot be found on the web if there are no inlinks to one's site was recently the subject of a debate between myself and a fellow geek. My response was that one does not need ANY links to have a good ranking. This myth about inbound links (at least in my view it's a myth) is silly. Between embedded tracking code for Webmaster Tools and Analytics, your site will be indexed by Google and other engines will follow. If you do not use tracking code then embed a video. If you have no embeded code whatsoever, GOOGLE WILL FIND YOU simply because your server is in a range sharing other sites. If you have a dedicated server and no embedded code, Google will still find you IF YOU MAKE OUTBOUND LINKS from your site! You have no outbound links, no embedded code and a dedicated server - Google will find you within 3 months at the longest. Now to the idea of ranking well with no inlinks: The answer is one can rank very well without PageRank or links with keywords pointing to you. How? Simply by having the following: Good content Deep content Patience to get out of the sandbox. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Rank Well Without Inlinks"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Rank Well Without Inlinks"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "davidseo\n          \n            davidseo"
}