{
  "url": "https://moz.com/blog/how-to-network-online",
  "slug": "how-to-network-online",
  "title": "7 Tips to Get the Most Out of Online Conferences - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As we anxiously await the return to in-person conferences, with a little ingenuity and virtual elbow grease, we can still forge new professional relationships over an internet connection rather than a cocktail. Read on for tips on how to bring your best self to digital events, and for networking…",
  "content": "7 Tips to Get the Most Out of Online Conferences SEO Events By: Cheryl Draper June 10, 2021 Table of Contents Copied! By: Cheryl Draper June 10, 2021 7 Tips to Get the Most Out of Online Conferences SEO Events As we anxiously await the return to in-person conferences, with a little ingenuity and virtual elbow grease, we can still forge new professional relationships over an internet connection rather than a cocktail. Read on for tips on how to bring your best self to digital events, and for networking while remote! Speaking of online conferences, don’t forget to snag your ticket to MozCon Virtual 2021! Secure Your Seat 1. Set your intention To get the most out of your online event, you need to go in with an intention. That way you’ll be more likely to gain something from the experience. Ask yourself, what are you hoping to achieve? Some examples could be: Gain a business opportunityLearn more about how to recover from the latest algorithm updateFind ways to increase efficiency within your SEO processesFeel more confident selling your services 2. Schedule accordingly Many events will provide you with schedules ahead of time — look at them! (Pssst...if you haven’t yet, now is the perfect time to check out the agenda for MozCon Virtual.) These schedules can help you go into the conference with a clear idea of how you’re going to spend your time. Going in with a plan will allow you to focus on the content of the event and your intentions each day, as opposed to wasting time frantically trying to decide what sessions you’re going to attend. Choosing your sessions Once you know what your intentions are and you have the event schedule, determine what will be the most beneficial content for you. This can be especially helpful when the event has multiple tracks, very few break times, etc. Choosing your sessions may come down to a process of elimination, and it’s much easier to eliminate sessions when you have some sort of goal in mind. Things to consider when choosing your sessions are: The topicThe speakerThe timeThe availability of on-demand videos post-conference Your intention may be to broaden your horizons this year, so instead of opting to see presentations with the same topics or speakers that you saw last year, you may see someone new discussing something you find interesting but haven’t had time to explore. You may have a tight schedule and not be able to make anything past 3pm. If some of the sessions will be available after the conference, it may be worth checking out topics you wouldn’t have otherwise. Know when to take a break When you’re planning out your schedule, you need to make sure you build in time for breaks. This means time to eat, time to decompress, time to refill your coffee cup, and time to do work or home stuff. Conferences usually have a lot of breaks and that’s for good reason. Ideally, you’re going to be learning a lot. But if you try to learn it all at once without giving your brain a break, very little of it will stick. So, be sure to listen to your body. If you start to feel foggy or overwhelmed, take a break, grab some water, and move around a bit. Build in networking time Something else you want to account for when planning your virtual event agenda is when you’re going to network. Some conferences will have time to network built in, but others won’t. You’ll want to dedicate time to get to know the other attendees by joining conversations and adding people on social media. This will look a bit different in the virtual space, as you won’t be meeting for coffee or chatting in the lobby, but try to stay creative! Zoom chats and video calls are a great way to connect with new or old friends. Recap at the end of the day At the end of each day, take some time to reflect. Think back to what your intention was, what you did throughout the day to fulfill that intention, and what you can put into action moving forward. This is a great exercise to ensure you’re making the most out of the event. Far too often, we take in all of the information and do nothing with it! That’s why we like to suggest creating at least three action items at the end of each day. 3. Gather the essentials Okay, it’s the first day of the conference and you’re about to jump in front of the computer. BUT! Before you do that, you need to make sure you have everything you need to be successful. Get a clean notebook or start a fresh doc Having a clean slate for notes will help you stay focused while attending any conference (virtual or otherwise). So grab a new, crisp notebook or create a new document file on your computer before you get started. If you decide to go the computer route, be sure you close all other tabs and turn off notifications! You want to be sure that your attention stays on the conference. Taking notes during a virtual conference With that new notebook or document of yours, you’ll want to take the most effective notes possible. With that in mind, here are a few things to take note of: What you learnedHow can you apply itWhat can you share with your team To ensure that you’re on track to capture each of these things, when you go into each session, write your intention for the session at the top of your notes page. Then, divide your pages by “what I learned,” “how to apply,” and “what to share.” This will keep your notes nice and organized and give you a visual cue on whether or not you’re getting what you expected out of the session. It will also make your end-of-day recap much easier. When it comes to virtual events, one of the biggest benefits is that you often get the slide decks and video bundles afterward. We suggest finding out whether the event you’re attending offers those things before you start taking notes, as it may lighten your note-taking burden a bit. Have some snacks, water, and coffee (or tea) Perhaps the most important things to have during a virtual conference are the snacks and drinks! As you know, at MozCon, we take this part very seriously, so we expect nothing less if you attend our virtual event. Brain food can help you stay focused. Some of our favorite snacks are granola bars, nuts, veggies, and of course, donuts. However, you have full control over the spread this year. Be sure to also have plenty of water and your favorite caffeinated beverage as well! 4. Look for networking opportunities Depending on which virtual event you attend, the networking opportunities will look different. Keeping a creative eye out for opportunity is key to your success! Live chats Much like during regular conferences, there are bound to be live chats happening. They may happen on the actual event platform, or they may take place on social media. Some events will use a platform like Zoom that allows viewers to chat with each other within the platform, while others may have more of a broadcast format where chats happen on Twitter with a hashtag. Joining Q&As A super valuable aspect of conferences is being able to speak to presenters after they give their talk. Sometimes this happens during a predetermined time slot, such as right after the presentation, or it may happen when you catch them in the lobby or at an event later on. Either way, this time to ask questions about their expertise is a huge value-add to the experience. With conferences going virtual and live chats happening publicly during the presentations, this Q&A time has shifted a bit. Instead of having to wait for the presentation to be over, in some cases, presenters will reply to questions from the live chat as they're speaking. Some panels are pre-recorded, giving speakers a chance to interact on various platforms during the event itself. Some events will even have specific “presentations” that are more like facilitated Ask Me Anything-style interviews or panels where questions are taken from the audience and posed to the speaker(s). Networking at MozCon Virtual Every year, we hear from attendees about how networking is one of their favorite parts of the conference. We made sure to keep it an integral part of this year's virtual event, too — check out all the ways you can connect with speakers, industry experts, attendees, and thought leaders at MozCon Virtual 2021! Beyond the opportunities for social connection within the conference itself, we will also have a virtual photo booth where attendees can snap a selfie, add some fancy circus-themed backgrounds, frames and stickers, and share them out on social media! In-session Q&A chat Mid-presentation, pop into the Q&A chat with your real-time questions and get them answered by speakers. You'll also be able to chat with other attendees about the content and provide your own insights about the session and topic. Speakers will be available to answer questions during their scheduled session times, so it's a perfect opportunity to get clarification, further insight, or forge those all-important connections! Birds of a Feather \"table\" discussions Birds of a Feather tables are one of the biggest MozCon hits year after year, and we didn't want anyone to miss out! We'll facilitate 30-minute-long group discussions each day of the conference for you to connect with those interested in specific topics via video and audio chat. Each discussion will be led by an industry leader, giving you all the opportunity to say \"hey\" to the folks whose work you admire and collaborate with them on ideas, theories, obstacles you've faced, and more. MozCon Virtual partners This year, we have a curated lineup of trusted partners who can't wait to meet and network with attendees of MozCon, including 97th Floor, Crowd Content, PageOnePower/PAGES SEO Magazine, and Wix! Attendees will be able to visit and chat with sponsors within the MozCon Virtual platform, and sponsors will also be hosting Birds of a Feather sessions, plus taking part in presentation chats! 5. Get active No matter where online networking is happening, be sure you're a part of it! The more you interact, the more likely people are to recognize your name when you reach out after the event. The only caution here is that you have to be sure your interactions are meaningful — don’t just comment with clapping hands. Add something to the conversation. Add insight The best thing about people is that we're all different and have fresh perspectives to bring to the table. Don’t be afraid to add on to someone’s thoughts. Let's use a fun example. If someone says that the best mascot hug ever was from Mickey Mouse at Disneyland, you may jump in and ask if they’ve ever met Roger MozBot, famed hugger and robot dancer extraordinaire. Or you could build on the thought by saying something like, “Mickey is a great hugger, I think it’s because he goes over instead of under!” In both of these instances, you’ve joined the conversation and added value. Add clarification Speakers often try to fit a lot of information into a relatively short time frame. That said, questions will likely arise in the live chats. This could very easily be your time to shine! If you've got knowledge to share, feel free to answer the question to the best of your ability and try to add clarification. This is absolutely one of the best ways to position yourself as an expert and form a relationship with someone you’ve never met. It allows you to prove you’re knowledgeable and give the person something they value for free. Add sources Whether you are asking a question, answering a question, or just chiming in with added insight, adding resources in conversation is extremely beneficial. This could mean that you recommend a tool, a person, or an article link. These resources for the other viewers can be extremely beneficial and help you establish your credibility. Now, we don’t suggest trying to come up with a source for everything, but if you have one right off of the top of your head, dropping a link in the chat may really help someone. BONUS: Add people on social While this one's not necessarily about adding value per se, it is about adding. Adding influencers, presenters, or other attendees after interacting with them (even if briefly) may increase your chances of getting a follow-back or accepted request as you'll still be top of mind. Try to add people no later than 24 hours after your last interaction, and consider sending a friendly \"hey!\" with a note about what you spoke about to keep the connection fresh. 6. Perfect your follow-up After connecting with people during the online conference, you'll want to follow up with them and stay in touch. The most important part of following up is the first impression. You don’t want to come right out of the gate with a request of any sort. Instead, look to build a relationship first. This could mean shooting a quick follow-up message recapping your conversation with the person, telling them that you appreciated their time and that you look forward to more conversations. After sending your initial follow-up, be sure to interact with the person at least once a week to stay top-of-mind. This is easiest on social media as you can like, comment, share their content, and ensure that your name is showing up in their notifications. However, direct messages, emails, and even phone calls are sure to be more impactful. The best thing you can do when following up is to stick to what you're most comfortable with and be consistent while continuing to add value. 7. Have fun and be yourself! The number-one thing you have to offer is yourself. Your experiences make you unique and others can learn from that! So when you are attending online events and connecting with others, just remember to be yourself. And of course, have fun! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "7 Tips to Get the Most Out of Online Conferences"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "7 Tips to Get the Most Out of Online Conferences"
    },
    {
      "level": "H2",
      "text": "1. Set your intention"
    },
    {
      "level": "H2",
      "text": "2. Schedule accordingly"
    },
    {
      "level": "H3",
      "text": "Choosing your sessions"
    },
    {
      "level": "H3",
      "text": "Know when to take a break"
    },
    {
      "level": "H3",
      "text": "Build in networking time"
    },
    {
      "level": "H3",
      "text": "Recap at the end of the day"
    },
    {
      "level": "H2",
      "text": "3. Gather the essentials"
    },
    {
      "level": "H3",
      "text": "Get a clean notebook or start a fresh doc"
    },
    {
      "level": "H4",
      "text": "Taking notes during a virtual conference"
    },
    {
      "level": "H3",
      "text": "Have some snacks, water, and coffee (or tea)"
    },
    {
      "level": "H2",
      "text": "4.  Look for networking opportunities"
    },
    {
      "level": "H3",
      "text": "Live chats"
    },
    {
      "level": "H3",
      "text": "Joining Q&As"
    },
    {
      "level": "H3",
      "text": "Networking at MozCon Virtual"
    },
    {
      "level": "H4",
      "text": "In-session Q&A chat"
    },
    {
      "level": "H4",
      "text": "Birds of a Feather \"table\" discussions"
    },
    {
      "level": "H4",
      "text": "MozCon Virtual partners"
    },
    {
      "level": "H2",
      "text": "5.  Get active"
    },
    {
      "level": "H3",
      "text": "Add insight"
    },
    {
      "level": "H3",
      "text": "Add clarification"
    },
    {
      "level": "H3",
      "text": "Add sources"
    },
    {
      "level": "H3",
      "text": "BONUS: Add people on social"
    },
    {
      "level": "H2",
      "text": "6.  Perfect your follow-up"
    },
    {
      "level": "H2",
      "text": "7. Have fun and be yourself!"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Cheryl Draper\n          \n            Cheryl Draper\n          \n            Cheryl Draper"
}