{
  "url": "https://moz.com/blog/how-to-avoid-needing-an-seo",
  "slug": "how-to-avoid-needing-an-seo",
  "title": "How to Avoid Needing an SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Not every website, company or project needs an SEO.\nI know this seems blasphemous, but it's very true. There are a few critical elements you need to secure before you can be confident that an SEO firm or link building staff is uneccessary:\n\nOffer Something AmazingIf you have content, products or…",
  "content": "How to Avoid Needing an SEO Public Relations By: Rand Fishkin February 6, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 6, 2006 How to Avoid Needing an SEO Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Not every website, company or project needs an SEO. I know this seems blasphemous, but it's very true. There are a few critical elements you need to secure before you can be confident that an SEO firm or link building staff is uneccessary: Offer Something AmazingIf you have content, products or services that are so fascinatingly cool that they demand attention from the web community (or worldwide news agencies) all by themselves. A good example would be the Optimus Keyboard or anything that makes it onto a list like Time's Coolest Inventions._ Build a Phenomenal WebsiteGreat content isn't enough - you need a website that hits on all cylinders, including design, information architecture, search-engine-friendliness, usability and functionality. If you can put together something like Etsy has for e-commerce or NewsVine did for news, you're in great shape._ Public Relations & MarketingWhether in-house or outsourced, you need someone to help spread your message. A public relations company (or team) can wine and dine the reporters of the world, getting you \"free\" press coverage that brings credibility and authority. A marketing firm can build your reputation through advertising, promotions, events and sponsorships._ Leach Off an Existing, Popular BrandBy utlilizing the publicity, trust and infrastructure of an existing site/brand/company that's already successful in a space, you can easily reach your audience and inform them of the new site. Assuming you're in the right sector, these readers will help you \"spread the word\" and make the project a success._ First and OnlyIf you're the first on the scene with a product/service, you can capitalize by owning your niche devoid of competition. These are very few and far between, but every now and then, another EBay, Craigslist, MySpace or Amazon comes along. Numbers 4 and 5 aren't \"neccessary\" to succeed, but they certainly help, but numbers 1-3 are absolutely essential if you want to have success without resorting to paid link building, traffic building or linkbaiting. SEOs fill a great niche, but we're not for everyone and if you're planning a new site in a competitive sector, the best thing you can do is call a great SEO and ask \"what do I do now to ensure I never need your services in the future?\" I'd love to get a phone call like that. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Avoid Needing an SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Avoid Needing an SEO"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}