{
  "url": "https://moz.com/blog/how-did-video-search-handle-the-virginia-tech-tragedy-a-comparison",
  "slug": "how-did-video-search-handle-the-virginia-tech-tragedy-a-comparison",
  "title": "How did video search handle the Virginia Tech Tragedy? A comparison. - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Tonight, like so many others in the U.S. and around the world, I am shaken by the horrific events at the Virginia Tech campus.  With my little boy sleeping safely in the next room, thank god, my heart goes out to the families that lost their children - barely more than children - in this…",
  "content": "How did video search handle the Virginia Tech Tragedy? A comparison. Whiteboard Friday G By: GradivaCouzin April 18, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! G By: GradivaCouzin April 18, 2007 How did video search handle the Virginia Tech Tragedy? A comparison. Whiteboard Friday This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Tonight, like so many others in the U.S. and around the world, I am shaken by the horrific events at the Virginia Tech campus. With my little boy sleeping safely in the next room, thank god, my heart goes out to the families that lost their children - barely more than children - in this tragedy. Seeking news online, I came across a reference to a \"grainy cell phone video\" showing some of the events unfolding (you've probably seen this by now) on the campus. I am not normally a consumer of videos online (something about being from the Midwest, maybe?), so I didn't really know the best place to look. I started at YouTube, and was surprised by the poor quality of the results. I went on to review a few other sites and i thought that my findings might be of interest. Here is how each of them performed: YouTube The home page of YouTube showed no reference to the Virginia Tech tragedy. Youtube results provide nothing on the events of the current day. Google Video Google Video's homepage, including their presumably algorithmic \"Popular\" and perhaps not-so-algorithmic \"Featured\" videos, contained South Park Nagger, spray paint art, and Playboy Marijuana, but no video on the Virginia Tech shootings. Searching for \"virginia tech\" brought up the same results as the YouTube search. Google Video and YouTube - so far, no success in finding current information. Yahoo! Video The Yahoo! Video homepage had no Virginia Tech content on it. Again, very unsatisfying results for anyone seeking information on a major current event. Microsoft Live Video Search (Beta) This beta search page for Microsoft's new video seach product doesn't even have a home page (just a blank screen)! Would you believe that the search engine most detested by SEO pros performed so much better than other video search services? With content apparently spidered and indexed from CNN, Yahoo! News, and other news sources, Microsoft's video search provided much more current information. Blinkx Microsoft provided the results I had expected from video search, but in my opinion, the hands-down best overall video search service for news related to the Virginia Tech tragedy was Blinkx.com. Blinkx has been around for ages, but seems to be struggling to gain market share in video search. I was most impressed that the home page included many clearly labeled and easy-to-identify videos on the crisis -- whether algorithmic or hand-edited, the page is dynamic and informative, and most importantly it provides up-to-date and well-organized information for grown-ups. From now on, Blinkx will be my first stop when seeking video content on current events! * * * My deepest sympathies to the people affected by the Virginia Tech attacks. May they find comfort in knowing that the thoughts and prayers of millions are with them in this time of grief. * * * Gradiva Couzin http://www.yourseoplan.com/ Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How did video search handle the Virginia Tech Tragedy? A comparison."
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How did video search handle the Virginia Tech Tragedy? A comparison."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "GradivaCouzin\n          \n            GradivaCouzin"
}