{
  "url": "https://moz.com/blog/how-did-you-learn-seo",
  "slug": "how-did-you-learn-seo",
  "title": "How Did You Learn SEO? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "No April's Fools stuff from us this year - the search world is overrun with pranks. I do have have an important question that I'd love to get answers to. I'll start by providing my own.\nIn 2001, the company that would become SEOmoz (at the time just Gillian, Matt & myself) began taking on some…",
  "content": "How Did You Learn SEO? Public Relations By: Rand Fishkin March 31, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 31, 2007 How Did You Learn SEO? Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. No April's Fools stuff from us this year - the search world is overrun with pranks. I do have have an important question that I'd love to get answers to. I'll start by providing my own. In 2001, the company that would become SEOmoz (at the time just Gillian, Matt & myself) began taking on some e-commerce development projects. Previously, we had designed static websites in Flash & HTML and done some consulting in usability, but with the addition of Matt to the team, we were ready to take on some beefier projects. We designed and developed several sites for clients and were struggling to help them get more traffic and sales through search and thus, hired a local SEO firm to help us. We had terrible luck and by mid-2002, I was lurking on forums like SEOChat, HighRankings, Cre8asite and Sitepoint (too cheap to sign up for WebmasterWorld). In 2003, we reached a turning point with one of our clients, achieving successful rankings for the first time. We took a few more clients and in 2004, were providing SEO services as part of our work. 2004 is also when the first incarnation of SEOmoz launched, providing tools, research articles and the nascent beginnings of a blog. My learning process started in the forums of SEO where I picked up tips from folks like Donna, EGOL, Webby and applied them to our sites in the hopes of achieving rankings. The SEO blog scene was, by and large, a deserted landscape until late in 2004, but looking through the forums today, it appears the signal to noise ratio is so low that blogs make for a better learning experience. All of this brings me to my question - how did you learn SEO? What got you started in the field? In addition to filling out the above poll, I'm hoping to hear some stories in the comments - with formal education largely impossible, it's fascinating to hear how search marketers were able to navigate their way into the niche field of SEO/M. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Did You Learn SEO?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Did You Learn SEO?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}