{
  "url": "https://moz.com/blog/how-my-mom-thinks-search-engines-work",
  "slug": "how-my-mom-thinks-search-engines-work",
  "title": "How My Mom Thinks Search Engines Work - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For those of you who have been doing SEO for awhile now, think back to when you first started pitching ideas to bosses, client lists, or other members of your marketing team. If you remember a few blank stares and responses like, \"Don't most people just search for our brand name if they want to…",
  "content": "How My Mom Thinks Search Engines Work Marketing Psychology By: Rob Toledo May 13, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rob Toledo May 13, 2013 How My Mom Thinks Search Engines Work Marketing Psychology The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. With Mother’s Day in many countries having just passed (I learned this week that the UK celebrates Mothering Sunday earlier in the year), I thought it would be fun to have a conversation about SEO with one of the most incredible people on the entire planet: my mom. I asked her about what it is she believes our industry does on a daily basis as well as how she thinks search engines function in general. The conversation was great; sort of similar to rubber duck debugging, except in this case the rubber duck was my mom, and instead of sitting there silently, she could comment when I started using terms she did not understand (and who can blame her; we’re pretty notorious for inventing words and phrases on whims). Here are some of my favorite moments from the chat: What do you think I do at work all day? “Work on your computer, fly toy helicopters, drink lattes… etc.” Not going to lie, that’s pretty accurate; sorry, Will and Duncan! What does SEO stand for? “Search engine online” Not quite, but at least she didn’t say “SEO optimization.” Do you know what Bing is? “Bing bong?” *laughter ensues* \"No, I had to look it up.\" I can appreciate the humor. I'm assuming she used Google but missed the irony; sorry, Duane. How do search engines like Google, Bing, and Yahoo decide who to put at the top of a search result? “Don’t they base it mostly off of which sites are read the most?” Not too far off, but how do they establish that list to begin with? “Test which ones people click on the most and then move them around a bunch to see what works best, right?” Before I worked in SEO, this was how I thought it worked too; and in the grand scheme of things, this has some loose truth buried in there; partial credit. How do search engines make money? “By putting those little ads all over the page.” Nailed it. If you were looking for a veterinarian close to you, what would you do? “I’d go to Google.com and type in “best veterinarian in Seattle” and look for people’s reviews. Or maybe ask a neighbor.” Ah yes, the one thing that always thwarts a #1 ranking in the SERPs: a personalized recommendation from a friend. If you were looking for advice on how to train a dog to stop barking, what would you search for? “How do I train my dog to stop barking, and then probably look for a website where people ask questions and then others give answers.” I think she’s talking about Yahoo! Answers, the black hole of infinite internet wisdom… How far down the page on the search results will you look? “Not too far, I don’t normally find what I want past the first couple listings.” Besides being at the top of the page, what is the biggest factor on what you click on in the search results? “How many stars it has for reviews or if I recognize a company that I like.” Ah yes, the trust factor. If you don't like the results for those searches, what would you do differently in your second search? “Probably give up. No, just kidding. Probably pick some different words to search for; maybe call someone depending on what I needed.” Bonus question: If you were running a small flower shop, how would you try and get to the front page of Google for when people searched \"fresh flowers\"? “I’d name it AAA Best Fresh Flowers or something. I don't know, probably call you, isn’t that your job?” Phone book marketing at its finest. OK that was fun, but why? While those questions and subsequent answers might seem kind of silly, there is immense value in removing yourself from the SEO echo chamber and having occasional, down-to-earth conversations with someone from the 99% of search engine users who have minimal understanding of “under the hood” mechanics on results pages. For me, working at an agency makes it pretty easy to get wrapped up in the lingo and terminology that many of us all comprehend without second thought. Phrases like WMT, dynamic urls, 301 redirects, SERPs, canonicalization, etc. are tossed around in casual conversation over morning coffee like we’re talking about the weather. But ask an outsider to translate, and I’m willing to bet we sound like toddlers speaking gibberish. This is certainly not exclusive to SEO, as any of us who have friends in terminology-heavy industries like software, finance or medical fields can easily get lost listening in during a technical conversation. Or my personal favorite, ask someone in the US Military to spout off as many acronyms as they can remember and your head will be left spinning; it’s impressive. Point being, it is important to understand that this gap in comprehension exists. When I was a bank teller in college, I would always find myself using terms and phrases that quickly earned perplexed looks from my customers. “It looks like the APR on your HELOC isn’t up-to-date; let’s have a PB take a look.” I learned pretty quickly that in order to communicate effectively to my customers, it was vitally important that I spoke in a much more common language that they understood completely. Nobody likes to feel dumb; in my case, being a college kid trying to talk about personal finance to a partner at a law firm rarely ends well. “I’ll have my people take a look,” was always one of my favorite responses as the clarity in my error was bright as day. For those of you who have been doing this whole SEO thing for a while now, think back to when you first started pitching the idea to bosses, your client list or even other marketing folks. I’m sure you can distinctly remember the looks you received during those conversations. One of my favorite responses of all time was, “Don’t most people just search for our brand name if they want to shop on our site?” So, let's simplify One of most brilliant ads of the late 90s was the Apple Switch campaign. Instead of focusing on RAM, graphics cards, processing speed and hard drive space, Apple took an approach that created a common user, the college student, the non-technical parents, the elderly, and simplified a message specifically for them: We would all be doing ourselves a huge favor to make sure that our daily conversations with people not directly entrenched in the SEO industry use far less lingo and more conversational language. The VP of Marketing is always going to understand what more revenue means and probably cares far less about the specific details behind URL structure or anchor text distribution. Always start with the big picture then whittle your way down to the finer details only as far as your audience is willing to pay attention. The takeaway So how do we combat this echo chamber a bit? Here are some things that have really helped me out over the past year: Take non-SEOs out for coffee On some recurring frequency, schedule a coffee date with friends who you’re certain have little to no grasp on SEO and get their opinion on how they search. Bonus points for diversifying the demographics along a wide gradient of technical and non-technical folks. Ask them how they search for any number of things (navigational, transactional, and informational). You will quickly see how differently each person functions when they’re on the hunt for something. They will likely reveal some great tips to keep in mind for your future SEO projects. Keeping your ear to the ground on how the “common folk” search often offers immense value in preparing a strategy. Get active in non-SEO communities One of my favorites is Hacker News, which has a very strong and relatively negative opinion of SEO. But these are the things that we need to read, because these are actual people’s opinions. I can hear Mike Pantoliano groaning from here, but reading through all the misconceptions a lot of these people have offers insight into what we as an industry need to continually work toward improving. All the best work in the world amounts to nothing if the perception of the industry as a whole is negative. Folks like John Doherty, Rand Fishkin and Ross Hudgens are doing a great job defending the industry on HN, but there is plenty of work left. Besides, it's always great to hear an opinion from the other side of the aisle. Follow lots and lots of non-SEOs on Twitter We’re all guilty of it; take a look through the people you follow on Twitter. I’m betting the majority of those people are somehow related to SEO as well. I can appreciate you want to be up on the latest and greatest news when it comes to search, but try to diversify this list as much as possible. Take your non-search interests and look for the thought leaders in those spaces; the balance is invaluable! What are your thoughts? I would love to hear how you talk about technical issues to non-technical clients. How do you bridge the gap? And lastly, a very Happy Mother's Day to all the hard working moms out there. Without you, we wouldn't all be here! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How My Mom Thinks Search Engines Work"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How My Mom Thinks Search Engines Work"
    },
    {
      "level": "H2",
      "text": "Here are some of my favorite moments from the chat:"
    },
    {
      "level": "H2",
      "text": "OK that was fun, but why?"
    },
    {
      "level": "H2",
      "text": "So, let's simplify"
    },
    {
      "level": "H2",
      "text": "The takeaway"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Turn Marketing Into Meaningful Relationships — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Catering to User Behavior Shifts During Times of Economic Turbulence — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Close More Sales With Emotion-Driven SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rob Toledo\n          \n            Rob Toledo\n          \n            Rob Toledo"
}