{
  "url": "https://moz.com/blog/how-to-handle-temporarily-out-of-stock-product-pages",
  "slug": "how-to-handle-temporarily-out-of-stock-product-pages",
  "title": "How to Handle Temporarily Out-of-Stock Products for SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "E-commerce sites face a unique situation in the current crisis: items that are going in and out of stock rapidly. How do you deal with temporarily out-of-stock items and still maintain search rankings?",
  "content": "How to Handle Temporarily Out-of-Stock Products for SEO E-Commerce SEO By: Dr. Peter J. Meyers March 25, 2020 Table of Contents Copied! By: Dr. Peter J. Meyers March 25, 2020 How to Handle Temporarily Out-of-Stock Products for SEO E-Commerce SEO The next few months are going to be uncharted territory for all of us, with serious challenges for both brick-and-mortar and online businesses. Many e-commerce sites are already facing a unique situation right now, and it looks something like this: These are hand sanitizer results from Staples.com, and this screenshot is just a portion of the first page. I'm not picking on Staples — this page is representative of a problem across every major e-retailer right now. While there are many ways to handle out-of-stock and discontinued items under normal conditions, this situation is very specific: Multiple similar items are out-of-stock at the same timeRetailers may not know when they'll be back in stockThese products may not stay back in stock for longDemand is high and continuing to rank is critical From an SEO standpoint, it's essential that these pages continue to rank, both for consumers and retailers, but in the short-term, the experience is also frustrating for consumers and can drive them to other sites. Is this a technical SEO problem? The short answer is: not really. We want these pages to continue to rank — they're just not very useful in the short-term. Let's take a quick look at the usual toolbox to see what applies. Option #1: 404 (Not Found) This one's easy. Do not 404 these pages. These products are coming back and you want to sell them. What's more, you want to be able to act quickly when they're back in stock. If you remove the page and then put it back (and then, most likely, remove it again and put it back again), it can take Google a lot of time to reconcile those signals, to the point where the page is out of sync with reality. In other words, by the time the page starts ranking again, the product might already be out of stock again. Option #2: 301 (Permanent Redirect) As tools go, 301s still have a special place in our tool belts, but they're not a good bet here. First, the product still exists. We don't really want to move it in any permanent sense. Second, reversing a 301 can be a time-consuming process. So, just like with 404s, we're likely to shoot ourselves in the foot. The only exception would be if a product went out of stock and that prompted the manufacturer to permanently replace it with a similar product. Let's say Acme Essentials ran out of the 10-ounce Mountain Fresh hand sanitizer, so decided just to do away with that product and replace it with the 12-ounce option. In that case, by all means 301-redirect, but that's going to be a fairly rare situation. Option #3: 302 (Temporary Redirect) This has got to be the one, right? Unfortunately, we're still stuck with the timing problem if this product comes back in stock for a short period of time. Let's say you're out of the Acme Essentials 10-ounce Mountain Fresh, but you've got the Trapper Moe's 10-ounce Spring Breeze in stock. Could you temporarily swap in the latter product from a search perspective? Maybe, if you could get the timing right, but now imagine the visitor experience. People would potentially still be able to search (on-site) for the Acme Essentials product, but then would be redirected to the Trapper Moe's product, which could seem deceptive and is likely to harm conversion. Option #4: ItemAvailability Schema You can use the [availability] property in product-offer schemas to set options including: InStock, InStoreOnly, OutOfStock, and SoldOut. Google may choose to display this information as part of your organic result, such as this one (thanks to Claire Carlisle for this great example): Good news — sloths are still in stock. Unfortunately, there are two challenges to this approach. First, while searchers may appreciate your honesty, you may not be keen to display \"Out of stock\" on your search result when everyone else is displaying nothing at all. Second, we've still got the timing issue. You can automate flipping from \"In stock\" to \"Out of stock\" in real time, but Google still has to crawl and update that information, and that takes time. So, it's basically hopeless? If it seems like I've just ruled out all of the options, it's because fundamentally I don't believe this specific case is an SEO problem. Removing or redirecting pages in a volatile situation where products may go out of stock and come back into stock on a daily basis requires timing Google's processes in a way that's extremely risky. So, if we're going to keep these pages indexed and (hopefully) ranking, the key is to make sure that they continue to give value to your search visitors, and this is primarily a user experience problem. Here's an example of what not to do (sorry, unnamed big-box retailer): Shipping is unavailable, but at least I can pick this up in the store, right? Nope, and for some reason they've auto-selected this non-option for me. If I accept the pre-selected unavailable option, I'm taken to a new screen telling me that yes, it is in fact unavailable. There's absolutely no value here for a search visitor. Here's another example that might not seem so different, but is much more useful. Please note, while all of these elements are taken from real e-commerce sites, I've simplified the pages quite a bit: The product is out of stock at my local store and not available for delivery, but it is available at a nearby store. That's not ideal, and under normal circumstances I'd probably go somewhere else, but in the current environment it's at least a viable option. A viable option is a potential sale. Here's an approach that gives search visitors another viable option: It's not the most visually-appealing layout, but that [Notify Me] button expands into a quick, single-field email form that gives visitors an immediate alternative. Even if they don't buy from this store today, they might still enter their email and end up ordering later, especially at a time when supplies are low everywhere and people want alternatives. This same page had another option I really like, an \"Also available in\" pull-down: Unfortunately, these other options were also out of stock, but if this feature could be tuned up to only reflect similar, in-stock products, it could present an immediate purchase option. In this unique scenario, where demand massively outpaces supply, consumers are going to be much more amenable to similar products. Obviously, these features represent a lot more work than a few 301 redirects, but we're looking at a situation that could last for weeks or months. A few enhancements that give visitors viable options could be worth many thousands of dollars and could also help maintain search rankings. What about internal search? Obviously, the experience at the top of this post is less than ideal for internal search users, but should you remove those products from being displayed temporarily? From an SEO perspective, this is a bit tricky. If you block those products from being shown, then you're also blocking the internal link equity temporarily, which could impact your rankings. In addition, you may end up with a blank page that doesn't accurately represent your usual inventory. I think there are two options that are worth considering (both of which will require investment): 1. Let people filter out-of-stock products I know that e-commerce sites are reluctant to hide products and want to maintain the perception of having a lot of available items, but they're useless if none of those items are actually available. If you allow customers to easily filter out out-of-stock products, you address both problems above. First, visitors will get to see the full list initially and know which products you normally carry. Second, you can make the filter unavailable to search bots so that they continue to pass link equity to all products. 2. De-prioritize out-of-stock products I'm not usually a fan of overriding search filters, as it can be confusing to visitors, but another option would be to push out-of-stock products to the bottom of internal search results, maintaining filters and sorts within the stocked and out-of-stock groups. This lets people see the entire list and also gives search bots access, but brings available products to the forefront. Visitors aren't going to wade through pages of out-of-stock inventory to find the one available item. No, really, what's the secret? I wish I could give you the magic HTML tag or line of .htaccess that would solve this problem, but when the situation is changing day-by-day or even hour-by-hour, many of our best practices fall apart. We can't apply ordinary solutions to extraordinary problems.In this unique case, I think the most important thing, from an SEO standpoint, is to maintain the ranking power of the page, and that probably means leaving it alone. Any technical wizardry we can perform ends at the point that search bots take over, and the process of re-crawling and re-caching a page takes time. Our best bet is to provide an experience that gives search visitors options and maintains the page's value. While this will require investment in the short-term, these changes could equate to thousands of dollars in revenue and will continue to produce benefits even when life returns to normal. What challenges are you facing? As a Seattle-based company, Moz is painfully aware of the disruptions so many businesses and individuals are facing right now. How can we help you during this difficult period? Are there unique SEO challenges that you've never faced before? In the spirit of we're-all-in-this-together, we'd like to help and commit content resources toward addressing the immediate problems our customers and readers are facing. Please tell us about your current challenges in the comments. Join Moz SEO Scientist, Dr. Pete Meyers, Wednesdays in April at 1:30 p.m. PT on Twitter and ask your most pressing questions about how to navigate SEO changes and challenges in a COVID-19 world. Tweet your questions all week long to @Moz using the hashtag #AskMoz. Add to Google Calendar Add to iCal Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Handle Temporarily Out-of-Stock Products for SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Handle Temporarily Out-of-Stock Products for SEO"
    },
    {
      "level": "H2",
      "text": "Is this a technical SEO problem?"
    },
    {
      "level": "H3",
      "text": "Option #1: 404 (Not Found)"
    },
    {
      "level": "H3",
      "text": "Option #2: 301 (Permanent Redirect)"
    },
    {
      "level": "H3",
      "text": "Option #3: 302 (Temporary Redirect)"
    },
    {
      "level": "H3",
      "text": "Option #4: ItemAvailability Schema"
    },
    {
      "level": "H2",
      "text": "So, it's basically hopeless?"
    },
    {
      "level": "H2",
      "text": "What about internal search?"
    },
    {
      "level": "H3",
      "text": "1. Let people filter out-of-stock products"
    },
    {
      "level": "H3",
      "text": "2. De-prioritize out-of-stock products"
    },
    {
      "level": "H2",
      "text": "No, really, what's the secret?"
    },
    {
      "level": "H2",
      "text": "What challenges are you facing?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Common Mistakes E-commerce Websites Make Using JavaScript"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}