{
  "url": "https://moz.com/blog/how-to-sniff-out-an-seo-rat-protecting-your-brand-amp-your-wallet",
  "slug": "how-to-sniff-out-an-seo-rat-protecting-your-brand-amp-your-wallet",
  "title": "How To Sniff Out An SEO Rat: Protecting Your Brand and Your Wallet - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "With all the discussion of individuals ratting out websites and or certain SEO companies you probably think this post is about just that. Don't worry, you can breathe a sigh of relief, I wouldn't waste yours nor my time with such a post. However, I...",
  "content": "How To Sniff Out An SEO Rat: Protecting Your Brand and Your Wallet SEO Consulting By: Nick LeRoy June 9, 2011 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Nick LeRoy June 9, 2011 How To Sniff Out An SEO Rat: Protecting Your Brand and Your Wallet SEO Consulting This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. With all the discussion of individuals ratting out websites and or certain SEO companies you probably think this post is about just that. Don't worry, you can breathe a sigh of relief, I wouldn't waste yours nor my time with such a post. However, I absolutely will take this time to help you sniff out SEO rats that are looking to take advantage of small businesses by promising top search engine rankings. A realistic promise is a great point to start off with... SEO Expectations and Promises. Everyone wants to rank for trophy keywords but I'll let you in on a little secret, if you're a small business you probably don't stand a chance. With that said please don't let these SEO rats come into your office swearing up and down that they have the magic tools to get your site ranking for \"book\" (which I cover in a previous YOUmoz post as a top 25 competitive keyword!). A good SEO will be able to take a look at your existing site and link profile to determine the appropriate keywords for your site to target. When targeted properly - long tail traffic will generate not only more traffic but higher quality traffic. In fact, artificially inflated traffic as a whole is another signal of a shady rat SEO we need to cover. Quality Traffic Doesn't Always Come In Large Quantities. Which one of these would you rather have? One hundred visitors to your site netting one phone call, e-mail, sale -- or 25 visits in which 10 convert to a phone call, e-mail or sale? You're all salivating over the second scenario right? Some SEO rats promise certain benchmarks for traffic which they can easily inflate by paying overseas contractors pennies to pay a visit to your site. For this reason it's important that you not only avoid the 'traffic' promises but also require access to your sites analytics if you don't have it available already. Access To Site Analytics Most SEOs will forward some type of 'SEO report' on either a monthly or quarterly basis. While the good SEOs accurately depict your sites data not all do. Some SEO rats will hide \"bad\" information or purposely leave out data that may look them look badly. It's important that you demand access to your sites analytics. It's your responsibility as the site owner to keep an eye out for your website at all times. Access to your analytics will not only allow you to see how much traffic is coming to your site but where it is coming from as well! If you proactively monitor your analytics you should see referral data from websites your SEO is building links from as well. SEO Rats Build Rat Like Links Link building is an essential part of any successful SEO campaign. If any SEO rat tries to tell you that link building isn't required or that it's an ancient SEO technique you need to walk, no run away NOW. Unfortunately, some of the SEO rats go a step forward and build junk links that they disguise as quality links to their customers. While it may not be necessary to harass your SEO for each and every link being built, ask them for a sample of links they have built. Are the links from free for all directories, blog comments, or even forums signatures? You need to look for another SEO this is a good indicator of a SEO rat. A good example of some links that are created by valuable SEOs are below: Thematically and niche related directories (ones that could bring direct traffic and aren't submissions created strictly for a link) Links from accredited groups your small business is a part of. For example, the BBB, chamber of commerce or even local clubs such as contractor unions or town sports teams you sponsor. Natural links pointed towards content generated on your site. These types of techniques mentioned above are just a small example of what types of links truly add value to a website. I would like to touch base on the last bullet, generated content that builds natural links. Content Generation That Adds Value and Nets Links. This is one of the sure ways to sniff an SEO rat out. Ask them what type of content they have generated for their past clients. What you're looking for here is content that genuinely adds value to your users. If you're a local electrician you may consider writing a HOW TO: remove a broken light bulb from an electrical socket. Not only does this add value to your site for your visitors but it's a piece of content that motivates people to link to, tweet, or otherwise share with their friends/colleagues. While frequently updated content is fantastic for acquiring links, don't think for a moment that the other pages on your site can be ignored. On Page Optimization Is Always Required. Typically, it's just on page optimization that SEO rats offer to their clients. They either downplay the importance of link building or take advantage of small businesses that don't realize that's an extremely important part of SEO. In some rare occasions, some SEO rats sell packages that only optimize certain amounts of pages within a site. Don't fall for this trick, all the pages within your site needs to be optimized and by doing just that it will help your overall SEO campaign. When discussing on page optimization make sure the following elements are well optimized: Title Tags – roughly 70 characters with your most important keywords in the beginning. Meta Descriptions – Unique, and offers a small \"sales pitch\" for what a user will find on the page. Headers – Some argue the value of header tags, but if you have the opportunity to use them without too much hassle go ahead. URL Structure – When possible, avoid dynamic URLs and replace them with static SEO friendly URLs that include hyphens in between each word. Content – Don't worry about minimum lengths or keyword density here. Write your content so that your keywords are included and that value is given to your readers. Alt Tags - By using proper file name structure and image alt tags you increase your chances of your images being indexed within the search engines. Internal Link Structure – While they may not be as valuable as external link building, harness the existing value your site already has and internally link throughout your site. Use optimized anchor text to help increase your search rankings. In addition, optimized anchor text typically produces lower bounce rates as the user already expects the content on the following page. Not Every Rat knows They Are A Rat. I'm not at all comfortable with outing individuals but I feel it's extremely important for businesses to do due diligence when hiring an SEO. With that said, one of my final warnings is that not all SEO rats know that they are rats. A lot of times you see people offering SEO services that simply lack experience. They may have rockin' sites of their own but working on someone else's site that's not your own passion takes a different skill set. Hopefully this YOUmoz post will help shine some light on some of the lesser known issues that SEO rats commonly sell to their clients. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How To Sniff Out An SEO Rat: Protecting Your Brand and Your Wallet"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How To Sniff Out An SEO Rat: Protecting Your Brand and Your Wallet"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Sins of an Agency: Parting Ways With Our Biggest Client"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "8 Prep Steps for Better Local Business Client Meetings"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Nick LeRoy\n          \n            Nick LeRoy\n          \n            Nick LeRoy"
}