{
  "url": "https://moz.com/blog/how-to-track-keywords-locations-for-your-business",
  "slug": "how-to-track-keywords-locations-for-your-business",
  "title": "Geomodified Searches, Localized Results, and How to Track the Right Keywords and Locations for Your Business -… - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "No matter what kind of site you work on, local SEO will likely have an impact on how your site shows in the SERPs. Jo explains how any business can take advantage of local SEO know-how to win online.",
  "content": "Geomodified Searches, Localized Results, and How to Track the Right Keywords and Locations for Your Business - Next Level Keyword Research | Local SEO | SEO Basics By: Jo Cameron November 20, 2017 Table of Contents Copied! By: Jo Cameron November 20, 2017 Geomodified Searches, Localized Results, and How to Track the Right Keywords and Locations for Your Business - Next Level Keyword Research | Local SEO | SEO Basics Welcome to the newest installment of our educational Next Level series! In our last episode, our fearless writer Jo Cameron shared how to uncover low-value content that could hurt your rankings and turn it into something valuable. Today, she's returned to share how to do effective keyword research and targeting for local queries. Read on and level up! All around the world, people are searching: X sits at a computer high above the city and searches dreamily for the best beaches in Ko Samui. Y strides down a puddle-drenched street and hastily types good Japanese noodles into an expensive handheld computer. K takes up way too much space and bandwidth on the free wireless network in a chain coffee house, which could be located just about anywhere in the world, and hunts for the best price on a gadgety thing. As we search, the engines are working hard to churn out relevant results based on what we’re searching, our location, personalized results, and just about anything else that can be jammed into an algorithm about our complex human lives. As a business owner or SEO, you’ll want to be able to identify the best opportunities for your online presence. Even if your business doesn’t have a physical location and you don’t have the pleasure of sweeping leaves off your welcome mat, understanding the local landscape can help you hone in on keywords with more opportunity for your business. In this Next Level post, we’ll go through the different types of geo-targeted searches, how to track the right keywords and locations for your business in Moz Pro, and how to distribute your physical local business details with Moz Local. If you'd like to follow along with this tutorial, get started with a free 30-day trial of Moz Pro: Follow along with a free trial Whether your customer is two streets away or gliding peacefully above us on the International Space Station, you must consider how the intertwining worlds of local and national search impact your online presence. Geomodified searches vs. geolocated searchesFirst, so you can confidently stride into your next marketing meeting and effortlessly contribute to a related conversation on Slack, let’s take a quick look at the lingo. Geomodified searches include the city/neighborhood in the search term itself to target the searcher’s area of interest. You may have searched some of these examples yourself in a moment of escapism: “beaches in Ko Samui,” “ramen noodles in Seattle,” “solid state drive London,” or “life drawing classes London.” Geomodified searches state explicit local intent for results related to a particular location. As a marketer or business owner, tracking geomodified keywords gives you insight into how you’re ranking for those searches specifically. Geolocated searches are searches made while the searcher is physically located in a specific area — generally a city. You may hear the term “location targeting” thrown about, often in the high-roller realm of paid marketing. Rather than looking at keywords that contain certain areas, this type of geotargeting focuses on searches made within an area. Examples might include: “Japanese noodles,” “Ramen,” “solid state drive,” or “coffee,” searched from the city of Seattle, or the city of London, or the city of Tokyo. Of course, the above ways of searching and tracking are often intertwined with each other. Our speedy fingers type demands, algorithms buzz, and content providers hit publish and bite their collective nails as analytics charts populate displaying our progress. Smart SEOs will likely have a keyword strategy that accounts for both geomodified and geolocated searches. Researching local keywordsThe more specific your keywords and the location you’re targeting, generally, the less data you’ll find. Check your favorite keyword research tool, like Keyword Explorer, and you’ll see what I’m talking about. In this example, I’m looking at search volume data for “japanese noodles” vs. “japanese noodles london.” \"Japanese noodles\" \"Japanese noodles London\" So, do I toss this geomodified keyword? Hold on, buddy — while the Monthly Volume decreases, take a look at that Difficulty score — it increases. It’s an easy search term to dismiss, since the search volume is so low, but what this tells me is that there's more to the story. A search for “japanese noodles” is too broad to divine much of the searcher’s intent — do they want to make Japanese noodles? Learn what Japanese noodles are? Find an appetizing image?… and so on and so forth. The term itself doesn’t give us much context to work with. So, while the search volume may be lower, a search for “japanese noodles london” means so much more — now we have some idea of the searcher’s intent. If your site’s content matches up with the searcher’s intent, and you can beat your competition in the SERPs, you could find that the lower search volume equates to a higher conversion rate, and you could be setting yourself up for a great return on investment. Digging into hyperlocal niches is a challenge. We’ve got some handy tips for investigating hyperlocal keywords, including using similar but slightly larger regions, digging into auto-suggest to gather keyword ideas, and using the grouping function in Keyword Explorer. Testing will be your friend here. Build a lovely list, create some content, and then test, analyze, and as the shampoo bottle recommends, rinse and repeat. Localized ranking signals and resultsWhen search engines impress us all by displaying a gazillion results per point whatever of a second, they aren’t just looking inwards at their index. They're looking outwards at the searcher, figuring out the ideal pairing of humans and results. Local rankings factors take into consideration things like proximity between the searcher and the business, consistency of citations, and reviews, to name just a few. These are jumbled together with all the other signals we’re used to, like authority and relevancy. The full and glorious report is available here: https://moz.com/local-search-ranking-factors I often find myself returning to the local search ranking factors report because there's just so much to digest. So go ahead bookmark it in a folder called “Local SEO” for easy reference, and delight in how organized you are. While you may expect a search for “life drawing” to turn up mostly organic results, you can see the Local Pack is elbowing its way in there to serve up classes near me: And likewise, you may expect a search for “life drawing london” to show only local results, but lookie here: we’ve also got some top organic results that have targeted “life drawing london” and the local results creep ever closer to the top: From these examples you can see that localized results can have a big impact on your SEO strategy, particularly if you’re competing with Local Pack-heavy results. So let’s go ahead and assemble a good strategy into a format that you can follow for your business. Tracking what’s right for your businessWith your mind brimming with local lingo, let’s take a look at how you can track the right types of keywords and locations for your business using Moz Pro. I’ll also touch on Moz Local for the brick-and-mortar types. 1. Your business is rocking the online worldQuest: Track your target keywords nationally and keep your eye on keywords dominated by SERP features you can’t win, like Local Packs. Hey there, w-w-w dot Your Great Site dot com! You’re the owner of a sweet, shiny website. You’re a member of the digital revolution, a content creator, a message deliverer, a gadgety thingy provider. Your customers are primarily online. I mean, they exist in real life too, but they are also totally and completely immersed in the online world. (Aren’t we all?) Start by setting up a brand-new Moz Pro Campaign for your target location. Select one of each search engine to track for your location. This is what I like to call the full deck: Another personal favorite is what I call the \"Google Special.\" Select Google desktop and Google Mobile for two locations. This is especially handy if you want to track two national locations in a single Campaign. Here I’ve gone with the US and Canada: I like to track Google Mobile along with Google desktop results. Ideally you want to be performing consistently in both. If the results are hugely disparate, you may need to check that your site is mobile friendly. Pour all your lovely keywords into the Campaign creation wizard. Turn that keyword bucket upside-down and give the bottom a satisfying tap like a drum: Where have we found all these lovely keywords? Don’t tell me you don’t know! Head over to Keyword Explorer and enter your website. Yes, friend, that’s right. We can show you the keywords your site is already ranking for: I’m going to leave you to have some fun with that, but when you’re done frolicking in keywords you’re ranking for, keywords your competitors are ranking for, and keywords your Mum’s blog is ranking for, pop back and we’ll continue on our quest. Next: Onward to the SERP features! SERP features are both a blessing and a curse. Yes, you could zip to the top of page 1 if you’re lucky enough to be present in those SERP features, but they’re also a minefield, as they squeeze out the organic results you’ve worked so hard to secure. Luckily for you, we’ve got the map to this dastardly minefield. Keep your eye out for Local Packs and Local Teasers; these are your main threats. If you have an online business and you're seeing too many local-type SERP features, this may be an indication that you’re tracking the wrong keywords. You can also start to identify features that do apply to your business, like Image Packs and Featured Snippets. When you’re done with your local quest, you can come back and try to own some of these features, just like we explored in a previous Next Level blog post: Hunting Down SERP Features to Understand Intent & Drive Traffic 2. Your business rocks customers in the real worldQuest: Track keywords locally and nationally and hone in on local SERP features + the wonderful world of NAP. What if you run a cozy little cupcake shop in your cozy little city? Use the same search engine setup from above, and sprinkle locally tracked keywords into the mix. If you’re setting up a new Campaign, you can add both national and local keywords like a boss. You can see I’ve added a mouthwatering selection of keywords in both the National Keywords section and in the Local Keywords field. This is because I want to see if one of my cupcake shop’s landing pages is ranking in Google Desktop, Google Mobile, and Yahoo and Bing, both nationally and locally, in my immediate vicinity of Seattle. Along with gathering comparative national and local ranking data, the other reason to track keywords nationally is so you can see how you’re doing in terms of on-page optimization. Your path to cupcake domination doesn’t stop there! You’re also going to want to be the big player rocking the Local Pack. Filter by Local Pack or Local Teaser to see if your site is featured. Keep your eye out for any results marked with a red circle, as these are being dominated by your competitors. The wonderful world of NAPAs a local business owner, you'll probably have hours of operation, and maybe even one of those signs that you turn around to indicate whether you’re open or closed. You also have something that blogs and e-commerce sites don’t have: NAP, baby! As a lingo learner, your lingo learning days are never over, especially in the world of digital marketing (actually, just make that digital anything). NAP is the acronym for business name, address, and phone number. In local SEO you’ll see this term float by more often than a crunchy brown leaf on a cold November morning. NAP details are your lifeblood: You want people to know them, you want them to be correct, and you want them to be correct everywhere — for the very simple reason that humans and Google will trust you if your data is consistent. If you manage a single location and decide to go down the manual listing management route, kudos to you, my friend. I’m going to offer some resources to guide you: All About Local Listings and SEO Advanced Local Citation Audit & Clean Up: Achieve Consistent Data & Higher Rankings Unfiltered: How to Show Up in Local Search Results How to Perform a Basic Local Business Competitive Audit 3. You manage multiple local businesses with multiple locationsQuest: Bulk-distribute business NAP, fix consistency issues, and stamp out duplicates. If you are juggling a bunch of locations for your own business, or a client’s, you’ll know that in the world of citation building things can get out of hand pretty gosh-darn quick. Any number of acts can result in your business listing details splitting into multiple fragments, whether you moved locations, inherited a phone number that has an online past, or someone in-house set up your listings incorrectly. While a single business operating out of a single location may have the choice to manually manage their listing distribution, with every location you add to your list your task becomes exponentially more complex. Remember earlier, when we talked about those all-important local search ranking factors? The factors that determine local results, like proximity, citation signals, reviews, and so on? Well, now you’ll be really glad you bookmarked that link. You can do all sorts of things to send appealing local signals to Google. While there isn’t a great deal we can do about proximity right now — people have a tendency to travel where they want to — the foundational act of consistently distributing your NAP details is within your power. That’s where Moz Local steps in. The main purpose of Moz Local is to help you publish and maintain NAP consistency in bulk. First, enter your business name and postcode in the free Check Listing tool. Bounce, bounce... After a few bounces, you’ll get the results: Moz Local will only manage listings that have been “verified” to prevent spam submissions. If you’re not seeing what you’d expect in the Check Listing tool, you’ll want to dig up your Google Maps and Facebook Places pages and check them against these requirements on our Help Hub. When you’re ready to start distributing your business details to our partners, you can select and purchase your listing. You can find out more about purchasing your listing, again on our Help Hub. Pro Tip: If you have lots of local clients, you’ll probably want to purchase via CSV upload. Follow our documentation to get your CSV all spruced up and formatted correctly. If tracking your visibility and reputation is high on your to-do list, then you’ll want to look at purchasing your listings at the Professional or Premium level. We’ll track your local and organic rankings for your Google My Business categories by default, but you can enter your own group of target keywords here. We account for the geographic location of your listings, so be sure to add keywords without any geomodifiers! If you want to track more keywords, we’ve got you covered. Hop on over to Moz Pro and set up a Campaign like we did in the section above. 4. You’re a dog trainer who services your local area without a storefrontQuest: Help owners of aspiring good dogs find your awesome training skills, even though you don’t have a brick-and-mortar storefront. At Moz HQ, we love our pooches: they are the sunshine of our lives (as our Instagram feed delightfully confirms). While they’re all good doggos, well-trained pooches have a special place in our hearts. But back to business. If you train dogs, or run another location-specific business without a shop front, this is called a service-area business (or SAB, another term to add to the new lingo pile). Start by tracking searches for “dog trainer seattle,” and all the other keywords you discovered in your research, both nationally and locally. I’ve got my Campaign pulled up, so I’m going to add some keywords and track them nationally and locally. You may find that some keywords on a national level are just too competitive for your local business. That’s okay! You can refine your list as you go. If you’re happy with your local tracking, then you can remove the nationally tracked keywords from your Campaign and just track your keywords at the local level. Pro Tip: Remember that if you want to improve your Page Optimization with Moz Pro, you’ll have to have the keyword tracked nationally in your Campaign. In terms of Moz Local, since accuracy, completeness, and consistency are key factors, the tool pushes your complete address to our partners in order to improve your search ranking. It's possible to use Moz Local with a service-area business (SAB), but it's worth noting that some partners do not support hidden addresses. Miriam Ellis describes how Moz Local works with service-area businesses (SABs) in her recent blog post. Basically, if your business is okay with your address being visible in multiple places, then we can work with your Facebook page, provided it’s showing your address. You won’t achieve a 100% visibility score, but chances are your direct local competitors are in the same boat. Wrapping upWhether you’re reaching every corner of the globe with your online presence, or putting cupcakes into the hands of Seattleites, the local SEO landscape has an impact on how your site is represented in search results. The key is identifying the right opportunities for your business and delivering the most accurate and consistent information to search engines, directories, and your human visitors, too. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Geomodified Searches, Localized Results, and How to Track the Right Keywords and Locations for Your Business - Next Level"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Geomodified Searches, Localized Results, and How to Track the Right Keywords and Locations for Your Business - Next Level"
    },
    {
      "level": "H2",
      "text": "Geomodified searches vs. geolocated searches"
    },
    {
      "level": "H3",
      "text": "Researching local keywords"
    },
    {
      "level": "H2",
      "text": "Localized ranking signals and results"
    },
    {
      "level": "H2",
      "text": "Tracking what’s right for your business"
    },
    {
      "level": "H3",
      "text": "1. Your business is rocking the online world"
    },
    {
      "level": "H4",
      "text": "Next: Onward to the SERP features!"
    },
    {
      "level": "H3",
      "text": "2. Your business rocks customers in the real world"
    },
    {
      "level": "H4",
      "text": "The wonderful world of NAP"
    },
    {
      "level": "H3",
      "text": "3. You manage multiple local businesses with multiple locations"
    },
    {
      "level": "H3",
      "text": "4. You’re a dog trainer who services your local area without a storefront"
    },
    {
      "level": "H2",
      "text": "Wrapping up"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jo Cameron\n          \n            Jo Cameron\n          \n            Jo Cameron"
}