{
  "url": "https://moz.com/blog/how-to-deal-with-challenging-clients",
  "slug": "how-to-deal-with-challenging-clients",
  "title": "How to Deal with Challenging Clients [11 Strategies] - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If you are a consultant, part of your job is managing your client's attitude and behaviors, even when times get tough. Craig Bradford shares his tips to prevent sunny situations from turning blue, and offers advice for providing a cure if problems arise.",
  "content": "How to Deal with Challenging Clients SEO Consulting C By: Craig Bradford February 25, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! C By: Craig Bradford February 25, 2013 How to Deal with Challenging Clients SEO Consulting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. If you’re a consultant, you may not realise it, but a large (and difficult) part of your job is to manage people’s attitudes and behaviours. This task is made even more difficult because it is usually most apparent when clients are unhappy or disagree with you. Even the best consultants will have to deal with challenging clients at some point in their career. I want to share some of the things I’ve learnt from my experience so far as a consultant. I firmly believe that when it comes to keeping clients happy, prevention is better than a cure. Most of the tips I’ve shared look at how to prevent clients from ever becoming a problem, but I also cover some tips to help resolve the problem as quickly as possible if things do go wrong. 1. Communication solves all problems At Distilled, we have a saying that communication solves all problems. Over the years, I’ve found this to be true. If the problem can’t be solved by communication, it can almost always have been prevented by it. I don’t mean to recommend phoning your client \"once a month\" as standard, because good communication is a frequent a mix of formal and informal subjects. Don’t just call your clients regarding work; call them on a Monday to see how their weekend was and on a Friday to wish them a good weekend. These little bits of extra effort can make a big difference in the lifetime of a client relationship. As a general rule, I like to speak to my clients at least twice per week and meet face-to-face at least once-per month if possible. If you have clients abroad, speaking frequently might not always possible, but even so, you should still make the effort -- especially if they are a long standing client. For example, I’ve just spent the last two weeks in Cape Town visiting one of my clients. Obviously South Africa is a long way to go, but we’ve been working together for quite some time, and the value we both got from finally meeting face-to-face was invaluable. Lots of the consultants at Distilled have success stories that are sometimes directly related to a turning point in a client relationship as a result of taking them for a beer and getting out of the office to an environment where you can both relax and talk off the record. In general, the more communication, the better. It may feel strange at first, but you can always find an excuse to call a client. 2. Have a genuine care for the success of the business Communication is closely related to my next point, because care generally comes as a result of regular communication and getting close to a client. If you speak to someone two or three times a week, you get to really know them -- not just from a client point of view but what they like, what motivates or demotivates them, and even what they’re up to at the weekend. Hopefully the result of that is that you really want them to do well, and that the success of the business means more that just a job to you. You’ll enjoy your job a lot more if you genuinely care about the success of the business as much as the client does. Anyone that’s been in SEO for a while will know that it’s often not a 9-5 job; quite often, it’s evenings and weekends. Unless you really care, you’ll start to resent working with that client. Reaching this point in a client relationship is invaluable. Let me explain a bit further. There are always going to be ups and downs with clients, and in general clients, will react in two ways to bad news. They either get angry, shout and scream (usually via email), or say it’s entirely your fault. The second reaction is to pick up the phone and talk about how it can be resolved. If your client knows that you genuinely care about the business, you’re more likely to get the second reaction. It means they are more likely to skip the shouting and pointing fingers part and start trying to find solutions to the problem. They know they don’t need to tell you how bad it is because you’ll also feel the same. Getting to this stage of honesty with a client is rare, but it’s a great place to be. This is what turns retainers into lifetime clients and testimonials. 3. If I do this, will you be happy? You may recognise the following scenario: you get to the end of the month, you’re happy with the work you’ve delivered, you send the monthly report, and the client is disappointed. While this is a bit annoying, it’s easy to stop it from happening again. At the start of every month, create a plan of what you expect to get finished that month, show it to the client, and ask them, “If I deliver all of the things on this list by the end of the month, will you be happy?” If the answer is no, you have a bigger problem. If the answer is yes, then as long as you deliver what you said you would by the time you said, then it's less likely they'll be disappointed. As a side note, the things you say you will deliver should never be results. Only promise things like documents and meetings, and never promise results or outcomes as they are outside of our control and you’re likely setting yourself up for disaster. 4. Document everything One of the most basic things you should do as a consultant is keep a record of all conversations. After every meeting or phone call, follow up with an email to the client and summarise the main points of the meeting. This is a pretty thankless task 99% of the time, but it can be your most important piece of evidence should the clients record of events ever be different to yours. 5. Never go above your contact Another common problem you may run into as a consultant is struggling to get things done on the client side. This could be rolling out changes to the site, getting more budget, or just getting some budget in the first place. Whatever it is you are struggling to get done, never try to go above your point of contact to their superior. Not only does this come across as bad manners, it makes your main point of contact look bad to their management. Don’t forget, one of your roles as a consultant is to make your point of contact look good, not the opposite. 6. Provide useful and tailored monthly reports Let’s be honest -- writing monthly reports isn’t fun, and it’s made even worse by the fact that after you spend time writing them, they often don’t get read. However, they’re very important as part of the prevention phase. It’s even more important the closer you are to your client. Even if you speak to your client regularly, you still need to send a summary of what you’ve done every month, as well as the results. Put simply, if you don’t send reports, your clients will forget what value you added that month. For example, I’ve been in the scenario in the past where a client sent me an angry email and questioned the results from that month; I pulled up analytics to show that things were actually going very well. His response was, “Wow, that’s amazing, I had no idea we were doing so well. Unless you constantly remind me that we’re doing well, I’ll continue to moan at you.” That’s pretty much a direct quote (you know who you are). He was right; I fell into the trap of thinking that because I spoke to them most days, I didn’t need to send a report. Don’t make the same mistake I did. Use reports to show what you did, what the results were, and get sign off on the next month's activity. Writing reports also helps to keep you accountable for your own work. By writing at the start of the month what you plan to do and showing it to the client, you’re more likely to get that work completed if you know that you’re going to review it at the end of the month with the client. 7. First mover advantage Imagine the situation: you go into the office on Monday, only to find your client has dropped for all keywords. What do you do? Tell everyone that if anyone calls, you’re not in? Flee the country? No -- you need to step up and call the client before they call you. If you don’t call and try to fix it before the client notices, you’ll end up with an angry client for two reasons: first, because of the drop, and second, they pay you to notice when things go wrong and they noticed (in their eyes) before you did. Always use the first mover advantage and call the client to let them know. It’s not going to be easy, and they might shout and scream, but they’ll appreciate that you noticed it straight away. Tell them the situation and that you already have the team working to find out the cause and find a solution. The second part of the post focuses on finding a cure when things do go wrong, despite your best attempts to prevent that happening. For the purpose of this post, let’s assume you’ve received an email from an unhappy client, and they’re threatening to leave; let’s also pretend it’s an unjustified complaint, meaning you genuinely think you have provided value and there’s just a misunderstanding. Here are a few tips that have worked for me in the past in resolving the problem: 1. You can’t win an argument I’ve taken this from How To Win Friends And Influence People, but I’ve found it to be true through life in general, so it stuck with me when I read the book. It's always my first tip in resolving a conflict with a client. Don’t argue, because you’ll never win and even if you do prove the client wrong, you’ll lose the contract as a result. As Dale Carnegie puts it in the book: “Why prove to a man he is wrong? Is that going to make him like you? Why not let him save face? He didn’t ask you for your opinion. He didn’t want it. Why argue with him? Always avoid the acute angle.” Does that mean you need to let clients say whatever they like and walk all over you? Of course not, but you do need to help them see your point of view, not force them to see it otherwise you’ll just get resistance. I typically start with accepting it’s my fault in some way or another. This doesn’t need to mean it’s actually your fault; I usually word it as my fault for not explaining something clearly, or presenting information in an ambiguous way that was easy to misunderstand. Doing so helps to put the client at ease. Clients like to feel that they call the shots, and it makes them more willing to listen to your next point, which hopefully is the answer. 2. Delivery method In the majority of cases, clients will deliver bad news and complains via email. Regardless of how nasty or challenging a client may seem, people generally don’t like conflict via the phone, and even less in person. Use this to your advantage. It’s too easy to fire off a counter aggressive email rather than pick up the phone; resist the urge to reply by email and try to arrange a meeting instead. I like to respond with something immediately to acknowledge that I’ve received their email but make it clear that there’s been a misunderstanding and that email probably isn’t the best medium to explain. In order of preference, try to respond by: A face-to-face meeting Skype, G+ hangout, or something that you can see the person’s face on A phone call An email If you are able to arrange a meeting or a phone call, you’ll dramatically increase your chances of coming out with a success story than trying to resolve via email. If you do manage to get a meeting or a phone call, ensure you have your ducks in a row and responses to all the questions the client is likely to have. To help with this, something I’ve found useful is to actually write out an email like you would have responded, but don’t actually send the email. I’ve found this useful in working out exactly what I want to say and to be sure I have all the answers to their questions in a way that makes sense. 3. Disarming honesty If you’ve messed up, admit it. Nothing says \"I’m an idiot\" and gets clients angry like coming back with excuses and trying to pretend that it’s not that bad. If you made a mistake, or even if the results just aren’t as good as you were expecting, admit it, your client will appreciate that you’re in this thing together it adds to the genuine care in the business as well if you’re first to go to the client and say you’re disappointed with the results. Otherwise, you’ll have a client that thinks he’s going mad because you see value that they don’t. 4. Know when to say goodbye Finally, if none of the above is helpful, know when it’s time to say goodbye. Not all client engagements will work out the way you want them to, but it’s important to breakup on good terms. Even if you’re not the right solution for them at the moment, you could be at some point in the future, so take care not to burn your bridges. You never know where your client could end up working in the future. I hope you’ve found my tips useful. All relationships are diverse, but I’d be interested to hear about any tips you have for dealing with challenging clients. Thanks to Caitlin Krumdieck for letting me pick her brain about previous Distilled clients and adding to the ideas above. Leave your thoughts in the comments below. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Deal with Challenging Clients"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Deal with Challenging Clients"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H2",
      "text": "1. Communication solves all problems"
    },
    {
      "level": "H2",
      "text": "2. Have a genuine care for the success of the business"
    },
    {
      "level": "H2",
      "text": "3. If I do this, will you be happy?"
    },
    {
      "level": "H2",
      "text": "4. Document everything"
    },
    {
      "level": "H2",
      "text": "5. Never go above your contact"
    },
    {
      "level": "H2",
      "text": "6. Provide useful and tailored monthly reports"
    },
    {
      "level": "H2",
      "text": "7. First mover advantage"
    },
    {
      "level": "H2",
      "text": "1. You can’t win an argument"
    },
    {
      "level": "H2",
      "text": "2. Delivery method"
    },
    {
      "level": "H2",
      "text": "3. Disarming honesty"
    },
    {
      "level": "H2",
      "text": "4. Know when to say goodbye"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Sins of an Agency: Parting Ways With Our Biggest Client"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "8 Prep Steps for Better Local Business Client Meetings"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Craig Bradford\n          \n            Craig Bradford\n          \n            Craig Bradford"
}