{
  "url": "https://moz.com/blog/how-to-write-for-the-web-a-new-approach-for-increased-engagement-whiteboard-friday",
  "slug": "how-to-write-for-the-web-a-new-approach-for-increased-engagement-whiteboard-friday",
  "title": "How to Write for the Web—a New Approach for Increased Engagement - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "16%. That's the percentage of people who read everything you write word-for-word. That number hasn't changed in two decades, which tells us that we've never really learned how to write for the web. In this week's Whiteboard Friday, Dan Petrovic illustrates a new approach to writing for the web to…",
  "content": "How to Write for the Web—a New Approach for Increased Engagement Whiteboard Friday | Content Marketing By: Dan Petrovic October 30, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Dan Petrovic October 30, 2015 How to Write for the Web—a New Approach for Increased Engagement Whiteboard Friday | Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. We tend to put a lot of effort into writing great content these days. But what's the point of all that hard work if hardly anybody actually reads it through to the end? In this week's Whiteboard Friday, Dan Petrovic illustrates a new approach to writing for the web to increase reader engagement, and offers some tools and tips to help along the way. Click on the whiteboard image above to open a high resolution version in a new tab! Video Transcription G'day, Moz fans, Dan Petrovic from DEJAN here. Today we're talking about how to write for the web. How much of an article will people actually read? This year we did an interesting study involving 500 people. We asked them how do they read online. We found that the amount of people who actually read everything word-for-word is 16%. Amazingly, this is exactly the same statistic, the same percentage that Nielsen came up with in 1997. It's been nearly two decades, and we still haven't learned how to write for the Web. I don't know about you guys, but I find this to be a huge opportunity, something we can do with our blogs and with our content to change and improve how we write in order to provide better user experience and better performance for our content. Essentially, what happens is four out of five people that visit your page will not actually read everything you wrote. The question you have to ask yourself is: Why am I even writing if people are not reading? I went a little bit further with my study, and I asked those same people: Why is it that you don't read? How is it that there are such low numbers for the people who actually read? The answer was, \"Well, I just skip stuff.\" \"I don't have time for reading.\" \"I mainly scan,\" or, \"I read everything.\" That was 80 out of 500 people. The rest said, \"I just read the headline and move on,\" which was amazing to hear. Further study showed that people are after quick answers. They don't want to be on a page too long. They sometimes lose interest halfway through reading the piece of content. They find the bad design to be a deterrent. They find the subject matter to be too complex or poorly written. Sometimes they feel that the writing lacks credibility and trust. I thought, okay, there's a bunch of people who don't like to read a lot, and there's a bunch of people who do like to read a lot. How do I write for the web to satisfy both ends? Here was my dilemma. If I write less, the effort for reading my content is very low. It satisfies a lot of people, but it doesn't provide the depth of content that some people expect and it doesn't allow me to go into storytelling. Storytelling is very powerful, often. If I write more, the effort will be very high. Some people will be very satisfied, but a lot of people will just bounce off. It'll provide the depth of content and enable storytelling. Actually, I ended up finding out something I didn't know about, which was how journalists write. This is a very old practice called \"inverted pyramid.\" The rules are, you start off with a primary piece of information. You give answers straight up. Right after that you go into the secondary, supporting information that elaborates on any claims made in the first two paragraphs. Right after that we go into the deep content. I thought about this, and I realized why this was written in such a way: because people used to read printed stuff, newspapers. They would go read the most important thing, and if they drop off at this point, it's not so bad because they know actually what happened in the first paragraph. The deep content is for those who have time. But guess what? We write for the web now. So what happens is we have all this technology to change things and to embed things. We don't really have to wait for our users to go all the way to the bottom to read deep information. I thought, \"How can I take this deep information and make it available right here and right there to give those interested extra elaboration on a concept while they're reading something?\" This is when I decided I'll dive deeper into the whole thing. Here's my list. This is what I promised myself to do. I will minimize interruption for my readers. I will give them quick answers straight in the first paragraph. I will support easy scanning of my content. I will support trust by providing citations and references. I will provide in-depth content to those who want to see it. I will enable interactivity, personalization, and contextual relevance to the piece of content people want to retrieve in that particular time. I took one of my big articles and I did a scroll test on it. This was the cutoff point where people read everything. At this point it drops to 95, 80, 85. You keep losing audience as your article grows in size. Eventually you end up at about 20% of people who visit your page towards the bottom of your article. My first step was to jump on the Hemingway app—a very good online app where you can put in your content and it tells you basically all the unnecessary things you've actually put in your words—to actually take them out because they don't really need to be there. I did that. I sized down my article, but it still wasn't going to do the trick. Enter the hypotext! This is where I came up with an idea of hypotext. What I did, I created a little plugin for WordPress that enables people to go through my article, click on a particular piece, kind of like a link. Instead of going to a new website, which does interrupt their reading experience, a block of text opens within the paragraph of text they're reading and gives them that information. They can click if they like, or if they don't want to look up this information, they don't have to. It's kind of like links, but injected right in the context of what they're currently reading. This was a nerve-wracking exercise for me. I did 500 revisions of this article until I got it right. What used to be a 5,000-word article turned into a 400-word article, which can then be expanded to its original 5,000-word form. People said, \"That's great. You have a nice hypothesis, nice theory, but does this really work?\" So I decided to put everything I did to a test. An old article, which takes about 29 minutes to read, was attracting people to the page, but they were spending 6 minutes on average—which is great, but not enough. I wanted people to spend way more time. If I put the effort into writing, I wanted them to digest that content properly. The bounce rate was quite high, meaning they were quite tired with my content, and they just wanted to move on and not explore anything else on my website. Test Results After implementing the compressed version of my original article, giving them a choice of what they will read and when, I expanded the average time on page to 12 minutes, which is extraordinary. My bounce rate was reduced to 60%, which meant that people kept browsing for more of my content. We did a test with a content page, and the results were like this: Basically, the engagement metrics on the new page were significantly higher than on the old when implemented in this way. On a commercial landing page, we had a situation like this: We only had a small increase in engagement. It was about 6%. Still very happy with the results. But what really, really surprised me was on my commercial landing page—where I want people to actually convert and submit an inquiry—the difference was huge. It was about a 120% increase in the inquiries in comparison to the control group when I implemented this type of information. I removed the clutter and I enabled people to focus on making the inquiry. I want you all to think about how you write for the web, what is a good web reading experience, and how content on the web should be, because I think it's time to align how we write and how we read on the web. Thank you. Video transcription by Speechpad.com A few notes: There are a few things to note here. First, for an example of an implementation of hypotext, take a look at this post on user behavior data. Next, keep in mind that Google does devalue the hidden content, disagreeing with its usability. You can read more about this on the DEJAN blog—there are further tips on the dangers of hidden content and how you can combat them there. One solution is to reverse how hypotext works in an article. Rather than defaulting to the shorter piece, you can start by showing the full text and offer a \"5-minute-read\" link (example here) for those inclined to skim or not interested in the deep content. Share your thoughts in the comments below, and thanks for listening! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Write for the Web—a New Approach for Increased Engagement"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Write for the Web—a New Approach for Increased Engagement"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "How much of an article will people actually read?"
    },
    {
      "level": "H2",
      "text": "Enter the hypotext!"
    },
    {
      "level": "H2",
      "text": "Test Results"
    },
    {
      "level": "H2",
      "text": "A few notes:"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dan Petrovic\n          \n            Dan Petrovic\n          \n            Dan Petrovic"
}