{
  "url": "https://moz.com/blog/how-to-build-links-to-your-blog-a-case-study",
  "slug": "how-to-build-links-to-your-blog-a-case-study",
  "title": "How to Build Links to Your Blog - A Case Study - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "After a month or so of development, my site was finally ready and I wanted to start thinking about how to get some traffic going on the website. Whilst paid advertising and social media were a huge part of the strategy, I knew that appearing in the search engines for a wide selection of long-tail…",
  "content": "How to Build Links to Your Blog - A Case Study Link Building By: Matthew Barby June 4, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Matthew Barby June 4, 2013 How to Build Links to Your Blog - A Case Study Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I recently took some time out to do a bit of travelling across East Asia (which was incredible!) and decided that I would, along with a group of friends, set up a travel blog. Knowing that I would be embarking on some amazing adventures, I thought it'd be a waste not to blog about them. Plus, the idea of bringing in a little extra cash to go into my travel fund helped in my decision. After a month or so of development the site was finally ready and I wanted to start thinking about how to get some traffic going on the website. Whilst paid advertising and social media were a huge part of the strategy, I knew that appearing in the search engines for a wide selection of long-tail phrases was going to be instrumental to the blog's success. This is when I began developing my link building strategy and, after trialing out some very successful approaches, I've decided to now share my link building tactics with you all - you can thank me later :) Identifying My Link Targets As a brand new blog it can be really tough to gain links from high authority sites. Unless you have something particularly unique or special (and even then you might struggle), it's an uphill battle to get your content in front of anyone. With this in mind I decided to start off small. However, the general rule of thumb that I kept for any links that I was looking to build was this: \"The link must have a genuine potential to generate traffic back to the blog\" Resource/Links Pages Many blogs and other websites have 'useful links' or ' useful resources' pages. These pages generally list partner websites, relevant blogs or other sites that they work with. Although these types of links aren't going to result in ground-breaking link building wins they could, if you prospect correctly, provide a link that will not just give you an SEO boost, but actually generate traffic to your site as well. These types of links are particularly relevant for the travel industry. A lot of people write-off these types of links, classing them as 'spammy' or 'low quality links'. Now, whilst I agree that they aren't enormously powerful, I disagree that they are useless. To find the pages where I wanted to get a link placed back to my blog, I followed these quick steps: First, I ran this query through Google - intitle:travel blog inurl:\"links\" OR \"resources\". I then went into Google's search settings and selected to view 100 results per page instead of 10. Once I had 100 listings, I scraped all of the URLs using the 'Scrape Similar' plugin for Chrome and exported them to a .CSV file. I did a bit of manual work to remove irrelevant links and then grabbed the domain/page authority for each of the links using MozCheck.com and pasted this into the sheet. I could then sort the links by page authority and remove any that had a PA lower than ~25. This helped to find higher quality targets. After witling the list down to around 40 targets, I scanned the amount of outbound links on the pages using Niels Bosma's SEOtools plugin for Excel and sorted the list by pages with the lowest number of outbound links on them. This not only improved the power of the link by it also meant that there was more of a chance that I would get some traffic from the page. Finally, I got in touch with webmasters from the sites to see if they would list my site on theirs (using only branded anchor text) in exchange for their site appearing on the 'Our Friends' section of my blog. The end result was that I managed to gain around 15 links to my blog that actually brought through some traffic as well. This took me around 3-4 hours in total (including outreach) and helped to create a nice bit of domain diversity to the site's link profile. On top of this, it also helped me to start building a few relationships with webmasters that turned out to be very useful later down the line. Useful: within this article I explain how to sort through link targets in Excel in a bit more detail. **BONUS: here is the outreach email template that I used when contacting webmasters... Hi NAME HERE, Just thought I would drop you a quick mail regarding your website, DOMAIN URL HERE. I really enjoy the stuff you write and it has been getting me excited for my travelling trip! I am starting up a travel blog myself and it has just gone live a couple of days ago. The blog will follow our group as we travel across East Asia and Australia (we leave today!). I was just wondering if you would be kind enough to drop a link to the blog (http://www.meltedstories.com) on your links page (URL OF THEIR LINKS PAGE HERE) as it would be a big help. I've added you onto my 'Our Friends' page anyway because it will be a great resource for my readers. Don't worry if you don't want to add our blog, but if you let me know your Twitter handle anyway then I will make sure we follow you and drop you some retweets! You can follow us at @melted_stories. Feel free to get in touch at any time though! Matthew Barby Just an Honest Backpacker :) www.meltedstories.com @melted_stories facebook.com/MeltedStories Prospecting Through Competitive Research The next stage of my link building strategy was to do some competitive research. For many SEOs this is a staple part of any link building campaign and can reveal some very interesting insights into what other websites related to your own are doing to acquire links. My first port of call is always the amazing, and strangely under-rated, 'Competitive Link Finder' tool from SEOmoz. By simply plugging in the URLs of five other travel blogs, similar in style to mine, I was able to instantly get 20 solid link targets from a list of around 45. This took me 15 minutes to do and I just placed all of the links into an outreach spreadsheet that I created. Here are the types of links that I found: High authority travel blogs that my competitors have guest posted on. Blogs that run weekly 'photo of the week' competitions that will link to your photo if you win. Good quality travel-niche directories. 'Top travel blogger' lists and competitions. Content that my competitors have collaborated on in order to get a mention. Links to interview articles where my competitors have answered questions on a high authority blog and have received a link in return. All this within 15 minutes - not bad, eh? Every bit of information that I gathered I kept inside a link prospecting spreadsheet. This formed the basis of my link building strategy and allowed me to identify a list of targets that I could approach with a variety of content and propositions. My advice for any blog owner would be to do the same because it allows you to sustain your link building efforts in the long term. Then, every few months, I do some further research and add to the spreadsheet. Acquiring Links from Your Targets Now that I'd done some competitive link research, it was time to plan out the approaches that I would take to actually acquire links from my targets. This can often be the place where many people hit a brick wall. During the early stages of my time at Wow Internet, I found that I was overcomplicating the process of acquiring links. However, the reality is that it's often best to keep things simple. You don't necessarily have to spend a fortune on creating an amazing infographic, or bit of video content. More often than not, all you need to do is simply ask (I know, crazy, right?). Guest Blogging Guest blogging has taken some stick recently and I can, in some cases, see why. A recent post on the SEOmoz blog by James Finlayson outlined the slippery slope of poor guest post content and I completely agree. This brings me back to my initial link building rule: \"The link must have a genuine potential to generate traffic back to the blog\" Forget judging your guest blog opportunities based solely on the PA/DA of the site and start thinking more about site engagement. If I see a website with a domain authority score of 40 but there are no comments from readers and minimal social shares, then I would generally ignore this site, in favour of a site with lower DA but more comments/social shares. This is particularly important when building links to a blog, so as the old saying goes - don't judge a book by its cover! Finding Guest Blogging Opportunities and Gaining Them I had already found a handful of guest blogging opportunities from my competitive research, but I knew I would need a much greater sample size to work with in order to build a solid profile of high quality links. This, unfortunately, takes quite a bit of time. This is where I took a leaf out of Paddy Moogan's book. I recently read Paddy's link building book (which was awesome) and he talked about outsourcing menial research tasks through oDesk in order to save time and increase productivity overall. One thing that Paddy stressed was to only outsource micro-tasks and leave as little obscurity to the task as possible. With this in mind I put together an extensive brief for the task of finding travel blogs that accepted guest posts and fit the following criteria: PR of at least 2. The blog must be English speaking and related to travel. Must have some form of interaction on the blog posts. Should have social shares on the recent articles. Must have posted new content within the last 2 months. As you can see in the link research brief, I didn't just want to simply gather the URLs of the blogs but I tried to get as much information on them as possible. This was so that I could use this valuable data for other link building methods and also to connect with the blog owners through social media and build long-term relationships with them. The data that I asked the oDesk applicant to gather for me was: The website URL. The name of the website. A contact name. A contact email (if possible). The URL of the contact page. Twitter handle of the contact. The Facebook page URL of the website (if relevant). The title of the most recent article posted (this is so I can easily see if the website is relevant without having to visit each one and check). One week and $30 later, I had a list of 50 different guest blog targets - amazing! Don't underestimate the power of giving a good brief to a freelancer; it really can make the world of difference. Useful: the name of the freelancer I used for the link research project (who is now also doing some further research for me now, as well) is Michael Howells. Here's a link to his oDesk profile. **DOUBLE BONUS!: as I'm feeling particularly generous, I'm going to give you the list of 50 awesome travel-related guest blog opportunities that Michael gathered for me. You're welcome :) Once I had the list of guest blog targets, it was then time to identify which would be the best places to start reaching out to. This is an important and often over-looked stage of many outreach campaigns. Bearing in mind that I had only a little bit of content on my blog, I needed to try and find an angle to work on with my pitch. To do this I split up my guest blog targets into sub-sections based on their primary theme (i.e. if five of the websites all specialised in backpacking on a budget then they would go in the same group). Once I'd categorised all of the websites in my list, I had to now decide what I would use in my pitch to the webmasters that would gain their trust and allow me to post on their site. In my armoury were a wealth of photos that I had taken during my time travelling and a whole host of first-hand experiences. From looking at many of the websites that I was targeting for links, it was clear that they were heavily focused around lots of good images and most of them preferred to have the author’s voice clearly present throughout most of their articles. Knowing this, I carried out the following steps: Highlighted blogs that talked about East Asia specifically in a few of their articles. Narrowed down the list to find which of them accepted guest authors more frequently. Picked ten initial targets and began to follow all of their social media accounts, comment on their articles and share their content through my blog's Twitter/FB/G+/Pinterest. Got in touch with the webmasters in a friendly, quick email that let them know who I was, my travel plans and a brief intro to my blog. I then mentioned that I was looking to write for some travel blogs about my adventures and wanted to see if they would consider letting me do this on their blog. If I received a reply, I made sure that I looked at the types of articles they posted on their blogs and then gave only relevant suggestions for possible article titles. After I had a few articles published on different travel blogs it meant that I could reference these articles in my next flurry of outreach. This proved to be really effective as I progressed and gaining guest post opportunities seemed to get easier and easier. One tip that I would give to anyone doing any outreach is not to mention 'links' at all in your written communication as you risk losing your legitimacy as a genuine blogger. Travel blog owners particularly don't enjoy this. **Bonus: Here's one of the outreach emails that I sent to a travel blog owner (as you can see, I keep it as personal as possible): Hi Shannon, I hope you're well. We spoke around a month ago simply about a link exchange for my travel blog, Melted Stories. I have something slightly different to ask about now! Firstly I just want to say how much me and my girlfriend enjoy your blog (especially considering my girlfriend, Laura, is also a vegetarian). I know that you don't really do this on your blog but my girlfriend and I have just finished 2 months of travelling around and experiencing Thailand and I wondered if you would consider letting us do a guest post on your blog? It would be related to an experience that we had within Thailand and one that we feel would fit in with your audience. For example, we recently visited Chiang Mai and took a trip across to all the best places to see, including spending a day looking after ex-working elephants and visiting the tigers (that are most definitely not drugged!). I won't babble on too much because I know you must be busy but you can take a look at some of both myself and Laura's writing at these links (below) and if you could let me know either way that would be great. http://www.meltedstories.com/monkeys-muay-thai-and-magical-marine-life-in-ko-phi-phi/ http://www.meltedstories.com/sun-sea-and-snorkelling-in-koh-tao-3/ Also, we would love to have you write on our blog so if that's something that would interest you then you can have a free reign on what you talk about! Matt www.meltedstories.com @melted_stories Take Guest Blogging to the Next Level - Become a Columnist I have to admit that this wasn't something that I necessarily planned from the outset but, as I moved forward with the guest blogging activities that I was doing, it became an obvious next step. One of the first articles that I wrote was for the WildJunket Magazine, an online general travel publication. During my conversations with the magazine editor, Nellie Huang, I started to form a good relationship and she then asked me if I would consider becoming a regular columnist on the blog, specialising in 'travel tech'. I jumped at the chance, of course, and as a result of this I write 2-3 articles a month for the website and get some great links back to my blog. Not only this but WildJunket have a huge social following and loads of activity on their website. This was certainly something that I could use to my advantage. After I had written a few articles for Nellie I got in touch with her to discuss any ways in which she could help me out, for example, with sharing my content, getting in touch with other bloggers and any other ways she could suggest. The response was really positive and Nellie allowed me to use the WildJunket press pack when contacting websites and she also said that if I wanted to write a sponsored post for companies on the blog then that is fine too (as long as it fit in with the editorial guidelines). On top of this she agreed to share anything I wished on the WildJunket social media accounts, which was great. I then added the following paragraph into my outreach emails: As well as running Melted Stories, I am also a regular columnist for Wild Junket, which receives over 1.65 million pageviews a month and has a Twitter following of just under 30,000. Any article that I did write for you would be shared across all of my personal social media accounts, plus that of Wild Junket and Melted Stories, so it could be a win-win situation :) This dramatically increased the number of replies that I received from webmasters. My advice would be to try and secure a similar type of setup on related blogs within your own industry. Look for blogs that have clear topic areas and, once you've built a relationship with the webmasters, suggest that you could become a regular columnist specialising in a specific topic on their blog. Tip: Industry-relevant online magazines can be a particularly good target for this. Sponsored Posts and Paid Tweets This is likely to cause some controversy amongst a few readers, but in my opinion this can be a fantastic way of driving traffic through to your website and encouraging links back to your content. Sponsored Posts A sponsored post is, in essence, a guest post that you pay for. Many websites, especially within the travel industry, will allow you to write an article promoting your products/services in return for payment. Matt Cutts has voiced his opinion on this activity a few times and has said the following: \"Clear disclosure of sponsorship is critical, and that includes disclosure for search engines. If link in a paid post would affect search engines, that link should not pass PageRank (e.g. by using the nofollow attribute).\" My suggestion is not simply to find blogs that offer this and then place a link to your site within them. What I would suggest is using sponsored posts to increase your online community. To do this I found websites that had a particularly large social following, loads of interactivity on the website and a captive niche audience. I then wrote a post related to my travels and a little intro to my travel blog. What I found was that I was able to bring over some good levels of traffic from the post and capture some new readers for my blog - exactly what I wanted! NOTE: If I ever pay for a sponsored post then I make sure that any links back to my site are 'nofollowed' because it's not worth the risk of having a Google penalty imposed. Paid Tweets These are similar, in a way, to sponsored posts and are pretty self-explanatory - you pay someone to tweet something from their twitter account. Again, there are going to be a few people who say how wrong this is and that they would never do this for one of their clients, etc, etc. What I would say to those people is that if you would be prepared to pay for advertising space on someone's website then what's the difference in paying them to tweet your content on Twitter? I must admit that I've only done this a couple of times and have had varying results, but in one case I managed to generate a few hundred visits to one of the articles on my blog, which is often more than I would get with a banner ad and for a fraction of the cost! There is also the advantage of being able to expand your own Twitter following in the process, which is another added bonus. Useful: You can use BuySellAds.com to search for Twitter users that sell tweets within your niche. Bringing it all Together It's still early days for my travel blog but I've had some awesome initial results and hopefully this article has given you a few ideas of your own to help you go out and build some quality links to your blog. The key message that I'm trying to convey here is the importance of building relationships online and forming a solid community within your blog. Simple things like blog commenting, which was traditionally a staple part of link building, has now become a fantastic way to build relationships with bloggers and actually drive traffic back to your own blog. A lot of link building can be quite indirect and it isn't always the quickest to do, but if you follow my one simple rule then you should be able to keep on the right track: \"The link must have a genuine potential to generate traffic back to the blog\" I'd love to hear your own link building triumphs, so be sure to let me know in the comments of the blog or get in touch with me on Twitter or Google+. Before you do that, here's an awesome photo of my partner and me with a tiger in Thailand... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Build Links to Your Blog - A Case Study"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Build Links to Your Blog - A Case Study"
    },
    {
      "level": "H2",
      "text": "Identifying My Link Targets"
    },
    {
      "level": "H3",
      "text": "Resource/Links Pages"
    },
    {
      "level": "H3",
      "text": "Prospecting Through Competitive Research"
    },
    {
      "level": "H2",
      "text": "Acquiring Links from Your Targets"
    },
    {
      "level": "H3",
      "text": "Guest Blogging"
    },
    {
      "level": "H3",
      "text": "Finding Guest Blogging Opportunities and Gaining Them"
    },
    {
      "level": "H3",
      "text": "Take Guest Blogging to the Next Level - Become a Columnist"
    },
    {
      "level": "H2",
      "text": "Sponsored Posts and Paid Tweets"
    },
    {
      "level": "H3",
      "text": "Sponsored Posts"
    },
    {
      "level": "H3",
      "text": "Paid Tweets"
    },
    {
      "level": "H2",
      "text": "Bringing it all Together"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Matthew Barby\n          \n            Matthew Barby\n          \n            Matthew Barby"
}