{
  "url": "https://moz.com/blog/how-are-seos-like-jellyfish",
  "slug": "how-are-seos-like-jellyfish",
  "title": "How Are SEOs Like Jellyfish? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I need a humor break. I responded to buybigtires post about passion in writing by suggesting that connecting disparate concepts helps squeeze some creative juice. In response to my proposal of the title \"How Are SEOs Like Jellyfish?\" he responded like this:Because we have no spine....are constantly…",
  "content": "How Are SEOs Like Jellyfish? Public Relations C By: Carlos del Rio September 13, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! C By: Carlos del Rio September 13, 2007 How Are SEOs Like Jellyfish? Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I need a humor break. I responded to buybigtires' post about passion in writing by suggesting that connecting disparate concepts helps squeeze some creative juice. In response to my proposal of the title \"How Are SEOs Like Jellyfish?\" he responded like this: Because we have no spine....are constantly kept in the dark....and are classified as perpetual drifters. I love it! I would have said \"We are constantly subjected to search currents, are somewhat indescribable, and likely to sting if you try to figure out what we are made of.\" In the spirit of self-deprecating humor, I'll throw a couple more straight lines. How Are Search Marketers Like: Neapolitan Ice Cream? We are 1/3 boring content, 1/3 sweet bait, and 1/3 dark secrets. Farm Equipment? We have silly names like BobCat and Caterpillar. Lawn Furniture? The cheap ones don't last long and most people don't want to pay for the good stuff. Zebras? We are either professionals pretending to be \"angry, pubescent, World-of-Warcraft-addicted anti-marketers\" or \"angry, pubescent, World-of-Warcraft-addicted marketers\" pretending to be professionals. But no one knows which. Come on Mozzers, show us your funny bones! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Are SEOs Like Jellyfish?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Are SEOs Like Jellyfish?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Carlos del Rio\n          \n            Carlos del Rio\n          \n            Carlos del Rio"
}