{
  "url": "https://moz.com/blog/how-to-get-on-national-tv",
  "slug": "how-to-get-on-national-tv",
  "title": "How to Get on National TV - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Last month, I was on Fox Business News. How did this happen? In this column, I’ll share a step-by-step, replicable process you can use to get yourself on TV.",
  "content": "How to Get on National TV Public Relations By: Larry Kim January 6, 2014 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Larry Kim January 6, 2014 How to Get on National TV Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. OMG you guys! Last month, I was on Fox Business News. How did this happen? In this post, I’ll share a step-by-step, replicable process you can use to get yourself on TV. Why Go on Television? Because it’s awesome. Seriously though, there is incredible value in being a talking head for as long as they’ll have you: You can easily dump tens of thousands on TV ads and not see near the same exposure. The going rate to run a 30-second spot on the average network show during primetime is $110,200, at a $25 cost per 1,000 homes. It’s an opportunity to build your expertise and authority in your niche. You never know who might be watching! A single TV appearance could lead to partnerships, new talent inquiries and more. It’s great inbound marketing and depending on the topic of the show and your appearance, can lead to qualified leads. Your friends will think it’s cool. Your mom will finally be proud of you and have something in plain English to show her friends about you. Sounds Good. Now Get Me on TV, Larry! No promises, but I assure you it’s possible, with a bit of planning, some ingenuity and a whole lot of patience. First, it’s important to understand how TV shows – especially news broadcasts – work. They are publishers and content creators, constantly on the lookout for expert guests to add interest and authority to their coverage. They need people just like you to help them out. Producers have regular contributors for popular topics like health or politics, but they seek out experts on new or uncommon topics/events (like the Twitter IPO). This is how I came in contact with the Fox news producer. They emailed my company at three in the afternoon on a Tuesday about making an appearance the very next day: The producer at Fox isn’t an associate of mine – I had never met him before. He didn’t owe me any favors and I’m quite certain he wouldn’t have known me from a hole in the ground before that Tuesday. So how do you get a national TV network producer to ring you up? How to Get a National TV Network Producer to Call You It starts with your online authority in your niche. The day before the Twitter IPO, I wrote a contributed article for Business Insider, entitled Hey Twitter, Your Ads Are Even Worse Than Facebook’s. One of the first things a news producer is going to do when they see your name pop up in relation to a topic for which they’re seeking an expert is check you out. They may check out your LinkedIn profile, Twitter account, company website, and other web properties to see if you’re a credible authority on the topic. All of this is part of your online portfolio and it’s critical to make sure each result about you that comes up for them is a positive reflection of your expertise, that reinforces that you are the person they want to hear from on the topic. So Google yourself and get your search results page in order! It sure doesn’t hurt to have your name come up alongside major publications; more on that in a minute. My company had done quite a bit of research on the performance of Twitter ads. Marketing language of CTRs and conversions doesn’t really resonate with those outside of online advertising, so I compared Twitter to Facebook Ads, to add some much-needed context, like this: When we put together content like this, we are very intentional and make sure we check the boxes we always do in the process. We design content intentionally based on where we hoped it will be picked up. In this case, that meant asking ourselves: Is it timely? Check. The Twitter IPO was taking place the next day, so we knew we were in alignment with the news cycle at major industry publications. Is it illustrated? Check. We pulled the data together and illustrated it in table format, for easy digestion by readers. We decided not to go with an infographic this time (seems Rand and I were on the same wavelength!), though we still wanted to provide a visual asset, which news media will often pick up and print alongside their coverage. Is it newsworthy? Check. Not only was it timely with the IPO happening, it was based on original research. On top of that, it was contrary to what everyone else was saying – do you remember them all tripping over themselves recommending Twitter stock? And there we were, with credible data showing that Twitter Ads might not be all that great an investment for marketers. Solid data + opposite conventional wisdom = definitely newsworthy. Catchy title? Check. You have very little time to catch the attention of news media. Don’t waste it with a crappy title. Within 20 minutes of publication on Business Insider, Fox News came calling. Why? Because they were looking for an expert and I put myself out there with a point of view they were likely to find interesting. How the Heck Do You Become a Contributor to Business Insider? Before you skewer me and say, “Sure Larry, it’s easy to get noticed… if you’re already writing for Business Insider!” Please understand, it wasn’t always this way. I don’t mean to make this sound easy, but it is replicable, I promise. There is that bit of a technicality, where I’m already publishing on major industry sites. So how can YOU get published on amazing, high traffic, highly reputable industry websites? Get them to ask you. It doesn’t happen overnight, but start by blogging on your own site. My first article ever published on August 7, 2009, and was cleverly entitled, “Welcome to my blog.” It was a brand new blog with zero visitors, but in the grand scheme of things, it really wasn’t that long ago! We now have over half a million pageviews a month. Since that first post, I’ve written hundreds, including many detailed case studies and breaking industry news stories. Along your journey, share your best stuff with reporters who cover your beat. If you share truly great information, you’ll have an opportunity to work with reporters on various stories; after they’ve worked with you on a dozen or so good stories, they’ll eventually ask you to be a contributor (or be open to accepting a guest post). It’s a bit of a “get rich slow” kind of deal and requires that you: Don’t pester journalists or be annoying. Be selective about who you contact with which story. Blasting them all with every piece of content you put out will irreparably damage any relationship you’re trying to build. Develop a trusted relationship with people over many months or years. Connect with them in social channels. Show interest in their articles instead of pitching your own all the time. Give them exclusive access to some information you have. Be persistent and patient. Set a goal for yourself each week, even if it’s just to write a post, at first. Then it might be to have one other industry blog cover the topic you have and mention your post. Start with smaller, local publications, then gradually raise the bar. Display blogging excellence. The higher caliber bloggers and mainstream media won’t cite or link back to a sloppy piece of writing. If you aren’t (yet) a polished writer, invest in writing or editing assistance. Basically, they need to see that you can write consistently great content, over a period of time, on a topic in which you are an expert. Once you have accomplished this, though – once you’ve nurtured those relationships and found your voice in the media surrounding your industry – you will find that opportunities abound across networks and platforms. Did Your Web Traffic Go Up? No, we didn’t see a big spike in traffic. However, high profile news coverage can lead to other types of benefits. Shortly after my appearance on Fox News, I got an email from a director at Facebook, hoping to meet in person. Getting noticed by big companies can be incredibly valuable! Here’s what that looked like: This led to many other benefits, such as an in-person meeting at the Facebook offices, my very own Facebook T-shirt, and much more! And of course, we got various press pick-ups and links from publications like Fox News Blog, Social News Daily, The Drum, Marketing Pilgrim, and dozens of other sites, which obviously carry SEO benefit, by way of valuable links and co-citation. You’re Just Lucky. At this point, I don’t blame you if you’re scratching your head, wondering if this whole story of getting on Fox News was just a case of random, dumb luck. Is it actually a strategy you can replicate? Honestly, it’s both. It doesn’t work all the time, but you can make your own luck. What I mean by this is that it’s not random – if you execute the strategy I’ve outlined above (publishing unusual findings on trending topics in authority publications, etc.) you most certainly can get on TV, and that was indeed our goal from the beginning. If you already have a business and are passionate about what it is that you do, you can absolutely replicate this process. Writing, speaking and publishing might feel unnatural at first, depending on your background, yet it’s worth investing in for the benefits in your inbound marketing strategy, authority and reputation. I’m telling you that this is definitely a repeatable process, since we’ve done it before! As any data-oriented SEO knows, something happening once is an anomaly, but twice is a trend! :o) Parting Thoughts: There are many benefits to content marketing. We most often think of content marketing as blogging, where the benefits are typically measured in terms of links, traffic, leads and sales. However, there are many different types of content (like getting on TV or even radio) that can be even more valuable. The ROI may be all sorts of non-traffic, intangible benefits; exposure for your company; partnership opportunities; authority building, etc. With a bit of content marketing persistence and know-how, I think you’ll find it it’s indeed possible to get on TV, and that it’s a repeatable process with potentially great value for your business! P.S. If you are interested, you can watch the full TV clip here :o) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Get on National TV"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Get on National TV"
    },
    {
      "level": "H2",
      "text": "Why Go on Television?"
    },
    {
      "level": "H2",
      "text": "Sounds Good. Now Get Me on TV, Larry!"
    },
    {
      "level": "H2",
      "text": "How to Get a National TV Network Producer to Call You"
    },
    {
      "level": "H2",
      "text": "How the Heck Do You Become a Contributor to Business Insider?"
    },
    {
      "level": "H2",
      "text": "Did Your Web Traffic Go Up?"
    },
    {
      "level": "H2",
      "text": "You’re Just Lucky."
    },
    {
      "level": "H2",
      "text": "Parting Thoughts:"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Larry Kim\n          \n            Larry Kim\n          \n            Larry Kim"
}