{
  "url": "https://moz.com/blog/how-do-tweets-influence-search-rankings-an-experiment-for-a-cause",
  "slug": "how-do-tweets-influence-search-rankings-an-experiment-for-a-cause",
  "title": "How Do Tweets Influence Search Rankings? An Experiment for a Cause - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": " Last week Rand Fishkin covered the new ways social media is impacting traditional SEO. While many SEOs had assumed this was happening already, this announcement marked the first time this new type of content endorsement (links within Facebook and Twitter) was actually confirmed as a ranking factor…",
  "content": "How Do Tweets Influence Search Rankings? An Experiment for a Cause Link Building By: Danny Dover December 8, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Danny Dover December 8, 2010 How Do Tweets Influence Search Rankings? An Experiment for a Cause Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Update (Dec 10th at 10:30 AM PST) - Wow! The participation has been overwhelming! Thank you everyone! I am still collecting data and will be posting the full results in the near future. For those curious, early results actually show the tweet version winning.Update (Dec 10th at 4:35 PM PST) - The Tweeted link is now ranking number #1 for \"ending hunger sierra leone\". Additional analysis coming! Last week Rand Fishkin covered the new ways social media is impacting traditional SEO. While many SEOs had assumed this was happening already, this announcement marked the first time this new type of content endorsement (links within Facebook and Twitter) was actually confirmed as a ranking factor by search engines representatives. Although there has not yet been enough time to run a formal experiment on the impact of these type of content endorsements, I would like to get the ball rolling with an informal experiment that will both help start to answer the questions these changes have brought and at the same time promote the holiday spirit. The Experiment Disclaimer: This experiment is not like the more formal tests we run here at SEOmoz. Any results we glean from this test will only be hints at what is going on. Admittedly, there are many factors that this test simply does not take into account. Seriously guys, this is more a fun test rather than an actual scientific experiment. :-) In order to test these two ranking factors (traditional links and social media citations), we are going to need to promote two nearly identical pages using one promotion method for one and the other promotional method for the other while targeting the same keyword phrase. We can then see which page performs better in both the short term (my guess is the the tweet driven page) and the long term (my guess is the link driven page). These two test pages will need to be targeting the same keyword phrase and on the same domain. I could do this on my own domain but doing so would be disingenuous (Hey everyone, send links and tweets my way! It is for an \"experiment\" ;-p You wouldn't be fooled for a second and my apartment would get TPed... again) Instead, the two test pages will be on a local charity's website and target the phrase \"Hunger in Sierra Leone\". The local charity, SeeYourImpact, is a registered 501(c)(3) nonprofit organization that sends 100% of donations to the charity of a donation makers choice. The non-profit then photographs the results and sends the photo and a story of how the donation made an impact on an actual person to the donation maker so they can 'see the impact' (thus the name) of their donation. There is absolutely no financial affiliation with SEOmoz and SeeYourImpact although we do do consulting for them on a pro bono basis. In short, we think they are doing a great service but no money is being exchanged between the two organizations. We Need Your Help! Below is the code for either tweeting or linking to one of the two pages on SeeYourImpact's website. If you are so inclined, please feel free to link and/or tweet about these pages. The pages are about trying to help eliminate hunger in Sierra Leone. Tweet Option: Help end hunger in Sierra Leone and meet the life you change http://bit.ly/hpsMJq Linking Option: <p>Help end <a href=\"http://seeyourimpact.org/explore/sector/hunger/fighting-hunger-sierra-leone/\">Hunger in Sierra Leone</a> and meet the life you change.</p> Help end Hunger in Sierra Leone and meet the life you change. If tweeting or linking is not your thing (wait, what are you doing reading an SEO blog?), feel free to browse SeeYourImpact's website and consider making a donation. Sharing the Results I will be monitoring the results and sharing my findings in this blog post after they come in. Thanks everyone! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Do Tweets Influence Search Rankings? An Experiment for a Cause"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Do Tweets Influence Search Rankings? An Experiment for a Cause"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Danny Dover\n          \n            Danny Dover\n          \n            Danny Dover"
}