{
  "url": "https://moz.com/blog/how-to-earn-topical-authority",
  "slug": "how-to-earn-topical-authority",
  "title": "How to Earn Topical Authority in 2023 and Beyond - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Zoe takes a deep dive into topical authority, a Google ranking factor. Learn about what it is, how to earn it, and, importantly, how to strategically develop topical relevance.",
  "content": "How to Earn Topical Authority in 2023 and Beyond Search Engines By: Zoe Ashbridge August 28, 2023 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Zoe Ashbridge August 28, 2023 How to Earn Topical Authority in 2023 and Beyond Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Edited by Emilie Martin This was originally published on June 8, 2022, and has been refreshed with new and important information and images. Topical authority isn’t a new concept, but as Google’s drive for helpful content is showing no signs of slowing down, topic authority is not something to ignore. Topical authority is closely linked to E-E-A-T (Experience, Expertise, Authority, and Trust), and as of May 2023, it’s confirmed: topical authority is a system Google uses to determine which experts are most helpful to a searcher's news query. You can expect topical authority to weigh into your chances of ranking. Whether you’re reporting on the news or not, there are a lot of crucial takeaways for all sites on the subject of authority and how to rank higher. So, read on as we deep dive into topical authority: what it is, a step-by-step guide on how to earn it, and how you can measure success to get buy-in to your new SEO strategy. Plus, in the end, I put everything together into a quick case study in a highly competitive niche. This is a comprehensive guide, and my goal is for you to feel highly confident in the power and execution of topic authority by the time you’ve read it. Let’s get into it! What is topical authority? Topical authority is a system used by Google to determine which experts or publications have the expertise to cover news-related queries in niches such as health, politics, or finance. While topic authority is related to news-type queries, you want to consider building it no matter what you cover. If Google is using the topic authority system for news, there’s every chance they’re using it for other queries. Plus, becoming an authority on a subject (and proving it) just makes sense. You want your buyers to trust you, right? Showcasing authority helps them do exactly that. How topical authority works in 2023 Through proven expertise, you build authority and trust in your field. You can showcase expertise and trust by publishing high-quality, informative content, refining your internal linking strategy, citing authoritative sources, and receiving high-quality, relevant backlinks. Topical authority makes sense. We all want to buy from the best and most authoritative sources in the real world, right? The goal is for your site to be perceived as a trusted source of information on a particular topic. Let’s look at content, links, and authorship to see how each element plays into topical authority. Content clusters To be topically authoritative, you need to focus on content clusters. These content pieces should be written by - or at least cite - highly qualified sources. Your website must serve your web users, answer all their questions, and provide high-quality content at every step of the buyer journey. To secure ranks, you need to showcase authority on your site's subject. Google needs to trust you before it sends traffic to your site. We know this because Google is committed to showing its users the most helpful content and uses site-wide signals to gauge helpfulness. For example, if you’re selling skincare products, it’s not enough to put products on your site and expect to rank for keywords like ‘skincare,’ ‘skincare products,’ or ‘skincare for dry skin.’ If you want to showcase authority, you should cover all the questions your audience is asking. You might also cover topics such as: Use cases or success storiesSkincare routines for various skin typesIngredients and how they benefit the skinTips and guides for using various skincare products The list could go on and on. You want to develop a content strategy that aims to cover every type of query or question related to your topic. This topic coverage shows Google you know what you’re talking about. Better than that, it provides your brand with content that helps your user build their trust, and it’s something to share within other marketing channels, too. We’ll get into the step-by-step guide to building topical authority later, but for now, know that you can use Moz Pro to identify all the queries your users are searching for, which can help you decide what to write in order to build topical authority. If you were a skincare brand, you might start answering some of the queries discovered by Moz Pro above. And there’s a lot more where that came from, too! In his video, Louis Smith explains the power of topical clusters for e-commerce brands. Topical clusters are not limited to e-commerce sites; whatever your site, you need to build authority. Internal linking Internal linking is what groups your clusters together. Remember, you want Google to know you’re an authority on your website’s topic. You want Google Bot to crawl relevant pages after relevant pages on your site. Internal linking is how you achieve that. Most likely, you’ll naturally internally link your website content as in many cases, it just makes sense! You want to be mindful of your clusters and where you want to link as you’re writing articles. Sticking with the skincare example from above, if you wrote an article on a skincare routine, you might link to another article titled, ‘The Benefits of a Skincare Routine.’ You can link in-line (within the body text of your article), you might showcase a particular article in a banner style, or you could add a ‘you may also like’ section at the end of your article. Within this section, you’d feature articles related to the topic. Take a look at the example from Moz’s blog. In the screenshot above, taken from Moz’s article titled, ‘TikTok SEO: Understanding the TikTok Algorithm,’ you can see the ‘Read Next’ section with three related articles. The ‘Understanding the TikTok Algorithm’ article is clearly part of a social media cluster, so three relevant articles include content around Twitter, more on TikTok, and social media. Repeat internal linking strategies just like this on your website! Authoritative authors Doesn’t it make sense that the most authoritative authors get the top ranks on Google? When you’re researching, you want to hear from the people who know what they’re talking about, don’t you? Google wants to make its users’ lives easier, and it does that by putting the most helpful results at the top of Google. Additionally, Google and other search engines are constantly trying to identify true authoritative sources from those that are not (for example, AI-generated content). To help Google identify an authoritative author, try: Adding author credentialsAdding an author name and bioCreating an author page like my author page on MozUsing person schema to drive more data to Google. From the latest update on the Google Search Central Blog, we know that source reputation weighs into topic authority, so don’t hold back; show that your author is authoritative and reputable. Cite authoritative sources You might not have the best of the best author writing for your site when it comes to authority, and even the most successful thought leaders don’t know it all. Thankfully, you can still bring some authority into your articles by showing, through citations and external links, that you’ve done your homework. If you researched to write an article, say that and link to it—link only to authoritative sources that you (and your readers) can trust. Don’t be nervous about external links; they help you and add value to your readers. Get backlinks Unlike Domain Authority (DA), a third-party measure of website authority, topical authority is more of a quantitative measure of how authoritative a site may be. DA looks primarily at backlinks and the number of high-quality, relevant backlinks. Topical authority is proven expertise built over time by accurately covering the breadth and depth of a topic with reliable sources. However, backlinks will still play a role in your success in earning topic authority. We can see that in the Google Search Central Blog. Influence and original reporting result in a ‘highly cited’ label. And how does Google know that a page is highly cited? You got it, backlinks. The takeaway here is that you want to create content that is so good, informative, and useful that other people will cite and link to you. Why is building topical relevance important for SEO? If you reach out to someone for a service or product and they speak confidently and passionately about their offering, answer all of your questions, and understand your needs, then you’re more likely to trust them. Why should the internet be any different? Your buyers are drawn to your offering, your expertise, and your passion. Buyers also want to know you can help serve them and that you understand them. In the digital world, content is how you nurture buyers. Where Google is concerned, topical relevance proves to search engines that you’re trustworthy and knowledgeable. We all know that Google wants to show its users the best possible content from the most credible sources. If you reach out to someone for a service or product and they speak confidently and passionately about their offering, answer all your questions, and understand your needs, then you’re more likely to trust them. Why should the Internet be any different? Your buyers are drawn to your offering, expertise, and passion. Buyers also want to know you can help serve them and that you understand them. In the digital world, content is how you nurture buyers. Where Google is concerned, topical relevance proves that you’re trustworthy and knowledgeable to search engines. We all know that Google wants to show its users the best possible content from the most credible sources. You know a thing or two about your product or service, so prove it to Google through content. Cover related topics, hit keywords, and present information in a way that’s easy for your user (and Google) to understand. A step-by-step guide to building topical authority Topical authority allows you to showcase why someone should buy from you. In doing this, you build trust and authority with Google, encouraging the search engine to see you and your site as the subject authority that deserves to rank. To be the most authoritative site, you must cover everything your competitor is and some more. Plus, you want to create different types of content to appeal to your audience (videos, guides, etc.) This is why you’ll find long-form content, many headings, images, and video in this article. Once your site starts looking more authoritative and helpful, why would Google prioritize a competitor site when it perceives your site to have the most helpful information? There’s one key thing to remember: when ranking on Google and earning favor in the algorithm, you need to use keywords in your content. As you center your strategy around creating high-quality articles, you must be cautious of keyword cannibalization. There's also what I call topical cannibalization. To build topical authority strategically, you need to know how to build out your content architecture effectively. I’m going to walk you through that now, step by step. 1. Research your topic. Before you can build out your content strategy, you need to research your topic. You’re looking for the search terms your buyers are typing into Google to solve their problems. Here, you can turn to keyword tools like Moz’s keyword explorer. Type in a keyword (or your topic) and see what’s suggested. You will find exactly what terms are being searched in Google so you can use them within your content and rank for them. Let’s use the subject of knitting to illustrate this. Moz shares keyword suggestions, many of which can form part of your content strategy. Remember: covering all relevant topics helps build topical authority. Social media sites like Quora and Reddit are also helpful. Within these sites, you can see what discussions your audience is having. You’ll likely encounter their pain points, queries, and buyer apprehensions that you can solve, answer, or soothe within your content. Finally, my favorite, people also ask (PAA). Want to know what your audience is asking? There’s a trove of information in there! Tools like AlsoAsked make light work of PAA, allowing you to view PAA data in a visually appealing, hierarchical structure. There’s a lot of opportunity to build topical authority in any niche. Just take a look at knitting as an example! 2. Create pillars and clusters When researching your topic, map out every single piece of content that you want to create based on what your audience is searching or looking for. I like to do this in a large Excel spreadsheet or Google Sheets. Take note of the content you will create in one cell; next to it, list the focus keyword and all supporting keywords. You’re going to cover every single query or question within your content. Then, you’re going to work on assigning keywords to the pieces. This is the crucial step that prevents keyword and - as I call it - topical cannibalization. 3. Map keywords to content pieces using SERP analysis. When mapping keywords, it’s easy to assume that every keyword needs its own page. Take the knitting example: if you dig around in the keyword suggestions, you can find 'what is knitting' (590 searches/month) and 'history of knitting' (480 searches/month). A quick analysis of the SERPs shows that these two keywords can perform well in SERPs used on the same page. You don’t need to write two articles. Two articles could result in what I call topical cannibalization. Here’s a screenshot from the SERPs when searching ‘what is knitting.’ The Sustainable Fashion Collection has a rank two position, likely the best rank they can achieve considering they’re competing with Wikipedia. From the title tag, we can see the article targets keywords ‘what is knitting’ and ‘history of knitting.’ The screenshot below shows they’ve successfully done so, too. The article ranks successfully for both keywords. The point is that you don’t have to create articles for every single keyword or query. You can create long-form articles, which brings me to my next step nicely. 4. Write high-quality, well-researched content. When planning your content, look for opportunities to write quality, well-researched, long-form articles instead of just trying to publish as many as possible. Instead of writing two articles, consider writing one more in-depth article like sustainablefashioncollective.com did. As we’ve established, their article features high up on the SERPs for ‘what is knitting’ and has a featured snippet for 'history of knitting.’ It’s also on page one for 'knitting uses' (20 searches), plus 28 other keywords. 5. Share it with your audience. There’s no need to wait for your page one rank before you get eyes on your article or page. Share it with your audience, use social media, and present content to your subscribers through email. Try repurposing content and creating videos. Using your content in this way can prove its value to decision-makers, too. I’ve gone into this in some detail below. Check out the section, ‘Measuring the impact of your authoritative content.’ A brief history of authority in Google SERPs Although topical authority has been a buzzword with increasing interest since 2022 (see trend below), it’s not a new concept. Since its inception, Google has been refining SERPs through algorithm changes to provide authoritative sources. Let’s look at the clues through SERP history that show that topic authority is a big deal when it comes to ranking. 2023: Topic authority system and news This is where we are right now and exactly what we’re talking about in this article. Google uses a topic authority system to determine the most trustworthy sources to report and rank for newsy queries. 2018: Medic and topical authority Google’s desire to present only the most useful information was made clear (if it wasn’t already) in 2018 through the medic update. In 2018, the medic update impacted all verticals, predominantly health. It was a positive update, encouraging everyone to improve content production. The update meant that instead of writing content in isolation and expecting it to rank well, content needed to showcase experience, expertise, authority, and trustworthiness (E-E-A-T). And it makes sense for this standard to be upheld across the web, especially when we consider that more pieces of content are being published than ever before. In short: post only the most well-written, well-informed articles on your website if you want to stay competitive. What we learned from medic relating to topic authority: Though medic focused primarily on medical content, it impacted all verticals. Your site should showcase authority through E-E-A-T. 2013: Hummingbird Hummingbird took inbound links and keywords into account; this update emphasized content relevance and authority. It marked a shift away from keyword stuffing and towards the importance of the quality and relevance of content. What we learned from Hummingbird relating to topic authority: Create content in clusters and link them together. Top tip: Where natural, use the keyword you want the linked-to page to rank for in the anchor text. 2012: Google launched Penguin Penguin launched on April 24, 2012, and impacted around 3% of searches. This new and impactful algorithm tackled webspam, including keyword stuffing and backlinks. The backlink layer of this algorithm update is most related to topic authority; it wasn’t enough to have a high number of backlinks after Penguin launched. Instead, web admins needed high-quality, relevant links to prove their site authority. What we learned from Penguin relating to topic authority: Focus on quality link building - just write linkable content - instead of focusing on quantity or poor quality links. 2011: Google launched Panda Panda launched on February 23, 2011. The new algo targeted low-quality sites that lacked authoritative content. Sites with thin, duplicate, or plagiarized content suffered, while those with in-depth, valuable, and unique content were rewarded. Some things never change; Google always wants quality content that provides genuine value to the reader. What we learned from Panda relating to topic authority: Aim to write long-form content that helps your user. Avoid writing short web pages for the sake of it. These algo updates are just a handful in a long and complex history. But from just these updates, you can see that authority is a pretty big deal, right? Measuring the impact of your authoritative content As an SEO reading this article, you might think about how you will Sell in increased content production to decision-makers.Prove it works. Naturally, topic authority isn’t a majestic strategy that’ll work overnight. Still, it is crucial and powerful for ranking, building trust (with Google and your audience), and getting qualified traffic to your site. With SEO being a slow mover, you need to get creative with how you can measure the impact of your authoritative content before you start earning clicks and conversions. Increased visibility in SERPs Look for increased visibility in SERPs using Google Search Console. You can gauge how much visibility your site is getting by looking at impressions. Generally, in content strategy, impressions is the fastest metric to move. You increase impressions before you earn clicks. An upward impression trend is a strong indicator that your content strategy is working. As you increase content production and authority, you can expect clicks to follow the impression trend eventually. The screenshot above is taken from my blog, Road to Frame, a small website with low authority. It’ll be a while before the site earns many clicks, but the upward trending impressions, albeit small, indicate that the site is on the right path to earning more clicks for the head keyword. This was achieved through content production and working in clusters. Assists in conversions Businesses need to make money, and SEO can help them do that. Proving the role of SEO in sales will help you tremendously if you need to convince decision-makers to invest in SEO and content production for topic authority. With SEO tied directly to revenue, you’ll have an easier time convincing decision-makers to invest in SEO. I like the landing page report to demonstrate how content contributes to revenue. Note: This will only be effective if people buy directly from SEO efforts; if they’re not, Segment Overlap can be good. I’ve demonstrated this in the case study below. In my anonymous client’s Google Analytics, you can see how revenue, particularly between 2021 and 2022, increased with traffic. Blogs (not all of them ranking well) used as part of other marketing strategies (e.g. email or social media) had a direct impact on revenue. People who landed on a blog also bought an item. Any blogs that ranked, did so for keywords outside of brand keywords, meaning the revenue was directly attributed to SEO efforts. While you build your authority for ranks on Google, you can prove the value of content in other ways. Sales from quality content are an indicator that the content built trust in the user. Check your backlink profile High-quality content will eventually earn backlinks from credible sources. You can use Moz Pro to take a look at which content is getting the most backlinks and also prove that credible websites are linking to your brand. After the homepage, Moz’s most linked page is the link explorer. You can click the magnifying glass to view the links. There are some highly authoritative sites linking to Moz here! See HubSpot, Search Engine Journal, Shopify, and DreamHost. Top tip: you can take this measure a step further by proving traffic increases or revenue direct from the users sent to your site through your high-quality links. Topic authority case study Let’s put all of this together by looking at a real-world example using my client, Kineon. In the red light therapy market, Kineon’s competition is high. The site was new, with a low DA, in a niche that’s leaning into medical. Ranking was going to be tough, but through topical authority, we were able to achieve improved ranks; in less than six months, the blog went from earning zero clicks to 1,280 and one cluster contributed to 7% of overall revenue. The screenshot below demonstrates the continuous success despite market and website challenges. We achieved this by: Using Google Search Console to identify where the site, although small, already had authority. We found the site was getting the most clicks for queries related to the knee and red light therapy.We researched as many queries and questions as we could find on this subject. We used Quora, Reddit, and People Also Ask.We created a keyword map and assigned keywords to pages.An in-house writer created content.Content was linked together where natural and using a ‘you may also like’ section at the end of each article. While SEO was taking its time to work, we measured the value of the content by using a segment overlap report in G4. I have blurred the revenue to protect client data, but you can see the overlap between people who viewed a blog on the subject of the knee (the smaller circle) at 7% of the size of overall purchasers (the larger circle). This graph is for July 2023 only. To support SEO efforts, we started an intentional and high-quality backlinking campaign, resulting in backlinks from highly relevant sites. Backlinks drive traffic and revenue. Quick tips for earning topical authority The steps above briefly detail the steps you can take to help build topical authority over time. Here are some final steps to integrate into your content plan: Identify new trends and write about them.Cluster your keywords and cover a topic in full based on SERP analysis.Keep up with current events related to your topic and cover them timely.Don’t be afraid to share something new — just because it’s not on the SERPs doesn’t mean you can’t be the first to say it.Don’t be afraid to link out to trusted sources. Referencing other materials is a great way to show you’ve done your research.Update your content to keep it fresh. For example, if a page is dated with 2022 data, it might be time to update it and make that article relevant to 2023 and beyond. How can you tell if a website is authoritative? There are many ways to work out if a website is authoritative. You can use the following ways to tell if a website is authoritative: Check the Domain AuthorityCheck your Brand AuthorityLook out for indented SERPsCheck organic keywordsStrong internal link profileWell-written, informed content Check the Domain Authority An SEO favorite is Domain Authority (DA). Although we’re focusing on topical authority here, Domain Authority is still a measure of an authoritative website. The DA score is a number between 1 and 100 which indicates the website’s strength in search engine results pages. There are several factors that feed into this algorithm, and backlinks are one of them. Simply put, the more high-quality, relevant backlinks a site or content piece has earned, the higher your domain’s authority will likely be. After all, other websites tend to link to highly authoritative websites. Check your Brand Authority™ Brand Authority is Moz’s new metric that can measure a brand’s strength, on a scale of 1 to 100, showing how authoritative your brand is online. Using Google’s rich results and brand signals, a wide variety of brand terms are detected to understand how often people are looking for your brand, and thus a score is computed. Where Domain Authority measures your website’s ability to rank on search engines, Brand Authority measures your broader influence across marketing channels. Look out for indented SERPs Indented SERPs are a strong indicator that a site is topically relevant. If you search a keyword such as: ‘landscape design tips’ (90 searches/month), you might find housebeautiful.com and its indented search results. Indented SERPs are where similar topics that exist on one website are grouped together, giving the site more prominence in search results. Check organic keywords Generally, the more keywords a site ranks for on a topic, the more topically authoritative it will be. SEO tools provide some insights into what your competitors are ranking for. They can also share topic ideas for how you can close the gap by covering the same topics. If you do cover the same topics, remember to add more detail, more media, or a unique perspective. Strong internal link profile Assuming a site is using internal linking well, a strong internal link profile should demonstrate that a site is authoritative on a subject. Take ‘beginners guide to SEO (480 searches/month) as an example. For this keyword, Moz is in position one. A quick internal link analysis tells me there are 26 links within content pointing to this page. Links are coming from pages such as On-Page Ranking Factors in the ‘learn’ section of the website. This is a highly relevant topic for beginner guide SEO. Well-written informed content If you’re on a website and you’re discovering well-written, high-quality, original pieces of writing, then it shows that the site has some topical authority. If the site is also updating this high-level content regularly, it’s probably earning topical relevance. Do backlinks still count toward website authority? Yes, backlinks still contribute to website authority. We can also predict that backlinks will continue to be helpful toward SERP rankings — but they’re not everything. Backlinks needn’t be your goal when it comes to topical relevance. They will happen naturally as you earn visibility in SERPs and write high-quality, linkable content. Authoritative sites will continue to earn backlinks at a higher rate than non-authoritative sites. Plus, having topical authority can only help you attract links from other websites. Final thoughts on topical authority Building authority on a subject should come easily. After all, this is the topic you loved so much you built a website to share your expertise on it, right? Reach out to your subject matter experts, ask them questions, and get to writing. Be creative with what you put out there, repurpose your content, answer questions, and nurture your buyer. Follow my steps above, and don’t be afraid to inject some new information into the SERPs. Your buyer wants to know you and your business! The extra efforts go a long way when it comes to content. Remember, content and topical authority in a digital world often replace face-to-face interactions. Show your buyer why you’re an expert, what you know about your subject and all the reasons why they should trust you. If you’ve still got questions, feel free to drop me a message on LinkedIn. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Earn Topical Authority in 2023 and Beyond"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Earn Topical Authority in 2023 and Beyond"
    },
    {
      "level": "H2",
      "text": "What is topical authority?"
    },
    {
      "level": "H2",
      "text": "How topical authority works in 2023"
    },
    {
      "level": "H3",
      "text": "Content clusters"
    },
    {
      "level": "H3",
      "text": "Internal linking"
    },
    {
      "level": "H3",
      "text": "Authoritative authors"
    },
    {
      "level": "H3",
      "text": "Cite authoritative sources"
    },
    {
      "level": "H3",
      "text": "Get backlinks"
    },
    {
      "level": "H2",
      "text": "Why is building topical relevance important for SEO?"
    },
    {
      "level": "H2",
      "text": "A step-by-step guide to building topical authority"
    },
    {
      "level": "H3",
      "text": "1. Research your topic."
    },
    {
      "level": "H3",
      "text": "2. Create pillars and clusters"
    },
    {
      "level": "H3",
      "text": "3. Map keywords to content pieces using SERP analysis."
    },
    {
      "level": "H3",
      "text": "4. Write high-quality, well-researched content."
    },
    {
      "level": "H3",
      "text": "5. Share it with your audience."
    },
    {
      "level": "H2",
      "text": "A brief history of authority in Google SERPs"
    },
    {
      "level": "H3",
      "text": "2023: Topic authority system and news"
    },
    {
      "level": "H3",
      "text": "2018: Medic and topical authority"
    },
    {
      "level": "H3",
      "text": "2013: Hummingbird"
    },
    {
      "level": "H3",
      "text": "2012: Google launched Penguin"
    },
    {
      "level": "H3",
      "text": "2011: Google launched Panda"
    },
    {
      "level": "H2",
      "text": "Measuring the impact of your authoritative content"
    },
    {
      "level": "H3",
      "text": "Increased visibility in SERPs"
    },
    {
      "level": "H3",
      "text": "Assists in conversions"
    },
    {
      "level": "H3",
      "text": "Check your backlink profile"
    },
    {
      "level": "H2",
      "text": "Topic authority case study"
    },
    {
      "level": "H2",
      "text": "Quick tips for earning topical authority"
    },
    {
      "level": "H2",
      "text": "How can you tell if a website is authoritative?"
    },
    {
      "level": "H3",
      "text": "Check the Domain Authority"
    },
    {
      "level": "H3",
      "text": "Check your Brand Authority™"
    },
    {
      "level": "H3",
      "text": "Look out for indented SERPs"
    },
    {
      "level": "H3",
      "text": "Check organic keywords"
    },
    {
      "level": "H3",
      "text": "Strong internal link profile"
    },
    {
      "level": "H3",
      "text": "Well-written informed content"
    },
    {
      "level": "H2",
      "text": "Do backlinks still count toward website authority?"
    },
    {
      "level": "H2",
      "text": "Final thoughts on topical authority"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    }
  ],
  "author": "Zoe Ashbridge\n          \n            Zoe Ashbridge\n          \n            Zoe Ashbridge"
}