{
  "url": "https://moz.com/blog/how-i-got-a-link-from-cnn",
  "slug": "how-i-got-a-link-from-cnn",
  "title": "How I Got a Link from CNN - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As my Dad always says, \"It's better to be on page 2 in the editorial than on page 7 as an advertisement.\"  This advice has been the guiding principle when it comes to the public relations strategy at Voices.com.  In fact, I've proven this to be so effective in public relations that I've applied it…",
  "content": "How I Got a Link from CNN Link Building By: David Ciccarelli March 23, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: David Ciccarelli March 23, 2009 How I Got a Link from CNN Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As my Dad always says, \"It's better to be on page 2 in the editorial than on page 7 as an advertisement.\" This advice has been the guiding principle when it comes to the public relations strategy at Voices.com. In fact, I've proven this to be so effective in public relations that I've applied it to SEO as well. How does the advice translate? Many SEOs would agree that the organic results are editorial listings, generally obtained by editorial content being linked to by other editorial content, and PPC results are the ads which only appear because someone paid for the ad to show up. This knowledge has led me to experiment with a hybrid approach to public relations and SEO and simply request links from writers, journalists and bloggers when contacted for a comment, which brings me to the highlight of any SEO's week, or perhaps even their month. This past week, a writer from CNN asked if I'd contribute a few paragraphs on the Amazon Kindle 2's new text-to-speech technology, as it created quite the uproar from the Author's Guild of America. Steve, the writer for CNN, asked for my take and I sent him 2-3 paragraphs with my point of view. A few days later, the article appeared in my Google Alerts and lo and behold, there's a link. Yeah baby! HOW TO GET THE LINK Build Relationships My relationship with Steve started nearly a year ago when he reached out asking if I'd like to contribute to an article called \"Internet Gives Voice to Unseen Actors,\" discussing the rise of freelance voice actors on the web. Naturally, I gladly wrote a few paragraphs and that's how the relationship started, through his invitation and my being willing to help. Stay Top of Mind Be professional, respectful and give the relationship time to develop. Keep in touch throughout the year. Send \"FYIs\" such as interesting facts or breaking news that you have a hunch will catch on in the mainstream. Techmeme is a great source for keeping up with daily news. Offer an Insider's View Give writers access to information they wouldn't normally see, such as survey results, internal company metrics (check with your CEO first), or your personal opinion on current and future trends. Position Yourself as an Industry Expert I write an annual report that explores areas of the audio production industry that are growing, such as audiobooks for the iPod and Kindle, and I always provide stats and research to back up my claims. This is now the third year that I've written an annual report and it has become a handy tool to send to journalists, partners, vendors and bankers. Be Accessible Have a professional email signature that includes your mobile phone and primary email address. Never Miss a Deadline When you get the chance to contribute to a news or editorial on a larger website, get your submission in well ahead of the deadline so it makes the cut. If they say Monday, have it in the Friday before as journalists often work on their writing over the weekend and you want to be sure you're included. Ask for the Link Shocking, I know. But, unless you ask, you could miss this golden opportunity. I usually say \"In closing, I have a small request. I'd really appreciate a link directly to Voices.com. If you can swing it, that would be great!\" Consider adding this as a P.S., as if it was an afterthought and not your modus operandi. The lesson here is you'll never know unless you ask. WRAP UP Now, the next time you or someone at your company is presented with a press opportunity, you'll know how to leverage it and achieve every SEO's wish, a link from a top tier authority website. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How I Got a Link from CNN"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How I Got a Link from CNN"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "David Ciccarelli\n          \n            David Ciccarelli"
}