{
  "url": "https://moz.com/blog/how-my-list-of-followers-on-twitter-has-increased-by-more-than-200-in-one-day-and-why-i-dont-like-it",
  "slug": "how-my-list-of-followers-on-twitter-has-increased-by-more-than-200-in-one-day-and-why-i-dont-like-it",
  "title": "How My List of Followers on Twitter Has Increased by More Than 200 in One Day (And Why I Don't Like It) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For almost one year I had a Twitter account and never used it. Last month I became active on twitter and after tweeting, retweeting, socializing and exchanging information my list grew from my 14 friends to 144 followers. Every day I would receive one or two “Someone is now following you on…",
  "content": "How My List of Followers on Twitter Has Increased by More Than 200 in One Day (And Why I Don't Like It) Social Media By: pvalbocino April 7, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: pvalbocino April 7, 2010 How My List of Followers on Twitter Has Increased by More Than 200 in One Day (And Why I Don't Like It) Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. For almost one year I had a Twitter account and never used it. Last month I became active on twitter and after tweeting, retweeting, socializing and exchanging information my list grew from my 14 friends to 144 followers. Every day I would receive one or two “Someone is now following you on Twitter” notifications. It was nice; I really enjoyed visiting my new followers' profiles, figuring out how they had known me, checking what they tweet about and maybe following them back. I said it was nice because that fun is over now. One day I was browsing the Internet when I found this list of 25 SEO Gurus you should follow on Twitter. I went through each one of them and started following the SEO specialists I wasn’t following yet, which were around 20 from that list. It was just after I finished this task that I started receiving one Twitter notification of a new follower after the other. Next morning, my Twitter registered 364 followers. This is how my e-mail account looked: I couldn’t understand what was happening. What had I done to deserve so much attention? Who were those people and why were they suddenly interested in following my tweets all together? I started checking some of them and they looked weird to me. How can someone have more than 2,000 followers and 10 tweets? They were obviously spammers, like this one: And because I am not interested in buying the products they are going to spam me about, I never followed them back. My list of followers started decreasing and from 364 in the morning it was registering 280 in the afternoon. Good, I don’t care! However, it was to my despair that in the evening my e-mail account started receiving the notifications of new followers all over again! Ok, enough is enough! Who are you crazy people? I started to go through them again and I found this tweet in one of my new follower's profiles: I went to that website, watched the promotional video and then I understood what was going on. The spammers following me were probably using this kind of software promoted in that website. They targeted the leaders of SEO industry and every time someone follows one of them, they automatically follow this person. Part of the promotional video I had not only started following one of the leaders targeted, but almost 25 at one time. I was like a bleeding surfer swimming close to 200 sharks! And because some people suffer from the newest psychological disorder called ISFBaG (I Should Follow Back Guilt), they get a lot of qualified, interested in SEO industry followers by doing that. As I don’t suffer from ISFBaG, the software of all 200 spammers stopped following me automatically after few hours only to follow me again later. They are all giving me a second, third, fourth and probably infinite chance to follow them saying “Hey, I am following you. Won’t you follow me back?”. No, I won’t. So stop filling up my e-mail inbox and spoiling my pleasure in using Twitter. Jeez! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How My List of Followers on Twitter Has Increased by More Than 200 in One Day (And Why I Don't Like It)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How My List of Followers on Twitter Has Increased by More Than 200 in One Day (And Why I Don't Like It)"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "pvalbocino\n          \n            pvalbocino"
}