{
  "url": "https://moz.com/blog/how-a-site-redesign-increased-traffic-by-515",
  "slug": "how-a-site-redesign-increased-traffic-by-515",
  "title": "How a Site Redesign Increased Traffic by 515% - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We recently redesigned and restructured a website for a client and witnessed a massive traffic spike the day after the new site launched. The traffic has stayed at about a 500% increase for the past month, and appears to be on a continual climb.",
  "content": "How a Site Redesign Increased Traffic by 515% On-page SEO By: Darren Shaw April 23, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Darren Shaw April 23, 2009 How a Site Redesign Increased Traffic by 515% On-page SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. We recently redesigned and restructured a website for a client and witnessed a massive traffic spike the day after the new site launched. The traffic has stayed at about a 500% increase for the past month, and appears to be on a continual climb. The new website contains very little additional content when compared to the old site. The increase seems to be entirely based on fixing some serious problems on the old site: The old site had a \"splash\" page that asked users to agree to terms before entering the actual homepage. To agree to the terms you had to submit a form. (Despite this, most of the pages of the old site were still indexed in Google.) Every page of the old site had the same title tag and meta description. The vast majority of content on the old site was in PDF files (also indexed). We redesigned and reworked the website with the following improvements: Developed a new site in web standards. Restructured the navigation. Implemented search engine friendly URLs. Converted each PDF document to a proper html web page with keywords in the title tags. Fixed canonicalization issues. Setup 301 redirects for all pages and PDFs of the old site to go to the equivalent URL on the new site. We also custom developed an SEO friendly content management system for them that provided the following features: The ability to create their own custom URL paths. When adding a new page it checks to make sure the title and description tags are unique - no duplicates. Title and description tag \"countdowns\" as they type them in. \"SEO tips\" links that provide guidance on best practices for SEO. Clicking on any of the \"SEO tips\" links in the CMS opens up a description of how to write proper URLs, title tags, and meta descriptions for the search engines. This assists the client with creating well optimized pages for the site as they continue to work with the CMS. The results from the site overhaul are dramatic. Here are the statistics for the 30 days PRIOR to the launch of the new site: And here are the statistics for the 30 days AFTER launching the new site: I love the increase in percentage of traffic coming from the search engines. 45.69% of the overall traffic was coming from the search engines in the month prior to the new site launch, but after the launch this number jumped to 80.11%. In addition, in the 30 days prior to the launch, Google sent visitors to the site through 343 different key phrases. In the 30 days after the launch, Google sent visitors to the site through 5,988 different key phrases. This demonstrates that the site has really opened up to thousands of new long tail key phrases. Here’s a chart of the site traffic over the past 60 days. The new site was launched on March 11th (129 visits), and that first spike in traffic is March 12th (390 visits). Given the serious problems that the old site had, I’m not too surprised by these results. When I look around the web I see so many sites with similar problems. I think this is a good case study to present to clients about the value that can be gained by restructuring their content and fixing up their SEO problems. We are currently working on a number of redesigns like this for existing and new clients. ___________________________________________________________________________________ Whitespark is a web design and search engine optimization company based in Edmonton, Canada Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How a Site Redesign Increased Traffic by 515%"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How a Site Redesign Increased Traffic by 515%"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Darren Shaw\n          \n            Darren Shaw"
}