{
  "url": "https://moz.com/blog/how-serp-ranking-affects-conversion-rate-a-study",
  "slug": "how-serp-ranking-affects-conversion-rate-a-study",
  "title": "How SERP Ranking Affects Conversion Rate: A Study - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Usually, the SEO community is extremely helpful and always willing to lend a hand to new SEOs learning the ropes. But after scouring the web for information correlating rank and conversion rates, I hardly found anything.\n\nIt might not seem important at first, because hey, if you rank at the top,…",
  "content": "How SERP Ranking Affects Conversion Rate: A Study Advanced SEO N By: Nate Schrader January 16, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! N By: Nate Schrader January 16, 2012 How SERP Ranking Affects Conversion Rate: A Study Advanced SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Usually, the SEO community is extremely helpful and always willing to lend a hand to new SEOs learning the ropes. YouMoz is cyber-living proof of that. But after scouring the web for information correlating rank and conversion rates, I hardly found anything. It might not seem important at first, because hey, if you rank at the top, you’re bound to see more conversions, right? Well, sure, but at what cost? I suspect the searchers of head keywords clicking on ranks 1-3 keywords are not as devoted or engaged in finding their preferred item as much as rank 4-7 keyword clickers and especially that small percent daring enough to venture to page two. If the additional cost to move up the SERP outweighs the potential revenue brought in, perhaps it’s best to hang out at spot four or five and devote your efforts elsewhere… which is what my upfront research shows. The Data My company, One Click Ventures, markets ten e-commerce retail sites, from handbags to discount sunglasses to travel accessories. For this research, I chose 60 most-visited keywords from one of our stores. Working some Excel pivot table magic, I totaled the number of conversions at each rank and divided it by the total number of visits at each rank. To get a more general result, I repeated the process for keywords ranking 1-3 (usually above the fold), keywords 4-7, and keywords 8-10. Also, because some retail stores are seasonal, I thought necessary to see which keyword ranks occurred most in each season. As expected, words converted best during the holiday season, no matter the rank. In the graph below, notice keywords ranked 1-3 mostly during the holiday season, whereas keywords ranked 4-10 mostly during the spring season. I’m no Sherlock Holmes, but by the looks of it, I would suspect keywords ranked 1-3 should convert the highest and prove my hypothesis false. The Results: Luckily I’m not Sherlock Holmes, or Robert Downey Jr. would be out of a job till Ironman 3. Oh snap! As you can see, keywords ranking 4-7 convert the highest, followed by keywords ranking 8-10. Recall that both of those ranking occurrences appeared mostly in the spring, not the holiday season. Where’s our keywords ranking 1-3’s holiday season-dominated conversion rate? Why, at 10% lower than R4-8. And although revenue looks higher for R1-3, the per visit value of R4-7 was highest as well. Would I bet my life savings on these findings? Probably not. My co-worker Scott wrote an insightful post on predicting organic traffic and how a keyword rank is arbitrary in nature, which could be why some of you readers may doubt my findings. But seeing that there’s not much information towards this topic on the web (because it’s only natural we like to keep conversion rates to ourselves) someone needs to start the conversation. So if you have suggestions on a better way to do the study, a study of your own, or if you’re outraged that it may actually be more cost effective to rank at spot six versus spot one, I welcome your contribution. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How SERP Ranking Affects Conversion Rate: A Study"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How SERP Ranking Affects Conversion Rate: A Study"
    },
    {
      "level": "H2",
      "text": "The Data"
    },
    {
      "level": "H2",
      "text": "The Results:"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Nate Schrader\n          \n            Nate Schrader\n          \n            Nate Schrader"
}