{
  "url": "https://moz.com/blog/how-to-get-backlinks-2021",
  "slug": "how-to-get-backlinks-2021",
  "title": "How to Get Backlinks in 2021 [Series Part 2: Prospecting] — Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As we head into 2021, the work of reclaiming lost links and building new ones remains crucial. In this week's brand new episode of Whiteboard Friday, SEO expert Britney Muller is back with the second installment in her link building series, this time walking us through some tips and tricks for an…",
  "content": "How to Get Backlinks in 2021 [Series Part 2: Prospecting] — Whiteboard Friday Link Building | Whiteboard Friday By: Britney Muller November 20, 2020 Table of Contents Copied! By: Britney Muller November 20, 2020 How to Get Backlinks in 2021 [Series Part 2: Prospecting] — Whiteboard Friday Link Building | Whiteboard Friday As we head into 2021, the work of reclaiming lost links and building new ones remains crucial. In this week's brand new episode of Whiteboard Friday, SEO expert Britney Muller is back with the second installment in her link building series, this time walking us through some tips and tricks for an important part of your link building journey: link prospecting. Click on the whiteboard image above to open a high resolution version in a new tab! Video Transcription Hey, Moz fans. Welcome to another edition of Whiteboard Friday. Today me and my space buns are taking you into the future to evaluate link prospecting, a really important part of link building. This is part of my link building series. If you missed the first video, definitely go check it out. It's all around no-brainer link building. It's the easiest thing you can possibly do today to reclaim and score some backlinks for your website. So super helpful. Check that out. What are your business goals? To kick things off, this gets a little overwhelming. There are so many ways that you can prospect backlinks today that it can get a little intimidating. So if you start to find yourself going down a rabbit hole or getting overwhelmed, fall back on this button here. Just think about your business goals. What are your website's goals, and is the path that you're falling down conducive to that? Is it helpful? So that kind of just helps you course correct. I use it all the time, and I still manage to go down tons of rabbit holes. But it can be quite helpful. Link prospecting So there are really two ways to do link prospecting. One is to evaluate what's worked well in the past. How have websites in this particular industry gotten links in the past? The second is where are there content gaps? Where are there some opportunities to create wanted or desired content for a particular space? Explore competitive backlinks Let's go down the first one. So one of the more popular ways is to use a backlink tool to evaluate competitive backlinks. So not only are you evaluating the backlinks to Competitor A and Competitor B, but you can start to do some fun things with the intersection of these. So what we're looking at is: What are the shared backlinks that Competitor A and Competitor B both have that you don't? What does that look like? If these websites are linking to both A and B, why couldn't they also potentially link to you? Those tend to be more promising backlink prospects. It's also very easy to use a tool like Link Intersect, my all-time favorite, within Moz Pro to very, very quickly identify what those opportunities are. From there, you can also start to evaluate old or outdated linked to content. This is really just sort of setting the stage and better understanding again what's worked well in the past. What are the top pages that are linked to for Competitor B and Competitor A? What kind of content is that? Is there anything that's incredibly outdated that has a ton of backlinks to it, where you could potentially update it and encourage those sites to link to you? There are tons of very interesting and fun ways to explore that. Link Explorer, I mean, honestly so, so powerful and easy to quickly filter and sort different opportunities there. Leverage advanced search operators Third is to leverage advanced search operators. Now I'm not going to go through all the operators I listed here. I got a little nuts. But some important ones to remember is that if you use quotes, those words have to be in the search results. So here I'm looking for dog training, and then it must include statistics, tips, resources, news. Why am I looking for these first and foremost? Because these keywords, they carry link intent. People doing particular searches around something something statistics are more likely to link to one of those resulting pages than your average dog training search that just might be people putting material together or referencing things. So it's really great to sort of bake in your link building plan with keywords that have link intent. It just makes so much sense. You can also use intext:, which just means show me results that include this within the text, and here I have \"links.\" It sounds super old school, but there are still lots of pages that use links within the page to identify resources moving forward. You can also use the minus to exclude results from a particular URL. We're going to link to Moz's Advanced Search Operator Guide. It's super helpful. It has all of these and more. Definitely play around. Leave comments down below if you have other suggestions. It's super fun to kind of come up with different formulas. Evaluate link propensity Number four is to really evaluate the link propensity of these potential link targets. What I mean by that is have they linked to websites in the past? Do they never link out? Is that not a thing that these particular websites that you're finding do? It's really important, and it will help you in the long run to identify sites that are more likely to link to you. Number five, there are so many fun link discovery hacks and tricks, and it's one of my favorite conversations at SEO conventions and just in general. Discover fun hacks Everyone has really fun kind of things within their industry. One of my new favorites is for local SEO, where local links are so incredibly valuable for local SEO sites. A trick that I've discovered recently is the one and only Rand Fishkin's SparkToro tool will show you, if you put in a topic and a particular area, it surfaces what the top media outlets are for that particular area. It's incredible, especially if you're doing work for a local SEO client that isn't where you live or you don't have all that awareness of it. It's extremely insightful. So a fun little trick there. I want to hear your tricks down below. There are tons of others. Super fun. Content gaps Then just to briefly touch on where are the content gaps. This deserves a whole other Whiteboard Friday in and of itself. But I have mentioned them before. I am an insanely huge fan of Fractl and the work that they're doing. They use old-school journalism tactics, and they discovered that they could pull offline DUI data and bring it online in a really beautiful Tableau interface, and it did very well. They got lots of backlinks. It was very, very useful for users, and it just made sense. So I absolutely love that example. It's important to kind of look at both of these. Play around and have fun with it. Again, please leave any tips and tricks down below in the comments. I cannot wait to read them. I will see you all again soon. Thanks for watching. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Get Backlinks in 2021 [Series Part 2: Prospecting] — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Get Backlinks in 2021 [Series Part 2: Prospecting] — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "What are your business goals?"
    },
    {
      "level": "H2",
      "text": "Link prospecting"
    },
    {
      "level": "H3",
      "text": "Explore competitive backlinks"
    },
    {
      "level": "H3",
      "text": "Leverage advanced search operators"
    },
    {
      "level": "H3",
      "text": "Evaluate link propensity"
    },
    {
      "level": "H3",
      "text": "Discover fun hacks"
    },
    {
      "level": "H3",
      "text": "Content gaps"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Britney Muller\n          \n            Britney Muller"
}