{
  "url": "https://moz.com/blog/how-to-prioritize-your-link-building-efforts-opportunities",
  "slug": "how-to-prioritize-your-link-building-efforts-opportunities",
  "title": "How to Prioritize Your Link Building Efforts & Opportunities — Best of Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Link building is incredibly effective, but it can be intimidating and frustrating, too. In this popular Whiteboard Friday, Rand Fishkin builds out a framework you can start using today to simplify the link building process for everyone involved.",
  "content": "How to Prioritize Your Link Building Efforts & Opportunities — Best of Whiteboard Friday Link Building | Whiteboard Friday By: Rand Fishkin September 11, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 11, 2020 How to Prioritize Your Link Building Efforts & Opportunities — Best of Whiteboard Friday Link Building | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. We all know how effective link building efforts can be, but it can be an intimidating, frustrating process — and sometimes even a chore. In this popular Whiteboard Friday originally published in 2017, Rand Fishkin builds out a framework you can still use today to streamline and simplify the link building process for you, your teammates, and yes, even your interns. Click on the whiteboard image above to open a high-resolution version in a new tab! Video Transcription Howdy, Moz fans, and welcome to another edition of Whiteboard Friday. As you can see, I'm missing my moustache, but never mind. We've got tons of important things to get through, and so we'll leave the facial hair to the inevitable comments. I want to talk today about how to prioritize your link building efforts and opportunities. I think this comes as a big challenge for many marketers and SEOs because link building can just seem so daunting. So it's tough to know how to get started, and then it's tough to know once you've gotten into the practice of link building, how do you build up a consistent, useful system to do it? That's what I want to walk you through today. Step 1: Tie your goals to the link's potential value So first off, step one. What I'm going to ask you to do is tie your SEO goals to the reasons that you're building links. So you have some reason that you want links. It is almost certainly to accomplish one of these five things. There might be other things on the list too, but it's almost always one of these areas. A) Rank higher for keyword X. You're trying to get links that point to a particular page on your site, that contain a particular anchor text, so that you can rank better for that. Makes total sense. There we go.B) You want to grow the ranking authority of a particular domain, your website, or maybe a subdomain on your website, or a subfolder of that website. Google does sort of have some separate considerations for different folders and subdomains. So you might be trying to earn links to those different sections to help grow those. Pretty similar to (A), but not necessarily as much of a need to get the direct link to the exact URL.C) Sending real high-value traffic from the ranking page. So maybe it's the case that this link you're going after is no followed or it doesn't pass ranking influence, for some reason — it's JavaScript or it's an advertising link or whatever it is — but it does pass real visitors who may buy from you, or amplify you, or be helpful to achieving your other business goals.D) Growing topical authority. So this is essentially saying, \"Hey, around this subject area or keyword area, I know that my website needs some more authority. I'm not very influential in this space yet, at least not from Google's perspective. If I can get some of these links, I can help to prove to Google and, potentially, to some of these visitors, as well, that I have some subject matter authority in this space.\"E) I want to get some visibility to an amplification-likely or a high-value audience. So this would be things like a lot of social media sites, a lot of submission type sites, places like a Product Hunt or a Reddit, where you're trying to get in front of an audience, that then might come to your site and be likely to amplify it if they love what they see. Okay. So these are our goals. Step 2: Estimate the likelihood that the link target will influence that goal Second, I'm going to ask you to estimate the likelihood that the link target will pass value to the page or to the section of your site. This relies on a bunch of different judgments. You can choose whether you want to wrap these all up in sort of a single number that you estimate, maybe like a 0 to 10, where 0 is not at all valuable, and 10 is super, super valuable. Or you could even take a bunch of these metrics and actually use them directly, so things like domain authority, or linking root domains to the URL, or page authority, the content relevance. You could be asking: Is this a nofollowed or a followed link?Is it passing the anchor text that I'm looking for or anchor text that I control or influence at all?Is it going to send me direct traffic? If the answers to these are all positive, that's going to bump that up, and you might say, \"Wow, this is high authority. It's passing great anchor text. It's sending me good traffic. It's a followed link. The relevance is high. I'm going to give this a 10.\" Or that might not be the case. This might be low authority. Maybe it is followed, but the relevance is not quite there. You don't control the anchor text, and so anchor text is just the name of your brand, or it just says \"site\" or something like that. It's not going to send much traffic. Maybe that's more like a three. Then you're going to ask a couple of questions about the page that they're linking to or your website. Is that the right page on your site? If so, that's going to bump up this number. If it's not, it might bring it down a little bit.Does it have high relevance? If not, you may need to make some modifications or change the link path.Is there any link risk around this? So if this is a — let's put it delicately — potentially valuable, but also potentially risky page, you might want to reduce the value in there. I'll leave it up to you to determine how much link risk you're willing to take in your link building profile. Personally, I'm willing to accept none at all. Step 3: Build a prioritization spreadsheet Then step three, you build a prioritization spreadsheet that looks something like this. So you have which goal or goals are being accomplished by acquiring this link. You have the target and the page on your site. You've got your chance of earning that link. That's going to be something you estimate, and over time you'll get better and better at this estimation. Same with the value. We talked about using a number out of 10 over here. You can do that in this column, or you could just take a bunch of these metrics and shove them all into the spreadsheet if you prefer. Then you have the tactic you're going to pursue. So this is direct outreach, this one's submit and hope that it does well, and who it's assigned to. Maybe it's only you because you're the only link builder, or maybe you have a number of people in your organization, or PR people who are going to do outreach, or someone, a founder or an executive who has a connection to some of these folks, and they're going to do the outreach, whatever the case. Then you can start to prioritize. You can build that prioritization by doing one of a couple things. You could take some amalgamation of these numbers, so like a high chance of earning and a high estimated value. We'll do some simple multiplication, and we'll make that our prioritization. Or you might give different goals. Like you might say, \"Hey, you know what? (A) is worth a lot more to me right now than (C). So, therefore, I'm going to rank the ones that are the (A) goal much higher up.\" That is a fine way to go about this as well. Then you can sort your spreadsheet in this fashion and go down the list. Start at the top, work your way down, and start checking off links as you get them or don't get them. That's a pretty high percentage, I'm doing real well here. But you get the idea. This turns link building from this sort of questionable, frustrating, what should I do next, am I following the right path, into a simple process that not only can you follow, but you can train other people to follow. This is really important, because link building is an essential part of SEO, still a very valuable part of SEO, but it's also a slog. So, to the degree that you can leverage other help in your organization, hire an intern and help train them up, work with your PR teams and have them understand it, have multiple people in the organization all sharing this spreadsheet, all understanding what needs to be done next, that is a huge help. I look forward to hearing about your link building prioritization, goals, what you've seen work well, what metrics you've used. We will see you again next week for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com To help us serve you better, please consider taking the 2020 Moz Blog Reader Survey, which asks about who you are, what challenges you face, and what you'd like to see more of on the Moz Blog. Take the Survey Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Prioritize Your Link Building Efforts & Opportunities — Best of Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Prioritize Your Link Building Efforts & Opportunities — Best of Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Step 1: Tie your goals to the link's potential value"
    },
    {
      "level": "H2",
      "text": "Step 2: Estimate the likelihood that the link target will influence that goal"
    },
    {
      "level": "H2",
      "text": "Step 3: Build a prioritization spreadsheet"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}