{
  "url": "https://moz.com/blog/how-to-brand-and-grow-your-company-through-marketing",
  "slug": "how-to-brand-and-grow-your-company-through-marketing",
  "title": "How To Brand and Grow Your Company Through Marketing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The days of SEO being all about gaming the search engines to rank for terms are over. To truly win in the long term, we have to focus on building branded traffic. This is especially true of small companies and startups.",
  "content": "How To Brand and Grow Your Company Through Marketing Branding By: John Doherty November 12, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: John Doherty November 12, 2012 How To Brand and Grow Your Company Through Marketing Branding The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Companies want to grow. Obvious statement, right? This is the reason why we all have jobs as marketers; companies need to grow and they need people who understand how to do that. I have a startup client who uses this as one of their mantras: I think it's true. Today I want to talk about how small businesses and startups can grow their brand company through smart marketing even when they don't have a huge budget. Let me also say that I have stopped telling companies \"Oh sure, we'll get you ranking for (insert keyword here),\" because that's a small-minded approach to marketing and growing a company (especially a startup). I now tell startups to focus on growing their branded traffic, because that is ultimately how you get links, mindshare, and win online. This advice has only increased since the Penguin and Panda algorithms started rolling out. We're not seeking to trick or game the search engines; we're seeking to build brands online. Here are a few ways to build branded mindshare. Produce content As Will Critchlow said in his SearchLove presentation (embedded at the bottom), you don't have to have money, but you do have to have one of these: Time Talent Balls (aka take risks) Often, what you need to do first is establish your thought leadership, and that is done through content. Some of my favorite examples are MailChimp's Resources: And Grovo's resources: I also respect what the founders of BufferApp have done by getting content all around the Internet to grow their startup. They've written on leading blogs such as ProBlogger, and now they're even being asked to do interviews, such as this one from Blueglass. Leverage channels other than search When looking to grow your company, you should not just leverage search (though it is a great medium for growth). For more on this idea, read Matt McGee's classic You Can Diversify or You Can Die from 2007. We have so many channels to leverage for growth at this point on the Internet. You've all seen this: I also want you to think about how you can use other platforms, such as forums or social networks, to tell a story and get attention. For example, Grovo built out their History of the Internet on their Facebook Timeline: When they launched it, they did outreach through PR and got exposure (and links) from all these places and more, driving over 300 signups: Their branded traffic increased after being flat, and has kept increasing to this day: Have a spokesperson Having a spokesperson, or public face, is highly underrated by most companies. Potential customers don't (usually) connect with a brand, but they do connect with a person. Would SEOmoz have grown its community, consulting, or software as quickly without Rand as the face of the company? I don't think so. In fact, his author page is the 8th most linked-to page on SEOmoz. There are many ways companies can get their spokesperson (a CEO, a CMO, an awesome consultant) known: Meetups Conferences Blogging Presentations Social media Q/A Forums (like Moz Q/A) Engaging in online conversations (forums, blog commenting, social media) Display these people prominently on your website. Get real This goes along with the spokesperson point above, but one of the best ways to start getting your company known is to be involved locally. I don't care if you are a tech startup or an international pharmaceutical brand - being involved in your local as well as online community is one of the best ways to build your branded searches and brand advocates. Here's one example: Yes, yes, SEOmoz is doing marketing that increases their branded searches (for both SEOmoz AND Mozcation). They're not trying to get us to link to them saying \"SEO software,\" either :-) Be lovable I've often challenged clients with \"What makes your customers happy, and what is going to make your brand lovable?\" In my opinion, there is nothing worse than a faceless brand. It's not trustworthy, it's not likable, it's not fun. Even if you are in a serious industry, you can have a brand that people love because they connect with it. For example, do you know this guy? Or this guy: Or this gal: Mailchimp has Freddie, and they've even sent out large plush versions such as this one in SwissMiss's studio in Brooklyn: We associate the face or mascot with the brand. It's called affinity and it works. Look for search opportunity Finally, one way to do this in the search results (see, we're still talking about SEO as it pertains to marketing) is to look for areas of opportunity. What are your competitors not doing that you can do? Are they not marking up their sites with Schema? Are they not leveraging image search? How about videos and video snippets in the search results? That's where you need to go. And use Tom Anthony's SERP Turkey to test if the investment to get those results is worthwhile. Will Critchlow and Rand Fishkin's presentations from SearchLove To wrap all this up, I'd like to leave you with a few thoughts. Building branded searches, honestly, is harder than building rankings. Branding is a longterm play, and it's not something that you can do overnight to gain traction. If you're looking for a quick hit to suddenly get a lot of users, branding isn't your answer. But ultimately, it's the right answer for growth and a successful business. I'd also like to leave you with a couple of presentations about inbound marketing on a budget. This kind of inbound marketing will also win you branded searches. Will and Rand went head to head, as they are known to do at Distilled's conferences, about \"Inbound Marketing on a Shoestring Budget\". Both had stellar presentations, so I wanted to provide them here for you to flip through and get more ideas: Can't Buy Me Love from Rand Fishkin Inbound on a shoestring - Searchlove Boston from Will Critchlow Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How To Brand and Grow Your Company Through Marketing"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How To Brand and Grow Your Company Through Marketing"
    },
    {
      "level": "H2",
      "text": "Produce content"
    },
    {
      "level": "H2",
      "text": "Leverage channels other than search"
    },
    {
      "level": "H2",
      "text": "Have a spokesperson"
    },
    {
      "level": "H2",
      "text": "Get real"
    },
    {
      "level": "H2",
      "text": "Be lovable"
    },
    {
      "level": "H2",
      "text": "Look for search opportunity"
    },
    {
      "level": "H2",
      "text": "Will Critchlow and Rand Fishkin's presentations from SearchLove"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Getting Buy-In for Customer Stories — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Local Brand Loyalty Takeaways From That Time Ace Hardware Was Trending"
    },
    {
      "level": "H3",
      "text": "How to Build a Strong Brand Moat With SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "John Doherty\n          \n            John Doherty\n          \n            John Doherty"
}