{
  "url": "https://moz.com/blog/how-to-identify-your-ecommerce-product-page-keywords-using-mozbar",
  "slug": "how-to-identify-your-ecommerce-product-page-keywords-using-mozbar",
  "title": "How to Identify Your E-Commerce Product Page Keywords Using MozBar - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Which keywords are right for your e-commerce product pages? Brian Childs walks you through how to simplify your research process on-the-go with the SEO toolbar.",
  "content": "How to Identify Your E-Commerce Product Page Keywords Using MozBar E-Commerce SEO | Keyword Research By: Brian Childs January 19, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Brian Childs January 19, 2017 How to Identify Your E-Commerce Product Page Keywords Using MozBar E-Commerce SEO | Keyword Research The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. A common challenge when doing SEO for e-commerce sites is deciding how to choose keywords for product pages. When it comes to e-commerce in particular, there's always that question on a page-by-page basis of “Which keyword is right for this page?” Especially for existing sites that need an SEO update, finding time to do page-specific keyword research can be burdensome. But product pages deserve every ounce of SEO they can get. Today, I’ll show you a way to make your e-commerce product page keyword research a lot easier. My secret weapon? MozBar. By the end of this post, you'll discover how you can easily: Look at the results for keywords related to your topic and get a sense of which words deliver the most similar results Get a sense for how search engines might see your term versus others Find related topics that deliver similar results, note those words, and then use them on your page Save time identifying what represents a good keyword and whether the results match your expectations Let me show you how. What makes a good SEO e-commerce keyword?Since e-commerce pages often have direct competition from other websites, you need to go above and beyond when it comes to optimization. You'll want to make sure you take into consideration not only the search intent of your desired customer, but also verify that the keyword you choose is actually delivering similar results in the SERP. When people search for products, you want to measure how narrow you have to go before a search result page starts displaying products similar to what you have. For this example, I’ll use an e-commerce site that sells macbook and car decals. Think of all the different variants of those two broad search terms. There are 12 different subcategories of car decals alone. One category is family decals, which allows a person to pick and choose amongst individual icons to create a customized family to display on the back of your minivan. For this family decal segment, there are dozens of different individual product pages, so the goal is to make sure we optimize not just for a broad term like “car decal” but for a more nuanced term like “family car decal.” And then for the products themselves, dig into modifying terms relevant to the features. Use MozBar to save time researching SEO e-commerce keywordsA common way to figure out what's showing up for a search term is to just run a search query. But when you have thousands of pages, this can take forever. This is where the MozBar Page Optimization feature really helps you get the job done. It allows you to stay on the website to do analysis without jumping between tabs to run search queries. Let's go through the steps. 1. First, of course, download the MozBar extension for Google Chrome (I’ll wait). 2. Next, go to your product page and activate your MozBar extension by selecting the icon until it turns blue (there are three statuses, FYI — on, DA mode, and off). 3. Then, select the Page Optimization icon near the top-left of your browser window. The icon looks like a little page with a circle in the corner: 4. A small text box window will appear. You'll want to have a list of terms ready to go, so if you haven’t done your keyword research yet, head over to Keyword Explorer and use the \"Suggestions\" tool to get some preliminary ideas. I usually enter a broad category-level keyword, then select “Optimize\": In addition to all the normal great stuff that MozBar provides, such as Domain Authority and Page Authority, the Page Optimization tool also gives you a quick overview of how well this individual page is optimized for the term you're researching. This is similar to the information you'd get in the Moz Pro Campaign tools, but here you can see it for any page without having to have Moz open in another tab. 5. Once you've entered your search term, select the “On-Page Content Suggestions” tab: The On-Page Content Suggestions tab shows you a list of keywords that the search engines typically associate with the term you entered. Think of this as other planets in the same constellation as the keyword you entered. You can use these generally to understand what additional words to put on your page, but you can also use them to identify the target keyword for the page overall. Here's where this gets awesome. Prepare to shave minutes off of your normal workflow. Aligning search intent with e-commerce keywords Starting with your highest-value products, navigate to the product page, open up MozBar, enter in your broad target keyword for the associated category, and then select the On-Page Content Suggestions tab. Then, look for the keywords from the list that appear most aligned with your specific product. In this example, we're looking at a family car decal product that exists in a broader category of car decals. The question to ask is: Which keyword displays products that are most similar to your product? If you can find results that align closely with your product, then you can understand something about how search engines are interpreting the term and have a higher chance of optimizing for the right keywords. To see which pages are ranking for a given suggested keyword, simply select the “See top ranking URLs” dropdown. It will display the URL and rank position of sites delivering content similar to your initial target search term: Using this example, you can interpret that “family stickers” definitely delivers results closely aligned with this product. Note that this correlates to the blue \"Relevance\" bar associated with that suggested keyword. Make a note of the terms that are providing highly aligned search results pages, and then move onto the next product page. Once you have your list compiled, you'll be able to be more selective and informed with your page optimization choices. I hope you find this e-commerce keyword trick helpful. Let me know in the comments section of this article! Bonus tip for making your life easy:When doing this kind of research, I recommend saving yourself some time down the road by copying the URLs that show up in the On-Page Content Suggestions tab into a new spreadsheet or document. You can compile and research these URLs later using Open Site Explorer. When it comes time to think about building links to my optimized pages, you'll have a ready list of competitors to analyze. Look at their Inbound Links, Top Pages, and Anchor Text in Open Site Explorer in order to create a list of potential linking sites and content ideas. Get started with MozBar for Chrome If you're interested in more keyword research strategies, consider signing up for a Keyword Research Workshop in the Moz Training site. For a deeper dive on MozBar, sign up for our January 24 webinar! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Identify Your E-Commerce Product Page Keywords Using MozBar"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Identify Your E-Commerce Product Page Keywords Using MozBar"
    },
    {
      "level": "H2",
      "text": "What makes a good SEO e-commerce keyword?"
    },
    {
      "level": "H2",
      "text": "Use MozBar to save time researching SEO e-commerce keywords"
    },
    {
      "level": "H2",
      "text": "Aligning search intent with e-commerce keywords"
    },
    {
      "level": "H2",
      "text": "Bonus tip for making your life easy:"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Common Mistakes E-commerce Websites Make Using JavaScript"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Brian Childs\n          \n            Brian Childs\n          \n            Brian Childs"
}