{
  "url": "https://moz.com/blog/how-not-to-request-a-link-via-email",
  "slug": "how-not-to-request-a-link-via-email",
  "title": "How NOT to Request a Link Via Email - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I still have my first ever email account, a Hotmail account that's older than most of the kids on Digg nowadays. Today I logged in to retrieve a lost password and saw that I had over 600 new emails. All of them are spam, newsletters, shopping deals, etc--I rarely get \"legit\" emails sent to that…",
  "content": "How NOT to Request a Link Via Email Link Building By: Rebecca Kelley April 7, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley April 7, 2009 How NOT to Request a Link Via Email Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I still have my first ever email account, a Hotmail account that's older than most of the kids on Digg nowadays. Today I logged in to retrieve a lost password and saw that I had over 600 new emails. All of them are spam, newsletters, shopping deals, etc--I rarely get \"legit\" emails sent to that account since the vast majority of my contacts know to reach me at my Gmail or SEOmoz email address. So it was with great amusement that I saw an email from 1/29/09 titled \"Link Exchange Request\" from some dude named Scott (not our Scott, don't worry). I've shared the email below: Dear owner of https://moz.com I'm the webmaster of [site redacted]. We came across your site on the Internet and feel that it would fit perfectly into our collection of quality links at [redacted]. The Google PR of this site is currently 2. We've already placed a link to your web site along with a description at our site on the page, which we encourage you to check for accuracy. We'd appreciate it if you place a link back to our site using the following HTML code (just copy and paste it into your links page): <a href=\"[redacted]\" title=\"[redacted] showcases the coolest SEO sites, offering tools and tips for optimization, marketing online and webtraffic.\">Showcasing the coolest SEO sites and marketing online.</a> <br>[redacted] showcases the coolest SEO sites, offering tools and tips for optimization, marketing online and webtraffic. On your page, the code will look like this: Showcasing the coolest SEO sites and marketing online. [redacted] showcases the coolest SEO sites, offering tools and tips for optimization, marketing online and webtraffic. If you'd like the description of your site modified, the category changed, or if you have any other cross-promotion ideas, feel free to email us. Please note that if you don't place a reciprocal link to us somewhere on your site within a week, the link to your site will automatically be removed from our directory. Please link to us using the code above, and let us know where we can find the link. Best regards, Scott [email address redacted] This is NOT SPAM -- this is a one-time reciprocal link request. We have NO INTENTION to email you again. You can also reply to this email with REMOVE in the subject line. I can create a laundry list of don'ts based on this email alone: \"Dear owner of seomoz.org\" screams either \"spam\" or \"I'm too lazy to look for an actual contact.\" Personalize your emails if you can. We have an entire Staff page full of smiling people with names and contact info, for crying out loud. (I have no idea why this dude emailed my Hotmail account, but whatever.) Mentioning Google PR is, in my opinion, tacky. It places an over-emphasis on the importance of PageRank and also, to me, identifies the email sender as someone with very little to no knowledge of decent SEO skills. Saying \"we've already placed a link to your website\" is a bit bullying and doesn't sit well with me. I'm thinking, \"I didn't even ask for this link, so why should I feel obligated to link to you, especially when I don't even know you?\" Pasting the HTML code and then explaining how the code will look on our page is just downright insulting. I mean, he's emailing the \"owner of SEOmoz.org,\" so you'd think that he'd give me the benefit of the doubt and figure I know how to read basic HTML code and how to link out to someone. Instead, he uses some dumbed down template without doing his homework and adapting his message to a more savvy audience. This anchor text and description are just ridiculous. \"Please note that if you don't place a reciprocal link to us somewhere on your site within a week, the link to your site will automatically be removed from our directory\" is, again, kind of bullying. The tone is imposing and vaguely threatening. Me no likey. \"This is NOT SPAM -- this is a one-time reciprocal link request. We have NO INTENTION to email you again\" makes me instantly suspect that it is spam. It's kind of like saying, \"Don't look at the gigantic zit on my face!\" Well now you HAVE to look at it, right? So did he email me again, or did Scott keep his promise? So Scott emailed me 8 times in a little under 3 months. The second email, titled \"Backlink Request Reminder,\" is pasted below: Dear owner of https://moz.com Did you happen to see my previous email? I'm the webmaster of [redacted] and just wondering if you are interested in link exchange with us. We feel that your site would fit perfectly into our collection of quality links at [redacted]. The Google PR of this site is currently 0. A week ago we already placed a link to your web site along with a description at our site on the page, which we encourage you to check for accuracy. We'd appreciate it if you place a link back to our site using the following HTML code (just copy and paste it into your links page): <a href=\"[redacted]\" title=\"[redacted] showcases the coolest SEO sites, offering tools and tips for optimization, marketing online and webtraffic.\">Showcasing the coolest SEO sites and marketing online.</a> <br>[redacted] showcases the coolest SEO sites, offering tools and tips for optimization, marketing online and webtraffic. On your page, the code will look like this: Showcasing the coolest SEO sites and marketing online. [redacted] showcases the coolest SEO sites, offering tools and tips for optimization, marketing online and webtraffic. Please note that if you don't place a reciprocal link to us somewhere on your site within three days, the link to your site will automatically be removed from our directory. Please link to us using the code above, and let us know where we can find the link. Best regards, Scott [redacted] This is NOT SPAM -- this is a one-time reciprocal link request. We have NO INTENTION to email you again. You can also reply to this email with REMOVE in the subject line to make sure we'll NEVER send you any more e-mails in the future. Okay, contrary to how Scott is ending his emails, this is clearly spam (either that, or he's a super lazy link builder and uses the same template each time he emails someone). I do like how this email starts with \"Did you happen to see my previous email?\" and then proceeds to have virtually the same content as last email. I guess Scott's betting that I did not see his previous email. (He lost that bet.) Also, I like how the PR of the page he's trying to build links to has dropped from 2 to 0 in the three days that had passed since he last emailed me. This is why you don't list your page's PR in link building email requests, people. Talk about awkward. Here's his third email: Dear owner of https://moz.com I'm the webmaster of [redacted]. I'm pleased to inform you that your link was added to our site on the [redacted] page with the following description: URL: https://moz.com Title: SEO - Search Engine Optimization | Read SEOmoz, Rank Better Description: SEOmoz is a hub for the search marketing industry, providing an SEO Services Marketplace, a popular SEO Blog, SEO Tools and premium content. If you'd like the description of your site modified, the category changed, or if you have any other cross-promotion ideas, feel free to email us. Please keep the link to [redacted]. We have software in place that automatically monitors the status of all our links. Should you remove the link to our site by accident or in error, or if the link to our site has been moved elsewhere, please let us know immediately. Otherwise, the link to your site at [redacted] will be deleted after 3 days. Best regards, Scott [redacted] Hey, he's linked to us, despite me never responding to his first two emails! How thoughtful of him! He also mentions how he supposedly has software that monitors his site's links and that he'll delete the link to our site if we don't link back within 3 days. I checked the page from where he supposedly linked to us, and lo and behold I indeed saw a link to SEOmoz...although it's still there after over 2 months, so I guess that whole \"deleted after 3 days\" claim is an empty threat. Oh, and I like how Scott's stopped ending his emails with \"This is not spam!\" I figured he was like, \"Who am I kidding, I'm a huge spammer\" and came to terms with it. My buddy Scott was quiet for a month, then it was lather, rinse, repeat. I received another \"Link Exchange Request\" email on 3/4/09 that was identical to the first email he sent me. Two days after that, he sent me Email #5 and went with a new approach: Dear owner of https://moz.com I have a web site, [redacted], and have spent a lot of time and effort to ensure my visitors gain the maximum benefit from their visit, and from what I have to offer. As our web sites are closely related and our products do not compete, I feel the exchanging of links would be a mutually beneficial arrangement. If you are interested in exchanging links, please feel free to contact me at your earliest convenience. Best regards, Scott [redacted] Okay, this email is pretty much making me do all the work. You're the one who wants the link, so why are you making me contact you? Flatter me a little--talk about how much you like my site, outline how you've got a similar site and would love for me to take a look at it, point me in the direction of a specific blog post or article, ask me to review or provide feedback, grovel for a link, etc. Ass kissing gets you far in the world of building links. Emails 6 and 7 were identical to Email #3, and Email #8 was identical to Email #2 (confusing, I know). I never respond to Scott's requests, so naturally he assumes I'm still interested and keeps spamming me with automatic link request emails a few times a month. You gotta love that tenacity! Even though it seems clear that I'm on some sort of automated spam list, a main lesson to be derived from Scott's Memento-esque emails is that you should keep track of who you've sent requests to. Maintain a spreadsheet or a list of contacts and keep track of your efforts. When I first started working at SEOmoz, I was tasked with building links for one of our clients. Below is a screenshot of an example spreadsheet I created: This particular client had a lot of user generated pages, so I contact these users to see if they were willing to link to their page from a personal website or blog. I color coded responses--blue and green were \"Yes\" as in we were able to get a link (I don't remember what the difference between blue and green were, though I probably had a good reason for it 3 years ago), yellow was \"N/A,\" meaning the contact didn't have a website, and red was \"No\" if we couldn't get a link or if the link couldn't pass any value for whatever reason. I created a lot of basic spreadsheets similar to this one, where I'd have info on the page from where I was trying to obtain a link, contact info, how many times I contacted someone, whether I received a response and what the response was, and if I was able to get a link to the site. Being organized minimizes sloppy mistakes like contacting the same person more than once with the same introductory email. In 2007 Melanie Nathan authored a fantastic post for YOUmoz about creating and managing your link campaign, which is a great resource on how to get organized and keep track of your link building efforts. Sorry Scott, but you lose. This isn't the best way to go about getting a link from us. While I don't doubt that this tactic has resulted in some success (otherwise why would he keep doing it?), if you've got a remotely reputable site or any pride whatsoever, you won't go about acquiring your links this way, lest you want to be ridiculed for being unprofessional, spammy, and a dumb-ass. I still think that contacting site owners and webmasters for links is an important strategy, but there definitely are better ways to craft your link request campaign than the one I highlighted in this post. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How NOT to Request a Link Via Email"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How NOT to Request a Link Via Email"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}