{
  "url": "https://moz.com/blog/how-to-use-traffic-from-google-images-to-build-links-to-your-site",
  "slug": "how-to-use-traffic-from-google-images-to-build-links-to-your-site",
  "title": "How to use traffic from Google Images to build links to your site - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Caydel published a great post a few weeks ago detailing how you can get better rankings in Google Images but some of the comments showed that people don't really think Google Images traffic is high quality and that nobody really knows how to make the most of it.A few months ago I was think...",
  "content": "How to use traffic from Google Images to build links to your site Link Building P By: Patrick Altoft June 20, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! P By: Patrick Altoft June 20, 2007 How to use traffic from Google Images to build links to your site Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Caydel published a great post a few weeks ago detailing how you can get better rankings in Google Images, but some of the comments showed that people don't really think Google Images traffic is high quality and that nobody really knows how to make the most of it. A few months ago I was thinking the same thing and sat down to try and figure out what people from Google Images wanted and how I could make the best use of them. Most people using Google Images are looking for pictures to use on their websites, blogs, ebay auctions and myspace pages. Judging by my server logs most of them were hotlinking them as well. I came up with a script that forces all hotlinkers who arrive from Google, Yahoo or MSN Images to link back to my site if they want to use the image on their site. Its totally non intrusive and only appears when the user right clicks on an image within an hour of arriving from an image search engine, so your regular readers won't get upset. Some of my sites get 1000 uniques per day from image search engines, and converting even just 10% of these to links makes a huge difference. I can track links by looking at bandwidth logs and I can tell you it works like a charm. The script is available for php sites or as a Wordpress plugin, and you can see a demo video here or check this link for a working demo. Let me know what you think.:-) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to use traffic from Google Images to build links to your site"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to use traffic from Google Images to build links to your site"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Patrick Altoft\n          \n            Patrick Altoft"
}