{
  "url": "https://moz.com/blog/how-to-delegate-seo-work-effectively",
  "slug": "how-to-delegate-seo-work-effectively",
  "title": "How to Delegate SEO Work Effectively - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Feeling swamped or overwhelmed by your projects? Learn tools and tips on project management, organization, and delegation to keep your clients happy and your head clear.",
  "content": "How to Delegate SEO Work Effectively SEO Basics By: Zee Hoffmann Jones January 2, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Zee Hoffmann Jones January 2, 2017 How to Delegate SEO Work Effectively SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Whether you’re the only SEO at your company, work within a larger team, or even manage others, you still have to stay on top of your projects. Project management skills aren’t and shouldn’t be exclusive to someone (or some tool) with the title “project manager.” I believe that having good project manager skills is essential to getting work done at all, let alone delivering high-quality work in a timely and efficient way. In defense of management Freakonomics Radio released this podcast episode in October called In Praise of Maintenance. The TL;DR (or TL;DL, rather) is that our society rewards innovators, but rarely (if ever) celebrates the maintainers: the people who get sh*t done, and do it reliably, often without anyone’s noticing. This podcast episode confirmed what I’d been feeling for a long time: We don’t award enough praise to the good project managers out there who keep engagements moving forward. And that’s largely because it’s not a sexy job: it’s not exciting to report to stakeholders that necessary services that have been reliable for so long are, as always, continuing to be reliable. It’s only when things aren’t running smoothly does it seem project managers get recognition. A lack of a rewards system means that we’re not teaching PMs, Consultants, Account Managers, and more that their excellent organizational skills are their most valuable asset. Instead, the message being communicated is that innovation is the only praise-worthy result, which oftentimes may not be essential to getting your work done. The irony here is that innovation is the by-product of an excellent project management framework. The situational awareness of knowing how to delegate work to your colleagues and a repertoire of effective organizational habits is vital if you ever want to free up your attention to allow for the headspace and concentration ingenuity requires. Sound familiar? Lately I’ve been focused on the idea of a cluttered headspace, where it feels like everything on your to-do list is floating ephemerally around in your head, and you can’t seem to pin down what needs to be done. Of course, this isn’t specific to just professional life (or consulting work): it can happen with personal tasks, which can present their own set of organizational challenges. Regardless of your professional role, crunch time is exactly when you need to put on your project manager hat and get yourself organized. Read on to find out the tools and tricks I use to stay on top of my work, and how I delegate work when needed without losing a personal touch on projects. Manage projects with tools that work for you What do you do to make that process easier? One Slack conversation that seems to always come up is which project management tools do we use (and which is best). I take the annoying middle-ground stance of “whatever tool you use is best” and I stand by it (don’t worry, I’ll get to the actual list in a minute): a tool is only useful if it’s actually used. So how do you get started? It’s always important to have preferred methods for project tracking, note keeping, and reminders. Depending on your role and learning style, you may find that some tools work better than others for you. For instance, while I have a few tools I work with to stay on top of client work, I also have a clear plastic desk cover that I can jot down notes and reminders on. Here’s a breakdown of the tools I use to manage projects, and the needs they meet. Inbox by Gmail. Yes, it’s different from classic Gmail. The two greatest aspects of Inbox, in my opinion, is the ability to snooze emails until a specific day and time, and save reminders for yourself (e.g. “Check in on Ty’s progress for the page speed audit,” or “Watch the video in this link after work”). Why are these my favorite Inbox features? Both functions serve similar purposes: they tell you what you need to know, when you need to know it. The ability to snooze emails and save reminders for yourself is invaluable when we’re talking about headspace: this way, you can use your email as your to-do list for any given day. If you know you don’t have to respond to someone until X date, there’s no reason their previous email should sit in your Inbox taking up space. As a result, I use Inbox as my personal assistant to remind me when I need to jump back to a deliverable or respond to a client. It’s possible to reach Inbox zero on a given day, even if you have an email awaiting your response. Just snooze it and attend to it when you really need to. Google Drive. Sure, not a sexy or new tool, but it’s my home for everything. Not only does GDrive cover all the file types that I need (Documents, Sheets, and Presentations), it also allows for easy, real-time collaboration on files with your colleagues and clients. If you like to nudge people to do things, too, you can assign contacts work to do from your GDocs (just highlight text, click the comment icon to the right, and insert the @ symbol with their name). If you’re crafting a presentation with a colleague, for instance, you can assign slides with questions for them. I recommend tagging them with your question and including a due date for when you need their answer.Tools my colleagues love:Trello. It’s not my personal favorite, but a lot of my teammates love using Trello as their to-do lists, or even for tracking web dev or SEO projects. If you prefer text over visuals, you can also try Basecamp (which I tend to prefer).Asana. Another great project management tool — I tend to use it on a project basis rather than a to-do list. If you’re a developer, you may prefer JIRA. Of course, it’s possible to manage and delegate work without these, but I’m of the mind that pen, paper, and email can only get you so far, especially if you want your delegation process to be somewhat automated (think tagging colleagues in comments within documents, or assigning projects to them within standard project management tools like Asana). How to delegate effectively Tools can only get you so far: any good delegation process starts with a conversation (no more than five or 10 minutes) about the work you need and a great brief. The conversation establishes whether your colleague actually has the bandwidth to take your work on, and the brief goes into greater detail of what you actually need done. The brief format I follow works for a large number of different deliverables — I’ve used this same layout to delegate page speed, technical and backlink audits, and content briefs to colleagues. Below are the fields I always include, and the type of information always provided: Subject: [BRIEF] Work I Need Done Deadline: The precise date and time you need it, with enough time for you to review the work before delivering it to your stakeholders or your client. If it’s something like a page speed audit, I would allow up to a full week to review it and ensure that it’s in the best format and all the information is correct. Of course, it also depends on how familiar the delegate is with projects like these — if they’ve done a number of audits for you in the past, they may know your style and you may not need as much time to edit their final work. Output/Deliverable: The format in which you need this work delivered to you. Maybe it’s a Google Doc or an Excel Spreadsheet. This brief format can work for any output you need, including more creative pieces (do you need a video edited to :30 seconds in a .mov format? A photo edited to certain specs and saved as a PNG or IDD?). Expected hours: This may be the most challenging element of the entire brief. How long do you anticipate this work to take, start to finish? Keep in mind the experience level of the person to whom you’re delegating. Is this their first SEO technical audit, or their 30th? You will almost definitely need to check in with your delegate a few times (more on that later), so how long do you anticipate these meetings to take? Just like the deadline timing estimate, use your best judgment based on work you’ve done with this person in the past, and the type of work you’re assigning. Relevant materials: This is where you can provide additional articles or tools that should help your colleague do the work you’ve assigned to them. Some good examples are 101 articles (like ones on the Moz blog!), or a tool you know you always use in projects like the one you’re delegating (think SEMRush, new photo editing software, or Google’s Keyword Planner). Check in with your delegate along the way Once you’ve delivered your brief, the next step is to make sure you check in with your delegate along the way. Even the most experienced person can benefit from added context, so whether it’s an in-person meeting or a five-minute call, touching base shortly after delivering a brief is necessary to ensure you’re on the same page. Beyond kicking off a project, it’s important to have check-ins along the way to stay on track. At Distilled, we like to follow a check-in model at the following completion points: 1% (kickoff conversation); 5% (validation of process); 30% (ensure you’re on the right track before you invest too much time into the project); and 90% (final editing and proofing). Not only is this good to keep everyone on the right track, it’s even more valuable both to the person delegating and the delegate to know how much work should be completed at which points, and how much detail is required as you give feedback. In many ways, great project management and delegation skills are really future-proofing skills. They allow you to be on top of your work regardless of what work (or life) throws at you. You can be the best SEO in the world, but if you can’t manage your projects effectively, you’ll either fail or not see the greatest impact you otherwise could achieve. It’s time to ditch praising the model of a lone innovator who somehow “does it all,” and instead truly celebrate the maintainers and managers who ensure things remain operational and steady. Often, our biggest problems aren’t best solved with a complex solution, but rather a clear mind and supportive team. A large part of turning projects around comes down to improving the project management process, and being organized allows you to juggle multiple clients and acknowledge when you’re at capacity. Without a solid foundation of project management skills, there is no groundwork for successful innovations and client projects. The next time you’re looking to bolster your skill set, do an audit of how you manage your own work, and identify all of the things that prevent you from delivering the best work on time. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Delegate SEO Work Effectively"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Delegate SEO Work Effectively"
    },
    {
      "level": "H2",
      "text": "In defense of management"
    },
    {
      "level": "H2",
      "text": "Manage projects with tools that work for you"
    },
    {
      "level": "H2",
      "text": "How to delegate effectively"
    },
    {
      "level": "H3",
      "text": "Check in with your delegate along the way"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Zee Hoffmann Jones\n          \n            Zee Hoffmann Jones\n          \n            Zee Hoffmann Jones"
}