{
  "url": "https://moz.com/blog/how-seo-usability-finally-became-friends",
  "slug": "how-seo-usability-finally-became-friends",
  "title": "How SEO & Usability Finally Became Friends - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Flash back with me to 1999. You’re a hapless web designer, and you’ve just spent a long day convincing your boss that just because hot pink is his favorite color doesn’t mean it’s the best bet for your financial services website. You haven’t even begun to sort out how you’re going to break it to…",
  "content": "How SEO & Usability Finally Became Friends Marketing Psychology By: Dr. Peter J. Meyers March 2, 2007 Table of Contents Copied! By: Dr. Peter J. Meyers March 2, 2007 How SEO & Usability Finally Became Friends Marketing Psychology Flash back with me to 1999. You’re a hapless web designer, and you’ve just spent a long day convincing your boss that just because hot pink is his favorite color doesn’t mean it’s the best bet for your financial services website. You haven’t even begun to sort out how you’re going to break it to him that getting good placement on the search engines will mean rewriting all of his copy, stripping out the dancing hamsters, and spending hours on these invisible things called <META> tags. In the throes of your despair, your sales team barges into your office, complaining that the new design just isn’t “user friendly”. Quietly, you reach for the gun in your top drawer... If only tragedies like these could have been averted. In the early days of the internet, limited technology and even more limited understanding made it nearly impossible to build a website that pleased CEOs, search engines, and end users. Fortunately, times have changed, and one of the most promising trends of the past couple of years is an increasing realization that SEO and usability can coexist and even be complementary. Why the change? I think we can break it down to five important trends: Rise of the Human-like Spiders Internet content has exploded, and search engines have had to change considerably to keep up. As search spiders and bots become more advanced, they’ve finally begun to mimic at least some of the simple patterns of human browsing behavior. Make the people happy, and you might just make the spiders happy, too. At the same time, spiders are less and less hung up by advanced technology and are even aided by practices, such as good CSS use, that tend to promote design standards and user-friendliness. Widespread Use of Analytics Both SEO and usability used to be a tough sell, but a better understanding of analytics over the past few years, especially the focus on results-oriented analytics (such as conversion tracking), have finally started to prove that both disciplines have real business value. Easy Access to Tools Beyond basic web analytics, tools to track conversions, explore the inner workings of search engines, and even perform advanced marketing/usability experiments like split tests have become increasingly easy to use and have been promoted heavily by major search engine providers. White-hat SEO Mostly in response to rampant abuse, people finally began to realize the down side of massively gaming search engines. With that realization came a new crop of SEOs who believed that you could play by the rules (well, some of them at least) and still make money. Like any good service provider, white-hat SEOs want to bring real value to their customers, and that has included embracing ideas like usability. Holistic Approaches Smart service providers eventually realized that no discipline (design, marketing/SEO, usability, etc.) exists in a vacuum, and any one can be done well to the detriment of others (and with them, the bottom line). As web developers have taken a more holistic approach, it’s been necessary to understand where SEO and usability interface effectively. Of course, none of this is to suggest that SEO and usability’s newfound friendship is an easy one. Balancing the demands of internal corporate pressure, marketing, search engines, and users is tricky business, but the evolution of the internet has not only made it possible to bring these camps together, it’s made it profitable. Expect to see even more fusion of SEO and usability in the next few years, and with it, and increased demand for people who understand the big picture on both sides. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How SEO & Usability Finally Became Friends"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How SEO & Usability Finally Became Friends"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Turn Marketing Into Meaningful Relationships — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Catering to User Behavior Shifts During Times of Economic Turbulence — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Close More Sales With Emotion-Driven SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}