{
  "url": "https://moz.com/blog/how-to-build-a-content-marketing-strategy",
  "slug": "how-to-build-a-content-marketing-strategy",
  "title": "How to Build a Content Marketing Strategy - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As successful link building tactics change, companies and clients alike are seeking to understand how certain forms of link building can be translated into long-term content marketing campaigns. But when you're creating a content marketing strategy from scratch, where do you start? Stephanie…",
  "content": "How to Build a Content Marketing Strategy Content Marketing By: Stephanie Chang April 10, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Stephanie Chang April 10, 2013 How to Build a Content Marketing Strategy Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Interested in building your own content strategy? Don't have a lot of time to spare? We collaborated with HubSpot Academy on their free Content Strategy course — check out the video to build a strong foundation of knowledge and equip yourself with actionable tools to get started! Check out the free Content Strategy course! Link building has fundamentally changed. Many types of link building activities that have previously been effective are now either short-term strategies or no longer considered best SEO practice. As a result, companies and clients alike are seeking to understand how certain forms of link building can be translated into longer-term content marketing campaigns. The purpose of this post is to help you develop a framework on how to start building a content marketing strategy for your or your client's site. Why should you care about content marketing? According to a Content Marketing Institute (CMI) 2013 Survey, 86% of B2C (business to consumer) companies are planning to keep or increase their current content marketing spending this year. 54% of B2B (business to business) companies are planning to increase their content marketing spending in 2013. Knowing that the demand for content marketing is increasing, it's worth investing resources to start researching and learning more about the opportunities content marketing can bring to a site. The growth of content marketing is also a concept that Fred Wilson of Union Square Ventures agrees with. Content marketing continues to see growth because it is the future of online marketing. He likes to think of content marketing as \"moving the message from a banner to your brand and changing the engagement from a view to a conversation.\" Furthermore, Google's algorithm is continuously changing, meaning this pretty much guarantees that the quick win strategies that may have worked in the past will no longer work in the future. For instance, Google has announced that in the future, they will no longer be announcing/confirming Panda updates because it will be integrated into the search engine's existing algorithm (i.e. Panda is here to stay indefinitely). We've also seen recently the dangers of garnering links from paid advertorials (even on respected, high domain authority websites), a tactic considered as \"buying links\" in Google's perspective. Now is definitely the time to develop a new type of strategy to garner links and traffic. Inspirational examples of phenomenal content Below are some examples of companies that have created phenomenal pieces of content. Hopefully this provides ample motivation to take your site/client's site to the level! 1. Kickstarter: Best of 2012: An inspirational take on 2012. 2. BuzzFeed lists: Heartwarming content that is easily shareable. 3. Indeed Job Trends: Data-driven content that is direct and to the point. 4. Shopify's Pinterest infographic and their new E-commerce University: Content that is effectively targeted towards their demographic and developing their brand as the E-commerce authority on the web. 5. Airbnb Neighborhood Guides: A visually stimulating take on neighborhood guides, which differentiates them from other competitor's guides. 6. HBOWatch's April Fool's Day joke: Content with a clear understanding of target audience as determined by the high engagement metrics. It gained 1129 comments! 7. Epic Meal Time: Videos targeted towards a male demographic. Topic examples include fast food lasagna and whiskey syrup bacon pancakes. The content marketing strategy framework I've been fortunate enough to work closely with Distilled's Head of Outreach, Adria Saracino, who's been absolutely instrumental in defining the below content marketing strategy framework for a number of my clients (and has, subsequently, inspired my passion for content marketing). Adria has also written a great piece on how to get buy in from your company to invest in content marketing. Below is the content strategy framework that Adria and I have implemented together for our clients. We've learned that this process isn't a quick win and that our most successful content marketing strategies have relied on dedicating at least 3 months to just research - market research, site audits, content audits, customer surveys, and customer interviews to name just a few. In addition, I'll also showcase a few specific examples of how we've built out each step of the content strategy process. Step 1: Researching the company The first step in developing a content strategy framework is understanding the company. The type of questions we ask our clients before we even commence the strategy is to identify the following: The company's business model How does the company bring in revenue? What products bring in the most revenue? Why do these products bring in the most revenue (high profit margin, high demand, branding considerations)? How is the sales team structured? What metrics are they measured on? The existing customer base Who are the company's existing customers? How does the company currently attract customers? If the company's marketing team has already done a market research survey, ask to see the results. Marketing considerations Understanding the existing content process What are the editorial guidelines (if there are any)? What is the internal process to get content approved? Who decides what type of content to produce? What types of content does the team currently produce? What are the company's brand considerations? Step 2: Data collection (and lots of it) I believe in utilizing the data that we have available to make informed decisions. This applies specifically to content; the more we understand about the site and the customers, the more we are able to make informed and strategic decisions to the type(s) of content we want to produce. In order to do this, it's important to gather relevant data. This data can come from a variety of the following sources: Competitor analysis What types of content are your competitors putting together? How are users engaging with the content? Comparing/contrasting SEO metrics (DA, PA, external links, etc.) Keyword research ​What keywords bring traffic to the traffic (excluding not provided)? What are the landing pages for those keywords? What type of metrics does the keyword research and landing page combination currently bring to the site? Market research and customer surveys The surveys may vary depending on whether the company is b2b or b2c. Traditionally, some of the survey questions we've asked b2b clients include: Demographic-related questions like occupation, industry, job title, age, and gender. How long have you been a customer? How likely are you to recommend our services, products, etc. Specific product/service-related questions The survey questions we've asked b2c clients are very similar, but often contain more demographic questions like: highest level of education obtained, marital status, number of kids, household salary range, and occupation. We also include specific product questions, like: How often do you purchase our product? Why do you purchase the product? *Important Note* Be sure to test out your survey using other individuals unrelated to the survey before releasing it. This ensures that there are no ambiguous questions or that any questions have been framed in a way that would lead to biased answers. SurveyMonkey has also produced a variety of survey templates to at least help you gain some understanding of the type of questions you might want to ask your target audience depending on your goals for the survey. Having these sample surveys is an excellent content strategy technique that SurveyMonkey has employed. Not only are the survey questions themselves important, but the email you send out in conjunction with the survey is a big indicator of your survey's success. Ideally, the more data you have accessible, the more likely the survey will become statistically significant. As a result, you want to make sure that the email template catches the audience's attention and also creates an incentive for them to fill out your survey. Below is an actual survey template that we've used for a client, which has generated 917 responses or approximately 50% of the client's email list. Phone Interviews with Existing Customers As you can see from the survey template above, individuals voluntarily opt for phone interviews because there is a guaranteed prize incentive. Questions asked in the phone interview are much more detailed (allowing us to eventually use this information for target audience persona development). Fundamentally, the type of questions you ask in the interview must help you: Identify the person's day-to-day responsibilities, likes/dislikes, frustrations/pressures, needs, concerns, and function they play in the purchasing process. Function they play in the purchasing process is based on the following roles: Initiator: identifies the need to purchase the product Influencer: evokes influence on the individuals who can make the decision to purchase the product Decision-maker: decides whether or not to purchase the product Buyer: selects who to buy from and the agreements that come alongside that User: utilizes the product Gatekeeper: has access or supplies information to both the decision maker and/or the influencer Step 3: Preparation and assessment Now that new data has been collected from various channels, it's important to assess/analyze the data that has just been collected and see how it correlates with the data that you already have on-hand. During this stage, it's also critical to take a step back and make sure that the goals for the content have been clearly defined. Create a benchmark audit using analytics This provides an opportunity to compare/contrast results before and after the creation of the content Important analytics to include are: Traffic Pageviews Pages per visit Average time on site Entrances/exits Conversion rate Bounce rate Linking root domains Page authority Rankings Putting together a content audit ​The purpose of the content audit is evaluate how previous content on the site has performed, as well as organize the existing content on the site to determine additional opportunities. For one of my clients, Adria and I analyzed the top 500 landing pages on the client's site and took a look at the content from three distinct lenses: Analytics metrics: engagement (bounce rate, time on site) and number of visits (to identify potential keyword opportunities) SEO metrics: linking root domains, page authority, etc. Content perspective: is this useful for a user? What type of user would it attract? We individually analyze each content page and determine where it sits on the content funnel. Awareness: Content created for this part of the funnel is designed to target an audience that hasn't even begun to consider the company's product/services. Trigger: Content created for this part of the funnel is when a user has become aware of the product/service and has started thinking about the possibility of needing it. Search: User has decided to research the product/service in-more depth. Consideration: User has decided to convert, but hasn't decided which brand to choose. Buy: User decides to convert to the company's product/service. Stay: Content targeted towards retaining clients, ensuring they remain a loyal customer/brand advocate. The purpose of labeling what stage of the funnel each piece of content is associated with is to ultimately assess the distribution of content on a site and determine if there are any gaps. For instance, this particular site had 180 unique content pages and the distribution of the site's content looked like this: In this specific case, it is apparent that a majority of the site's content sits at the bottom of the funnel. As a result, we recommended to the client that they create more content that targets higher up the funnel. However, it is also important to bear in mind that a site is not necessarily looking for an even distribution of content at each stage of the funnel. The amount needed is determined by various factors, like keyword research and an iterative approach in which content is built that targets a specific stage of the funnel. Afterwards, these pieces of content are analyzed to determine if they proved value based on the site's pre-determined content goals and KPIs. This closely ties into our next point, which is: Clarify the goals for this content strategy. Goals should be general like: Increase in conversions Increase in organic traffic to the site Increase in audience engagement increase in brand awareness However, goals/metrics should also be specifically correlated to where that content sits in the content funnel: ​This great article by Jay Baer explains it in more depth: Consumption metrics: How many views/downloads did your content receive? Sharing metrics: How often does your content get shared? (Tweets, Likes...etc) Lead generation metrics: How often do the consumers turn into leads? Sales metrics: How often do the consumers turn into sales? Ideally, the consumption metrics would be correlated to content higher up in the funnel and the sales metrics correlated to content located further down the funnel. See diagram below: Develop persona buckets In order to achieve this, combine all the data that was derived from the content audit, customer surveys, and customer interviews. Once you've done so, segment individuals into different categories, like this: Image Courtesy of Kissmetrics Solidify the editorial process for the company Who needs to be included in the content development and implementation phase? When do they need to be included? Have a clear understanding of the dependencies (i.e. how long does it typically take to get sign off from relevant departments?) Determine the site's style guide/tone of voice/engagement standards Define the content strategy What types of content will be produced on the site? Where does this content sit in the funnel? Where would they sit on the site? In a separate category on an existing category? What keywords would the content target? Going through this detailed, research-intensive process allows a company to clearly see the opportunities at hand from a high-level perspective. When we go through this process, we identify ways to improve not only the company's organizational structure and create standardizations on how content and pages are released onto the site (static URLs, keyword targeting, content tone of voice/length). It's also through this process that we've been able to engage/integrate multiple departments and define ways to work together seamlessly. Furthermore, we also gain a concrete understanding of the big opportunities for the site. It's impossible to go through this much research and not be able to discern multiple opportunities related to CRO, information architecture, keyword targeting, and analytics, to name a few. Step 4: Prospecting This phase of the process is identifying individuals/sites who would be interested in the type of content the company will produce and engaging them at multiple points with the goal to develop relationships with key influencers. Identify and reach out to influencers Identify influencers through tools like Followerwonk and Topsy Keep on top of industry news Keep on top of the content that competitors are creating Step 5: Create and promote the content In this step, the \"go\" is to now create the pieces of content and follow both the internal protocols and sign off processes that were established in step three of the process. Ensure that editorial standards are being followed and assess that the content being created is actually phenomenal. Create the content and consistently reassess to make sure it is meeting the following checklist: Is the content credible? Is the content informative? Is the content easy to understand? Is the content useful? Is the content exceptional? Promote and outreach the content to key influencers Step 6: Assess content performance After the content has been released and promoted, it's time to assess how the content has performed and any other learnings that can be taken away from the process, including: How has the piece performed? What learnings were taken away from it? Any changes that need to be made to the process? What data have we received from the piece of content? The long-term vision is that the content is able to fulfill the original goals of the content marketing strategy. Overtime, each piece of content produced should systematically become easier and easier, as learnings are developed and iterated each time. Although, the process appears very resource-intensive in the beginning, overtime, the goal is that producing effective and meaningful content becomes a crucial entity for the company. In conclusion, the most valuable benefits of having a content strategy for your site is that, from a business standpoint, your site is no longer creating content for \"content's sake\" or to build \"link bait.\" Moving forward, the site now has a framework of creating content that serves multiple purposes: to engage with current and future customers; to establish brand awareness and authority within the industry; and to consequently garner more traffic, conversions, and links to your site. Furthermore, by integrating multiple individuals into the development of a site's content strategy, it automatically provides the groundwork of integrating SEO seamlessly into the other online marketing activities of the site, such as CRO, social media, and PR. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Build a Content Marketing Strategy"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Build a Content Marketing Strategy"
    },
    {
      "level": "H2",
      "text": "Why should you care about content marketing?"
    },
    {
      "level": "H2",
      "text": "Inspirational examples of phenomenal content"
    },
    {
      "level": "H2",
      "text": "The content marketing strategy framework"
    },
    {
      "level": "H3",
      "text": "Step 1: Researching the company"
    },
    {
      "level": "H3",
      "text": "Step 2: Data collection (and lots of it)"
    },
    {
      "level": "H3",
      "text": "Step 3: Preparation and assessment"
    },
    {
      "level": "H3",
      "text": "Step 4: Prospecting"
    },
    {
      "level": "H3",
      "text": "Step 5: Create and promote the content"
    },
    {
      "level": "H3",
      "text": "Step 6: Assess content performance"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Stephanie Chang\n          \n            Stephanie Chang\n          \n            Stephanie Chang"
}