{
  "url": "https://moz.com/blog/how-to-start-purpose-driven-marketing",
  "slug": "how-to-start-purpose-driven-marketing",
  "title": "How to Get Started with Purpose-Driven Marketing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Sustainable and purpose-driven marketing are terms that are gaining traction, and brands are expected to already have strategies in place to become sustainable quickly. In today’s post, Rebekah shows how taking a more purpose-driven approach to company operations and digital marketing doesn't have…",
  "content": "How to Get Started with Corporate Social Responsibility & Purpose-Driven Marketing Marketing Industry By: Rebekah Conway September 1, 2022 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebekah Conway September 1, 2022 How to Get Started with Corporate Social Responsibility & Purpose-Driven Marketing Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Sustainable marketing, purpose-driven marketing, and corporate social responsibility (CSR) are terms that are getting more and more popular. Brands are expected to already have strategies in place to become as sustainable as possible, as quickly as possible. With that said, there's no one-size-fits-all way of measuring just how sustainable an organization is. Businesses are being told to do it now but are being left with no idea how to start. I wholeheartedly believe that digital marketers can help with this, and by taking a more purpose-driven approach, the entire organization, their customers, and the planet can benefit. I'm going to provide a glossary of terminology, give a brief history of how businesses have lost their focus on CSR, and show how taking a more purpose-driven approach to company operations and digital marketing doesn't have to be a big scary thing. It can actually be fun, fulfilling, and hugely rewarding. You can use these links to jump to each section. GlossaryA brief historyThe rise of CSRTips for starting Glossary Before I dive into everything purpose-driven marketing related, here are some definitions for terms I'll be referring to throughout this piece. If you want to skip this and head straight to the next section, feel free to use the jump links just above. What is sustainability in digital marketing? Sustainability can mean one of two things: 1) Ensuring that your marketing efforts don't cause harm to people or the planet and, where it does, taking steps to reduce or equalize that harm. This could include: Offsetting your carbon emissions (although please, please, please, don't buy carbon credits — these aren’t a true representation of carbon offsetting),Reducing the amount of energy your product and employees use, and/orMaking efforts to update any products or services so that they are more environmentally friendly. 2) It can also mean future-proofing your brand so that it continues to thrive. Whichever definition you like best, the two are not mutually exclusive now that 64% of consumers consider themselves to be belief-driven, choosing to invest in brands that they know make charitable contributions or have a strong CSR system in place. Breaking this down further, 60% of Millennials, 53% of GenZers and 51% of GenXers \"buy on belief\". When it comes to sustainability in purpose-driven marketing, it can mean a myriad of things such as: Reducing the carbon emissions created by our websites and the equipment used by digital marketing departments,Ensuring that everybody has access to our websites whether they have disabilities or are data-poor,Incorporating our sustainability efforts into our online campaigns. Belief-driven consumers are looking for information on sustainability issues using online search (35%), social media (31%), and non-digital print media (29%). According to Sustainable Marketing: How to Drive Profits with Purpose, consumers are looking for environmental information on brands and products using social media (41%) and product and brand websites (34%). What is corporate social responsibility in digital marketing? Corporate Social Responsibility refers to a brand's effort to have a positive impact on people and the planet. I'll go into this in a little more detail in the brief history lesson section, but essentially, CSR revolves around businesses understanding that they have responsibilities towards society. The role of a digital marketer here is to advise, plan and execute communication strategies that tell the brand’s loyal and potential customers how they are fulfilling that obligation. What social marketing means Not to be confused with social media marketing, which you probably know like the back of your hand. Social marketing \"...has the primary goal of achieving 'common good'. Traditional commercial marketing aims are primarily financial, though they can have positive social effects as well.\" It's a term closely related to purpose-driven marketing. What is greenwashing and why is it a problem? I can't really talk about corporate social responsibility and purpose-driven marketing without warning about greenwashing, which is essentially using your marketing powers for evil. Instead of putting in the effort to protect people and the planet as well as hitting financial KPIs, some brands are either pretending or making outright unsubstantiated claims, appearing to be a purpose-driven company with good people and environmental values, but when you scratch at the surface (and most of the time you don't even have to scratch that far) you'll find that they aren't really bothered and aren't doing much. The sad thing is that this has resulted in pretty cynical consumers, so even if you have extremely positive purpose-driven branding and a great purpose-driven culture, you have to be so, so careful in how you communicate to ensure that you don't get accused of greenwashing. What is the triple bottom line? The term \"Triple Bottom Line\" was coined 27 years ago, essentially trying to convince companies to become purpose-driven brands, where they not only measure their financial success but also track how their actions are impacting people (including their employees, consumers, and even those who have no association with them) and the planet. The triple bottom line is really what purpose-driven marketing is all about, and a corporate social responsibility strategy is the way to get there. A brief history lesson I'm based in the UK, and one of our most famous chocolate manufacturers is Cadbury. When they outgrew their factory, George Cadbury and his brother decided that their next location wasn't going to be as depressing or squalid. So, rather than invest in a factory premises, they bought 14.5 acres in a village in Bourneville (which is a lovely place to visit). This meant that factory workers didn't have to live in crowded city slums, but instead had access to a good water supply, train line, and a canal (which was probably a lot nicer back then than they are now). George Cadbury's vision was to create a business in an area full of green spaces where his workers (and their families) wouldn't be surrounded by city pollution. Way back in 1878, Cadbury nailed a corporate social responsibility strategy with the motto: \"No man ought to be condemned to live in a place where a rose cannot grow.\" This approach to business is actually how organizations historically believed companies should operate. Known as social enterprise, brands had a responsibility to provide support to: Their employees,The family of their employees,The wider community, Including contributing generally to the well-being, health, and wealth of society at large. Sadly, in recent years, this could be seen as a scarce approach to running a business, with more and more brands focusing on hitting financial goals and generating more revenue and profit rather than the overall impact they are making. The rise of purpose-driven marketing Like I said earlier, the official Triple Bottom Line approach has been around for almost three decades and there is loads of data available showing that consumers want brands to be more intentional with how they operate, ensuring that everybody and everything benefits from their actions. 86% of millennials think that companies should be measured in terms of more than just financial performance, according to The Rise of the Social Enterprise. Since this generation currently makes up half of the global workforce, as well as being consumers, it's something for every brand to consider. More companies are also transitioning into B Corps, a label only given to companies who meet \"high standards of social and environmental performance, transparency and accountability\". Since B Lab's creation in 2006, more than 5,000 global brands have transitioned into B Corps across 82 countries and 156 global industries (at the time of writing). That's massive. And it's really well-known, leading brands that are now B Corps including Innocent Drinks, Ben & Jerry's, and BrewDog. And the US and UK are leading the way, having the most certified B Corp businesses. What's more, these brands are talking about these efforts as part of their online strategies: 1) Innocent Drinks: Doing business in the right way 2) Ben & Jerry's: We have a dream 3) BrewDog: Our responsibilities It's time for a rise in purpose-driven digital marketing I've been devouring the Can Marketing Save the Planet podcast and reading as many books as I can get my hands on (annoyingly, books on this topic can be pretty expensive). What I've found is that, while there seems to be a huge shift towards more ethical and environmental values, the focus and efforts seem to lie in more traditional marketing campaigns rather than digital marketing. But as you've seen here, the data shows that people are looking for how brands are implementing corporate social responsibility through different channels online, so there's a real opportunity here for us as digital marketers to take the helm. Whether you're in-house or agency side, how often are you asked to advise on key decisions like corporate social responsibility and purpose-driven marketing campaigns? We have the audience. If we can start to close the gap between traditional and digital, and cross the line that's drawn between brand decisions and marketing, we can achieve some exceptionally good things for everyone. Tips for getting started with corporate social responsibility and purpose-driven marketing First, you need to consider how you could approach putting together your own CSR strategy to become a more purpose-driven brand. If you work agency side, you can use this approach when helping your clients come up with their purpose-driven marketing campaigns. I'm using what I've learned not just regarding CSR, sustainability, and brand purpose but also in my experience working in digital marketing over the last seven years. 1) Check out the United Nations SDGs The first thing I'd recommend doing is familiarizing yourself with the United Nations Sustainable Development Goals (SDGs). There are 17 goals that can help you get started: There's more information on each of these here, and it's a great starting point to see if you or your client is already doing things that fall under these goals. For example, The Digital Maze recently implemented a new sick pay policy. Previously, the company gave full sick pay for five days. Now, employees get five days of full sick pay per \"incident\". So, if I were sick for five days in January and then again for five days in March, I'd get all of those days fully paid. There has also been another recent policy change regarding working hours and locations so that employees can get out during the day — whether that's for a walk around a local park or hitting the gym when it's less crowded. Finally, the hours of operation are fantastic. A standard working day consists of billable working hours for clients, however, employees are encouraged to step away from the screen between tasks, take a breather, and also do regular professional development. All of the above could easily fall under goal two of the SDGs: Ensure healthy lives and promote well-being for all at all ages. It's worth saying that these policies weren't implemented because of the SDGs. The SDGs are a great sounding board for figuring out what you or your clients are already doing that you may not have thought fell under a purpose-driven approach. 2) Involve the entire company At a recent client meeting, the client asked if they should be talking about charitable efforts their employees are involved in independently of the brand. I, for one, think this is a great idea, and an even better one is involving all of your employees in defining your brand's shared values. A simple anonymous survey could be taken by your team if you're a marketing agency looking to implement your own purpose-driven marketing campaign, or you can provide your clients with a survey template to give to their employees. Ask what they stand for, what they want the business to stand for, and any ideas of how to get there. In a short space of time, you'll be inundated with ideas that you can work through. 3) Don't take on too much, too quickly Slow and steady will win the race here. Rather than trying to do everything quickly, the result of which would be not achieving much at all, start with one, two, or three values at the most, and really explore what you can do to make a difference. When it comes to sustainability, there's always this concept of time looming over our heads. While time is indeed running out, it's better to do a few things that make a substantial difference than trying to do a lot, getting overwhelmed, and achieving nothing. 4) Have fun Yes, this is an incredibly important topic that needs to be taken seriously, but that doesn't mean it can't be fun. Some might even argue that when it comes to a successful digital marketing campaign, \"fun\" is often the secret ingredient. There will undoubtedly be things that you need to do as a purpose-driven brand operating in the digital space (like calculating carbon emissions) that you wouldn't necessarily do as a hobby, but it can also be a passion project. Once you confirm what's already being done, you can start creating marketing strategies to get this information out into the world and in front of your target audience. 5) Don't be scared to tell the truth I'm so impressed with Costa Coffee's CSR page (I have no affiliation with this brand whatsoever, but they are my go-to coffee shop of choice when it’s a jumbo coffee morning). If you scroll down you'll see a rundown of how sustainable their coffee cups are. But the bit that really stands out is in their cold cup section, where they say that their lids are only made from 40% recycled plastic and that they have more work to do. Remember the old days when companies were hesitant about using social media because they didn't want to get caught up in complaints? Well, the same thing is kind of happening in purpose-driven marketing. Companies are so worried that they will get flack for not being 100% perfect that they choose to do nothing, or to not talk about it. Costa is a great example of how to do this: communicating that they are aware of where they need to be, but are also proud of how far they've come. 6) Choose your platforms Just as you would with any marketing strategy, you need to have a plan of what platform each campaign will use. Every single company operating online should have a CSR page on their website so that consumers who are looking for this information online (remember, that's 75% of people) can find it easily. 41% of those consumers are looking for this information on social media platforms, so if your analytics shows that this is where your audience is spending their time and interacting with you, it's worth testing some strategies there, too. Innocent Drinks does this very well via a Twitter strategy that supports The Big Rewild. Here are just a couple of their posts: \"I've not seen a bed that wild since a tiger broke into my bungalow\"\"wow... I didn't know you lived in a bungalow, Clive\"\"yeah, terrified of stairs, Jeff\"#WildOrMildhttps://t.co/mg06mzyUGT— innocent drinks (@innocent) June 22, 2022 See how they're having fun with this campaign? As digital marketers, we're in an excellent position to do this. We already know the ins and outs of these platforms and how to put together an incredibly strong strategy. 7) If you really don't know what to do or where to start Do the same thing you'd do for any other marketing campaign: competitor research. This isn't to steal ideas, it's more for inspiration. What societal issues are they trying to tackle? Are they focusing on climate change, for example? It's a good sounding board but, remember: just because your competitors are doing something, that doesn't mean that you should be doing the exact same thing. It all comes back to defining your company's values. Take these steps to get started in CSR I hope this has helped take some of the scariness away from such a big and important subject. Whether you're working in-house or as part of an agency, taking a purpose-driven approach is only going to get more important and in-demand. If you've already gone through the process of setting up purpose-driven campaigns and CSR strategies, I'd love to hear about your experiences on Twitter. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Get Started with Corporate Social Responsibility & Purpose-Driven Marketing"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Get Started with Corporate Social Responsibility & Purpose-Driven Marketing"
    },
    {
      "level": "H2",
      "text": "Glossary"
    },
    {
      "level": "H3",
      "text": "What is sustainability in digital marketing?"
    },
    {
      "level": "H3",
      "text": "What is corporate social responsibility in digital marketing?"
    },
    {
      "level": "H3",
      "text": "What social marketing means"
    },
    {
      "level": "H3",
      "text": "What is greenwashing and why is it a problem?"
    },
    {
      "level": "H3",
      "text": "What is the triple bottom line?"
    },
    {
      "level": "H2",
      "text": "A brief history lesson"
    },
    {
      "level": "H2",
      "text": "The rise of purpose-driven marketing"
    },
    {
      "level": "H3",
      "text": "It's time for a rise in purpose-driven digital marketing"
    },
    {
      "level": "H2",
      "text": "Tips for getting started with corporate social responsibility and purpose-driven marketing"
    },
    {
      "level": "H3",
      "text": "1) Check out the United Nations SDGs"
    },
    {
      "level": "H3",
      "text": "2) Involve the entire company"
    },
    {
      "level": "H3",
      "text": "3) Don't take on too much, too quickly"
    },
    {
      "level": "H3",
      "text": "4) Have fun"
    },
    {
      "level": "H3",
      "text": "5) Don't be scared to tell the truth"
    },
    {
      "level": "H3",
      "text": "6) Choose your platforms"
    },
    {
      "level": "H3",
      "text": "7) If you really don't know what to do or where to start"
    },
    {
      "level": "H2",
      "text": "Take these steps to get started in CSR"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    }
  ],
  "author": "Rebekah Conway\n          \n            Rebekah Conway\n          \n            Rebekah Conway"
}