{
  "url": "https://moz.com/blog/how-to-choose-google-my-business-categories",
  "slug": "how-to-choose-google-my-business-categories",
  "title": "How to Choose Google Business Profile Categories (With Cool Tools!) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your choice of your primary and secondary categories contributes a lot to Google’s understanding and handling of your business. With so much riding on proper categorization, let’s empower you to research your options like a pro today!",
  "content": "How to Choose Google Business Profile Categories (With Cool Tools!) Local SEO | Search Engines By: Miriam Ellis September 9, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis September 9, 2020 How to Choose Google Business Profile Categories (With Cool Tools!) Local SEO | Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Image credit: Danny Sternfeld In creating a Google Business Profile listing for your local business, making a data-based decision is one of the most important steps you’ll be taking. Just how influential are the categories you select? Our recent State of the Local SEO Industry 2020 survey found that, out of all factors, GBP elements (which include categories) have the greatest impact on local pack rankings. Choose wisely, and these elements help ensure Google views you as a candidate for possible inclusion as a result for a set of search phrases. Choose wrongly, and you can exclude yourself from this vital visibility. Google categories can also play a role in determining which features will be available to you in your Google Business Profile/Google listing. For example, if you’re categorized as a “hotel”, you won’t be able to use Google Posts. If you’re categorized as an educational institution, you won’t be able to receive reviews. Meanwhile, if you’re categorizing your business in the auto dealership space, you’ll be allowed to have multiple listings for your departments, and the car makes you vend. Categories impact the attributes that will be associated with your business, the menus you can use, whether booking buttons are available to you, and whether you have primary or secondary hours of operation displayed. In short, your choice of your primary and secondary categories contributes a lot to Google’s understanding and handling of your business. With so much riding on proper categorization, let’s empower you to research your options like a pro today! When and where to choose Google categories In creating a brand new Google Business Profile listing, one of the first things Google asks you to do is to choose a category: And, as Google says, you can change and add more categories later. Once you have access to your GBP dashboard, you’ll find your categories by clicking on the “Info” tab in the left menu and looking right below your business name, where the pencil icon will let you edit your categories: You are allowed to select up to 10 categories. Your primary category is believed to have the greatest influence on your local rankings, and must be chosen with extra care: You can edit your categories in the GBP dashboard any time you want to, with the understanding that doing so can substantially alter the rankings you’re experiencing for various search phrases. How to choose Google categories Here’s your step-by-step workflow for picking the Google categories that are best for your business, with the help of some great tools. 1) Determine your most important search phrases First, create a list that includes: The type of business you operate (e.g. “supermarket” “medical center” “restaurant”) and its variants. For example, if you’re an attorney, list out the subtypes associated with your firm, such a “personal injury lawyer” or “tax attorney”. If you own a restaurant, include whether it’s an “Italian restaurant”, a “family restaurant” and other qualifiers. A supermarket might also be a “grocery store” or “natural foods store”.The full list of goods and services you offer. Your HVAC company offers heater repair, air conditioner repair, etc. Your landscaping company offers tree service, landscape design, yard work, etc. Your clothing store offers men’s clothing, shoes, jewelry, etc. Next, take your list of keywords and enter them into your choice of free or paid keyword research tools to discover which terms have the highest potential search volume. For example, Moz’s Keyword Suggestions tool within Moz Keyword Explorer can help you determine the difference in search volume between two terms like “Mexican restaurant” vs. “taco shop”: Note down the search volume for each term on your list. Finally, refine your list down to a smaller set of terms that combine the highest search volume with being most relevant and important for your company. In most cases, this is the list you’ll move ahead with, although there are some cases in which you would choose to target lower volume search phrases because they are either a) less competitive, or b) a more exact description of what your business is. 2) Determine which categories your market competitors are using for your most important search phrases Now, take your refined list of search phrases over to Google and begin searching for them in your local market. Your local market is made up of your customers’ locations in relationship to your business location. This could only be as large as your neighborhood, or it could include a whole city or several adjacent cities, depending on: Your business modelThe distance from which customers are willing to travel to get to your businessThe distance from which Google believes customers are willing to travel to get to your business For example, a coffee shop might have quite a small local market if most of its customers arrive looking for a quick, convenient cup of coffee. Meanwhile, an amusement park might have a much larger local market because people are willing to go a greater distance to visit it. Google’s local results increasingly reflect their understanding of intent differently for different business models. Here’s a screenshot of the market an Internet searcher in the North Beach district of San Francisco might see if they are looking for “pizza near me”: Meanwhile, a searcher in California looking for a “sports arena” could be shown a market that encompasses more than half the state: Now, make a list of all the competitors you discovered in your market while searching from the location of your business. Next, be sure you’re using the Chrome browser and head over to the Chrome web store to download the awesome, free, new extension called GMBspy. Developed by George Nenni of Generations Digital, turning this extension on enables you to go to Google Maps, search for your market competitors and see their categories, like this: You can look up competitors one by one, or just mouse around on the map to see the GMBspy extension data pop up. Google doesn’t automatically reveal all the categories a business is using and so this little tool saves so much time and a lot of fiddling around with HTML to access that data. What a great development! Note down all of the categories your market competitors are using. Pay special attention to the categories being used by the business ranking #1 for each of your refined search phrases. 3) Get category suggestions and leave no stone unturned Your market might be full of highly active competitors who have wisely chosen the best categories, or it could be a less sophisticated scenario in which other companies are overlooking opportunities you might be able to discover. Hop on over to PlePer’s GMB Category Helper and type in your business name and up to three comma-separated search phrases. If you’ve not yet opened for business, you can just enter the street address of your proposed location instead of a business name. Then, go get a cup of tea or do a little exercise for five minutes and come back for this amazing data: Based on your lat-long coordinates, PlePer shows you your current categories, the categories being used in your area, a list of category suggestions, and other useful information. Quite cool! The free version of this tool lets you do three such searches per day. Jot down any notable findings that were absent from using GMBspy. And, finally, just to be sure you haven’t missed any potential opportunities, move over to PlePer’s full GBP category list: It’s updated at least every 3 days, which is great because Google continuously adds and subtracts categories. Just select your language and country and hit the “fetch” button. This tool can be especially useful if you offer an unusual good or service and aren’t sure whether a category exists for it. Note down anything you feel might be relevant. Finally, within the GBP dashboard, Google will also sometimes make suggestions about additional categories you might want to consider adding, like this: In the above screenshot, you can see that our categorizing Moz as a software company is causing Google to suggest that we might also want to select “accounting software company”. In this case, the suggestion is irrelevant to Moz’s business model, but it’s a good idea to see if Google is making any valuable suggestions for your company. You’ve now got all the data you need to make a selection, based on the categories that are applicable to your popular search phrases and that are being used (or overlooked) by your top market competitors. Well done! A little extra GBP category-savvy Image credit: Thom Wong Let’s boost your confidence about Google categories with a few more tips before you fill in your choices in the GBP dashboard. Answers to these FAQs could help you out with common predicaments: 1) How many GBP categories should I choose? My best answer is as many as are truly relevant to your business. Never add categories that don’t relate to your business. For example, if you’re marketing a pizza place, you obviously shouldn’t add a hair salon as a category, or it can totally confuse Google, and your customers, and even harm your rankings. So long as each category is applicable, you should be fine. In the past, there has been much discussion about whether category dilution (choosing too many categories) could hurt your rankings. Local SEO Colan Neilsen’s recent study demonstrated the opposite — that adding more, relevant categories can positively impact your visibility, rather than undermine it. This is a good time to note that the Guidelines for representing your business in Google’s section on categories can be a bit confusing. It contains outdated information pertaining to a bygone era (pre-2013) in which businesses were allowed to custom-create categories. I don’t know why Google has never updated this section to remove the text about writing categories that describe what your business “is” rather than what your business “has”, since you’re automatically confined to choosing only Google’s own pre-approved categories, but, the odd state of this area of the guidelines has personally made me take the other recommendations in it with a grain of salt. For example, Google’s insistence that you should use as few categories as possible is somewhat dubious, though their recommendation that you only pick relevant categories makes perfect sense. My advice is to experiment with any relevant category and see where it gets you in terms of visibility. 2) What should I do if Google doesn’t have a category I need? Google has well over 3,000 categories for the US alone, and while this large index covers many business models, it’s not uncommon to find that something you offer isn’t represented. Sterling Sky founder, Joy Hawkins, recently highlighted a case in which a business owner went about requesting a new category from Google the right way, with abundant evidence of why a new option should be added. If a missing category is holding your business back, I recommend studying that GBP help forum thread and then creating one of your own, making the most convincing argument you can about why Google needs to include your category wish. If, however, you can’t get Google to act on your request, your next best bet is to choose the category that most closely represents what your business is, and then use the business description field, images, and Google Posts to add more nuanced information about your goods and services. 3) How can I know if I’ve chosen the right categories? This question most commonly arises in troubleshooting ranking failures. You think you’ve done all you can to rank for a particular search phrase in Google local packs/finders/maps, but you’re just not there. While there can be scores of factors contributing to that, it’s always smart to re-check that you haven’t excluded yourself by selecting the wrong category. Go back to the map and fire up GMBspy again to see which categories the top-ranking businesses are using. Do your categories match, or are you missing something? Also, pay attention to your GBP Insights, Google Analytics, and any other analysis software you’re using whenever you add or subtract a category from your GBP listing. If you see a sudden drop in any metric dating to changing your categories, you may have made a poor category alteration choice you will need to correct. Finally, be aware that you’re not the only one controlling your categories. If you experience a drop in rankings and notice that your categories have been mysteriously altered, it could be stemming from a third-party edit or bad data out there on the local web. Local SEO Nikki Brown tells a scary story about a client whose rankings went from 1st to 31st due to an unexpected edit of their primary category, emphasizing the importance of making a category audit part of any rankings-related troubleshooting you engage in. 4) How should I use categories for a multi-entity business model? Google’s guidelines allow some business models to have more than one listing for the same physical location of a business. These special scenarios include: Multi-department models, like a medical center with distinct departments for radiology, pediatrics, and emergency servicesMulti-practitioner models, like a real estate office with multiple agents, or a legal firm with multiple attorneysMulti-brand models, specific to the automotive industry, in which Google allows separate listings for dealerships that vend different makes of vehicles. The guidelines recommend that each forward-facing department of a multi-department model should have distinct categories, and it’s considered a local SEO best practice to do the same for multi-practitioner scenarios, too. Diversifying your categories for multi-entity listings can sometimes lessen Google filtering some of your listings out of their results because you no longer have more than one entity competing for the same category terms. A good way to think about category diversification for multi-entity models is that Google’s permission to have more than one listing gives you the opportunity to increase the number of categories your overall brand can select. Instead of just having 10 categories, your total company could theoretically target 20, 30, 40, etc., substantially improving your potential visibility across a far wider array of search phrases. 5) When and why might I choose a less popular category? There are scenarios in which you might encounter a set of local rankings you’re having extra trouble breaking into. For example, your physical location might put you just outside the map radius Google appears to be drawing for that search phrase, or your competitors may be discouragingly strong or dense on the ground. In cases like this, you might want to experiment with going after a category that could be described as low-hanging fruit — something your keyword research and competitive audit showed you fewer people are searching for, and fewer brands are employing. The foundational goal of managing Google Business Profile listings is to drive conversions/transactions for your company. If geography or competition are making it hard for you to win maximum revenue from a most popular category, you might find you can make up some of the difference by choosing a number of less popular categories that enable you to rank more easily or over a larger area of the map. 6) What about choosing categories beyond Google? There’s a whole world of business listings beyond Google, and each directory or platform has its own system of categorization. Moz Local customers enjoy the tremendous convenience of selecting categories in the dashboard that automatically map to relevant categories across our partner network, but if you’re managing your listings manually, you will need to see what’s available on each site as you go. To sum up Your business will be best served by allocating time for the research and implementation phase of filling in the categories on your GBP listings. Don’t rush, be methodical, and you’ll have the satisfaction of knowing you put in the work to make the best category choices. Check back periodically to see if new categories have become available that could win you new local SERP visibility and increased transactions. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Choose Google Business Profile Categories (With Cool Tools!)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Choose Google Business Profile Categories (With Cool Tools!)"
    },
    {
      "level": "H2",
      "text": "When and where to choose Google categories"
    },
    {
      "level": "H2",
      "text": "How to choose Google categories"
    },
    {
      "level": "H3",
      "text": "1) Determine your most important search phrases"
    },
    {
      "level": "H3",
      "text": "2) Determine which categories your market competitors are using for your most important search phrases"
    },
    {
      "level": "H3",
      "text": "3) Get category suggestions and leave no stone unturned"
    },
    {
      "level": "H2",
      "text": "A little extra GBP category-savvy"
    },
    {
      "level": "H3",
      "text": "1) How many GBP categories should I choose?"
    },
    {
      "level": "H3",
      "text": "2) What should I do if Google doesn’t have a category I need?"
    },
    {
      "level": "H3",
      "text": "3) How can I know if I’ve chosen the right categories?"
    },
    {
      "level": "H3",
      "text": "4) How should I use categories for a multi-entity business model?"
    },
    {
      "level": "H3",
      "text": "5) When and why might I choose a less popular category?"
    },
    {
      "level": "H3",
      "text": "6) What about choosing categories beyond Google?"
    },
    {
      "level": "H2",
      "text": "To sum up"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}