{
  "url": "https://moz.com/blog/how-to-bring-empathy-into-your-content",
  "slug": "how-to-bring-empathy-into-your-content",
  "title": "Why and How to Bring Empathy Into Your Content - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Now would be a perfect time to bring more compassion and kindness into the content you create. Here are practical tips for doing so.",
  "content": "Why and How to Bring Empathy Into Your Content Marketing Industry | Content Marketing By: Daisy Quaker April 8, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Daisy Quaker April 8, 2020 Why and How to Bring Empathy Into Your Content Marketing Industry | Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Creating content can feel incredibly difficult right now. If you’re like me, you’ve spent the last few weeks oscillating between a can-do approach and hours of staring into space. Here’s how to tap into those very real emotions and channel them into more impactful content. What empathy is and isn’t We commonly confuse sympathy with empathy. Sympathy is understanding and perhaps feeling bad for the struggles that someone may be experiencing. Empathy means understanding the person’s feelings and thoughts from their point of view. Sympathy is when you feel compassion, sorrow, or pity for what the other person is going through. Empathy is about putting yourself in their shoes. In this post, I focus on cognitive empathy, which is the ability to understand how another person may be thinking or feeling. Cognitive empathy helps communication by helping us convey information in a way that resonates with the other person. Feelings, who needs ’em? I’ve always struggled with how to deal with my emotions. For much of my life, I thought that I needed to keep how I felt under wraps, especially at work. I recall tough days when I Googled reasons to get out of bed, and when I reached my desk, I would try to leave my emotions at home and just focus on working. Sometimes, the office felt like an escape. But usually, pretending to be unfeeling was a difficult if not impossible task. When this strategy backfires, our feelings overrule us. I’ve come to embrace the fact that emotions are what make me whole and human. There’s a lot going on, and we’re all grappling with it Creating marketing content can be incredibly hard right now because there is just so much going on — not only in your mind but in your readers’ minds, too. Rather than shy away from the current emotional challenge, embrace it to transform your work and get more joy out of the content creation process. People are looking for information, and depending on your industry, there may be several content opportunities for you to dig into. Or maybe you are in an industry where it’s business as (un)usual, and you have to create email newsletters or blog content like you always have. Whether you sell industrial components to obscure parts of machines or homemade broths, there’s room in your content for empathy. For example, are you creating a blog post on how to work from home? Think about the parent who’s never had to juggle homeschooling their kids while holding conference calls. Are you writing about cyber threats and the need to protect firmware? Think about how the risk of a cyberattack is the last thing a dispersed IT team wants to deal with right now. Your readers are all grappling with different issues. The ability to convey empathy in your writing will make your work much more captivating, impactful, shareable, and just plain better — whether we’re dealing with a pandemic or not. Do I have to pretend to be a mom now? No, you don’t. In fact, pretending can come off as disingenuous. You are not required to have the same lived-in experiences or circumstances that your reader does. Instead, just try to understand their perspective. See if you can tell the difference between these messages: “Chin up! It’s hard, but I’m sure it will get better.” “I know everything looks bleak right now, but you will get through this.” While there is nothing wrong with the first sentence in the above example, the second sentence comes across as more caring and compassionate. Done well, empathizing can make it easier to understand the challenges, frustrations, fears, anxieties, or worries your readers might be experiencing. How to infuse content marketing with empathy Empathy is a skill. Those who master it gain the ability to create content that not only addresses a surface problem or issue, but also hits a deeper level by accessing the perspectives and emotions involved. Picture the person reading Want your readers to take action? Try to understand them. Take your health, for example. Pretty much any advice given by your doctor would be critical, right? Yet we often struggle to implement it. Why is that? One reason could be empathy. Studies show that better health outcomes result when a physician shows empathy towards their patient. Are you trying to incite action with your post? Maybe you want your readers to do more than just read your blog and carry on with their lives, then seek to understand where they are coming from first. Whether you’re creating a blog post or a video, picture the person who will read or watch what you are sharing, and speak directly to them. Better yet, find an image of someone that represents your intended audience online and pull it up while creating. Make your audience real. In turn, your content will become more productive because a reader who feels understood is more likely to apply what they read. This tactic works for me when I have to create a how-to video or break something down. I pick an image from the web and ask, “Would they get it?” Set a goal for your content Creating content can be a slog. Setting an intention is one of my favorite ways to give purpose to my process. It helps me push through the mornings when I don’t care about finishing that first draft. I like to think about where I want to take the audience, then revisit that goal again and again until the project is complete. For example, the goal of this blog post is: To help business owners and marketers who need to send out emails or write blog posts while we’re dealing with a pandemic. It’s not business as usual, and empathy is what we need now more than ever. I will share why empathy works, and give practical tips on how writing in a more relatable, humane, and approachable way can help get the point across. When I start a new post, I print a paragraph like this right at the top of my word doc. I revisit it multiple times while I’m writing and reviewing the draft. Then, I delete it right before I submit the post. Moment of truth: Does the post stand on its own? Does it express what I need to say? If so, I know it’s ready. Share personal stories or anecdotes I read a story by Leo Tolstoy recently that really stuck with me— in fact, the ending haunted me for a while. It was a story about greed titled, “How Much Land Does a Man Need?” Tolstoy could have written an essay on how greed is wrong, but I probably wouldn’t have remembered it. Instead, I can vividly recall the farmer who dies during the struggle to get one more foot of land even though he has more than enough already. Personal stories give meaning to your work, and you don’t need to travel to a Russian prairie to find examples. There is material in your everyday life that you can put onto paper. Think of childhood memories, past events, relationships — heck, your favorite passage from a book. How can you weave these into your narrative in a way that will connect with the reader? How can you share a tidbit from your personal life that will pull your readers in? The ultimate question is: Who’s your audience? Once you know that, you’ll know what to share. If you have to write about budgeting tips, put yourself in your reader’s shoes. Think back to a time when you had to watch where every dollar went. How did you cope? What resources did you use? Relate that to what your reader’s budget struggles may be today. How can your experiences help you empathize with a mom in a single-income household who now has to file for unemployment? Or the business owner who needs to re-shuffle a budget and maybe cut ancillary services? You don’t have to be in their position to appreciate what they are going through. Think less self-promotional and more educational Have you ever gotten to the end of a blog post and wondered why you bothered reading at all? That writer probably made an impression on you, and it wasn’t great. Reward the reader by giving them something actionable. Help them achieve a goal they have, or include something worth retelling that’ll impress their boss, friends, or spouse. Look beyond what you’re immediately selling and appreciate how it relates to the bigger picture. Even an external hard drive or a peppercorn grinder can take on new meaning when you look at it from this perspective. Perhaps that external hard drive is not just gigabytes but a way to digitize a family album to share with distant relatives. Or for the budding YouTuber, it may be a way to store all their outtakes without slowing down their computer. Show them how they can get more storage space or pick the best product for their needs. How can they use your advice to live their best life? Learn from the masters Put down the business book and try fiction. As marketers, we can get stuck in a cycle of reading marketing content. I have at least 12 books that I could (and should) be reading instead of a Hemingway classic. But reading non-marketing materials will improve your empathetic skills by demonstrating how storytelling works. I’m halfway through “A Farewell to Arms”, and I think the point of the story is that wars are long and pointless. I could be wrong, but I haven’t stopped reading it yet. That’s the key — the narrative is carrying me along. I’m invested in the characters and their endings. I want to find out what happens to Catherine Barkley because I empathize with her. If you want to kick it up a notch, learn from works like Stephen King’s “On Writing” or Joseph Campbell’s “The Hero with a Thousand Faces”. These classics pinpoint principles of narrative that work consistently across time and space. They’re as relevant and essential as ever, and they can inform, strengthen, and enliven your content. Bonus: maybe they’ll inspire you to write that novel someday. Creating content with empathy helps you and your readers Really good content makes us feel something. It’s a feeling that sticks with us long, long after the words have escaped our minds. That’s the kind of impression you can leave in your readers’ minds, but not without getting to know where they are coming from. Simply stating numbers and stats and figures won’t cut it. We don’t operate in a vacuum. Our relationships with people, our shared experiences, and our connections are what drive us, and in times like this, that doesn’t change. Let it be the glue that helps you bond with your audience. Join Moz SEO Scientist, Dr. Pete Meyers, Wednesdays in April at 1:30 p.m. PT on Twitter and ask your most pressing questions about how to navigate SEO changes and challenges in a COVID-19 world. Tweet your questions all week long to @Moz using the hashtag #AskMoz. Add to Google Calendar Add to iCal Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why and How to Bring Empathy Into Your Content"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why and How to Bring Empathy Into Your Content"
    },
    {
      "level": "H2",
      "text": "What empathy is and isn’t"
    },
    {
      "level": "H2",
      "text": "Feelings, who needs ’em?"
    },
    {
      "level": "H2",
      "text": "There’s a lot going on, and we’re all grappling with it"
    },
    {
      "level": "H2",
      "text": "Do I have to pretend to be a mom now?"
    },
    {
      "level": "H2",
      "text": "How to infuse content marketing with empathy"
    },
    {
      "level": "H3",
      "text": "Picture the person reading"
    },
    {
      "level": "H3",
      "text": "Set a goal for your content"
    },
    {
      "level": "H3",
      "text": "Share personal stories or anecdotes"
    },
    {
      "level": "H3",
      "text": "Think less self-promotional and more educational"
    },
    {
      "level": "H3",
      "text": "Learn from the masters"
    },
    {
      "level": "H2",
      "text": "Creating content with empathy helps you and your readers"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Daisy Quaker\n          \n            Daisy Quaker\n          \n            Daisy Quaker"
}