{
  "url": "https://moz.com/blog/how-to-actually-get-links-from-your-linkbait",
  "slug": "how-to-actually-get-links-from-your-linkbait",
  "title": "How To Actually Get Links From Your Linkbait - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I like talking about link building - it is, after all, one of the most important rankings factors (hey Rand, when's that going to be updated?) and also one of the things people struggle with the most in the SEO industry. So here's some more tip...",
  "content": "How To Actually Get Links From Your Linkbait Social Media T By: Tom Critchlow November 28, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! T By: Tom Critchlow November 28, 2008 How To Actually Get Links From Your Linkbait Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I like talking about link building - it is, after all, one of the most important rankings factors (hey Rand, when's that going to be updated?) and also one of the things people struggle with the most in the SEO industry. So here are some more tips and tricks you can use to get links. This week I'm talking about how to actually get links from your linkbait. For anyone that's launched linkbait you'll know that sometimes it works and sometimes it doesn't. Of course, by 'works' I'm talking about a Digg homepage, a reddit homepage or huge amounts of traffic from StumbleUpon. But actually, even for the pieces which don't go hot on one of the social news sites, there's still massive potential - after all, the content is no less appealing, right? This is still highly linkable content, you just need to go about putting some elbow grease in to get the links. This image is supposed to represent elbow grease, or that women are much better linkers than men, or something equally random: 1. Submit to niche social media sites Ok, ok - I know I said this post was about how to get links AFTER submitting to social media sites, but actually this is a very important step in launching linkbait and getting links. Don't just stop with Digg, Reddit and SU - look at niche social media sites as well. By submitting to these sites not only do you increase the chances that it will go hot on one of these sites (and hence spread and hence get links), but also a lot of these sites provide nonofo links (nonofo being our internal term for clean, non-no-followed links) so they're valuable in their own right too. Don't know where to start? Here are a few ideas: 120 social media sites with PR A categorised list of niche social media sites It's worth bearing in mind here that while these niche sites won't send as much traffic as Digg or Reddit, the quality of traffic is MUCH better - the visitors will almost certainly stick around longer, be more likely to comment and probably more likely to link too (though this is un-tested). Incidentally, does anyone know of any studies into this? As an aside, don't forget foreign language social media sites, especially if your linkbait is visual. Both Wykop.pl and Szanalmas.hu have sent us considerable traffic in the past. 2. Ask for links. Seriously. This point is actually the real reason I wanted to write the post; the other ideas are just fleshing the post out so it's not really short (shhh - don't tell anyone!). This is something we've been doing which is proving very effective at the moment. The concept is simple - once you've created and launched your linkbait, use it to manually build links by contacting people who might be interested in your content and ask if they'd like to link to you. This works especially well when you craft your linkbait correctly - we had success a while back when we launched a video explaining bittorrent for a client. The video was cutsie and fun but it neatly explained the concept of what a bittorrent was. Then we did a search for bittorrent faq and voila - we have a list of relevant people who are actually interested in our video and could easily embed and/or link to it. Another example - we recently launched a quiz about beds and dust mites. It didn't do terribly well on Digg or reddit, but it transpires that there's a really big dust mite community online (who would have thought!?) and since we have real content to offer bloggers, we're having success simply asking relevant bloggers if they'll take the quiz and link to us. We've only just started manually building links off the back of the quiz, but we're seeing good results already - for example, this very nice gentleman has linked to us! While there was no money changing hands for this link, you could equally be more aggressive about getting links and pay for people to link to your linkbait as well, but I won't delve into that whole can of worms here as it's been discussed elsewhere a lot and it's not really the focus of this post. 3. Email chains Back when I used to work in a large corporate office (a far cry from the 14 of us at Distilled!) there were constantly emails flying back and forth among staff with headlines like \"Oh My God FUNNY. PLEASE READ\" or \"SEND THIS TO FIVE FRIENDS OR YOUR KIDNEYS WILL SUFFER DEATH.\" I used to hate those people. I really did. Thankfully, it's several years later and I've just about managed to weed out all those kinds of people from my social circle and I very rarely get sent these kind of chain emails. Still, the market for them hasn't decreased. They can be a very valuable way of helping your content spread - sure, these people aren't always going to link to you, but the number of visits it can drive is sickening. So next time you're launching linkbait, why not get back in touch with THAT person in your life and send them an \"OMG FUNNY, TAKE THIS QUIZ\" email. As an added bonus for this post, I've also uploaded my SMX London presentation on Blow Your Mind link building techniques which you can view online. It's light on content but there's hopefully some useful tips in there: Blow Your Mind Link Building Techniques http:=\"\" download.macromedia.com...<=\"\" a>,0,0,0\"=\"\"> http:=\"\" documents.scribd.com=\"\" sc...<=\"\" a>\"=\"\" name=\"movie\"> http:=\"\" www.macromedia.com=\"\" go=\"\" g...<=\"\" a>\"=\"\" quality=\"high\" src=\"xtagstartz/embed> Publish at Scribd or explore others: Internet Technology seo smx Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How To Actually Get Links From Your Linkbait"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How To Actually Get Links From Your Linkbait"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Tom Critchlow\n          \n            Tom Critchlow\n          \n            Tom Critchlow"
}