{
  "url": "https://moz.com/blog/how-to-hack-the-amplification-process-whiteboard-friday",
  "slug": "how-to-hack-the-amplification-process-whiteboard-friday",
  "title": "How to Hack the Amplification Process - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In a special Whiteboard Friday filmed for the Turing Festival in Scotland, Rand takes an in-depth look at how to amplify your tools and content to the right audiences.",
  "content": "How to Hack the Amplification Process Whiteboard Friday | Public Relations By: Rand Fishkin September 25, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 25, 2015 How to Hack the Amplification Process Whiteboard Friday | Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Last month, Rand made a surprise virtual appearance at Full Stack Marketing, part of the Turing Festival in Edinburgh, Scotland. He presented a special edition Whiteboard Friday to the audience, and the folks at Stipso who hosted the festival were kind enough to let us share it with you, as well. Amplifying content to the right audiences is tricky business. It's easy to hope people will find you organically—particularly if you have really great tools to share—but most of the time, it just doesn't work out that way. In today's special-edition Whiteboard Friday, Rand takes an in-depth look at how marketers should be finding the right audiences for their content and tools, effectively hacking the amplification process. Click on the whiteboard image above to open a high resolution version in a new tab! Video transcription Let's talk about how to hack the amplification process. I see a lot of companies, small and medium businesses, startups that are seeking high growth, even enterprises that are launching products, launching services, and they have this problem. They announce to the world like, \"Hey, we've just launched.\" But there's nobody listening. Because of that, you get these giant crickets -- giant crickets because my stick figure's leg is about the same size as them - just going, \"Chirp, chirp, chirp, chirp.\" Nobody is listening. The problem right here... is that you might have an amazing product, but when you combine that with a small megaphone that doesn't reach your audience, you get abysmal adoption. Solution A: Look, I see a lot of folks, particularly in the startup, high growth, tech industries thinking like, \"Oh, you know what the solution to that is? We need to make the product better.\" There's this mindset mentality that great products will spread virally, and marketing is just for bad products or poor products. That's a little crazy in my view. But the process that they therefore use is, \"Well, let's go add some features. We'll improve the UI/UX, and we'll push our customers to virally spread for us.\" I won't argue that this doesn't work sometimes. I think people point to cases like Google and Slack more recently. They sometimes point to Dropbox. Although, all of those companies, I would argue, had some marketing elements in them that were not just add features and improve UX and make customers do it. But still, I think that mentality, if it works for you, great. But if it's not working, I'd suggest you try something else. Solution B: Another methodology that some folks try is this Solution B I've got here. You might say, \"Hey, here's Cindy. She loves our product. Great. Let's go sell more Cindys on our product.\" So that process is very sales driven and sales focused. It's identify your customer target, find their contact information, and do outreach, whatever outreach might mean. It could mean phone calls. It could mean in-person visits. It usually means email, and LinkedIn is often big for that. This process can work, and I think if you are a sales heavy, sales focused organization and you have a lot of experience in that area, great, go try it out. If that's how you want to build your business, terrific. But I would say that too few folks give this a try. This is an area, this organic amplification that we're trying to hack here with this Whiteboard Friday today, this is really powerful and has high potential, but it's a longer, more indirect process. We need to be aware of that when we're going in, or we can have that slow timed ROI and get cut off by our executive teams, our investors, and our CEO. Solution C: So the way that Solution C works is, basically, we identify the folks who are in our audience. They're potential target customers and people who influence potential target customers. We try and figure out what they consume, what they care about, and then we try and get mentioned, included, visible in the places that they already go to organically. What's great about this is it doesn't cost money. It costs elbow grease. It takes time investment. It takes sweat equity. It doesn't take direct dollars. Although, you could argue that advertising could go into here and could be a way to scale with dollars or, in your case, pounds. When we go through this amplification process, what we need to do is identify who our audience are, their influencers, the media and publications, and all the things that they might consume. What will resonate with them? What kinds of messages, content, and branding will resonate? Then we need to test, measure, learn, and improve. I've got some hacks for you. Probably some of you have been through parts of this process or you're doing it in your day jobs right now. So I have some clever little hacks that I want to share. Who? When you're doing this \"who,\" trying to figure out like, \"Who is my audience? How do I reach them,\" well, start with some of these. Try some in-person interviews. Look at surveys. By the way, you can survey your audience, but there's actually now a process whereby you can identify custom audiences using Google's audience surveys or SurveyMonkey's audience features. That will actually let you target folks, specifically across the world, through ad platforms that make you take a survey before you can see content. That can be a very powerful and interesting way to get data. We've used that at Moz ourselves. I did a survey last year, with the help of Mike King from iPullRank, and we got fascinating data about the SEO market from that. You can also use Facebook ads and Facebook's audience network to reach potential customers. You can use Google AdWords campaigns. These are usable in two ways. You can use them to identify people who might be in your audience and then market to them directly using advertising. Or you can also use them to reach your audience and then give them a survey so that you can learn more about them and who they are and what they need, what they listen and pay attention to, all that kind of stuff. Influencers There are some really great tools here. Followerwonk is one that is run by Moz. There's actually a great tool that I think is a very impressive competitor to Followerwonk called Klear. It used to be called Twtrland, but they've moved to Klear now. I think that's an impressive tool. I'd urge you to give that a try. It will help you identify influencers, specifically on Twitter. Klear has some Facebook stuff too. Fanpage Karma, another great tool for finding influencers and influential pages on Facebook specifically and then trying to figure out what other pages people who follow a given page might follow. Klout and Kred lists, those provide lists of influencers in specific industries and verticals and niches that you can then go identify and do outreach to them. I actually find that very few people use this, but powerful is going and looking at conferences and event lists and checking out all the speakers. If you see that someone is speaking at an event that you know your audience attends, that's a great influencer target and potentially someone that you might have missed in these other analyses. Media and publications Basically, \"What is my audience consuming? If I can figure that out, I can get in front of them with those publications.\" I think using Google search is a great starting point. One advanced search query that very few folks use is the \"related query.\" So I can type in \"related:website.com\" and I can see what Google thinks are other sites about that topic or visited by the same people. Pretty cool, actually. You can use this on both domains and pages. So if you see a resource or an article that's on a journalistic site, on The New York Times, The Guardian, The Observer, or The Independent, you can type \"related\" that URL and see other articles or other publications that write about those same things. Potentially great for journalist outreach and those kinds of things. SimilarWeb does something really cool with related sites. I can take a site and kind of hack that process of finding other sites that are visited by that same target audience. Compass is a tool that I haven't personally used, but several folks have been recommending to me recently. It's sort of like SEMrush in that it gives you data, but about ads rather than about keywords. So SEMrush is great for keywords. Compass, give that a try for the ad side. They'll sort of show you, \"Where are my competitors advertising? What ads are they running? What's resonating?\" That kind of stuff. Then Feedly, as well as Twitter and Facebook fan counts. Feedly will give the you the count of the subscribers for any given blog or RSS feed, so you can get a sense of how popular a given publication might be. Then, of course, you can use Twitter and Facebook statistics for those pages, for that account to figure out how popular those folks are as well. I'm also a big fan of SimilarWeb for that, for figuring out how a popular a given website is. Please, do not use Alexa, Compete, Quantcast, Hitwise, Nielsen. The data is not good. You'd be better off flipping a coin. No offense, they're just not good. What's going to resonate? So this is us trying to figure out what type of content that if we could get in front of folks on our own site, on other people's sites, what kinds of messages, what would work to reach them? Look, no doubt about it, search is still very powerful. If we know the search terms that people in our audience are looking for and we can rank for those or we can advertise for those, just a direct way to acquire competent, high conversion likely customers. AdWords is kind of the default, but you can also check out SEMrush and SimilarWeb. SimilarWeb will give you the terms and phrases that are sending traffic to any given website. If you find a competitors' site, you can plug them in. SEMrush, same story and they'll also give you a bunch of other keyword options. Then, I love BuzzSumo. I think everyone in the content marketing world loves BuzzSumo. That will show you content that has performed well around a particular keyword. You can also check out Open Site Explorer or Ahrefs or Majestic for the top pages to see what are the top performing pages on a given domain. Finally, trial and error. A lot of stuff, when it comes to content, is going to be you putting things out there, those things failing to resonate, and you learning what your audience does and doesn't like. There's no substitute for it. You can learn everything you want from all of these hacks and tools, you're still going to have to try and have some failure rate. If you're unwilling to fail, this is not the path for you. In order to do this effectively, we need to... Test, measure, learn, and improve. So hopefully, we're getting better and better over time. To do that, we need four kinds of analytics. We want web analytics, like Google Analytics or Omniture, if you're using that. Product analytics, something like a Mixpanel or a KISSmetrics. We need some finance analytics, especially if you have a software as a service type product or an ongoing subscription product. My recommendation would be to use Stripe and then something like ProfitWell or Baremetrics on top of Stripe to be able to see all of the data about who's performing well, what your customer lifetime value is, where you acquired those people, from which channels, etc. Finally, some search, social, kind of inbound marketing analytics. Moz is fairly good for that. Searchmetrics is another really good choice. We really like TrueSocialMetrics here for the social aspect of getting analytics. So now you have these hacks. Now you know this process, and I think you can effectively hack the amplification process. I'm very excited to see what you all do, and I hope to be joining you again, next year, at the Turing Festival. Thanks so much. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Hack the Amplification Process"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Hack the Amplification Process"
    },
    {
      "level": "H2",
      "text": "Video transcription"
    },
    {
      "level": "H2",
      "text": "The problem right here..."
    },
    {
      "level": "H3",
      "text": "Solution A:"
    },
    {
      "level": "H3",
      "text": "Solution B:"
    },
    {
      "level": "H3",
      "text": "Solution C:"
    },
    {
      "level": "H4",
      "text": "Who?"
    },
    {
      "level": "H4",
      "text": "Influencers"
    },
    {
      "level": "H4",
      "text": "Media and publications"
    },
    {
      "level": "H4",
      "text": "What's going to resonate?"
    },
    {
      "level": "H4",
      "text": "Test, measure, learn, and improve."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}