{
  "url": "https://moz.com/blog/how-to-convince-a-client-their-site-doesnt-need-music",
  "slug": "how-to-convince-a-client-their-site-doesnt-need-music",
  "title": "How to Convince a Client their Site Doesn't Need Music - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I've lost count of how many clients have requested that music be playing in the background of their website.  As a professional web developer with a few too many years of implementing ridiculous requests, I've acquired quite a knack for convincing a client that music is a bad idea.  The...",
  "content": "How to Convince a Client their Site Doesn't Need Music Technical SEO O By: Oatmeal October 2, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! O By: Oatmeal October 2, 2006 How to Convince a Client their Site Doesn't Need Music Technical SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I've lost count of how many clients have requested that music be playing in the background of their website. As a professional web developer with a few too many years of implementing ridiculous requests, I've acquired quite a knack for convincing a client that music is a bad idea. There are obvious exceptions: such as band websites or sites heavily involved in multimedia. I'm talking about content-rich sites where the user does not expect (or want) a multimedia experience. The next time a client decides that a bit of oontz-oontz might give them a bit of an \"edge,\" refer to this list to convince them that they're really just making their site suck. It's obtrusive: Having music playing in the background can interrupt whatever is currently coming through the users speakers. Many people use their computers as media stations that play music and video. Having this suddenly interrupted is the equivalent of having a newspaper that jumps off the table and wraps around your head like a facehugger and starts laying headlines in your throat. There's probably a better example to use when actually speaking to the client, but you get the idea: It's forcing something down the users throat they didn't ask for. Users expect web pages to contain useful information, not carry a tune. It cuts off when you click around: Unless you've got some kind of hidden frame (if you do, you've got bigger problems than music right now), the sound will cut off every time they click from page to page. Not all browsers and operating systems support multimedia content: There are a lot of older browsers out there on the net that might not support multimedia or will have serious issues playing it. This is a difficult point for the client to argue with because it's a technical issue. I always like to present them with the question: \"If you had to choose between some users being able to hear music and some having their browser crash OR having everyone be able to view the site without any issues, which would you choose?\" It slows things down: Having music playing will decrease the performance of the site, especially on slower machines. Not only will this make the user experience poor during their visit, it'll also make them less inclined to visit your site again for fear it'll once again transform things into molasses. It's tacky and unprofessional: Play to their vanity: having background music was cool in the mid-nineties when the web was first coming together. Now it's not, it's considered dated and the mark of an amateur. If you're gonna put background music in, you might as well put on a pair of hammer pants. You're a fossil, go sit in a museum and fart dust. There's a reason other sites don't have music: Many clients think that since the majority of the web does not play music, by having it on their site they're being exceptional and will stand out from the competition. This is wrong, the reason most sites don't have music playing is because most sites agree that it's a bad idea. Just because you've never seen a site on the web with a giant kitten for a cursor doesn't mean that you should be the first one to try. Not everyone may like your music: What some people consider ambient and pleasant, others may find to be annoying, elevator music. Ask them if they've ever surfed myspace: Ever gotten to someone's myspace page and found yourself frantically trying to find the STOP button on the music player they've embedded somewhere in the abomination they call a profile? Meanwhile your speakers are blaring some crappy emo song about crying in dark puddles. Chances are many clients have experienced this firsthand and can directly relate to your frustration. If this backfires, however, and the client thinks that since myspace is huge and successful that mimicking them is a good idea, point out that they were voted the #1 worst website of 2006 by PC World. It uses up bandwidth: This is hardly an issue nowadays, but if it's a high traffic site having music may run the risk of putting it over its traffic limit and costing extra money. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Convince a Client their Site Doesn't Need Music"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Convince a Client their Site Doesn't Need Music"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Oatmeal\n          \n            Oatmeal"
}