{
  "url": "https://moz.com/blog/how-to-fix-structured-data-markup-errors-on-existing-pages",
  "slug": "how-to-fix-structured-data-markup-errors-on-existing-pages",
  "title": "How to Find and Fix Structured Data Markup Errors via the Google Search Console - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Make your content easier for the search bots to read by eliminating data markup errors from your website.",
  "content": "How to Find and Fix Structured Data Markup Errors via the Google Search Console On-page SEO | Technical SEO By: Al Gomez April 7, 2016 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Al Gomez April 7, 2016 How to Find and Fix Structured Data Markup Errors via the Google Search Console On-page SEO | Technical SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. We might think of content as king, but let’s face it, machines read content differently. Take search engines, like Google, for instance. Although it has become smarter in terms of recognizing long, vague queries, it still needs a little help identifying relevant content on websites. That’s where structured data comes in. Structured data not only lets Google crawl web pages better, it also helps search engines truly understand the content. For example, a history website may contain several dates based on the different chronological points it wants to discuss. People will have no problem identifying which dates belong to which event in time — but not machines. They have their own language that allows them to read information more accurately. SEO benefits of fixing structured data markup errors Fixing structured data markup errors allows webmasters to better promote their content on the web. Websites that contain a lot of facts and figures benefit greatly from fixing their structured data. By adding a few elements into your existing pages, you can improve the way that search engines find information and present them to online users. Aside from that, you’ll also get the following benefits: 1. Make your data eligible for other Google features in search results These include rich snippets, breadcrumbs, and sitelinks search boxes. Businesses that would profit most from these features are those that include products, prices, events, ratings, or reviews on their pages, like real estate websites. 2. Make your content relevant to online users looking for particular information These add a whole new dimension of information to search results. If you’re looking for movies, for instance, isn’t it nice to get results that already include information such as review ratings and showtimes? 3. Enjoy higher click-through rates When people receive more detailed glimpses of what a website contains in a search result, they’re more likely to click on it. The result is higher click-through rates (CTR). Your only problem now is how to make them stay on your website. Do remember that this is NOT a search engine optimization hack. Repairing structured data errors is considered an important factor in SEO, especially for local search, but it’s not an official ranking signal. Correct issues because you want to make it easy for users and search engines to find you, not just because you want to rank well in the SERPs. Detecting structured data markup errors in Google’s Search Console Fixing structured data errors will seem like a pain if you have hundreds or thousands of pages. But if you’re lucky enough to have just a few existing pages on your website right now, it shouldn’t be too hard. To get started, go to your Google Search Console. This is just the rebranding of Google’s Webmaster Tools. If you don’t have an account yet, be sure to make one. Step 1: You will see the number of errors under the Structured Data tab, in the \"Search Appearance\" category. For this example, we used a real estate website: Step 2: Click the items with errors: \"Structured Data > hentry (markup: microformats.org).\" Hentry markup is used with content that needs to be syndicated. It helps posts appear better on things like RSS feeds. In this case, the homepage has missing elements like author and title entries. Instead of fixing it, remove the hentry because it’s not needed. Step 3: Click the error to see the issue and conduct a live test using Google’s Structured Data Testing Tool. Currently, when checking for errors, you will receive an “All good” remark. Ignore it, because you want to fix homepage issues, not blog posts. Step 4: Time to do the \"removal and injection process,\" as we like to call it. First, remove the “hentry”. Next, inject the properly structured data markup using the format provided by Schema.org. As we’re working on a real estate website, search engines need to recognize that content on this page points to places. Thus, we added markup for places (https://schema.org/Place). What was added: itemscopeitemtype=\"http://schema.org/Place\" itemprop=\"url\" itemprop=\"image\" itemprop=\"name\" After making the necessary corrections, it should look something like this: Step 5: Don’t forget to submit it for indexing so Google can crawl the new markup you just added. If you check the page again using the Search Console, you’ll see a clean column where errors used to be. This means you just successfully made it easy for search engines to read content on your site. Optimize pages from Search Console using the Structured Data Markup Helper If you’re not yet well-versed in micro-data and want a little help, you can also use the Search Console to optimize pages on your website. The Markup Helper allows you to add markup as long as the data is available in one of its categories. Common data categories include reviews, movies, products, events, and articles, to name a few. Simply choose the data where you want to add markup by highlighting it on the left-hand side of your browser window. The tool will automatically supply the element you need. Then download the HTML which contains the generated structured data markups, and correct it in your CMS. Congratulations, you just fixed structured data markup errors on your site! Give it anywhere from two to four weeks to see noticeable improvements in terms of search engine rankings and organic traffic. Conclusion Performing a thorough website audit will help you detect these kinds of errors early on so you can correct them. Don’t think that this is simply some SEO hack for rich snippets. Fixing this technical aspect of your website will also future-proof it, should the time come that search queries as we know them become obsolete. As mentioned by Google co-founder Sergey Brin, “Eventually, you wouldn't have to have a search query at all; you'd just have information come to you as you needed it.” Have you used a similar process? If so, I'd enjoy reading about your ideas. Please share them in the comments. Learn More about Schema:https://moz.com/learn/seo/schema-structured-data Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Find and Fix Structured Data Markup Errors via the Google Search Console"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Find and Fix Structured Data Markup Errors via the Google Search Console"
    },
    {
      "level": "H2",
      "text": "SEO benefits of fixing structured data markup errors"
    },
    {
      "level": "H2",
      "text": "Detecting structured data markup errors in Google’s Search Console"
    },
    {
      "level": "H2",
      "text": "Optimize pages from Search Console using the Structured Data Markup Helper"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Al Gomez\n          \n            Al Gomez\n          \n            Al Gomez"
}