{
  "url": "https://moz.com/blog/how-to-reach-bloggers-ninja-style",
  "slug": "how-to-reach-bloggers-ninja-style",
  "title": "How To Reach Bloggers, Ninja Style - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Blogger or webmaster outreach is the art of finding the right sites to target to get links on, tracking down who owns or edits them, and building a relationship with them in order to get links.",
  "content": "How To Reach Bloggers, Ninja Style Content Marketing By: Martin Macdonald September 13, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Martin Macdonald September 13, 2011 How To Reach Bloggers, Ninja Style Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Blogger or webmaster outreach is the art of finding the right sites to target to get links on, tracking down who owns or edits them, and building a relationship with them in order to get links. It's also for my money the only real \"pure\" linkbuilding exercise that we as search marketing professionals should engage in. This stuff does take time, but it is possible to scale (I go into some detail on the data gathering side of things in this post), and if executed correctly you will not only be building great links, but building relationships with people who may well become your brand advocates in future – giving you so much more long term value than a simple link could ever bring. Site Selection: The first ingredient is keyword selection based on the client or site strategy. For instance, online retail clients in the UK clothing vertical have the requirement to rank for lots of fashion related terms, examples may be things like \"adidas originals hoodies\", or \"converse all stars\". This is generally decided at an SEO strategy stage which involves the overall campaign goals, and preferably using real world data like PPC costs and conversions. This type of information is invaluable as it provides the SEO team with a clear picture of commercial value of rankings for certain keywords. Once we have these keyword lists, we set about selecting sites to target to acquire links. The best place to find sites that Google considers to be relevant for these terms, it turns out, is Google itself! A simple search for the term alone yields the results that Google find the most relevant, but this often returns sites that you will never be able to secure links on. For example a search for \"converse all stars\" in the UK yields: Converse.com, Wikipedia, amazon.co.uk, asos.com, totallyshoes.co.uk and other competitors where you will never be able to place a link. \"Advanced search operators\" are how we discover the sites that you WILL get a link on though! Examples are: Inurl: sites: (with advanced options 100 results selected) Search for the keyword term being targeted, and use the inurl: operator to filter out types of site that you can conceivably get links on, for instance: KEYWORD inurl:blog KEYWORD inurl:forum KEYWORD inurl:site KEYWORD inurl:fans This type of search should yield a couple of dozen potential linking partners. Once you have these keep a record of them in an excel sheet (the data to keep now is the keyword, the landing page Google returns, and the site domain name – we will use this data later). Allintext: keyword sites This filter searches for sites that MUST contain each of the words listed within the content of the page. Note, you can also use the plus symbol to return equivalent results, particularly handy when you want to force inclusion of some words but not others. Again, using the keyword term, plus other operators such as \"reviews\" \"blog\" etc. can yield lots of good results to contact. Site: or –site: operators Or These searches restrict the query to either a certain domain, type of domain, or excluding a certain domain. The purpose in this is to discover sites that have certain TLDs such as .edu, .gov, .info, .me etc. that are either going to be high value links, or unlikely to be the brand website where you can target links. Again, save any potential site in your excel sheet created earlier to contact in future. Intitle: sites These search types yield results where the term or terms (to force exact terms use quotation marks) appear in the TITLE: element of the document, be creative with your keyword operators to uncover lots more nice sites. Mixing and Matching Operators: You can combine these operators in any way you choose to really drill down on sites and find some hidden gems. Some example searches might be: +\"converse all stars\" inurl:blog intitle:review +\"converse all stars\" +buy +inurl:forum Once you start combining multiple operators you normally end up with hundreds of new potential sites. Cataloguing Results: All of the above searches yield results that you can contact at a later date to get link placements. It's a good idea to try and keep this all in one place so that you can action the list in an organised way, and also segment it into site types and prioritise them so that you can contact the most valuable ones first. Excel is the easiest way to do it, and based on above you will have the following information already: Keyword Targeted, Landing Page, Site URL. With an excel plugin (seotools.xll) (available here: http://nielsbosma.se/projects/seotools/ ) we can start building up statistics on these sites in order to categorise them and prioritise them for contact. Information that can help you with this include the Google PageRank (an arbitrary 0-10 measurement of the importance of a website as defined by Google, Google indexed pages (how many pages on a website Google actually knows about and terms worthy of indexing), Facebook Likes (spammy domains are unlikely to have any Facebook likes so it's easy to weed out \"rubbish sites\" with this). The results would then look something like this: The process by which you import this data into excel is by using the following formula’s: =GooglePageRank(CELL) =GoogleIndexedPages(CELL) =FaceBookLikes(CELL) Once you've got a hundred or more potential targets, it becomes quite easy to work out which ones are more powerful, but overall you're looking for as high a possible numbers on each of the above metrics. Time to Get in Touch: Once we’ve got to the stage where we are ready to start contacting webmasters, the first thing we need are their contact details, followed by a good enough reason for them to place a link (time to get creative!). Finding Contact Details: Obviously there is no one size fits all here, if the website is a blog or a forum, a lot of the time there will be simple contact forms that you can fill in, or the webmaster may have published his email somewhere on the site for you to get in touch. If that's the case, it's easy enough to get the message out to them – however most of the time it's not that easy. WHOIS data: any domain name registered has \"whois\" data associated with it, which generally gives you the name, address and email of the person or entity that owns the domain. This is a publicly searchable database which you can access through a variety of sources. My particular preference is domaintools.com and you can find site owner details by going to a url like: http://whois.domaintools.com/seoforums.org this gives you all of the information you need to contact the webmaster: Occasionally you will find however that the domain is registered to a default address of the registrar, something like \"domains by proxy\" (a large registrar's private registration service). If that's the case and the link is perceived to be particularly high value, there are still some options (but we're getting dangerously close to online stalking here!). If you can find the webmaster's name through their blog, site, or forum then you could try searching Facebook or Twitter for them and contact them through those means – or tracking them down (if they are in the UK) on services like 192.com. If you are going to go to this level however, that link really should be \"high\" value! Some of the best links I've ever managed to build have been down to this persistence when you know something is worth following. Remember, those links that are hard to get, are the ones that your competitors are least likely to have! The Pitch: Once we've got contact details the next, and most important step is coming up with a good enough reason for them to link back to you. Again, there is no one size fits all routine here, and it depends very much on the type of site you are contacting. The most normal types of interaction generally follow these frameworks: Content Provision Most bloggers would be happy publishing an article on their site if they are provided it, it's well written, and it fits their target market. This can be a powerful way of getting links back to where you want at very little cost other than the time taken to write the article. For most large linkbuilding clients we have an article writing budget so these would be taken from an existing bank we will have ready and waiting for such a purpose. If you aren't in the position of luxury of having these resources at your disposal, you can build the content once you are in contact with the blogger and it seems likely that they might accept your offer, but to do it effectively at scale, it always helps to have it done in advance. Infographics could also be used here, if you have access to those for your site or client. Straight forward Recommendations \"Hi, I read the article on your site xyz.com where you were talking about converse all stars, I was wondering if you could link it to my page so that you're visitors will know where to buy them?\" Linking for Product In certain circumstances, its easiest and quickest to offer the webmaster some free product, preferably relating to the post/link that you require as it will have the highest chance of being accepted. This could be anything in value from $10 up to $1,000+ depending on numerous factors, including the statistics of the page that we gathered above, the difficulty of the keyword term itself, and the commercial gains from a high ranking position. Offering Competitions In many cases clients would be prepared to offer a free pair of \"converse all stars\" to a community as part of a contest where people have to enter a reason why they deserve the product. This is a great mechanism both to attract the initial link and generate good PR and buzz. Widget Placement (advanced, and only relevant occasionally) Another method is to place a widget on the site (with the webmasters permission of course) This could be something as simple as a survey script, along the lines of \"If Converse released a special edition Leather boot, would you buy it?\". These types of linkbuilding exercise are normally quite easy, as long as it's either humorous or adds genuine value. Also, if you have the development resource, and more importantly data that would be valuable to bloggers in that niche it makes sense to use both together to build a data-driven widget that provides real value to the target sites audience, this of course is harder to execute – but done right can yield some pretty spectacular results. It's also possible to get these kinds of placements to go viral if it's handled in the right way and seeded onto a handful of authority sites. The Endgame: Like in so many areas of SEO, the biggest challenge is scale. We all want great results for our sites or for our customers so it's important to sort out your processes around blogger outreach, as it can quickly snowball out of control and yield very few results. I'm not a fan at all of automated emailing to your target list, each and every contact you make must, I repeat must, be backed up by having looked first at the target site, picking out some relevant content on the page, commenting on it and personalising the email as much as possible. This is time consuming, but it increases the likelihood of getting a reply hugely, and should not be overlooked. The other parts of the research however you can scale quickly into the thousands of sites depending on your vertical using things like the SEOtools.xll file that I linked to earlier in the post. If you follow these steps – you can start building tonnes of (white hat) semantically related, powerful links! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How To Reach Bloggers, Ninja Style"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How To Reach Bloggers, Ninja Style"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Martin Macdonald\n          \n            Martin Macdonald\n          \n            Martin Macdonald"
}