{
  "url": "https://moz.com/blog/how-to-connect-with-your-visitors-using-personas",
  "slug": "how-to-connect-with-your-visitors-using-personas",
  "title": "How to Connect With your Visitors Using Personas - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Personas development is a tool that has been put to use in just about every marketing arena. We know that they can help marketers engage potential clients, but as with many ideas that have made the transition from traditional media to digital we can use them in many ways to improve our workflows…",
  "content": "How to Connect With your Visitors Using Personas Marketing Psychology By: Ben Morel April 24, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Ben Morel April 24, 2012 How to Connect With your Visitors Using Personas Marketing Psychology This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Personas development is a tool that has been put to use in just about every marketing arena. We know that they can help marketers engage potential clients, but as with many ideas that have made the transition from traditional media to digital we can use them in many ways to improve our workflows and our marketing efforts. Why Use Personas? As inbound marketers, we want to do everything we can to create content that will bring people to our – or our clients’ – websites. When they’re there, we want these people to engage with our content in a way that drives revenue. Personas can help us by: Forcing us to think like the customer – many organisations start with the mind-set of “we have these products or services, they have these benefits and features, let’s find people who want to use them”. If you use personas, the customer always comes first Making keyword research more efficient – working out which keywords are likely to be uses by the personas you develop gives us a starting point for keyword research that may be broader than just asking the question “what would I Google to find this site?” Improving customer journeys and informing IA – All websites have goals and personas will help you to work out how your visitors might want to get there, making your customer journeys efficient and smooth Making sure we use engaging imagery – We’ve all experienced hours of trying to find a stock photo that will fit a website or, even worse, the CEO who says “I want a big picture of a smiling man pretending to shake hands with somebody”. Personas give you a starting point in that search, and a diplomatic way to put that CEO back in his box Giving us a starting point for copy –Using personas can help you to work out what will engage visitors and the features and benefits that when given prominence will make those visitors want to complete your goals Giving us ideas for and helping us launch linkbait – One of the most important steps in creating linkbait is to know what appeals to your target audience, and what they’re likely to share. Personas can help provide you with that knowledge and launch a successful viral campaign There are a whole other range of reasons, from informing design decisions to streamlining your order forms, but these six are probably the most compelling. They are or have been times of pain for all of us in inbound marketing, and all can be made less painful next time you come to them by asking “what would our personas think?” Wouldn't you love to get rid of stock images like this? Or at least give them a face that you can put a name to. (Image credit: sxc.hu) What Are Personas? For those who haven’t encountered them, personas are representations of the visitors to your website. They are more than just asking “what kind of person comes to my website”. They are a holistic view of all of the different kinds of people who come to you, or see any of your offline marketing materials. For an interesting primer, you can watch this White Board Friday from way back in 2008. How to Develop a Persona The process of developing a persona is a lot like meeting a new person for the first time. And, as when you meet real people, by the end of this process you should be on first name terms with all of your personas. Some information that is really useful when putting a persona together is: Name Position in an organisation (if you’re working on a B2B persona), or income level if B2C Age Marital Status Number of children Home owner or renting? Education level Do they hold the purse strings, or are they recommending to the person who does? How engaged are they with social media, and which social networks do they use? Other media they consume Now, you may think this is all overkill. But knowing these kinds of details will help you both to connect with each persona, and will provide insight into how they may think. For example, somebody who is 44, has two children and has a mortgage is a lot more likely to want financial stability and to save some of their income than a 22 year old who has just finished university and doesn’t have any financial commitments. This in turn will make their decision making process different from the 22 year old. This list is the bare minimum set of questions you need to be asking; however it’s not strict – you should ask any question of your personas that might help you in the future. Also, a point of order. Some people like to give their personas alliterative names with adjectives, like “Harry in a Hurry” or “Peter Perfectionist”. I have to admit I’m not a fan of this. Although it looks like it’s helping you to sum them up in a memorable and catchy phrase, I think it’s really unhelpful for connecting with your persona. You wouldn’t usually give a real person a nickname like this, because you can’t usually sum their whole personality up in one word. Describing your whole persona in one word in my opinion makes you take a step back from the engagement process that personas aid. When you know your persona’s general background, it’s time to ask the really important question: What is causing this person pain that I might be able to help with? These pain points don’t have to be literal; they can be figurative in the sense of “pain in the arse”. So, does your persona have a task they want to automate, a product they want to find more cheaply, a job function they want to outsource, information they can’t find anywhere else? Has their favourite supplier of something gone bust, or has something happened to change their life circumstances? What problems do they have that you can solve? Next comes hopefully the easiest question: How can my set of products or services help to ease that pain? If you can tie the benefits of your product – not the features – back to the pain points you have identified, this is where the real value of personas comes. My product might benefit you in fifty different ways, but if you don’t really care about the first three in my list you are unlikely to engage with my website. If I can solve your pain in a few sentences, then you am going to love me and want my babies (alright, maybe not. But you will at least want to give me your credit card details, or subscribe to my RSS feed, or recommend me to your friends). Last but not least, a question that ties this whole subject back to web development: What is the goal of this persona on my site, and how can I help them complete it? Where do I want to take this person? How can I persuade them to take that journey? This is really the stage where you can apply your newly created persona to your website and use it to inform your information architecture and design, helping to grease the sides of your acquisition funnels. Personas can help your visitors and users to look like these instead of handshake man in the first image. And to come up with better names for them than \"handshake man\" (Image credit:elontirien) An Example Persona A post like this is never complete without an example persona, so I’ve put one together for Rand’s Inbound.org website. Vital Statistics Name: David Position: Freelance inbound marketer (not an SEO) Age: 28 Lives: London, Camden Marital Status: In a long term relationship Number of children: 0 Home owner or renting?: Home owner? In this housing marketing? Education level: Degree level Do they hold the purse strings?: Yes How engaged are they with social media, and which social networks do they use?: A wide range for their clients, and Facebook, Twitter, Tumblr, Google+ personally. Some LinkedIn, but finds it too crowded by spammers and head-hunters. Other media they consume: Subscription to Wired Magazine, Daily Telegraph online edition A picture of what our persona David may look like. It's a stock image, but it has a bit more personality than most (Image Credit: sxc.hu) Overview David became a freelance inbound marketer because of his passion for inbound, because he enjoys the freedom that being a freelancer gives, and perhaps if pushed he will also admit to a tiny bit of ambition to build up a successful company. He devotes a large portion of his day to his career, and some of that time each day to learning new skills and techniques and in keeping up to date with the industry. Pain Points Because David has a number of clients to keep satisfied, he is rather time poor. He also cannot afford to attend conferences, which make his opportunities to learn rather limited, and has found that it when he ventures outside the blogs he reads on a regular basis it is difficult to determine which posts will be useful and which will be less so. What David needs is a website – or a web-based app – that acts like an RSS feed, so that he can quickly digest whether a post will be relevant to him or not, but that shows him blog posts and articles most recently recommended by people, not just posted in his regular haunts. In Conclusion So, there we have it. Hopefully this post has built a compelling case for using personas, and for their development being the first thing that happens when you get a new client. Hopefully it has also given you a bit of insight into how they can be created. What have your experiences with personas been? I’m sure there are people out there who will have something to say against personas – but that’s all part of the fun ;-) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Connect With your Visitors Using Personas"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Connect With your Visitors Using Personas"
    },
    {
      "level": "H2",
      "text": "Why Use Personas?"
    },
    {
      "level": "H2",
      "text": "What Are Personas?"
    },
    {
      "level": "H2",
      "text": "How to Develop a Persona"
    },
    {
      "level": "H2",
      "text": "An Example Persona"
    },
    {
      "level": "H2",
      "text": "In Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Turn Marketing Into Meaningful Relationships — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Catering to User Behavior Shifts During Times of Economic Turbulence — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Close More Sales With Emotion-Driven SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ben Morel\n          \n            Ben Morel\n          \n            Ben Morel"
}