{
  "url": "https://moz.com/blog/how-to-answer-your-customers-questions-and-solve-their-problems",
  "slug": "how-to-answer-your-customers-questions-and-solve-their-problems",
  "title": "How to answer your customers' questions and solve their problems! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Let's say that you are finally willing to take the content plunge.  That is to say, you've seen the light and are now dedicated to providing your site visitors with the quality content that they need and crave.  Let's furthermore say that you read my article 7 Tips for Writing Quality Content&n...",
  "content": "How to answer your customers' questions and solve their problems! Content Marketing S By: SEMBasics March 27, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! S By: SEMBasics March 27, 2007 How to answer your customers' questions and solve their problems! Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Let's say that you are finally willing to take the content plunge. That is to say, you've seen the light and are now dedicated to providing your site visitors with the quality content that they need and crave. Let's furthermore say that you read my article 7 Tips for Writing Quality Content and agree with some of the ideas that I expressed there. Now what? What do you need to do in order to implement those ideas? It is that very question that I hope to answer in a series of blog posts on YOUmoz. I'll start with two related ideas that I mentioned in my first article - answering your customers questions and solving their problems. Let me start by stating the obvious - you can't answer a question or solve a problem that you don't know about. Practically speaking, this means that before you do anything else, you need to take the time to learn about your customers' questions and problems. And there are two keys to learning that information: You have to approach your customers. You have to listen to your customers. Let's understand each of these two aspects a bit better. Approaching your customers Perhaps the simplest (and maybe even most effective) way of figuring out what your customers want is to ask them. Don't be shy--more often than not they are more than willing to let you know what is on their mind. What's more, there are numerous avenues available for you to ask your customers what's bothering them. Let's start with your website. Why not add a feedback button? A feedback button is a subtle way of saying \"Tell me what you like and don't like about my site, product, service, tool, etc\". If you have a blog, why not have a blog post asking your customers what's on their mind. If done well, it can both provide you with the information that you're looking for and create some valuable content for your blog. Forums are another great way to elicit interaction with your customers. Consider adding a feedback and suggestions section to your blog. I've seen a number of software products do this. Customers talk about what features they would like and why they would like them. Often times their suggestions are incorporated into future editions of the software product. Another way to approach your customer is to send out a survey. This works particularly well if you have an email list. In fact, if you you can even send out an email asking a single question, if it's a particularly important question. Either way, a well constructed survey is another way to find out what's on your customer's mind. Listening to your customers Often times, there is no need to ask your customers what they are thinking. They are more than happy to offer that information themselves. Whether it's a casual conversation, a support call, or an email - take what your customers say to you seriously. What's more, don't think that your customers have to be speaking to you in order for you to listen to what they have say. There are many venues (online and off) where your customers speak about what's on their mind - you should make it a point of checking out these venues, they are often times a goldmine of valuable information. For instance, forums, Google groups, and online answer sites are excellent sources for learning about the issues facing your customer. These are places where people ask real life questions that are bothering them. Those are exactly the questions that you want to know about. In particular, pay attention to those questions which get asked over and over again. Similarly, online user reviews can likewise provide valuable insight into your customer's mindset. For instance, one time I was reading some reviews at Amazon about a particular digital camera. It didn't sound so good for this model - it wasn't that this camera was so terrible, but it didn't have the glowing reviews of some of other models. But then I noticed a review from a grandmother in Florida. She bought this camera for her eight year old grandson and was thrilled! It was just the right size for him, the controls were easy for him to use, as was the software that came with the camera. In short, it was the perfect introductory camera for an eight year old. Well, that's tremendously valuable information! And what's more, since I've read that review I notice a few other user reviews relating to buying a camera for a young kid. That says to me that there are people out there who want to know if a particular digital camera is good for their kids or grandkids. Their questions don't relate to shutter speed and picture quality, but rather to ruggedness, size, and ease-of-use. With that information in hand, I can start to put together blog-posts, articles, and/or user-guides for relating to buying a digital camera for kids. One final online venue that should be taken into consideration are online searches (whether they're on your own site or on the search engines). A search is often times a question and as such tells you what is on your customer's mind. Check your website logs (thank you Identity), the searches done on your site (thank you Ciaran), and search stats from programs like Overture and Wordtracker. Then try and translate the searches into questions. For instance, best canon digital camera can easily be translated into - what is the best canon digital camera. I'm sure that are more examples than the one's I gave above. The point is not to offer a comprehensive list of methods, but rather to create an awareness. Once we realize that we want to know our customers' questions, we can start to notice opportunities that would have otherwise passed us by. That awareness is much more valuable than any list could ever be. This post is based on material found in SEM Basics Free Link Building Course. You can sign-up for this course at http://www.sembasics.com/link-building-course or by email at automaticlinking@getresponse.com. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to answer your customers' questions and solve their problems!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to answer your customers' questions and solve their problems!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "SEMBasics\n          \n            SEMBasics"
}