{
  "url": "https://moz.com/blog/how-do-you-register-for-google-local-with-multiple-languages",
  "slug": "how-do-you-register-for-google-local-with-multiple-languages",
  "title": "How Do You Register for Google Local with Multiple Languages? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There are some difficulties at the moment with how to manage large numbers of local listings. As the tools for managing local listings improve, this will all get easier, but there is a fundamental problem with the setup if you operate in multiple languages.\n\nThe guidelines currently say that you…",
  "content": "How Do You Register for Google Local with Multiple Languages? Technical SEO By: Will Critchlow February 19, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Will Critchlow February 19, 2009 How Do You Register for Google Local with Multiple Languages? Technical SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I have been promising Rand all week that, yes, I'd write a post. And then we'd go drinking again. Nevertheless, with Rand on a plane, I thought it was time to get my act together and write something up. Following Rebecca's post about Get Listed, it seemed like a good time to write up something about an issue we at Distilled have been having with Google Local. Rand and I were talking about this after the session on universal search at SES in London that he wrote up the other day. In a nutshell, the issue arises when you have a business operating in multiple languages. Consider, for example, a hotel chain (let's use the example \"Will's Hotel Chain\"). Imagine I have: UK website at willshotel.co.uk French website at willshotel.fr Spanish website at willshotel.es [This whole thing is independent of my domain name strategy - the same issue arises if I have willshotel.com/uk, willshotel.com/fr and willshotel.com/es]. Now, imagine that as a result of some savvy property deals I own hotels in London, Paris and Madrid - so I have: English pages: willshotel.co.uk/london willshotel.co.uk/paris willshotel.co.uk/madrid French pages: willshotel.fr/londres willshotel.fr/paris willshotel.fr/madrid Spanish pages: willshotel.es/londres willshotel.es/paris willshotel.es/madrid Now - because they have a physical location in those three cities, there is no problem with registering three times - and it might make most sense for me to register: willshotel.co.uk/london willshotel.fr/paris willshotel.es/madrid ...so that when someone searches for me in each region, they can find my local listing and it seems to make sense for each region to be listed in its local language. The problem is that many people wanting to stay in a hotel in Madrid are English, searching from the UK and looking for a page in English about a Spanish hotel. So I really want to register multiple URLs for each geographic location - one in each language, but there is no technical way to list a URL per language. In the absence of that, the only way of achieving the same result is to register each of the 9 pages listed above - each language for each location, but the current guidelines say: Don't participate in any behavior with the intention or result of listing your business more times than it exists. Now this does have the result of listing the business more times than it exists and is therefore currently against the guidelines. But it seems like the goal is perfectly legitimate so it would be great to have a way to do this. I'd love to hear anyone's thoughts on how this should be done. I think the waters are muddied a little by the number of times you see crazy local search results at the moment - see this search that I see at the moment in Google for odeon greenwich (Odeon is a UK cinema chain): I want to know how to do that! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Do You Register for Google Local with Multiple Languages?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Do You Register for Google Local with Multiple Languages?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Will Critchlow\n          \n            Will Critchlow\n          \n            Will Critchlow"
}