{
  "url": "https://moz.com/blog/how-hugging-roger-can-help-your-seo",
  "slug": "how-hugging-roger-can-help-your-seo",
  "title": "How Hugging Roger Can Help Your SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "How my MozCon 2012 goals -- especially getting a hug from Roger -- helped make me a better SEO.",
  "content": "How Hugging Roger Can Help Your SEO SEO Events By: George Andrews August 16, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: George Andrews August 16, 2012 How Hugging Roger Can Help Your SEO SEO Events This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. My MozCon 2012 Goals I’ve been doing a lot of work preparing for MozCon 2012 which, *GASP*, is this coming week! (editor's note: see the PS at the end of this post for a post-MozCon update since this post wasn't published in time for the conference) The first thing I did was produce an SEO page on my personal website where I can list the SEO resources I use together in one spot. I hope to add many more resources from my MozCon notes. Next, I started writing down the many goals I want to accomplish while I am there. My main goal is to shake Rand’s hand. Rand and his mom have produced such a great community through SEOmoz and the TAGFEE Code has really brought focus to my own SEO practices. I think it would be great to be able to shake his hand. Other goals include meeting many other SEOs and soaking up as much knowledge as I can before I head home. Last, but certainly not least, I want to get a hug from Roger! The Numbers OK sure I know Roger pretty much comes with attending MozCon, but I want to earn my hug fair and square! If you don’t know by now, the benefit for leveling up to Contributor on SEOmoz.org is a hug from Roger. To become a Contributor, I need to have at least 50 mozPoints. You can read more about mozPoints here, but I will highlight a few points that are essential to my goal. After taking stock of my SEOmoz profile, I found I was still an Aspirant with 28 mozPoints. Up until today I had been working on becoming an active member on SEOmoz and had, along the way, earned a few mozPoints. I created a profile and fancied it up – +20 mozPoints for a complete profile. I had also left five comments and received eight thumbs up (five for posting and three from other Mozzers). So for a complete profile and a few comments, I sit at 28 mozPoints. This means I have 22 points to go to reach my goal – a hug from Roger. With this knowledge, I sat down to map out a strategy to attain the remaining 22 points. I looked at how I could get mozPoints. +1 for a comment, +1 for each thumbs up on my comments, +1 for each thumbs up on a blog post I’ve written, and so on… I also looked into earning points by answering questions on the Pro Q&A Forum, but found that free members must earn 500 mozPoints to answer questions. After reviewing how to earn mozPoints, I decided the quickest way for me to earn another 22 points was to write a great YOUmoz post; one worthy of a few thumbs up. Posting to YOUmoz and being promoted to the main SEO blog appear to give the biggest return on your content investment. How does this relate to SEO? A great YOUmoz post gives readers valuable information related to SEO and I'm hoping to do that with this one. You might wonder how a post about hugging Roger relates to SEO; but while mapping out my strategy, I immediately began to correlate earning mozPoints with producing gains in SEO. Provide Useful Comments On SEOmoz, you might receive one mozPoint for each comment you leave, but you have to work hard to get thumbs up from other Mozzers. Looking back, the better or higher quality my comments were, the more thumbs up I received. If I left a comment someone else could learn from, I received additional thumbs up. By participating in the discussion I was able to provide value and in return I reaped the mozPoint rewards. Comments behave similarly on other sites. Comment and forum links are largely no-followed or discounted and are not as valuable as links you might receive from guest blog posts or writing for other websites. A person can try to take the easy road and spam blogs and forums with comments and posts that lack substance, but they will receive little to no reward. If instead this person used comments to participate with their audience and to build awareness, they might be able to indirectly increase their rankings. Commenting on blogs can work, but only when you provide valuable input to the conversation. You can spam “great post!” if you like, but over time you will be seen as shallow and without substance. If this happens, it will be hard for people to take you seriously and hard for your content to make it through the “bounce” gauntlet. On SEOmoz.org, useful comments result in more thumbs up. Write Great Blog Posts Just like comments, blog posts can be high quality or spammy. All posts to YOUmoz are vetted and it can take weeks to get your post on the blog; in fact, not all posts are published. SEOmoz cares about quality and providing value to their readers. If a blog post isn’t covering something new or providing a unique perspective, it is likely that post will not provide any additional value. But if your post does provide value and you can get it approved and published, you will reap great rewards. A post published to YOUmoz is worth +20 mozPoints. That’s almost all of the points I need to get a hug from Roger! With SEO, in the broader sense, the higher the quality of content you produce the more relevant you can expect to be. Posts that are in-depth, unique and the most relevant are also most likely to be shared. If you have trouble producing new content that is worth sharing, John Pring provided an excellent guide back in May. His guide is a great example in that I am sharing it with you now! Great blog posts stimulate discussion and are often shared long after they have been posted. Bringing It Back Around By looking at the numbers, I know that better content will result in more mozPoints. Useful comments produce more thumbs up and a high quality post published to YOUmoz will pull in 20 mozPoints (before any thumbs up!). The concepts are the same for other sites and by putting these ideas to practice I can expect to produce more gains in SEO. It is interesting to me that this concept of content ROI is built right into SEOmoz.org. But remember, great content doesn't always mean \"more\" content. It means useful, relevant content; content people can read and learn from. Jon Cooper said it well on Twitter recently. How My Goal of Hugging Roger Helped My SEO To conclude, mozPoints provided me with a quantifiable way to evaluate my content. You can do this too. Look at the comments you've left on the blog and see how many thumbs up you received. I am willing to bet you received the most thumbs up for content you put your heart into. This post will be my first test for how blog posts fair with mozPoints on SEOmoz.org. I am of course hoping it is well received, but either way I know I can still learn something from the comments :). This is how “Hugging Roger” helped me with SEO. As I said earlier, it can take weeks for blog posts to make it through the review process. Hopefully this post makes it in time for MozCon. If it doesn’t, I may just have to steal that hug ;). P.S. aka MozCon Recap So I did make it to MozCon and this post didn't make it in time. MozCon was - amazing. If you were there, you know. Everything I gained from MozCon will fill many posts; but I'll be quick and include just a few updates: First, I accomplished all of my goals. I met Rand and shook his hand. He's a great guy, always smiling, and always willing to take time to make you feel welcome. Also, I learned a lot. Every session was full of useful, actionable information; tips and tools I can use every day. But I also met so many other people. I met Mike King from iAcquire; in fact, I rode with Mike and his sister from the airport to the Westin (thanks again for the ride!). I met and spoke with many of the presenters (AJ Kohn, Jon Colman, Aleyda Solis, Annie Cushing, Dana Lookado, Darren Shaw, Mike King, Paddy Moogan, Dr. Pete, Jen Lopez, Rhea Drysdale, and Joanna Lord). And I met so many of you; SEOs in so many different industries from so many different places all over the world (New Zealand, Spain, Italy, Canada, the list goes on...). Networking with other SEOs was one of the best parts of the conference. And last, but not least, I stole my hug from Roger! MozCon was an amazing time with so many amazing people. I will return next year. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Hugging Roger Can Help Your SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Hugging Roger Can Help Your SEO"
    },
    {
      "level": "H2",
      "text": "My MozCon 2012 Goals"
    },
    {
      "level": "H2",
      "text": "The Numbers"
    },
    {
      "level": "H2",
      "text": "How does this relate to SEO?"
    },
    {
      "level": "H3",
      "text": "Provide Useful Comments"
    },
    {
      "level": "H3",
      "text": "Write Great Blog Posts"
    },
    {
      "level": "H3",
      "text": "Bringing It Back Around"
    },
    {
      "level": "H2",
      "text": "How My Goal of Hugging Roger Helped My SEO"
    },
    {
      "level": "H2",
      "text": "P.S. aka MozCon Recap"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "George Andrews\n          \n            George Andrews\n          \n            George Andrews"
}