{
  "url": "https://moz.com/blog/how-to-get-lots-of-rss-readers-to-clickthrough",
  "slug": "how-to-get-lots-of-rss-readers-to-clickthrough",
  "title": "How to Get Lots of RSS Readers to Click-Through - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "With the popularity of RSS readers skyrocketing (particularly in tech-savvy fields like SEO and webdev), writers in these arenas are realizing how critical it is to have compelling titles and a great first few lines in order to get the RSS subscribers to click-through to the site. This morning,…",
  "content": "How to Get Lots of RSS Readers to Click-Through Content Marketing By: Rand Fishkin April 5, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 5, 2006 How to Get Lots of RSS Readers to Click-Through Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. With the popularity of RSS readers skyrocketing (particularly in tech-savvy fields like SEO and webdev), writers in these arenas are realizing how critical it is to have compelling titles and a great first few lines in order to get the RSS subscribers to click-through to the site. This morning, Donna identified one terrific method for making sure readers will click an RSS link... Tell them not to. I thought I'd identify a few more good ones: Start the post with \"The secret to amazing results with...\" or \"What XXX doesn't want you to know\" - anything with an air of mystery that's also on-topic for your sector is going to push the CTR. The tried and true numbered list, i.e. \"7 Methods for..\" the \"25 things I hate about...\" Controversial or Incendiary titles - i.e. \" The scumsucking troglodytes at XXX\" or \"These guys are on my S--- list\" Shocking news - i.e. \"New feature from XXX\" or \"Unbelievably cool new site\" Any others you particularly like? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Get Lots of RSS Readers to Click-Through"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Get Lots of RSS Readers to Click-Through"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}