{
  "url": "https://moz.com/blog/how-to-find-the-spam-youre-linking-to",
  "slug": "how-to-find-the-spam-youre-linking-to",
  "title": "How to Find the Spam You're Linking To - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Today, between meetings at the office, I had a brief IM chat with Jane, whose globetrotting ways have taken her to the UK for SMX London. Jane noted that our website - www.seomoz.org - was up for review on a search engine panel today, and received generally positive feedback from the engineers. One…",
  "content": "How to Find the Spam You're Linking To Blogging By: Rand Fishkin November 6, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 6, 2008 How to Find the Spam You're Linking To Blogging The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Today, between meetings at the office, I had a brief IM chat with Jane, whose globetrotting ways have taken her to the UK for SMX London. Jane noted that our website - www.seomoz.org - was up for review on a search engine panel today, and received generally positive feedback from the engineers. One notable exception, however, was the fact that several engines commented that we were linking to a small handful of scuzzy, no-good, spamtacular sites (and that this was potentially hurting our performance in the results). To be honest, it's not that surprising; we link out constantly to all sorts of stuff. Over the past 4 years of operation, we've linked to tens of thousands of sites, and it's very probable that some of those have changed hands or changed content and drifted off to the dark side. The frustrating part is figuring out who so we can update (or remove) those links. Thankfully, there's a clever solution - Live.com's linkfromdomain search. Yes, technically, I could ask Nick and Ben to deliver a list of the lowest mozTrust domains we're linking out to according to the Linkscape index, but that's cheating (since we'd really be the only ones who could do it). But, the Live.com query can be used by anyone, and it's pretty effective. I started with some searches like: Linkfromdomain:seomoz.org viagra cialis (which produced a lot of legitimate sites, along with a couple that didn't look so good) Linkfromdomain:seomoz.org viaga (which gave a nice juicy one; view source to see the problem on tenthousandcents.com - anything targeting pharmaceutical misspellings is usually trouble) Linkfromdomain:seomoz.org porn xxx sex casino (gambling + adult almost always gives you spam) In those lists are some obvious culprits (surprisingly, a few of them are in Google's index and have PageRank, too) and using that information, we can help retrace our steps and eliminate those negative links. It's not surprising to hear that linking to bad neighborhoods might be damaging our ranking ability, but it does make me wonder about what percentage of the web has at least a few bad links in their profiles. Since it was recommended to us, it's probably wise for you to run some similar (and possibly more extensive) spot checks on your own external-pointing links. If you're fairly liberal with linking out, this might be an easy way to help make your site a better performer in the search engines and help fight spam. And, might I recommend to the engines' inclusion of an \"are you sure you want to link to these guys?\" tab in their Webmaster Tools to help site owners ID potential problems. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Find the Spam You're Linking To"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Find the Spam You're Linking To"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}