{
  "url": "https://moz.com/blog/how-i-took-a-brand-new-site-to-multiple-top-10-organic-search-rankings-in-less-than-a-week",
  "slug": "how-i-took-a-brand-new-site-to-multiple-top-10-organic-search-rankings-in-less-than-a-week",
  "title": "How I Took a Brand New Site to Multiple Top 10 Organic Search Rankings in Less than a Week - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Getting a new site to quickly appear within online search results is an enormous challenge we all face when launching a new site.  Leading organic SEO firms suggest (rightfully so) that it can take anywhere from three to six months to achieve a top 30 ranking in the major search engines such as…",
  "content": "How I Took a Brand New Site to Multiple Top 10 Organic Search Rankings in Less than a Week Online Advertising S By: SMBConsultingInc. December 27, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! S By: SMBConsultingInc. December 27, 2007 How I Took a Brand New Site to Multiple Top 10 Organic Search Rankings in Less than a Week Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Getting a new site to quickly appear within online search results is an enormous challenge we all face when launching a new site. Leading organic SEO firms suggest (rightfully so) that it can take anywhere from three to six months to achieve a top 30 ranking in the major search engines such as Google, Yahoo, and MSN, depending upon the competitive search landscape. Statistics from NetCraft indicate there have been over 40 million new sites in 2007, so the search ranking challenge is becoming greater and greater each month. Recently, our firm developed a new site (radio.smbconsultinginc.com) dedicated to my marketing internet radio show as a sub-domain off of our main company site. The site went live on Sunday, December 2, 2007, and was indexed by Google and Yahoo within five days. Furthermore, the site ranked within the top 10 search results on December 7, 2007 for: marketing radio show (Google #9 of 5.48 million competing pages; Yahoo #2 of 113 million) sales radio show (Google #1 of 9.3 million; Yahoo #1 of 75 million) sales and marketing radio show (Google #1 of 4.91 million; Yahoo #1 of 35 million) Let’s take a quick look at how that was achieved. Special attention was paid to the title and description tags for each page of the site, with the main page getting the lion’s share of keyword focus. The keyword tag wasn’t even utilized for this site as a test to verify its dwindling importance to search engines. A link to the new site was placed on our main established website homepage, which gets indexed regularly by all crawler based search engines. Comments were placed on very popular and heavily linked to blogs to improve the odds of the site being indexed, and the comments created a little awareness to boot. Signing up for a directory submission service that submitted the site to nearly 500 online directories for around $100 saved tremendous time. This ploy was implemented to speed up the indexing process while also creating permanent links back to the site, which focused on targeted keyword phrases. A sitemap was created next and submitted directly to Google in order to improve the odds of getting more pages indexed once their crawler discovered the new site through one of the strategically placed links from any number of sites targeted in the first few steps. Since the site’s true purpose is to focus attention on the great guests featured on the show, an e-mail was sent to each guest to alert them of the site and encourage them to promote their own individual page in any way they deemed appropriate. While most appreciated the gesture, not too many promoted the site so this didn't factor much into the ranking results. The unique content generated for the site will lend itself well to naturally attracting links as time goes on, which will further improve the site’s rankings for various keyword phrases. Now that the site ranks well for a few targeted keyword phrases within the organic rankings, show popularity and guest awareness should increase, which helps all parties involved better attract their desired target audience (which is what we're after, right?). The next time you produce a new website and want to improve the odds of your site getting indexed quickly, try out the steps mentioned above and hopefully your site will rank well in the process. Also, please let me know how it goes for you. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How I Took a Brand New Site to Multiple Top 10 Organic Search Rankings in Less than a Week"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How I Took a Brand New Site to Multiple Top 10 Organic Search Rankings in Less than a Week"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "SMBConsultingInc.\n          \n            SMBConsultingInc."
}