{
  "url": "https://moz.com/blog/how-we-increased-da-7-points-case-study",
  "slug": "how-we-increased-da-7-points-case-study",
  "title": "How a Single Piece of Content Increased Our DA by +7 Points [Case Study] - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "While working on their client's site, Sergey and his team knew optimization alone wouldn't be enough to move the needle. They needed links. With one big, successful content piece, they drove their domain authority up by 7 in 4 months. Here's how.",
  "content": "How a Single Piece of Content Increased Our DA by +7 Points [Case Study] Content Marketing | Link Building By: Serge Stefoglo September 28, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Serge Stefoglo September 28, 2016 How a Single Piece of Content Increased Our DA by +7 Points [Case Study] Content Marketing | Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Content marketing has been discussed and researched more in the last 5 years than ever before. Source: Google Trends There are various kinds of content marketing strategies out there. Blog promotion, infographics, video strategies, and creative content are some. Depending on your goals, some are more effective than others. At Distilled, we’ve been fortunate enough to work on many creative content pieces with some incredible clients. This article is going to focus on a piece of content that my team and I created for a client. We’ll take a look at both the creation process and the tangible results of the piece we made. Note: In general, you don’t want to rely on one piece of content for link acquisition. It’s recommended to focus on multiple pieces throughout the year to add link diversity and give your content pieces a good chance to succeed. The following is simply a case study of one piece of content that worked well for my client. Client backstory: We need links!Our client is Ginny’s (shoutout to Matt and Cailey). Ginny's is an ecommerce business based in the beautiful state of Wisconsin. We knew that regardless of how much optimization was done on the site, their lack of incoming links would be a huge barrier to success. This quickly became a topic of discussion for us. The general rule of thumb: the more linking root domains (LRDs) your site has, the stronger the domain authority should be. And the stronger the linking root domains are, the better it is for your DA. In other words, it’s better to get 1 strong link (DA 80+) than 10 weak links (DA 20-). Kudos if the links are topically relevant to your website/brand. So, my team and I sat down and started thinking of different ways we could accomplish the task of increasing LRDs and (hopefully) DA for my client. The process of creating a link-worthy storyHere are the steps my team and I went through for this particular client. Note: For an extensive look at creating creative content, please see the following articles: How to Make Award-Winning Creative Content - Part 1 How to Make Award-Winning Creative Content - Part 2 IdeationThe first step in the creative process is ideation, because without great ideas you can’t a have a great piece of content. It’s important to give yourself enough time for ideation. Don’t rush it, and be sure to include various team members with different backgrounds to get as many ideas as possible. Note: stock up on coffee/Red Bull and snacks for this. ValidationTypically after an ideation session you'll have many potential ideas. It’s important to go through and validate them. When I say \"validate,\" I mean making sure others haven’t already done something similar, or that creating the piece is actually possible (you have access to the right data, etc.) Note: For more information on researching and validating your creative ideas, read this post titled “Researching Creative Ideas: 10 Dos and Don'ts.” PitchingAt this point you'll have a handful of ideas that are not only on-brand and interesting, but have great potential in being picked up by various sources. Put together a nice deck and pitch your ideas to the client. The goal is to get your client to pick one (or a few, depending on the budget). Note: Here’s an awesome write-up on a framework for pitching creative ideas to your clients. Gathering the dataOnce your client signs off on a piece, it’s time to dive into the data! Depending on the piece you're creating, this might look like scraping websites and doing a ton of research to get the right data you need. Take your time on this, as you want to make sure your data is accurate and relevant. DesignDuring this part of the process, it’s a great idea to start mocking up some potential designs. If your piece is smaller, this might be a quick and simple task. If you have a data visualization, this will be longer. Typically, it’s a good idea to create 2–3 mockups and give your client some options. DevelopmentOnce your client signs off on a particular design, it’s time to dive into development. CopyThe actual copy for the piece doesn’t have to happen after the development, but it’s usually a good idea to allow the copywriter to see how much space they have to work with. What you don’t want is for your copywriter to write 500 words when the designer has made space for 100. Communication is key in this process. TestingOnce the piece is built, it’s important to test it out on various browsers and devices. Ask people to give it a run and try to fix as many errors/bugs as possible. PromotionDepending on your timeline, you might want to start promotion sooner than this. The important thing to note is to consider pre-pitching and reaching out to contacts to gauge their interest in the piece as soon as possible. Keep your contacts updated and be sure to give them everything they need for their stories. Note: For further reference on pitching journalists, please see this post titled, “Beyond the Media List: Pro-Active Prospecting for Pitching Creative Content.” LaunchIt’s time to launch! PushOn the day the piece launches, be sure that you are reminding journalists, reaching out to contacts, sharing the piece on social media, and making your social campaigns live. CelebrateThere are a lot of steps to building a creative piece, so don’t underestimate the work that goes into it! After you launch the piece be sure to have a beer, give yourself a pat on the back, or do whatever it is you need to do to celebrate. Post-ideation: What we came up withAfter the process outlined above, our team came up with 50 States of Bacon. The idea was simple: Everyone likes bacon, but who likes it the most? Ginny’s caters to a lot of people who love deep frying, so this was on-brand. We decided to use Instagram’s (now difficult to access) API to extract 33,742 photos that were tagged with #bacon and located within the USA. To normalize for population distribution and Instagram usage, we also collected 64,640 photos with the tags #food, #breakfast, #lunch, and #dinner. To make this data more visual, we made it interactive and included some fun facts for each state. What happened after we launched the piece?So, what happened after we launched the piece? Let’s dive in. Here are some of the larger websites 50 States of Bacon got picked up on. Website Domain Authority Other US News 94 Tweeted from account (115K+) Mashable 96 Tweeted from account (6.95M+) AOL Lifestyle 98 Referred 1,200+ visitors Eater 85 N/A Daily Dot 85 Tweeted from account (274K+) Here is what the LRDs and DA looked like before we launched the piece, and then after 4 months of it being live: Before Launch 4 Months Later Linking Root Domains 450 600 Domain Authority 29 36 Let’s break this down by metric. Here's a graph of the LRDs over time (we launched the piece at about the start of the uplift). The domain authority didn’t budge until about 4 months after we launched the piece. We weren’t actively pursuing any other link-based campaigns during this time, so it’s safe to say the creative piece had a lot to do with this boost in DA. Note: Since DA is refreshed with new pools of data, this observation wouldn’t have been as valid if the DA only moved one or two positions. But, since it moved 7 positions so close to the launch of this piece, I feel like it’s safe to assume the piece contributed greatly. Does this mean if you do a similar piece that your DA will also increase? No. Does it give us a good example on what can happen? Absolutely. A note on LRDs, DA, and setting expectationsSetting expectations with clients is hard. That's even more true when you both know that links may be even more important than user engagement with your campaign. To make sure expectations are reasonable, you may want to encourage them to see this campaign as one of many over a long period of time. Then there's less pressure on any individual piece. So, it’s important to set expectations upfront. I would never tell a client that we can guarantee a certain number of links, or that we guarantee an increase in domain authority. Instead, we can guarantee a piece of content that is well-built, well-researched, and interesting to their target audience. You can go one step further and guarantee reaching out to X amount of contacts, and you can estimate how many of those contacts will respond with a \"yes\" or \"no.\"In fact, you should set goals. How much traffic would you like the piece to bring? What about social shares? What seems like a reasonable amount of LRD’s you could gain from a piece like this? Benchmark where you currently are, and make some reasonable goals. The point I’m trying to make is that you shouldn’t promise your client a certain amount of links because, frankly, you'd be lying to them. Be upfront about what this looks like and show examples of work you’ve done before, but make sure to set their expectations correctly up front to avoid any conflicts down the road. ConclusionThere's a lot to be learned from the results of creative campaigns. The goal of this article is to share one piece that I’ve worked on with a client while highlighting some things that I learned/observed along the way. If you'd like to see more campaigns we’ve worked on at Distilled, take a look at our creative roundup for last year. To wrap things up, here are the key takeaways: Creative pieces take a lot of thought, work, and time. Don’t underestimate the task at hand. Don’t frame the project as only focused on gaining links. Instead, aim for creating a compelling piece of content that is on-brand and has the potential to gain traction. Oftentimes it’s best not to put all your eggs in one basket. Plan multiple pieces throughout the year. If your research is right and you pitch the piece to the correct people, this is a strategy that can gain your domain some very strong LRDs. In this particular case, 110 linking root domains (and counting). …But those links won’t come easy. You need to pre-pitch, remind, and re-pitch your contacts. There are many great pieces of content being published daily; you need to be proactive about ensuring your spots online. There are other benefits to doing pieces like this aside from links. Social shares, brand awareness, and referral traffic are some other metrics to look at. It is possible to increase your DA by doing a piece like this, but it takes time. Be patient, and continue doing great work in the meantime. Other thoughts There are some arguments to be made that a piece of content like this only has spikes and doesn’t do any good for a brand. I don’t believe this to be true. The way I see it, if a piece is too evergreen, it might not gain as many strong links. At the same time, if a piece is completely left-field and doesn’t fit with the brand, the links might not be as impactful. I think there's a fine line here; it should be up to your best judgment on the pieces you should create. This piece could potentially be updated every year to gain more links or traction (although it would be a lot more difficult with Instagram drastically limiting their API). It’s possible that this piece didn’t have a direct impact on DA, but because there were no other link acquisition strategies during the 4 months, we can safely assume the two are correlated. There's an argument to be made that jumping from the 20s to the 30s is much easier than from 40s to 50s when you’re speaking of DA. We know that it gets more difficult to increase DA as it gets higher, so do keep that in mind. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How a Single Piece of Content Increased Our DA by +7 Points [Case Study]"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How a Single Piece of Content Increased Our DA by +7 Points [Case Study]"
    },
    {
      "level": "H2",
      "text": "Client backstory: We need links!"
    },
    {
      "level": "H2",
      "text": "The process of creating a link-worthy story"
    },
    {
      "level": "H3",
      "text": "Ideation"
    },
    {
      "level": "H3",
      "text": "Validation"
    },
    {
      "level": "H3",
      "text": "Pitching"
    },
    {
      "level": "H3",
      "text": "Gathering the data"
    },
    {
      "level": "H3",
      "text": "Design"
    },
    {
      "level": "H3",
      "text": "Development"
    },
    {
      "level": "H3",
      "text": "Copy"
    },
    {
      "level": "H3",
      "text": "Testing"
    },
    {
      "level": "H3",
      "text": "Promotion"
    },
    {
      "level": "H3",
      "text": "Launch"
    },
    {
      "level": "H3",
      "text": "Push"
    },
    {
      "level": "H3",
      "text": "Celebrate"
    },
    {
      "level": "H2",
      "text": "Post-ideation: What we came up with"
    },
    {
      "level": "H2",
      "text": "What happened after we launched the piece?"
    },
    {
      "level": "H4",
      "text": "Website"
    },
    {
      "level": "H4",
      "text": "Domain Authority"
    },
    {
      "level": "H4",
      "text": "Other"
    },
    {
      "level": "H4",
      "text": "Before Launch"
    },
    {
      "level": "H4",
      "text": "4 Months Later"
    },
    {
      "level": "H2",
      "text": "A note on LRDs, DA, and setting expectations"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "Other thoughts"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Serge Stefoglo\n          \n            Serge Stefoglo\n          \n            Serge Stefoglo"
}