{
  "url": "https://moz.com/blog/how-to-use-article-marketing-the-right-way",
  "slug": "how-to-use-article-marketing-the-right-way",
  "title": "How to Use Article Marketing the Right Way - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Most people reading this might be thinking that article marketing worked great a few years ago but as Google has improved its algorithm the effectiveness has decreased somewhat. This post is designed to show that although some types of article marketing have been devalued it still works very well…",
  "content": "How to Use Article Marketing the Right Way Link Building P By: Patrick Altoft February 5, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! P By: Patrick Altoft February 5, 2007 How to Use Article Marketing the Right Way Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Most people reading this might be thinking that article marketing worked great a few years ago, but as Google has improved its algorithm, the effectiveness has decreased somewhat. This post is designed to show that although some types of article marketing have been devalued, it still works very well if you are creative. There are a number of different ways to tackle this issue--not all methods are suitable for all sites, and some can do more harm than good. One point you should bear in mind for relatively new sites is that you need to write two different articles if you intend to publish them on your site as well as third party sites. Google won't necessarily understand you were the author, especially if your site doesn't have much trust. The first and most controversial method is to write an article and submit it to as many (50+) sites as possible across the web. Although this is a very good way to get a few low quality, anchor text-rich links on the cheap, it's not recommended for sites that are less than a year or two old or have less than a few thousand high quality links. Probably the most popular method amongst marketers on a budget is to submit manually to the top 5 article directories. Search Google for the term article directory to find out which are most trusted, don't rely on somebody else's recommendations. This is a good method for relatively new sites as you won't build links too quickly and the links you do get will, on average, be more trusted. When you submit an article to a directory you are normally giving other site owners permission to re-publish the article on their website, as long as the bio (and link) remains in place. The better your article is, the more likely it will be picked up by a good quality site. Remember, it's also very likely to be listed on a few scraper or MFA sites as well. My favorite method is to contact individual site owners and offer to write a unique article for their site and maybe pay them to publish it. This works very well if your client has an affiliate program, as the site can publish your article and earn commission from people who read it and click on your link. Hopefully your affiliate links are search engine friendly; otherwise, this doesn't help in terms of link building. Remember that most webmasters are crying out for unique and well-written content, so if you are offering to write free of charge they will normally be very happy and won't charge you. For one of my clients (for the sake of this example I will call them a car insurance company), we contacted a good number of sites and wrote \"Guide to Car Insurance\" articles related to their niche. Each site published the article free of charge and included an affiliate link at the bottom. As an extension of this, we created PDF copies of the articles branded with the name of each site and a shortened affiliate link for them to use in offline promotion. Some businesses didn't really do much promotion, but certain car dealerships handed out the car insurance guides with new cars and generated good commissions. One of the key ways to get your content on as many great sites as possible is to make it accessible. Explain on your site that you write articles free of charge. List PDF files and even zipped archives of some articles for mass distribution so people can easily add them to their sites. Another key issue is promotion. If you write a great article and it's published on a third party site, don't just sit back & start promoting. Submit it to Digg and Netscape with a cool title, Stumble it, add it to your Squidoo or Work.com pages, and even encourage a few bloggers to link to it. Always try to promote your content, even if it's not on your website. What are your favorite methods of article marketing? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Use Article Marketing the Right Way"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Use Article Marketing the Right Way"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Patrick Altoft\n          \n            Patrick Altoft"
}