{
  "url": "https://moz.com/blog/howto-brand-your-seo-agency",
  "slug": "howto-brand-your-seo-agency",
  "title": "How To Brand Your SEO Agency - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Last month I talked about 7 lessons I learned from running an SEO agency. One of the things I’ve learned over the years is that you can command clients to pay you 6 and even 7 figures a year if your agency has brand recognition.\n\n\tBrand recognition also gets you more inbound inquires from c...",
  "content": "How To Brand Your SEO Agency Branding By: Neil Patel November 15, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Neil Patel November 15, 2011 How To Brand Your SEO Agency Branding The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Last month I talked about 7 lessons I learned from running an SEO agency. One of the things I’ve learned over the years is that you can command clients to pay you 6 and even 7 figures a year if your agency has brand recognition. Brand recognition also gets you more inbound inquires from companies who need SEO, which will help your revenue become more stable. If you are ready to take your agency to the next level, here’s how you can build a big brand: Start a blog Not only can a blog help build your brand, it can also drive thousands of extra visitors to your website each month. Before you start a SEO blog, you need to know 1 important fact… it needs to be on the same domain as your agency website. Early on I made the mistake of calling my SEO blog “Pronet Advertising”, when my SEO agency was in fact called “ACS”. The blog was hosted at pronetadvertising.com while the agency site was hosted at acsseo.com. Once the blog became popular people didn’t know whether we were called ACS or Pronet Advertising… even though on the blog it clearly stated that it was owned by ACS. Once you have a blog up and running, there are a few things that you have to do if you want it to become popular. These days there are hundreds of SEO blogs and if you aren’t unique, there is no point in starting one. Write detailed blog posts – if you write how to type of posts you’ll typically gain more traction than if you just blog about SEO news. Use stats – blog posts that contain facts and percentages also tend to do better. If you look at the SEOmoz blog, you’ll notice that posts like this are popular because they contain stats. Dumb things down – SEO is a complicated topic, so if you can dumb down your blog posts you’re better off than if you only use technical jargon. At the end of the day the person who is most likely to hire and pay you won’t understand this jargon, if they did they’d just optimize their own site. By using images and even whiteboards, you’ll be able to dumb down your blog posts, yet still keep them somewhat technical. If you blog on a weekly basis and push out good content every week, you’ll start to get more traffic and see an increase in brand recognition in the SEO space. Become a guest author Blogging on your own site isn’t enough. You need to start blogging on other blogs. By becoming a guest author on popular SEO and marketing blogs you’ll brand yourself as an SEO expert, which will also help your agency. In addition to blogging on marketing blogs you also want to start blogging in places that your ideal customer may be looking. For example if your typical customer is a business owner, you could guest post on Entrepreneur.com. If they are an up and coming startup, TechCrunch would be great place for you to blog. Every week you should be guest posting on at least 2 blogs. The first should be a marketing/SEO blog and the second should be a blog that your ideal customer is reading. To achieve this goal you should email at least 10 people every Sunday night that you are interested in guest posting for. The reason you want to email 10 people is that most bloggers will say “no”. However, if you let them know the specific topic you want to blog on and you do the research to make sure these blogs accept guest posts, you should get at least 20% of them saying “yes”. When you submit your guest post make sure you include an image of yourself as well as a bio that includes a link to your company. If you forget the bio you won’t be building up your agency’s brand. Attend conferences Conferences are a great place to brand your agency and pick up new customers. When I first started out I attended all of the major SEO conferences, and boy did I make a lot of money doing so. People got to know me, I met potential customers and I even gained more knowledge. Over time SEO conferences became competitive, which caused my brand to be mixed in with hundreds of others SEOs. After a while I rarely was able to pick up new clients from them… even if I was speaking. I started to look for new conferences to brand my agency. I quickly realized that industry specific conferences and regional based events aren’t crowded with a ton of SEOs. Which makes it easier to pick up new clients. If you want pick up new clients start attending industry specific events that aren’t SEO related and also focus on attending regional based events. If you want to start building your brand through conferences you have to attend dozens of them each year as some conferences will work out while others won’t. In most cases the events that cost a lot tend to provide a better ROI because if someone can afford to pay $3000 to attend a conference, they can probably afford to hire your firm. Create white papers and beginner’s guides Everyone these days is releasing free information because it really helps with branding. Just look at SEOmoz’s guide to SEO. It’s become the default guide if you want to learn about the subject. It’s so popular that when people ask other SEOs about learning SEO, they just point them to SEOmoz’s guide. By no means is this a short-term branding strategy, but if you can produce really good white papers and beginner’s guides you should start seeing them passed around. The trick is to just make them downloadable so that people can pass them around within their organization. If you are going to create content, make sure you don’t just publish the same information that others have already released. For example it would be a waste of your time to reproduce the Beginner’s Guide to SEO. Buy banner ads Banner ads? They are a waste of money, right? Well if you buy them on other SEO sites they aren’t. When I ran my agency we would spend up to $15,000 a month buying banner ads on other SEO sites...these sites weren’t just news related like Sphinn. We would actually buy ads on our competitors’ site. As weird as that may sound, other SEO bloggers, who are also service providers, sell ads. From the Wolf Howl blog to Search Engine Roundtable, you can buy ads on some of the most popular SEO sites on the web. When I bought ads I found that most of them didn’t convert when I sent them to my homepage, but when I sent them to a landing page that gave away a free white paper, it was very effective. As your sales team can take those leads and close them. Participate in the community The cool part about the SEO industry is that SEOs have a tendency to work together. They play nice with each other and they are willing to share customers. For this reason it’s important to build up your brand amongst other SEOs. Other than going to SEO networking events, you can do this through 2 simple ways: Comment on 5 different SEO blogs each day. Don’t leave generic comments; instead leave very detailed comments that are adding to the conversation. Join popular SEO forums like SEO Chat and respond to 5 different questions each day. Similar to leaving comments on blogs, make sure your responses on forums are detailed. If you do these two things for a year, you’ll end up building a large Rolodex of SEOs. Help people out for free The most effective branding strategy I used with my firm was to help out popular bloggers for free with their SEO. In exchange for helping them, they would add an image link with my company logo that stated “SEO by ACS”. When you do this for 30 of the Technorati 100 blogs like I did, you’ll quickly build up your brand as these blogs get millions of visitors each month. You don’t have to know these blogs to do their SEO, just shoot them an emailing offering free SEO services in exchange for an image link. Trust me, it works. And think of it this way, if someone has that popular of a blog, the chances are they know at least 1 company who can afford to pay you at least $10,000 a month for your consulting services. If you help these bloggers increase their traffic you should be able to get a few introductions to companies that can pay you. Help people out for free Another effective tactic that I used to build up my agency’s brand was to just help out people for free. You’ll notice that over time a lot of people and companies who can’t afford your services will hit you up. Instead of turning them down, give them some free advice every once in a while. You’ll be shocked on what that will do for your brand. My first million-dollar customer came from someone who had no money. I helped him out for free for 30 minutes at a conference and he continually told everyone at the event how I was a great SEO. Within hours I had businesses hitting me up and a few of them were interested in engaging with my firm for 1.2 million dollars a year. Out of those few that were interested 1 agreed. So the next time someone emails you asking for free advice, don’t push them away. Offer some free help, as they’ll constantly tell other people good things about you and your agency. Create case studies If you are good at what you do, you should be able to create some awesome case studies. All you have to do is breakdown what you specifically did for that company, how long it took, and the exact results they saw. When you breakdown the results be sure to include numbers such as traffic stats, revenue increases or anything else the client will let you include. And when wrapping up the case study, make sure you get a good testimonial or video interview from the client. One agency that does this very well (they aren’t an SEO agency) is Conversion Rate Experts. I found out about them through their SEOmoz case study. The video Rand did with them broke down how they made SEOmoz over a million dollars, and convinced me to hire them. Showcase these case studies all over your website as they will help get your agency out there in front of bigger companies. Without them it’s going to be tough to gain interest from Fortune 500 companies. Conclusion If you do everything I mentioned above, you’ll brand your agency as one of the best shops around. I know it’s a lot work, but in the end the revenue will make up for the hard work. Give it a shot; try out just a few of the tactics above for the next 6 months and I guarantee that you’ll see results. You have to make sure you keep at it, as you can’t expect miracles in the first few months of doing this. About the author: Neil Patel is the co-founder of KISSmetrics, an analytics provider that helps companies make better business decisions. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How To Brand Your SEO Agency"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How To Brand Your SEO Agency"
    },
    {
      "level": "H2",
      "text": "Start a blog"
    },
    {
      "level": "H2",
      "text": "Become a guest author"
    },
    {
      "level": "H2",
      "text": "Attend conferences"
    },
    {
      "level": "H2",
      "text": "Create white papers and beginner’s guides"
    },
    {
      "level": "H2",
      "text": "Buy banner ads"
    },
    {
      "level": "H2",
      "text": "Participate in the community"
    },
    {
      "level": "H2",
      "text": "Help people out for free"
    },
    {
      "level": "H2",
      "text": "Help people out for free"
    },
    {
      "level": "H2",
      "text": "Create case studies"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Getting Buy-In for Customer Stories — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Local Brand Loyalty Takeaways From That Time Ace Hardware Was Trending"
    },
    {
      "level": "H3",
      "text": "How to Build a Strong Brand Moat With SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Neil Patel\n          \n            Neil Patel\n          \n            Neil Patel"
}