{
  "url": "https://moz.com/blog/i-became-an-entity-how-im-on-the-knowledge-graph",
  "slug": "i-became-an-entity-how-im-on-the-knowledge-graph",
  "title": "I Became an Entity: How I'm on the Knowledge Graph - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It took me a month and hours of experimentation and updating things and coding - but I can proudly now say - I am an entity too.",
  "content": "I Became an Entity: How I'm on the Knowledge Graph Advanced SEO By: Krystian Szastok February 4, 2014 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Krystian Szastok February 4, 2014 I Became an Entity: How I'm on the Knowledge Graph Advanced SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. A while ago I read the very popular post from Andrew Isidoro I Am an Entity: Hacking the Knowledge Graph. Before that I knew very little about knowledge graph - I knew most entries are sourced from Wikipedia and that occasionally you get a Google+ result if a business has a page. Andrew's post was an eye opener - finally an actionable case study that explained a lot more about how the Knowledge Graph works and what is Freebase. Success It took me a month and hours of experimentation and updating things and coding - but I can proudly now say - I am an entity too. This blog post describes what I've done and will hopefully encourage more to experiment with Knowledge Graph. I have to say I can't guarantee following these steps will work for everyone - it worked for me and I'm quite sure anyone can repeat this. I also am aware this is not the best way to get it done. I just improvised/replicated as much as possible from Andrew's and other people's profiles. Ingredients Here's what it takes to accomplish the task: A few hours of your time - I invested about 6-8 hours Basic coding skills - I am providing examples here Ideally your own site/blog - can be on a free hosting Social accounts such as Twitter, Facebook, Google+ and LinkedIn Accounts on Wikipedia and Freebase Process Here's what I've done in steps (I am assuming by now you have all the ingredients necessary): I've set up myself a Wikipedia account similar to the one in Andrew's post. I also then spent an hour or so (in a few separate sessions) to help clean up listings and updated a few. I then went onto set up a Freebase account and then carefully started crafting my own Topic: Myself. Again, I used Andrew's profile and aimed at getting as many entries as he had - in the best way I could. I focused on elements like age, date of birth, career, description etc I took an hour or two to complete as many things as I could. I copied some advanced Person Schema code from Andrew's site which he referenced to. I just tried to match as many things as he had going for him in whatever way I could. Also the very important 'sameas'. Here is the code I used on my site, I highlighted in yellow the important bits: Feel free to go to my site, search the source code and copy relevant bits of code. I am not 100% sure if I applied them correctly - but I am now in the Knowledge Graph so I can only hope. If anyone can see any mistakes here please let me know as I may be doing this completely wrong. Then waiting started - I made that profile in early-ish December I think - completed all actions within the next few days. Then I patiently waited and waited. I checked almost every day until today I finally noticed I can ask Google things like my age, height, weight and place of birth: The breakthrough The breakthrough happened in early January - previously when I searched Freebase for 'Krystian Szastok' I only got my entry marked as 'user' - which wasn't similar to Andrew's who had 'Marketer' as his type. One day I searched and a duplicate entry appeared, showing me as a 'Hobbyist' - Okay - not ideal, but at least I wasn't 'just a user' anymore - something was happening! And my previous entry changed to 'Man' - not 'user'. This new entry was time stamped 8th of January - by someone working on the Freebase staff apparently. One of the differences being - this one had 'Facebook' as me on the web - as opposed to my original entry, which had Wikipedia. Here are the two to compare, my original user entry here and my new entry from the staff here. Notice the following differences: Old entry is marked as User - new is a Topic Old has Wikipedia as 'on the web' - new is 'Facebook' Old had the following entries that weren't 'transferred' in the new one: Also known as, description, Topic web page and the social media profiles, different notable types, favourite movies. Summary I am in no way an expert in this area - I do love the concept though and I do believe that learning about Schema and how Google is using Freebase to populate Knowledge Graph is an essential learning for anyone who dares to call themselves a 'SEO expert' (or ninja, or guru, whatever tickles your fancy). I do believe there are better processes to get into the Knowledge Graph - my profile is still missing so many of things that Andrew Isidoro's has - things like the photo just to mention one. It's all on my to-do list - I aim to improve my profile with time and to fix other things and experiment more with Schema. I really hope more case studies will come up with uses of Freebase - please don't go just spamming it, use it to become an entity and a topic - not for rankings or links... I wish you all the luck and I look forward to any comments. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "I Became an Entity: How I'm on the Knowledge Graph"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "I Became an Entity: How I'm on the Knowledge Graph"
    },
    {
      "level": "H2",
      "text": "Success"
    },
    {
      "level": "H2",
      "text": "Ingredients"
    },
    {
      "level": "H2",
      "text": "Process"
    },
    {
      "level": "H2",
      "text": "The breakthrough"
    },
    {
      "level": "H2",
      "text": "Summary"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Krystian Szastok\n          \n            Krystian Szastok\n          \n            Krystian Szastok"
}