{
  "url": "https://moz.com/blog/i-cant-drive-155-meta-descriptions-in-2015",
  "slug": "i-cant-drive-155-meta-descriptions-in-2015",
  "title": "I Can't Drive 155: Meta Descriptions in 2015 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For years, we've suggested a 155-character limit to meta descriptions. As long snippets appear more and more often, is it time to revise that rule?",
  "content": "I Can't Drive 155: Meta Descriptions in 2015 On-page SEO | Advanced SEO By: Dr. Peter J. Meyers May 7, 2015 Table of Contents Copied! By: Dr. Peter J. Meyers May 7, 2015 I Can't Drive 155: Meta Descriptions in 2015 On-page SEO | Advanced SEO For years now, we (and many others) have been recommending keeping your Meta Descriptions shorter than about 155-160 characters. For months, people have been sending me examples of search snippets that clearly broke that rule, like this one (on a search for “hummingbird food”): For the record, this one clocks in at 317 characters (counting spaces). So, I set out to discover if these long descriptions were exceptions to the rule, or if we need to change the rules. I collected the search snippets across the MozCast 10K, which resulted in 92,669 snippets. All of the data in this post was collected on April 13, 2015. The Basic Data The minimum snippet length was zero characters. There were 69 zero-length snippets, but most of these were the new generation of answer box, that appears organic but doesn't have a snippet. To put it another way, these were misidentified as organic by my code. The other 0-length snippets were local one-boxes that appeared as organic but had no snippet, such as this one for \"chichen itza\": These zero-length snippets were removed from further analysis, but considering that they only accounted for 0.07% of the total data, they didn't really impact the conclusions either way. The shortest legitimate, non-zero snippet was 7 characters long, on a search for \"geek and sundry\", and appears to have come directly from the site's meta description: The maximum snippet length that day (this is a highly dynamic situation) was 372 characters. The winner appeared on a search for \"benefits of apple cider vinegar\": The average length of all of the snippets in our data set (not counting zero-length snippets) was 143.5 characters, and the median length was 152 characters. Of course, this can be misleading, since some snippets are shorter than the limit and others are being artificially truncated by Google. So, let's dig a bit deeper.The Bigger Picture To get a better idea of the big picture, let's take a look at the display length of all 92,600 snippets (with non-zero length), split into 20-character buckets (0-20, 21-40, etc.): Most of the snippets (62.1%) cut off as expected, right in the 141-160 character bucket. Of course, some snippets were shorter than that, and didn't need to be cut off, and some broke the rules. About 1% (1,010) of the snippets in our data set measured 200 or more characters. That's not a huge number, but it's enough to take seriously. That 141-160 character bucket is dwarfing everything else, so let's zoom in a bit on the cut-off range, and just look at snippets in the 120-200 character range (in this case, by 5-character bins): Zooming in, the bulk of the snippets are displaying at lengths between about 146-165 characters. There are plenty of exceptions to the 155-160 character guideline, but for the most part, they do seem to be exceptions. Finally, let's zoom in on the rule-breakers. This is the distribution of snippets displaying 191+ characters, bucketed in 10-character bins (191-200, 201-210, etc.): Please note that the Y-axis scale is much smaller than in the previous 2 graphs, but there is a pretty solid spread, with a decent chunk of snippets displaying more than 300 characters. Without looking at every original meta description tag, it's very difficult to tell exactly how many snippets have been truncated by Google, but we do have a proxy. Snippets that have been truncated end in an ellipsis (...), which rarely appears at the end of a natural description. In this data set, more than half of all snippets (52.8%) ended in an ellipsis, so we're still seeing a lot of meta descriptions being cut off. I should add that, unlike titles/headlines, it isn't clear whether Google is cutting off snippets by pixel width or character count, since that cut-off is done on the server-side. In most cases, Google will cut before the end of the second line, but sometimes they cut well before this, which could suggest a character-based limit. They also cut off at whole words, which can make the numbers a bit tougher to interpret. The Cutting Room Floor There's another difficulty with telling exactly how many meta descriptions Google has modified – some edits are minor, and some are major. One minor edit is when Google adds some additional information to a snippet, such as a date at the beginning. Here's an example (from a search for \"chicken pox\"): With the date (and minus the ellipsis), this snippet is 164 characters long, which suggests Google isn't counting the added text against the length limit. What's interesting is that the rest comes directly from the meta description on the site, except that the site's description starts with \"Chickenpox.\" and Google has removed that keyword. As a human, I'd say this matches the meta description, but a bot has a very hard time telling a minor edit from a complete rewrite. Another minor rewrite occurs in snippets that start with search result counts: Here, we're at 172 characters (with spaces and minus the ellipsis), and Google has even let this snippet roll over to a third line. So, again, it seems like the added information at the beginning isn't counting against the length limit. All told, 11.6% of the snippets in our data set had some kind of Google-generated data, so this type of minor rewrite is pretty common. Even if Google honors most of your meta description, you may see small edits. Let's look at our big winner, the 372-character description. Here's what we saw in the snippet: Jan 26, 2015 - Health• Diabetes Prevention: Multiple studies have shown a correlation between apple cider vinegar and lower blood sugar levels. ... • Weight Loss: Consuming apple cider vinegar can help you feel more full, which can help you eat less. ... • Lower Cholesterol: ... • Detox: ... • Digestive Aid: ... • Itchy or Sunburned Skin: ... • Energy Boost:1 more items So, what about the meta description? Here's what we actually see in the tag: Were you aware of all the uses of apple cider vinegar? From cleansing to healing, to preventing diabetes, ACV is a pantry staple you need in your home. That's a bit more than just a couple of edits. So, what's happening here? Well, there's a clue on that same page, where we see yet another rule-breaking snippet: You might be wondering why this snippet is any more interesting than the other one. If you could see the top of the SERP, you'd know why, because it looks something like this: Google is automatically extracting list-style data from these pages to fuel the expansion of the Knowledge Graph. In one case, that data is replacing a snippet and going directly into an answer box, but they're performing the same translation even for some other snippets on the page. So, does every 2nd-generation answer box yield long snippets? After 3 hours of inadvisable mySQL queries, I can tell you that the answer is a resounding \"probably not\". You can have 2nd-gen answer boxes without long snippets and you can have long snippets without 2nd-gen answer boxes, but there does appear to be a connection between long snippets and Knowledge Graph in some cases. One interesting connection is that Google has begun bolding keywords that seem like answers to the query (and not just synonyms for the query). Below is an example from a search for \"mono symptoms\". There's an answer box for this query, but the snippet below is not from the site in the answer box: Notice the bolded words – \"fatigue\", \"sore throat\", \"fever\", \"headache\", \"rash\". These aren't synonyms for the search phrase; these are actual symptoms of mono. This data isn't coming from the meta description, but from a bulleted list on the target page. Again, it appears that Google is trying to use the snippet to answer a question, and has gone well beyond just matching keywords. Just for fun, let's look at one more, where there's no clear connection to the Knowledge Graph. Here's a snippet from a search for \"sons of anarchy season 4\": This page has no answer box, and the information extracted is odd at best. The snippet bears little or no resemblance to the site's meta description. The number string at the beginning comes out of a rating widget, and some of the text isn't even clearly available on the page. This seems to be an example of Google acknowledging IMDb as a high-authority site and desperately trying to match any text they can to the query, resulting in a Frankenstein's snippet.The Final Verdict If all of this seems confusing, that's probably because it is. Google is taking a lot more liberties with snippets these days, both to better match queries, to add details they feel are important, or to help build and support the Knowledge Graph. So, let's get back to the original question – is it time to revise the 155(ish) character guideline? My gut feeling is: not yet. To begin with, the vast majority of snippets are still falling in that 145-165 character range. In addition, the exceptions to the rule are not only atypical situations, but in most cases those long snippets don't seem to represent the original meta description. In other words, even if Google does grant you extra characters, they probably won't be the extra characters you asked for in the first place.Many people have asked: \"How do I make sure that Google shows my meta description as is?\" I'm afraid the answer is: \"You don't.\" If this is very important to you, I would recommend keeping your description below the 155-character limit, and making sure that it's a good match to your target keyword concepts. I suspect Google is going to take more liberties with snippets over time, and we're going to have to let go of our obsession with having total control over the SERPs. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "I Can't Drive 155: Meta Descriptions in 2015"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "I Can't Drive 155: Meta Descriptions in 2015"
    },
    {
      "level": "H2",
      "text": "The Basic Data"
    },
    {
      "level": "H2",
      "text": "The Bigger Picture"
    },
    {
      "level": "H2",
      "text": "The Cutting Room Floor"
    },
    {
      "level": "H2",
      "text": "The Final Verdict"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}