{
  "url": "https://moz.com/blog/i-disagree-with-danny-the-google-engineers-about-link-buying-practices",
  "slug": "i-disagree-with-danny-the-google-engineers-about-link-buying-practices",
  "title": "I Disagree with Danny & the Google Engineers About Link Buying Practices - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "SEOmoz is, in my opinion, as \"white-hat\" in our optimization practices as an SEO firm can get with being illogical. Yet, we still advise some of our smaller and mid-size clients to buy links - we even go as far as to buy links for our own in-house projects. This practice would seem to directly…",
  "content": "I Disagree with Danny & the Google Engineers About Link Buying Practices Link Building By: Rand Fishkin December 19, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 19, 2006 I Disagree with Danny & the Google Engineers About Link Buying Practices Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. SEOmoz is, in my opinion, as \"white-hat\" in our optimization practices as an SEO firm can get with being illogical. Yet, we still advise some of our smaller and mid-size clients to buy links - we even go as far as to buy links for our own in-house projects. This practice would seem to directly conflict with every piece of advice given by prominent search engineers and, most recently, repeated by our fearless leader, Danny Sullivan. In this post from SEL last Friday, Danny wrote about Google's Webmaster Central blog post - Building Link Based Popularity in his own post - Stop the Freak Out Over Linking. First, let's hear from Google: One of the issues that came up in sessions and in conversations was a certain confusion about how to most effectively increase the link-based popularity of a website. As a result we thought it might be helpful to clarify how search engines treat link spamming to increase a site's popularity. This confusion lies in the common belief that there are two ways for optimizing the link-based popularity of your website: Either the meritocratic and long-term option of developing natural links or the risky and short-term option of non-earned backlinks via link spamming tactics such as buying links. This relates to Danny's rule for buying links: Rule 2 - Buy links if visitors that come solely from the link will justify the cost Is Google discounting paid links? Did the site owner block link love with nofollow? Is the link one of hundreds on a page and perhaps not likely to give you as much link juice? Is the site banned from passing link benefits? Uncertain of all this? Then don't buy links hoping they'll boost you in the search engines. Buy them because you think you'll get traffic from them. And if you do buy them for this reason, then I'd recommend using the nofollow attribute with them. That ensures the search engines know you aren't trying to some how trick them. Don't like my advice and want to buy link love. That's your decision, of course. What I like about Danny's rule is that it subtly suggests that if you can justify the value of the link solely from the visitors, you've got a great case for acquiring that link. What I don't like about it is that Danny's toeing the Google line by suggesting that you should add \"nofollow\" to paid links. No. No, no, no, no, no, no. Nofollow means \"I do not editorially vouch for the quality of this link.\" It does NOT mean \"financial interest may have influenced my decision to link.\" If that were the case, fully a quarter of all links on the web would require nofollow (that's a rough guess, but probably close to the mark). Certainly any website that earns money via its operation, directly or indirectly is guilty of linking to their own material and that of others in the hopes that it will benefit them financially. It is not only unreasonable but illogical to ask that webmasters around the world change their code to ensure that once the chance of financial benefit reaches a certain level (say, you're about 90% sure a link will make you some money), you add a \"nofollow\" onto the link. Yes, I know I'm being particularly literal here, but I believe that Google either has to be 100% specific, writing paragraphs of exceptions and rules, or drop the idea that it has the authority or right to control link code on the web via the threat of \"losing trust\". There's a far more elegant solution to this issue - evaluate trust in links algorithmically (or via human reviews if you prefer). Don't crawl the web and say \"hey... it looks like that link might have financial interest behind it.\" Instead, look at all the links on a site (or the ones you're worried about) and ask - do these seem like high quality links that would have received a vote of confidence (regardless of whether the motivation is selfish or selfless)? If the answer is yes, there's really no reason to discount link value or drop other penalties. The reverse here applies, too. If a site is linking out to generally junky crap, there's no reason to count those links just because you think it's a \"selfless,\" non-financially-motivated gesture. If you believe that money really is the root of all evil over there in the 'plex, that would be one thing, but you clearly don't and you're clearly a supporting member of democratic capitalism (I know, I know, it's the \"worst model of government ever... except for every other model that's ever been tried\"). In the long run, capitalism, from both a macro and micro-economic perspective will do a lot of the sorting for you. Those sites that buy links, convert visitors and have success will be the same ones who can afford to buy links and see a positive ROI from those purchases - shockingly enough, these savvy, wily, evil websites are the ones that are providing a good user experience (unless they're doing naughty arbitrage or use low quality content ads to make their money, but you KNOW how to fix that). Here's why YOU, as a webmaster should be buying links. Let's say you're a roofing contractor in Seattle. You want to rank well for \"roofing services Seattle.\" In the search results, you note that seattleroofbroker.com and citysearch.com and infospace.com and localwin.com all rank in the top 10 and each of them has an opportunity, some obvious, others behind-the-scenes, to acquire a link from those pages (or other pages on those sites) by paying money. Those sites are basically trustworthy and honest - they're not \"selling pagerank,\" they're not \"search engine manipulators,\" but if you took Google's advice and requested a nofollow on your links (since you paid for them), you'd be at a huge competitive disadvantage to your slightly less pointy-white-hat competitor. Here's what I'd love to see as a statement from Google in their next written statement on the subject: Honestly, if a relevant, high-quality link requires financial compensation to acquire, we have no problem with that. We may have an algorithmic preference for links that point to content without a monetary incentive, but that doesn't mean you can't find good links that need to be bought. However, we're pretty darn good at evaluating who's selling \"PageRank\" and who's trying to manipulate us with their link schemes. When we see that, we're going to do our best to discount it and oftentimes, that means removing a site's ability to pass link juice. If you're selling links, you should think about whether you're giving those links a good, solid editorial review and adding value for your visitors, because that's what we're thinking about, too. The ironic part about issuing this statement is that, at least in my mind, almost nothing would change in the webmaster community, in the world of paid links or in the world of search relevancy. The only thing that would change is that we'd all be more honest and upfront with one another, and I think that's a really good thing. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "I Disagree with Danny & the Google Engineers About Link Buying Practices"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "I Disagree with Danny & the Google Engineers About Link Buying Practices"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}