{
  "url": "https://moz.com/blog/i-dont-buy-links",
  "slug": "i-dont-buy-links",
  "title": "I Don't Buy Links - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In my eyes, there is no paid links debate - I simply don't buy links, for our own sites, or those of our clients.  This post will lay out the basics of why we don't buy links, and is the first in a series on link building strategies.  To set the record straight up front - I am not telling you that…",
  "content": "I Don't Buy Links Link Building By: Eric Enge February 20, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Eric Enge February 20, 2008 I Don't Buy Links Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In my eyes, there is no paid links debate - I simply don't buy links, for our own sites, or those of our clients. This post will lay out the basics of why we don't buy links, and is the first in a series on link building strategies. To set the record straight up front - I am not telling you that you should not buy links. However, if you do, you should fully understand the risks that you are taking. Let's start with a look at Google's policies. Google's Policies It all starts in the Google Webmaster Guidelines with an article titled Link Schemes. This article states that Examples of Link Schemes can include: Links intended to manipulate PageRank Links to web spammers or bad neighborhoods on the web Excessive reciprocal links or excessive link exchanging (\"Link to me and I'll link to you.\") Buying or selling links that pass PageRank These policies are further reinforced by various posts on Matt Cutt's blog. Here are some of the key ones: Selling Links that Pass Page Rank How to Report Paid Links Google Hell Popular Complaints and Misconceptions There are many aspects to this that are not well explained. Here are a few examples: 1. There is a lot of confusion about how directories like the Yahoo! directory work, as is shown by this post on Jim Boykin's blog including the comments made on the post. The bottom line is that Google will accept links from directories that have a strong editorial policy. Yahoo, for example, will take your $299 and does not guarantee you a listing at all, and even if you get a listing, it may not be placed where you asked, or with the description you asked for. The big issue here is that Google trusts Yahoo's editorial judgment. While Yahoo's editors do make mistakes and occasionally let some pretty crappy sites in their directory, they are in general pretty good. There are other directories which Google respects. Google does not publish a list. However, I would assert that only about 20% of all directories meet Google's criteria. There are probably a small number of truly horizontal directories (that cover the whole web), and then a larger number of vertical industry specific directories that they would intend to respect. To make matters more confusing, a number of SEOs have told me that buying links from 300 directories often works well for smaller businesses. This may in fact be the case. What makes the whole thing more complex is that Google uses an \"opt out\" strategy as opposed to an \"opt in\" strategy. To repeat in understandable English, Google does not appear to deny directories the ability to pass PageRank by default, and then only enable this ability in directories that they have reviewed and approved by hand. As with all sites, directories naturally have the ability to pass PageRank until some algorithmic or manual review process causes the ability to pass PageRank is taken away from a site or directory. However, you need to know that it is Google's intent that buying links from crappy directories (including any program that offers hundreds of directory links for a fee) will add no value. 2. People then want to argue that Pay Per Post schemes should have value. The argument goes that this is just like the Yahoo directory review, and the blogger would not write about a topic, even if they are paid, unless they believed in it. The problem is that this program grew up around the notion of passing link juice. And, Google is not going to be comfortable about the blogger's motives in writing about something they got paid to write about. 3. Another argument is that \"Google is trying to control the web and they don't have the right to do that. Google is telling us not to buy links, and it's our web and not theirs.\" Here is the Google statement on buying links for advertising purposes: Not all paid links violate our guidelines. Buying and selling links is a normal part of the economy of the web when done for advertising purposes, and not for manipulation of search results. Links purchased for advertising should be designated as such. This can be done in several ways, such as: Adding a rel=\"nofollow\" attribute to the tag Redirecting the links to an intermediate page that is blocked from search engines with a robots.txt file OK, so the NoFollow thing drives people nuts, and you really can't blame them for that. There is a valid reason for the frustration, because small web site owners who are not SEO experts don't even know what a NoFollow is. However, bear in mind that what Google does, unless buying and selling of links rises to truly abusive levels, is simply stop the link from passing PageRank. Google openly acknowledges that sites have the right to buy and sell links. If you do it within their guidelines, great, and if you don't you may lose some or all of your Google search traffic when they discover your purchased links and disable them. But, in no event are they preventing you from buying or selling a link. 4. Google sells links through AdWords and AdSense. Why, yes they do. And your AdWords ad campaign passes no PageRank whatsoever to your site. How Google Can Discover Paid Links A while back I did a post called 15 Methods for Paid Link Detection. Here is a list of the methods I discussed in that post: Links Labeled as Advertisements Site Wides Links Are Sold By a Link Agency Selling Site Has Information on How to Buy a Text Link Ad Relevance of Your Link Relevance of Nearby Links Advertising Location Type Someone Reports Your Site for Buying Links Someone Reports Your Site for Some Other Reason Someone Reports the Site you Bought Links from for Selling Links Someone Reports the Site you Bought Links from for Some Other Reason Disgruntled Employee Leaves Your Company, and Reports Your Site Disgruntled Employee Leaves the Agency Your Used, and Reports Your Site Disgruntled Employee Leaves the Company of the Site You Bought Links from, and Reports Your Site Internal Human Review There are two major methods I want to emphasize here. These are: 1. Your competitor can report you. It's the grim truth that your paid links can be reported by your competitor. There is a form built right into Google Webmaster Tools. Here is what it looks like: This should be your biggest worry if you buy or sell links. Your competitor has every incentive to report you, and you have every incentive to report them. The form is completely anonymous, so there is no risk of exposure for outing a site. While Matt Cutts does describe an unauthenticated way to report paid links, the most effective way is through using the form within Webmaster Tools. Google guarantees a review of all such submissions, usually within 48 hours. 2. Bloggers can call sites out. This has happened twice in recent memory. For example, when Forbes was recently found to be selling links, and before that the United Parcel Service, they were discovered by bloggers and called out. Of course, both of these programs were rapidly disable by Google. Actions Google Can Take As we have already discussed, the basic action Google takes is to remove a links ability to pass PageRank. Google's objective is to do this to every paid link on the web. Their objective is not possible to achieve, of course, but they are doing everything they can to achieve it. Don't forget, your competitor can report you, so this is not just about their ability to detect the link algorithmically. If this is the only punishment you receive, it's not so bad, really. However, it can get worse. Now Google has confirmed that they will take action to punish sites that buy or sell links. Over at Search Engine Land, Danny Sullivan covered this in detail in his post Official: Selling Paid Links Can Hurt Your PageRank Or Rankings On Google. Here is a snippet from that post: So I pinged Google, and they confirmed that PageRank scores are being lowered for some sites that sell links. In addition, Google said that some sites that are selling links may indeed end up being dropped from its search engine or have penalties attached to prevent them from ranking well. The first visible step was to lower the PageRank of sites selling paid links. Since links are usually priced in relationship to their PageRank, this was an algorithmic way that Google could lower the value of selling links. So far, most sites that were subjected to lowered Page Rank who have also talked about their traffic after that occurred report that their traffic has not suffered as a result. This particular move does seem to be an effort of lowering the market value of links on sites that sell links. However, don't get too cozy or comfortable that your traffic won't be at risk here. Once Google has a high degree of confidence that you are engaging in the practice of buying or selling links at an egregious level, they can and will take stronger action. The PageRank lowering move was a broad algorithmic move. Google likely felt OK with it, because all it did was lower the value of links sold from a large number of sites. As a broad algorithmic move, there is always the chance of some degree of error (sites that get unfairly punished). However, since traffic was not impacted, how punished were they, really? Your Real Target for Links Enough philosophy on the risks of buying links. Let's talk about where you really want to get links from. You know what I mean: authoritative sites. Sites like these: USA.gov Home Page MIT Home Page Generally speaking, you can't get links from sites like these unless they decide to give them to you because of your great content or tools. There are exceptions, of course, but those will all eventually be discovered and exposed by the blogosphere, or your competitors. If there is a safe haven for buying links, it's on smaller lesser known sites, which, of course, have less value as a link. If you managed somehow to scam a link on the MIT site, someone is going to find and talk about it. Scamming such a link may be a great temporary win, but no way to build a long term business. The question to ask here is why are sites like these going to link to you? Of course, it does need to be these exact sites. You need to find the authoritative sites related to your web site's topic matter. Then think long and hard about the answer to the question just asked. This is the beginning of where long term stable cash flow is born ... Summary This topic was addressed a while back in an indirect fashion by Seth Godin in his post in which he told us to not bet against Building 43. You can think of it as an arms race if you want, and you can win for a while around the edges of Google's rules. You may even be able to win for years that way. But the game is rigged against you. My advice is, if you care about Google traffic: Don't buy links. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "I Don't Buy Links"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "I Don't Buy Links"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Eric Enge\n          \n            Eric Enge"
}