{
  "url": "https://moz.com/blog/i-hate-the-advertising-baitandswitch-but-theres-a-lesson-here",
  "slug": "i-hate-the-advertising-baitandswitch-but-theres-a-lesson-here",
  "title": "I Hate the Advertising Bait-and-Switch, But There's a Lesson Here - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I was browsing on Technorati today (mostly because Google Blog Search has gone down the toilet in the past 3 weeks) and came across one of the first banner ads to have caught my attention in years:\n\nNow, I'll admit, I'm a complete s...",
  "content": "I Hate the Advertising Bait-and-Switch, But There's a Lesson Here Online Advertising By: Rand Fishkin March 27, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 27, 2008 I Hate the Advertising Bait-and-Switch, But There's a Lesson Here Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I was browsing on Technorati today (mostly because Google Blog Search has gone down the toilet in the past 3 weeks) and came across one of the first banner ads to have caught my attention in years: Now, I'll admit, I'm a complete sissy. I've been in precisely three fights in my life, all of them before the age of 18 and I only won one (and that was because two other nearby kids happened to hate the guy I was fighting just as much as I did). Plus, I've got an affinity for deliciously sordid British phrases like \"I'll do you like a kipper,\" which I assume is some kind of fish that Britons enjoy kicking to refresh their briny scent. Imagine my utter dismay when I reached this page: _ What the hell, Toyota? Not only are you a car company (having nothing to do with the glorious pasttime that is pub-fighting), you're also not even trying to relate your content to the ad I clicked. At least show some olde tyme ass-whoopin' moves that I can pull on Sir Rubbish-the-Barstool-Tosser and Lord Knicker-Bottom before they turn my groin to pudding. What's the lesson here? The right ads can attract even the savviest and most jaded of web surfers. And the wrong content can actually make them less likely to buy your products through negative branding. Think carefully ad designers - those clicks are hard enough to come by. p.s. Yes, I actually did write this post myself; it's not secretly by Rebecca. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "I Hate the Advertising Bait-and-Switch, But There's a Lesson Here"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "I Hate the Advertising Bait-and-Switch, But There's a Lesson Here"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}