{
  "url": "https://moz.com/blog/i-have-a-headache",
  "slug": "i-have-a-headache",
  "title": "I have a headache. - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Why? Because SEO is a never ending quagmire.  For the last six month I have immersed myself in what Search Engine Optimization means and am left with the realization that getting to the top of the SERPS for any commerical and competitive term is hard work (no suprise there), harder than I thought.…",
  "content": "I have a headache. Public Relations J By: JohnBarton May 3, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! J By: JohnBarton May 3, 2007 I have a headache. Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Why? Because SEO is a never ending quagmire. For the last six months I have immersed myself in what Search Engine Optimization means, and I am left with the realization that getting to the top of the SERPS for any commercial and competitive term is hard work (no surpise there), harder than I thought. And it is an ever moving target. The concepts are pretty much the same across the board. Get high quality one-way relevant links that are or appear naturally grown. Be spider friendly. Don't link to bad places. Provide lots of content, (except for John Scott, who doesn't think content is worth anything). And so on..... Well, after all this time and the endless blogs and forum posts I have read I have one piece of advice: stop talking and start doing. With that in mind, I think I am ready to start walking on this quicksand infested field for keeps. We aren't hiring any other company to do it for us. I have come to feel that if you intend to make money on the web, then SEO is a part of doing business and a part which needs to be done in house and correctly. Just now I am thinking of all the emails I get from folks who tell me they're starting a website. I am thinking of the web designers who give me blank stares when I ask them if they design for SEO. I liken a website that's invisible in the SERPS to having the coolest house on Pluto. Big deal if no one knows it's there, and no one can get there unless they know the address and have a teleporter. So our SEO - which isn't terrible now with top five rankings for most of the top keywords - is about to get a whole lot better as I hire web designers and people who are trained in onsite and offsite optimization and build a team to analyze, test, and implement. We're going to bet our competition in the SERPS in every category. Thank you, SEO community, for being so open about what you do and how you do it. You have been the foundation of what my team will be built on. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "I have a headache."
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "I have a headache."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "JohnBarton\n          \n            JohnBarton"
}