{
  "url": "https://moz.com/blog/i-tie-up-mike-mcdonald-interview-vanessa-fox-again",
  "slug": "i-tie-up-mike-mcdonald-interview-vanessa-fox-again",
  "title": "I Tie Up Mike McDonald & Interview Vanessa Fox... Again. - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Twenty-Eight Minutes... More than a full TV show worth of content, in-jokes and Google tips from a conversation with Vanessa Fox from Google's Webmaster Central team....",
  "content": "I Tie Up Mike McDonald & Interview Vanessa Fox... Again. Public Relations By: Rand Fishkin April 12, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 12, 2007 I Tie Up Mike McDonald & Interview Vanessa Fox... Again. Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Twenty-Eight Minutes... More than a full TV show worth of content, in-jokes and Google tips from a conversation with Vanessa Fox from Google's Webmaster Central team came out of yesterday's antics. The video is here. Content includes: Google Base Listings Sitemaps for Google News New Sitemaps.org Iniatitives New Functionality for Webmaster Central Delete URL Live PR Score Alexa-like Functionality Link Sorting in Webmaster Supplemental Index Link Penalty Notifications Links to Dead/Error Pages Orphaned Pages in Sitemaps Search Results in the Google Search Results Moving Sites and Avoiding the Temporary Loss of Rankings (if you watch nothing else, go to 6:15 in the piece and watch for Vanessa's answers) Rebecca's Comics Vanessa vs. Kelly in Rock'em'Sock'em Robots at the Vintage Dinner There's a lot of great stuff in here: Thanks, Vanessa - I really appreciate your participation. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "I Tie Up Mike McDonald & Interview Vanessa Fox... Again."
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "I Tie Up Mike McDonald & Interview Vanessa Fox... Again."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}