{
  "url": "https://moz.com/blog/i-used-to-respect-robert-scobles-opinion",
  "slug": "i-used-to-respect-robert-scobles-opinion",
  "title": "I Used to Respect Robert Scoble's Opinion... - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Like many fans of the web, I've been a great admirer of Robert Scoble, noted technology blogger and former Microsoftee, since I first saw his work (probably around 2004). However, after watching this bizarre video on how Mahalo, Facebook & Techmeme are going to beat Google in search, I think I'll…",
  "content": "I Used to Respect Robert Scoble's Opinion... Public Relations By: Rand Fishkin August 26, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 26, 2007 I Used to Respect Robert Scoble's Opinion... Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Like many fans of the web, I've been a great admirer of Robert Scoble, noted technology blogger and former Microsoftee, since I first saw his work (probably around 2004). However, after watching this bizarre video on how Mahalo, Facebook & Techmeme are going to beat Google in search, I think I'll have a tough time respecting his opinions on future topics. Let me get this straight for the record - I have no problem with Robert attacking SEO - he's certainly welcome to do so, and there have been plenty of intelligent attacks on the practice and on the negative impacts it often has on search results (most notable among these for me is my fiancee, who helps remind me of the weaknesses of this job that I love). What really bothers me is his seemingly complete lack of understanding of the search market, the search engine user or how to effectively argue his position. I went into the video expecting quite a bit of great discussion on the topic and came away incredibly disappointed. I think Robert actually damages Mahalo's credibility by attempting to defend them in this video. Let's walk through the various points he makes and I'll attempt to show you where my thoughts (and, in my opinion, reality) diverged from what Robert had to say. I've done my best to grab the audio sound bytes as accurately as possible, but I won't claim to have it perfect, and I am excerpting here. ...the social graph system (which he uses to refer to the social technologies behind sites like Mahalo, Techmeme and Facebook) is going to upend Google in about 4 years. I'm not precisely sure why this is Robert's deadline, but he seems pretty firm about sticking to it later in the video, so he must have a reason for this belief. Do a search on Google for HDTV and do a search on Mahalo for HDTV. OK. I've done 'em both. Here you go - side by side: My personal opinion - Mahalo has more links, and they're trying to guess at what I mean when I ask for HDTV by disambiguating and giving me multiple types of results for other related queries. At Google, I get the descriptions and the URLs, which is really nice, because at Mahalo, I don't know necessarily where I'm going if I click those links and there's not much information attached to them except their 2-3 word titles. However, I concede the point that to a power user like Robert, maybe the Mahalo results are \"better.\" Why do we care about Alfred Poor and what he thinks? I have to say that I'm kinda pissed at Robert for making fun of Alfred Poor and acting as though no one should care what he thinks about HDTVs. I don't personally know Mr. Poor, and after visiting his site, I can say that I'm actually not a huge fan, although he does have some pretty good information there. However, just seeing Robert bash him with that smirky grin and knowing that he never even bothered to visit the site to see if it was a good result is incredibly irksome. All of them mention HDTV in their title tags, their H1 tags, their P tags and have a lot of inbound links Robert's point is that this is a bad thing - websites and page shouldn't have to (in his mind) label their pages properly from a semantic point of view just to be ranked well at the search engines. If the pages are relevant and high quality, the engine should list them regardless of keyword usage or links. What don't you see? You don't see HDTV manufacturers. All I can really say here is - if you wanted manufacturers, why didn't you tell Google (and Mahalo) that, instead of doing the broad search for \"HDTV?\" This whole time you've been playing the role of a power user who doesn't need Google to hold your hand or give you extra information, but now when Mahalo will do it for you, it's suddenly a good thing. If your spidey senses aren't tingling just yet, wait. The first thing you need to know is the manufacturers. Why isn't the first thing you need to know retailers? Or about the technology? Or what the picture looks like in comparison with regular TVs? Or even what the heck HDTV stands for? I'm not sure why Robert thinks that he's the arbiter for what everyone in the world searching for HDTVs intended with that query. On the Google page there's no manufacturers. Umm... The 1st, 3rd and 4th results at Google all show fairly comprehensive lists of manufacturers. And, besides that, I'm still kind of stuck on why you didn't search for \"list of hdtv manufacturers\" if that was your goal. The noise level on the Google page has gotten wacky, and I've seen this over and over and over again. Really? I see a lot of signal on the Google page. In fact, I'd say that categorically, the only results that have any \"noise\" to them in relation to the general query, HDTV, are the 2nd result - HDTV.net (which is kind of junky) and the 8th result, HDTVprofessor, which we mentioned above. On the search for New York Hotels, you don't find any New York Hotels; you have to click on the local thing, but it's out of order and most people don't know to click on those links. Right? This is Google's problem; they have 118 services and we don't know what they are. Huh? You've completely lost me. I'm looking at the New York Hotels page results and I see a lot of New York Hotels. And if you're missing the local results, you must have some serious eye problems; just look: That big map up top - yeah, that's the local results. If you can't see it, or you assume that no one knows to use it, I think you should spend some time with the folks who do eye-tracking and clickthrough heatmaps. They'll probably tell you that those maps work pretty well for most users. And, even if you're not happy with the map, or don't like the ordering of the local results, just click any of the listings on the page! They all take you to really good pages with lists of New York hotels. I'm really struggling with your disdain for these search results. How many people use Google Mail? Not many, not out of the world - Yahoo! mail still has a lot more users and Hotmail still has a lot more users. You've lost me here. If I understand your logic, you're trying to say that Google has done a poor job in search because it hasn't gotten users to adopt Picasa and Gmail as widely as other services, right? And this somehow relates to how Mahalo is going to beat them? Very perplexing... I go to Mahalo... and I see the top 7, I see HDTV information & reviews, I see HDTV manufacturers and HDTV retailers. Wow! That's much better. Because, first of all, I can skip all that stuff and go right to the manufacturers and see all the manufacturers and, actually, the list is really incomplete right now Alright - I won't argue that you seem to like the Mahalo search results page a lot more. I don't doubt that for some users it might actually be a better experience. But, if I've learned anything in my years of watching people search, it's that people on the web are really happy with their blue links and their descriptions and their green URLs and when you change that, even a little, they start searching for their favorite term - Google. But if you do a search at Google for HDTV manufacturers, this (the Mahalo) list has no noise. No SEO! God damn it! No SEO! It's great. No noise. OK? OK, I get it - you despise SEO. You hate it with such a passion that its practically oozing out of your pores. This point in the video is the most animated and excited you'll see Robert on the whole tape. He's psyched to be calling out SEO - he's swearing and pointing and laughing in an exceptionally condescending way. Let me say again - I've got no problem with this. If Robert thinks that SEO is what's wrong with Google, he's certainly entitled to that opinion. Thus far, I think he's done a miserable job of pleading that case, but let's stay with it and see if it gets better. And if you want to get your Mitsubishis on this page you probably can because a human being is really good at saying 'Mitsubishi, yeah, I've heard of them, they make HDTVs, they deserve to be on this page. And they're not there yet, but I'm sure the crew will work on that. Robert's certainly right about the crew \"fixing it up,\" as, by the time I took the screenshot, the Mahalonians (?) had patched it up. However, I've got to call Robert out for choosing an example page that wasn't even high quality to begin with - what's up with that? If he wanted to make a strong argument about Mahalo's ability to have better results, couldn't he have at least put in some foresight and chosen a page that was categorically excellent? I know if I were making the video, I would have put in a little extra effort, especially knowing that since I'm Robert Scoble, those damn rat bastard bloggers in the SEO world would try to pick me apart. This is a beautiful single page and you don't need to search again. At Google I would have to search again. I would need to search for HDTV manufacturers and then if that page didn't work, which it doesn't, I would have to make a manual lift... and I would have to search for HDTV Mitsubishi, HDTV Sony, HDTV Panasonic just to get around the noise on Google. I don't have that problem on Mahalo. I'm not really sure why Robert would have to make his \"manual lift\" since the top results for \"hdtv manufacturers\" at Google will take him to perfectly good pages that list and link to all the major manufacturers (quite a few more, actually, than what you see on the current Mahalo page). \"Remember, I'm giving these guys 4 years to kick Google's ass.\" I don't know about you, but at this point, I'm questioning the scalability of the Mahalo model. I'm not sure why Robert hasn't grasped that yet, particularly when you look at data that says that 25% of Google's queries in a year are completely unique and have never been seen before. If I were a Mahaloner, I'd be getting a little scared by the potential workload of building good pages for 1.75 billion queries every month. I guess if Mahalo had 100,000 employees and each one could build 1000 quality pages each day, they'd hit almost 10% of those searches... Now why can't Google change to be more like Mahalo? Simple. The algorithms that Google has chosen are stuck in cement. Changing a company the size of Google is gonna prove impossible. This is why Microsoft could not compete with Google. They did not understand how to change fast enough to compete with Google, and Google is gonna have the same problem with Mahalo and with Techmeme and with Facebook. Google's algorithms are stuck in cement? Really? This is where I start to really lose faith in a man I've idolized for years. Honestly, it makes me think that he doesn't know much at all about this industry that he's claiming will change radically in 4 years. Google does not understand social behaviors... They have not demonstrated any proficiency at doing so. They even own Orkut and they are not using it in their search. Why is that? Because they can't. I think they deserve at least a little credit for using search data so incredibly well - the data mining from queries has made things like QDF (Query Deserves Freshness) and temporal link data and personalized search possible and those are all pretty impressive technologies. If you ask me, I'd say that Google may not have a lot of participation in the social media sphere of the web (with the notable exception of YouTube), but they certainly understand search behavior better than anyone out there. As to the question of why Orkut data isn't in the SERPs... I'm really not sure why Robert wants them to use - maybe if you do a search for a friend, you'll see their Orkut profile? Or if lots of users on Orkut link to Scobleizer, he'll rank better (oh wait, that's probably true). The fact is that if they changed their algorithms and how they work there would be such an outcry from businesses and from SEOs and people who care about search that Google would prove to be ineffectual against that. They would have to roll back and cut out some of the new social features because they would put too much change into a system too quickly and they would mess up what we believe about Google. If there was one moment in the video where I decided that I simply had to write a post exposing the lunacy of Robert's statements, this was it. The idea that Google can't change its algorithms and rankings because businesses and SEOs would complain is the height of shallow thinking and displays a remarkable lack of historical perspective. If you've been in the SEO world or relied on Google traffic for your business over the last 4 years, you've seen more ups and downs and changes in algorithms than ears of corn in Iowa. Google pushes out changes to the ranking system on a near consistent basis. We monitor thousands of search phrases at SEOmoz regularly and see almost daily flux based on the data that Google gathers, computes and pushes out. I can't believe that Robert truly thinks that if Google saw a way to improve its users' search experience for the better, they wouldn't leap at the chance. Can this really be a guy who understands the world of search? Google - in our heads we have learned what it does. We learn what it does when we search on it. We like it, it works fast, it's reliable, it's consistent, it also has a lot of noise. I'm in total agreement with him once again, but I fail to see why he'd rather put bets on Mahalo to build billions of great, hand-ordered search results, then look at Google honestly and see the massive amount of improvement and growth they make in search technology every day. Mahalo & Facebook & Techmeme can come in and write their own rules. Yes, and so can Google. If the new rules they write make their users happier and make them flock over from MSN/Live and Yahoo! and Ask, and click on results and ads and conduct more and more searches, why, exactly, should we expect their downfall by 2011? The video goes on for considerably longer and Robert actually makes some interesting, though, in my opinion, questionable points about how the technologies of Facebook, Techmeme and Mahalo can integrate and produce exciting search results. I wish I had time to go through the entire piece, but it's nearly 3am and I've got some morning calls tomorrow. Maybe some others can take a stab an unraveling the rest of Robert's logic. While the man's no idiot, I have to say that after watching him speak on a topic I actually know quite a bit about, I'm less than impressed, and for me, at least, it calls into question the depth of understanding and quality of his previous and future works. Hopefully, he'll prove me wrong with a brilliant look at the search market in the next few months, and I can forget all about this episode. After all, everyone makes mistakes, right? p.s. Did you note how he said on his blog that the post wouldn't show up in Techmeme because he was sure he had reverse engineered their algo, yet there it is.... p.p.s. If you want to revel in the absolute numbskullery of Robert's post even more, read Danny's take on it: Want to be like Robert -- and Jason Calacanis -- and keep equating SEO with spam? Then fuck off. Yep, that's right, Danny dropped the f-bomb. I think I hear angels singing in the distance... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "I Used to Respect Robert Scoble's Opinion..."
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "I Used to Respect Robert Scoble's Opinion..."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}