{
  "url": "https://moz.com/blog/identifying-online-community",
  "slug": "identifying-online-community",
  "title": "How to Identify an Online Community for Your Business - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When you’re getting started with building a community around your business, you aren’t really starting from nothing. You can leverage the people, blogs, knowledge sources, and communities that already exist and are relevant to your business and industry, and go from there!",
  "content": "How to Identify an Online Community for Your Business Social Media By: Mackenzie Fogelson February 19, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Mackenzie Fogelson February 19, 2013 How to Identify an Online Community for Your Business Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. If you own a business and are just getting started with social media, have a presence but not quite sure how to grow it, or are working on behalf of a client in this situation, you’re probably wondering how other businesses got here: Or here: From a starting point like this: Or even this: When you’re getting started with building a community around your business, you aren’t really starting from nothing. You can leverage the people, blogs, knowledge sources, and communities that already exist and that are relevant to your business and your industry. Start with what’s already been built and go from there. Once you’ve gone through this process, you’ll have a manageable list of quality knowledge sources (mainly blogs and people) that you will read, follow on social media, and engage with in order to actually build your community. Before you begin your journey of identifying community, there’s a few things you might want to know: If you're looking to build a quality following, it does in fact take a lot of time and effort It’s not all about the numbers It's an ongoing process (a more manual, human-type process) So, where the heck do you start? Who are you and what do you want to build? Before you even get started doing the work to identify your online community, get very clear about why you’re even in business in the first place. Why do you matter? What are your values? What do you have to offer? How are you unique? Why should your customers care? You’re going to build online community by being a great brand and providing something of value. But you’re also going to build community by identifying and attracting the right group of people. Ask yourself what type of community you want to build. Who do you want in your audience? Ideally, your community will be an audience of people who have chosen to be part of what you’re doing. Whether you’re acting as an individual or a brand, when you’re building followers, you’re building relationships. It’s not that every member of your community needs to engage or participate regularly (they won’t) but you want this group of people to care about what you do and what you stand for. You need to have some common ground. In my experience, communities that thrive aren’t just in it for themselves. They don’t just self-promote and talk at their customers all day long. In real life, nobody wants to be around those people and that doesn't change just because you're hanging out online. What kind of people do you want to be around in the real world? People who provide valuable and relevant information. People who welcome feedback (good and bad). People who listen. When you're building a community (whether virtual or otherwise), you're looking for live humans who, in some sense of the word, contribute to the conversation and the process. Thriving communities are full of people who want and who choose to be there. You can't just gather a bunch of numbers to make up a ginormous group of followers and call it a community. As in real life, you may not be able to hand-select every single person who belongs to your community. That said, you most certainly can be very clear about what you stand for so that your community is a match for your values. That way, as you build a community around your brand, it is a direct reflection of who you are and what you believe as a company. Don’t just focus on the numbers When identifying a community, it is important to focus on quality and not just quantity. Identifying a community is the start of building relationships with people who will support and help you grow your company. It starts with just a few key people and places (blogs and forums). If you've done your job to qualify these well, and do the hard work of generating and sharing value and being an authentic person (and company), then naturally, over time, your community (and your business) will grow. This process I’m about to guide you through is not a circle-and-friend-and-follow-everyone-you-possibly-can-on-Google+-Facebook-and-Twitter-so-that-you’ll-have-a-humungo-community-kind of a thing. I’m advocating quality in quantity. Your goal in identifying community is to come out of this with a list of people, companies, and knowledge sources that will serve as your roadmap for growing your online community. It’s a lot like outreach. Once you’ve identified your base, you will foster these relationships, build value in your business (i.e. meaningful content and resources that your customers need), and from there you will be led to additional people and places where you will discover even more pockets of opportunity. Get clear on your business goals Keep in mind that social media is a vehicle, not a strategy. Ideally, you want to determine exactly what it is you’re trying to accomplish in your business, and then you can figure out if it’s social media, SEO, content marketing, email marketing, PPC, or even a combination of a whole lot of other things that will actually get you there. Are you working to increase brand awareness? Humanize your company? Help your support guys spend less time on the phone? Whatever it is, if you’re clear on what it is you’re trying to accomplish for your company as a whole, it makes it a whole lot easier to identify and determine the online community you’d like to build. Over time, and as your community grows, you can evolve these objectives and really make it work for your business. Once you have clarity on who you are as a company, what you have to offer, what you’d like to accomplish, and you’re ready to put in the work to grow your business online, start by identifying your community. Start with some seeds There are a few different ways to get your seeds in this process of identifying community. You can answer some simple questions, do some social media digging, sift through blogs, and also use search strings. Let’s start with the simple questions. If you’re working on identifying community for your own company, then you will already have the answers to these questions. If you’re working on behalf of a client, put together a data collection document and ask them to answer the questions for you: Who is your target demographic? What specific industries do you cater to? Who are your partners and colleagues? Who are your competitors? Who do you respect in the industry (people and companies)? What organizations are you a part of? What industry blogs do you currently read? Who do you follow on social media (people, companies)? What events do you attend? Identify community with social media You’ll want to determine where your target audience lives online so that you know exactly where to look your community. There are certainly any number of starting points for the hunt: Facebook, Google+, or any other social media outlet that’s appropriate for your customers. But just so that we have an example to work with, we're going to use a company called Accent Branding Solutions (who is, of course, just getting started out building their online community), and we’re going to start with Twitter. Go to Followerwonk Visit https://followerwonk.com/ and click on Search Twitter Bios. Enter in your search words In the search field, enter the words that describe just one of your target audiences. For Accent, they’re targeting groups like the directors of marketing departments, admins of organizations or universities, associations, and marketing agencies. We’ll start with the group [marketing director] and, to narrow it down a bit, also specify their home town location of [Colorado]. Do some filtering You’re going to want to filter a bit initially as you go, and then once more when get down to your final picks of people who you think may be good to follow and cultivate as possible community members, influencers, or just great knowledge sources. You can see that I don’t have too many people to sift through since I limited my search location to Colorado. If I don’t get a ton of prospects, I may considering removing that qualifier (though these look pretty decent at first glance). When filtering at a high level, I’d recommend looking at number of followers and number of tweets. Number of followers shows that they have some sort of a community built around themselves already and quantity of tweets shows their activity level. Once you’ve qualified at the high level and you want to start checking through individuals on the list, consider: Frequency and activity What is the frequency of their posts? Are they on social media enough to even bother? Or do they post, like, every 6 months? Quality and relevance What kinds of stuff do they post about? Is it valuable? Relevant? Or do they just talk about themselves all day long? Are they sharing things that would be relevant for your customers (or your client’s customers)? Gut check It all comes down to the human element. Is this person a fit for your company’s purpose, goals, and what you’re trying to accomplish with your community? You don’t have to be super picky, but don’t just put them on the follow list because you need warm bodies. This is definitely an ongoing process (you’re going to need to take these people for a test drive, evaluate, and then revise), but take the time for quality now. Following and followers For the people who are looking like pretty good prospects, who are they following? Who’s on their list of followers? A mix of the little and the big guys When it’s all said and done, you're looking for a mix of people who are both obtainable (the little guys) and out of reach (the thought leaders). You want people who have a lot of followers and have some influence on them, but who would also notice when you share their content or interact with them (that's the next step). If you look at the first page of Accent’s results on Followerwonk, you can see that even the top guy only has 1,700 followers. If I click through and check out his profile on Twitter I can see that he’s pretty active (averages a few tweets a day) and has some decent stuff to share. If I click through to his first post, he’s leading an active user group on LinkedIn so I can see that there may be a few easy ways to eventually make a connection with him. On the other hand, if I take the [Colorado] location qualifier off of my search in Followerwonk, I get a much larger set of results for [marketing director] who have a much larger following (which isn't always a good thing; sometimes it's just more). Certainly we would need to do a lot more qualifying for Accent on this group of results, but let’s say they wanted to target Lil B (assuming, as the first rapper ever to write and publish a book at 19, that he's part of our target group). He has 622,220 followers. If Accent wanted to get in front of this guy, we’d have our work cut out for us. Not to say that Lil B doesn’t have value to offer and that Accent may want to follow him as a knowledge source, but the chances of attracting Lil B to their community may be a little bit far reaching at this stage in the game. Basically - and especially when you’re just starting to build your community - you want to look for a mix of both the little guys and the big guys. Focus on people who you could possibly talk to in person at trade shows, meetups, or at conferences. People who have the time to get to know you and would appreciate the value you're going to share or the contributions that you're making to the industry. Not to say that influencers and thought leaders don't care about what you're doing, it's just that they have less time to take notice. So make sure you shoot for the big guys but that you also combine that with some peeps who have less on their plate. Organize Using what we call a Super Fancy Spreadsheet (where we track all the things), organize and keep track of all the good stuff you’re discovering. As you identify prospects that you think would be good to include in your community, enter their data. We like to track things like: name, type (person, company, affiliation, association, competitor), twitter handle, blog URL, website URL, domain authority, target audience, industry, level of activity, and notes. You can customize this for what you want to know as you're identifying community. Set aside blogs As you’re prospecting in the social media realm, you’re going to find blogs that look decent and that may be a good fit. As you discover those, set them aside (maybe even pull it over into a new window and keep stacking them up there). We’ll get to those next. Identify Community with Blogs Once you’ve got a pretty good list of social media seeds going, move on to blogs. In general, you’re looking for blogs that can serve as knowledge sources, places to engage, or reveal possibilities of new people to connect with and possibly attract into your own community. While you’re filtering blogs, you’ll probably also find more people you’re going to want to check out on social media. Go back and add them to your Super Fancy Spreadsheet as necessary. Also, you can certainly filter the blogs you’re looking at at a high level (and at quick glance) by using domain authority (more on this below), but ideally you'll want to hand check these suckers. Again, using your Super Fancy Spreadsheet, you’re going to: Set aside blogs discovered during the social media hunt Check and see if the people you’ve qualified so far on social media have blogs. If so, set them aside. Check out other blogs Look back at the seed questions that you or your client have answered. Look up competitors, partners, distributors, associations, or anyone else in their industry who may have blogs. If you find some, set those aside. Use search strings A lot of times we feel like we’ve exhausted all of the above and still don’t have any solid blog recommendations to make. So we go to search strings like [service/product offering/or target audience intitle:blog] or [service/product offering/or target audience inurl:blog]. Hopefully by now you’ve got a list of a few blogs or so, go ahead and filter through them: Domain authority Use the SEOmoz toolbar to get a quick look at DA. Keep in mind that there are some very good blogs out there that don’t yet have a strong DA but would be an ideal community fit. Always look for potential and quality in addition to authority. More often than not, if a blog has a low DA (say, less than 10), it’s probably not very active. However, there are some blogs that have great knowledge to share but don’t quite have the outreach thing down. Those are perfect opportunities for joining forces and figuring out how you can partner to bring awareness to the strong content and value they're providing. Quality and relevance Is the content worth reading? Would you share this stuff? Would your customers (or your client’s customers) want to read this? Would you want to engage on this blog? Does it spark your (or your client's customers') interest? Activity and engagement Are people sharing the posts on social media? Who is sharing these posts (those could be prospects as well) and how often? Are there any comments? We’re kind of spoiled in that most of the blogs we’re used to in the marketing industry have strong DA, a ton of social activity, and lots of engagement. Most of the blogs in more detailed niches or specialty industries won’t have any engagement at all. If the blog you’re considering has solid content and posts new stuff fairly frequently, it has potential. Blogs like this are a great place to engage because they’re listening. They would probably be pretty excited to have someone to engage with. Once you start sharing their stuff and become an active member of their community, they’re going to take notice and probably join yours as well. Now what? Surrendering to the process Just like building community, identifying community never really ends. As you continue to grow, you will continue to identify people and places that you may want to be a part of, and vice-versa. This is a more manual process, but it's one that we have found to deliver quality results. After all of this, if you were fortunate enough to come up with a ton of great people and places to start, you’ll probably want to prioritize and just pick five or ten relevant blogs, and also a group of about 5-10 people that you’re eventually (in the next stage of building community) going to commit to following and engaging with. You’ll want to start slow. This is a lot of (consistent) effort and you don’t want to burn out too quickly. Whether you’ve identified community for your business or you’re working with a client, make sure you understand that this initial qualified list is just a start. Keep in mind that some of these seeds are going to suck (even when you thought they were going to be a gold mine). Yet even the bad seed can lead you to new places, people, and niches that will help to expand the base of the community that you’re building. Okay, one more thing. If you’re working with a client, once they start working with their list, encourage open communication about how it’s going. Make sure that you’re consistently touching base about whether what you’ve delivered is a fit for them. If they provide you negative feedback about a specific blog, ask them what they don’t like about it. What’s not a match? Maybe the contrast will help them to better identify what they are looking for and then you can help them find it. A few (more) things to remember As if this post isn’t long enough (have you met me?), there’s just a few more things for you to remember: This is just the first step Identifying community (i.e. prospective knowledge sources and people to follow) is just the first step in building an online community. To do this right, you’ll want to develop a strategy that will guide this and your other online marketing efforts. This will (eventually) help your rankings Building a community is a supplement to search. Remember that all of this building community stuff has to do with helping you bring more value to your customers and more visibility to your business. All of the efforts that you make when growing a community will not only build value in your business, it will help your rankings. The benefit of going this route is that it’s sustainable. If you understand by now that it’s important that you’re not just chasing algorithms and want to invest in something that will weather the changes, this is probably a pretty good way to go. I call BS on boring (or non-existing) niches Communities don’t build themselves. Even the big brands had to start somewhere. But complaining about the fact that there is nothing there is just an excuse for not doing the work. We work with all kinds of clients who start from scratch which means, when they begin, there is (wait for it) nothing. All that means is that you’ve got some hard work to do and one stellar opportunity in front of you. So hunker down and get to it. Using this process of identifying community has helped our clients to get over their misconceptions about social media and discover niches and verticals that they didn’t realize existed to help them grow their business. The possibility is there, but you’ve got to do the work and quit making excuses. Don’t give up Like anything that’s worth having, the reward is worth the wait. There isn't a magic pill. It just takes time and consistent effort. A lot of it. For a while you’re going to feel like, 'what’s the point?' But remember that this is just a stage. After you've identified your community, you're ready to start building it. The one thing that I want you to remember going forward is this: your purpose is providing value, not making it all about you. Be the kind of community member you're looking for: generous, knowledgeable, and engaged. And, while your community should support and foster your business, it is primarily a means to provide better service, knowledge, and support to your customers. As always, give it a shot, and let me know how it goes. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Identify an Online Community for Your Business"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Identify an Online Community for Your Business"
    },
    {
      "level": "H2",
      "text": "Who are you and what do you want to build?"
    },
    {
      "level": "H2",
      "text": "Don’t just focus on the numbers"
    },
    {
      "level": "H2",
      "text": "Get clear on your business goals"
    },
    {
      "level": "H2",
      "text": "Start with some seeds"
    },
    {
      "level": "H2",
      "text": "Identify community with social media"
    },
    {
      "level": "H2",
      "text": "Identify Community with Blogs"
    },
    {
      "level": "H2",
      "text": "Now what? Surrendering to the process"
    },
    {
      "level": "H2",
      "text": "A few (more) things to remember"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Mackenzie Fogelson\n          \n            Mackenzie Fogelson\n          \n            Mackenzie Fogelson"
}