{
  "url": "https://moz.com/blog/identifying-long-tail-patterns",
  "slug": "identifying-long-tail-patterns",
  "title": "Identifying Long Tail Patterns - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Taking advantage of and capturing searches within the long tail has become an important area of focus for search marketers. It certainly has tremendous appeal… typically long tail searches have considerably less if any competition yet often represent searchers who are very far along the purchase…",
  "content": "Identifying Long Tail Patterns Content Marketing By: Brian Brown June 12, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Brian Brown June 12, 2007 Identifying Long Tail Patterns Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Taking advantage of and capturing searches within the long tail has become an important area of focus for search marketers. It certainly has tremendous appeal… typically long tail searches have considerably less if any competition yet often represent searchers who are very far along the purchase path. Seems like the best of both worlds. The challenge of course is in actually identifying these searches. To some extent, just having pages with good, high quality content, in this case content that contains key features, benefits or other details that searchers might search on, may capture some of this traffic with little extra effort. But what if you want to take a more proactive approach to the long tail? Hamlet’s article about Uncovering the Invisible Tail demonstrates the challenge. Based on keyword research tools alone, much of the long tail may not be found, in essence these terms are invisible, flying under the radar of most research tools, which to some extent may only capture the head and mid-tail. There are two big challenges that are inherent in long tail searches. Long tail searches are like comets that only come around every so many years. Identifying them today may not necessarily deliver value until some unknown time in the future… assuming we live long enough to see them again. Secondarily, their overall value is found in total, not in individual searches. So how do you increase your chances of coming up for these searches in greater frequency while minimizing the effort expended? Through identifying long tail patterns, of course. Like our comet example, we are less interested in the trail, but in the path the comet is taking. In other words, we are looking to identify where the comet will be by mapping out where it has been. With our keywords, we do this by examining the searches that we have found as far down the tail as we can, either through the keyword research tools, using a service like Hittail or using a strategy like Hamlet detailed. The whole goal is to identify key patterns that we can model our efforts after, ideally efforts that can be automated to some extent. Life is full of patterns, even in search. While we may not be able to capture every search, by identifying dominant patterns, we may dramatically increase our ability to come up for more of these searches. As a hypothetical example using the ever popular digital camera example, here are 40 searches for two different brands and models of digital cameras that have been pulled (for this demonstration) from the Keyword Discovery database that received only 1 search: consumer comments on nikon 5.1 mp coolpix l3 digital camera new nikon coolpix p3 8 1 mp digital camera memory nikon 3 2 mp coolpix digital camera nikon 51 mp coolpix s1 digital camera and cradle nikon 6 mp coolpix digital camera nikon 7 1 mp coolpix 7900 digital camera nikon 81 mp coolpix 8800 digital camera nikon coolpix 4800 4 mp digital camera nikon coolpix 5200 51 mp digital camera nikon coolpix 5400 51 mp digital camera nikon coolpix 6.0 mp digital camera nikon coolpix 8700 8mp 8x zoom digital camera 8 mp nikon coolpix l2 6.0 mp digital camera nikon coolpix l3 6 mp digital camera usa warranty nikon coolpix p2 51 mp digital camera best buy sony cybershot dsc t7 51 mp digital camera brand new sony cybershot dsc h1 51 mp digital camera camera digital sony cybershot 51 mp sony - cybershot 10.1 mp digital camera sony - cybershot 6.0 mp digital camera sony 5 mp cybershot dsc t9 digital camera sony 72 mp cybershot dsc p200 digital camera information sony 72 mp cybershot dsc w7 digital camera sony 72 mp digital still camera cybershot rebate sony cybershot 10.1 mp digital camera sony cybershot 7 2mp digital camera 7 2 mp sony cybershot 72mp dsc w7 digital camera 72 mp sony cybershot 81 mp digital camera sony cybershot digital camera 5.1 mp sony cybershot digital camera 6 mp sony cybershot dsc 1 81 mp digital camera review sony cybershot dsc h1 51 mp digital camera sony cybershot dsc w30 6 mp digital camera sony cybershot dscs40 41 mp digital camera 3x opt zoom sony dsc p73 cybershot digital camera 41 mp p 73 sony dsc p8 cybershot 32 mp digital camera sony dsc s60 cybershot digital camera 4 1 mp sony dsc s85 cybershot 41 mp digital still camera sony dsc t1 cybershot digital camera 5 0 mp sony dsc t1 cybershot digital camera 50 mp t 1 So our goal is to determine if there are any universal patterns that searchers may tend to use when searching. Within this subset of searches, there are a number of patterns that stand out: ~48% begin with the brand name and end with “digital camera” ~35% are ordered brand, model name, model number, megapixel, “digital camera” ~22.5% are ordered brand, megapixel, model name, “digital camera” And a whopping 60% follow the overall pattern of brand, model name, “digital camera” You might also notice that, at least in this example, that qualifiers such as new, a specific store name, and a reference to consumer comments tend to be pre-pended to the search phrases whereas features and product related qualifiers tend to be appended to the search phrases, such as memory, 3x opt zoom, warranty, cradle, information and even a repeat of the megapixels or model number. Remember, this is purely a limited, hypothetical example and certainly not meant to be statistically exact. Actual analysis might reveal different patterns and this was meant merely to demonstrate the idea of identifying dominant long tail patterns to model content presentation on, whether for static use or in pulling data from a database. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Identifying Long Tail Patterns"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Identifying Long Tail Patterns"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Brian Brown\n          \n            Brian Brown\n          \n            Brian Brown"
}