{
  "url": "https://moz.com/blog/identify-and-tackle-keyword-cannibalisation-in-2019",
  "slug": "identify-and-tackle-keyword-cannibalisation-in-2019",
  "title": "How to Identify and Tackle Keyword Cannibalization in 2019 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Learn how to find and fix keyword cannibalisation before it impacts your SEO opportunities.",
  "content": "How to Identify and Tackle Keyword Cannibalization in 2019 On-page SEO | Content Marketing | SEO Basics By: Samuel Mangialavori February 11, 2019 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Samuel Mangialavori February 11, 2019 How to Identify and Tackle Keyword Cannibalization in 2019 On-page SEO | Content Marketing | SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. If you read the title of this blog and somehow, even only for a second, thought about the iconic movie “The Silence of the Lambs”, welcome to the club — you are not alone! Despite the fact that the term “cannibalization” does not sound very suitable for digital marketing, this core concept has been around for a long time. This term simply identifies the issue of having multiple pages competing for the same (or very similar) keywords/keyword clusters, hence the cannibalization. What do we mean by cannibalization in SEO? This unfortunate and often unnoticed problem harms the SEO potential of the pages involved. When more than one page has the same/similar keyword target, it creates “confusion” in the eyes of the search engine, resulting in a struggle to decide what page to rank for what term. For instance, say my imaginary e-commerce website sells shoes online and I have created a dedicated category page that targets the term ‘ankle boots’: www.distilledshoes.com/boots/ankle-boots/ Knowing the importance of editorial content, over time I decide to create two blog posts that cover topics related to ankle boots off the back of a keyword research: one post on how to wear ankle boots and another about the top 10 ways to wear ankle boots in 2019: One month later, I realize that some of my blog pages are actually ranking for a few key terms that my e-commerce category page was initially visible for. Now the question is: is this good or bad for my website? Drum roll, please...and the answer is — It depends on the situation, the exact keywords, and the intent of the user when searching for a particular term. Keyword cannibalization is not black or white — there are multiple grey areas and we will try and go though several scenarios in this blog post. I recommend you spend 5 minutes checking this awesome Whiteboard Friday which covers the topic of search intent extremely well. How serious of a problem is keyword cannibalization? Much more than what you might think — almost every website that I have worked on in the past few years have some degree of cannibalization that needs resolving. It is hard to estimate how much a single page might be held back by this issue, as it involves a group of pages whose potential is being limited. So, my suggestion is to treat this issue by analyzing clusters of pages that have some degree of cannibalization rather than single pages. Where is most common to find cannibalization problems in SEO? Normally, you can come across two main placements for cannibalization: 1) At meta data level: When two or more pages have meta data (title tags and headings mainly) which target the same or very similar keywords, cannibalization occurs. This requires a less labour-intensive type of fix, as only meta data needs adjusting. For example: my e-commerce site has three boots-related pages, which have the following meta data: Page URL Title tag Header 1 /boots/all /Women’s Boots - Ankle & Chelsea Boots | Distilled Shoes Women’s Ankle & Chelsea Boots /boots/ankle-boots/ Women’s Ankle Boots | Distilled Shoes Ankle Boots boots/chelsea-boots/ Women’s Chelsea Boots | Distilled Shoes Chelsea Boots These types of keyword cannibalization often occurs on e-commerce sites which have many category (or subcategory) pages with the intention to target specific keywords, such as the example above. Ideally, we would want to have a generic boots page to target generic boots related terms, while the other two pages should be focusing on the specific types of boots we are selling on those pages: ankle and chelsea. Why not try the below instead? Page URL New Title Tag New Header 1 /boots/all Women’s Boots - All Types of Winter Boots | Distilled Shoes Women’s Winter Boots /boots/ankle-boots/ Women’s Ankle Boots | Distilled Shoes Ankle Boots boots/chelsea-boots/ Women’s Chelsea Boots | Distilled Shoes Chelsea Boots More often than not, we fail to differentiate our e-commerce site’s meta data to target the very specific subgroup of keywords that we should aim for — after all, this is the main point of having so many category pages, no? If interested in the topic, find here a blog post I wrote on the subject. The fact that e-commerce pages tend to have very little text on them makes meta data very important, as it will be one of the main elements search engines look at to understand how a page differs from the other. 2) At page content level When cannibalization occurs at page content level (meaning two or more pages tend to cover very similar topics in their body content), it normally needs more work than the above example, since it requires the webmaster to first find all the competing pages and then decide on the best approach to tackle the issue. For example: say my e-commerce has two blog pages which cover the following topics: Page URL Objective of the article /blog/how-to-clean-leather-boots/ Suggests how to take care of leather boots so they last longer /blog/boots-cleaning-guide-2019/ Shows a 121 guide on how to clean different types of boots These types of keyword cannibalization typically occurs on editorial pages, or transactional pages provided with substantial amount of text. It is fundamental to clarify something: SEO is often not the main driver when producing editorial content, as different teams are involved in producing content for social and engagement reasons, and fairly so. Especially in larger corporations, it is easy to underestimate how complex it is to find a balance between all departments and how easily things can be missed. From a pure SEO standpoint, I can assure you that the two pages above are very likely to be subject to cannibalization. Despite the fact they have different editorial angles, they will probably display some degree of duplicated content between them (more on this later). In the eyes of a search engine, how different are these two blog posts, both of which aim to address a fairly similar intent? That is the main question you should ask yourself when going through this task. My suggestion is the following: Before investing time and resources into creating new pages, make the effort to review your existing content. What are the types of cannibalization in SEO? Simply put, you could come across 2 main types: 1) Two or more landing pages on your website that are competing for the same keywords For instance, it could be the case that, for the keyword \"ankle boots\", two of my pages are ranking at the same time: Page URL Title tag Ranking for the keyword “ankle boots” Page A: /boots/all Women’s Boots - Ankle & Chelsea Boots | Distilled Shoes Position 8 Pabe B: /boots/ankle-boots/ Women’s Ankle Boots | Distilled Shoes Position 5 Is this a real cannibalization issue? The answer is both yes and no. If multiple pages are ranking for the same term, it is because a search engine finds elements of both pages that they think respond to the query in some way — so technically speaking, they are potential ‘cannibals’. Does it mean you need to panic and change everything on both pages? Surely not. It very much depends on the scenario and your objective. Scenario 1 In the instances where both pages have really high rankings on the first page of the SERPS, this could work in your advantage: More space occupied means more traffic for your pages, so treat it as \"good\" cannibalization. If this is the case, I recommend you do the following: Consider changing the meta descriptions to make them more enticing and unique from each other. You do not want both pages to show the same message and fail to impress the user. In case you realise that amongst the two pages, the “secondary/non-intended page” is ranking higher (for example: Page A /boots/all ranks higher than Page B /boots/ankle-boots/ for the term ‘ankle boots’), you should check on Google Search Console (GSC) to see which page is getting the most amount of clicks for that single term. Then, decide if it is worth altering other elements of your SEO to better address that particular keyword. For instance, what would happen if I removed the term ankle boots from my /boots/all (Page A) title tag and page copy? If Google reacts by favouring my /boots/ankle-boots/ page instead (Page B), which may gain higher positions, then great! If not, the worst case scenario is you can revert the changes back and keep enjoying the two results on page one of the SERP. Page URL Title tag Ranking for the keyword “ankle boots” Page A: /boots/all Women’s Boots - Chelsea Boots & many more types | Distilled Shoes Test and decide Scenario 2 In the instances where page A has high rankings page one of the SERPS and page B is nowhere to be seen (beyond the top 15–20 results), it is up to you to decide if this minor cannibalization is worth your time and resources, as this may not be an urgency. If you decide that it is worth pursuing, I recommend you do the following: Keep monitoring the keywords for which the two pages seem to show, in case Google might react differently in the future. Come back to this minor cannibalization point after you have addressed your most important issues. Scenario 3 In the instances where both pages are ranking in page two or three of the SERP, then it might be the case that your cannibalization is holding one or both of them back. If this is the case, I recommend you do the following: Check on GSC to see which of your pages is getting the most amount of clicks for that single keyword. You should also check on similar terms, since keywords on page two or three of the SERP will show very low clicks in GSC. Then, decide which page should be your primary focus — the one that is better suited from a content perspective — and be open to test changes for on-page SEO elements of both pages. Review your title tags, headings, and page copies and try to find instances where both pages seem to overlap. If the degree of duplication between them is really high, it might be worth consolidating/canonicalising/redirecting one to the other (I'll touch on this below). 2) Two or more landing pages on your website that are flip-flopping for the same keyword It could be the case that, for instance, the keyword “ankle boots” for two of my pages are ranking at different times, as Google seems to have a difficult time deciding which page to choose for the term. Page URL Ranking for the keyword “ankle boots” on 1st of January Ranking for the keyword “ankle boots” on 5th of January Page A: /boots/all Position 6 Not ranking Pabe B: /boots/ankle-boots/ Not ranking Position 8 If this happens to you, try and find an answer to the following questions:This is a common issue that I am sure many of you have encountered, in which landing pages seem to be very volatile and rank for a group of keywords in a non-consistent manner. When did this flip-flopping start? Pinpointing the right moment in time where this all began might help you understand how the problem originated in the first place. Maybe a canonical tag occurred or went missing, maybe some changes to your on-page elements or an algorithm update mixed things up? How many pages flip-flop between each other for the same keyword? The fewer pages subject to volatility, the better and easier to address. Try to identify which pages are involved and inspect all elements that might have triggered this instability. How often do these pages flip-flop? Try and find out how often the ranking page for a keyword has changed: the fewer times, the better. Cross reference the time of the changes with your knowledge of the site in case it might have been caused by other adjustments. If the flip-flop has occurred only once and seems to have stopped, there is probably nothing to worry about, as it's likely a one-off volatility in the SERP. At the end of the day, we need to remember that Google runs test and changes almost everyday. How to identify which pages are victims of cannibalization I will explain what tools I normally use to detect major cannibalization fluxes, but I am sure there are several ways to reach the same results — if you want to share your tips, please do comment below! Tools to deploy for type 1 of cannibalization: When two of more landing pages are competing for the same keyword I know we all love tools that help you speed up long tasks, and one of my favorites is Ahrefs. I recommend using their fantastic method which will find your ‘cannibals’ in minutes. Watch their five minute video here to see how to do it. I am certain SEMrush, SEOMonitor, and other similar tools offer the same ability to retrieve that kind of data, maybe just not as fast as Ahrefs’ method listed above. If you do not have any tools at your disposal, Google Search Console and Google Sheets will be your friends, but it will be more of a manual process. Tools to deploy for Type 2 of cannibalization: When two or more landing pages are flip-flopping for the same keyword Ideally, most rank tracking tools will be able to do this functionally discover when a keyword has changed ranking URL over time. Back in the day I used tracking tools like Linkdex and Pi Datametrics to do just this. At Distilled, we use STAT, which displays this data under History, within the main Keyword tab — see screenshot below as example. One caveat of these kinds of ranking tools is that this data is often accessible only by keyword and will require data analysis. This means it may take a bit of time to check all keywords involved in this cannibalization, but the insights you'll glean are well worth the effort. Google Data Studio Dashboard If you're looking for a speedier approach, you can build a Google Data Studio dashboard that connects to your GSC to provide data in real time, so you don’t have to check on your reports when you think there is a cannibalization issue (credit to my colleague Dom). Our example of a dashboard comprises two tables (see screenshots below): The table above captures the full list of keyword offenders for the period of time selected. For instance, keyword 'X' at the top of the table has generated 13 organic clicks (total_clicks) from GSC over the period considered and changed ranking URL approximately 24 times (num_of_pages). The second table (shown above) indicates the individual pages that have ranked for each keyword for the period of time selected. In this particular example, for our keyword X (which, as we know, has changed URLs 24 times in the period of time selected) the column path would show the list of individual URLs that have been flip flopping. What solutions should I implement to tackle cannibalization? It is important to distinguish the different types of cannibalization you may encounter and try to be flexible with solutions — not every fix will be the same. I started touching on possible solutions when I was talking about the different types of cannibalization, but let’s take a more holistic approach and explain what solutions are available. 301 redirection Ask yourself this question: do I really need all the pages that I found cannibalizing each other? In several instances the answer is no, and if that is the case, 301 redirects are your friends. For instance, you might have created a new (or very similar) version of the same article your site posted years ago, so you may consider redirecting one of them — generally speaking, the older URL might have more equity in the eyes of search engines and potentially would have attracted some backlinks over time. Page URL Date of blog post Page A: blog/how-to-wear-ankle-boots May 2016 Page B: blog/how-to-wear-ankle-boots-in-2019 December 2018 Check if page A has backlinks and, if so, how many keywords it is ranking for (and how well it is ranking for those keywords) What to do: If page A has enough equity and visibility, do a 301 redirect from page B to page A, change all internal links (coming from the site to page B) to page A, and update metadata of page A if necessary (including the reference of 2019 for instance) If not, do the opposite: complete a 301 redirect from page A to page B and change all internal links (coming from the site to page A) to page B. Canonicalization In case you do need all the pages that are cannibalizing for whatever reason (maybe PPC, social, or testing purposes, or maybe it is just because they are still relevant) then canonical tags are your friends. The main difference with a 301 redirect is that both pages will still exist, while the equity from page A will be transferred to page B. Let's say you created a new article that covers a similar topic to another existing one (but has a different angle) and you find out that both pages are cannibalizing each other. After a quick analysis, you may decide you want Page B to be your \"primary\", so you can use a canonical tag from page A pointing to page B. You would want to use canonicalization if the content of the two pages is diverse enough that users should see it but not so much that search engines should think it's different. Page URL Date of blog post Page A: blog/how-to-wear-ankle-boots-with-skinny-jeans December 2017 Page B: blog/how-to-wear-high-ankle-boots January 2019 What to do: Use a canonical tag from page A to page B. As a reinforcement to Google, you could also use a self-referencing canonical tag on page B. After having assessed accessibility and internal link equity of both pages, you may want to change all/some internal links (coming from the site to page A) to page B if you deem it useful. Pages re-optimisation As already touched on, it primarily involves a metadata type of cannibalization, which is what I named as type 1 in this article. After identifying the pages whose meta data seem to overlap or somehow target the same/highly similar keywords, you will need to decide which is your primary page for that keyword/keyword group and re-optimize the competing pages. See the example earlier in the blog post to get a better idea. Content consolidation This type of solution involves consolidating a part or the entire content of a page into another. Once that has happened, it is down to you to decide if it is worth keeping the page you have stripped content from or just 301 redirect it to the other. You would use consolidation as an option if you think the cannibalization is a result of similar or duplicated content between multiple pages, which is more likely to be the type 2 of cannibalization, as stated earlier. It is essential to establish your primary page first so you are able to act on the competing internal pages. Content consolidation requires you to move the offending content to your primary page in order to stop this problem and improve your rankings. For example, you might have created a new article that falls under a certain content theme (in this instance, boots cleaning). You then realize that a paragraph of your new page B touches on leather boots and how to take care of them, which is something you have covered in page A. In case both articles respond to similar intents (one targeting cleaning leather only, the other targeting cleaning boots in general), then it is worth consolidating the offending content from page B to page A, and add an internal link to page A instead of the paragraph that covers leather boots in page B. Page URL Date of blog post Page A: blog/how-to-clean-leather-boots December 2017 Page B: /blog/boots-cleaning-guide-2019/ January 2019 What to do: Find the offending part of content on page B, review it and consolidate the most compelling bits to page A Replace the stripped content on page B with a direct internal link pointing to page A Often after having consolidated the content of a page to another, there is no scope for the page where content has been stripped from so it should just be redirected (301). How can I avoid cannibalization in the first place? The best way to prevent cannibalization from happening is a simple, yet underrated task, that involves keyword mapping. Implementing a correct mapping strategy for your site is a key part of your SEO, as important as your keyword research. Carson Ward has written an awesome Moz Blog post about the topic, I recommend you have a look. Don’t take 'intent' for granted Another way to avoid cannibalization, and the last tip I want to share with you, involves something most of you are familiar with: search intent. Most of the time, we take things for granted, assuming Google will behave in a certain way and show certain type of results. What I mean by this is: When you work on your keyword mapping, don’t forget to check what kind of results search engines display before assuming a certain outcome. Often, even Google is not sure and will not always get intent right. For instance, when searching for ‘shoes gift ideas’ and ‘gift ideas for shoe lovers’ I get two very different SERPs despite the fact that my intent is kind of the same: I am looking for ideas for a gift which involves shoes. The SERP on the left shows a SERP for a query of \"shoes gift ideas\". It displays a row of pictures from Google Images with the link to see more, one editorial page (informational content), and then the rest of results are all transactional/e-commerce pages for me to buy from. Google has assumed that I’d like to see commercial pages as I might be close to a conversion. The SERP on the right shows a SERP for a query of \"gift ideas for show loves\", displaying a row of Google Shopping ads and then a featured snippet, taken from an editorial page, while the rest are a mix of transactional and editorial pages, with Pinterest ranking twice in the top 10. Clearly Google is not sure what I would prefer to see here. Am I still in the consideration phase or am I moving to conversion? The example above is just one of the many I encountered when going through my keyword research and mapping task. Before going after a certain keyword/keyword cluster, try and address all these points: Check if one of your existing pages has already covered it. If so, how well have you covered the keyword target? What can you do to improve my focus? Is there any cannibalization that is holding you back? If you do not have a page for it, is it worth creating one and what implications will it have on your existing pages? Check what results Google is displaying for that keyword target, as it might be different from your expectations. Once you have created a new page/s, double check this has not created unintentional and unplanned cannibalization further down the line by using the tips in this post. Conclusion Keyword cannibalization is an underrated, but rather significant, problem, especially for sites that have been running for several years and end up having lots of pages. However, fear not — there are simple ways to monitor this issue and hopefully this post can help you speed up the whole process to find such instances. Most of the times, it is just a matter of using the most logical approach while considering other SEO elements such as backlinks, crawlability, and content duplication. If possible, always test your changes first before applying it at site-wide level or making them permanent. If you, like me, are a fan of knowledge sharing and you think there are better ways to help with cannibalization, please comment below! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Identify and Tackle Keyword Cannibalization in 2019"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Identify and Tackle Keyword Cannibalization in 2019"
    },
    {
      "level": "H2",
      "text": "What do we mean by cannibalization in SEO?"
    },
    {
      "level": "H2",
      "text": "How serious of a problem is keyword cannibalization?"
    },
    {
      "level": "H2",
      "text": "Where is most common to find cannibalization problems in SEO?"
    },
    {
      "level": "H3",
      "text": "1) At meta data level:"
    },
    {
      "level": "H3",
      "text": "2) At page content level"
    },
    {
      "level": "H2",
      "text": "What are the types of cannibalization in SEO?"
    },
    {
      "level": "H3",
      "text": "1) Two or more landing pages on your website that are competing for the same keywords"
    },
    {
      "level": "H4",
      "text": "Scenario 1"
    },
    {
      "level": "H4",
      "text": ""
    },
    {
      "level": "H4",
      "text": "Scenario 2"
    },
    {
      "level": "H4",
      "text": "Scenario 3"
    },
    {
      "level": "H3",
      "text": "2) Two or more landing pages on your website that are flip-flopping for the same keyword"
    },
    {
      "level": "H4",
      "text": "When did this flip-flopping start?"
    },
    {
      "level": "H4",
      "text": "How many pages flip-flop between each other for the same keyword?"
    },
    {
      "level": "H4",
      "text": "How often do these pages flip-flop?"
    },
    {
      "level": "H2",
      "text": "How to identify which pages are victims of cannibalization"
    },
    {
      "level": "H4",
      "text": "Tools to deploy for type 1 of cannibalization: When two of more landing pages are competing for the same keyword"
    },
    {
      "level": "H5",
      "text": ""
    },
    {
      "level": "H4",
      "text": "Tools to deploy for Type 2 of cannibalization: When two or more landing pages are flip-flopping for the same keyword"
    },
    {
      "level": "H5",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Google Data Studio Dashboard"
    },
    {
      "level": "H2",
      "text": "What solutions should I implement to tackle cannibalization?"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": "301 redirection"
    },
    {
      "level": "H3",
      "text": "Canonicalization"
    },
    {
      "level": "H3",
      "text": "Pages re-optimisation"
    },
    {
      "level": "H3",
      "text": "Content consolidation"
    },
    {
      "level": "H2",
      "text": "How can I avoid cannibalization in the first place?"
    },
    {
      "level": "H3",
      "text": "Don’t take 'intent' for granted"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Samuel Mangialavori\n          \n            Samuel Mangialavori\n          \n            Samuel Mangialavori"
}