{
  "url": "https://moz.com/blog/identify-featured-snippet-opportunities-next-level",
  "slug": "identify-featured-snippet-opportunities-next-level",
  "title": "Identify Featured Snippet Opportunities – Next Level - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Let’s take a look at how Moz Pro can help with identifying opportunities to gain (or steal) featured snippets within your existing toolkit.",
  "content": "Identify Featured Snippet Opportunities – Next Level SEO Basics | Moz Tools | SEO Tools By: Meghan Pahinui March 27, 2023 Table of Contents Copied! By: Meghan Pahinui March 27, 2023 Identify Featured Snippet Opportunities – Next Level SEO Basics | Moz Tools | SEO Tools Featured snippets offer a fantastic opportunity for increased traffic and visibility for your site. There is a lot to say about this SERP feature and a lot that has already been said: Crystal Carter covered how to optimize existing content for featured snippets in an episode of Whiteboard Friday (complete with a handy dandy flow chart!) which is incredibly informative. Seriously, check it out. Additionally, Britney Muller has done multiple episodes on what featured snippets are, how to target them, and more. So what can I possibly add to the conversation? Well, let’s take a look at how Moz Pro can help with identifying opportunities to gain (or steal) featured snippets within your existing toolkit. Then you can take the infinite wisdom of folks like Crystal and Britney to elevate your content to new heights (and SERP features). A Refresher on Featured Snippets Before we dig in, let’s take a brief moment to talk about what featured snippets are, just to refresh our memories. Featured snippets are a type of SERP feature which seek to answer a query using a snippet from a webpage. When a searcher makes a query, Google may attempt to answer that query by pulling out a portion of a site’s content to display directly in the results. Sometimes, as seen in the example above, Google will even highlight the most relevant part of the blurb they’ve extracted. Featured snippets can come in a variety of formats including paragraphs, numerical lists, bulleted lists, and more and can be identified by the inclusion of a source link at the bottom of the feature. These features are not to be confused with answer features which do not include a source link and typically have a slightly different format. Now that we’ve refreshed our memories on what featured snippets are, let’s dive into how we can use Moz Pro to identify opportunities to snag them. Moz Pro Campaigns Moz Pro Campaigns offer a variety of data views and tools you can use to scope out featured snippet opportunities. To start, we’re going to take a look at the Rankings Overview section. Rankings Within the main Rankings tab, you can see and monitor your tracked site’s rankings for all your tracked keywords. Anywhere your site has acquired a featured snippet will be noted as a rank of #1, with a featured snippet icon beside it which looks like a pair of scissors. Pro tip: In the above screenshot I’ve opted to label these keywords as “featured snippet” so I can keep an eye on them and identify if I lose a featured snippet due to a competitor overtaking me or by Google changing the SERP for those keywords to no longer include a snippet. If we hop over to the Competition tab of our rankings section, we can start to spot opportunities to steal some of this prime real estate in the SERP. Just as we saw in the Rankings tab, any keyword where the #1 has earned a featured snippet will be indicated by that scissors icon. This means we can sort our tracked keywords by our tracked competitor’s rankings to identify where they are earning those SERP features and where I’m ranking in comparison. This can help me spot featured snippets within striking distance by showing me a side by side comparison. Any keyword where we’re already ranking on the first page and there is a featured snippet present could be an opportunity for me to reformat and fine tune our content to scoop up that feature. SERP Features Now that we’ve identified opportunities related specifically to your competitors, let’s broaden our scope a bit. The SERP Features section of your Campaign can offer additional insight into opportunities for featured snippets outside of competitor rankings. Within this section of your Campaign, the tool will note how many of your tracked keywords include a featured snippet in the SERP as well as how many of those your site has earned. This can offer a great opportunity to investigate and identify featured snippet opportunities outside of your competitor rankings. We can filter by featured snippet to see which keywords include this SERP feature and then identify keywords where our site is not currently featured. This is indicated by a grey featured snippet icon. For keywords where our site is currently ranking but not included in the featured snippet, we may see an option to expand the Insights column. By expanding this drawer we can see what site the current featured snippet is being pulled from along with the exact URL. We can then use this information to identify areas of opportunity for our own content. Can we possibly provide a better answer to the query? What kind of markup and formatting is the current snippet’s post using? What can we do to elevate my own content? Pro tip: The SERP features section of your Campaign can be exported to CSV, as well. Within the export, any time a SERP feature is present but your site is not included, this will be indicated by TRUE. If your site is included in the SERP feature, it will be noted as Included. Keyword Explorer Now that we’ve taken a look at how we can use Moz Pro Campaigns to identify and monitor featured snippet opportunities, let’s look at a few ways we can use Keyword Explorer to supplement that information. Whether you’re doing keyword research for a new client, looking to identify featured snippet opportunities for your site, or you’re needing content ideas to build from, the Keyword Explorer tool is an invaluable addition to your tool kit. First, let’s walk through a workflow to help identify existing opportunities for featured snippets. Britney Muller also touched on this workflow in her Whiteboard Friday episode “Featured Snippets: What to Know & How to Target. 1. In Keyword Explorer, enter your URL into Explore by Site From within the Keyword Explorer > Explore by Site you have the option to enter a root domain, subdomain, subfolder, or exact page to see keywords you are already ranking for. The subdomain and subfolder options can be particularly helpful if you are doing research for a specific vertical of your business or section of your site. For example, you may be looking to capture featured snippets for your blog’s subfolder. 2. Filter your results by rank After entering in your URL and clicking Analyze, you’ll have the option to view the Ranking Keywords. From this list, filter by Ranking to see only the keywords for which you’re ranking on the first page (positions 1-10). 3. Add keywords to a Keyword List Now we have a list of keywords that could have the potential for a featured snippet opportunity. Let’s dig a little deeper. While it can be incredibly helpful to know what keywords you’re ranking #1 for (and it may be worth adding those to a Campaign to track and monitor over time) these may not present many new opportunities for your site. Google’s deduplication of featured snippet results in the SERP - meaning that if a site has earned the featured snippet, that same URL will not be listed in the remaining SERP results - means that if your site is included in the featured snippet, it is identified as position #1 in the SERP. So let’s find and select the keywords for which our site is ranking 2 to 10 and add them to a Keyword List in Keyword Explorer. Pro tip: If your site is ranking for a large number of keywords it can be helpful to export your Ranking Keywords to CSV. You can then filter and sort by rank and search volume to identify your strongest opportunities and add them to a Keyword List via copy & paste. 4. Find keywords with Featured Snippet opportunities Now that we have a list of potential keywords, let’s narrow it down further. Within our Keyword List, we can filter by SERP Feature to see only the keywords which have a featured snippet in the SERP. We can then take these keywords and add them to a Campaign, do further research on them, or see what content is currently featured in the SERP and identify ways to improve our own content. Pro tip: You can use the Rank Check feature to see what page on your site is currently ranking on the first page of the SERP for these keywords and export that data to CSV. Explore by Keyword Up next is a workflow to help us identify new opportunities and possible content ideas for featured snippet inclusion. We’ll be using Keyword Explorer again but we’ll be switching to the Explore by Keyword section. 1. In Keyword Explorer, enter your seed keyword into Explore by Keyword Within Keyword Explorer > Explore by Keyword we have the ability to enter in a seed keyword or term and explore the SERP, keyword metrics, and Keyword Suggestions. In this example we’ll be scouting content ideas and featured snippets for a blog post all about homemade ice cream. 2. Click on Keyword suggestions After entering “homemade ice cream” into the tool and clicking Analyze, we can click into Keyword Suggestions to see additional keyword ideas along with their relevancy and monthly volume. 3. Filter to see keyword suggestions that “are questions” Considering that featured snippets are typically added to SERPs when Google is attempting to directly answer a query means that when writing a blog about homemade ice cream, we will want to know what people are asking about homemade ice cream. Within Keyword Suggestions, we can filter to display keyword suggestions which are specifically questions. Filtering this way will allow us to see what people are asking, and how often they are asking it, in an attempt to nail down content ideas. 4. Select keywords and add to a Keyword List Once we’ve identified some topics and questions that may be relevant to our new blog, we can select them using the checkboxes on the left and add them to a Keyword List for further analysis. 5. Find keywords with Featured Snippet opportunities Finally, we’re going to revisit the last step from our previous workflow and filter our Keyword List by SERP Feature to see only the keywords which have a featured snippet in the SERP. We now have a list of topic ideas and questions to consider answering in our new post all about homemade ice cream. This can help to inform our content along with the structure and markup for our posts. For example, we may decide to write a step-by-step process for how to make ice cream at home. Or we may publish a recipe for vanilla ice cream. Or we could even write a post all about the best ingredients to use when making an ice cream case to elevate our flavors. Regardless of what we decide to publish, we can now apply the tactics and strategies outlined by Crystal Carter and Britney Muller for featured snippet optimization to our shiny new list of topics. Conclusion Featured snippets aren’t going anywhere anytime soon — if anything, we seem to be seeing more and more varieties of them as time goes on. Identifying opportunities to optimize existing content or create new content for inclusion in them can lead to increased visibility (and possibly traffic) for your site. I hope you now feel prepared to go use the Moz Tools to scope out those prospects. With these actionable workflows in your toolkit, you’ll be able to rise to the top! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Identify Featured Snippet Opportunities – Next Level"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Identify Featured Snippet Opportunities – Next Level"
    },
    {
      "level": "H2",
      "text": "A Refresher on Featured Snippets"
    },
    {
      "level": "H2",
      "text": "Moz Pro Campaigns"
    },
    {
      "level": "H4",
      "text": "Rankings"
    },
    {
      "level": "H3",
      "text": "SERP Features"
    },
    {
      "level": "H2",
      "text": "Keyword Explorer"
    },
    {
      "level": "H3",
      "text": "Explore by Keyword"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    }
  ],
  "author": "Meghan Pahinui\n          \n            Meghan Pahinui\n          \n            Meghan Pahinui"
}