{
  "url": "https://moz.com/blog/if-i-could-change-one-thing-about-the-seo-industry-it-would-be",
  "slug": "if-i-could-change-one-thing-about-the-seo-industry-it-would-be",
  "title": "If I Could Change One Thing About the SEO Industry, It Would Be... - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "My personal ending would be - to Improve the Industry's Professionalism. We're a young industry, which means opportunity, excitement and lots of fantastic entrepreneurs and personalities. Conversely, it also means a lot of unprofessional, immature behavior, even from those of us who should know…",
  "content": "If I Could Change One Thing About the SEO Industry, It Would Be... Public Relations By: Rand Fishkin January 5, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 5, 2009 If I Could Change One Thing About the SEO Industry, It Would Be... Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. My personal ending would be - to Improve the Industry's Professionalism. We're a young industry, which means opportunity, excitement and lots of fantastic entrepreneurs and personalities. Conversely, it also means a lot of unprofessional, immature behavior, even from those of us who should know better (and yes, I'm certainly including my own actions from time to time in that group). I wish we could: Argue and debate, both online and in-person, in more constructive ways Do more to reward those who contribute consistently positive, valuable material Do less to reward those who contribute personal attacks, overly sensitive egos & negativity Refrain from cliques and gossip As a group, apply more principles of the Scientific Method to our practices Think more holistically and long-term about SEO To be honest, I think we've actually been moving in the right direction for the last few years (despite the occasional relapse). There's a long way to go, but I'm optimistic that 2009 can be our best year yet. Perhaps the world's economic turmoil will remind us to focus on what really matters. Your turn. Go ahead and finish this sentence (or paragraph) in the comments: If I Could Change One Thing About the SEO Industry, It Would Be... I'm excited to hear what others want. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "If I Could Change One Thing About the SEO Industry, It Would Be..."
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "If I Could Change One Thing About the SEO Industry, It Would Be..."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}