{
  "url": "https://moz.com/blog/if-i-could-go-back-in-time-give-myself-some-advice-this-would-be-it",
  "slug": "if-i-could-go-back-in-time-give-myself-some-advice-this-would-be-it",
  "title": "If I Could Go Back In Time & Give Myself Some Advice, This Would Be It - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Dear 2007 Rand Fishkin,\nHi there - it's me - your 2009 self. I know it's highly unlikely you'll ever get this email, but who knows? The flow of time could chaotically spasm and somehow drop a printed copy of this on your lap - stranger things have happened. And, in that unlikely event, here's a few…",
  "content": "If I Could Go Back In Time & Give Myself Some Advice, This Would Be It Marketing Industry By: Rand Fishkin May 26, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 26, 2009 If I Could Go Back In Time & Give Myself Some Advice, This Would Be It Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Dear 2007 Rand Fishkin, Hi there - it's me - your 2009 self. I know it's highly unlikely you'll ever get this email, but who knows? The flow of time could chaotically spasm and somehow drop a printed copy of this on your lap - stranger things have happened. And, in that unlikely event, here's a few quick things you should know: Take the VC Money - it's going to make you a better entrepreneur, a more serious company and fund some very exciting technology. Don't Turn Down the Extra Funding - $1.1 million will get you through fine, but 2007 valuations were awesome, and that extra million they're offering will make great things happen even faster. Build Linkscape, But Make Usability, not Features & Data, the Focus - the technology is amazing, sure, but most SEOs and Internet marketers have a very tough time understanding how to apply the information. You don't have 20 minutes to explain it in person to everyone, so make the interface as simple, intuitive and usable as possible (and rely on existing nomenclature wherever possible). Start Using Email Marketing ASAP - You have no idea the power of a well-crafted email campaign. Learn to Delegate Better - Hire people who can do the things you're spending your time on now. Just because you're good at something doesn't mean you should be doing it. Your job is to lead, to craft the vision and to evangelize. Whatever you're doing now that isn't those three things, stop and recruit someone who's better at it than you are. Remember What SEOmoz Is - at its core, your company is about making something complex & mysterious into something simple & understandable. That's what the tools, resources and services in PRO should do. Development & Scalability are Your Big Challenges - concentrate on hiring great devs and build small, nimble, self-sufficient teams Hiring Friends Works - Gather the smartest people you know, trust and like and bring them aboard; it doesn't work for everyone, but it's working great for you. Get Religious About Conversion Rate Optimization - Design, launch, test, measure, improve and repeat for every aspect of the conversion process on the site, from blog page landings to the last step of signup. Don't Invest in Marketing via Booths at Events - The ROI just isn't there, and the cost is tremendous. Do Invest in Your Affiliate Program - There are a lot of Internet marketers serving SEO-style content who don't have great ways to monetize it. Just putting a link in your footer is not going to get them excited. Learn Relentless Focus - Find the most critical things the business needs for the next six months, make them the everyday focus of every person and hour you can spare and cut out everything else to the point where it hurts at least a little. Only then will you have the focus you need. Buy a Scooter to Commute to the Office - Just make sure you buy some motorcycle pants to wear on rainy days. You, Rand, Are Not the Customer - Get over it, and build products that someone who just learned SEO last week can use. Establish Guiding Principles Now - Don't wait; just write them down, work on them until they make sense and post them on the wall in big font. Last, and Most Important; Get Married - It's unbelievably excellent in every way. And now, in a rarely used tactic, I'm pinging some friends from other web startups to ask them what they'd like to tell their past selves. Dharmesh Shah from Hubspot, Richard Zwicky from Enquisite, Seth Besmertnik from Conductor, Will Critchlow from Distilled, Kelly Smith from Inkd, Glenn Kelman from Redfin, Ethan Lowry from Urbanspoon and Chris Winfield of 10e20 - can I convince you to write an advice letter to your former incarnations? p.s. Anyone interested in more on this topic should check out my recent interview with the gang at Wildfire Marketing for Thought Leader Thursday. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "If I Could Go Back In Time & Give Myself Some Advice, This Would Be It"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "If I Could Go Back In Time & Give Myself Some Advice, This Would Be It"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}