{
  "url": "https://moz.com/blog/if-you-were-seomoz-would-you-take-outside-investment",
  "slug": "if-you-were-seomoz-would-you-take-outside-investment",
  "title": "If You Were SEOmoz... Would You Take Outside Investment? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I'm taking a temporary break in conference coverage (don't worry - there will be more next week) to poll some of the smartest people I know (that's you, SEOmoz readers), about an issue that's been keeping Gillian and I up plenty of nights during the past 3 months.\nSEOmoz is at a tipping point of…",
  "content": "If You Were SEOmoz... Would You Take Outside Investment? Moz News By: Rand Fishkin August 23, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 23, 2007 If You Were SEOmoz... Would You Take Outside Investment? Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I'm taking a temporary break in conference coverage (don't worry - there will be more next week) to poll some of the smartest people I know (that's you, SEOmoz readers), about an issue that's been keeping Gillian and me up plenty of nights during the past 3 months. SEOmoz is at a tipping point of sorts - we've gone from being primarily a search marketing consultancy business to one that's heavily focused on an SEO product - premium content & membership. In the 6 months since launch, we've had approximately 1800 people sign up for our premium membership, of which ~1200 are members today (looking at our subscriber details, it appears that many folks will sign up for one month, cancel, then sign up again 3-4 months later). Right now, SEOmoz membership and content isn't for everyone. If you're someone who regularly works on multiple site campaigns, the tools are terrific. If you need a little bit of strategic consulting or experienced professionals to bounce ideas off, the Q+A is great (BTW - sorry for my slower than normal responses due to the conference). Even novice search marketers can get a lot of benefit out of the guides & tips. However, there are certainly folks for whom premium membership isn't a terrific value - our goal is to change that. We've recently been working with a venture capital firm, thinking about investment from them, as well as considering other options like private financing. Why? Well there's a lot of things we want to do, like: Cool new tools More experimentation & reporting Greater tracking abilities for member websites More premium guides Marketing & advertising 70+ specific projects that are probably very unwise to share publicly To do this, we need to hire more people, add hardware, grow our marketing budget & put investment into R&D. Inside SEOmoz's offices there are two extra-large whiteboards, filled to capacity with all of the products and services we'd like to launch (both free and premium). At our current development rate, it would take between 18-24 months to roll out all these great ideas, but with investment capital, we think we could probably do it in 6 months. Not to mention the fact that we come up with about 10 great ideas per week that generally go on the shelf. We're looking at our financial & growth projections and thinking that something between $750K and $2million (for something between 10-20% of company ownership) should take us where we need to go at this point. While this is a rare amount for VC participation, we've had some interest even at this small level. And so, the question fundamentally becomes - do we take outside investment and grow fast, scale up and use marketing to expose more people to premium content? Or, should we continue to grow slowly, reject external financing and keep a tight marketing budget? Pros of taking outside financing: Build content/tools/services more quickly (with more people) Have funds to conduct marketing activities Build greater formalization into the company Form relationships that may help the company achieve goals Cons of taking outside financing: Give up some portion of control of the company Experience pressure to accelerate growth very quickly Lose a percentage of financial benefit from growth Invest significant time in appeasing and working with a board or investors/directors What do you think we should do? p.s. Yes, I know you're never supposed to share this stuff outside the company, but that's what makes us different :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "If You Were SEOmoz... Would You Take Outside Investment?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "If You Were SEOmoz... Would You Take Outside Investment?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}