{
  "url": "https://moz.com/blog/im-being-outranked-by-a-spammer-whiteboard-friday",
  "slug": "im-being-outranked-by-a-spammer-whiteboard-friday",
  "title": "I'm Being Outranked by a Spammer - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "What do you do when you are being outranked by a spammer? It's one of the most frustrating things that an SEO can face, but before jumping to conclusions it's important to understand what exactly is happening. \n\n\nIn this week's Whiteboard Friday, Rand gives us helpful advice with many important…",
  "content": "I'm Being Outranked by a Spammer Whiteboard Friday By: Kenneth Martin December 8, 2011 Table of Contents Copied! By: Kenneth Martin December 8, 2011 I'm Being Outranked by a Spammer Whiteboard Friday What do you do when you are being outranked by a spammer? It's one of the most frustrating things that an SEO can face, but before jumping to conclusions it's important to understand what exactly is happening. In this week's Whiteboard Friday, Rand gives us helpful advice with many important steps to follow if you discover that a spammer is outranking you. Let us know your thoughts on this challenging problem in the comments below! Video Transcription Howdy SEOmoz fans! Welcome to another edition of Whiteboard Friday. This week we're talking about a very tough problem, being outranked by spammers. What I mean very specifically here is link spammers, because it is rare in the SEO world that today you are seeing other sorts of spam. Cloaking, manipulative redirection, doorway pages, they happen a little bit, but they are much less common. The most common forms of spam and the thing that I see people complain about all the time, the thing I get emails about, I get tweets about, we get Q&A about is, \"Hey, Rand, I am being outranked by these spammers. Can you send this over to the Google webspam team? Can you tell the Bing webspam team? Who should I email over there? I filed my webspam reports. Do you think I should try and get it published on YOUmoz? Should I try and write to The New York Times and have them write about it because it seems like Google kicks people out when they're written about in The New York Times, at least for a little while?\" These are not always great tactics unfortunately, but I do want to walk you through some things that you should be doing when you think you are being outranked by spammers. The first part is make sure, make 100% sure, that what you are looking at is really a ranking that's been earned through link spam. What I am talking about here is I will take you back. I will tell you a story of several years ago. This was probably, I am going to say 2007, and I was in the audience, I can't remember if I was on the panel or in the audience, and there was Google's head of webspam, has been for the last decade or so, Matt Cutts, on the panel. Matt was looking at some links using his special Google software where he is investigating a link graph right on his laptop, and someone from the audience had said, \"Hey, Matt, I am getting outranked by this particular spammer.\" He looked and said, \"No, you know, we see a few thousands links to that site, but we're actually only counting a few hundred of them, and they're the ones that are making it rank there.\" So, think about that. We're talking about thousands of links pointing to a site. Think of all the links that might be pointing to a site here. Here are five different links that are pointing to this particular page. What the webspam team at Google is essentially saying is, \"Hey, you know what? We know that this and this and this and this are spam. The reason that this page is ranking is because they do have some good links that we are counting.\" Remember it is often the case that Google's webspam team and their algorithm will not make these links cause a penalty against you, because then you could just point them at somebody else's site or page and make them drop in the rankings. Instead, what they'll do is drop the value of those, so that essentially it is like having a no-followed link for those pages. Yes, it's a followed link, but they are going to essentially say, \"Oh, you know what? Our algorithm has detected that those are manipulative links. We are going to remove the value that they pass.\" A lot of the times when you look through a list of hundreds or thousands of links and you see a lot of spam and you think to yourself, \"Hey, that's why that guy is ranking. It's because he is spamming.\" It might not be the case. It could even be the case that person didn't actually build those spammy links. They just came through, you know, crap, junk on the Web. Not all the time, and usually you can tell the difference, but this is really something to keep in mind as you're analyzing that stuff. When you are, think to yourself, \"Hey, how did they get the best-looking links that they've got, and could those be the ones that are responsible for making them rank so well?\" Because if that's the case, you need to revisit your thesis around I'm being outranked by a spammer and think I am being outranked by a guy who's done some good link building who also happens to have lots of spammy links pointing at him. That's a completely different problem, and you need to solve for that. If you are sure, so let's say you've gone through step one, confirmed that, you know what, this is a crap link too that Google shouldn't be passing value, but somehow they are. I want you to ask two more critical questions. The first one: Is focusing on someone else's spam that's outranking you the best possible use of your web marketing time? You've got a lot on your plate. You don't just have to worry about SEO, right? These days you're worrying about SEO; you're worrying about keyword research; you're worrying about link building; you're worrying about content marketing; you're worrying about blogs and blog commenting and RSS and the traffic rating through there. You're worried about social media - Facebook, Twitter, Google+, and LinkedIn - and the longtail of all these other sites - Quora and Pinterest, Reddit, StumbleUpon. You're worried about web analytics and analyzing your success and making sure things are going through. You have to worry about crawlers and XML site maps and robots.txt. Make sure that thinking about and spending time on trying to flag somebody else's spam or trying to get them penalized is absolutely the best possible thing that you can be doing with your day. If it's not, reprioritize and put something else up there. The second question is, which we don't discuss at SEOmoz here because we really kind of hate this practice, but are you willing to and does your site have risk tolerance to go acquire spammy links? If you see someone's outranking you and you're like, well, I could get those kinds of links too or those exact links too, do you have the risk tolerance for it? If you believe that it is an ethical issue, do you have the moral flexibility for it? If you don't believe it is a moral question, do you have the budget for it? Is it the best use of your budget? Is it the best use of your time? I almost always believe the answer is no, with the possible exception of some super spammy fields, PPC (porn, pills, and casino), which I have never personally operated, and so I don't pretend to understand that world. But virtually every other form of legit business on the Web, I can't get behind this. But maybe you can. Maybe you want to. Decide if that's the route you want to take. Once you answer those two, you can move on to step three, which is, should you report the spam? The problem here is, you are going to go and send it through, let's say, your Webmaster Tools report, and there are thousands, probably hundreds of thousands of these filed every day. Probably put it somewhere between tens and hundreds of thousands of these filed every day, spam reports. Google says Webmaster Tools are the best place to file, when you are logged into your account, to report spam from other folks. Those reports go to a team of software engineers who work on Google's webspam and search quality teams. Then you can see, they've done a video, where they sit around and they prioritize all the day's projects and they determine who is going to work on what and how much energy they're going to put into it. You can probably tell that over the last couple of years, maybe even three years, there has not been a ton of energy spent to try and devalue link spam. In fact, a lot of paid links are working these days, and it's sort of a sad reality. I think that many people assume that Google's actually trying to move beyond linking signals, particularly social signals, Google+, by using the signals of users and usage data that they're getting through Chrome's market share, which I think was now reported globally as over 25% of all web browsers, which is very impressive, from StatCounter. So, I would say that this is a low-value activity as well. Not that you necessarily shouldn't do it. I mean, if you want to try and help Google make the Web a better place and you believe in their sort of mission and the quality of the people there, then by all means, spend two minutes, report them for webspam. It's not going to take a ton of your time. But please, don't think this is a solution. This will not solve any of the problems you're trying to solve. It might help Google in the long run to get better, to try and analyze some forms of webspam and link spam that they might not have otherwise caught if you hadn't told them. Is it going to help you rank better? Boy, probably not, and even if it is, not for a long time, because these algorithmic developments take a tremendous amount of time and energy to implement. Panda was years in the making. Most of the link spam devaluations that happened in '07 and '08 were years in the making. You could see patents that were filed two years, four years before those things actually came out. But reporting spam is an option. Then I want you to move on to step four, which is can you - I think you almost always can - outmaneuver the spammers using their own tactics? What I mean by this is you might see where those links are coming from, but what's winning? Is it coming from high PageRank or high MozRank pages? Sort of home pages of domains? Is it coming from internal pages? Are they coming from directories? Are they coming from forums? Are they coming from blogs? Are they coming from .edu sites? Where are those links coming from, what are they pointing to, and what kind of anchor text are they using? Is it diverse anchor text? Is it all exact match anchor text? You want to find, you want to identify all the patterns. You're going to say, \"Oh, this is anchor text pattern and this is the diversity of those patterns of where those links are coming from and this is a type of site it is coming from and this is the quantity or the number of sites I'm seeing and here's where the link target's pointing to.\" You look at all those things and then you find ways to do it inbound. Find ways to do it white hat. I promise you, you can. Think of one of the most common forms of spam, which is someone hijacking .edu webpages on student domains and then they essentially have all these anchor text links pointing to a specific page on their site from .edu pages that are buried deep in a site, but because it is an .edu it is a trusted domain. Usually there are only 50 or 100 of them, but they seem to be passing juice. So how do you get 20 or 30 good links from .edu? I'll give you some great examples. Well, I'll give you one, and then you can figure out tons more on your own and certainly there is tons of link building content that you can look at on the SEOmoz site. But here's a great one. Go do a search like your keyword - whoa, that's a lot of smudging - your keyword + file type:pdf or xls or something like that and site:.edu. What this is going to give you is essentially here is a bunch of research that has been done on .edu sites that's been published, that's probably kind of buried. Now, I want you to go create some great blog posts, some great content, that references this stuff, that turns it into a graphic, that makes a clever video about it, and then I want you to email whoever was responsible for the research, and I guarantee half the time they are going to link to you from that website, from the .edu website. They're going to be like, \"Oh, this is great. Someone turned my research into an infographic on a commercial site. Very cool. Great to see that application in the real world. Thank you. Here's a link . . .\" from an .edu that's not spammy, that's completely inbound, white hat because it's making the Web a better place. There are ways to figure out all of this stuff. Then I want you take this last and final step, step five. Beat them by targeting the tactics, the channels, the people, and the keywords that they don't target. Remember what spam does. Spam tends to look at, if here is the keyword demand curve and we've got the head in here with all the popular keywords, that's where all the spam is. You very rarely, extremely rarely, see spam down in the tail. So if you can do things like user generated content, building a community, building tons of longtail great content, having a blog, having a forum, a place where real people participate and are creating a kind of Q&A site, you're going to target all that longtail. Remember 70% of the keyword volume is in here. This is only 30% up in the fat head and the chunky middle. Great. Fantastic way to work around them. Or think about ways that they can't target, the channels that spammers, especially link spammers never target - social media, forums, and communities. Rarely do they ever target blogs. Those people don't take those sites seriously. They don't take them authentically. Think about the branding elements you can build. You can have a better site design, a higher conversion rate, a way better funnel. People subscribe to your email. To follow you, subscribe to your RSS feed. No spammer is ever going to get that, and those are customers that you can keep capturing again and again and again, because when you do inbound marketing, when you do white hat marketing, you don't have to just push your site up the rankings. You can approach it from a holistic point of view and win in all sorts of tactics and all sorts of channels. That's what I love about this field too. All right everyone. I hope you've enjoyed this edition of Whiteboard Friday. I hope you'll feel maybe a little bit less stressed out about that nasty spammer who is ranking above you. I hope you'll see us again next week for another edition of Whiteboard Friday. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "I'm Being Outranked by a Spammer"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "I'm Being Outranked by a Spammer"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kenneth Martin\n          \n            Kenneth Martin"
}