{
  "url": "https://moz.com/blog/im-dreaming-of-a-web-christmas",
  "slug": "im-dreaming-of-a-web-christmas",
  "title": "I'm Dreaming of a Web Christmas - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Ah, yes, the holidays.  That time of year when content writers like myself have to come up with cute new versions of festive songs from years past.   After we're done beating our heads against the fake office mantelpieces hung with stockings, and have sufficiently drowned our sorrows in the bitter…",
  "content": "I'm Dreaming of a Web Christmas Content Marketing K By: Kat French December 21, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! K By: Kat French December 21, 2007 I'm Dreaming of a Web Christmas Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Ah, yes, the holidays. That time of year when content writers like myself have to come up with cute new versions of festive songs from years past. After we're done beating our heads against the fake office mantelpieces hung with stockings, and have sufficiently drowned our sorrows in the bitter eggnog of trying to write lyrics that both scan properly and vaguely fit our industry (do you have any idea how hard it is to find something that rhymes with \"interactive\"? Huh? DO YOU?!), we sometimes, if we're lucky, come up with something of passable quality for our corporate communications. And then we submit the rejected first attempt to YOUmoz. In the spirit of giving, I hereby submit to my fellow Mozzers a new holiday classic: Web Christmas. Web Christmas We're dreaming of a Web Christmas, Where all the sites are valid code Where the font tag's missin' And no one's dissin' Our sites, because they're SEO'd We’re dreaming of a Web Christmas Where all the browsers render right With our clients growin’ And spam not flowin’ Because we’ve got our filters locked down tight We're dreaming of a Web Christmas, With every line of code we write May your content keep Google Alert And may all your visitors convert Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "I'm Dreaming of a Web Christmas"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "I'm Dreaming of a Web Christmas"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kat French\n          \n            Kat French"
}