{
  "url": "https://moz.com/blog/im-getting-pretty-tired-of-startup-advice-that-doesnt-include-any-mention-of-seo",
  "slug": "im-getting-pretty-tired-of-startup-advice-that-doesnt-include-any-mention-of-seo",
  "title": "I'm Getting Pretty Tired of Startup Advice that Doesn't Include Any Mention of SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Ever since SEOmoz took venture capital investment last fall, I've been reading a lot of blogs and sites geared towards the startup world. Even though we've been around for 5 years (and Gillian and I have been doing web marketing for 10), I still think of us very much like a startup - we've grown…",
  "content": "I'm Getting Pretty Tired of Startup Advice that Doesn't Include Any Mention of SEO SEO Basics By: Rand Fishkin April 1, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 1, 2008 I'm Getting Pretty Tired of Startup Advice that Doesn't Include Any Mention of SEO SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Ever since SEOmoz took venture capital investment last fall, I've been reading a lot of blogs and sites geared towards the startup world. Even though we've been around for 5 years (and Gillian and I have been doing web marketing for 10), I still think of us very much like a startup - we've grown from 3 people 3 years ago to 14 people today and we're worrying about things like burn rate, productization, marketing, and launch schedules, so I'm pretty sure we qualify. Thus, I'm inclined to read sites like Hacker News and to click on posts like these: The Year One Startup Handbook How to Save Money Running a Startup Ten Rules for Startup Success Ten Rules for Web Startups PR Tips for Startups: How to Get and Keep the Media's Attention 36 Startup Tips Startup Advice for Entrepreneurs Advice and Reading List for High Tech Startup Entrepreneurs Pithy Insights on Startup Marketing (at least here, one comment asks if the post is subtly recommending SEO) 7 Biggest Mistakes of Business Startups Startup Marketing: Big Bang vs. Darwinian Evolution Let me just be clear on this point - not one of those posts has the word \"SEO\" in it, nor makes any clear reference to getting traffic from search engines. I'm forced to ask myself - are these people idiots? Are they being coy? Or have they really never experienced the built-in marketing channel that comes from ranking at the top of the engines for a relevant keyword phrase? I hope it's the latter, because there's really no excuse for the sort of abject ignorance of startup \"advisers\" who suggest guerrilla marketing and word-of-mouth campaigns but never even examine the possibility that there might already be people searching for the product/service/website you're creating, and that by getting in front of their eyeballs right when they ask for it, you might have a good chance of succeeding. Let me just beat a dead horse for a minute here. Let's imagine you've just dreamed up some brilliant new web startup company that's going to change the world and fill this great unfulfilled need. Now, if only there were some way to figure out if other people were interested in solving the same problem. If only we had access to some sort of a repository of human queries that would tell us how popular and worthwhile our idea might be... Gee, that would be great... For fuck's sake, people - get a clue. See that screenshot up there? It's a basic keyword research tool from Google. You type in words or phrases related to your new business and Google will tell you if people are performing any searches in that arena. They'll even tell you how relatively popular or unpopular those queries might be. So, for example, let's just go over to something like this big list of recent startups and choose one at random... how about Dripbook. What is Dripbook? Let's see... From their About Us page: Dripbook is an online portfolio and community site for artists. Dripbook's mission is simple - to allow artists to easily publish their work online by taking the hassle, guesswork and expense out of creating a well designed, easily modifiable web presence. That sounds pretty interesting, actually - like a competitor to what DeviantArt has been doing for a long time. Now if only there was a free way for them to market their service simply by attracting links and attention... Yeah, you can guess where I'm going with this. Let's start by taking advantage of that AdWords tool. Wow... That's some pretty valuable information if you're starting up a site targeting online galleries for artists. You can see terms that people are searching for, how relatively popular they are, how much \"advertising competition\" (which usually translates directly into commercial value) each has, and even brainstorm potential areas to advance into (\"fine art publishing\" sounds interesting, for example). Now just take it one step further and imagine that you're the CEO of (or the venture capitalist planning to invest in) Dripbook. How valuable would it be to see your site on this page? Those top positions are probably bringing a few hundred visits every day, and every one of them is directly interested in your subject matter. In fact, they've even told you right as they arrive that they're desperately seeking a place where artists publish on the web. A good marketing opportunity? Yeah, I'd say so. In fact, I'd say it's better than being on the front page of TechCrunch and ReadWriteWeb - after all, there's not a whole lot of TC readers who are going to sign up for art publishing accounts on your site - it's just not the right audience. Why not at least try to rank for something - with a title like \"Dripbook | Welcome\" it feels like you're not even making a half-hearted attempt. Maybe I'm underestimating the SEO intelligence of web startups here. Maybe they already know the ins and outs of SEO so well - from the value proposition to the keyword targeting to the link strategies necessary to succeed - that it's totally unnecessary to even mention it as startup advice... Since I mentioned Y Combinator and Hacker News earlier (as it's one of the big sources for startup advice), let's see how some of the Y Combinator companies are performing on SEO (there's a list here): Draftmix - Fantasy Sports?! Oh man, there's a ton of searches around that topic. Fantasy Football alone has millions of searches every August. Let's see how they're... OH MY GOD!!! They don't even have a public page on the site with the words \"fantasy football\" in the title. Virtualmin - the web's most powerful web hosting control panel? That's terrific - they're actually targeting the keyword phrase in the title. Now if only they ranked in the top 100 results for \"web hosting control panel\" (which gets quite a few searches), I'd be even happier. Adpinion - This clever site lets advertisers sign up and solicits input from their users to tell them how to make better targeted ad campaigns. If only they had some targeting of their own (for goodness sake, the home page's title tag is \"Adpinion\"). Maybe ranking for keywords like \"web advertising\" or \"web advertising strategies\" or even \"online advertising programs\" (all of which have significant search volume) would help to bring some targeted leads their way. Octopart - Oh man... You're killing me here. It's a search engine for electronic parts, but it's not even making a sliver of an attempt to rank for the incredibly valuable search query - \"electronic parts.\" Going through the rest of the list just seems cruel - clearly, there's no SEO savvy here, not even the basic recognition that keyword targeting might be worthwhile. So much for the theory that startups already know their stuff on search engine optimization. Why? I don't know, but I suspect that it's because of the general attitude these communities tend to have about SEO. For example (from this thread): How Important is SEO on your Startup's Priority List? 2 points by cperciva 173 days ago | link Not important. If you build something which people want, they'll tell their friends about it. If the majority of your users are discovering you via Google, you're doing something wrong. I know that's just one opinion, but if you spend enough time outside the SEO world, you'll find that it's a pervasive attitude. I'm not sure whether to be depressed or ecstatic - after all, that just means more search traffic for those of us who understand the power of SEO. p.s. I should mention that my beef here is not with startups and startup CEOs (who have a ton on their plate). I'm frustrated with the experts of startup success providing online marketing advice that ignores SEO - to me, that's the real tragedy. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "I'm Getting Pretty Tired of Startup Advice that Doesn't Include Any Mention of SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "I'm Getting Pretty Tired of Startup Advice that Doesn't Include Any Mention of SEO"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}