{
  "url": "https://moz.com/blog/image-search-important-i-think-not",
  "slug": "image-search-important-i-think-not",
  "title": "Image Search Important? I Think Not! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "One of the major trends that emerged from SES San Jose is the supposedly increasingly important role of image search. However, after reading Eric Enge's article on the topic, you can call me a skeptic.  Here's why:1) Questionable market size.  Even if you believe the f...",
  "content": "Image Search Important? I Think Not! Online Advertising P By: pdstein August 29, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! P By: pdstein August 29, 2007 Image Search Important? I Think Not! Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. One of the major trends that emerged from SES San Jose is the supposedly increasingly important role of image search. However, after reading Eric Enge's article on the topic, you can call me a skeptic. Here's why: 1) Questionable market size. Even if you believe the figure cited that 15% of all searches are image searches, how much of that is porn? There are probably not a lot of searches done for images relevant to your average website. I'd want to see real numbers on what images people are searching for before I'm convinced. 2) Questionable conversion rates. Even if there are a significant number of images searches relevant to a website, chances are if a person is looking for an image they are not looking for your content, product, or service. Say someone is looking for an image of a Lamborghini and your local Lamborghini dealer gets their images to the top of the images SERPs. Even if the image seeker clicks through chances are they aren't going to buy a car. I'd like to see some real numbers on conversion rates from Google images referrals. 3) Universal search not that big of a deal. Sure, universal search changes things a bit. A person who is actually looking for a Lamborghini could click an image in the universal search SERPs, and if that image happens to be on a dealer site it could result in a sale, but only a small percentage of search phrases produce images in the results. What percentage? I have no idea. I'd like to seem some real numbers before I'm convinced of the importance of images in universal search. Maybe if you run a site with adult content or celebrity gossip or artwork then image optimization is important, but for the rest of us I just don't see it. That said, if you're going to put images on your site it's kind of a no-brainer to give them relevant filenames and discriptive alt tags. Why wouldn't you? It takes no more time than giving them irrelevant filenames and alt tags. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Image Search Important?  I Think Not!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Image Search Important?  I Think Not!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "pdstein\n          \n            pdstein"
}