{
  "url": "https://moz.com/blog/impactful-data-storytelling",
  "slug": "impactful-data-storytelling",
  "title": "PICA Protocol: A Visualization Prescription for Impactful Data Storytelling - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If your presentations are often met with a lukewarm reception, it's time for you to invest in better data storytelling. Learn a smarter strategy for creating convincing, highly impactful data visualizations in this edition of Whiteboard Friday.",
  "content": "PICA Protocol: A Visualization Prescription for Impactful Data Storytelling SEO Analytics | Whiteboard Friday By: Lea Pica June 1, 2018 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Lea Pica June 1, 2018 PICA Protocol: A Visualization Prescription for Impactful Data Storytelling SEO Analytics | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. If you find your presentations are often met with a lukewarm reception, it's a sure sign it's time for you to invest in your data storytelling. By following a few smart rules, a structured approach to data visualization could make all the difference in how stakeholders receive and act upon your insights. In this edition of Whiteboard Friday, we're thrilled to welcome data viz expert Lea Pica to share her strategic methodology for creating highly effective charts. Click on the whiteboard image above to open a high-resolution version in a new tab! Video Transcription Hello, Moz fans. Welcome to another edition of Whiteboard Friday. I'm here to talk to you this week about a very hot topic in the digital marketing space. So my name is Lea Pica, and I am a data storytelling trainer, coach, speaker, blogger, and podcaster at LeaPica.com. I want to tell you a little story. So as 12 years I spent as a digital analyst and SEM, I used to present insights a lot, but nothing ever happened as a result of it. People fell asleep or never responded. No action was being taken. So I decided to figure out what was happening, and I learned all these great tricks for doing it. What I learned in my journey is that effective data visualization communicates a story quickly, clearly, accurately, and ethically, and it had really four main goals — to inform decisions, to inspire action, to galvanize people, and most importantly to communicate the value of the work that you do. Now, there are lots of things you can do, but I was struggling to find one specific process that was going to help me get from what I was trying to communicate to getting people to act on it. So I developed my own methodology. It's called the PICA Protocol, and it's a visualization prescription for impactful data storytelling. What I like about this protocol is that it's practical, approachable. It's not complicated. It's prescriptive, and it's repeatable. I believe it's going to get you where you need to go every time. So let's say one of your managers, clients, stakeholders is asking you for something like, \"What are our most successful keyword groups?\" Something delightfully vague like that. Now, before you jump into your data visualization platform and start dropping charts like it's hot, I want you to take a step back and start with the first step in the process, which is P for purpose. P for Purpose So I found that every great data visualization started with a very focused question or questions. Why do you exist? Get philosophical with it. What need of my audience are you meeting? What decisions are you going to inform? These questions help you get really focused about what you're going to present and avoid the sort of needle in a haystack approach to seeing what might stick. So the answers to these questions are going to help you make an important decision, to choose an appropriate chart type for the message that you're trying to convey. Some of the ways you want to do that — I hear you guys are like into keywords a little bit — you want to listen for the keywords of what people are asking you for. So in this case, we have \"most successful.\" Okay, that indicates a comparison. Different types or campaigns or groups, those are categories. So it sounds like what we're going for is a categorical comparison. There are other kinds of keywords you can look for, like changing over time, how this affects that. Answers or opinions. All of those are going to help you determine your most appropriate visual. Now, in this case, we have a categorical comparison, so I always go back to basics. It's an oldie but goodie, but we're going to do the tried-and-true bar chart. It's universally understood and doesn't have a learning curve. What I would not recommend are pie charts. No, no, no. Unless you only have two segments in your visual and one is unmistakably larger than the other, pie charts are not your best choice for communicating categorical comparison, composition, or ranking. I for Insight So we have our choice. We're now going to move on to the next step in the methodology, which is I for insight. So an insight is something that gives a person a capacity to understand something quickly, accurately, and intuitively. Think of those criteria. So here, does my display surface the story and answer these questions intuitively? That's our criteria. The components of that are: Layout and orientation. So how is the chart configured? Very often we'll use vertical bar charts for categorical comparison, but that will end up having diagonal labels if they're really long, and unless your audience walks around like this all the time, it's going to be confusing because that would be weird. So you want to make sure it's oriented well. Labeling. In the case of bars, I always prefer to label each bar directly rather than relying on just an axis, because then their eyes aren't jumping from bar to axis to bar to axis and they're paying more attention to you. That's also for line charts. Very often I'll label a line with a maximum, a minimum, and maybe the most important data point. Interpretation of the data and where we're placing it, the location. So our interpretation, is it objective or is it subjective? So subjective words are like better or worse or stupid or awesome. Those are opinions. But objective words are higher, lower, most efficient, least efficient. So you really want your observations to be objective. Have you presented it ethically? Or have you manipulated the view in a way that isn't telling a really ethical picture, like adjusting a bar axis above zero, which is a no-no? But you can do that with a line graph in certain cases. So look for those nuances. You want to basically ask yourself, \"Would I be able to uphold this visual in a court of law or sleep at night?\" Location of that insight. So very often we'll put our insights, our interpretation down here or in really tiny letters up here. Then up here we'll put big letters saying this is sales, my keyword category. No. What we want to do is we want to put our interpretation up here. This top area is the most important real estate on your visual. That's where their eyes are going to look first. So think of this like a BuzzFeed headline for your visual. What do you want them to take away? You can always put what the chart is here in a little subtitle. Make recommendations. Because that's what a really powerful visual is going to do. I always suggest having two recommendations at least, because this way you're empowering your audience with a choice. This way you can actually be subjective. That is okay in this case, because that's your unique subject matter expertise. Are your recommendations accountable to specific people? Are they feasible? What's the cost of not acting on your recommendations? Put some urgency behind it. So I like to put my recommendations in a little box or callout on the side here so it's really clear after I've presented my facts. C for Context The next step in the methodology is C for context. What this is saying is, \"Do I have all the data points I need to paint a complete picture, or is there more to this story?\" So some additional lenses you might find useful are past period comparison, targets or benchmarks are useful, segmentation, things like geography, mobile device. Or what are the typical questions or arguments that your audience has when you present data? They can be super value contextual points. In this case, I might decide that while they care about the number of sales, because that's most successful to them, I care about the keywords \"conversion rates.\" So I'm going to add a second bar chart here like this, and I'm going to see there's a different story that's popping out here now. Now, this is where your data storytelling really comes into play. This particular strategy is called a table lens or a side-by-side bar chart. It's what I recommend if you want to combine two categorical metrics together. A for Aesthetics Now, the last step in the methodology is A for aesthetics. Aesthetics are how things look. So it's not about making it look pretty. No, it's asking, \"Does my viz comply with brain best practices of how we absorb information?\" 1. Decrease visual noise So the first step in doing that is we want to decrease visual noise, because that creates a lot of tension. So decreasing noise will increase the chance of a happy brain. Now, I'm a crunchy granola hippie, so I love to detox every day. I've developed a data visualization detox that entails removing things like grid lines, borders, axis lines, line markers, and backgrounds. Get all of that junk out of there, really clean up. You can align everything to the left to make sure that the brain is following things properly down. Don't center everything. 2. Use uniform colors (plus one standout color for emphasis) Now, you'll notice that most of my bars here have a uniform color — simple black. I like to color everything one color, because then I'll use a separate, standout color, like this blue, to strategically emphasize my key message. You might notice that I did that throughout this step for the words that I want you to pick out. That's why I colored these particular bars, because this feels like the story to me, because that is the storytelling part of this message. Notice that I also colored the category in my observation to create a connective tissue between these two items. So using color intentionally means things like using green for good and red for bad, not arbitrarily, and then maybe blue for what's important. 3. Source your data Then finally, you always want to source your data. That increases the trust. So you want to put your platform and your date range. Really simple. So this is the anatomy of an awesome data viz. I've adapted it from a great book called \"Good Charts\" by my friend, Scott Berinato. What I have found that by using this protocol, you're going to end up with these wonderful, raving fans who are going to love your work and understand your value. I included a little kitty fan because I can. It's my Whiteboard Friday. So that is the protocol. I actually have included a free gift for you today. If you click the link at the end of this post, you'll be able to sign up for a Chart Detox Checklist, a full printable PICA Protocol prescription and a Chart Choosing Guide. Get the PICA Protocol prescription I would actually love to hear from you. What are the kinds of struggles that you have in presenting your insights to stakeholders, where you just feel like they're not getting the value of what you're doing? I'd love to hear any questions you have about the methodology as well. So thank you for watching this edition of Whiteboard Friday. I hope you enjoyed it. We'll see you next week, and please remember to viz responsibly, my friends. Namaste. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "PICA Protocol: A Visualization Prescription for Impactful Data Storytelling"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "PICA Protocol: A Visualization Prescription for Impactful Data Storytelling"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "P for Purpose"
    },
    {
      "level": "H2",
      "text": "I for Insight"
    },
    {
      "level": "H2",
      "text": "C for Context"
    },
    {
      "level": "H2",
      "text": "A for Aesthetics"
    },
    {
      "level": "H3",
      "text": "1. Decrease visual noise"
    },
    {
      "level": "H3",
      "text": "2. Use uniform colors (plus one standout color for emphasis)"
    },
    {
      "level": "H3",
      "text": "3. Source your data"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Lea Pica\n          \n            Lea Pica\n          \n            Lea Pica"
}