{
  "url": "https://moz.com/blog/implications-of-mozilla-geode-on-seom-and-privacy",
  "slug": "implications-of-mozilla-geode-on-seom-and-privacy",
  "title": "Implications of Mozilla Geode on SEO/M and Privacy - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "\"You’ve arrived in a new city, a new continent, a new coffee shop. You don’t really know where you are, and are looking for a good place to eat. You pull out your laptop, fire up Firefox, and go to your favorite review site. It automatically deduces your location, and serves up some delicious…",
  "content": "Implications of Mozilla Geode on SEO/M and Privacy Online Advertising M By: Marty Martin October 10, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! M By: Marty Martin October 10, 2008 Implications of Mozilla Geode on SEO/M and Privacy Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. \"You’ve arrived in a new city, a new continent, a new coffee shop. You don’t really know where you are, and are looking for a good place to eat. You pull out your laptop, fire up Firefox, and go to your favorite review site. It automatically deduces your location, and serves up some delicious suggestions a couple blocks away and plots directions there.\" From Mozilla Labs Geode project. OVERVIEW I'm not going to discuss any of the nitty gritty of how the new application works, but rather, the implications for us as search engine optimizers and marketers. Obviously, the ability to geolocate a website visitor and serve them a custom advertisement is a pretty powerful feature, but generally speaking we can already do those sorts of things with IP-based tools like traceroute, right? What's the advantage here?Most IP-based location services are not terribly accurate depending on the visitor's ISP and where they're connecting from. You can generally get a region or city-based lock on someone based on their assigned IP address, which is useful and highly used now by advertising networks and others. Skyhook Wireless has developed an application called Loki, and Mozilla, by adapting it for use with Geode, can pinpoint your wireless signal to within 10 to 20 meters normally within one second. That's pretty impressive. PRIVACY - What's a user to do? There has been a lot of controversy lately about ISP behavioral targeting with the announcement that the US Congress has been investigating some of the larger ISPs and their use of tracking software. Currently, the Geode service is a double opt-in type service, requiring the user to download and install it, and then to confirm the transmission of their location and other details (your exact location or maybe just the general neighborhood, city or nothing) to the requesting website. So from a privacy standpoint, it looks like you're pretty safe (until you download that screensaver with that neat toolbar that doesn't mention what it's doing in the background). CLOAKING - Who, me? I swear Matt, it wasn't me! I don't want to open up the whole can of worms that is cloaking, but I don't think there's any way to avoid it. With a powerful new tool like this, how much more interactive can we make our websites, and serve customized content based on users' geolocation? Is this a legitimate use of cloaking? What if Yelp's home page were changed to automatically alter its content to show you all the great Ballard coffee shops within 2 blocks of your location near the corner of 31st Avenue NW & NW 85th Street? Is this cloaking? Yes. Is it an acceptable use? Maybe. Depends on the shade of your hat at the moment and which way the wind is blowing here. A BIGGER PICTURE - Maybe. I think the biggest use for advertisers is going to be the extreme local. Let's go back to that fishing village coffee shop mentioned above. You've had your caffeine, it's 10pm, where are you going to go now? You fire up your wifi connection, ask Jeeves and are presented with a spiffy ad of the hot rave party happening right now...just a few blocks away. What the heck are we waiting for, let's get out there. We all know the more relevant the ad is to the viewer, the more likely it will convert them. I think this application will be more useful in larger cities, maybe not as much in small cities and towns. It might be a really cool new LoJack tool too. Can you imagine the look of surprise on that perp's face when you walk over and jack him up for stealing your phone? CONCLUSION I really want this post to open up some conversation on other potential uses/abuses and your thoughts on the matter. So let's hear your thoughts on the subject! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Implications of Mozilla Geode on SEO/M and Privacy"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Implications of Mozilla Geode on SEO/M and Privacy"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Marty Martin\n          \n            Marty Martin"
}