{
  "url": "https://moz.com/blog/improving-reporting-efficiency-and-relevance",
  "slug": "improving-reporting-efficiency-and-relevance",
  "title": "Improving Reporting Efficiency and Relevance - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Hey Mozzers! A quick introduction for those of you who don't know me: my name is Sam Crocker.  I work for a global media agency called OMD and am based in London. In  addition to our work on (primarily) enterprise SEO clients we also  occasionally find time to work on our search and social blog.  I…",
  "content": "Improving Reporting Efficiency and Relevance SEO Reporting S By: Sam Crocker April 27, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! S By: Sam Crocker April 27, 2011 Improving Reporting Efficiency and Relevance SEO Reporting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Hey Mozzers! A quick introduction for those of you who don't know me: my name is Sam Crocker. I work for a global media agency called OMD and am based in London. In addition to our work on (primarily) enterprise SEO clients we also occasionally find time to work on our search and social blog. I am an avid consumer of content in the SEO field and when I'm not doing client work I am constantly working on testing out new ideas, (working on) improving internal processes and reading/sharing SEO and tech stories on Twitter. I am also extremely happy to be writing another post for SEOmoz after a bit of a hiatus. Introduction As some of you may well recall, my old boss and good friend Tom Critchlow featured on White Board Friday back on April 14th talking about How to Make SEO Happen. There should be no doubt about the fact that this is an important factor to all SEO practitioners and consultants because at the end of the day it may be nice to give advice and hide behind issues around how \"it's the dev's fault\" or other classics that we've all been forced to use (let's be honest, sometimes it is the dev's fault). However, the obvious fact is that we are hired based upon our reputation or our price point, but we are retained based upon our ability to deliver results. Perhaps, more importantly still, we are paid based upon our ability to report on the results we deliver. It is all fine and good if we get some outstanding links to our clients from \"well respected\" and \"authoritative\" sources, but at the end of the day, most of our clients are business people and regardless of how hard you worked to get that link from the New York Times, if it hasn't had a positive and quantifiable impact on the site and on their bottom line, you can kiss that retainer goodbye. However, any of you who are familiar with me and know about my tendency to complain about unnecessary tasks and poor allocation's of resource will know that reporting, much like SEO forecasting, are not the way that I like to use my time or my clients budget. Important as they may be I don't revel in the opportunity to create loads of pretty (and confusing) charts and graphs and then write up copious justifications for what I have done and why it did or did not work. As such, I was more than happy to volunteer when Tom asked me to write a post about saving time on reporting - as he was shocked by the number of Mozzers who seemed not to mind spending too much time on reporting. The bottom line is this: clients have hired you both to deliver results and communicate those results with them in a manner that they can understand. Reporting is only valuable if the client reads the report (largely dependent on them understanding what they are looking at) and that it is profitable. You could measure the profits of this report in a number of ways - I've even known some to attribute time reporting to \"new business\" as it is essential to retaining clients. This is not, in my view, the right way to do things. As with forecasting, SEO reporting kind of sucks, but when it needs to be done, it needs to be done as quickly as possible and be targeted to the relevant audience. I won't go as far as Tom to say that we can eliminate it all together (much as I would like to) but there are clearly a number of ways in which we can cut down on the amount of time it takes. Speaking of saving time, if you are very short on time and just want the long-term panacea to the reporting-suck click here. The rest of the post should help you improve everything else in the short term though! [Note from Tom: I'd like to quickly clarify my position here and note the difference between reporting and reports. My original whiteboard friday uses the word reports but is really talking about strategy & recommendation reports. I believe length strategy reports are not good, but I think monthly reporting is definitely a good thing. After all, as I mention in my WBF communication is the key to solve all problems and reporting is part of that. This is totally my fault for not being clear in my whiteboard friday and I'll likely write a follow-up post soon to clarify. My comment here also explains my thinking a bit more clearly. Sam shares awesome tips here on making reporting actionable and clear but I don't want people thinking I'm against all reporting :). Now, on with the post!] Part I: Tips to Improve Understanding Odds are, your client receives reporting for a handful of reasons. You may report on your work out of moral obligation (in which case you're likely not confident in your work), you may report as an opportunity to make more money (in which case you are a savvy business person, but you'd be better off reallocating these funds), you may report because every client expects a report (in which case you are wasting your time because they probably don't read it) or, in the best of cases you are reporting because your client genuinely knows why they have hired you and want to see that you are meeting the original goals discussed or can at least account for their investment if goals are not being achieved (in which case you are extraordinarily lucky). Avoid This (via) Step 1: What Are Your Shared Goals Most SEO projects start with some sort of goal in mind. Sometimes it takes a bit of coaxing (I can't tell you the number of times I've had to challenge a prospective with \"yes but what do you want the website to do?\"), but it is important to establish what the client's goals for the project are and to lead them to the factors on which they should be focused. Note: You may have to tell them what they should be looking for. These clients are not always the most fun to deal with and it is important to agree these things before starting work. Step 2: Identify the Target Audience If the project you are undertaking is for one person, you better be prepared to get to know this person well and learn what they expect, how to talk to them, etc. However, there is no question that you will prepare a report differently for the Board than you will do for the developers or an in-house SEO. Make sure you know who will be reading the report and create different reports where necessary. *Bonus timesaver - be realistic with the client. If you can get them to admit that they will only read a report once every three months send over a \"status sheet\" once a month and run quarterly reports face-to-face. Step 3: Create Reports Relevant to the Target Audience The first month or two is always going to be a bit difficult and your client will likely have plenty to learn depending on their experience. If you are patient with the client in the first month, build a report-style based upon the recipient of the report's knowledge base and include only the most relevant benchmarks for your campaign you will save a lot of time in the long run. Make sure you get everyone who will see the reports in the room with you and walk them through the first reports! Base Level Reporting (for the Board, Head of Marketing or \"Monthly Update\") There are certain elements that you should probably plan to include in all reports, these \"essentials\" are what I like to refer to as \"Base Level Reporting\" (BLR). A BLR should be as easy to read and short as possible. The important thing to think about is what are the bare minimum metrics on which I should report? What to include: (If applicable) Value of Sales from Organic Non-Brand Visits (Month-on-Month) Organic Branded Visits vs. Organic Non-Brand Visits (Month-on-Month) Total Number of keywords sending traffic (Month-on-Month) Progression against agreed goals \"Status Sheet\" Executives of large businesses don't have time to focus on every individual ranking (nor often do they care) and they certainly don't have time to read about every single link that has been built. More importantly - as Justin very adeptly pointed out on the Raven blog - reporting on link building can make your reports suck. Note- the \"status sheet\" is in my view one of the most important ways to document who is responsible for what and what the timeline is. This can be incredibly powerful if you are ever dealing with a slightly less motivated client to document the fact that you both have agreed obligations as part of the project and will ensure that you are not always taking orders from the client or grief for \"overdue\" tasks. It goes both ways and will keep everyone honest. Quarterly/Yearly Reporting (May be more Regular for In-House SEO Manager, Marketing Directors, Webmasters, etc.) The quarterly report can be essential and warrants a slightly larger time investment. However, this does not need to become overly onerous, but should include more detail about what you have done (i.e. how your time has been spent, how rankings have performed, etc.). This type of report truly is a measure of performance and effort combined. It is an opportunity to go over your biggest successes and potentially discuss strategy. What to cover (in addition to the BLR): \"Visibility metrics\" - I would advise against showing every single move for every single term. Organic Traffic Brand vs. Non-Brand (Year on Year) + Commentary on seasonal trends Top 10 New Terms Sending Traffic Links Built - provide list as appendix, report on links by MozRank buckets if required Additional organic traffic generated (Digg, StumbleUpon, etc.) Performance of engagement metrics or goals (e.g. PDF downloads) Performance of individual content (linkbait) efforts This report will be more time consuming to pull together but still should not be overcomplicated. The vast majority of these items should be supplied as a means to build trust and provide documentation for their investment (e.g. links built) but do not warrant in-depth analysis. I would advise against supplying the full list of keywords and ranking within the report (e.g. visibility metrics) as they can be confusing and over-complicate the situation. This can always be provided as an appendix. Example \"New Links\" Chart *KEY POINT - this should not be a written report. Get together with all relevant parties and talk through some slides - it will take less time if you set an agenda and stick to it. Feel free to provide handouts, but do not write out your entire strategy and try to justify every single task. Firstly, it almost always looks more defensive in person and secondly, it's way too easy for your competitor to use if you ever lose an account. Project Review Reporting The BLR should be largely neutral in tone. By all means you should celebrate huge successes as and when they occur by way of a phone call or an email. The Quarterly report allows a bit more opportunity to focus on individual successes, however it is still important to stay mostly neutral. However, at the end of the project or the end of a fiscal year is an opportunity for you to focus solely on your achievements. This is the time to sell so feel free to bust out all of your case studies and be biased here. However, painting a rosy picture every month means that the success will begin to mean less and the failures will be more glaring (especially if you are not reporting on them regularly). Save your big \"look at us\" case studies for the end of the month. You can share these successes over a celebratory beer with your contact at the agency but don't go cluttering up every monthly report talking about how great you are. Additional Communication (ad hoc) It is obviously important (particularly if you want to cut down on reporting time at the end of the month) that you stay in regular contact with your clients. Although some agencies rely on a service model \"you get one day a week\" it's important to deliver education and regular communication. You don't have to be on the phone every day and you need to know when to rein it in, but you should be available to discuss strategy and implementation at least once a week. If it becomes an issue, put a cap on it. Also, there is no justification for writing an individual email to every single one of your clients whenever something changes. Your client may not have time to monitor every change in the marketplace and in the algorithms (and it's probably best they don't) but you should keep them up to date. If you create a blog and tell them where to find it and update it regularly this should be fine. Alternatively, you could always write a recap newsletter that everyone receives once a month. Most importantly, and in the spirit of being open and transparent, be ready to jump on the phone when things go south. There is nothing a client hates more than to phone their SEO agency to ask them why they've dropped out of the rankings. If you establish the trust and catch these things when they occur you can drastically cut back on the number of \"how come Beth sees us ranking number 4, but I see us ranking first!?\" conversations. Part II: Ways to Increase Profitability, Save Time... and Get Better Results for Your Clients Alright folks, so hopefully the above has helped you gain a better understanding of the types of things we like to report on and ways to make sure you are speaking to the right person and in a language they understand. One of the main lessons from the above section is that sometimes it is actually quicker to produce two reports than to try to combine a report designed for an in-house SEO manager with one that is designed for a Head of Marketing who has five other advertising channels to worry about. However, the other lesson that is a bit more subtle is: you do not always need a report. I hope the following will increase the profitability of your reporting, save you loads of time and will ultimately get better results for your clients. The below are the lessons Tom hoped I would share. Option 1: Increase your Rate It's a realistic option. You could always charge more for your reporting. If it is something your client cares exorbitantly about, be very specific about the costs associated with \"better\" reporting. We have a dedicated team of data scientists that we could use for reporting and though I'm sure our clients would be impressed with the results, I'm also not sure that they would like the cost associated. More importantly, your client doesn't need that expensive 50 page report. Increasing your Rate is an option, but not one that I would ever prefer and not one that would likely lead to better results for any of our clients. The only case in which I would suggest increasing your rate would be to allocate that money to building a template, investing in a dashboard, or offsetting a software for reporting. Option 2: Reduce Time Spent on Reporting For me, this is clearly the preferred option. Although charging more money for reporting is nice, spending more time reporting is not something I really fancy - nor is it something I would expect anyone else on the team to spend too much of their valuable time on. Below are some of the tactics I've made use of to reduce reporting times. 1.) Be transparent and open with your hours The benefits to this in a number of other respects is obvious, however it is a powerful bargaining tool. If you are open with your hourly rate and willing to share the previous month(s) breakdown of hours spent on work a strong argument can be made about how much time as follows. If your rate for your time is £100/hr (and you should know your rate) it is as simple as this: \"Last month we spent 6 hours on your report. - at a cost of £600, but more importantly at a cost of 6 hours of my time. You have hired me to consult on and implement SEO which is what I do most efficiently and most effectively. Please consider investing that money in a software to improve reporting or consider reducing the frequency of our reports\" Note, my favourite time tracking software of the moment is Harvest - a big \"thank you\" to all who suggested it. 2.) Automate as much as possible This one also seems fairly obvious but it's something that we've all been guilty of at one point or another. We can't all be Excel wizards and building a template can be costly. This is where you can save a lot of time by making use of an expert to build a template for you. If the template is intuitive enough you pretty much copy and paste data/segments from the Google Analytics API and the rest is auto-generated. As you will see from my last point, my personal view is that this should be taken to the next level. 3.) Report less frequently Another obvious opportunity. As I've touched on in a number of instances above there is no reason to report on all the metrics listed in the BLR and Quarterly Report every single month. It is important to be accountable for your work but having too many charts and too much analysis month-on-month will almost certainly lead to your clients no longer reading your reports- in which case everyone loses. This is exactly why it's so important to have a frank conversation with your clients and remind them how valuable your time is and how much better spent (break it down to dollars and cents) your time would be creating great content and getting links than on filling out a report. 4.) Just report ROI Ranking reports and \"new traffic\" are great and sometimes necessary for reporting. However, what have we really been hired for? This all comes back to the notion that our audience wants to know what we've been up to, but if you are getting results (the very results that you all agree you have targeted) the rest can be supplied as documentation and potentially never need discussion at all. In the ideal situation you don't even need all of the metrics from the BLR in a monthly report. In the case of eCommerce clients ultimately you should be reporting on number and value of sales generated from your efforts and perhaps providing an appendix or two to document your linkbuilding activities, beyond this, try to save the other stuff for a quarterly or biannual report. At the end of the day this should be the main monthly focus of any eCommerce client whilst brand building may be something to keep an eye on and report on less regularly. This isn't always an option but is just one example of how to reduce the intensity and frequency of your reporting. 5.) Present your report (PPT or Prezi) Another no brainer for me really. How do you feel when you receive an email or document that is 50 pages long? I feel frustrated and overwhelmed. The solution is to set up a monthly phone call (or face-to-face where possible) and present your charts/figures to the client. Send over all of the data a day before the call and make sure they have a serious look through it before you speak on the phone. Setting up a phone call prompts and ensures action from the clients' perspective (it means they are much more likely to read your report) and also shows that you are proactive. I cannot tell you over the years how many clients I've seen won and lost as a result of poor communication - and sometimes there have been great results to back up the work! At the end of the day odds are you don't want to spend loads of your time writing pages and pages of analysis, so walk them through the report and let them ask questions! Biggest Timesavers: 6.) Empower and /Educate In the long run, absolutely nothing has saved me more time on reporting than speaking with the client at the beginning of a project and getting a feel for what they expect or want out of a report. Questions to ask: Who else will see this report? What will you (the client) be judged upon? What other things would you ideally like to see in a report? It's important to revisit this after the first 3-4 months as well to make sure that they are getting all of the data they need, but also that they are not getting loads of superfluous data they don't understand. For me, it is all about building your template or dashboard based upon their needs, billing the client for this cost and taking the time to teach them what it is they are looking at, when \"up\" is a good thing and when it is a bad thing so that ultimately they can look through larger sets of data on their own time should they choose. If you are planning to have a long relationship with this client the 5-6 hours this may take up front will save you loads of time in the long run. 7.) Dashboard, Dashboard, Dashboard Pro So, this is a bit of a new one for our team but we have recently been privately testing a reporting solution that we think shows a great deal of promise. These solutions tend to be immensely costly which, again, means having an earnest conversation with the client about footing the bill but as many clients as we can get set-up with this solution we will pursue this option because it makes the most of a scarce resource. Some of these platforms create dashboards (based on ranking and analytics data) that are truly impressive and, perhaps more importantly, dynamic. These platforms allow you to create which reports are created (see above suggestions in the BLR and QR sections) but the client can then click around and get stuck into the data if they are so inclined. Once this has been set-up it truly is a \"set it and forget it\" type situation. It will require more up-front training for the client but it is a must for any tech/SEO savvy client. Some of these products are still early days and have limited support/data for Europe so be very scrupulous and ask a lot of questions if you're thinking of going this route! *If this interests you have a look at Covario, Bright Edge, Conductor or any others you can find! Con The con to going this route is that at the moment the solutions that are actually worth their cost are stupidly expensive and often the cost is set-up on a \"per client\" basis rather than an \"unlimited number for a set cost\" basis. The result is, this will rule this option out for almost any SME or local-business clients. However, as I mentioned earlier, there are plenty of extraordinarily talented developers and Excel wizards out there. This is something that could easily be created on a microsite for your client(s) and would almost certainly be less expensive in the long run. For me, dashboarding still has a long way to go, but in mind it will replace about 90% of the time I spend on reporting over the next six months... and I'm pretty happy about that. I hope you've found this post helpful and would love to hear your thoughts on reporting in the comments. Any other time-saving measures you've taken and care to share with the class would be much appreciated or if you're a bit shy feel free to share them with me on Twitter. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Improving Reporting Efficiency and Relevance"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Improving Reporting Efficiency and Relevance"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Value of SEO Beyond Traffic and Leads — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Ensure a Flawless GA4 Setup and Ongoing Tracking Functionality"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sam Crocker\n          \n            Sam Crocker\n          \n            Sam Crocker"
}