{
  "url": "https://moz.com/blog/improving-social-subscription-calls-to-action-whiteboard-friday",
  "slug": "improving-social-subscription-calls-to-action-whiteboard-friday",
  "title": "Improving Social & Subscription Calls to Action - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In this week's Whiteboard Friday, we'll be discussing ways that you can improve your social and email calls to action to make them more effective. Often times, when wandering the web, you'll find web pages that are filled from head to toe with all the possible calls to action that are available. By…",
  "content": "Improving Social & Subscription Calls to Action Whiteboard Friday By: Rand Fishkin July 20, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 20, 2012 Improving Social & Subscription Calls to Action Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In this week's Whiteboard Friday, we'll be discussing ways that you can improve your social and email calls to action to make them more effective. Often times, when wandering the web, you'll find web pages that are filled from head to toe with all the possible calls to action that are available. By limiting your usage of these calls to action and by placing them purposefully, you will a significant increase in your conversions. As always, don't forget to leave your tips, tricks, and pieces of wisdom in the comments below. Happy Friday everyone. Video Transcription Howdy, SEOmoz fans. Welcome to another edition of Whiteboard Friday. This week we're talking about how to make your social and email calls to action more effective. I've drawn out a page here that I think represents what a lot of us see on the Web, what a lot of us do, particularly when it comes to blogs, but also when it comes to a lot of e-commerce types of pages, pages on the Web that we use for B2B types of content, really, any pages that you find where there's social calls to action, calls to action that want you to take some . . . subscribe to me, follow me on Twitter, subscribe to my email, become our fan on Facebook, follow us on Google+, post to our Pinterest Board, whatever it is. All of those types of actions that are generated on the Web often follow this format where you see, okay, here's a site. Here's the menu. There's a page title. And then they'll be just littered, literally littered with calls to action. I'm going to highlight in red all of the places where I see social calls to action oftentimes simultaneously. Over here on the sidebar, we'll use this left-hand nav that kind of pops out. Then we'll have some areas up here that have got a few. Oh yeah, make sure to put our Facemash on the right-hand side to show off all our Facebook. Oh, and let's have our tweets. Then we'll have the subscribe to email. Oh, at the bottom of the post we've got to have it there too. Are you kidding me? I know you really, really, really want people to follow you on these social services and subscribe to your email. But is this the right way to go about it? Imagine if it was an e-commerce page, and it was just littered with buy buttons. Everything always said buy, buy, buy, add to cart, add to cart, add to cart. Kind of crazy. Right? There should be one place where there's that one call to action, but instead we've overwhelmed. We've let the social web overtake our normal logic, our better knowledge of UI and UX practices, and we're delivering an experience that is essentially, \"Where's the content man? If I subscribe to you, it's because I want to follow your content, and all you're telling me with your page is, 'Follow me.'\" This is a little overwhelming, and so I wanted to provide some best practices, some ways, some tips to help streamline this process and make it a little bit better. Let's walk through those. First off, as you can imagine, one of my top tips, one of my best ones is limit the choices. Don't overwhelm. I mean this two ways. I mean, number one, limit the choices in terms of decide where you're getting your best usage, your best customers. Limit your network to those places. If Twitter and Facebook are the place for you, great. If it's Facebook and email, great. If it's Pinterest and it's LinkedIn, fine. You can provide, if you want, and a lot of people will do this, where they'll put one section up in the top right-hand corner. That's got the little icons for each network so that all of those are findable, sort of like the contact us page and the about us page or the terms of service and legal use and privacy policy. Those things are findable. Great. That's fine. That way, someone can go to any page on your website and, \"Hey what's these guys' Twitter? I want to tweet something at them. Great. There it is, right there.\" In terms of calls to action, things where you're actually trying to get the subscription, where you're saying, \"Hey, here's our Twitter box, and subscribe to us, follow us on Twitter, subscribe to our email,\" in terms of those calls to action, limit those choices. I would highly recommend max, max one to two. Really, seriously, you should only be trying to drive one or two social email actions on a single page. That should probably be relatively consistent. You also probably don't want to overwhelm, meaning there's no reason to have this many. If you've got one box that's got them all somewhere on the page, in the footer, near the header, at the top, great. Then you want to have your one call to action in the place . . . this is tip number two. Promote where the action is most likely to happen. I'll give you a great example of this. If you follow OkCupid's blog, which is called \"OkTrends,\" I urge you to check it out. They have lots of phenomenal, interesting content there. What OkTrends has done is a ton of testing to see what's most effective. They found Facebook to be their most effective channel. What happens is, as you scroll down and are reading the page, in fact you'll see something like this. I've reached the bottom of the content, right, so all the content's up here. They have great graphics and images. Then here are the comments starting down on the bottom of the page. What you're going to see that's fascinating is as I've scrolled down, as soon as I reach the bottom here, where I've essentially said, they can detect via the browser, via JavaScript, hey, this person just reached the bottom of our content, the end of the blog post. Now is exactly the moment where we're going to drop down this little blue thing up here, and it's going to have a message sort of written in here that's like, \"Subscribe to us on Facebook,\" or \"Like us on Facebook.\" Brilliant timing. They know which of the right call to action is to make, and they're making it at the time when you've finished consuming that blog post and you are most likely, because clearly, you've been engaged throughout reading the post. Think of asking for this at a time in normal conversation before you've even given the value proposition. Right? It's not like I tell you, \"Hey, I want you to share what I'm about to tell you with all your friends.\" \"What is it? Why do I need to share it before I know? Shouldn't you ask me that after you tell me what it is?\" And that's exactly what OkTrends is doing here, and that's what I would urge you to do as well. Make it happen at the call to action time. If there's content that makes someone scroll down a page, I really like having it at the bottom. At the same time you're asking for the add a comment or make a purchase on a page, that's the time to ask for that sharing activity. Prior to that, it's just a little odd. It's a little out of place. Customize. Don't just use the standard calls to action. Right? Standard calls to action would be like the Tweet Me button, or the Facepile, embed, or those kinds of things. Those can be fine. Those can work. You can certainly test them, but I really like customizing, because the problem with the standard ones, especially those Facepile, Tweet Me, and that kind of stuff is that those buttons, those images, those graphics, those embeds, they start to look the same across page and sight and all over the Web. When that happens, ad blindness happens, banner blindness happens. This is the same sort of thing that advertisers talk about with branding advertising that the ads just don't stand out anymore. People stopped noticing them. If you can customize, if you can make it unique, you can add your color scheme, you can your brand, you can add clever messaging, you can make it unique and different from what everyone else is doing on the Web with their social, that's when you'll stand out. That's when you'll have a much different experience that makes people stand up and pay attention to what you're showing them. Number four, create an expectation and then, please, fulfill it immediately. This is most important with things like email, but it's also important with tweets and Facebook, etc. What I mean by this is if you have a call to action that says, \"Like us on Facebook and get updates like this,\" or \"Be notified when we do these kinds of things,\" your Facebook feed, the Facebook page should be a list of a lot of those things with not a whole lot else. It should be doing exactly what you say. If you tell them, \"Subscribe to our Moz Top Ten email\" - we have a Moz Top Ten email - one of the things that we should probably do is as soon as you subscribe, we send you the last one. We don't do that right now, but we should. We're working on it. That way you get this sense of, \"Oh, look, it's just what I asked for. It's as promised. Here we go. This is great.\" Now they're delivering on the expectation they've created, and that creates a sense of trust immediately. Excellent way to go about this. Use relevant social proof, number five. A lot of times people will say, \"Oh great, I'll put the Facepile in, or I'll show them who else from their network is following me.\" Sometimes that's good. Sometimes it's not. Social proof is very case specific. For example, if I am going to be going out and buying a consumer product, maybe I am interested in what my friends are doing. But if I'm going out and I'm buying a product for my business, I might actually be interested in what people like me, who are relevant, who are at companies I know and like and trust, who are influencers and authority figures, their opinions may be much more interesting and important to me than, hey, your friend on Facebook, or hey, your LinkedIn connection bought this. That's kind of less interesting. So I would urge you to figure out what the social proof is that's case specific to you and then apply that on these pages. If it's we are followed on Twitter by . . . I don't know if we are but Danny Sullivan or Avinash Kaushik or Richard Baxter or Will Critchlow, whoever these people are that you sort of go, \"Oh, I know those guys. I really respect what they say.\" I will also follow SEOmoz or whatever your business is. This is UX 101. Make the process dead simple. I have started to see these more complex social subscription, particularly email ones, where it pops up in a box and it asks you for more information, wants you to confirm before you do this. If you can, make it dead, dead simple, meaning, if you have an email box, I want it to look like this. Your email, subscribe. When you click subscribe right here, you get a little popup that says, \"Thank you. We've just sent you an email to confirm your address. As soon as you click on the confirmation, you'll receive your first email from us.\" Amazing. Dead simple. Took me, literally, my email, a click and a confirm. Done. Sold. Easy. That dead simple process, that's the kind of thing you want to create, not just here, but anytime you have calls to action, because simplicity will promote higher conversion rate, better funnel mechanics. Number seven, eliminate the noise from your social and email feed. If you are sending a lot of email blasts to your subscribers, if you are sending a lot of tweets, you're doing a lot of Facebook status updates, and you're looking and seeing the click through rate and conversion rate and engagement rates are low on a number of them and then occasionally high, gets a little spiky, try to focus on the spikes. Get rid of the noise and focus on curating that content better so that you have essentially fewer messages, but more high quality messages. This works extremely well as people who subscribe to these services start subscribing to more and more. In the early days, very early days of Facebook, early days of Twitter, early days of email, way back in the day, people didn't get as overwhelmed and, therefore, more messages were more welcome. Now signal to noise ratio matters a lot more. Finally, number eight, so, so important, if you can at all, measure the channel ROI that you're getting. What I mean by this is measure the difference between the value of someone coming from Facebook or Twitter or LinkedIn or Google+ or email, or whatever it is, your RSS feed. Look at those different channels and say to yourself, \"All right, I see that when I get someone subscribing to our RSS feed, that is just a huge value ad, because they come back to us on average 5 times in a month, and within 3 months, they become a buyer, and 60 percent of the people who touch our RSS feed, within 6 months will buy something from us.\" Fantastic. Figure out what those different numbers are, and then focus on the channels that matter most to you. It might seem weird sometimes, but I've seen a lot of B2B case studies where LinkedIn is the highest referring. I've seen a lot of case studies where email is a much higher converting source than Facebook or Twitter or any of the other social networks. Pay attention to this and make sure you focus on the ones that matter most. Don't be persuaded by popular media, social media, technology media that says, \"Oh, Pinterest is the next hot thing.\" And you think, \"Oh no, I don't have a Pinterest board. I've got to get people signing up for my Pinterest board and following me on Pinterest.\" Whoa, whoa, whoa, hold your horses. Is that actually a valuable channel for you? If you don't know, you should test. You should spend some time there. If you do know, and it's low, well, don't bother. Maybe that's not your demographic. Maybe that's not your psychographic. Maybe your customers just aren't there. Maybe, for some reason, the medium and your media don't connect well. That's okay. If you focus this, then you can do a great job on limiting the choices, promoting the right actions, and all of these other things. All right everyone. I hope to see some fantastic calls to action for your social and email campaigns in the future, and I'll see you again next week for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Improving Social & Subscription Calls to Action"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Improving Social & Subscription Calls to Action"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}