{
  "url": "https://moz.com/blog/improve-content-organic-clickthrough",
  "slug": "improve-content-organic-clickthrough",
  "title": "How to Improve Organic Clickthrough for Your Content - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "SERPs are becoming more diverse and interactive, making any CTR study out there much less reliable, because no two sets of search results are ever the same. So, how much control do content creators have over how their work is represented in search? As it turns out, quite a bit!",
  "content": "How to Improve Organic Clickthrough for Your Content Search Engines | On-page SEO | Content Marketing By: Ann Smarty January 13, 2022 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Ann Smarty January 13, 2022 How to Improve Organic Clickthrough for Your Content Search Engines | On-page SEO | Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Google search result pages are becoming more diverse and even interactive, which makes any clickthrough study out there much less reliable, because no two sets of search results are the same. But how much control do writers and content creators have over how their content is represented in search? As it turns out, they do have quite a few options when it comes to optimizing their search snippets! The anatomy of a standard search snippet The standard Google search snippet has changed over the years, but in essence all the key elements are still there: The clickable title or headline of the snippet (in blue)The description of that page (about two lines long — it was lengthened for no particular reason a few years ago, but now seems to be back to two lines)The URL path (used to be in green, now it is black) On a mobile device, there’s also a tiny logo next to the URL: Here’s how much control you have over these standard elements of your search snippet (in the order they currently appear): Logo Google will use your site favicon when deciding which image to show next to your URL. This means that you have full control over this part of the search snippet. URL path These days, Google will do its best to show the meaningful URL path (almost like a breadcrumb) instead of simply the URL of the page. This consists of: The domain: I don’t have any research to support this, but I personally always scan domain names when choosing what to click. That being said, your choice of a domain name may somewhat impact your clickthrough (if you do a particularly good job picking a snappy domain name that intrigues) and you do have full control over this part of the snippet. Tools like Namify specialize in finding exactly that type of domains that are short, memorable, and witty.The breadcrumb or the truncated URL: You can use breadcrumb schema to force Google to use breadcrumb instead of the URL, and watch your Search Console to see if that helped clickthrough: Title Google used to rely on the page title to generate the title of the search snippet, but it has been rewriting that part more and more often recently. That being said, it is still recommended to optimize your title to include keywords and entice more clicks — and hope Google will keep it intact. Description Google has been generating the search snippet description for years without using the associated meta description: recent studies show that Google ignores meta descriptions in about 70% of cases. You may still want to create meta descriptions in case Google needs some clues, but expect them to figure this part out on their own. Another way to try and trick Google into using your chosen snippet description is to create concise summaries of the content and add it at the beginning of the article. Using semantic analysis tools like Text Optimizer, you can also ensure these summaries are semantically relevant to the topic: Now, let’s see how we can enhance that standard search snippet to let it stand out and attract more clicks. Rich snippets for content-based pages Rich snippets are search snippets enhanced with some additional details. Web publishers can control rich snippets by adding schema markup, so they are thus under website owners’ control. Here are the types of rich snippets that will work for content-based pages: FAQ page Your page doesn’t have to be FAQ to qualify for this rich snippet. All you need to do is answer two or more subsequent questions somewhere on that page to use the code. There are several Wordpress plugins — including this one — that help you code that section. HowTo schema The HowTo schema was introduced for the DIY niche as a way to feature snippets that include step-by-step instructions. These days, I see HowTo rich snippets implemented for just about any tutorial: Video schema More often than not, these rich snippets show up only on mobile devices, but they seem to be very common. A video rich snippet includes a video thumbnail: Video schema will help you ensure the rich snippet is indeed generated, although I’ve seen dozens of cases when Google creates a rich snippet once you simply embed a video on the page, no schema required. That being said, using the rich code won’t hurt, especially given there’s an easy video schema generator for you to create a code easily. Structured snippets Structured snippets are less popular than rich snippets, even though they are very common on search. Structured snippets import tabular data to formulate a more informative search snippet: All it takes to qualify for this type of a snippet is to create an HTML table. It is a good idea to use tables for summaries, feature comparisons, lists, etc. Image thumbnails Image thumbnails are very rare on desktop. Yet on mobile devices, images show up inside most search snippets: There’s no particular optimization tactic here, but there are best practices that may or may not help: Obviously, make sure there’s at least one image on your landing page (make it featured on Wordpress).Compress your image to make it load faster.Specify the thumbnail using the meta tag. Dates Google shows dates within a search snippet when they think this may be useful to a searcher. Obviously, dates may have a big impact on clicking patterns: Based on the research by Ignite Visibility, about half of searchers claim that dates in search snippets are either “important” or “very important” clickthrough factors. People may feel willing to click on a search snippet with a more recent date.They can scroll past an older date even when the page ranks on top. Google has clear guidelines as to how web publishers can keep those dates fresh: Don’t try to hide dates, because they are useful.When updating a piece, re-publish it on a new date only when you’ve basically rewritten it.(I.e., don’t redirect, better to update the old piece and change the publish date).Include an “Updated on” note on top of the article if you updated it (Google will pick up on that date).Using schema “datePublished” and “dateModified” is not required but will be helpful. Google will understand all of the following date formats: Published December 4, 2019Posted Dec 4, 2020Last updated: Dec 14, 2018Updated Dec 14, 2021 8pm ET Mini sitelinks Mini sitelinks are probably the most unpredictable element of a search snippet. Google may randomly pick links from navigation, tag, or category links, etc. There’s also no way to tell Google they made a poor choice. Unlike sitelinks, which usually show up for the top-ranking result and mostly for branded searches, mini sitelinks can be generated for just about any result out there. Mini sitelinks represent a very useful feature, though, because they increase your odds that your search snippet will get a click (by adding more clickable links to your snippet). One way to increase your chances that Google will show mini sitelinks within your search snippet is to use an on-page table of contents (which is powered by HTML anchor links). Here’s an example of the table of contents: And here are the mini sitelinks they generate: Featured snippets As of January 2020, featured snippets were officially considered the #1 organic result (previously they were “position zero” — appearing before the top organic result). It still remains a big question whether they get clicked more than “normal looking” search results, or whether they are comprehensive enough to get fewer clicks. However, recent research suggests they’re still important for SEO. With that being said, featured snippets are not easy to predict, but if you choose to optimize for them, be sure to check my older Moz column that is still very valid: How to Optimize for Featured Snippets. Just don’t forget to monitor your clickthrough to ensure getting featured didn’t hurt. Indented results Showing intended results is a relatively new trend. So far it is not clear how exactly to get that type of search snippet, but you can track them in tools like STAT. Complementing your product page with how-to content on the same topic may be a good idea (Google may decide to rank both as indented results). At least this is something to experiment with. Monitoring and measuring While rank monitoring is pretty straightforward, this kind of optimization is harder to monitor because your rankings remain the same. Here are two tools you can use: 1. Google Search Console Google Search Console provides clear clickthrough data that can help you signal of positive or negative impact of your optimization efforts: In the Performance tab, click in the date range filter (it usually defaults to three months), go to “Compare” tab and select “Compare last 3 months year over year”: From there, you can click to “Pages” or “Queries” tab to identify pages or search queries that have lost organic traffic from the past year (especially if there was no substantial position change): 2. WebCEO WebCEO provides a more convenient way to keep an eye on your keywords that are losing clicks. The tool has a separate tag and a notification system alerting you of any queries that see a decline in clicks: 3. Visualping Another useful tool here is Visualping that you can set to monitor your exact search snippet to be alerted when it changes: This is a great way to correlate your optimization with the actual change that happened (and then clickthrough change). Using SiteChecker’s website monitoring tool you can also monitor your competitors’ pages and correlate their edits to an improved search snippet: Conclusion Whether it is good or bad news, organic traffic is no longer about rankings. In fact, you may well be ranking #1 (i.e. get featured) and notice a decrease in clickthrough once your page is promoted. But, you can experiment with all kinds of ways to improve your organic clickthrough without investing more into your rankings, even though organic CTR is much harder to predict these days. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Improve Organic Clickthrough for Your Content"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Improve Organic Clickthrough for Your Content"
    },
    {
      "level": "H2",
      "text": "The anatomy of a standard search snippet"
    },
    {
      "level": "H3",
      "text": "Logo"
    },
    {
      "level": "H3",
      "text": "URL path"
    },
    {
      "level": "H3",
      "text": "Title"
    },
    {
      "level": "H3",
      "text": "Description"
    },
    {
      "level": "H2",
      "text": "Rich snippets for content-based pages"
    },
    {
      "level": "H3",
      "text": "FAQ page"
    },
    {
      "level": "H3",
      "text": "HowTo schema"
    },
    {
      "level": "H3",
      "text": "Video schema"
    },
    {
      "level": "H2",
      "text": "Structured snippets"
    },
    {
      "level": "H2",
      "text": "Image thumbnails"
    },
    {
      "level": "H2",
      "text": "Dates"
    },
    {
      "level": "H2",
      "text": "Mini sitelinks"
    },
    {
      "level": "H2",
      "text": "Featured snippets"
    },
    {
      "level": "H2",
      "text": "Indented results"
    },
    {
      "level": "H2",
      "text": "Monitoring and measuring"
    },
    {
      "level": "H3",
      "text": "1. Google Search Console"
    },
    {
      "level": "H3",
      "text": "2. WebCEO"
    },
    {
      "level": "H3",
      "text": "3. Visualping"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    }
  ],
  "author": "Ann Smarty\n          \n            Ann Smarty\n          \n            Ann Smarty"
}