{
  "url": "https://moz.com/blog/in-moderation-strategies-for-building-and-managing-online-communities",
  "slug": "in-moderation-strategies-for-building-and-managing-online-communities",
  "title": "In Moderation: Strategies for Building and Managing Online Communities - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "While I've only been involved in web development and SEO for three years, I've been participating in online communities since 2001.  Over the last six years, it's been my privilege to help build and moderate a few online communities.  I've learned a lot about the way people think and behave online…",
  "content": "In Moderation: Strategies for Building and Managing Online Communities Social Media K By: Kat French September 14, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! K By: Kat French September 14, 2007 In Moderation: Strategies for Building and Managing Online Communities Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. While I've only been involved in web development and SEO for three years, I've been participating in online communities since 2001. Over the last six years, it's been my privilege to help build and moderate a few online communities. I've learned a lot about the way people think and behave online and picked up a few helpful bits of information--and fortunately, I like sharing. Picking a Platform Which community platform you choose depends on the overall goals for the community. Also, picking a platform isn't strictly about a software decision--it's also a publishing format decision. Here at SEOmoz, they've chosen to build a community around a group blog publishing format, rather than a moderated forum publishing format. There are a variety of reasons for choosing a particular publishing format. A group blog format suggests \"articles\" and value-added content moreso than a forum, and in a professional development community, that is an appropriate format. However, obviously examples like highrankings.com and other search engine forums demonstrate that a moderated forum format can work as well. It all depends on the kind of community you want to attract and build. From a software perspective, there are certainly more options available now than there were a few years ago when I first started getting involved in online community building. There are hosted solutions, such as Ning and CollectiveX, that are designed to build communities with a fairly rich feature set. Wordpress and other blogging solutions now come installed with different user permission levels, making using them for a more community-oriented site possible and practical. There are still, of course, the old standby of forum software, PHPBB. Formerly known as the software of choice for fanboy forums, and plagued with frequent script-kiddy attacks that exploited the holes in its security, PHPBB is currently a much more stable and secure application than it once was, but administrators still need to make sure they frequently update their security patches. There are also newer entries in the forum software arena that offer better design options than PHPBB, such as Lussumo's Vanilla and Simple Machine's forum software. Creating Personality Successful online communities are like offline neighborhoods--they have a distinctive personality and flavor. One of the challenges of building an online community from scratch is attracting a core of members who will build the kind of community that you envisioned. Many times, new online communities form similarly to the offline world--from affinity groups formed within larger, older communities. An example would be a new company founded by a small group of work buddies at a larger company, or small churches, clubs and other organizations springing from larger ones. These new communities often retain some of the personality of the original group, but grow in a new and different direction. Which brings us to another topic: allowing the community to grow and develop organically. Over-moderation can kill an otherwise successful community site. Don't be afraid to seed topics and prune members and topics judiciously, but be aware that you'll need to give up a certain measure of control and allow the community to take its own shape to an extent, even if that shape isn't exactly what you first had in mind. Guiding the development of the community personality should be like Mr. Miyagi and his bonsai trees: part conscious design, and part letting the natural shape express itself. Protecting the Community Unfortunately, we don't live in a world full of rainbows, unicorns and glitter. Hic sunt dracones, online as offline--in fact moreso since the appearance of anonymity on the internet often brings out the worst in people (see: Kathy Sierra). If you're going to be in the business of building and managing online communities, you have a responsibility to be the sheriff, protecting your community from predators. People need to feel safe and comfortable for your community to grow well. This is one of the reasons that it's important to delegate the responsibility for moderating and administering the community. When you choose a strong team of trusted moderators and editors, the odds of a situation getting out of hand decrease dramatically. Another thing that helps is being clear and explicit about the rules for participation, and enforcing those rules consistently across the board. Give a good deal of thought about the permissions that you will give to new members, and the conditions that need to be met to earn increased permissions. If you wanted to go above and beyond in preparing to protect your community (and you should), you might read The Sociopath Next Door by Martha Stout or The Gift of Fear by Gavin de Becker, which both offer good, easily accessible information on identifying predatory personalities that can easily be translated to the online environment. The biggest tip I can give in this regard is to listen to your gut. I once moderated two topically-related communities, one of which was women-only. A big part of what made that community successful was the sense of freedom that came from an all-female forum. I had a weird vibe from one member of the mixed-gender forum, and suddenly his \"fiancee\" started posting on the women-only board. The guy was a fairly longstanding and well-liked member of the other forum, but there was something \"off\" about the posts from his fiancee in the women's community. Sure enough, when I checked the IP addresses, an unmistakable pattern immerged: \"John\" was definitely posting as \"Jane.\" As unpleasant as it was when I had to \"bust\" a popular member and inform the women that a man had been posting as his significant other, it could have been much worse had I not listened to my gut. As social media becomes a more and more important part of the online marketing mix, learning how to build and grow thriving online communities will continue to be a valuable skill. It's a complicated skillset that requires both a little technical savvy and a LOT of people-smarts. But for the right people, it's an extremely rewarding pursuit, whether done in personal, business, or mixed-use applications. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "In Moderation:  Strategies for Building and Managing Online Communities"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "In Moderation:  Strategies for Building and Managing Online Communities"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kat French\n          \n            Kat French"
}