{
  "url": "https://moz.com/blog/in-the-summertime-when-the-weather-is-hot",
  "slug": "in-the-summertime-when-the-weather-is-hot",
  "title": "In the Summertime, When the Weather is Hot... - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The lazy days of summer crawl in North America & Europe, creating a bevvy of webmasters who fret and furrow their brows, wondering where the traffic has gone. This \"summer slump\" is an observable phenomenon every year in industries of all types as workers in t...",
  "content": "In the Summertime, When the Weather is Hot... Public Relations By: Rand Fishkin August 3, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 3, 2005 In the Summertime, When the Weather is Hot... Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The lazy days of summer crawl in North America & Europe, creating a bevvy of webmasters who fret and furrow their brows, wondering where the traffic has gone. This \"summer slump\" is an observable phenomenon every year in industries of all types as workers in the US, Canada, Europe and much of Asia take extra-long lunch breaks, leave work early and take vacations in droves. Several threads are ongoing on the subject, including a good one that's been featured at Sitepoint. Member KLB goes so far as to post traffic stats from the slump of June & July, though he notes that things should pick up almost immediately after the labor day holiday here in the US (early September). To contribute my own findings, see the traffic for SEOmoz, which has gotten increasingly noticed and popular over the last 3 months in the SEO/M community, yet has scarcely the traffic levels it did in April & May thanks to the sumer slump. While I'm waiting for business to pick up again, I'm doing three things related to SEO/M: Testing ads - It's a great time to put your foot in the water with big traffic terms and see how your performance goes without worrying about paying too much. Building natural links - Bloggers, it seems, don't go on vacation and they also seem to have less to post about - a great time to take advantage of slow news days and get some good links to your site Updating Sites & Content - Since folks are away, they'll be less complaining if you take a site or page down for some maintenance or fixing up. I'm also doind a lot of outdoors stuff - running around Seattle's Greenlake (3.1 miles), hiking on Whidbey Island's Deception Pass State Park and after SES San Jose, taking an overnight trip into the north cascades for some hiking on Ptarmigan Ridge in the Mt. Baker Wilderness & Mt. Rainier (pictured). It's my favorite combination - summer and snow... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "In the Summertime, When the Weather is Hot..."
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "In the Summertime, When the Weather is Hot..."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}