{
  "url": "https://moz.com/blog/inbound-marketing-is-taking-off",
  "slug": "inbound-marketing-is-taking-off",
  "title": "Inbound Marketing Attracts Millions from Google, Salesforce and Sequoia - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Today, Google Ventures, Sequoia Capital and Salesforce.com made a massive investment - $32 million - into Hubspot, the company at the forefront of the Inbound Marketing movement. Hubspot's had impressive growth, reaching more than 4,000 customers in their 4 years on the market. The founders, Brian…",
  "content": "Inbound Marketing Attracts Millions from Google, Salesforce and Sequoia Public Relations By: Rand Fishkin March 8, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 8, 2011 Inbound Marketing Attracts Millions from Google, Salesforce and Sequoia Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Today, Google Ventures, Sequoia Capital and Salesforce.com made a massive investment - $32 million - into Hubspot, the company at the forefront of the Inbound Marketing movement. Hubspot's had impressive growth, reaching more than 4,000 customers in their 4 years on the market. The founders, Brian + Dharmesh, authored an NYTimes best-seller on Inbound Marketing, and the Grader series of tools have been used by millions.To see these three investors, particularly Google Ventures, put a big backing behind the power of SEO, social media and content marketing (the three cornerstones of Inbound Marketing) is inspiring. It suggests to me that we're moving beyond the era of these marketing practices existing only for early adopters toward a more mature market. That's a great thing for practitioners as it typically means many years of growth, employment, higher salaries and increasing adoption. It also, however, portends greater competition.What's Inbound Marketing?In case you're not familiar, here's a diagram illustrating the techniques that fit the Inbound Marketing paradigm:Traditional marketing, and probably what Fred Wilson was talking about when he called out \"marketing\" as a poor investment is what we'd call \"outbound.\" It relies on advertising, paid branding, salespeople, cold-calling, etc. Inbound marketing is what nearly everyone who reads this blog practices - it's about getting traffic from search engines, from content (blog posts, articles, videos, infographics, white papers and webinars) and from social media (Twitter, Facebook, the Blogosphere, forums and social news sites).Why are Google, Salesforce + Sequoia putting money into this field?Because \"Inbound Marketing\" is for real. Both Salesforce's CRM and Google (via a million sources) both have a ton of data about what drives traffic and conversions on the web, and I think both are seeing the signs all pointing to Inbound Marketing. Hubspot is the most natural choice, as very few companies at scale are reaching their numbers or penetration. I have one, quick bone to pick with the upper-right-hand chart - the competitors chosen; Eloqua, Marketo, Genius, Pardot, Manticore, Neolane, etc. are all in the marketing automation, lead tracking or lead nurturing fields, which isn't really the space in which Hubspot's playing. Their product may have some overlap with these, but none of the other companies listed are philosophically into \"inbound marketing,\" they're into helping customers track leads, however they come. Hubspot's trumpeting the power of these newer traffic sources and focusing their software on measuring and improving them.I'd say that a more accurate market players list would include firms like PostRank, Klout, Compendium, Optify, Buddy Media, Hootsuite and, possibly, SEOmoz. The features don't match up, but the goal - to measure and improve inbound channels from search, social + content marketing - strikes me as more accurate.Can Google Invest in SEO Software?I wouldn't be surprised to see comments on some of the tech industry publications decrying an investment by Google in a software firm that helps sites rank better. However, I think this investment is about something much broader than climbing the rankings - it's about recognizing a shift in consumer and business buying behavior and wanting to play a part in that market.Salesforce is actually an excellent corollary and a smart choice as an investor. They disrupted the marketing software world the first time, when businesses switched from guessing about how to track+optimize a funnel to implementing software that made it work. Today, the CRM (Customer Relations Management) software field remains dominated by Salesforce (though up-and-comer Infusionsoft and traditional competitors like SAP, Inuit and Act all have nice chunks).There's a lot of parallels between what Salesforce did in CRM and what Hubspot is trying to do in marketing. The cognitive leap between traditional measurement analytics and true recommendations is precisely what Hubspot wants to fill. To use the words of Google's own Avinash Kaushik \"Google Analytics (is) mostly a glorified data puker.\"How's HubSpot Doing?As the graphic above shows, not too shabby. I asked Dharmesh to share some additional data and he was able to provide some interesting data points: Neither Hubspot, nor their clients saw any impact from the recent Google Farmer Update Twitter is their #1 social media traffic source, but LinkedIn sends the best-converting traffic Facebook is #2, but in recent months, has occasionally eclipsed Twitter in traffic sent Organic search sent 67,000 visits in FebruaryAnd a chart showing that they're drinking their own Kool Aid (getting traffic primarily from Inbound Marketing): _Note: This chart shows Hubspot's Blog traffic only Are there Other Signals Inbound Marketing is Growing?Here's some data from Google Insights: And here's a chart from SimplyHired showing the trend of \"inbound marketing\" being included in job postings: Inbound Marketing trends Inbound Marketing jobs You can see from LinkedIn that Inbound Marketing job titles and open positions are substantive. Basically, I'm drawing the conclusion that this meme has legs.My view is that it's a good day for Hubspot (who's now raised $65 million!) and a good day for all of us in the Inbound Marketing ecosystem. Next time someone asks you whether all this SEO, social media + blogging stuff is for real, you can tell them it's real enough that Google Ventures, Salesforce and Sequoia put $32 million of their own investment dollars behind it. _ Chart via Geoffrey Moore's Crossing the ChasmJust watch out - as we pass into the early majority with Inbound Marketing, the competition's going to heat up and a lot more marketers are likely to find themselves backed by good software.p.s. Dharmesh wrote a great post at OnStartups about how they're going to use the funding, why they raised, etc. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Inbound Marketing Attracts Millions from Google, Salesforce and Sequoia"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Inbound Marketing Attracts Millions from Google, Salesforce and Sequoia"
    },
    {
      "level": "H2",
      "text": "What's Inbound Marketing?"
    },
    {
      "level": "H2",
      "text": "Why are Google, Salesforce + Sequoia putting money into this field?"
    },
    {
      "level": "H2",
      "text": "Can Google Invest in SEO Software?"
    },
    {
      "level": "H2",
      "text": "How's HubSpot Doing?"
    },
    {
      "level": "H2",
      "text": "Are there Other Signals Inbound Marketing is Growing?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}