{
  "url": "https://moz.com/blog/inclusivity-drives-link-diversity-whiteboard-friday",
  "slug": "inclusivity-drives-link-diversity-whiteboard-friday",
  "title": "How Inclusivity Drives Link Diversity — Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Inclusivity makes business sense. Discover how targeting diverse audiences can enhance your backlink profile, boost trust with Google, and ultimately drive revenue.",
  "content": "How Inclusivity Drives Link Diversity — Whiteboard Friday Link Building | Search Engines By: Isa Lavahun Edited By: Emilie Martin March 22, 2024 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Isa Lavahun Edited By: Emilie Martin March 22, 2024 How Inclusivity Drives Link Diversity — Whiteboard Friday Link Building | Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Inclusivity makes business sense. Discover how targeting diverse audiences can enhance your backlink profile, boost trust with Google, and ultimately drive revenue. Click on the whiteboard image above to open a high-resolution version in a new tab! Hi, I'm Isa Lavahun. I'm a search strategist. And today I'm going to talk to you about how inclusivity drives link diversity. So obviously, inclusive marketing, we've heard a lot about it over the last few years. It's a topic becoming more and more popular and is obviously a great thing from an ethical point of view, and from an inclusive point of view. But actually, inclusive marketing also makes business sense, and it makes business sense because it's audience-centric. It's relatable. It widens reach, so you get to reach more audiences than you would normally. It's personalized. And all those things lead to it driving more revenue. So inclusive marketing, it makes business sense. Inclusivity in search So how do we then take this on board when it comes to search? So, first of all, from a Google point of view, Google serves all audiences. Of course, it does. That's its business model. When you come on the brand side, whether you are on the agency side or you work in-house, we have a thing where we focus on a target audience as we should. And when we do sort of target audience stuff, we have our core audience at the top. Then, we have our secondary audience that we prioritize. Then, on the C-level, we have audiences that dip in and out, that we kind of cater to or sort of engage with on a seasonal basis or when a certain product or service has come out. But then what I'm going to really talk to you about today is sort of the other audience. Who are we missing? Who could we potentially be reaching out to that we're not thinking about, that isn't front of mind? Backlink profiles Let's talk about backlink profiles. It's a huge thing that we talk about in the SEO world and link building world. So, say you are a hotel in Bali, and that's your website, and we're looking at your backlink profile. Say you've got links from BBC, a wedding blog, and a luxury travel like Condé Nast. You've also got a surfers' journal. You've got a solo traveling website, and then you've got a cooking website. What is this all telling you? This is all telling you that different audiences with different kinds of aims are linking to you and vouching for you, i.e., diverse audiences. This is what gets you that wide range of referring domains, which is what we know Google loves. All these things are telling Google that you can be trusted as a brand because you've got all these different audiences who want and need different things linking to and recommending you, which kind of goes to talking about why a diverse backlink profile is important. It tells Google who your audiences are and how different they are. That sort of indicates trust and authority. If you think about going on a review site and you've got different people reviewing a hotel or reviewing a product, and you can see their different personas and different audiences, you're more likely to sort of trust that product because you can see different people vouching for it. It kind of makes you think, oh, right, if all these different people are sort of saying go for this brand, I'm actually more likely to trust them. That is the same as having that sort of wide-ranging referring domain. It also represents broad reach. Obviously, the more kinds of links you have from different referring domains, the broader your reach is and the bigger your audience is. And finally, it obviously appears more natural and organic. At the end of the day, if you're kind of just getting links from that one source and that one website or that one kind of type of website, once you've got that link, it's not then telling Google anything different about what you have to offer and what your USP is. Hence why, referring domains are so, so important. So, let's go through a couple of examples of how we can really think about this and put it into practice. Example 1: Restaurant in London So let's say you are a restaurant in London. From a sort of outreach, link-building campaign, you would obviously think about these sorts of audiences, like a food blog, a travel website, maybe a dating blog, giving advice on where to go in London. But what about something like a mobility lifestyle blog? Let's say this restaurant is accessible, wheelchair-friendly, all this sort of stuff. Why isn't that kind of mentioned? Why isn't that pushed? Why isn't this restaurant going out to that audience and saying, \"Hey, look, this is what we do,\" because threefold, you're getting a link from that website, you're reaching out to that audience saying that we cater for, or we have an offering for you. From a brand perspective, you're also building a brand within that audience by saying, \"Actually, we're also for you as well.\" So it kind of works all around. So that's what I mean by who's missing. That mobility lifestyle blog is someone who's potentially missing that we're not thinking about initially, but we should be. Example 2: Company selling fitness equipment Then let's say you are a company that sells fitness equipment. And obviously, when you think fitness equipment, you know who your core audiences are, for example, personal trainers, small gyms, and, of course, fitness enthusiasts. But when you go, and you do a bit of search insight, and you kind of do a bit of keyword insight, you see, actually, there's a lot more different audiences looking for that product and looking for that kind of key term. So, when you think fitness equipment, there's fitness equipment for the elderly, fitness equipment for wheelchair users, Parkinson's patients, pregnancy, physiotherapy. Again, all the kinds of missing audiences that we're not thinking about when we're thinking about outreach, marketing, and branding that we should be thinking about. And obviously, you can't cater to everyone all the time, understandably so. But it's also thinking from a strategic point of view how you can create some content offerings to these audiences that align with your brand and is possible. So that could be a blog post, a content piece, a how-to guide, a video, or a potential outreach campaign during an awareness week or an awareness month, let's say. It's thinking about it from that sort of point of view to make sure that there are touchpoints with these audiences that you might be missing out on and not really thinking about as part of your core strategy. Key takeaways So, what are the key takeaways, and how do you put this into practice and get going into having more of an inclusive link-building strategy? Update your personas I'd say update your personas. So we as marketers all have our personas, our key audiences. We get them worked out, and we do that on a regular basis. Always think about this audience; who's missing? Who are we not thinking about? Who are we not catering to? Who could we be reaching out to that we're not currently that kind of makes sense and aligns with our brand and our business? Talk to different archetypes Then I'd say, really try to discuss your campaign ideas and your strategy with different archetypes, i.e., people who are different from you. So, if you're a millennial, you might want to talk to Gen Z about a campaign idea to see if that kind of fits in with them. Perhaps talk about an idea with your parents or grandparents or kids. It's really good to think about how different audiences might receive a certain product, campaign, or offering that you might be missing because you are not that audience. So, talking to different archetypes helps you update and amend ideas to make them more accessible and inclusive. Look at trending topics Then, another one is jumping on trending topics and news to find new audiences. There are always new topics, new trending topics where you could find out what the new problem is. And if there's a new problem you can answer or cater to, that's another way of reaching out to new audiences that you might not have thought about but are actually there waiting for you to cater to. Don't just tick a box And then I'd say the last two reasons would be to not just tick a box. Don't just make a list like, \"Okay, we've got to do an inclusive campaign,\" tick box. Make it part of your key strategy. At the end of the day, this audience isn't just a kind of standalone audience. They're part of your strategy and need to align with you, your brand, and your offering. You just need to think about who they are and how you should be reaching out to them in an authentic, organic way. Be authentic Which leads me to my final point, which is to be authentic with it. Do it where it's at the core of your business, the core of your service, the core of your product, and your offering, and again, back to what I was saying in the beginning, it makes business sense. Thank you for joining me on this Whiteboard Friday. My name is Isa. I'm a search strategist. If you want to talk to me about anything to do with PR, link building, outreach, or all things search, you can connect with me on LinkedIn, Twitter, or my website. Transcription by Speechpad Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Inclusivity Drives Link Diversity — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Inclusivity Drives Link Diversity — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Inclusivity in search"
    },
    {
      "level": "H2",
      "text": "Backlink profiles"
    },
    {
      "level": "H3",
      "text": "Example 1: Restaurant in London"
    },
    {
      "level": "H3",
      "text": "Example 2: Company selling fitness equipment"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H3",
      "text": "Update your personas"
    },
    {
      "level": "H3",
      "text": "Talk to different archetypes"
    },
    {
      "level": "H3",
      "text": "Look at trending topics"
    },
    {
      "level": "H3",
      "text": "Don't just tick a box"
    },
    {
      "level": "H3",
      "text": "Be authentic"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    }
  ],
  "author": "Isa Lavahun\n          \n            Isa Lavahun\n          \n            Isa Lavahun"
}