{
  "url": "https://moz.com/blog/increase-client-leads-case-study",
  "slug": "increase-client-leads-case-study",
  "title": "How We Increased Our Client’s Leads by 751% on Less Than £1K Per Month [Case Study] - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The team at Tao Digital Marketing breaks down how they were able to go above and beyond for their client, Fleetcover, using four strategies that increased leads by 751%, keywords by 259%, and impressions by 535% — all with a small SEO budget.",
  "content": "How We Increased Our Client’s Leads by 751% on Less Than £1K Per Month [Case Study] Advanced SEO | Technical SEO | On-page SEO By: Lydia German January 27, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Lydia German January 27, 2021 How We Increased Our Client’s Leads by 751% on Less Than £1K Per Month [Case Study] Advanced SEO | Technical SEO | On-page SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. It’s a common misunderstanding that working with a small budget for SEO means you can’t generate results. How can you possibly make enough improvements to the site in so few hours per month? Well, for us at Tao Digital Marketing, our work with Fleetcover goes to show that results can be achieved by focusing on the most important changes in the little time you have. In this case study, we’ll break down how we increased leads by 751%, keywords by 259% and impressions by 535% on a budget of less than £1,000 / $1,347 per month, equating to one day’s work. That’s a small spend for SEO, but making the right changes at the right time, and focusing our efforts on the most important aspects, generated these positive results. Objectives Our objectives were similar to what every website ultimately wants to achieve: generate leads for the business and increase online visibility for relevant search terms. To be a little more specific, we picked this client up in March 2019, but of course, results generally started to pick up from November 2019 as Google started to crawl the site more regularly. Our targets/KPIs for the next 12 months were based on numbers from April-November 2019, as below: Increase leads from 175 to 500Install a new chat function on the site and gain 50 leads through itIncrease site clicks from 2,200 to 5,000Increase keywords ranked for from 229 to 500 The target audience was businesses that need fleet insurance. This spans a wide range of industries, from those operating coaches and taxis through to motor trade. Our strategy focused on technical SEO and content creation. There was one big issue, though: we didn’t build the site ourselves, nor did we have the level of access that would allow us to make any design or fundamental changes that could support SEO and lead generation. In turn, our strategy had to be heavily content-driven. Our strategy 1. Add a chat function In November 2019, we added the ‘TawkTo’ chat function to the site which has helped generate leads. After analyzing when their audience was visiting the website, we found that most users were on the site late at night and on weekends. With their team being out of the office and unable to answer any phone calls during these timeframes, we thought it would be of value to offer an online chat function to help capture inquiries so potential customers wouldn’t be put off or frustrated! This would put them at an advantage compared to their competitors who were not doing this. We implemented the bot so it appears on the tab as a message notification, drawing people’s attention to the page even when it isn’t the active tab. So far, 330 inquiries have been made through this function. Fleetcover Chat Bot 2. Implement technical SEO Tweaks that support technical SEO are perhaps some of the most important changes you can make to see real results. We implemented this by: Optimizing page titlesCreating meta descriptions that were between 100-155 characters, using keywords that naturally fitUsing the optimal image sizes that each website requiredUsing alt text for images Implementing internal and external links where possibleUtilizing FAQ schema on the more frequently searched questionsOptimizing the sitemap by getting rid of URLs that wouldn't support organic searchUsing the robots.txt file to point search crawlers in the right directionCreating 301 redirects. There were a number of outdated pages as well as 404 errors that needed to be addressedMaking usability tweaks to the design. We were very limited in what we could achieve on the site as the incumbent were not massively helpful in terms of the access they would give us. We were able to get round this in certain areas, an example being the ‘Get a Quote’ buttons. We had a feeling user metrics mattered in this competitive market, so we did our utmost to capitalise on this. 3. Optimize the “Get a Quote” form We added heat mapping and anonymized visitor recording to the site. When we analyzed the data, it became very apparent that many people weren’t filling out the “Get a Quote'' form due to it being too long — like standing at the bottom of a mountain, trying to work out the right route to the top! The original form had almost 10 questions, which overwhelmed the user and resulted in low conversion rates. Step one of Fleetcover Quote form Step two of Fleetcover Quote form We’ve had great success using multi-step forms on other client’s sites, so we decided to create one for Fleetcover. We had all the questions needed to provide a full quotation, but split it all up into easier-to-digest tabs and user-designed icons, rather than just text. Our new form was built creatively and had four steps, making the process easier. With this change alone, leads from the form grew from 175 before November 2019 to 1,489 over the past 12 months (751% increase). 4. Focus heavily on content creation Example of Fleetcover service page (HGV fleet insurance) Service pages Content creation is an area where we really got the chance to demonstrate creative flair alongside data analysis. We started by reviewing Fleetcover’s service pages, and fleshed out the content to make it more engaging. Example of Fleetcover service page (FAQs) Keyword research and search intent Over time, we continued to research keywords, focusing heavily on understanding the search intent behind them, and creating detailed content and FAQs to meet the audience’s needs and Google's understanding of those intents. One topic we’ve been focusing on is the rise of electric vehicles and how this will grow and affect the insurance industry. As the development and popularity of these vehicles progresses, we’re going to look at how we can use this in our content strategy. Formatting and style Including clear, natural CTAs at the end of each piece was really important, not only to round out the articles, but also to encourage readers to use Fleetcover’s broker service. See an example from our piece about business car insurance below. In addition, utilizing a simple but effective tone of voice helped to meet the needs of potential consumers and give them the information they need in a straightforward way. When focusing on keywords/phrases that contain industry jargon, we always include information about what the word or phrase means for those with informational intent about a particular topic, for example ‘fleet breakdown cover’. Results Sales We achieved the goal of gaining more sales, as website conversion rates jumped from 3% to 14%, and leads increased from 175 to 1,489 (751%). This massive increase (pleasantly) surprised us as we are working with a site with a domain authority of 22 in a competitive industry, so to achieve these results so quickly was a great boost for both ourselves and Fleetcover. Fleetcover was previously spending a considerable amount on purchasing leads from other companies, whereas now they have invested into SEO, which has significantly increased the number of leads they generate. With SEO, these leads are of a higher quality than PPC leads, and are therefore more likely to use their services. There is little need for Fleetcover to purchase leads now, as the business is becoming its own profitable arm of Walmsleys Insurance Brokers. Rankings We’ve helped Fleetcover gain online visibility for certain keywords such as “fleet insurance brokers” (#1) and “fleet insurance quote” (#2). Their positioning for “Fleet breakdown cover” has also moved from #15 to #4, and “fleet insurance quote” has moved from #10 to #2. The main benefit of these ranking improvements is the huge increase in traffic! We also gained top spot for the main keyword of “fleet insurance”, but this has since been taken by one of the juggernauts (excuse the pun) of the industry. We’ll be back, but for now, domain authority reigned supreme. In April 2019, Fleetcover was only ranking for 229 keywords, and they now rank for 824, a 259% increase. Traffic As mentioned, we saw results beginning in November as Google crawled the site more actively and found more relevant content. Therefore, April - November 2019 is our “before” comparison for what we’ve managed to achieve over the past 12 months: April - November 2019: Impressions: 296,000 Clicks: 2,220 November 2019 - November 2020: Impressions: 1,880,000 (up 322%) Clicks: 6,470 (up 194%) Thanks to more than exceeding our set KPI goals, we were shortlisted for three SEO awards this year, and Fleetcover’s CEO had only good things to say: “For years we’ve been looking for a company to do exactly what you have done and I can honestly say in 12 years of being involved in marketing, this is the first time that any marketing company has proactively gone ahead and done something for us in this way. I’ve whinged about it for so long that it made my day when it dropped in my inbox. Really chuffed.” Well, that just speaks for itself, doesn’t it? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How We Increased Our Client’s Leads by 751% on Less Than £1K Per Month [Case Study]"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How We Increased Our Client’s Leads by 751% on Less Than £1K Per Month [Case Study]"
    },
    {
      "level": "H2",
      "text": "Objectives"
    },
    {
      "level": "H2",
      "text": "Our strategy"
    },
    {
      "level": "H3",
      "text": "1. Add a chat function"
    },
    {
      "level": "H3",
      "text": "2. Implement technical SEO"
    },
    {
      "level": "H3",
      "text": "3. Optimize the “Get a Quote” form"
    },
    {
      "level": "H3",
      "text": "4. Focus heavily on content creation"
    },
    {
      "level": "H4",
      "text": "Service pages"
    },
    {
      "level": "H4",
      "text": "Keyword research and search intent"
    },
    {
      "level": "H4",
      "text": "Formatting and style"
    },
    {
      "level": "H2",
      "text": "Results"
    },
    {
      "level": "H3",
      "text": "Sales"
    },
    {
      "level": "H3",
      "text": "Rankings"
    },
    {
      "level": "H3",
      "text": "Traffic"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Lydia German\n          \n            Lydia German\n          \n            Lydia German"
}