{
  "url": "https://moz.com/blog/increase-landing-page-conversion-rates",
  "slug": "increase-landing-page-conversion-rates",
  "title": "Increase Landing Page Conversion Rates - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Driving traffic from PPC (pay-per-click) or email campaigns to your home page is a mistake.  You must deliver on the promise in your lead ad copy if you hope to convert traffic.  Dumping people on a home page and forcing them to navigate their way to what they want is a strategy for…",
  "content": "Increase Landing Page Conversion Rates Online Advertising By: adgeek April 16, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: adgeek April 16, 2007 Increase Landing Page Conversion Rates Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Driving traffic from PPC (pay-per-click) or email campaigns to your home page is a mistake. You must deliver on the promise in your lead ad copy if you hope to convert traffic. Dumping people on a home page and forcing them to navigate their way to what they want is a strategy for failure. Ideally, you should be driving your traffic to a landing page that focuses on conversion. This site should be independent of your main website, and its sole purpose should be converting traffic. A landing page is a single page focused on a single idea. The focus is the action you want the user to take. This action defines your conversion. A conversion could mean a purchase, an email address in a lead generation campaign, or some other clearly defined action. This article outlines a few guidelines to consider when designing a landing page, but there is no substitute for testing. If you can measure it, you can improve it. You can dramatically increase conversion rates through testing with the Google Website Optimizer. Layout Landing pages work best when designed as a single column. You should also ditch any navigation elements. The only choices a landing page should offer a user is to move forward through the conversion process or to leave. You want to keep momentum moving forward, and not have the eyes wandering all over the page. Multiple columns and navigation kill forward momentum. Other momentum killers are graphics and copy unrelated to the offer. Keep your critical elements above the fold. The visible elements that the user sees when landing are critical. Research shows you have 8 seconds to convince users to stay on your site. What they see must convince them they are in the right place and give them a reason to stay. Make sure your call to action is above the fold. Your call to action should repeat for each screen full of data that the user sees while scrolling down the page. Above the fold is also the best place for your hero shot, or product image. Images work best to the left of text. Headlines The headline may be the only thing a visitor reads before they leave. This makes the headline the single most important piece of copy on the page. It should be compelling and match the ad copy from the lead, whether the lead is a PPC ad, and email campaign, or a banner ad. Visitors must know in a glance that they have landed in the right place or they will bail. Most visitors will scan your entire site before deciding whether to read your copy. Design your landing page with scanners in mind. Do your headline and subheads tell your story? Try going through your copy and reading only the headlines and subheads to make sure they are compelling. Subheads should be included for every major information point. This serves to break up copy and makes reading look like less work. The copy written under each subhead should mirror the major points. Bullet points are essential for any lists. Don’t just string lists of information between commas in never ending paragraphs. Turn them into bullet point lists. Forms and Buttons Never ask for more information than you absolutely need. People are hesitant to give out personal information. Make sure the information you are requesting is relevant and tell the user why it is relevant. Having a visible privacy policy next to any form copy will also help. Whatever commitments to privacy you make you should be prepared to keep. Test your buttons. Experiment with graphical elements and with button copy. Make sure the copy is compelling. “Submit” is not compelling. Try “Buy it Now” or “Download White Paper.” Just as with link text, button copy should tell the user exactly what happens when they click it. Testing The Google Website Optimizer is a free and powerful tool that can measure the effects of different elements on its ability to convert. You should definitely use this tool. Testing is vital to know what elements work. Guesswork is not an option. Measure your page and tweak elements to increase conversion. Which Elements to Test The beauty of multivariate testing is that you can test multiple elements to see what works. But this doesn’t give you license to take a shotgun approach. Here are a few things that can have profound impact on conversions and should always be tested and tweaked: Headline Copy Calls to Action Caption Copy Button Copy Form Design and Length Graphical Elements Body Copy If you’ve done no prior testing I guarantee you that testing and tweaking these elements will at least double your conversions. Conclusion and Resources Web landing pages are probably the most critical element in the conversion funnel. Focus on tweaking and testing key copy and page elements. Match the lead copy and the landing page copy, and make a clear and compelling call to action. The two best resources I can suggest for landing page design are Marketing Sherpa’s Landing Page Handbook and Google’s Website Optimizer. The Landing Page Handbook is a bit pricey, but full of valuable information. The Website Optimizer is priceless and costs you nothing. Be sure and see my article on increasing conversion rates with the Google Website Optimizer for tips on landing page testing. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Increase Landing Page Conversion Rates"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Increase Landing Page Conversion Rates"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "adgeek\n          \n            adgeek"
}