{
  "url": "https://moz.com/blog/increasing-your-local-search-presence-through-regionalization",
  "slug": "increasing-your-local-search-presence-through-regionalization",
  "title": "Increasing Your Local Search Presence Through Regionalization - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As you venture through Natural Search Optimization, your primary goal is to expand the reach of your website to a global level. What happens when you have a client with specific geographic limitations though? If you or your client has a limited service area, then you should place a particular focus…",
  "content": "Increasing Your Local Search Presence Through Regionalization Local SEO B By: Bryce Bertola June 24, 2011 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! B By: Bryce Bertola June 24, 2011 Increasing Your Local Search Presence Through Regionalization Local SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. As you venture through Natural Search Optimization, your primary goal is to expand the reach of your website to a global level. What happens when you have a client with specific geographic limitations though? If you or your client has a limited service area, then you should place a particular focus on localizing your website. The following localization strategies will allow you to improve your local presence, and increase site traffic within your targeted geographic area. I. On-site Localization Strategies The easiest way to increase your regional presence is to provide location data across your website. If you provide complete, logical information regarding your place of business and your service areas, you are more likely to appear higher in location-specific searches. Provide Complete Location Data On Site An excellent rule to observe, for SEO best practices as well as a localized search strategy, is to include your complete business address on your contact information page. By making it easy for visitors to see your address, you are not only establishing credibility, but also allowing search engine spiders to discover that content. Adding your local phone number can also increase your local presence. In addition to your primary address, you may also wish to include a list of cities within your service area. Consider including city names in your customer testimonials, and if you dont have testimonials, try to dig some up. Additionally you could provide a list of your service area boundaries (\"Serving Utah from Layton to Springville\") or mention a few cities that you service within the content of your website. Regional Keywords And Relative Density Optimal density for most keywords is from 2 to 4%, however location based keywords are much less frequent in natural writing and must be used in moderation. When adding location based keywords, such as a city name, the optimal keyword density is around 1%, and never more than 2%. Any more than 2% and your writing starts to look unnatural, and becomes hard to follow. Inclusion Of Location Metadata While some search engines might ignore location-based meta tags, including them certainly will not damage your site's rankings on the web. You should include tags for city, state, country, zip code, street address, and phone number. Even though the major search engines might ignore these tags, other location based services crawling your site could discover this additional information and add it to their directories. II. Leveraging Google Location-Based Services Google offers excellent location based results that are visible to regular users as well as mobile visitors. By including your company information here, your are opening the door to a flood of previously unreachable visitors. Claiming Your Google Places Page Often times, the major search engines have already placed your business on the map, and provided their best guesses about what you do. In most cases this can be a great start but you can provide an even stronger impact if you claim and verify your business listing. Search for your business name along with your general location in Google, and it should display your company through Google places. By claiming your listing, you are then able to log in using your Google account and edit the company details. To ensure that only the official business owners can change the information, Google will send you a verification PIN number through the mail. Adding Appropriate Categories To Your Listing Once you've verified your local listing, you can create a detailed business profile to appear on Google places. You can edit the categories and specializations, as well as additional contact information and business hours. All of this information could be very useful to potential customers who might be interested in stopping by. One of the great features of Google places is that it is integrated with Google maps, a service used widely on mobile phones to provide navigation details. You are now able to present mobile visitors with your company address, phone number, and even give them driving directions, all from their mobile devices. Keeping Content Fresh Fresh content is accurate content, generally speaking, so when you have updated offers or frequently update your company profile, you gain additional credibility with Google and it can help increase your position in location-based searches. Google places allows you to offer short-term discounts or promotions for people that find you through local searches. Keeping offers fresh improves the users experience on Google , and can only mean an increase in your search result rankings. Revisit your Google places information at least once a month to determine how each category is performing, and then use that information to add new categories or get rid of under-performing categories. Additionally, perform a quick refresh every once in a while by editing and re-saving your information. Even if you don't have anything to change, it could help. III. Geographic Targeting in Paid Search Not everyone has the budget to spend hundreds of dollars on Google Ads, but if you do, there are some powerful targeting tools and localization strategies to increase the effectiveness of your local campaign. Location-Based Campaign Settings When setting up your location-based campaign, you need to already have a targeted geographic location in mind, Do you want to target a bundled region, such as the United States and Canada, or the 10 miles surrounding your tattoo parlor? Google offers a variety of targeting options, including targeting by country, state, or proximity to a specific zip code. You also have the option of excluding certain areas if you feel they wouldn't provide a good result. Targeting Regional Keywords In addition to your primary targeted keywords, you might also want to include some location based search queries. These typically have a low search volume, but the cost per click might be much higher depending on local competition. Try to include searches with city names, geographic references, or prominent landmarks (ex: \"wasatch front heating and air\" or \"bay area bicycle rentals\") Setting An Appropriate Schedule If your business only operates between the hours of 8 and 5, you might not want to run ads outside of those hours. Additionally if you aren't open on the weekends you might not want to display ads then. It's important to keep these factors in mind when you are setting up your paid ads, as they might make the difference in your overall conversion rates. IV. The Downside of a Localized Search Optimization Strategy There is one major downside to tracking the effectiveness of a localized search optimization strategy, many users aren't visiting you on the web, but in person. This makes it difficult to directly measure the effectiveness of your efforts in the short term, but you're sure to reap the long-term benefits of an effectively targeted marketing strategy. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Increasing Your Local Search Presence Through Regionalization"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Increasing Your Local Search Presence Through Regionalization"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Bryce Bertola\n          \n            Bryce Bertola\n          \n            Bryce Bertola"
}