{
  "url": "https://moz.com/blog/increasing-timeonpage-through-aesthetics-lessons-learned-from-prweb-and-buildzoom-two-large-content-sites",
  "slug": "increasing-timeonpage-through-aesthetics-lessons-learned-from-prweb-and-buildzoom-two-large-content-sites",
  "title": "Increasing Time-on-Page Through Aesthetics (Lessons Learned from PRWeb and BuildZoom - Two Large Content Sites) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In 2011, “quality” certainly seems to have become the soupe du jour. With the release of Panda, Google affirmed their stance that quality was something that could be algorithmically determined and the determination of quality would be a key factor in determining search rankings. Many (...",
  "content": "Increasing Time-on-Page Through Aesthetics (Lessons Learned from PRWeb and BuildZoom - Two Large Content Sites) On-page SEO J By: Jiyan Naghshineh Wei December 9, 2011 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! J By: Jiyan Naghshineh Wei December 9, 2011 Increasing Time-on-Page Through Aesthetics (Lessons Learned from PRWeb and BuildZoom - Two Large Content Sites) On-page SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. In 2011, “quality” certainly seems to have become the soupe du jour. With the release of Panda, Google affirmed their stance that quality was something that could be algorithmically determined and the determination of quality would be a key factor in determining search rankings. Many (including Rand) concluded that user experience had suddenly become a key variable in the SEO mix. At BuildZoom, we have taken the increasing importance of quality to heart and time-on-site has become one of the metrics that we examine on a daily basis. We interpret time-on-site as a proxy for the user’s judgment of the quality on our content and site. Through 2011, we have gained several insights from changes we've made that have had an impact on time-on-site, which we’d like to share with the community. A page from the old playbook As the former Director of product management for PRWeb, I learned first-hand how images could impact time-on-page. In April of 2010, I analyzed the difference between news releases with images and news releases without images on PRWeb. What I found was that news releases without images had an average time-on-page of 2:18 while news releases with images had an average time-on-page of 2:47. I presented these findings last Summer at the SNCR research symposium and blogged about them on the PRWeb blog. Based on some surveying I did of the journalists and bloggers who receive PRWeb news, I also was interested to see that nearly 90% of the journalists and bloggers reported that images favorably enhanced their experience of the news release. Applying the lesson to BuildZoom When we launched BuildZoom about a year ago, we used a variety of generic images to support businesses who did not have their own images to place on their profile. We quickly observed that the time-on-page for business profiles with user-submitted photos far outperformed the time-on-page of business profiles with generic images. In response, we applied stock photography on business profiles without images and saw a nice uptick in time-on-page of about 10%. The breakthrough In August of this year, we were at a point where we had amassed a relatively large collection of project photos from our users (we allow users to create and manage digital portfolios) so we decided to see what would happen if we made them more visible to site visitors. We added a widget to all of the pages throughout the site that let visitors easily browse examples of remodeling work in their area. The overall time-on-site suddenly increased by about 150%, from an average of 1 minute to 2.5 minutes per visitor (while pages-per-visit stayed consistent). After seeing the increase maintain for a few weeks, we decided to see what would happen if we removed the widget and the drop was instant. We generally concluded that by sharing content that was both highly contextual and visual, we were able to profoundly impact the engagement on the site. A picture is worth a thousand words so it’s important that those words are supportive More recently, we have been looking more carefully at how the quality of images can impact time-on-page. The preliminary results jive with some of the findings I observed at PRWeb: while good images can help boost time-on-page, bad images can have little or in some cases, negative impact on time-on-page. To help highlight high quality images, we have been editorially scoring each of the images that comes onto our site so that we can highlight high-quality images and push down low-quality images. Our preliminary findings support this general thesis and (cliff hanger alert) we’ll be sharing more detailed results in a future post. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Increasing Time-on-Page Through Aesthetics (Lessons Learned from PRWeb and BuildZoom - Two Large Content Sites)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Increasing Time-on-Page Through Aesthetics (Lessons Learned from PRWeb and BuildZoom - Two Large Content Sites)"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jiyan Naghshineh Wei\n          \n            Jiyan Naghshineh Wei"
}