{
  "url": "https://moz.com/blog/industry-numbers-seomoz-stats-the-new-york-social-media-event",
  "slug": "industry-numbers-seomoz-stats-the-new-york-social-media-event",
  "title": "Industry Numbers, SEOmoz Stats & the New York Social Media Event - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "So much to fit into one blog post (and technically, I'm still on vacation). Technically, this is three separate subjects, so I'll segment :)\nIndustry Numbers\nFor the outside investment we're seeking, I've had to dig around a bit for industry data to help predict the total number of people in the…",
  "content": "Industry Numbers, SEOmoz Stats & the New York Social Media Event SEO Events By: Rand Fishkin September 3, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 3, 2007 Industry Numbers, SEOmoz Stats & the New York Social Media Event SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. So much to fit into one blog post (and technically, I'm still on vacation). Technically, this is three separate subjects, so I'll segment :) Industry Numbers For the outside investment we're seeking, I've had to dig around a bit for industry data to help predict the total number of people in the world conducting search marketing professionally - here's what I've got: Members at major industry forums: SEOmoz has ~45,000 (non-premium) members Sitepoint has ~190,000 members DigitalPoint has ~88,000 members SEOChat has ~37,000 members SEW Forums has ~15,000 members Cre8asite Forums has ~12,000 members I estimate WebmasterWorld has ~6,000 paying members (someone smart emailed me with an estimate of 3,000) SEMPO has 500 members Conference attendees (these are all estimates or hearsay) SMX Seattle was filled to capacity ~1200 people SES San Jose 2007 had ~6000 people SES New York 2007 had ~5000 people SEMPDX (a smaller, local event) had ~500 people Pubcon Las Vegas 2006 had ~2000 people (my smart friend says ~2250) Industry data sources on search marketing expenditures/size: SEMPO estimated that $9.4 billion was on SEM in 2006 The following image from Metrics 2.0 provides a great aggregate of data: This next one, from MarketingSherpa, shows the percentage of spend on SEO vs. SEM for the last 3 years (warning PDF!) If you've got more industry data that you think is valuable, relevant or revealing, I'd love to list it here, so feel free to suggest it in the comments. SEOmoz Stats Since member Derek Dunne asked about where SEOmoz's visitors come from, I figured it would be a good time to provide an update to our last stats dump back in January. We're averaging around 10,000 visits per weekday, and 6-8000 on weekends Top referrers (in order) Direct access or bookmark http://www.google.com https://moz.com http://digg.com http://www.stumbleupon.com http://www.digg.com http://www.google.co.uk http://images.google.com http://del.icio.us http://search.yahoo.com http://www.lulu.com http://www.google.ca http://www.bloglines.com http://www.netvibes.com http://www.google.co.in http://www.google.com.au http://www.e-veryweb.com http://web-tan.forum.impressrd.jp http://forums.digitalpoint.com http://gigazine.net http://www.cssremix.com http://searchengineland.com Top countries of origin United States 44.67% United Kingdom 8.32% Canada 5.49% Germany 3.35% France 2.80% India 2.58% Australia 2.55% Spain 2.39% Italy 2.15% Japan 1.90% Netherlands 1.64% China 1.32% Brazil 1.22% Sweden 0.96% Romania 0.83% Turkey 0.81% First time vs. Returning Visits by Month (first number is first time, second is returning) January 126,477 | 76,145 February 217,357 | 92,567 March 187,203 | 96,214 April 180,790 | 99,494 May 205,438 | 110,347 June 162,244 | 92,360 July 165,652 | 97,622 August 163,195 | 100,100 We're still planning to do our usual end-of-year wrap up with even more complete data :) SMX Social Media in New York City We're pretty excited about this one, and since there's only a few days left to register at the early bird rate, I'd highly urge folks to run over to SEL, read the 9 reasons why you should go, and get booking. Social media marketing & linkbaiting are critical components of search marketing, and if you want to hone your skills and network with some of the best in the business (there's only seats for 200 attendees), I highly recommend it. I'll be speaking there on a couple topics, and Rebecca may also be there (hopefully we'll hear back from Danny soon). Cool topics include specialized sessions on social news sites, social bookmarking & tagging, leveraging social networking & Wikipedia spamming, err... optimization. The full agenda's online, and the cost is $1,095 until September 7. I'll be back in Seattle tomorrow night, and should be returning emails, calls, etc. by Wednesday. p.s. If you ever find yourself in St. George, Utah, don't miss the Painted Pony restaurant - the prices are closer to Vegas, but the food was even better than the meal we had at Keller's Bouchon. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Industry Numbers, SEOmoz Stats & the New York Social Media Event"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Industry Numbers, SEOmoz Stats & the New York Social Media Event"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}