{
  "url": "https://moz.com/blog/influencing-social-awesomizers-with-personalized-content",
  "slug": "influencing-social-awesomizers-with-personalized-content",
  "title": "Influencing Social Awesomizers with Personalized Content - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Earning a mention by a social \"awesomizer,\" someone with with hordes of followers and a powerful voice in their industry, can boost even the most niche business to the forefront of social buzz. Our recent experiment shows you how.",
  "content": "Influencing Social Awesomizers with Personalized Content Social Media By: Jon Morris July 23, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jon Morris July 23, 2013 Influencing Social Awesomizers with Personalized Content Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Since the birth of social media, brands have been searching for an effective way to leverage the power of influencers — those social \"awesomizers\" who have a significant following and a powerful voice in their respective industries. Obtaining a mere mention by the right influencer could boost even the most niche business to the forefront of social buzz. But how do you determine who to target? How do you enchant them and convert them into a brand advocate? Read on to learn about the steps we took at Rise Interactive in developing and integrating personalized content into a digital marketing strategy, and the significant impact it had in elevating Rise's digital presence. Step 1: Identify your awesomizer The first thing you need to do is identify your social media awesomizer — someone with a significant social following and powerful voice in their industry. Rise Interactive hosts routine digital marketing conferences where we bring together some of the brightest minds in the industry in our Internet Marketing Leadership Series (IMLS). At our first event, Travis Wright, global social media manager at Symantec and self-professed digital disrupter and marketing provocateur, gave a riveting (and hilarious) presentation about the power of social media. An avid Kansas City Chiefs fan, Travis described his experience sparring with the Chiefs through social media. It all started with the below tweet, which created an unexpected but powerful ripple effect, due in large part to Travis's broad social media following (more than 129,000 Twitter followers when he spoke at IMLS). Soon after this tweet was sent, @kcchiefs rudely replied to Travis, igniting an explosive and ongoing social media feud. Travis's battle with the Chiefs was eventually picked up by Reddit, Yahoo, Mashable and more. We like to think that this negative press contributed to the Chiefs firing their general manager, Scott Pioli, although we know that it was most likely Kansas City's abysmal 2-14 record. Travis's story demonstrated the true power of social media and how he harnessed it to his advantage. He had a compelling story and a large group of followers, which allowed him to basically accomplish the impossible. It got us at Rise thinking; could a brand create noise for itself on social media just as Travis had done? It was time for an experiment. Key takeaway Having a direct relationship with a social influencer will definitely help get your foot in the door, but even if you don't have a personal connection with them, you can still court them. Find people in your industry that you respect, that are viewed as influential thought leaders, and that have a large group of followers. Start developing an online relationship with them — reach out to them and tell them how much you admired one of their blog posts, or reply to and share their posts. Be sincere and see where things lead. If you are able to establish a solid relationship with an awesomizer, consider pitching them your idea to develop personalized content for them to share with their followers. The worst thing that could happen is they say no. Big deal — we've all been rejected before. Reach out to the next influencer, and sooner or later one of them will welcome the attention and say yes. While having a pre-established relationship is the best case scenario, it's not a requirement. If you mine the data, find the story, and create and share the personalized content, that is definitely enough to start a relationship with an influencer. Step 2: Develop personalized content Travis's story was so compelling and rare, and because it could be structured with an easy-to-follow timeline of events, we knew it would make for an awesome infographic. We were excited to test out our experiment — if we created personalized content for Travis, would he share it across his large group of followers, and would that help turn him into a brand advocate while also capturing attention for the Rise Interactive brand? Only one way to find out… We got to work compiling the timeline and getting the facts straight. Our graphic designer started laying out the infographic. It was a time-consuming process — reviews, revisions, legal hurdles that we hadn't considered, and more revisions. But it had to be perfect — this was a gift to our awesomizer, after all — so we labored on until we had our final product. We were proud of what we developed, but would Travis really share it? Would it have any significant impact for Rise? Key takeaway First, you need to identify which format your content should take. We chose an infographic because they're a popular format for sharing easy-to-understand content, the timeline nature of Travis's story would be easy to represent graphically, and they're also one of our creative team's specialties. Think about the best vessel for your content, what you're good at, and then let the creative juices flow. Even though it's pandering to your influencer, make sure it's compelling enough to stand alone in case they don't share it. The second takeaway is that you need to invest a lot of time to guarantee a great final product. You're creating personalized content for awesomizers, so it should go without saying that the final product is awesome. Step 3: Syndicate content It was the moment of truth. We posted the infographic to Rise Interactive's blog.Then I personally shared the infographic with Travis on Twitter; we didn't tweet this out first ourselves. Exclusivity was part of our strategy; we wanted Travis to be the first to see the infographic and allow him to share it first. We waited in anticipation. Travis responded to my tweet, thanking us for creating the infographic. He then created a separate tweet and shared it with his Twitter followers, all 129,000 of them. He then proceeded to embed the full infographic on his blog, along with links to Rise Interactive's blog. He also tweeted about his new blog post. Our experiment was a success — Travis was sharing our infographic. Travis found benefit in our efforts as well. We weren't just building an infographic; we were starting to build a brand advocate. On top of Travis's efforts, our SEO team focused on link building to generate more attention and authority for the infographic by securing links back to Rise's blog. Key takeaway Provide your influencer with exclusivity in viewing and sharing your personalized content. Allowing them to create the first surge of the sharing wave will help reinforce that they are an extremely valuable, important part in the process. But don't rely on them for everything — have a two-pronged approach and invest in link building efforts to compliment the awesomizer's reach. Step 4: Measure results The last step is to measure the results of all of your efforts. Only the data can tell you how much of a success the experiment was. Overall, Rise Interactive's blog received approximately 50 links and 12 total linking root domains.* Extra Mustard, one of Sports Illustrated's sister sites, linked to the infographic because of its sports theme, which was a big win because of the high traffic that the site receives. The first week of the infographic being live on our blog, the Rise website received approximately 15,500 referral visits; 98 percent of those visits were new visitors. Aside from the spike in website traffic to Rise's website, we converted Travis Wright into a brand advocate. He loved the infographic we created for him, and happily shared it among his vast social network. It was truly a win-win scenario for both Travis Wright and Rise Interactive. *It's important to note how we arrived at these numbers: We looked at multiple different sources (Moz, GWT, BWT, and Majestic) and de-duplicated link data from each source to arrive at a final number of links and linking root domains. Key takeaway Make sure that you have analytics in place to track the success of your initiative. While it was a great accomplishment that Travis shared the infographic with his social followers, we needed to have more objective ways to measure success. Only data can truly show you how successful any digital marketing investment really is, so make sure you have an analytically driven, data focused reporting strategy in place to define what success really looks like. Conclusion Ultimately, there are two significant takeaways we can gather from all of this. The first is that in our experience, developing personalized content for social awesomizers is an effective way to enchant influencers, convert them into brand advocates and elevate a brand's digital presence. The second is that involving multiple channels and uniting them with one common goal can lead to some innovative strategies and awesome results. Rise's creative, SEO, social, and event marketing teams all worked together on this project and accomplished more than any single channel could have accomplished alone. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Influencing Social Awesomizers with Personalized Content"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Influencing Social Awesomizers with Personalized Content"
    },
    {
      "level": "H2",
      "text": "Step 1: Identify your awesomizer"
    },
    {
      "level": "H3",
      "text": "Key takeaway"
    },
    {
      "level": "H2",
      "text": "Step 2: Develop personalized content"
    },
    {
      "level": "H3",
      "text": "Key takeaway"
    },
    {
      "level": "H2",
      "text": "Step 3: Syndicate content"
    },
    {
      "level": "H3",
      "text": "Key takeaway"
    },
    {
      "level": "H2",
      "text": "Step 4: Measure results"
    },
    {
      "level": "H3",
      "text": "Key takeaway"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jon Morris\n          \n            Jon Morris"
}