{
  "url": "https://moz.com/blog/infosearch-media-contentlogic-purveyors-of-falsehoods",
  "slug": "infosearch-media-contentlogic-purveyors-of-falsehoods",
  "title": "InfoSearch Media & ContentLogic - Purveyors of Falsehoods - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I spent some time on the phone today with William Stinson from InfoSearch Media (link condom applied). They had cold called an old client (and friend) of mine who referred them to us. I spent a good 20 minutes chatting with William to attempt to understand their business model and their services. I…",
  "content": "InfoSearch Media & ContentLogic - Purveyors of Falsehoods Public Relations By: Rand Fishkin October 26, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 26, 2006 InfoSearch Media & ContentLogic - Purveyors of Falsehoods Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I spent some time on the phone today with William Stinson from InfoSearch Media (link condom applied). They had cold called an old client (and friend) of mine who referred them to us. I spent a good 20 minutes chatting with William to attempt to understand their business model and their services. I took a few notes from our phone conversation - here's what InfoSearch Media had to say: Google currently uses LSI as a big part of their ranking algorithm (which is a load of bull) The perfect length for an article to rank well is between 200-250 words; any shorter and the search engines don't have enough material, any longer and they start to get confused (no, seriously, that's almost verbatim what he said) Text content is the primary metric on which search engines base their rankings - links, while important, are a smaller part of the equation InfoSearch Media was named \"best content writer\" by TopSEOs.com - apparently, they're also an \"official sponsor\" - can you say \"conflict of interest\"? Luckily, the press release didn't reveal that information. William had evidence to back this up, too. He showed off a few clients: This page ranks #3 for \"kobe beef steaks delivered\" thanks to the great article that Infosearch wrote for Allen Brothers. This one ranks #1 for \"organic dark roast coffee,\" once again due to the brilliant article writing. William told me that if they had opted for the full package of 400 article, they could probably rank for \"coffee.\" (more on that gem later) This page ranks #1 for \"buy hard drives\" - they can rank well for these competitive terms because Infosearch wrote so many great articles for them, not because they're NewEgg... right? (BTW - the \"article\" they wrote that's helping the page rank is at the bottom of all the products - it's \"not for users.\") I literally felt like I was on a phone call to crazyland. I tried asking William to explain the logic behind why Google would want to rank a site higher simply because they had more articles on a subject than another and we came back to LSI. Then, I received the following from them through email (after our call had ended): Hi Rand- Here is the info I was referring to about LSI and Google: How Does Google Use Latent Semantic Indexing (LSI)? Latent Semantic Indexing (LSI) helps Google and others maintain relevancy by distinguishing in search results between polynyms, words with multiple meanings ...www.wilsonweb.com/seo/google-lsi.htm Also, my manger sent me this email after we spoke about Google: “I just came back from the WebMaster World Conference in LV. I spoke with a man who recently worked for Google. He explained to me that Google is restructuring their algorithm to align more closely with LSI. Many people have been noticing a wide shuffle in search relevancy scores recently. Some of those well in the know attribute this to latent semantic indexing, which Google has been using for a while, but recently increased its weighting.” When I told William I was speaking at WMW Vegas next week, he told me that his manager \"was quoting a blog he read.\" Contentlogic (the Infosearch service I was being pitched) says on their homepage that article content (like the type they offer) is the best way to achieve high search engine rankings. They excerpt a quote from Mary O'Brien (formerly of Overture), when the actual article Mary wrote is a near-perfect argument against the kind of \"write-for-engines-not-users\" philosophy that's embodied in their services. It's not that their services are bad - they COULD be valuable to the right company in the right place. The writing is good quality and the subject matter isn't awful, it's just that they go about promoting it in such a horribly manipulative, shyster-like style that it's hard to take anything they say seriously. It makes me sick - no wonder there's articles like this about SEO. With these guys as role models, we're going to be thought of as bottom feeders for a long time to come. p.s. Obviously (as with all things in the blogosphere and on SEOmoz), the above represents my opinions. If you're curious about whether I've got the right to say these types of things without fear of legal retribution, check out this guide to defamation as it relates to blogging. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "InfoSearch Media & ContentLogic - Purveyors of Falsehoods"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "InfoSearch Media & ContentLogic - Purveyors of Falsehoods"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}