{
  "url": "https://moz.com/blog/infosearch-media-public-search-marketing-firm-found-to-be-deceptively-spamming",
  "slug": "infosearch-media-public-search-marketing-firm-found-to-be-deceptively-spamming",
  "title": "Infosearch Media - Public Search Marketing Firm Found to be Deceptively Spamming - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As we all know, there's no shortage of companies out there that are willing to spam to try and drudge up new business. The fact that a search engine marketing firm was found to be blatantly and deceptively spamming might seem even less remarkable.However, what is news in my opinion, is that a…",
  "content": "Infosearch Media - Public Search Marketing Firm Found to be Deceptively Spamming Online Advertising J By: JohnMacerz November 26, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! J By: JohnMacerz November 26, 2007 Infosearch Media - Public Search Marketing Firm Found to be Deceptively Spamming Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. As we all know, there's no shortage of companies out there that are willing to spam to try and drudge up new business. The fact that a search engine marketing firm was found to be blatantly and deceptively spamming might seem even less remarkable. However, what is news in my opinion, is that a publicly traded company would be employing these deceptive tactics. Last year, Rand posted an article about his discussion with a salesperson at Infosearch Media. Rand clearly showed their false and deceptive sales practices. My first run-in with this company was from a friend who used to work there later in 2006. When I saw Rand's post, I called my friend and asked him about it. He told me some things that were pretty interesting. Apparently some new management took over the company in 2005. The new CEO was originally the President of Ask Jeeves, and the company is publicly traded. I didn't even know there were any publicly traded SEO companies. My friend told me that they use spam as their main form of generating leads. I find this to be very interesting that a public company would be doing this since I always think of public companies as having to \"play by the rules\" more since they are in the public spotlight. Then it got even more interesting. Apparently, Infosearch has created false companies with false domains to spam from. They set them up in China to try and avoid the hosting and legal problems in the US; however, since they still spam into California, I believe this is still in violation of Federal spam laws. My friend told me that they made him call company owners and tell them they were writing a story about them, only to hook them and try and sell them content for their website. He said the name of the domain was www.ecyberscreeen.com (which has since been taken down). You can read more about this here: http://marcelo.sampasite.com/brave-tech-world/A-real-press-contact-or-the-most.htm One of the main laws having to do with spam is that it is illegal to send email under a false identity. I'm surprised that a public company is engaged in these practices. Although, after reading Rand's post and after talking to my friend about his experience there, it sounds like there are a lot of shady things going on at that company. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Infosearch Media - Public Search Marketing Firm Found to be Deceptively Spamming"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Infosearch Media - Public Search Marketing Firm Found to be Deceptively Spamming"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "JohnMacerz\n          \n            JohnMacerz"
}