{
  "url": "https://moz.com/blog/informational-content-with-povs",
  "slug": "informational-content-with-povs",
  "title": "How and Why You Should Create Informational Content with POVs - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Informational SEO content, by itself, only drives traffic. You want your content to persuade your readers to do something. That's where points of view (POVs) come in. In this article, Victor Ijidola explains that by sharing your POV, you're not just providing information. You're providing value.…",
  "content": "How and Why You Should Create Informational Content with POVs Content Marketing | Branding By: Victor Ijidola June 19, 2023 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Victor Ijidola June 19, 2023 How and Why You Should Create Informational Content with POVs Content Marketing | Branding The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Edited by Emilie Martin Informational SEO content, by itself, only drives traffic. It’s the ideas you put inside that determine whether it’ll drive anything else besides that (say, conversions, revenue, etc.). But unless you’re a media outlet where the goal is to get views and clicks for ads, you don’t just want traffic. You want your content to persuade your readers to do something — whether it's to sign up for a product trial, buy your product, or contact you for a consultation. That's where points of view (POVs) come in. We’ll go into more detail about how POVs help your informational content drive sales, but first, let’s define what they mean and see an example. Note: informational content is simply content you create to inform your readers about something. It doesn’t necessarily contain an opinion, call to action, or a sales pitch, just helpful information about a certain topic or object. What’s a POV? And what does it look like? As the term implies, a POV is your unique perspective or view about a topic. It’s how you see a particular concept — and it’s often formed by your experience or observations (or both). A good example of a POV is something Kick Point’s president Dana DiTomaso did with a recent Whiteboard Friday, titled: “GA4 Audiences: Not Just for Ads!” Right within the introduction, Dana shared her perspective (POV) on one of the features she thinks people weren’t using as much as they should: Other articles on the same topic might be preaching other ideas, but Dana’s POV is that Google Analytics 4’s Audiences are more capable than just using them for ads. And throughout the article, she continued sharing her unique perspectives on every point she raised in the article and video. I’ll share why POVs like this are super important in the next section, but what Dana did with that piece is an example of what a POV in an informational content piece looks like. Put another way, a POV is what you think as a person or as an organization about any given topic. It represents YOU. When asked, “What are your thoughts on {insert topic}?” Your response is your POV, and it is unique to you and your brand. But why are POVs relevant for creating informational content? There are probably many other reasons to use POVs in informational SEO content, but these five stand out: Reason 1: Form deeper connections with search visitors By providing your point of view on a topic, you're offering your audience a glimpse into your thoughts, values, and viewpoints. You're sharing a piece of yourself. You’ll often need to dig into your personal experiences, thoughts, or even the experiences of other people and share your opinion on the topic. As your audience consumes your “POV-driven” content, they’ll feel as if they’re getting to know you. And that, right there, is the connection you want to create — because people often prefer buying from people they know. A good example of content forming a connection with the reader is the Moz piece I shared earlier by Dana. Another one is an article by ConvertKit on “How (and why) to build your first email marketing funnel.” It immediately starts with the writer (Kayla Hollatz) sharing her experience about when she first heard the term “email funnel.” This intro immediately shows the writer’s POV or viewpoint: email funnel is easy; doesn’t require an MBA to understand or use. It eases the reader’s mind into the piece and encourages them to keep reading. And the more they do that, the better your chances of them taking the action you want them to take. Reason 2: Become the go-to for “serial searchers” Ever met people who have a strong habit of googling for answers to every question they have? (Hint: I’m one of them) I call them (well, us) “serial searchers.” Once a question pops into our heads, it doesn’t take us too long to plug it into a search engine for answers. And as we do that, we’d find that there are certain brands or publishers in specific industries/niches that often deliver the answers that: aren’t fluff, have been written by subject matter experts, andactually solve our problem. Over time, we recognize these brands as “thought leaders,” and they’re often going to keep getting our clicks when we see them in the SERPs (search engine result pages). But I wanted to see if this is just me or if other search engine users have similar habits of recognizing certain brands as “go-to” sources for answers. So I asked my LinkedIn connections if they typically click results from certain brands more than others. The result: Apparently, 80% of search engine users in my network tend to recognize certain trusted brands as the go-to source for information or answers. The bottom line here is, you want to be that website — or better yet, THAT AUTHOR — for your audience. And sharing unique and helpful POVs in your SEO content is one effective way to do that. And this is even more important now that Google rewards Experience, Expertise, Authoritativeness, and Trustworthiness (E-E-A-T) in its search algorithm. Reason 3: Hold attention for longer If you share POVs that are helpful and unique, you’ll get readers excited about your content and make them more likely to stay on your page longer. One time, I wrote an article featuring a couple of B2B marketers. I asked them how long it typically took them to determine whether they'll read an entire content piece. Here are some of their responses: In essence, they’re saying: It takes only a few seconds to decide whether a content piece, likely to consume 10 minutes of our time, is worth our attention. If your POV is strong enough, chances are high they’ll wait. They’ll read your headline and then your intro. So if your POV resonates with them, they’ll keep reading. Reason 4: Drive more conversions Think about this for a second: Imagine you’re selling CRM software. A potential customer who doesn’t even know they need a CRM tool goes to Google and searches for “how to manage customer relationships.” Your content is on the first page, so they click it. Once they’re in, the first line reads, “Customer relationship management isn’t about customer relationships. It’s about driving more revenue and conversions.” Right there and there, you’ve introduced a POV that’ll likely pique their interest. Now, they’re in a “tell me more” kind of mode. And if you play your cards right (more on this in a bit) and convince them that a good customer relationship management tool will grow their revenue, they can get inclined to sign up for your product. Reason 5: Become a socially relevant brand SEO content (informational or not) is usually not designed to be shared on social media or other platforms. Marketers who create this type of content are often only looking to get organic traffic from search engines. And that often results in creating content that’s not engaging enough to make people want to click and share with friends in the industry (or content that doesn’t help your brand be socially relevant). But if you’re creating content with specific POVs, you are likely to build a social brand — aka a brand people want to talk about and share on social media. An exemplary demonstration of this is the approach revenue intelligence platform Gong uses with their blog content. They’re almost always creating informational content that’s both search engine friendly and engaging enough for social platforms. For instance, their blog post on Value Selling is crushing it in the SERPs as well as on social media. When they shared the content on LinkedIn, it garnered over 180 likes, seven comments, and 10 reposts (which is huge on LinkedIn). Meanwhile, it’s ranking on search engine results pages (SERPS) for 25 keywords, meaning it’s organically driving search traffic: This is happening because they’re not just cranking out SEO content; they’re creating search-friendly content with POVs that help them build a brand that’s socially relevant. Bottom line: creating informational SEO content doesn't mean you can't also create content with a point of view and personality — in fact, it's often better to do so. How to create POV-driven informational content Here are some of my best tips for creating POV-driven content: 1) Find relevant product-related topics There are lots of topics swirling around in your industry, but you don’t need all of them. Instead, you want to pick the ones that are most closely related to your product; those are the ones that’ll attract your target customers. Once you find them, you’ll need to narrow down your POVs on each of them. But before that, here’s how to find your topics in the first place: Plug in your main product-related topic or keyword into Moz Keyword Explorer and it’ll give you a list of related topics. For instance, if you’re a B2B software company selling CRM software for real estate businesses, a major topic for your business would be “real estate CRM.” Plug that into the tool and it’ll return a list of keywords and topics you can use in your content. Your primary job here is to be brutally honest with yourself about which of these related topics would: be the most interesting for your audience,give you an opportunity to share your POVs, and present opportunities to drive sales for your business. For instance, as a CRM software brand for real estate vendors, you’ll need to ignore keywords like “real estate agents near me,” and focus on topics related to CRM software like “CRM for real estate agents.” Resist the temptation to select any topic just because it has a high search volume or a low level of competition. Put your focus on topics that’ll interest your audience and bring value (leads, revenue, etc.) to your business. Next, narrow down your POVs on each topic you pick. 2) Identify your POVs on selected topics/keywords Once you have your topics and keywords selected, identify your distinct point of view on each one. Nothing too complex here, just your true position on each topic that you can defend. And you can make this POV-identification process easy by simply asking, “What do I, or we as a business, think about {topic}?” For example, what does a brand like Drift think about AI marketing — or the role of AI in marketing? Here’s what their POV looks like: It’s simple and to the point. Having a POV doesn’t always mean having big, grandeur ideas to share. Sometimes it’s simple and represents what you truly think about a topic — based on your experience and observations. That’s the crux of having a POV. It should represent you and your brand. It shouldn’t be something you just hand off to interns or inexperienced content creators to figure out. It should be something that gets shaped by your expertise, experience, and values. That’s what your audience will connect with. They’ll connect with you and your ideas. 3) Introduce unbiased, contrasting approaches First, what are “contrasting approaches?” It’s simply the practice of introducing different POVs or methods to a problem. Done well, contrasting approaches help to showcase one important element: your credibility. It tells the reader, “I’m placing all the cards on the table. Make your choice.” And they love it; 72% of customers — from a Gartner survey — said they prefer completing their purchase without the help of sellers. They want to decide on their own without being told what to do. And introducing contrasting approaches, and genuinely highlighting the pros and cons of each, helps them do that. Drip comes to mind here. They created a series of articles on Drip vs. other email marketing platforms, and they’re decently unbiased. This is what Drip vs. MailChimp looks like, for instance: Buyers often appreciate seeing different sides to an issue like this without feeling as though you’re trying to manipulate them, so Drip’s execution was on-point here. With contrasting approaches like this, you get to demonstrate your knowledge and authority on the topic, while also inviting your readers to think critically and compare their own opinions with yours. Important note: It’s important to truthfully provide both sides of an argument — not just the one that supports your POV. But of course, ‌it’s okay to be a bit biased here and say you prefer your product over others — but genuinely explain why. 4) Back your POVs with recent data & case studies It’s not enough to just state your opinions and perspectives on a topic. You need to support them with credible and relevant evidence that shows why your POVs are valid and valuable. One of the best ways to do that is to use recent data and/or case studies that reinforce your points and make them believable. For example, if you’re writing about how to optimize your website for SEO, you can use data from Google Analytics or Moz to show how your strategies have improved your traffic and rankings. When you back points or claims with data like this, you eliminate objections and make your content more believable. And the more people believe your POVs, the more likely they are to trust you and the strategies, products, or services you offer. 5) Infuse your POVs into all parts of your content All parts of your content here means: the headline, introduction, body, and conclusion. Make sure to weave POVs all throughout your content — from start to finish. And this simply means instead of just stating facts and figures, share your thoughts and experience for every point you raise. Remember my point earlier about how sharing POVs means sharing a part of yourself with your audience — i.e. your own thoughts and views? When you infuse POVs, you’re doing just that, and it’s an effective way to build a strong connection with your audience. POVs aren’t just opinions They’re informed opinions based on data, research, experience, or insights. They show that you know what you're talking about and that you have something valuable to offer. They also help you stand out from the crowd and differentiate yourself from your competitors. For example, if you're writing a blog post about the best SEO tools for beginners, you could share your POV on why Moz is better than its competitors — from your real-life experience. By sharing your POV, you're not just providing information. You're providing value. You're showing your readers that you understand their problems and you have a solution for them. Sharing POVs inside informational SEO content can help to drive conversions because it builds trust and rapport with your audience. It also shows that you're confident and authoritative in your niche. And it makes your content more interesting and memorable. So next time you write SEO content, don't be afraid to share your POV. It could make a big difference in your results. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How and Why You Should Create Informational Content with POVs"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How and Why You Should Create Informational Content with POVs"
    },
    {
      "level": "H2",
      "text": "What’s a POV? And what does it look like?"
    },
    {
      "level": "H2",
      "text": "But why are POVs relevant for creating informational content?"
    },
    {
      "level": "H3",
      "text": "Reason 1: Form deeper connections with search visitors"
    },
    {
      "level": "H3",
      "text": "Reason 2: Become the go-to for “serial searchers”"
    },
    {
      "level": "H3",
      "text": "Reason 3: Hold attention for longer"
    },
    {
      "level": "H3",
      "text": "Reason 4: Drive more conversions"
    },
    {
      "level": "H3",
      "text": "Reason 5: Become a socially relevant brand"
    },
    {
      "level": "H2",
      "text": "How to create POV-driven informational content"
    },
    {
      "level": "H3",
      "text": "1) Find relevant product-related topics"
    },
    {
      "level": "H3",
      "text": "2) Identify your POVs on selected topics/keywords"
    },
    {
      "level": "H3",
      "text": "3) Introduce unbiased, contrasting approaches"
    },
    {
      "level": "H3",
      "text": "4) Back your POVs with recent data & case studies"
    },
    {
      "level": "H3",
      "text": "5) Infuse your POVs into all parts of your content"
    },
    {
      "level": "H1",
      "text": "POVs aren’t just opinions"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    }
  ],
  "author": "Victor Ijidola\n          \n            Victor Ijidola\n          \n            Victor Ijidola"
}