{
  "url": "https://moz.com/blog/international-cro",
  "slug": "international-cro",
  "title": "International CRO - Choosing the Wrong Colors and Other Mishaps - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Good morning Mozzers! Today we're going to walk you through some rather basic but far-too-oft overlooked conversion factors specifically for international SEO. Anyone who has had the pleasure of using ecommerce sites in multiple countries may have noticed that as a general rule the sites look…",
  "content": "International CRO - Choosing the Wrong Colors and Other Mishaps On-page SEO S By: Sam Crocker July 11, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! S By: Sam Crocker July 11, 2010 International CRO - Choosing the Wrong Colors and Other Mishaps On-page SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Good morning Mozzers! Today we're going to walk you through some rather basic but far-too-oft overlooked conversion factors specifically for international SEO. Anyone who has had the pleasure of using ecommerce sites in multiple countries may have noticed that as a general rule the sites look pretty similar if not identical. Today we are going to walk you through some of the pros and cons of this approach and how you might actually benefit from mixing things up for different audiences in different countries. WARNINGS: 1. There is something to be said for having a similar site, brand, and feel that can be recognized all over the world. 2. Some CMS systems do not allow for easy changes to be made for different versions of the site. 3. With Google Translation, many folks are becoming less interested in having multiple sites anyhow. 4. More sites mean more potential problems and things to worry about. Now, with these warnings out of the way let's first jump into some of the potential benefits, and then look at some examples. Why Change a Good Thing? Let's consider an example company that has enjoyed a great deal of success in a country like the US and would like to become a major player in a country like Japan. Now, setting aside some of the logistical nightmares and translation issues we could stick with the templates and design from our original site in hopes of breaking into the Japanese market as a known quantity. After all, our model has worked wonders in the States and is likely to appeal to the Japanese market as well, right? Well, maybe. On the other hand, it's probably worth considering a number of things about the site before we make a decision either way. How Powerful is my Brand? First, have we done our market research? It is all well and good if we have experienced success in one market, but it won't necessarily mean that our brand name means anything to the new market. We don't need to look too far outside of the field of SEO to realize that market shares and the \"major players\" can vary greatly from one country to another. Now, we search marketers may tend to be biased towards Google in our SEO efforts, but we at least are all familiar with Bing and Yahoo! Meanwhile, some countries (China in the example) these \"major brand names\" may not mean anything. So banking on your \"established brand\" means very little when exploring a new market- be sure to do your research! \"I want a Pretty Site\" Secondly, what if up means down and down means up. Sounds ridiculous, I know, but it's not so far off. Colors can mean totally different things from one country to another. And I'm not talking about horoscopes here! This isn't a simple question of blue means serenity and purple means power there are much more pressing conversion factors to talk about here. Let's look at the implications of red and green and up and down. This factor was brought to my attention in a recent blogpost by the folks on the Yahoo Developer Blog and it is a really crucial point to consider- especially for conversions. In the US and most English speaking countries we are accustomed to a simple logic: Green = Good, Red = Bad. This holds from everything to traffic lights, to stock markets. However, in China and Korea the opposite is true. These two screenshots were taken at the same time. The one on the left was taken from Yahoo! Finance whilst the one on the right was taken from Yahoo! Korea. As you can see, both images are showing the same data, although one of them appears with red arrows for the upward movement of the stock markets and the other appears with green arrows. This may be a simple illustration but it is easy enough to understand how the massive red letters you use to draw attention for falling prices on your US site could cause a bit of confusion. Browser Usage Finally, be mindful of the most common browsers in the country you are targeting. Compatibility across all browsers is always advisable but not always achievable. Although you may have built your site in the US with an understanding that most people would be using Chrome or Firefox the same may not be true everywhere else. In fact, as much as we bemoan Internet Explorer in the UK and the US it is still far and away the pre-eminent browser in Japan. *REMEMBER THIS, because this bit of information may become even more relevant to you after a forthcoming casestudy by Tom which reveals some potentially massive Conversion losses from Internet Explorer users. I fear I may have said too much already, but be sure to watch this space for a link to the article. EDIT: Here is the case study on the Google Analytics Blog! Speaking the Language Image: Engrish.com My final suggestion for creating a site outside of your country comes with a word of warning. If this image looks ridiculous to native English speakers, imagine how silly a site built by one of us looks to a native mandarin speaker. Invest the time and effort to find the right person to build the site. If you are looking to take your ecommerce site to a global audience make sure you're doing it the right way! Do What Makes Sense! As you may have realized, some of these seem like common sense but are far too often overlooked. If your site/brand doesn't have any recognition to speak of make sure you've done your market research. It makes perfect sense for a brand like Amazon (without too many \"offensive\" colors used on any of their sites) to capitalize on their brand recognition across the web. There is no reason for them to invest too heavily in a redesign and a new name- because they can afford to acquire existing brands and rebrand. However, if you have just enjoyed some excess in your home market and are thinking about taking your ecommerce platform to new heights be sure to consider the impact on usability. Have I got the colors right? Have I considered the language issues? Have I thought about conversions and browser issues? And perhaps most importantly- have I got the funds to do this the right way at the moment? If you can't afford to make the switch properly, perhaps it is better to consider a \"friendlier\" market that is more similar to your current market and save your global dominance for a later experiment. *Browser and Search Statistics from StatCounter Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "International CRO - Choosing the Wrong Colors and Other Mishaps"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "International CRO - Choosing the Wrong Colors and Other Mishaps"
    },
    {
      "level": "H3",
      "text": "WARNINGS:"
    },
    {
      "level": "H3",
      "text": "Why Change a Good Thing?"
    },
    {
      "level": "H3",
      "text": "Do What Makes Sense!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sam Crocker\n          \n            Sam Crocker\n          \n            Sam Crocker"
}