{
  "url": "https://moz.com/blog/international-seo-part-2",
  "slug": "international-seo-part-2",
  "title": "International SEO Part Two - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Perhaps some of you read it in my comments of Rand’s last Whiteboard Friday http://www.seomoz.org/blog/international-seo-where-to-host-and-how-to-target-whiteboard-friday , that I planned to prepare and write my first YOUmoz post about exactly the same topic this weekend. \nT...",
  "content": "International SEO Part Two International SEO By: Petra Kraft February 28, 2011 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Petra Kraft February 28, 2011 International SEO Part Two International SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Perhaps some of you read it in my comments of Rand’s recent Whiteboard Friday on International SEO, that I planned to prepare and write my first YOUmoz post about exactly the same topic this weekend. The first thing I do in the morning (of course if I am in my office) is to read the first blog post on SEOmoz and after watching this WBF, I though – well this is it (to cite Michael Jackson) – this is a sign that I better not touch that theme. But I confess I was kind of disappointed. Both Rand and goodnewscowboy commented that I still should write my post – this gets me kind of under pressure – I have to submit. As well as the many comments, which gave me the feeling that everything is already said and discussed. Let me get to the point: I will try to add my “wisdom” (I don’t consider myself as an advanced SEO and probably I will repeat some items Rand talked about yet so please indulge me). One of the first items in international SEO is to decide which top-level domain works best for my intentions. There are two main groups: gTLD like .com, .net, .biz, .org etc. ccTLD like .at (Austria), .de (Germany), .fr (France) etc. Apart from the top-level domain we have to take into consideration the following options. Do I use: parameters (forget instantly that I even mentioned that possibility) subdirectories = folders subdomains Google isn't much help either on whether we should use folders or subdomains. Let’s shortly dive into the branding. If you have a keyword rich brand as a domain name, well perfect. If you can translate your brand domain and then work with that in the country you want to rank for – even more perfect. Example www.holidayintimbuktu.co.uk www.urlaubintimbuktu.de www.vacancesentimbuktu.fr But that’s not often the case that you can and that you WANT to translate your brand. And there are signals that the brand in the domain is not so highly impacting the rankings that it did in the past. We will hear more about that from Rand. So - apart from that - what is the best practice? 1) The perfect solution would be: ccTLD of the country where I want to rank Server location in the country I want to rank Perfect on-page optimization with national-specific text of the country I want to rank Millions (sorry I am exaggerating), thousands of links from the country where I want to rank “yadayadayada” (I am citting Rand) Example My “main” domain is www.example.de I want to rank in Spain, France and Italy -> I set up the domains www.example.es , www.example.fr and www.example.it and do my homework like mentioned above in the “perfect solution”. Beware: with that solution the link juice of all the links to the main domain is not helping you any more. You are cut off – kind of ship wrecked. 2) The alternative solution But as we all know the world is not perfect – we take what we can get. This means: If you don’t have the possibility to use, for whatever reason, a ccTLD we got the best results with using a .com Domain – combined with folders or subdomains. e.g. example.com/es or es.example.com Remember – my main domain is still www.example.de So that means here, too, we can’t profit any more of all the link juice of my main domain so a lot of work is coming up. One important item in the Google Webmaster Tools: I only can set my geo-location in the webmaster tools if I use an international domain like .com, .info, .eu and so on – a specific country domain is automatically set to the country itself – there is no option to change that. 3) The poor and cheapest solution Work with you main domain – in our case www.example.de – combined with folders or subdomains. e.g. example.de/es or es.example.de Depending on a small client’s budget it is a solution, too. Just don’t promise your client heaven and earth. But!!! We have the link juice in that variety ;-) . Did you read point 1 to 3? Did you notice something about item 2 and 3 and our US friends? The .com domain is our (our = European, what about the rest of the world? Do you consider the .com as international, too?) international domain we work with, if we use solution n° 2. The US Americans, which kind of see the .com domain as their national domain, can neglect n° 3 and get the extra bonus of the link juice if they use solution n° 2. Let’s grant them this advantage. 4) Unifying content under multilingual templates with rel=alternate Have you ever heard about that possibility? http://googlewebmastercentral.blogspot.com/2010/09/unifying-content-under-multilingual.html - but that’s only in special cases useful. Of course there is still the problem left with a) different languages in the same country and b) same languages in different countries. Suggestions a) Try to set up unique content for each language b) Try to set up unique content for each country – this is very tricky here and in this case you really have to be creative and know the habits, terms and spellings. I would strongly suggest to work with a “native” in that scenario (you have to prevent duplicate content issues here, too). Some quick notes at the ending: The same content in different languages is NOT duplicate content Don’t forget that you can only set your geo-location in the Google Webmaster Tools if you use international domains like .com, .info, .eu … Use proper HTML doctype language specifications Use the language in the further URL of that specific country you want to rank. Last but not least the search engines recognize the language of the website mainly through the text in the content If you are not a global team player / huge brand it is not easy to rank in international SEO The “top dogs” which rank well in national SEO do have their advantages, too in international SEO (brand awareness since years, positive signals in social media etc, presence in off-page topics etc.). Now I would be glad to read your comments! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "International SEO Part Two"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "International SEO Part Two"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "International SEO — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Build a Business Case to Get an International SEO Investment Approved for 2024"
    },
    {
      "level": "H3",
      "text": "Going International: 15 SEO Steps for a Successful Expansion"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Petra Kraft\n          \n            Petra Kraft\n          \n            Petra Kraft"
}