{
  "url": "https://moz.com/blog/interview-with-ask-jeeves",
  "slug": "interview-with-ask-jeeves",
  "title": "Interview with Ask Jeeves - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Mike Grehan, one of the most diligent and intuitive people in the search marketing industry, has conducted a fantastic interview with some of the top technology & business people at the Ask Jeeves engin...",
  "content": "Interview with Ask Jeeves Mobile SEO By: Rand Fishkin February 24, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 24, 2005 Interview with Ask Jeeves Mobile SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Mike Grehan, one of the most diligent and intuitive people in the search marketing industry, has conducted a fantastic interview with some of the top technology & business people at the Ask Jeeves engine. Ask Jeeves is currently the #4 player behind Yahoo!, Google & MSN, but they have more than 30 million regular users across the US & UK. They also power the Teoma engine - a specialty search property that is beloved in the tech community (including SEOmoz and our tools). I've taken away some of the most important points from the conversation: Talking about Teoma: There is some debate about this. I think both of them were independently discovered. Has PageRank influenced Google? The answer is: later, yes. Have they implemented PageRank? The answer is no. On the use of specific tecnologies at Google: The importance has diminished because PageRank is just one piece of the ranking algorithm over there. The ranking algorithm is so much more complex now. And PageRank is just used when they want to break ties. I'm sure that they've not implemented Kleinberg's algorithm. But I'm also sure that they have created some kind of local implementation based on anchor text. They've been very, very solid for the last few years. I think the biggest improvement they've made is anti-spam inclusion and consistency. But what surprises me is that they haven't used subject specific popularity, even though they know it's important. On the possibility of a new player in the search market: So, people ask me: Who's going to be the next Google? And I say, it's like asking who's going to be the next Beatles. It's never going to happen. I think anyone trying to get into this space, general purpose search, I(sic) going to have a problem. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Interview with Ask Jeeves"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Interview with Ask Jeeves"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too"
    },
    {
      "level": "H3",
      "text": "Internal Linking for Mobile-First & Mobile-Only Indexing"
    },
    {
      "level": "H3",
      "text": "All About Fraggles (Fragment + Handle)"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}