{
  "url": "https://moz.com/blog/intro-local-seo-service-area-businesses",
  "slug": "intro-local-seo-service-area-businesses",
  "title": "Getting on the Map: The Intro to Local SEO for SABs - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Local SEO is tricky when you don't have a dedicated brick-and-mortar storefront. If you've been left wondering how to maximize your presence on Google and in your target markets as an SEO or a service-area business owner, this introductory guide by Joy Hawkins will set you on the right path.",
  "content": "Getting on the Map: The Intro to Local SEO for SABs Local SEO By: Joy Hawkins November 2, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Joy Hawkins November 2, 2015 Getting on the Map: The Intro to Local SEO for SABs Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Local SEO can be confusing for those businesses that don’t have a physical store for customers to walk into. Unlike businesses with a brick-and-mortar storefront, service-area businesses (or SABs) go out to meet with their customers, as opposed to their customers coming to see them. This often results in them servicing multiple cities, which can be problematic—the #1 ranking factor in local SEO is the physical address of the business. In addition, business owners are also usually concerned about privacy, as many of them use their home address and can’t utilize some of the features that Google offers small businesses (like Indoor Street View).This guide will show you how you can maximize your presence on Google and reach more people in your local market.1. Figure out which address you're going to use.As a service-area business, you only have a couple options. Here are some best practices:If you have an office, use that for your business address everywhere online.If you have no office but you have a business partner(s), use the home address for the person who lives closest to the major area that you service.Use the address you registered with for your business everywhere. Think of the address you put on your bank business loan, the address you used for registering for your business telephone line/cell phone, the address you provided when you bought a business vehicle or equipment. These are the addresses that are going to populate online via data providers later in the future, and they'll give you a possible headache if they don’t match what you used as your address in Google My Business (GMB).2. Decide if you need to hide your address or not.Hiding your address means that Google will know where you are (for verification), but users will not see your address publicly on Google.You should always hide your address if you're using your home address (unless customers actually show up there). If your customers do visit your home address, it needs to be blatantly obvious on your website. You should:List driving directions,Invite people to come visit, and Include photos of your home office.You should hide your address if you have an office, but no one is actively staffing it during the day. If a person walked in at 2pm during a work day, would your door be locked with no one there? If so, hide your address.If you have an office that is actually staffed, you should leave it unhidden.Flash from the MapMaker Top Contributor team wrote up a great guide that shows you how to hide your address and the rules that Google has about this.3. Decide if a public address is okay elsewhere online.If you fall into the majority of SABs that need to hide their address, decide if you're okay publicly listing your address on other websites.My advice is to always list your full address everywhere else online (other than Google My Business), including your website, Facebook page, Yellowpages listing, and so on. If you insist on not listing your home address anywhere, that’s okay, but know that you will run into some missed opportunities. There are still many local directories that require an address to be listed. Phil Rozek wrote a great summary of places you can list your business with a hidden address.4. Think about how you should list the area you service.In Google My Business, you can select which areas you service. You can do this by adding either zip codes or the names of the cities you service. It's good to note that what you select here will determine how your business radius and marker will show up on Google Maps. If you choose a ton of cities and zip codes, Google will attempt to find the center of them and put your marker there. The result isn’t always ideal. Keep in mind that the service areas you select have no impact on your ranking there. It’s extremely unlikely that you will rank in the local pack outside the town your address is in.5. Do a thorough check for duplicate listings on Google.The best option for a service-area business is to head to Google and type in this query (with the quotations). Replace the dummy phone number with your actual one:“plus.google.com” “999-999-9999” “about” “review”Go to the end of the URL string in your browser (it starts with “google.com…”) and add &filter=0Record a list of all the listings you find (they will all start with “plus.google.com” and repeat those 2 steps for every phone number that might be associated with your business. Make sure you check your home phone & cell phone.Once you have your list of existing listings, make sure you deal with all the duplicates appropriately.If your duplicate listings had inconsistencies and used different phone numbers, websites, or addresses than the one you have provided to Google, make sure you search Google for other online references to that information and update it there, as well.6. Do a local search on Google for a few keywords in the town your address is in and see who your competitors are.Look for competitors that either have multiple listings (which is not allowed) or that are using keyword stuffing in their business name. Typically, more spam exists for service-area businesses than for businesses with storefronts. Locksmiths are known in the local SEO world as being the most-spammed business category.Submit an edit for these listings through Google Maps to remove the keyword stuffing. If the competitor is a service-area business with multiple listings, you can report the duplicates through Google Maps. As per the guidelines, a service-area business is not allowed to have multiple listings. The only exception would be if they had multiple offices where customers could actually show up.7. Consider expanding your open hours.Service-area businesses with hidden addresses have the advantage of listing the hours that they're available to answer the phone. Businesses with storefronts are supposed to list the actual hours that customers can show up at their front door and get service. If they have a 24-hour call center, they are still not allowed to list themselves that way unless they're someone like McDonald's, with a 24-hour drive-through. Service-area businesses avoid this rule because they have no physical storefront, so their open hours are the equivalent of the hours that they answer the phone. With Google’s new hours display in the search results, having longer open hours could result in a lot more calls.8. Come up with a really great content strategy for the areas you target outside of the city your address is in.Generally, you will only rank in the local pack for the city that your address is in. If your home address isn't in the city that your primary book of business is in, this can be concerning. Other than setting up offices in different cities (real ones, not virtual ones), your best option is to target long-tail keywords & the organic section of Google using really great content. Here are some tips for ways to generate good content:Create pages/articles about the different jobs you do. If you are a home remodeler in the Denver, CO area but do jobs in the entire metro area, you could create a page for different jobs you did in Parker, CO. On that page, you could put before & after pictures of the job, a description of the job, details about the neighborhood you did it in, a testimonial from the customer, and so on and so forth.Create how-to videos for your industry. If you’re a tree service business, you could create a video on how to prune a maple tree (think long-tail and get specific). Post the video on YouTube and use their transcription service to transcribe the entire thing as well. In the description, include the full name, address & phone number of your business along with a link back to your website.Use a service like Nearby Now to help automate this process.If you're a contractor, create a useful page on your site for each town with safety information, emergency contacts or places to get permits.Technically, I could continue to add a hundred more items to this list—for now, I wanted to focus on the major starting points that will help a service-area business start out on the right track. If you have questions, please let me know in the comments! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Getting on the Map: The Intro to Local SEO for SABs"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Getting on the Map: The Intro to Local SEO for SABs"
    },
    {
      "level": "H2",
      "text": "1. Figure out which address you're going to use."
    },
    {
      "level": "H2",
      "text": "2. Decide if you need to hide your address or not."
    },
    {
      "level": "H2",
      "text": "3. Decide if a public address is okay elsewhere online."
    },
    {
      "level": "H2",
      "text": "4. Think about how you should list the area you service."
    },
    {
      "level": "H2",
      "text": "5. Do a thorough check for duplicate listings on Google."
    },
    {
      "level": "H2",
      "text": "6. Do a local search on Google for a few keywords in the town your address is in and see who your competitors are."
    },
    {
      "level": "H2",
      "text": "7. Consider expanding your open hours."
    },
    {
      "level": "H2",
      "text": "8. Come up with a really great content strategy for the areas you target outside of the city your address is in."
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Joy Hawkins\n          \n            Joy Hawkins\n          \n            Joy Hawkins"
}