{
  "url": "https://moz.com/blog/introducing-brand-authority",
  "slug": "introducing-brand-authority",
  "title": "Introducing Brand Authority: Measuring the Unmeasurable - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Learn more about Moz's new metric, Brand Authority, which solves the difficult task of quantifying brand strength.",
  "content": "Introducing Brand Authority: Measuring the Unmeasurable Moz News | Moz Tools By: Dr. Peter J. Meyers August 7, 2023 Table of Contents Copied! By: Dr. Peter J. Meyers August 7, 2023 Introducing Brand Authority: Measuring the Unmeasurable Moz News | Moz Tools Edited by Emilie Martin We all recognize the power of brands, but too often the value of brand building is reduced to hand-waving and wishful thinking. Today, Moz makes the power of brand measurable. Starting today, you’ll find something new in our Domain Overview tool: a Brand AuthorityTM score for your domain (or any domain you choose to analyze): You’ll also see a new visualization – a four-quadrant grid – that compares your Brand Authority and Domain Authority to your closest online competitors. Here’s an example for electric car maker Lucid Motors: It’s easy to see how Lucid stacks up to their closest search competitors and where they might need to build more authority. Lastly (for now), we’re launching a new API endpoint for API customers to access Brand Authority directly. What is Brand Authority? Brand Authority is a (1-100) score developed by Moz that measures a domain’s total brand strength. Where Domain Authority measures your ability to rank on search engines, Brand Authority measures your broader influence across marketing channels. Why Brand Authority? We know that brands matter, online and in the broader world. We see the influence of brands on search results, even if the details of that influence can be hard to pin down. Consider this illustration from Google’s own Quality Rater Guidelines: When someone in 2023 searches for “apple,” Google knows that they probably mean Apple the company (i.e., the “dominant interpretation” or “dominant intent”). Even if Apple.com didn’t get their SEO quite right or hadn’t built quite enough link equity, people expect it to come up first. We also know that Google understands real-world entities and tries to represent them in search, which might include Knowledge Graph results and other rich search result features. Google’s job is to model the real world, and brands are a huge part of that world. The problem is that while we all intuitively understand what a “brand” is and have our own idea of which brands are important, we often resort to hand-waving when it comes to measuring brand strength. At best, we’re limited by our own biases and influences. How does it all work? When someone goes to Google and searches for “apple,” or “apple store,” or “apple customer service,” they already have knowledge of and exposure to the Apple brand. Likewise, if they search for terms like “iPad,” or “MacBook,” or “AirPods Pro,” they’ve been influenced by the Apple brand even if they never used the word “apple.” Brand Authority uses two core Moz strengths: (1) Our deep knowledge of search results and rich search features, and (2) Our massive database of search volume information. Using Google’s rich results and brand signals, we can detect a wide variety of brand terms to understand how often people are looking for that brand and compute a score. What can you do with it? Anytime you need to connect a website to a brand and understand its broader influence, you can use Brand Authority. A few key use cases include: (1) Strength and gap analysis Brand Authority can help you better assess your strength as a brand and identify opportunities for improvement. Super-optimizing your website could result in diminishing returns (and poor ROI) if no one knows who you are. On the other hand, if you’re a more well-known brand but are lagging online, investing in your SEO and content efforts might be money much better spent than more offline advertising. (2) Assessing brand value/potential From sales prospects to M&A targets to reputation management clients, Brand Authority allows you to measure a brand’s broader strength and influence and help determine if they’re a good opportunity for you. Many underperforming sites might be built by solid brands with ample room for growth, while some seemingly strong sites could be built around virtually unknown companies, creating challenges to broader marketing efforts. (3) Measuring impact of digital PR While everyone hopes to get authority-passing links from their digital PR efforts, a big part of the PR game is the viral power of the mentions themselves. Brand Authority provides PR agencies with a quick and easy way to illustrate the broader impact of PR campaigns by measuring the actual word-of-mouth influence of the brands that pick up your stories. By making the concept of brand concrete, we hope that Brand Authority opens up new opportunities for marketers, even beyond SEO. We look forward to seeing how you put Brand Authority to work as the metrics and tools evolve, and we’d love to hear your stories. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Introducing Brand Authority: Measuring the Unmeasurable"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Introducing Brand Authority: Measuring the Unmeasurable"
    },
    {
      "level": "H2",
      "text": "What is Brand Authority?"
    },
    {
      "level": "H2",
      "text": "Why Brand Authority?"
    },
    {
      "level": "H2",
      "text": "How does it all work?"
    },
    {
      "level": "H2",
      "text": "What can you do with it?"
    },
    {
      "level": "H3",
      "text": "(1) Strength and gap analysis"
    },
    {
      "level": "H3",
      "text": "(2) Assessing brand value/potential"
    },
    {
      "level": "H3",
      "text": "(3) Measuring impact of digital PR"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}