{
  "url": "https://moz.com/blog/investing-in-link-building",
  "slug": "investing-in-link-building",
  "title": "Investing in Link Building - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There's no such thing as a free link. Whether it was the time taken to craft that blog post, the cash used to film that viral video, or even just the opportunity cost of thinking about how to build links, there is an investment involved. For my first post here at SEOmoz, I want to talk about how a…",
  "content": "Investing in Link Building Link Building By: Mike Pantoliano August 18, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Mike Pantoliano August 18, 2010 Investing in Link Building Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. There's no such thing as a free link. Whether it was the time taken to craft that blog post, the cash used to film that viral video, or even just the opportunity cost of thinking about how to build links, there is an investment involved. For my first post here at SEOmoz, I want to talk about how a small business might approach the investment into link building. To make this post a little less hypothetical, we're going to set a budget of $2,000 and/or 60 hours. This isn't to say that one needs $2,000 to build links, but for the purpose of this article it helps to keep things in perspective. And for those big business readers out there, I'm sure you could just ratchet up the investment by whatever order of magnitude you'd like. The Budget is Set So let's imagine your client or boss (if you're in-house) has promised to commit some time and money into a link building campaign. Huzzah! Finding yourself in a position to invest in SEO both financially and resourcefully is a great place to be, and these opportunities don't grow on trees. So it's tremendously important that this sum of money (and time) is invested wisely and provides a return, or else that \"crazy SEO wizardry\" might never make its way into the company budget again. ♫ If I had $2,000...I would send Matt Cutts some flowers ♫ So how best to go about spending this money? That, of course, depends on a lot. There are different kinds of link building strategies for different kinds of businesses in different stages of their SEO development. Answering some of the following questions may help with the \"Who am I?\" questions your website is surely asking itself (your-site.com/existential-crisis). Have we done any link building in the past? In other words, how low are the \"low hanging fruit\"? What is a reasonable goal here? Increasing overall domain authority and maybe increasing long tail traffic? Or boosting a specific page in the SERPs? How does the competition stack up? How much work needs to be done to overtake the competition? Directory Submissions We COULD invest $2,000 pretty easily with directory submissions and it wouldn't have to take anymore than 5 hours. The better strategy would be to invest a bit more time into the research phase before throwing $2,000 into a bunch of spammy directories. Some of the big paid directories are a given; Yahoo!, Best of the Web, Business.com and JoeAnt have established themselves as strong, link juice-passing options. Assuming our web site is not found in any of these directories we're looking at almost $800 already, and that isn't considering the annual renewal cost of most of these top-tier directories. This leaves us with around $1000 for submissions to niche and local directories that are deemed worthwhile; Rand discussed the litmus test for identifying these worthwhile directories in a recent Whiteboard Friday. Who should do it? In most cases, anyone that is not currently listed in the top-tier directories should make the investment. You do NOT want to be submitting to directories if your site is of low quality, as your site could be declined and you won't get that money back. Investing in directories is a good idea early, but I wouldn't suggest shelling out $2,000 in directories and declaring \"mission accomplished\". The better plan would to be to submit to paid directories slowly over the course of a few months, supplementing directory submissions with some more creative link building strategies. Also, don't forget that a sudden spike in backlinks followed by a lull of no new links is sure to set off a red flag or two. Outreach (PR for links) Outreach can be an inexpensive undertaking in terms of cash spent, but the real cost is in the time it takes to do it right. Commissioning under-worked call center staff or interns to call or email relevant site owners can be a great use of \"found\" time to generate links, but they'll still need some guidance. I find its a great idea to craft a quick \"SEO 101\" document, including bits about how search engines value links, anchor text, and other best practices. You might do well to give a primer on how to quickly evaluate a potential linking partner (say, only target sites with a domain authority over 55?), so your minions don't go wasting their time on spammy worthless links. Where outreach can get costly is in offering products, discounts, or other financial incentives to acquire links. Of course, we're getting a bit close to grey-hat SEO here, but is there really anything wrong with offering free product samples to generate interest? I suppose the white-hat method of product samples/discounts/etc. is to not require a link back, but if you ask me this is where the whole distinction gets kind of silly. Can you spot the difference? Regardless, I am infinitely clever. Your odds of acquiring links through outreach get a lot better when samples or other incentives are involved. B2B? No problem. Incentives could include a free trial, a demo or white paper. If you do your homework, you'll know who to approach to make sure your not just giving away hundreds of dollars of product without any hope of acquiring new customers. Your overall outreach costs could get a bit fuzzy, and measuring a return will require some serious tracking in most cases. Some tracking ideas include: Utilizing separate coupon codes for every outreach target Sending visitors to a mini-site, landing page, or tracking URL Making use of custom variables in Google Analytics to track the long term value of the campaign Who should do it? There's not much of a disadvantage in spreading the good word of your company around via public relations, so really every business should do it. Your SEO mileage may vary, however, if your business's website is not finished, a complete mess, or an otherwise unattractive linking partner. No matter how attractive your pitch, no one will want to link to a one-page or \"coming soon\" site. No matter what, you'll want to make sure you've got all your tracking ducks in a row, so that you can report good things to the big boss (wo)man. \"But what's the lifetime value?!\" Buying Links Buying links is sort of like the elephant in the room. In one hand, we have 2,000 dollars, in the other, we have a mouse that can easily point its way off to a link broker network. We can spend 10 hours max and lock down $2,000 worth of links and have them all live by COB. Do those links lead to better rankings? They might. BUT! The likelihood of these links ceasing to pass value in the near future is extremely high. Who should do it? Almost no one. Investing $2,000 into paid links, especially from a link broker, is not liable to provide a long-term return on that investment. While I agree with Rand in his post about the somewhat discouraging amount of webspam making its way into the index, the optimist in me is hoping Google's just working on some super spam detector and soon all the white-hats will be rewarded. Linkbait/viral marketing Call it what you will, but the name of the game here is content. Whether its a blog post, an infographic, a widget, a video, a funny 404 page, a comic, and so on, if its done well, there's no greater way to invest in link building. There are tons of great examples of linkbait that have cost less than $2,000, but the most recent campaign that went hot was the whiteboard HOPA girl. After conceptualizing the project, theChive put out a job listing for a \"girl next door\" model at a rate of $400 per day. Even if the shoot took 2 days, theChive probably paid no more than $1,000 to make it happen. This image brought to you by Comic Sans™. Who should do it? Most anyone. With a great idea, $2,000 is plenty of money to build some great links via content marketing. Of course, the important part is the great idea. This is where your 60 hour allotment of time may come in handy for brainstorming. If the idea can't be executed in-house, tap your network for a good resource to help, or use services like oDesk, guru, and eLance to find a freelancer. One caveat here is that your link building campaign can only go as far as your (social) network will take it. Before hitting \"publish\", make sure you've got a good seed of retweeters, rebloggers, and likers standing by. Reporting Your Results This is arguably the most important part of your SEO campaign! Keep an eye on your website's organic traffic and mark any upward trends. Can this be attributed back to your link building campaign? If so, this is no time to be shy. Best of luck! And now a quick introduction! My name is Mike Pantoliano and I work for Distilled in the US. I would love your feedback on my first post and I hope you get something from it! Follow me on Twitter @MikeCP because my complaining about having to wear shoes is absolutely vital to your SEO success. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Investing in Link Building"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Investing in Link Building"
    },
    {
      "level": "H2",
      "text": "The Budget is Set"
    },
    {
      "level": "H2",
      "text": "Directory Submissions"
    },
    {
      "level": "H4",
      "text": "Who should do it?"
    },
    {
      "level": "H2",
      "text": "Outreach (PR for links)"
    },
    {
      "level": "H4",
      "text": "Who should do it?"
    },
    {
      "level": "H2",
      "text": "Buying Links"
    },
    {
      "level": "H4",
      "text": "Who should do it?"
    },
    {
      "level": "H2",
      "text": "Linkbait/viral marketing"
    },
    {
      "level": "H4",
      "text": "Who should do it?"
    },
    {
      "level": "H2",
      "text": "Reporting Your Results"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Mike Pantoliano\n          \n            Mike Pantoliano"
}