{
  "url": "https://moz.com/blog/invest-in-long-form-content",
  "slug": "invest-in-long-form-content",
  "title": "Why SEOs Need to Invest More in Long-Form Content - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Long-form content can often be overshadowed by other forms of execution that may be considered more visually engaging. The truth is that the value of long-form content shouldn’t be overlooked because it can do so many things for a brand, including driving traffic, building authority, and building…",
  "content": "Why SEOs Need to Invest More in Long-Form Content (and How to Do It) Content Marketing | Link Building By: Paddy Moogan November 2, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Paddy Moogan November 2, 2021 Why SEOs Need to Invest More in Long-Form Content (and How to Do It) Content Marketing | Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Long-form content can often be overshadowed by other forms of execution that may be “shinier” or more visually engaging. We see it all the time in blog posts, case studies, conference decks, and on Twitter: the big, flashy content is often what our attention is drawn towards. Of course, with the right expertise and resources, you can do both. But it’s hard for many of us to execute at this level over and over again. The truth is that the value of long-form content shouldn’t be overlooked because it can do so many things for a brand: Drive trafficBuild authority and credibilityAdd value to a website as a wholeGenerate links and brand awareness The final point is one that was recently reinforced in our survey, which asked digital marketers what they felt the best form of execution was for a link building campaign: When it comes to the execution of your idea, which of the following do you find to be the most effective in generating links? These results were a little surprising because, as mentioned, it’s usually the larger, more visually appealing content pieces that generate attention. Clearly there is much more to long-form content than meets the eye. Let’s take a deeper look at this method of link building, why it works well, and how to execute it successfully. Why long-form content works well There are many reasons why long-form content can work well for a business, and brands rarely take advantage of all of them. We can often get so caught up with writing the actual content, that we forget about the related work we need to do, and lose sight of the benefits. Let’s look at some of the reasons why long-form content can work so well, along with how we can get the most from it. It’s copy-rich, and easy for Google to crawl and understand Long-form, written content is very easy for Google and other search engines to understand. This can be a stark contrast to more complex content such as data visualizations or interactive infographics. Whilst these executions can indeed look beautiful, they present an issue when it comes to Google understanding your content. This is because many of the assets that power these kinds of content pieces are things such as images, data files and JavaScript. Google is able to crawl and index the content, but interpreting it as a human would is more challenging for them. This can have an impact on two areas: The potential for interactive or visual-led content to rank well in organic search results. If Google can’t understand the context of a page, it’s much harder (but not impossible) for it to reach it’s ranking potential.Value to your website as a whole is reduced because you’re adding pages that Google may not be able to fully understand. If we contrast this with long-form, copy-led content, which is far easier to understand, we can see how it can add a lot more value from an organic search perspective. You can target a range of keywords and generate organic traffic Along with its crawlability, long-form content allows you to target a range of keywords and topics. This means that it’s possible to get your content ranking and generate traffic for a long time to come. Whilst SEO isn’t as simple as it used to be, and you can’t just drop keywords into content and expect to rank, keyword research is still very much alive and well and needs to be incorporated into the writing process and buyer’s journey. Unlike short-form content, long-form content can target keywords across an entire topic, expanding your ranking potential and audience. You can incorporate several headings and sections to do this. With Google rolling out changes that help users jump directly to the section of a page that helps them the most, along with their steps forward in understanding specific passages of a page, it’s possible to cover a range of topics within a long-form piece of content in order to generate traffic. A search like this: Can lead to a specific part of the article: Long-form content is great for doing this kind of deep dive into a topic and, fortunately, the chances of small details like this being surfaced by Google are increasing, meaning that the potential for organic traffic is increasing. Long-form content can attract links and become reference material The other, often overlooked, advantage of long-form content ranking well is that it can attract more links from third-party websites. This is because writers, bloggers, and journalists will often go searching for sources to reference in the content they’re writing and — if your content ranks well — it may be the one they choose. This is particularly true if your content includes data points or statistics that can then be referenced by other writers. For example, this huge piece of content from HubSpot on marketing statistics has attracted over 10,000 links to the page. It ranks extremely well for a bunch of keywords that someone may use when looking to reference data or statistics, which will have played a huge part in the growth of links. Not only does this mean that your brand gets more exposure to a wider audience, but the links generated can also help your organic rankings — because links are still an important part of SEO. Long-form content can be evergreen and regularly updated If you plan it effectively and the topic is evergreen, long-form content is often very easy to update and release over and over again. For example, if you run a study on a key topic in your industry in 2021, it’s often perfectly relevant to update that content again in 2022 with new study information or data. This isn’t always as easy when it comes to production of visual content or video content, where the production resources can be more intensive and expensive to change. A great example of this is Rover, who will update this list of the top 100 dog names each year: They’ve updated this content every year for the last few years, meaning that every time they do this, they have another chance to promote it and drive more traffic to the page. This also helps establish them as an authority on the topic, because users will become more and more familiar with them providing this information each year. Also, note the URL that Rover has chosen: There’s no date in it, meaning that when the time comes to update the data for 2021, they can simply update the existing page without needing to create a new one. This consolidates all of the historical social shares, links, and existing organic search rankings into a single page, making it easier for it to build strength over time. Long-form content can contain mini stories and several angles If you’re working at a brand or agency that has an in-house digital PR team, they’ll love you for this one. A long-form piece of content allows you to spin out multiple angles and stories that may be used for promotional purposes. Again, Rover are a great example of this because within this single content piece, there are a range of angles, here is one about video games and their influence on pet names: In the same piece is another angle which focuses on pet names inspired by celebrities: From a PR perspective, this layout means you have multiple ways to promote a single piece of content. This not only gives you more websites to target with your outreach, but it de-risks the content, because if one angle fails, you have more to use to try and get links and coverage instead. How to execute long-form content Now that we’ve looked at some of the reasons why long-form content can help your brand, let’s look at some of the key points to remember if you or your team are going to create such content. Agree on the core topics you want to write about Start with the basics: what do you want to write about? It can be easy to go off-piste very quickly whilst brainstorming, and while making connections between ideas isn’t a bad thing, you need to be able to focus on topics that follow this structure: 1. What do you have the credibility to talk about? What is the collective knowledge, wisdom, and experience of your company? What are the topics that you can credibly talk about that no one else — or very few others — can? The thing to avoid here is coming up with topics that appear to sit too far away from what your brand does. If someone looks at your topic and asks “why are they talking about that?”, then you may have a problem. 2. What topics will resonate with your audience? Think about the topics that your audience wants to read and learn about. What problems or challenges do they have that you can help educate them on? Put yourself in their shoes and ask what they’d expect to read when they visit your website. 3. What do you want to be known for? Finally, what topics does your brand want to be known for? This is an important question because you may well have topics that resonate with your audience and that you’re credible to write about, but do you want to? This is especially important if your company is trying to change the perception of itself, or perhaps expand into new areas or product lines. What’s the right execution? It could well be that long-form content isn’t the best way to execute your idea. The worst thing you can do is start the process by saying “I want to produce a 5,000-word article” or “I want to produce a video”, because you’ll shoehorn your idea into this format, even if it’s not the best way to communicate it. A good way to figure out if long-form content is the best way to execute your idea is to start planning the structure of the piece. You’ll quickly get an idea of what you want to say, and if it quickly grows into lots of different points and angles that fit within the core topic, long-form content may well be the way forward. Alongside this, put yourself in the shoes of the audience again and ask if long-form content is what they’d expect to find if they looked for information on this topic. Or would they be expecting something much shorter and succinct? Is it even a topic that requires lots of detailed copy? See what’s already out there Building on the previous point, you should be sure to assess what is already out there, in particular what Google is showing on page one of its results. Google is very good at understanding what their users are looking for and will craft their search results (particularly page one) to meet their expectations. During the course of your research, note what Google is showing on page one, it could be a mix of e-commerce results, short content, long content, videos, research papers, etc. Ask yourself if long-form content is likely to fit within what’s already there. You can also do this really quickly using a tool like Thruuu, which can take a keyword and tell you a bunch of things about page one of search results, including things such as: Whilst you may not want to match all of these, it gives you a great insight into the types of pages that Google is already ranking for this keyword. In addition, you should also assess whether you feel that you can produce a piece of content that’s a step above what’s already out there. If you look at what already exists and feel that the job has been done pretty well already, you may be better off focusing on a different area or looking for ways to expand the topic to add more value. Assess your resources Wanting to do this type of content is all well and good, but can you actually produce it? Do you have skilled copywriters, editors, and designers on your team who can take your idea and bring it to life? Can you do any of this yourself? If not, it’s not the end of the world, but you may have to look externally and engage with freelance specialists to help you instead. The important thing is to be honest about what you and your team are capable of doing. If you need a specialist, don’t be afraid to go and find one, because the final product will be much better for it. In summary To wrap up, the value of long-form content is clear: it can add value to your brand in a number of ways, some of which are not immediately obvious, but are hopefully clearer to you now. These insights should enable you to take advantage of them and improve your outputs. Ultimately, it’s always about the quality of the idea and the way you execute. An amazing execution is unlikely to save a bad idea, while a great idea is unlikely to get the attention it deserves if it’s executed badly. Focus on these two areas and everything else will be much easier. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why SEOs Need to Invest More in Long-Form Content (and How to Do It)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why SEOs Need to Invest More in Long-Form Content (and How to Do It)"
    },
    {
      "level": "H2",
      "text": "Why long-form content works well"
    },
    {
      "level": "H3",
      "text": "It’s copy-rich, and easy for Google to crawl and understand"
    },
    {
      "level": "H3",
      "text": "You can target a range of keywords and generate organic traffic"
    },
    {
      "level": "H3",
      "text": "Long-form content can attract links and become reference material"
    },
    {
      "level": "H3",
      "text": "Long-form content can be evergreen and regularly updated"
    },
    {
      "level": "H3",
      "text": "Long-form content can contain mini stories and several angles"
    },
    {
      "level": "H2",
      "text": "How to execute long-form content"
    },
    {
      "level": "H3",
      "text": "Agree on the core topics you want to write about"
    },
    {
      "level": "H4",
      "text": "1. What do you have the credibility to talk about?"
    },
    {
      "level": "H4",
      "text": "2. What topics will resonate with your audience?"
    },
    {
      "level": "H4",
      "text": "3. What do you want to be known for?"
    },
    {
      "level": "H3",
      "text": "What’s the right execution?"
    },
    {
      "level": "H3",
      "text": "See what’s already out there"
    },
    {
      "level": "H3",
      "text": "Assess your resources"
    },
    {
      "level": "H2",
      "text": "In summary"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    }
  ],
  "author": "Paddy Moogan\n          \n            Paddy Moogan\n          \n            Paddy Moogan"
}