{
  "url": "https://moz.com/blog/invest-structure-online-communities",
  "slug": "invest-structure-online-communities",
  "title": "How (and Whether) to Invest in and Structure Online Communities - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Should you put time and effort into building a vibrant online community? What are the benefits from a brand, SEO, and content marketing perspective? In this edition of Whiteboard Friday, Rand answers all your questions about investing in and structuring an online community, including whether it's…",
  "content": "How (and Whether) to Invest in and Structure Online Communities Community Management | Whiteboard Friday By: Rand Fishkin February 23, 2018 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 23, 2018 How (and Whether) to Invest in and Structure Online Communities Community Management | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Building an online community sounds like an attractive idea on paper. A group of enthusiastic, engaged users working on their own to boost your brand? What's the hitch? Well, building a thriving online community takes a great deal of effort, often with little return for a very long time. And there are other considerations: do you build your own platform, participate in an existing community, or a little of both? What are the benefits from a brand, SEO, and content marketing perspective? In this edition of Whiteboard Friday, Rand answers all your questions about building yourself an online community, including whether it's an investment worth your time. Click on the whiteboard image above to open a high-resolution version in a new tab! &amp;amp;lt;span id=\"selection-marker-1\" class=\"redactor-selection-marker\"&amp;amp;gt;&amp;amp;lt;/span&amp;amp;gt; Video TranscriptionHowdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week, we're chatting about how and whether to invest in and structure online communities. I want to say a thank you to @DaveCraige on Twitter. Dave, thank you very much for the question, an excellent one. I think this is something that a lot of content marketers, web marketers, community builders think about is, \"Should I be making an investment in building my own community? Should I leverage someone's existing community? How can I do that and benefit from an SEO perspective and a content marketing and a brand awareness perspective?\" So we'll try and tackle some of those questions today on Whiteboard Friday. Strategy first!First off, before you go and invest anywhere or build anything, I urge you to think strategy first, meaning your business has goals. You have things that you want to accomplish. Maybe those are revenue growth or conversions. Maybe they have to do with entering a new sphere of influence or pursuing a new topic. Maybe you're trying to launch a new product. Maybe you're trying to pivot the business or disrupt yourself, change with technology. Whatever those business goals are, they should lead you to marketing goals, the things that marketing can help to accomplish in those business goals. From that should fall out a bunch of tactics and initiatives. It's only down here, in your marketing goals and tactical initiatives, that if online communities match up with those and serve your broader business goals, that you should actually make the investment. If not or if they fall below the line of, \"Well, we can do three things that we think this year and do them well and this is thing number 4 or number 5 or number 10,\" it doesn't make the cut. Online communities fit here if...1. A passionate group of investment-worthy size exists in your topic.So if, for example, you are targeting a new niche. I think Dave himself is in cryptocurrency. There's definitely a passionate group of people in that sphere, and it is probably of investment-worthy size. More recently, that investment has been a little rocky, but certainly a large size group, and if you are targeting that group, a community could be worthwhile. So we have passion. We have a group. They are of sizable investment. 2. You/your brand/your platform can provide unique value via a community that's superior to what's available elsewhere.Second, you or your brand or your platform can provide not just value but unique value, unique value different from what other people are offering via a community superior to what's available elsewhere. Dave might himself say, \"Well, there's a bunch of communities around crypto, but I believe that I can create X, which will be unique in ways Y and Z and will be preferable for these types of participants in this way.\" Maybe that's because it enables sharing in certain ways. Maybe it enables transparency of certain kinds. Maybe it's because it has no vested interest or ties to particular currencies or particular companies, whatever the case may be. 3. You're willing to invest for years with little return to build something of great long-term value.And last but not least, you're willing to invest potentially for years, literally years without return or with very little return to build something of great long-term value. I think this is the toughest one. But communities are most similar in attribute to content marketing, where you're going to put in a ton of upfront effort and a lot of ongoing effort before you're going to see that return. Most of the time, most communities fail because the people behind them were not willing to make the investments to build them up, or they made other types of mistakes. We'll talk about that in a second. Two options: Build your own platform, or participate in an existing communityYou have two options here. First, you can build your own platform. Second, you can participate in an existing community. My advice on this is never do number one without first spending a bunch of time in number two. So if you are unfamiliar with the community platforms that already exist in interior decorating or in furniture design or in cryptocurrency or in machining tools or in men's fashion, first participate in the communities that already exist in the space you're targeting so that you are very familiar with the players, the platforms, the options, and opportunities. Otherwise, you will never know whether it's an investment-worthy size, a passionate group. You'll never know how or whether you can provide unique value. It's just going to be too tough to get those things down. So always invest in the existing communities before you do the other one. 1. Build your own platform Potential structuresLet's talk quickly about building your own platform, and then we'll talk about investing in others. If you're deciding that what matches your goals best and your strategy best is to build your own platform, there are numerous opportunities. You can do it sort of halfway, where you build on someone else's existing platform, for example creating your own subreddit or your own Facebook or LinkedIn group, which essentially uses another community's platform, but you're the owner and administrator of that community. Or you can actually build your own forum or discussion board, your own blog and comments section, your own Q&A board, your own content leaderboard, like Hacker News or like Dharmesh and I did with Inbound.org, where we essentially built a Reddit or Hacker News-like clone for marketers. Those investments are going to be much more severe than a Facebook group or a Twitter hashtag, a Twitter chat or a LinkedIn group, or those kinds of things, but you want to compare the benefits and drawbacks. In each, there are some of each. Benefits & drawbacksSo forums and discussions, those are going to have user-generated content, which is a beautiful thing because it scales non-linearly with your investment. So if you build up a community of people who are on an ongoing basis creating topics and answering those topics and talking about those things in either a Q&A board or a forum discussion or a content leaderboard, what's great is you get that benefit, that SEO benefit of having a bunch of longtail, hopefully high-quality content and discussion you're going to need to do. Mostly, what you're going to worry about is drawbacks like the graveyard effect, where the community appears empty and so no one participates and maybe it drags down Google's perception of your site because you have a bunch of low quality or thin pages, or people leave a bunch of spam in there or they become communities filled with hate groups, and the internet can devolve very quickly, as you can see from a lot of online communities. Whatever you're doing, blog and comments, you get SEO benefits, you get thought leadership benefits, but it requires regular content investments. You don't get the UGC benefit quite like you would with a forum or a discussion. With Facebook groups or LinkedIn groups, Twitter hashtags, it's easy to build, but there's no SEO benefit, usually very little to none. With a Q&A board, you do get UGC and SEO. You still have those same moderation and graveyard risks. With content leaderboards, they're very difficult to maintain, Inbound.org being a good example, where Dharmesh and I figured, \"Hey, we can get this thing up and rolling,\" and then it turns out no, we need to hire people and maintain it and put in a bunch of effort and energy. But it can become a bookmarkable destination, which means you get repeat traffic over and over. Whatever you're choosing, make sure you list out these benefits and then align these with the strategy, the marketing goal, the tactics and initiatives that flow from those. That's going to help determine how you should structure, whether you should structure your own community. 2. Participate in existing communities Size/reachThe other option is participating in existing ones, places like Quora, subreddits, Twitter, LinkedIn groups, existing forums. Same thing, you're going to take these. Well, we can participate on an existing forum, and we can see that the size and reach is on average about nine responses per thread, about three threads per day, three new threads per day. Benefits & drawbacksThe benefit is that it can build up our thought leadership and our recognition among this group of influential people in our field. The drawback is it builds our competitor's content, because this forum is going to be ranking for all those things. They own the platform. It's not our owned platform. Then we align that with our goals and initiatives. Four bits of advice1. If you build, build for SEO + owned channels. Don't create on someone else's platform.So I'm not going to dive through all of these, but I do want to end on some bits of advice. So I mentioned already make sure you invest in other people's communities before you build your own. I would also add to that if you're going to build something, if you're going to build your own, I would generally rule these things out — LinkedIn groups, Facebook groups, Twitter hashtag groups. Why? Because those other platforms control them, and then they can change them at any time and your reach can change on those platforms. I would urge you to build for SEO and for an owned media channel. 2. Start with a platform that doesn't lose credibility when empty (e.g. blog > forum).Second, I'd start with a platform that doesn't lose credibility when it's empty. That is to say if you know you want to build a forum or a content leaderboard or a Q&A board, make it something where you know that you and your existing team can do all the work to create a non-graveyard-like environment initially. That could mean limiting it to only a few sections in a forum, or all the Q&A goes in one place as opposed to there are many subforums that have zero threads and zero comments and zero replies, or every single thing that's posted, we know that at least two of us internally will respond to them, that type of stuff. 3. Don't use a subdomain or separate domain.Third, if you can, avoid using a subdomain and definitely don't use a separate domain. Subdomains inherit some of the ranking ability and benefits of the primary domain they're on. Separate domains tend to inherit almost none. 4. Before you build, gather a willing, excited crew via an email group who will be your first active members.Last, but not least, before you build, gather a willing, excited group of people, your crew, hopefully via an email group — this has served me extremely well — who will be those first active members. So if you're building something in the crypto space, as maybe Dave is considering, I might say to him, hey, find those 10 or 15 or 20 people who are in your world, who you talk to online already, create an email group, all be chatting with each other and contributing. Then start your Q&A board, or then start your blog and your comments section, or then start your forum, what have you. If you can seed it with that initial passionate group, you will get over a lot of the big hurdles around building or rolling your own community system. All right, everyone. Hope you've enjoyed this edition of Whiteboard Friday, and we'll see you again next week. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How (and Whether) to Invest in and Structure Online Communities"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How (and Whether) to Invest in and Structure Online Communities"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Strategy first!"
    },
    {
      "level": "H3",
      "text": "Online communities fit here if..."
    },
    {
      "level": "H4",
      "text": "1. A passionate group of investment-worthy size exists in your topic."
    },
    {
      "level": "H4",
      "text": "2. You/your brand/your platform can provide unique value via a community that's superior to what's available elsewhere."
    },
    {
      "level": "H4",
      "text": "3. You're willing to invest for years with little return to build something of great long-term value."
    },
    {
      "level": "H2",
      "text": "Two options: Build your own platform, or participate in an existing community"
    },
    {
      "level": "H3",
      "text": "1. Build your own platform"
    },
    {
      "level": "H4",
      "text": "Potential structures"
    },
    {
      "level": "H4",
      "text": "Benefits & drawbacks"
    },
    {
      "level": "H3",
      "text": "2. Participate in existing communities"
    },
    {
      "level": "H4",
      "text": "Size/reach"
    },
    {
      "level": "H4",
      "text": "Benefits & drawbacks"
    },
    {
      "level": "H3",
      "text": "Four bits of advice"
    },
    {
      "level": "H4",
      "text": "1. If you build, build for SEO + owned channels. Don't create on someone else's platform."
    },
    {
      "level": "H4",
      "text": "2. Start with a platform that doesn't lose credibility when empty (e.g. blog > forum)."
    },
    {
      "level": "H4",
      "text": "3. Don't use a subdomain or separate domain."
    },
    {
      "level": "H4",
      "text": "4. Before you build, gather a willing, excited crew via an email group who will be your first active members."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Leave the Best Possible Negative Review for a Local Business"
    },
    {
      "level": "H3",
      "text": "Claddagh: How Local Businesses Inspire Love, Loyalty, and Friendship"
    },
    {
      "level": "H3",
      "text": "Building Better Customer Experiences - Best of Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}