{
  "url": "https://moz.com/blog/is-charity-an-impulse-purchase",
  "slug": "is-charity-an-impulse-purchase",
  "title": "Is Charity an Impulse Purchase? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Some aspects of marketing seem intuitive, yet after time passes, the reality of data collection sets in. Such is the apparent case regarding the donations-through-text process. An online post revisits the altruistic sentiments relayed by those who donated to Haiti after the destructive earthquake…",
  "content": "Is Charity an Impulse Purchase? Marketing Psychology By: Ken Wisnefski January 31, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Ken Wisnefski January 31, 2012 Is Charity an Impulse Purchase? Marketing Psychology This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Some aspects of marketing seem intuitive, yet after time passes, the reality of data collection sets in. Such is the apparent case regarding the donations-through-text process. An online post revisits the altruistic sentiments relayed by those who donated to Haiti after the destructive earthquake of two years ago. The report offers some disconcerting news for the Red Cross and other bastions of goodwill, hoping to recruit more funds through the texts of donors. Initially the text-to-give sentiment seemed successful; about $43 million was raised via 4.3 million text donations, many donors doing so immediately or soon following the prompt to give. Those numbers were impressive. It's no wonder the text-to-give process was repeated, yet not reproducing such altruistic numbers. The American Red Cross garnered $30 million via texts for Haiti, but when trying to replicate efforts for Japan ($1.2 million) and domestic tornado relief last year ($1.2 million) the texting channel did not run as plentiful. What's a bit more worthy of head scratching is the tenacity of the donors. Of those who gave and were surveyed, more than half reported dedicating little to no interest to recovery efforts thereafter, as if the donation was somewhat of an \"impulse\" purchase. In addition, only two in five surveyed, who previously gave to Haiti, gave support after the Japanese tsunami, disrupting the hopes of goodwill sources, who were hoping to \"target\" donors or somehow define a targeted \"market\" of donors. More bad news for forming an ostensible target market: More than 80% who gave to Haiti initially via text, gave no other way thereafter Only one-third who gave to Haiti, did so more than once (text contributions were limited to $10 per text) Smart phone usage is booming and connecting with users is highly championed in the online marketing world, but text-to-give does not seem to have the viral inertia showcased through Haiti's relief. What gives? Tim Ogden, a Philanthropy Action blogger, offers, \"This very much reinforces that if a charity doesn’t have something to drive what is very much an impulse decision, then text-to-give is not a particularly valuable fund-raising tool.” Suggestions and Questions: It's difficult to assess why text-to-give efforts did not replicate the success it experienced with Haiti efforts. The tenaciously waning US economy could have been a factor as well as marketing efforts aligned with the text-to-give endeavor. What the report does not feature is the logistics of the efforts. Did later efforts utilize social media outlets like Twitter and Facebook? Did bastions of goodwill contact news sources, facilitating exposure of the text-to-give efforts? Were official Web sites launched, using SEO efforts to boost search engine exposure and awareness? It would be a fault to dismiss future efforts due to the weak traction of a couple following the Haiti attempts. Ogden made a good point; text-to-give (or any on or offline effort) does not guarantee results unless it is fueled by other on and offline marketing initiatives. Marketing and connecting with targets are ongoing processes, necessitating repetition and multiple on and offline platforms. Perhaps charities should contact experienced off and online marketers rather than bank on \"impulse\" decisions. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Is Charity an Impulse Purchase?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Is Charity an Impulse Purchase?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Turn Marketing Into Meaningful Relationships — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Catering to User Behavior Shifts During Times of Economic Turbulence — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Close More Sales With Emotion-Driven SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ken Wisnefski\n          \n            Ken Wisnefski\n          \n            Ken Wisnefski"
}