{
  "url": "https://moz.com/blog/is-linkbaiting-shortsighted",
  "slug": "is-linkbaiting-shortsighted",
  "title": "Is Linkbaiting Shortsighted? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Ok masterbaiters, it is time for you take your thumbs from where they usually are -- the keyboard typing some clever missive to garner links -- to give this post a thumbs down.  You won't like it.    The Google bomb for President Bush has finally withered to a miserable failure.  Its cleverness had…",
  "content": "Is Linkbaiting Shortsighted? Link Building S By: stevenp February 11, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! S By: stevenp February 11, 2007 Is Linkbaiting Shortsighted? Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Ok masterbaiters, it is time for you take your thumbs from where they usually are -- the keyboard typing some clever missive to garner links -- to give this post a thumbs down. You won't like it. The Google bomb for President Bush has finally withered to a miserable failure. Its cleverness had a built-in time bomb waiting to boom, and perhaps linkbaiting has a bomb ticking as well. Linkbaiting: A Ticking SEO Time Bomb? I've been wondering how linkbait tactics, which are quite popular now, will affect a website's future search engine performance. SEO history is rife with proof that some technique fads fade. For example, think about how the importance of the meta keyword now compares to that in the mid 1990s. While links will likely remain important factors in search algorithms, I wonder if linkbaiting is shortsighted. Further, I wonder if successful linkbait campaigns may even backfire in the future as abrupt spikes of incoming links that run the gamut of relevance, relations, and clout are viewed by future search algorithm versions. Understanding how search engines assess links is the source of my concern. We all know that search engines consider many aspects of a link when gaging their editorial value. Not all links are created -- or are viewed as -- equal. Unsafe Linking Is The Goal First, are there any link condoms like rel=\"nofollow\" in use? This shouldn't concern this post too much since linkbait campaigns are aimed at inspiring unadulterated links. Will It Match? Second, search engines also factor in the standing of the site with the link. Salient factors include the general topic of the site, how the site topic relates to a site it links to, its overall relevance as defined by the engine, and other factors. Linkbait campaigns get a fair share of blog links, and blogs come in all shapes and colors. While I linked to Blendtec's Will It Blind? site from my personal blog, that does not mean that I blog only about blenders and kitchen appliances. How will Google or Yahoo! treat my link? Further, how many links like mine are required to equal a link from a site like Bed Bath & Beyond? A lot. It is just like my clout in telling people about the site in comparison to when NBC's Today show had Tom Dickson on while millions of people watched. I lack the audience and generally accepted authority of NBC. Granted, the whole concept is clever and was viral enough to gain Blendtec virtually free advertising -- both on and off-line, but will it jive with the search engines forever? 15 Minutes Seconds of Fame Third, search engines also factor in the frequency that a site receives links. If linkers go gang busters for a few days and then stop, what does that say about the site? Was it once relevant? Perhaps it simply was momentarily controversial but soon dropped from the collective radar screen. From what I can suss out, a steady stream of inbound links over time seems likely the best for sustainable search performance. So, when a site looses its ability to linkbait, how will its temporary spikes of incoming links affect its search engine algo mojo as time goes by? Click Here* Fourth, the anchor text of a link also helps search engines suss out what the site that the link is pointing to is about. While Google's spam czar Matt Cutts just barely defused the Google bombs for President Bush and John Kerry, anchor text will probably still influence how the spiders assess links and their targets. No offense to the mainstream blogosphere, but many bloggers aren't great at drafting link anchor text. They typically don't think like SEOs. (Personally, I'm amazed that the myriad of anchor text iterations involving \"here\" haven't affected search rankings more.) This link aspect I feel is overlooked in linkbait planning when both the present and future are concerned. Here Today; Gone Tomorrow Fifth, link stability is important. Here today; gone tomorrow. When links disappear, search engines take notice. Links disappear for many reasons like a site, page, or blog going off line or changing domains. Domain changes aren't disastrous, but sites going off line is a major cause for concern. What happens if in an unlikely event Google decides to shut down Blogger? All the links on Blogger will disappear, and a linkbait campaign that garnered many Blogger based links will all of sudden result in link loss. Also, overtime sites from major ones to very minor ones like personal pages and blogs will die. Further, many sites that do survive will remain static as bloggers quit and forget their blogs, and depending upon the site topic, their relevance will wane -- thus, sapping links' value. Moving Targets Finally, search engines tweak their algos from time to time by boosting the value of one factor while decreasing another. When it comes to link factors, a large mass of links that comes from a plethora of sources that give them varied characteristics poses a strong risk of their commonalities coalescing to wreak havoc on a site's ranking. However, I doubt that the White House is upset that President Bush's bio page has lost its top spot for the keyword phrase \"miserable failure.\" Just Concerned I do not intend to predict doom, but perhaps masterbaiters should consider more carefully the future impact of today's linkbaiting. *In the interest of full disclosure, I am in no affiliated with Click Here. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Is Linkbaiting Shortsighted?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Is Linkbaiting Shortsighted?"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "stevenp\n          \n            stevenp"
}