{
  "url": "https://moz.com/blog/is-social-media-roi-unmeasurable",
  "slug": "is-social-media-roi-unmeasurable",
  "title": "Is Social Media ROI Unmeasurable? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I'm reporting live from Pubcon Las Vegas this week, along with some of the SEOmoz team. To be honest, we’ve struggled a bit with how to cover the conference here on the blog. As someone who only hits a couple of conferences per year, I know how annoying it can be to have to hear how great an event…",
  "content": "Is Social Media ROI Unmeasurable? Social Media By: Dr. Peter J. Meyers November 11, 2009 Table of Contents Copied! By: Dr. Peter J. Meyers November 11, 2009 Is Social Media ROI Unmeasurable? Social Media I'm reporting live from Pubcon Las Vegas this week, along with some of the SEOmoz team. To be honest, we've struggled a bit with how to cover the conference here on the blog. As someone who only hits a couple of conferences per year, I know how annoying it can be to have to hear how great an event is that you already regret not being able to go to. On top of that, sometimes information that seems brilliant in context just doesn't translate into a quick blog blurb or Tweet. So, in the interest of providing value to those of you who aren’t here at Pubcon, we're going to try to take some deeper dives into the content, hopefully providing some of that context you may be missing. Is That An Elephant? No, I'm not trying to distract you. These first two days of sessions, I couldn't help but feel that there was an elephant in the room with us during the social media sessions. The enthusiasm for social media (and especially Twitter) has been stronger than ever, but we all seem reluctant to dampen that enthusiasm by talking about an uncomfortable fact - very few of us have really found a way to measure social media success. Sure, there are internal metrics for any given platform – Twitter followers, for example – but without something external to tie it to, those are little more than high scores in the social media video game. The B-word Of course, the default answer is always \"branding\". Unfortunately, much like \"engagement\", branding is too often just a distraction, an intangible excuse we use to avoid the fact that we have nothing to measure. Ironically, during a session that had nothing to do with social media, I heard something close to an answer during Q&A. No matter what you think branding is, find a way to measure it. Here are just a few possiblities: Direct brand mentions Links with brand-related anchor text Branded search volume Where's there a number, there's a path to calculating ROI. Target a Response At this morning's keynote, we had a chance to hear from the marketing departments of various Vegas hotels. Like the rest of us, these marketers are learning as they go, trying to figure out how to use Twitter and Facebook to drive real business value. Most of the hotel marketing departments see social media as a direct-response channel, and that's certainly a start. Put out a special offer through social media channels, and you can measure the response. Where there's a measurable response, there's ROI. MGM Grand's marketing head hinted at another possibility – their employees monitor Twitter to spot dissatisfied hotel guests, dispatching staff to help solve the problem. What's the natural next step? Measure this response. How many problems did they intercept? How many were they able to solve? What does solving one customer's problem equal in real dollars? All of these questions can be answered, and from those answers comes tangible value. Find a Comparison Finally, during a session about how social media and search intersect, we heard a great example from Lee Odden about how to put a value on social media. Lee mentioned that his firm drives about 15-20 major media mentions per month from social media. He estimates that this equates to paying a PR firm $10,000/month. This may not sound like metrics in the traditional sense, but it's an entirely valid approach. PR costs money to generate, and social media has replaced that value. Just Measure It When it comes to measuring social media ROI, what are we really afraid of? If I start measuring, will I have to admit that being a 307th-level Maniac on Facebook Mafia Wars isn't providing solid business value? Stop making excuses, stop mumbling about branding, and find a way to quantify social media success in real dollars. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Is Social Media ROI Unmeasurable?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Is Social Media ROI Unmeasurable?"
    },
    {
      "level": "H3",
      "text": "Is That An Elephant?"
    },
    {
      "level": "H3",
      "text": "The B-word"
    },
    {
      "level": "H3",
      "text": "Target a Response"
    },
    {
      "level": "H3",
      "text": "Find a Comparison"
    },
    {
      "level": "H3",
      "text": "Just Measure It"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}