{
  "url": "https://moz.com/blog/is-social-media-marketing-illegal",
  "slug": "is-social-media-marketing-illegal",
  "title": "Is Social Media Marketing Illegal? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The FTC (Federal Trade Commission) has some rules about online marketing that may surprise you - they certainly surprised me.\nRecently, SEOmoz's own Sarah Bird was interviewed by Eric Enge on a wide variety of contract and legal topics. As I was proudly browsing th...",
  "content": "Is Social Media Marketing Illegal? Social Media By: Rand Fishkin May 6, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 6, 2009 Is Social Media Marketing Illegal? Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The FTC (Federal Trade Commission) has some rules about online marketing that may surprise you - they certainly surprised me. Recently, SEOmoz's own Sarah Bird was interviewed by Eric Enge on a wide variety of contract and legal topics. As I was proudly browsing through the piece, I was especially curious about what Sarah had to say around marketing on social media networks: (the FTC) made clear that online advertisers are covered by rules about so called stealth marketing. This basically means that if it's not obvious that the advertiser is being paid to do this advertisement, there needs to be a disclaimer saying he or she is in fact being financially compensated. Like Tiger Woods advertising golf balls, we all know he is being paid to do that, so they don't have to put a little disclaimer up there saying \"Tiger Woods received money to do this.\" However, there are more subtle things, like if you are going through a chat room and you leave a comment on a blog about a product and link to it, it is not necessarily obvious that you have a financial association from the merchant that would require disclosure. It's considered to be material to the consumer's decision, because they never really know how much to trust this person and what they are saying about the product. The consumer's perception is going to change if they realize that that person is being paid by the company that makes that product. So if you are an affiliate for someone and you write a nice post talking about how great of a product it is, you should disclose somewhere on your site that you make money every time someone buys the product you are talking about. I think that has people really scared. In the online marketing world right now, there are people who think that that's really not a fair law. I personally think it maybe makes marketing much more difficult, and I feel like it hampers people's creativity, but it's probably a good thing for consumers to know if someone is being paid to talk about a product. So it's uncomfortable, but it's probably overall good for e-business. It will increase trust in the marketplace, which I think is always a good thing. You can read through some of the FTC's formal guidelines around product and advertising endorsement here, and check out John Bell's top-notch coverage here as well. But, essentially, when I read Sarah's reply above, I got scared. I had a great number of questions about exactly how, where and when these guidelines apply. When we in the SEO space engage in social media marketing, there's a lot of web activity that does not have explicit endorsements (and could never work if it did). Everything from posting links on Digg to leaving comments on blogs to growing corporate Facebook & Twitter accounts and beyond seems to be potentially at risk. Luckily, I was able to ask Sarah about many of these issues and get some great replies. Here were my questions and her answers (below each question as relevant): Does this mean that if a company pays you to do social media, you need to disclose your relationship in every account you create, with every post you make, with any piece of content you submit or any connection (friending) that's made? The FTC's official position is that if you're being compensated to talk about someone's product, then you need to disclose it. Unless it's really obvious from context it's a paid endorsement (like Tiger Woods). The bottom line is that it is considered misleading to consumers if you're endorsing a product, but not disclosing that you're compensated. So if your company pays you to do social media marketing, and you're posting about the product or linking to the product, then you should also be disclosing your relationship. If you're just blogging and friending people, and it's not in the context of talking about a product, then you probably don't have to disclose. Disclosure is really only relevant when you're actually pushing a product. There is a lot of other stuff that SMM may do that isn't talking about product--tweeting, friending, some non-product related blogging.... What about microsites where companies publish some viral content, and only later add their name or redirect it? The FTC rules don't talk about link buying or linking (without something more). So I doubt the new guidelines apply to things like building microsites and then re-directing them. So long as you're not talking about the product, the disclosure stuff doesn't come in. After all, how can a consumer be confused about whether you're being paid to endorse a product if you aren't selling the product in a piece of link bait. If what you're doing is purely PageRank sculpting through various, relevant link grabs--but you're not talking about the product--then I don't think this rule requires you to disclose. What about link building contracts - does the agency need to disclose to anyone they talk to (directories, resource lists, bloggers, etc.) that they're being paid to get the links (even if they don't have to pay the individual publishers)? I also don't think the new rules require you to disclose to the webmaster that someone is paying you to ask him for a link. That's not an interaction that is relevant to the consumer's perception of the product. Has the FTC said that link purchases also need disclosure? Everyone knows that sidebar links under a section called \"supporters\" or \"sponsors\" is paid, but Google demands use of nofollow - how about the FTC? Do they recognize nofollow as sufficient for saying a link is paid? The FTC doesn't specifically address link buying or or link bait in its new regulations. If someone pays you for links, then you should probably say 'sponsored link' or something if it's not obvious from context that the link was purchased. I don't think the FTC would care about follow and no-follow because consumers have no idea whether a link is followed. That's probably just a SE relevancy thing and unrelated to the FTC since they only care about whether a consumer gets the wrong impression. However, things may get a little wonky when the webmaster gets paid for the link. The webmaster should disclose that he got paid to add the link when there is a risk that it could look like an endorsement of the product. The webmaster shouldn't add the link to a 'stuff I like' list without also revealing that he got paid to put it there. He shouldn't write a blog post about how great the product is and link to it without some kind of disclosure. If he just links to it somewhere on his site, without context and with non-endorsing anchor text, then maybe a disclosure isn't necessary. It depends on the perception of the consumer. I learned a lot from this conversation, but I'll try to distill my takeaways as they relate to SMM: Most Social Media Marketing is Legal Without Disclosure Want to create accounts for your client or project at social sites, interact with the community under those accounts or build up popularity/followers? You're in the clear, and can do so without saying who's paying you or why you're engaging in those activities. It only gets hairy if/when you're leaving comments or content that endorses a product or company that's paid you to do so. For example, if SEOmoz hired a social media crew to go say nice things about our tools or post a link to them in every forum on the web where SEO was discussed, they'd need to state their relationship with us each time they engaged in that fashion. Link Builders Don't Have to Disclose Their Relationships As Sarah said, since it's not relevant to the consumer that an agency or consultant is doing link acquisition, this doesn't fall under something the FTC cares about. Google & the FTC Have Very Different Requirements About Paid Links If you buy links and put nofollow on them, that's NOT good enough for the FTC and you may be breaking the law. Instead, you need to label links that have been purchased in visual ways on the page (\"sponsored links,\" \"advertisements,\" \"supporters,\" etc.) to clearly indicate the financial relationship. Google's guidelines don't request this human-visible disclosure, but instead want those links to use rel=\"nofollow\" so they can remove the value those citations pass from their link graph. This dichotomy is certainly frustrating. Linkbait, Viral Content & Microsites Don't Require Disclosure (most of the time) Since viral content is typically free, generally not specifically endorsing a product/service and doesn't fall under the \"paid links\" issue, it's pretty safe to engage in without disclosure, whether on a subdomain, subfolder or microsite. Big thanks to Sarah for helping out, and I'm sure she'll make some time for replying to comments & questions as well. I'd also like to take this opportunity to note that for the past year, Sarah's not only been our legal blogger and chief counsel, but also our COO. She's fulfilled that role amazingly well and I'm incredibly proud of her. I know this has meant long absences from the blog, but it's awesome that I don't have to deal with our upcoming 785 page financial audit, HR issues, etc. Thanks Sarah! :-) p.s. Note that the FTC governs the United States only, so rules may vary widely in other geographies. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Is Social Media Marketing Illegal?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Is Social Media Marketing Illegal?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}