{
  "url": "https://moz.com/blog/is-tiktok-the-new-google",
  "slug": "is-tiktok-the-new-google",
  "title": "TikTok SEO: Is TikTok Going to Replace Google? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "User behavior on TikTok has been evolving as its popularity grows. We’ve seen the app go from dancing teenagers to influencing shopping behavior across the world. Now, the next step for TikTok seems to be turning into the next big search engine. What does it mean for SEOs?",
  "content": "TikTok SEO: Is TikTok Going to Replace Google? Social Media | Search Engines By: Lidia Infante August 31, 2022 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Lidia Infante August 31, 2022 TikTok SEO: Is TikTok Going to Replace Google? Social Media | Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. TikTok has absolutely taken the world by storm since 2020. And it’s not just for the kids — with over 1 billion users, it’s popular across all demographics. User behavior on TikTok has been evolving as its popularity grows. We’ve seen the app go from dancing teenagers to influencing shopping behavior across the world. Now the next step for TikTok seems to be turning into the next big search engine. Is TikTok the new Google? Short answer: no. TikTok is an internal search engine for TikTok content. It’s dedicated to a particular area of focus and a particular format: video. There are a few different factors at play in how we choose the search engine to solve our need in the moment, but at the end of the day, TikTok and Google satisfy very different search intents. Why do users search on TikTok? We’re seeing TikTok take market share from Google in verticals such as food, gardening, and travel. These are low stakes searches where the outcome is unlikely to cause you harm. Since you don’t need a perfect or factual answer, you can use TikTok to find it. TikTok’s video format makes a lot more sense if you’re looking for answers where the visual matters. Date spots in your city or a gardening tutorial are perfect searches for the platform. Another reason users choose TikTok is that the answer will always be provided by a subject matter expert, not a niche blogger. Social proof abounds, as you can assess the expertise of your source by looking at the comments and number of views, likes, and followers. A few concerns have been raised about the spread of misinformation on TikTok, as they have in most other content platforms. However, these are slightly more worrying on TikTok because it has an unprecedented potential for virality, and a large, young user base, who are more easily influenced during content discovery than during active search. Users are even searching for TikTok content on Google, with queries such as “TikTok pasta”, amassing 1,778 searches per month in the US: Branded queries on Google for TikTok content have an estimated monthly search volume of 500k in the US alone. But in the spirit of transparency, I’ll share that most of those are not PG (or even PG-13). Active search vs. content discovery There are two key behaviors on TikTok we must differentiate: active search and content discovery. Content discovery Content discovery is the main behavior on TikTok and it’s the one we’re most familiar with. It's when the user is scrolling through the app, passively hoping to find entertainment, financial advice, recipe ideas, or a new favorite beauty product. Users have been enjoying a positive content discovery experience on TikTok for years. They have found new restaurants or a selfie angle that makes them look like Kylie Jenner. This is the key to understanding TikTok’s rise as a search engine: This positive content discovery experience has earned the users’ trust. They know that the content they want to consume is on TikTok. So when the need arises, they turn to the video platform first. Active search This leads us into active search. Active search is when a user types a specific question into TikTok’s search box. On TikTok, users can seamlessly scroll through all of the content that answers their query, without having to open multiple tabs on their browser. This improves user satisfaction, reduces friction and, most importantly, teaches TikTok the best answer. More on that later. Let’s talk about psychology Persuasion resistance is a natural psychological defense when we feel like someone is trying to manipulate us into buying, doing, or thinking something. We perceive persuasion as a threat and we try to move away from it or oppose it. Over a decade ago, the online advertising industry started to worry about a decrease in the CTR of their display ads. Pop-ups got dismissed, banners went ignored. Users had caught onto advertisers: we were trying to sell them something. This triggered a phenomenon known to psychologists as persuasion resistance. Advertisers called this response “banner blindness”. As an industry, we developed four different strategies to counter this resistance to persuasion. First, we started making our ads look like they were part of the content. We called these “native ads”. Then, we started placing the ads in unexpected places, where users were less likely to be bracing themselves to be sold to. We started making ads a little bit more relevant to the context, so that they felt less intrusive.Finally, we moved into social proof, and we started leveraging the power of trust. Thus influencer marketing was born. TikTok leverages these four strategies to counter resistance to persuasion by design. How do they do it? Creators are paid for their content through the Creator Fund, based on how many views or engagement their videos get. They are incentivized to make quality, engaging content that users will enjoy, not just by making deals with brands. They regularly showcase their beauty routines, fashion, or home products, with or without a brand sponsorship. This makes affiliate or sponsored content look just like regular content.Their ads are served in exactly the same format as their regular content, with a small tag letting you know that it’s promoted content. All the videos have an identified creator, visible like and view counts, and open comments. Social proof abounds! But SEO is not paid social or influencer marketing. So why should we care? SEO is now omnichannel Putting the right content in front of users at the right time is at the core of what we do. If we want to keep achieving this goal, we must provide content where the user is looking for it. As technology integrates further into our lives, we’ve seen the rise of multisearch. Google created the term as a way to integrate their Google Lens functionality into the way we speak about search and SEO. We now search by asking our home assistant devices questions or taking a picture of a tree we don’t recognize. We search on Google Maps, on Youtube, on Instagram and even on Amazon. The days when SEO was about responding to a query in a search box are long gone. By putting our content out on TikTok and optimizing it for search, we are helping users find our content when they need it, where they want it, and in the format they chose to consume it. TikTok on the SERPs An omnichannel SEO strategy will let you interact with your users beyond your own domain, and it can help your brand take up more real estate in the SERPs. Google is trying to diversify the domains they show on search, so if you want to feature in the SERPs multiple times, you’ll have to distribute your brand’s content across different domains. TikTok’s website has over 31 million pages built programmatically around topics, hashtags, and sounds: Topic pages make up the most of their URLs and traffic, and seem to be built based on hashtags used, along with some form of machine learning consolidation of their variations. These include related videos, topics, users, hashtags, and sounds. Based on the data available on different tools, we know that this section on TikTok’s website has about 157 million monthly organic clicks. Based on the numbers alone, the benefit of having your content feature in these pages is obvious. Industries that should be on TikTok TikTok serves you content based on what the algorithm has determined you’ll enjoy, not based on who you follow. So users constantly discover new creators. The TikTok algorithm does a genuinely good job at finding your interests or helping you discover stuff that you like. These topics of interest become small niches with their own name. Much like a subreddit, TikTok has unofficial “toks”. You can find niches such as book-tok, finance-tok, food-tok, and many others. Based on the data, case studies, and some expert opinions, there are industries that can truly benefit from being on the platform and surfacing content tagged for these various “toks”: Sports teamsStreaming services and entertainersFashion and beauty brandsRestaurants and food bloggersTravel brands and influencersHome and DIY content creators and brands If you think this list reminds you of the top industries on Pinterest, you are right. TikTok and Pinterest have a lot in common. Both platforms prioritize content discovery based on your interests and serve mainly visual content. When looking at suggested searches, the value becomes clear when I start typing keywords typically associated with an informational or commercial intent: While these are personalized for each user, you can see that others are searching for content that brands or publishers have typically kept on their blogs and find valuable for their businesses. Brands looking to increase their brand awareness can benefit from being on TikTok regardless of their industry. After all, nobody expected the success Duolingo has had on the platform. @duolingo this dumpy is literally a single mom who works 2 jobs #Duolingo #fgoogletranslate #DuaLipa #Dulapeep #Dualingo #comedy #trend #twerkit_twerkit ♬ Brujeria - ✿ Conclusion Is TikTok threatening Google? No. Is it worth the attention of SEOs? Yes. Over the next few months, keep an eye out for more pieces on how to make the most of this upstart and unlikely content discovery search engine. I will be writing about the TikTok algorithm, what the search experience looks like on TikTok, and how to make sure your videos rank. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "TikTok SEO: Is TikTok Going to Replace Google?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "TikTok SEO: Is TikTok Going to Replace Google?"
    },
    {
      "level": "H2",
      "text": "Is TikTok the new Google?"
    },
    {
      "level": "H2",
      "text": "Why do users search on TikTok?"
    },
    {
      "level": "H3",
      "text": "Active search vs. content discovery"
    },
    {
      "level": "H4",
      "text": "Content discovery"
    },
    {
      "level": "H4",
      "text": "Active search"
    },
    {
      "level": "H3",
      "text": "Let’s talk about psychology"
    },
    {
      "level": "H2",
      "text": "SEO is now omnichannel"
    },
    {
      "level": "H3",
      "text": "TikTok on the SERPs"
    },
    {
      "level": "H2",
      "text": "Industries that should be on TikTok"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    }
  ],
  "author": "Lidia Infante\n          \n            Lidia Infante\n          \n            Lidia Infante"
}