{
  "url": "https://moz.com/blog/is-there-such-a-thing-as-too-much-accessibility",
  "slug": "is-there-such-a-thing-as-too-much-accessibility",
  "title": "Is There Such a Thing as Too Much Accessibility? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I've been working on a site audit for the past week or so and have come to an exhaustively thorough section regarding usability and accessibility. While I'm not denying that this sort of information is extremely valuable when optimizing a website, my question to you guys is how much information is…",
  "content": "Is There Such a Thing as Too Much Accessibility? Design By: Rebecca Kelley May 10, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley May 10, 2006 Is There Such a Thing as Too Much Accessibility? Design The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I've been working on a site audit for the past week or so and have come to an exhaustively thorough section regarding usability and accessibility. While I'm not denying that this sort of information is extremely valuable when optimizing a website, my question to you guys is how much information is too much? How much information about making a site disabled user-friendly should a client receive? How long should we wax poetic about navigation and conversions before we end up beating a dead horse? I feel like I'm starring in my own version of Groundhog's Day -- the same points are emphasized over...and over...and over again. Should we assume that we need to rub our clients' sites' weaknesses into their paying faces because it'll encourage them to make changes? Or are we being condescending in assuming that we need to tell them over and over again that their site has X amount of problems that need to be fixed pronto? After a certain point, I feel like the repetitious points start to feel like filler, but then again, I've been staring at this thing for a week now. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Is There Such a Thing as Too Much Accessibility?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Is There Such a Thing as Too Much Accessibility?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}