{
  "url": "https://moz.com/blog/is-your-content-credible-enough-to-share",
  "slug": "is-your-content-credible-enough-to-share",
  "title": "Is Your Content Credible Enough to Share? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "People don't share content that isn't credible. Credibility gets mentioned in passing as something content needs, but little has been said about how to build it. This is your guide.",
  "content": "Is Your Content Credible Enough to Share? Content Marketing | Link Building | Public Relations By: Carson Ward June 24, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Carson Ward June 24, 2014 Is Your Content Credible Enough to Share? Content Marketing | Link Building | Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Insufficient credibility undermines digital marketing, particularly among SEOs who now produce or promote content as part of their job. People won't share content that isn't credible; they know the things they share reflect on them and impacts their own credibility. While the importance of credibility gets mentioned in passing, little has been said about how to actually build it, until now.Your Guide to Establishing Credibility You build credibility by signaling to the reader that you can be trusted. The signals of trust can come from the author, the site, and from within the content itself. Each signal will appeal to different types of readers in different contexts, but they come together to make content that is credible enough to share. Rand mentioned credibility in his Content Marketing Manifesto as one of the things we need to build familiarity, linkability, and trust. Several studies have also shown credibility's critical role in promoting and sharing. So, let's build some credibility.1. Establish expert credibility Expert credibility comes from having knowledge others do not. People want experts they can understand and trust, especially when trying to understand complex or ambiguous topics like new technology, engineering, advanced science, or law.Be an expert or hire an expert with insight A Syracuse University study found \"insightful\" content was most correlated with users' estimation of a blog's credibility. You can't offer interesting insight on a subject you know very little about, so obviously you need to be an expert or hire one. Unless your expert has breaking news, he or she needs to provide quality analysis and opinion to add any value. Most successful non-news content is opinion and/or analysis, whether verbal, graphical, or textual. If you're creating video or text content for your site, the expert should also be able to clearly express complex subjects in a way readers can understand and follow. If he can't then get a content writer to interview the expert and relay the information.Source experts Do not try to give your opinion as an expert in a field where you're not one. It won't work. We've all read non-expert content on subjects where we're knowledgeable. We know what expertly-written content looks like and can easy detect pretenders. If you pretend to be an expert and get one little detail wrong, you'll blow all your credibility with the people who actually understand and influence the discussion. They won't link to or share that piece of content and they may never share any of your content again. Don't take that risk. Rather than trying to fake expertise, try finding experts and incorporating their expertise into your post. Journalists have long understood this tactic. Even journalists who are experts use quotations from other experts in both news and analysis pieces. The front page of the Washington Post's technology print section is usually littered with quotation marks and according-tos. People running blogs can easily get a quote from someone knowledgeable enough to have an opinion that matters. Experts with strong opinions usually want to share them.Be passionate to build trust The Syracuse University study and this University of Pennsylvania study show that passion is key to judgments on credibility and sharing. Readers don't just want an expert who can explain things; they want an expert who cares. Experts who know what they're talking about tend to have nuanced and sophisticated opinions about subjects they understand. Don't undercut that understanding with a shallow piece of content. Expert pieces should be deep and thoughtful. Legal experts who really care about Citizens United vs. Federal Election Commission simply wouldn't take the time to write a bland essay on what the ruling said and how it might impact the future of politics. SEO experts don't want to report on the fact that Google penalized guest post networks. They care, and want to explain why it's good or bad. Expert opinion shouldn't be confused with argument, and it doesn't require you to start a firefight with anyone who's taken the other stance.Cite sources Cite the sources for all your expert insight. Citing expert sources is the most obvious way to back up your claims and gain trust. Often citing a source is as simple as linking to the webpage from which you got your information. Don't use weasel words like, \"it has been said,\" or, \"many people believe,\" to skirt the citation responsibility. Experienced writers and editors instinctively close the tab on any content attempting to unnecessarily blur their sources.Show data Sometimes, instead of breaking news, you can add to it with data. Data lends credibility to your post in a unique way because with numbers, your sources and methodology are more important than the author's history and popularity. The data, if it's compiled and analyzed correctly, speaks for itself. For example, when the CableTV team heard about the potential Comcast/Time Warner merger, we knew simply sharing the news would be a waste of time. Every major news outlet would easily drown out our site, and opinion pieces where popping up everywhere. Instead, we crunched some numbers, comparing U.S. Census data with coverage data, producing a coverage and population analysis people could see and understand. A few large news organizations used the data in ongoing analysis, Reddit's founder (Alexis Ohanian) shared the post, and roughly 60,000 people ended up seeing it. JavaScript libraries and HTML 5 tools are springing up everywhere to help non-technical users visualize data in interesting ways. Mapping examples include SimpleMaps (used in our post), MapBox, Google Fusion Tables, etc. Graphing and other data options are all over, but this site is a good place to start. Compile data in-between writing stories related to your niche with Census data or any of these data sources so you're ready to go when news hits. For more tips, Kane Jamison always has tips on data-driven content marketing, including the presentation below: Cost Effective Data-Based Content Marketing from Kane Jamison 2. Harness hierarchical credibility Hierarchical or rank-based credibility comes from a person's position or title. High-ranking members of an organization have a better chance of being taken seriously simply by nature of their perceived authority, especially when the organization is well-known.Have important people write important things People lend more credibility to an article written by an unknown CEO than a writer they don't know—even if the writer knows more about the topic than the CEO. For better or worse, people are simply influenced by official job titles and standing within hierarchy. Your definition of what's important may vary. Almost everything on the popular 42floors blog is written by a founder, while CEOs of larger companies will probably have less time and less interest in regular blogging.Use executives for guest posts I know – I'm the guy who wrote guest posting had gone too far. Google thought so too based on its latest round of penalties. I believe, however, the lack of credibility and expertise in many guest articles was a major cause for Google's (perhaps disproportionate) response to guest blogging networks. Don't waste an executive's time on small unknown sites no one would ever read. Instead, consider pitching an article written by an executive or other well-known figure to well-known sites. Trulia is a good example with high-ranking members adding guest posts for Google, The Wall Street Journal, and interviewing with sites like Business Insider. Moz, of course, is another place to see founders adding posts and video frequently.Better job titles If you want your content to be shared, make your authors experts in both title and in truth. Changing titles for title's sake may sound stupid, but titles like managing editor, [subject] correspondent, [subject expert], or even [subject] writer have more gravitas than a plain \"author\" or \"contributor.\" Think about what the title says to a person reading your content (or email). The flip side: writers should actually be subject-matter experts. You should also re-think giving quirky titles to everyone, as they can hurt credibility. I can't imagine the Wall Street Journal quoting a \"digital ninja\" or \"marketing cowboy\" in their story – unless that story is about job titles.Leadership quotes You can also make use of another person's position to lend credibility to your content. This works especially well if you're looking for insight into a recent news event. Quotes from company executives, government officials, and other high-title positions give you something unique and show you're not just another blogger summarizing the news built on someone else's journalism.3. Seek referent credibility When someone trustworthy shares something with positive sentiment, we immediately trust the shared item. The referrer lends his or her credibility to the referee. The Moz audience will have no problem understanding referent credibility, as it's the primary method Google uses to prioritize content that seems equally relevant to a user query. People also rely on referent credibility to decide whether a post is worth sharing. Those referrals build more credibility, and viral content is born. How do you get some referent credibility to radiate onto your content?Publish on credible sites This post will receive some measure of credibility simply by being published on the main Moz blog. Anything on or linked to from well-known sites and authors receives referent credibility.Share referrals and testimonials You'll commonly see \"as featured on\" lists or testimonials from recognizable personalities. Testimonials from anyone at Google or Microsoft with an impressive-sounding position could go a long way for a B2B product. Referent credibility is the reason celebrity endorsements work. Leveraging referent credibility in a press push generally works well if your company is involved in something newsworthy. Consider requesting and using quotes from relevant and well-known people in press releases or even outreach emails if you've done something worth announcing. Analysis pieces are a little trickier: pointing out past coverage can lend some credibility to a blog post or press release, but it can also look a little desperate if done incorrectly. High relevance and low frequency are key. A good offline analogy is that person who mentions that time they met a celebrity every chance they get, whether it's relevant or not. Name-droppers are trying (too hard) to build credibility, but it's actually just sad and annoying. The same celebrity encounter might actually generate interest and credibility if it's relevant to the conversation and you haven't told the story to death. Feel free to talk about times well-known people shared or endorsed you, but make sure it's relevant and don't overdo it.Appeal to credible people When a well-known person shares your content, more links and shares often follow. Find credible people, see what they talk about and share, and then try make something great that appeals to them. This idea has already been covered extensively here on Moz.4. Take advantage of associative credibility People make associations between one trait and another, creating a Halo effect. For example, several studies (1, 2, 3) have found that attractive people often receive higher pay and are seen as more intelligent, when in reality there is no correlation. Users do the same thing with websites, so making your website look and feel like other credible sites is important.Use trusted design as a guide Don't run in and steal the Times' CSS file. I'm pretty sure that's illegal. It's also probably not going to work unless you're running a national multi-channel newspaper. But you should be aware that people associate design elements on a site with the credibility of the site. You can help or hinder your credibility through web design in hundreds of ways. Start by looking at legitimate sites and incorporating some of their design elements into your own. Then check out some untrustworthy and unknown sites to see the difference and determine what to avoid. Obviously you want your site to be unique, but be carefully unique. If you stray from trusted convention, know why you're doing it. Maybe you want to kill hamburger icons on mobile – just make sure you have a well-considered alternative.When in doubt, test Split tests tend to focus on conversion and sales, and too often the blog/news design gets dragged along for the ride. Given the importance of content and sharing on visibility, testing the impact of site elements on sharing should be as important as the tests we do on sales funnels. You can test different design elements as they relate to sharing by creating posts and pages with a page-level variable and a canonical tag back to the original post. Always test URLs with variables against other URLs with variables to account for site owners manually removing them. This setup may also be useful for testing different content promotion channels and methods. Tracking results externally requires a different URL. You may use a modified URL rather than a variable, but only for single-page tests. Note that results will be a little erratic with variables people might remove, but trends will still emerge.Consider your domain name You have probably read a news article and wanted to share it, but then looked for a more reputable source to post to Reddit or Twitter. Sometimes I'll share content from a site I've never heard of, but usually I want the content I'm sharing to come from a site with a name that evokes trust. Everything in this article goes into a decision on whether to share, but domain name is a surprisingly large factor. When I post an article, I don't want the first response or comment to be something snarky like, \"Oh, according to goodbusinessnews4u.com – sounds legit.\" Domain will also impact click-through on social networks and social sharing sites. A couple years ago I wrote about choosing the right domain for your branding strategy, and I think its message still holds true. Domain name will also influence what content seems appropriate. You don't want people asking, \"Why is highspeedinternet.com writing about cooking recipes?\" Make sure content strategy aligns with your domain and branding strategy.Write like a writer; build profiles You must have credibility in your writing if you want your content to be shared. Follow these simple tips: Write clearly, hire writers, or don't waste your time on text content. Even a credible expert will have a hard time being trusted enough to share unless they write clearly with native-level grammar. Build author profiles, use full names, and use author images. Nothing says, \"I'm not proud of this\" like a partial name without an image. Build a full section about your company. Be as specific as possible, and avoid vague statements on the value your site adds. Craft headlines that are easy to follow, avoid trick/cute headlines unless you have a great reason for tricking or confusing users about what the content will deliver. Be consistent with surrounding articles. Jumbled topics and unrelated surrounding articles make sites look inconsistent.Avoid clip art and stock images Just ask Ian Lurie what he thinks about stock images. When I wrote \"How Google's Algorithm Silences Minority Opinions\" I had the image in my head of Googlebot placing a gag on a user. Thankfully one of CLEARLINK's talented designers had a better (and less aggressive) idea: A Google logo would have been easy, but boring. The custom image added a strong visual to the argument, emphasizing key points: a computer algorithm silencing a person, the person not caring too much. It also sent the associative message to users that the site is legitimate enough to use unique images. Most of us can't get custom illustrations or photographs for each post, but you should consider it for high-investment pieces or pieces you think have a good shot at success.Final thoughts Unless you have inside information on a rumor or are willing to burn your credibility going forward, your content must project credibility. Smaller sites and lesser-known brands have the most to gain by understanding how users and journalists make judgments on credibility and working to improve those factors. You don't necessarily need to employ every strategy and tactic, but the best coverage and links will always require a high level of credibility. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Is Your Content Credible Enough to Share?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Is Your Content Credible Enough to Share?"
    },
    {
      "level": "H2",
      "text": "Your Guide to Establishing Credibility"
    },
    {
      "level": "H2",
      "text": "1. Establish expert credibility"
    },
    {
      "level": "H3",
      "text": "Be an expert or hire an expert with insight"
    },
    {
      "level": "H3",
      "text": "Source experts"
    },
    {
      "level": "H3",
      "text": "Be passionate to build trust"
    },
    {
      "level": "H3",
      "text": "Cite sources"
    },
    {
      "level": "H3",
      "text": "Show data"
    },
    {
      "level": "H2",
      "text": "2. Harness hierarchical credibility"
    },
    {
      "level": "H3",
      "text": "Have important people write important things"
    },
    {
      "level": "H3",
      "text": "Use executives for guest posts"
    },
    {
      "level": "H3",
      "text": "Better job titles"
    },
    {
      "level": "H3",
      "text": "Leadership quotes"
    },
    {
      "level": "H2",
      "text": "3. Seek referent credibility"
    },
    {
      "level": "H3",
      "text": "Publish on credible sites"
    },
    {
      "level": "H3",
      "text": "Share referrals and testimonials"
    },
    {
      "level": "H3",
      "text": "Appeal to credible people"
    },
    {
      "level": "H2",
      "text": "4. Take advantage of associative credibility"
    },
    {
      "level": "H3",
      "text": "Use trusted design as a guide"
    },
    {
      "level": "H3",
      "text": "When in doubt, test"
    },
    {
      "level": "H3",
      "text": "Consider your domain name"
    },
    {
      "level": "H3",
      "text": "Write like a writer; build profiles"
    },
    {
      "level": "H3",
      "text": "Avoid clip art and stock images"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Carson Ward\n          \n            Carson Ward\n          \n            Carson Ward"
}