{
  "url": "https://moz.com/blog/its-not-enough-to-promote-yourself-promote-your-supporters",
  "slug": "its-not-enough-to-promote-yourself-promote-your-supporters",
  "title": "It's Not Enough to Promote Yourself: Promote Your Supporters - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As a blogger, the first lesson I learned was to get good links and the subsequent traffic you need to identify and help bloggers higher up on the food chain than yourself. This can be done in many ways, including frequently linking to their blog, adding value to the conversation (leaving insightful…",
  "content": "It's Not Enough to Promote Yourself: Promote Your Supporters Public Relations J By: John Konrad January 9, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! J By: John Konrad January 9, 2009 It's Not Enough to Promote Yourself: Promote Your Supporters Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. As a blogger, the first lesson I learned was to get good links and the subsequent traffic you need to identify and help bloggers higher up on the food chain than yourself. This can be done in many ways, including frequently linking to their blog, adding value to the conversation (leaving insightful comments) and writing posts that will best serve their readership. No matter the approach you take, the following two principals must be followed: Help them more than you help yourself Invest both hard work and time into the relationship This is not an easy concept to follow and does not have a perfect success rate, but it has been the cornerstone of the most beneficial relationships I have built. So What Does This Have to Do with SEO? With the great tools SEOmoz provides, including the new features in Linkscape, you can easily identify the source of your page rank and authority. Now, if you're like me, much of your time has been spent optimizing your site and finding the next big link, but what about existing relationships? In a study of the links pointing to my site I made two interesting discoveries. First, many of the sites linking have paid little or no attention to SEO. Second, a few of the sites had other properties or relationships with other publishers that had considerably higher authority. So I made a decision to drastically alter my schedule and carve out nearly 50% of the SEO time I have been spending on my own sites and give it to the people who have, through links, helped build my authority. The results have been impressive. In a short few months I was able to nudge one partner from a PR5 to 6 and double the number of pages he had indexed. This publisher was so happy, in fact, that he gave me direct access to his account and encouraged me to alter links at will. Continuing my good will, I took the liberty to nofollow spam sites in my niche and increase the number of links pointing to other providers of quality content. A quick note to these firms landed me requests to help them out as well. I am still in the early stages of implementing this idea but am encouraged by the possibilities. Want to know my New Year Resolution? Seek out and help other sites in my niche that provide quality content but are struggling with SEO. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "It's Not Enough to Promote Yourself: Promote Your Supporters"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "It's Not Enough to Promote Yourself: Promote Your Supporters"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "John Konrad\n          \n            John Konrad"
}