{
  "url": "https://moz.com/blog/its-a-link-jim-but-not-as-we-know-it",
  "slug": "its-a-link-jim-but-not-as-we-know-it",
  "title": "It's a Link, Jim, But Not As We Know It - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Link building is without doubt the most powerful driver of search engine rankings and as such has become the most abused. Not so long ago reciprocal links were the SEO’s stock in trade greatly influenced by the hallowed teachings found within Page and Brin’s original PageRank document. In their…",
  "content": "It's a Link, Jim, But Not As We Know It Link Building S By: Scotie July 15, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! S By: Scotie July 15, 2008 It's a Link, Jim, But Not As We Know It Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Link building is without a doubt the most powerful driver of search engine rankings, and as such has become the most abused. Not so long ago reciprocal links were the SEO’s stock in trade, greatly influenced by the hallowed teachings found within Page and Brin’s original PageRank document. In their ongoing quest to deliver the most relevant results, search engines devalued links that are deemed to be gaming their ranking algorithms. Authority There are over a million pages on the web that use the term ‘Harvard'. The website www.harvard.edu is not the one that uses the term most often or most prominently, yet it is seen as the most authoritative. Before you reply and point out it’s an .edu, consider how the page would rank if authority were based on a text-based ranking function restricted to on-page factors. By analyzing the link structure that connects web pages, search engines can address this issues. Links encode human judgment and editorial control which confers authority. The creation of a link is a strong indication of the following type of judgment: the creator of page 'A', by including a link to page 'B', has in some measure conferred authority on 'B'. This offers a way to circumvent the problem where many prominent pages are not sufficiently self-descriptive. Communities can also be discovered through link analysis; two pages that are not linked together could still be deemed related to one another. Just take a look at the \"Similar Sites\" search to see this in action. Direct Edge and Indirect Edge When documents link to each other they create what is known in Information Retrieval (IR) as ‘edges'. Edges can be either direct or indirect. A direct edge is created when one document links to another; i.e., if document ‘A’ links to document ’B’, there is a direct pointing from ‘A’ to ‘B’. What this means in real terms is that ‘A’ confers authority on ‘B’ and infers that ‘A’ is related to ‘B’. What is being said here is that the page casting the vote is perceived to be related to the page receiving the vote. This is why linking to pages with an unrelated topic or from bad neighbourhoods could lower the overall trust of your site. Judgment and editorial control remain with the creator of the document, so unless you are in the porn, casino, or meds industry don’t link into these neighbourhoods. In real life we are often judged by the company we keep, and this is also true for WebPages. This is the indirect edge. Although the term ‘direct edge’ is rarely used within the SEO industry, it is in effect how we normally think about links; specifically, a vote that confers authority and anchor text that declares context. Reciprocal Links It is quite possible that the author of page ‘A’ finds the content of page ‘B’ relevant and helpful to the intended reader and creates a link to page ‘B’. The author of page ‘B’ might link back to ‘A’ for the same reason. So reciprocal links can occur naturally even where editorial control has been maintained. However, when every link, or large proportion of links, is reciprocated it displays a lack of human judgment/editorial control and reeks of manipulation. Triangulation Webmasters and SEO's were quick to respond to the devaluation of reciprocal links by creating triangulated links where site ‘A’ links to site ‘B’ in return for a link from site ‘C’. This can work well but has a few problems. You need to develop and maintain a second site with unique content of a high enough quality that would make a link attractive. If you ever link the two sites together you could expose your triangulation network. If a multitude of links pointing to one domain get a link back from another domain with similar whois details, you could expose your triangulation network. For the sake of this example, we have linked ‘B’ to ‘C’ to show how easy it is to uncover mini link networks. Even the most basic Link analysis would pick up the triangulation, starting with document ‘A’, and following the direct edges you can see that ‘A’ links to ’B’ links to ’C’ and back to ‘A’ again. This type of pattern will happen naturally; however, sites that participate heavily in triangulated links will show an unnatural level of triangulation, which is easy to spot. Here you can see a different type of triangulation where no clear path exists through the direct edges that would uncover a round robin. The creator of page ‘A’ has exercised his judgment and editorial control by creating links 'A>B' and 'A>C', conferring authority on B and C. It also infers that document B and C are related, although no direct link exists between them. On a grander scale, this is how communities are discovered. Moving to a better neighbourhood Every website needs outgoing links; otherwise, it becomes a dead end. However, linking into bad neighbourhoods can damage rankings by lowering the overall quality and trust placed in a website. Conversely, linking into good neighbourhoods can raise the overall quality of your site and raise rankings. If, for example, you have a page explaining the benefits of valid, standards compliant code, a contextual link to the w3c validation service would increase the quality of the page and the overall quality of the site. In addition to Authority Score, we feel that Google also employs a Hub Score. Hub score gauges trust and is influenced, positively or negatively, by who you link to. We know for sure that links to low quality sites can hurt you, so why not expect some credit for good linking? Lets assume that page ‘A’ is our page about the benefits of valid, standards compliant code, page ’B’ the w3c validation service, and ‘C’ was the w3schools guide to valid html, thus linking page ‘A’ to the two most authoritative, topic relevant pages on the web. When all the edges in this process are uncovered, the most obvious are those between 'A>B' and 'A>C'. Not so obvious perhaps are those indirect links between 'C>A' and 'B>A', which depicts the concept of Hub Score in action. Also note that although page ‘B’ has no direct link to or from ‘C’ and vice versa, the fact that ‘A’ links to ‘B’ and ‘C’ infers that these two documents are related. Again, this is an example of how search engines can discover communities and neighbourhoods. In my opinion, sites that don't link out because they have misguided owners who don't want to \"leak\" PR or send visitors away, even to non competitive authoritative documents that would enhance user experience, are missing a great opportunity. I am not suggesting that you just link to authority sites like CNN for no other reason than they are recognized authorities; it’s about joining a community. It is widely accepted that search engines assign authority, relevancy, and community to documents based not on their content, but on their inbound links. Note that I am using the term 'document' here in its widest sense, which could include a collection of documents or an entire site. What is less widely accepted is that who you link to (Hub Score) can also assign authority, relevancy, and community. About a year ago we worked with a travel agent who had a PR6 index page. The site was reasonably well optimised with good internal link structure and relevant backlinks, yet the site found it difficult to rank for anything other than the least competitive terms. It turned out the site was a dead end. The previous SEO company had done a great job as far as site structure and link building was concerned, but there was not one outgoing link anywhere on the site. We added a travel information section to the site consisting of 50 or so pages that linked out to websites like ABTA, Foreign and Commonwealth Office, Department of Health, etc. Many of the sites were .gov’s and .edu’s. The increase in rankings was quick and significant. In part 2 of this post I will explain a linking strategy that utilises the power of recognised authority sites to boost your own sites authority score and Hub Score. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "It's a Link, Jim, But Not As We Know It"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "It's a Link, Jim, But Not As We Know It"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Scotie\n          \n            Scotie"
}