{
  "url": "https://moz.com/blog/its-the-crosslinking-stupid",
  "slug": "its-the-crosslinking-stupid",
  "title": "It's the Crosslinking, Stupid - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Do you or a client have a site that is ranking well in Google but is nowhere to be found on Yahoo? Does it keep you up at night? And even warm milk and watching CSPAN won't help?My manager, the great Al Scillitani (you know, the dude who complained that Adwords was giving him a headache and Google…",
  "content": "It's the Crosslinking, Stupid Technical SEO N By: NathaniaJohnson February 15, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! N By: NathaniaJohnson February 15, 2007 It's the Crosslinking, Stupid Technical SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Do you or a client have a site that is ranking well in Google but is nowhere to be found on Yahoo? Does it keep you up at night? And even warm milk and watching CSPAN won't help? My manager, the great Al Scillitani (you know, the dude who complained that Adwords was giving him a headache and Google sent him some aspirin), says that whenever Google love/Yahoo negligence problem rears its ugly head, it's almost always crosslinking. But today, we realized a new client of ours was having this very problem but there was no obvious crosslinking among the sites. Until Al noticed that the site we've been tasked to optimize for was grabbing photos from another site the client owns. Could this be the secret key to unlocking such a dilemma? Time, and cooperation of the client (that's a whole other YOUmoz post), will tell. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "It's the Crosslinking, Stupid"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "It's the Crosslinking, Stupid"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "NathaniaJohnson\n          \n            NathaniaJohnson"
}