{
  "url": "https://moz.com/blog/ive-killed-eaten-my-own-cow-and-other-guerrilla-internet-marketing-techniques",
  "slug": "ive-killed-eaten-my-own-cow-and-other-guerrilla-internet-marketing-techniques",
  "title": "I've Killed & Eaten My Own Cow... And Other Guerrilla Internet Marketing Techniques - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For those of you online that really know me, and have listed me as a friend on Facebook, I’m sure you’re already familiar with a number of groups I’ve created. For example I currently have started the following groups: I Enjoy adding Random People To My Friend List Because it Boosts My Self Esteem…",
  "content": "I've Killed & Eaten My Own Cow... And Other Guerrilla Internet Marketing Techniques Social Media Z By: ZachKatkin February 6, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! Z By: ZachKatkin February 6, 2007 I've Killed & Eaten My Own Cow... And Other Guerrilla Internet Marketing Techniques Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. For those of you online that really know me, and have listed me as a friend on Facebook, I'm sure you're already familiar with a number of groups I’ve created. For example, I currently have started the following groups: I Enjoy Adding Random People To My Friend List Because it Boosts My Self Esteem (for those of you with 800+ friends) Omega Kappa Kittens (the craziest Frat ever!) I've Killed and Eaten My Own Cow (no, not really) Okay, so the above referenced groups are jokes, and in some cases offensive. In fact, I lost a bid to create the website for the vegetarian group on campus because they really believed I had killed and eaten my own cow (which probably would have been more humane, anyway). Animal politics aside, social networking sites, namely Facebook and MySpace, offer unique, guerrilla marketing opportunities. Unique ID has been a part of BNI (business network international) for a while now, and we have seen some great results. For those not familiar, BNI is an exclusive networking group. A group starts up in an area and can include one person from a particular industry. Every group member must then refer all business to the person in their group. But, we were cautioned before going in to view the members of our group not as potential clients (which of course they can become), but instead as potential sales people. These individuals, whether they've used your services or not, will reference your name in regards to the industry you are in, establish a good relationship with them, and you will establish a good relationship with their clients, their friends, their family…and soon, thousands of people will have heard your name and learned of your services. So too can social networking sites offer these same types of benefits. You connect with your friends already, why not stay in front of them in a business capacity? Use the powerful tools within networking sites to explain what you do to friends and family, to keep them abreast of the latest trends and technologies in your own industry. Facebook in particular offers great group features. It allows you to create a group about whatever topic or topics you want. Most recently I've created the Web Design and Programming group and invited many classmates, friends, even teachers into the group, where I hope to discuss problems and topics in web design or programming, offer help, and build an online community for everyone. In creating such a group, I have created value for the individuals that are apart of the group, connected with a number of like-minded, skilled, potential sales people, and finally, it is a network of valuable talent, resources, and skills that I can tap into later, perhaps as employees or referral sources. Harnessing the power of Web 2.0 doesn’t necessarily mean you have to spend copious amounts of money on web ads. Instead, I've found tremendous value in molding the connection features offered by these social networking sites into my own business. Do you have a unique (guerrilla) marketing technique that harnesses the power of Web 2.0 or uses a commonplace feature of a favorite website to drive sales and traffic? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "I've Killed & Eaten My Own Cow... And Other Guerrilla Internet Marketing Techniques"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "I've Killed & Eaten My Own Cow... And Other Guerrilla Internet Marketing Techniques"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "ZachKatkin\n          \n            ZachKatkin"
}