{
  "url": "https://moz.com/blog/javascript-in-paradise-anyone",
  "slug": "javascript-in-paradise-anyone",
  "title": "JavaScript in Paradise, Anyone? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Howdy, I am about to advertise locally (Hawaii) for a couple of projects but I wanted to tell you guys and gals about it first. I will be spending two or three thousand a month on a few JavaScript projects. If you are a Javascript Guru, me like you.It would cool to work with someone from the SEO…",
  "content": "JavaScript in Paradise, Anyone? Technical SEO P By: Patrick Sexton November 1, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! P By: Patrick Sexton November 1, 2007 JavaScript in Paradise, Anyone? Technical SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Howdy. I am about to advertise locally (Hawaii) for a couple of projects, but I wanted to tell you guys and gals about it first. I will be spending two or three thousand a month on a few JavaScript projects. If you are a Javascript Guru, me like you. It would be cool to work with someone from the SEO world, and I think all of you are aware of my work ethics: Drink. Drink again. Take naps between drinking. Every once in awhile do something brilliant. What I need is someone who knows Javascript wonderfully and preferably knows a bit of how it is used within gadgets. I have a list of ideas that I am unable to move forward on due to the fact that I am sorta dumb. I would imagine the least amount I would pay on any project would be $1,000. If we hit it off, I could see a profit sharing thing going on and a team getting started up :) Just to be clear, I am not offering a job in Hawaii. I am offering payment for projects that you could do from your home. If you think you fit the bill, email me at guidelineguy@gmail.com or call me at 808-292-6402 Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "JavaScript in Paradise, Anyone?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "JavaScript in Paradise, Anyone?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Patrick Sexton\n          \n            Patrick Sexton"
}