{
  "url": "https://moz.com/blog/job-data-for-social-media-us-uk-and-canada",
  "slug": "job-data-for-social-media-us-uk-and-canada",
  "title": "Job Data For Social Media - US, UK and Canada - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "During December 2009 and January 2010 many of you participated in an 18-question survey that Jeff Noethen and I produced to address the job landscape for web workers. We had over 600 responses from around the world, 460 from US, UK and Canada.\nHere are some of things we found.\n...",
  "content": "Job Data For Social Media - US, UK and Canada Public Relations C By: Carlos del Rio May 21, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! C By: Carlos del Rio May 21, 2010 Job Data For Social Media - US, UK and Canada Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. During December 2009 and January 2010 many of you participated in an 18-question survey that Jeff Noethen and I produced to address the job landscape for web workers. We had over 600 responses from around the world, 460 from US, UK and Canada. Here are some of things we found. Most Search Marketing Jobs Involve Social Media Approximately 85% of you are spending at least 25% of your work time in online communities. In our question we did not specify whether this time is as a representative or as an individual. Most Frequent Education Level: 4 Year College The majority of respondents (58%) hold a bachelors degree. Only 15% of respondents across all positions and organization types have advanced degrees. Salary and Benefits Most of you hold salaried positions (74%) and the most frequent benefits are paid vacations (73%) and medical insurance (61%) respondents Most Frequently Position: Manager with 5+ Years Experience and 25% of Time in Social Projects. Male managers are 2x more likely to have web design as part of their duties Female managers are 50% more likely to have blogging among their duties than their male counterparts Across all organization levels and positions women are 46% more likely to have blogging among their duties Women are also 30% less likely to be in roles that include web design or web development when they are involved in online communities. Women Have Great Opportunity in Social Media At five years of experience women are 50% more likely than men to be making over $75,000 and none of our female respondents are making less than $35,000 by 5-years of experience. Also, men are more likely to be making under $35,000 than they are to be making over $140,000 by 5-years of experience in a job that is . Visit UserDrivenChange.com see all the graphs and read more on Gender Difference in Salary Feel free to download the data we collected the zip file includes the responses separated by: Currency Corrected Gender US UK All US, UK and Canada Raw Data All Responses (XLS & CSV) All Responses (Graphic) When you use our data please attribute to www.UserDrivenChange.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Job Data For Social Media - US, UK and Canada"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Job Data For Social Media - US, UK and Canada"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Carlos del Rio\n          \n            Carlos del Rio\n          \n            Carlos del Rio"
}