{
  "url": "https://moz.com/blog/just-what-are-the-ethics-of-search-marketing-ampampamp-seo",
  "slug": "just-what-are-the-ethics-of-search-marketing-ampampamp-seo",
  "title": "Just What are the Ethics of Search Marketing & SEO? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Earlier today (08/31/2009) Rand questioned Should SEOs Spam report ...",
  "content": "Just What are the Ethics of Search Marketing & SEO? Public Relations By: Thomas Schmitz September 2, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Thomas Schmitz September 2, 2009 Just What are the Ethics of Search Marketing & SEO? Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Earlier this week Rand questioned Should SEOs Spam report competitors? Thinking about it makes me realize that I could write a whole volume about search marketing ethics. Is the statement, \"Reporting spam may hurt your fellow SEOs (gray or black hat though their tactics may be) and is thus unethical,\" correct? If someone breaks the rules, in this case the search engine terms of service, then are they acting unethically? Can reporting unethical behavior itself be unethical? Or, is it like akin to not reporting your neighbor to the police because she is stealing cars? Can you divide right and wrong conditionally? Let's say we accept that you as an SEO should not report another optimizer for using a technique you have used in the past. What if you are working on behalf of a client that never used the method or benefited from it? Are you obligated to your client or to your personal history? What about honor among search marketers? Is a code of omertà between SEO consultants a form of collusion? Is the principal of non-reporting itself unethical? You can argue for the flip-side too. Search engines are not legal authorities. Terms of service are not laws. Terms of service are written to benefit search engines, not users and definitely search marketers. Is reporting a violation of the terms of service pandering to the search engines? Is it ethical to adopt the the rules of the search engines when those rules may hurt your projects or clients? How does role affect ethics? Must each of these observe the same rules or do their different responsibilities create different sets of ethics? Independent practitioner working on her own projects In-house SEO working on behalf of an employer SEO consultant advising clients Independent service provider performing actual work on behalf of clients So what do you have to say? Which issues are you passionate about? What's your opinion concerning these issues? Do you honor search engines, clients or other SEOs? What ethical implications do you struggle with in your work and how have you resolved them? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Just What are the Ethics of Search Marketing & SEO?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Just What are the Ethics of Search Marketing & SEO?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Thomas Schmitz\n          \n            Thomas Schmitz\n          \n            Thomas Schmitz"
}