{
  "url": "https://moz.com/blog/just-another-day-at-the-office",
  "slug": "just-another-day-at-the-office",
  "title": "Just Another Day at the Office - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Want to know what a typical day at the SEOmoz office looks like? How's about I give you a sneak peek? Here's a day in the life of an SEOmozzer, from start to finish...\n\n7:15 am: Wake up\n7:45 am: Head to gym\n8:00-9:00 am: Work out\n9:00-10:00 am: Drive home, shower, get ready for work\n10:15 am: Get…",
  "content": "Just Another Day at the Office Moz News By: Rebecca Kelley November 7, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley November 7, 2007 Just Another Day at the Office Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Want to know what a typical day at the SEOmoz office looks like? How's about I give you a sneak peek? Here's a day in the life of an SEOmozzer, from start to finish... 7:15 am: Wake up 7:45 am: Head to gym 8:00-9:00 am: Work out 9:00-10:00 am: Drive home, shower, get ready for work 10:15 am: Get to office 10:20 am: Have a bagel (Blueberry. That's a good bagel.) 10:30-12:30: Read/respond to emails, edit blog/YOUmoz 12:30-1:30 pm: Take our newest hire, Sarah, out to lunch (ooh, sushi). Charge $90 (don't judge, we fed eight people) to company card (thanks, SEOmoz!) 1:30 pm: Apologize to Rand for forgetting to invite him to lunch (Oops. Aw, he looks so sad.) 1:31 pm: Decide to give Rand lunch receipt later. 1:35-2:30 pm: Start to get back on track with tasks, until... 2:30 pm: Dave Naylor pops his fookin' head in our office Happy to see us, as always 2:35-3:20 pm: Leave office to get coffee with Dave 3:25 pm: Head back to office 3:35 pm: Leave office again to get coffee with Scott and a potential client 4:15 pm: Head back to office 4:20 pm: Come in and see that during the forty five minutes I was gone, a giant piece of furniture has been ripped out of the \"pit\" and is now sitting in our kitchen The desk... ...is now in our kitchen 4:30 pm: Notice on my way to the bathroom that we have received a ransom note from the folks at Pole Position Marketing that threatens to release incriminating photos of Brock Sampson if we fail to meet their demands. (For background information about Brock, please see this post and his corresponding resume.) 4:35 pm: Wonder if Stoney deGeyter actually gets any work done, or if he just spends his days plotting ways to mess with SEOmoz 4:36 pm: Realize that I haven't gotten any work done 4:37 pm: Look over at Jane, who is actually working (on her presentation for SMX London. Look how happy she is! Being productive is good!) Jane being a diligent worker 4:38 pm: Feel guilty 4:40 pm: Look at my task list 4:40 pm: Look at the clock 4:40 pm: Think to myself, \"Ah, the hell with it,\" snap some photos, and start putting together this blog post And that, my friends, is just another day at the office. ;) [Postscript: Of course this isn't how things are typically run around here, but today was just so damn odd that I had to share. I may put up an actual \"typical day\" post soon to prove to you naysayers out there that yes, I actually do earn my paycheck. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Just Another Day at the Office"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Just Another Day at the Office"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}