{
  "url": "https://moz.com/blog/kathy-sierras-unfortunate-situation",
  "slug": "kathy-sierras-unfortunate-situation",
  "title": "Kathy Sierra's Unfortunate Situation - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A few months back I wrote a post about female bloggers, and how I don't get shaken up or outraged about the imbalance between female bloggers and male bloggers in the tech/SEO sphere. For the most part, I still stand by what I wrote, but today I'm going to (sort of) eat my words and talk about…",
  "content": "Kathy Sierra's Unfortunate Situation Content Marketing By: Rebecca Kelley March 27, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley March 27, 2007 Kathy Sierra's Unfortunate Situation Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. A few months back I wrote a post about female bloggers, and how I don't get shaken up or outraged about the imbalance between female bloggers and male bloggers in the tech/SEO sphere. For the most part, I still stand by what I wrote, but today I'm going to (sort of) eat my words and talk about Kathy Sierra's unfortunate, infuriating situation. Kathy's Creating Passionate Users blog is one of my favorite reads (and I'm not the only Mozzer who thinks so--Jeff is also a fan). She is a great writer--she's funny, knowledgeable, and engaging. Lately, however, she has been the victim of death threat comments and sexist, misogynistic, and offensive remarks and images that have been left on both her blog and on others. (To read about the situation, check out her \"Death threats against bloggers are NOT 'protected speech'\" post.) Now, I don't get offended easily. I like a good off-color, inappropriate joke. I'm not overtly feminist, race-conscious, or politically correct. I like to think of myself as an equal opportunist. But I can distinguish between a joke and actual hate speech. There is a clear difference between making a joke (Jane the Kiwi rode a whale to work!) and making comments (even if they are meant to be a \"joke\") that promote violence and degradation towards women (or anyone else, for that matter). Kathy is a woman, and she is attractive, too. But does her physical appearance grant people the right to leave lewd, sexual comments about her on her own blog? Would she be better off being overweight and unattractive? I'm betting that if she were, the comments would be just as bad (or worse). Regardless of her appearance, why should she be punished for being a smart, successful female in this sphere? Disliking Kathy's blog or what she has to say is one thing--everyone is entitled to their own opinion. Hell, I've got my (large) share of thumbs down, but it's no skin off my back. Saying \"God, that Kathy Sierra is a rambling b*tch\" is your opinion, and she has thick skin, so she can take it. However, threatening actual violence, both sexual and physical, on her, even if you're not being serious, is a whole different matter. What saddens me the most about this whole situation is that it appears that these spineless, soulless, inconsiderate, offensive assholes have gotten what they wanted. Kathy had to cancel an appearance at the ETech conference. She's afraid to leave her house. She said she may not post another entry on the Creating Passionate Users blog. These people hurt not only her, but the many, many readers who love her blog and get a wealth of valuable information from it. Would the situation have been the same if the blog were authored by a man? Hell no. Why is it then that some people seem to think that if you're female they're allowed to call you dumb, slutty, or worse, and can objectify you and treat you as less than human? I hope Kathy returns to blogging, and I hope the people responsible for all of this are found and dealt with accordingly. They have to be held responsible for their remarks--they can't assume that hiding behind a monitor gives them the right to say whatever they want without any recourse. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Kathy Sierra's Unfortunate Situation"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Kathy Sierra's Unfortunate Situation"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}