{
  "url": "https://moz.com/blog/keeping-an-eye-on-your-website-and-your-hosting-company",
  "slug": "keeping-an-eye-on-your-website-and-your-hosting-company",
  "title": "Keeping an Eye on Your Website - and Your Hosting Company - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I have had some problems with hosts lately so a couple months ago I signed up with Alertra.\nI give Alertra the URL of a tiny image and they have a server request that image every five minutes.  If they get a failure they have a couple other servers located somewhere else in the world (honest - some…",
  "content": "Keeping an Eye on Your Website - and Your Hosting Company Online Advertising E By: EGOL May 24, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! E By: EGOL May 24, 2006 Keeping an Eye on Your Website - and Your Hosting Company Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I have had some problems with hosts lately so a couple months ago I signed up with Alertra. I give Alertra the URL of a tiny image and they have a server request that image every five minutes. If they get a failure they have a couple other servers located somewhere else in the world (honest - some of these are on other continents) request the file. If these distant servers get a failure then Alertra knows that your server has the problem and its not some connection down on the web somewhere. Alertra then sends email messages to addresses you supply so you can call up your host and tell them that your box is acting up. I have messages sent to me and to my hosting company. This service has been very helpful in getting me good data about the reliability of my hosting companies and helps me get a problem solved fast. You can also configure the service to ring your cell phone if the site is down. I have not tried that because I live in a very low population area where cell phones don't work. :( or maybe :) I honestly think that a high quality hosting company would be running this type of check on their servers just to do a good job. Alerta will give you a free 30 day trial if you want to play with it and learn how it works. I did the free trial and then subscribed. Other companies provide similar services. If you find one that you like or have used let us know about it here. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Keeping an Eye on Your Website - and Your Hosting Company"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Keeping an Eye on Your Website - and Your Hosting Company"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "EGOL\n          \n            EGOL"
}