{
  "url": "https://moz.com/blog/keotag-a-clever-tag-search-tool",
  "slug": "keotag-a-clever-tag-search-tool",
  "title": "Keotag - A Clever Tag Search Tool - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Big kudos to Barry Welford who pointed out Keotag at Cre8asite. The site offers a simple search tool for single-word tags (or combinations of them). It allows for direct, quick queries to 17 different \"web 2.0\" type engines (and Google), including Technorati, del....",
  "content": "Keotag - A Clever Tag Search Tool Content Marketing By: Rand Fishkin April 28, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 28, 2006 Keotag - A Clever Tag Search Tool Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Big kudos to Barry Welford who pointed out Keotag at Cre8asite. The site offers a simple search tool for single-word tags (or combinations of them). It allows for direct, quick queries to 17 different \"web 2.0\" type engines (and Google), including Technorati, del.icio.us, Newsvine, 43 Things, etc. The interface is nothing remarkable, but it's easy to use, fast and, as I've been noting with many of the social tagging/blog search sites, returns far more timely and interesting content than your standard web search engine. It doubles as a decent competitive analysis tool, assuming you look in the right industries (tech, financial, webdev, search, photography, etc.). Sample Keotag search for \"seomoz\": Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Keotag - A Clever Tag Search Tool"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Keotag - A Clever Tag Search Tool"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}