{
  "url": "https://moz.com/blog/keyphrase-competition-and-targeting",
  "slug": "keyphrase-competition-and-targeting",
  "title": "Choosing the Right Keyphrases - Especially for the Smaller Sites! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Hey there folks! Today's post is a hands-on walkthrough of some of the decision making used when choosing the keyphrases to target. Producing a list of the most important terms in an industry is nice, but actually choosing the right keyphrases is essential. The post was largely created in response…",
  "content": "Choosing the Right Keyphrases - Especially for the Smaller Sites! Keyword Research S By: Sam Crocker June 20, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! S By: Sam Crocker June 20, 2010 Choosing the Right Keyphrases - Especially for the Smaller Sites! Keyword Research The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Hey there folks! Today's post is a hands-on walkthrough of some of the decision making used when choosing the keyphrases to target. Producing a list of the most important terms in an industry is nice, but actually choosing the right keyphrases is essential. The post was largely created in response to a question submitted by Kien in the comments of my last post. What to Expect This post should provide you with real-life examples of the keyword decision making process and help you make sense of the output from the revamped Keyword Difficulty Tool. If you're already a hardcore keyword research (and keyword difficulty) guru, this is more of a refresher, but should provide valuable insights to journeymen and perhaps a bit more transparency into how to choose the right keyphrases for your site (plus a bit of a tour for those of you who haven't used the Keyword Difficulty Tool for a while). While you may get more value from this on smaller sites, and those that are newly launched, large sites with specific keyword targets may benefit, too. Two Different Camps There are really two separate and distinct camps on keyphrase research implementation: those who always go for the highest volume search terms that are moderately relevant to a page and those that also give consideration to the competitive landscape for a certain term. Regardless of which camp you fall into, this tool can be immensely useful. If you find yourself in the \"competitive\" camp and always go after the highest volume term no matter what, the Keyword Difficulty Tool could and should still be used to track your linkbuilding efforts vs. the competition and to have some understanding of if/when you might be able to rank for the term in question. There's no point in setting goals (even if they are lofty) without having some idea of how to reach them. Image: Ebaums World However, if you are in the camp that likes quick results and has a bit more time to give to the keyphrase research process I strongly recommend going the extra mile to indentify realistic targets for the short-term and keep those lofty ambitions in the back of your mind to be addressed as a site grows, gains new links and hopefully acheives higher authority and trust metrics. But what if my site is brand new? As a general rule any newer sites should probably be aiming for the \"less-moderately competitive\" types of keyphrases for the most part. The one exception to this rule would be for exact match domain names. If you can afford to look at these metrics in this light you can scale up the competitiveness for your terms as you improve the quality and competitiveness of your website. Image from: Rand's Post on Multiple vs. Singular Keywords Thinking about it logically (with the above graphic in mind): if you could rank first for a term with 30,000 global monthly searches or somewhere on the fourth or fifth page for a similar term with 300,000 global monthly searches which would you choose? The optimist might choose the second option, but the truly intelligent will pick the first for now and aim for the second option down the road. It doesn't take superior math skills to figure out that a small fraction of 1.2% of clicks from the 300,000 searches will not amount to anywhere near 42.1% of 30,000 searches. I'm not saying it's always better to play it safe, I'm just saying that realistic goals will help you achieve more in the short term, and the opportunity to re-evaluate these goals will help you in the long term. Does this keyword require a new page? How many terms can I target on a page? This depends on a couple of factors. It depends, again, on the competitiveness of the terms but also largely depends on the strength of the overall site or page on which the keyword is being targeted. As covered in Rand's post in March on this issue, a highly competitive term deserves \"single page targeting\". This is true in most instances and particularly good advice for smaller, newer sites. The way this works is somewhat backwards, but experience suggests stronger sites can target multiple terms on a page yet also can afford to rank for a larger number of long-tail keyphrases. This may seem a bit unfair, but it is what anecdotal evidence has shown me. The long and short of it? If your site is big, unless the keyphrase is highly competitive it can probably be targeted on a page targeting other similar terms as well. However, if the phrase is extremely competitive it deserves it's own page. In the case of smaller, newer sites there are forces working against the best approach. On the one hand, smaller sites will have fewer pages indexed and will not have a great deal of authority to rely on and spread throught the site. On the other hand, this also means they cannot drop the term \"breast augmentation\" on the same inner page as \"breast enhancement\" and expect to rank for both terms. How do I know if my Site is Strong Enough to Rank for that Term? The Difficulty Tool pulls in some nice metrics from the rankings that allow you to see a fair bit of information about the other sites ranking for a particular search term or phrase. It won't always be a simple case of \"my page/domain is stronger than theirs, thus I will rank\". There will always be other factors: is the keyphrase an exact match for the Top Level Domain [TLD]? Are the other sites targeting multiple terms on the page or just the one? How many inbound links does the other page have? How relevant is this specific keyphrase to your term? I think you get the point here, it won't always be a simple fix but let's look at an example to try to get a clearer idea of how to work through this. Let's look at an example from a recent client project I did for a plastic surgeon (honest). In doing research for terms around plastic surgery for a brand new website I tried to get my head around some of the inner nuances of some of the terminology and procedures to try to better understand search behaviour. As you can see from the above research the broad match search volume for breast augmentation is considerably larger than the others [insert corny joke here], however the local search volume is quite comparable for the top two terms and they are about equally competitive. This particular area of research can be quite complicated because you also have to look at the intent of the searcher and weigh that with the product offered. The term \"boob job\" whilst funny, is probably not likely to lead to serious searchers who are considering having a selective surgery so that coupled with the lower search volume means we can probably get rid of that one for now (though it might be worth bearing in mind for future link bait). As an aside: by doing a bit further research into the types of pages that rank for the two terms and looking into search behaviours a bit it actually seems that people searching for \"breast implants\" are also not likely to be the highest converting traffic and there are certain social stigmas associated with the various terminology. So, in this case we can actually probably rule out breast implants (in terms of the main target of the top level page) because it is not likely to lead to highly converting traffic. This does not, however mean that we won't want to target the term at all, just that it may move down the priority list a touch. So, the very first step has helped us eliminate two of the terms for the time being- so we're making some progress! The next step is to compare the terms that seem as though they might both be realistic targets for the page but are also relatively similar in terms of competitiveness. Although the scores assigned by the Keyword Difficulty Tool can be very helpful when comparing a term that is ranked as a \"10\" versus one that is ranked as a \"95\" these \"difficulty scores\" do not provide enough information alone when comparing two simialrly competitive terms. Thankfully, the tool gives us a lot more data to work with. As you can see above, although \"breast augmentation\" seems to be a slightly \"less competitive\" term based on the diffculty metric there is a clear outlier within this chart (which we can go ahead and guess is going to be Wikipedia without even having the rest of the data) that looks like it will be extremely difficult to outrank even if the top spot seems slightly weaker than for \"breast enhancement.\" Similarly, the overall landscape for \"breast enhancement\" actually seems a bit more realistic as a target for a new site. Thus, in this case (based solely on the likelihood of ranking) we would actually choose to target \"enhancement\" rather than \"augmentation.\" And try to work our way up to the more difficut term by building links to the site as a whole and specifically trying to target this page before shifting our approach on the term targeting. But before we make this a final decision, let's have a slightly closer look at what the competition really looks like. As you can we were right in assuming the 5th spot for the \"augmentation\" comparison has been taken by Wikipedia, though not on a page directly targeted towards \"breast augmentation\" (hence why it's probably riding as low as it is in the rankings). Meanwhile, setting aside the Wikipedia page it looks like the top spot for \"augmentation\" is actually being held by a rather weak site that happens to have great anchor text in the domain. This is a perfect indicator of just how much benefit having a strong TLD with exact match anchor text can be, but unfortunately this sort of tactic won't help much when you're trying to land the client who wants a \"tummy tuck\" instead. So, what do we do? In an ideal world, the client would be a great big site with loads of authority and without much sense. They will have been targeting \"boob job\" and have 302'ed all of their old links so we can make some quick changes and win. In this case, we go after all of the terms, do a bit of linkbuilding and we'll probably turn out just fine. Meanwhle, in the real world situation we would recommend going for \"augmentation\" as our targeted term for a couple of reasons. Labeling/Usability Fail First, it is probably the \"best\" of the keyphrases in question. It targets the right kind of customer/searcher (we know this based on existing data and background insights on behaviour) and it has the highest search volume at the broader level. Second, this keyphrase actually makes the most sense for the page we set out to build. As a top-level page it gives us the opportunity to (over time) target some of these other terms on the page (with the exception, maybe, of \"boob job\") . Augmentation is the most generic term and will allow us to discuss \"implants, reduction, enhancement, etc.\" Third, after having looked more closely at the sites/pages currently ranking for these terms it actually seems like it will be easier to rank for this particular keyphrase (please note that Wikipedia is not even directly targeting this keyphrase in this case). \"But what about all the other keyphrases? I don't want to waste them!\" This is where the post comes full circle. If you're building the small/new site the most sensible option (in the short term) is to create a page that is optimised for as many of these pages can be justified and for which you have research. As we mentioned ealier on, you can't just go after every single keyphrase in the industry on individual pages from the get-go because they won't all be indexed. Try just to use some common sense: create the augmentation page high-up within the information architecture, construct a page for \"reduction\", \"implants\" and \"enhancements\" and forget about \"boob job\" for now. This term may get some traffic but if it doesn't fit with the theme/tone of the site then save it for the linkbait and build strong links to these inner pages now. This technique creates much more work. But with a brand new site this is to be expected. Try to structure things in a manner that you can get rid of some of the smaller pages targeting extremely similar terms without impacting usability. This is essential and will make your life much easier in the future. \"What if my client is a massive site with great links?\" We should all be so lucky. This is obviously a different ball game we're talking about here. But, if you are fortunate enough to have a Domain Authority that is considerably higher than your competitors for the keyphrase(s) in question you aren't going to struggle too much and you only need one page to rank for a number of terms. Image via: 3 Meeses If this is your starting point, I would advise creating one hub/landing page for all \"augmentation\" related terms. If your site is strong enough the Wikipedia example quite clearly illustrates that some of these other pages may be superfluous. There's no need to jam all these keyphrases in the title-tag either. If there are enough inbound links and the site is trusted enough you can probably just go for the highest search volume terms so long as the term is related to the service offered (never forget usability!), if you are in this position kick back, relax and just wait for the little guys to catch-up! Sam is based in London as a lead SEO at Distilled. He hopes you've enjoyed this post and is looking forward to your comments, questions and concerns! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Choosing the Right Keyphrases - Especially for the Smaller Sites!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Choosing the Right Keyphrases - Especially for the Smaller Sites!"
    },
    {
      "level": "H3",
      "text": "What to Expect"
    },
    {
      "level": "H3",
      "text": "Two Different Camps"
    },
    {
      "level": "H3",
      "text": "Does this keyword require a new page? How many terms can I  target on a page?"
    },
    {
      "level": "H3",
      "text": "How do I know if my Site is Strong Enough to Rank for that Term?"
    },
    {
      "level": "H3",
      "text": "So, what do we do?"
    },
    {
      "level": "H5",
      "text": "Sam is based in London as a lead SEO at Distilled. He hopes you've enjoyed this post and is looking forward to your comments, questions and concerns!"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sam Crocker\n          \n            Sam Crocker\n          \n            Sam Crocker"
}