{
  "url": "https://moz.com/blog/keyword-research-tool-accuracy",
  "slug": "keyword-research-tool-accuracy",
  "title": "Keyword Research Tool Accuracy - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For a long time, the SEO world has revolved around the idea that KW volume prediction tools could only give relative levels of accuracy, i.e. term X is more popular than term Y. These tools have never been good at fulfilling their true claim - predicting search volume.\nI set up a campaign to test…",
  "content": "Keyword Research Tool Accuracy Keyword Research By: Rand Fishkin October 17, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 17, 2006 Keyword Research Tool Accuracy Keyword Research The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. For a long time, the SEO world has revolved around the idea that KW volume prediction tools could only give relative levels of accuracy, i.e. term X is more popular than term Y. These tools have never been good at fulfilling their true claim - predicting search volume. I set up a campaign to test the predictions of KW research tools like KeywordDiscovery, Overture, Wordtracker, MSN, etc. It won't be ready to give up the data until the end of November (perhaps even later), but in the meantime, I thought it would be valuable to ask and discuss the various KW tools. Obviously, there are lots of tools that pull from these primary data sources, but I'm more interested in which you generally find to be most accurate in predicting actual search volume. I just accidentally deleted my first post here at SEOmoz (while trying to edit it), but luckily, it was also one of my worst posts ever, so it almost feels like fate... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Keyword Research Tool Accuracy"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Keyword Research Tool Accuracy"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}