{
  "url": "https://moz.com/blog/keyword-tag-cloud-generator",
  "slug": "keyword-tag-cloud-generator",
  "title": "Keyword Tag Cloud Generator - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Having spent some time looking into keywords on customer and competitor sites, I decided there must be an easier way of collecting and viewing the data?  \nChecking for keywords in page titles, headers, anchor text, image file names, etc can be quite time consuming.  \nI started to think about how…",
  "content": "Keyword Tag Cloud Generator Keyword Research N By: Nick Gunn April 27, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! N By: Nick Gunn April 27, 2010 Keyword Tag Cloud Generator Keyword Research This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Having spent some time looking into keywords on customer and competitor sites, I decided there must be an easier way of collecting and viewing the data? Checking for keywords in page titles, headers, anchor text, image file names, etc can be quite time consuming. I started to think about how useful it would be to have a tool which would crawl a site and then produce an easy way to interpret the keyword use. SEO Keyword Tag Cloud Generator is the result – a free tool which anyone can use to crawl a site and view a report on keyword placement. Now that I’ve completed the first version of the tool, I’m looking for some testing and feedback to help improve the next version. I’ve already found it useful for analyzing my own sites and would like to take it further based on the feedback I get from the SEO community. To use the tool, simply enter the URL of the site and select how many pages to crawl. The current version will then analyze keywords from Page Titles, Meta Keywords, Image File Names, Page Titles, Text, Anchor Links, H1 and H2 headers. I’ve found that Tag Clouds are an easy way to visualize term popularity, so the results are then presented in 3D version (yeah – I’m a sucker for fancy graphics). You can use the arrows, or tabs along the bottom to view reports on different keyword placements. Anyway, let me know what you think. If it proves popular I have lots of ideas on how to extend this and provide other tools which may help SEOs! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Keyword Tag Cloud Generator"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Keyword Tag Cloud Generator"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Nick Gunn\n          \n            Nick Gunn\n          \n            Nick Gunn"
}