{
  "url": "https://moz.com/blog/keyword-year-content-rankings-hack-whiteboard-friday",
  "slug": "keyword-year-content-rankings-hack-whiteboard-friday",
  "title": "The Keyword + Year Content/Rankings Hack - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Earning site traffic from competitive keywords with decent search volume doesn't always have to be a struggle. In this Whiteboard Friday, Rand shares how to make ranking for competitive keywords easier on yourself using very fresh content.",
  "content": "The Keyword + Year Content/Rankings Hack Keyword Research | Whiteboard Friday By: Rand Fishkin February 10, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 10, 2017 The Keyword + Year Content/Rankings Hack Keyword Research | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. What's the secret to earning site traffic from competitive keywords with decent search volume? The answer could be as easy as 1, 2, 3 — or more precisely, 2, 0, 1, 7. In today's Whiteboard Friday, Rand lets you in on a relatively straightforward tactic that can help you compete in a tough space using very fresh content. Click on the whiteboard image above to open a high-resolution version in a new tab! Video Transcription Howdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week we're going to chat about what is sometimes known as the keyword-plus-year hack. This is the idea that you take a keyword that has some existing search volume, and you add on a date, either a month or a month and a year, and you are able to outrank many of the other players because it's a much less competitive space. I'll show you what I'm talking about. It helps to have an example. Keyword trend graph So let's say there are a good number of people every year who search for the best web designs. They want to get design inspiration, or they just want to see what's out there. They're looking for the design gallery, so they search for best web designs. Many times, though, those folks will get results from the last 5 to 10 years, and they'll see those in there and they'll go, \"You know, I want something more modern, more updated,\" and so they will revise their query to \"best web designs 2016.\" In fact, many people even start with these queries. So they want to see the top Android games of January 2017. They want to see the best summer dishes 2017 for planning on cooking something. They're looking for something that is trendy. Maybe they're looking around fashion, or you see this a lot in searches around hairstyle or anything that is grading products or services. Who are the best real estate agents in Seattle? No, no, not the 2012 edition of \"Seattle Met Magazine.\" I want 2017. Who are the best real estate agents in Seattle 2017? So they'll add this year on there. What's great is, because this year or month only happens as it happens, those searches only happen as we get to that time period, the keyword research will not expose it to you. So if, for example, let's make this 2017, so \"best web designs 2017.\"We're filming this Whiteboard Friday in January. There have only just started to be a few searches for best web designs 2017. There have only just started to be a few any keyword searches that include the word 2017, because 2017 has just started. Therefore, your competitors are not seeing those in their keyword research list. They're not targeting them. There's not a ton of content out there yet, and so it's easier. Even though the volume tends to be lower than the usual keyword — sometimes it's higher, but usually lower — you will find it is vastly easier to rank for, and it's also the case — this is sort of beautiful — if you're using this tactic, even though it's higher in volume to have \"best web designs\" versus \"best web designs 2017,\" the one without the year, it is often the case that Google will bias to show more recent content, especially if there are lots of searches that get revised to include the temporal number or date.That is awesome because it means that you can win twice. You can rank for this one, which, of course, the search volume for it will die off at the end of the year, but you might be able to rank for this one as well. If you keep that updated, and change it up, and add to it, retire the old one, move the old one over to an old URL, put the new one up at the new URL, or keep the same URL if you're trying to build on top of the link authority that you've built to that URL, you can have some awesome ranking and traffic power. The process How do you do this? 1. Conduct keyword research using: NON-date keywords – You want to conduct the keyword research without using the date. I'm going to start with non-date keywords. So if I'm in Keyword Explorer, or if I'm doing my keyword research in AdWords, or wherever I am, I would search for \"best web design,\" get a big list of my target keywords. Last year + keywords – Then I would go look at last year numbers. For example, I would search for \"2016 best web design\" or \"best web design 2016\" or anything from my keyword export or list that includes years. 2–3 years ago + keywords – I would go two and three years ago, so that I could get a sense for the volume that includes the year. I would also be looking for month at this time. 2. Use Google Trends and/or SimilarWeb/Jumpshot Trends to ID seasonality Then I'd use Google Trends, or if you're not a fan of Google Trends — they can be a little squirrely with some data — SimilarWeb and Jumpshot also have keyword trend data, at least at the head of the demand curve, that can be good, and try and identify some of that seasonality. If you see that there's a high season that includes a particular month, that's often an indication that month plus year could be there, and then you can go and look in here. I could add \"May 2016 best web design\" to see if there was actually search volume for just the May keyword. 3. Use Google SERPs to determine if the month/year tactic is popular or underserved in your niche Then I'm going to use Google SERPs. I'm going to check the keyword difficulty of those SERPs, and I'd probably look to see how many different outlets are producing monthly or annual content. For annual content, it's really going to be very January- and February-centric. That's when it all gets produced. Then, if it is underserved, that means there's more opportunity there, but, even still, it's almost always a lower difficulty, easier to get in there. 4. Target and create that timely content So, to do that, you're going to be using: Recent data. If I were creating a page to target \"best web design 2017,\" I would want to use designs that have come out in the last month only or maybe just at the very end of 2016. Employ emerging trends and language. So maybe it's PWAs, maybe it is language around clean design, whatever the trends in the field are right now. Serve the recency of the searcher's intent by giving them the ability or showing right up front that my data and my information is very recent and that I'm helping them with what's going now, not just historically. 5. Publish as early in the period as possible You want to publish this content as early as you can in the period without doing it earlier. So what I don't want to do is have my launch be in December 2016. December is a very quiet period anyway. It's tough to get traction and attention, it's tough to build links, but it also can be the case that you won't hit the search algorithms as recency systems. Google has these algorithms called the QDF, query deserves freshness, and so if they see that you're producing that content a month or two months before it's actually the right date, there's going to be skepticism, both from users who might stumble upon it or find it, but also from engines. So you want to publish early in the period, but not any earlier than that. With this tactic, yeah, you can hack your way to some pretty awesome traffic. I look forward to hearing from all of you who've done this, who are trying it, and hear your experiences. We'll see you again next week for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com p.s. For some great examples of this in action, check out KeywordKeg's list of 2017 phrases. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Keyword + Year Content/Rankings Hack"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Keyword + Year Content/Rankings Hack"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Keyword trend graph"
    },
    {
      "level": "H2",
      "text": "The process"
    },
    {
      "level": "H3",
      "text": "1. Conduct keyword research using:"
    },
    {
      "level": "H3",
      "text": "2. Use Google Trends and/or SimilarWeb/Jumpshot Trends to ID seasonality"
    },
    {
      "level": "H3",
      "text": "3. Use Google SERPs to determine if the month/year tactic is popular or underserved in your niche"
    },
    {
      "level": "H3",
      "text": "4. Target and create that timely content"
    },
    {
      "level": "H3",
      "text": "5. Publish as early in the period as possible"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}