{
  "url": "https://moz.com/blog/keyword-sprawl-you-may-surprise-yourself",
  "slug": "keyword-sprawl-you-may-surprise-yourself",
  "title": "Keyword Sprawl: You May Surprise Yourself - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I've read more beginner SEO guides than I can count, never really being able to convince myself that I'm not a beginner anymore. One thing that appears in a lot of these guides and lists of \"SEO Facts\" online is the fact that one shouldn't optimize a page for more than a certain number of terms.…",
  "content": "Keyword Sprawl: You May Surprise Yourself On-page SEO K By: Karen Browning-Cutler August 16, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! K By: Karen Browning-Cutler August 16, 2007 Keyword Sprawl: You May Surprise Yourself On-page SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I've read more beginner SEO guides than I can count, never really being able to convince myself that I'm not a beginner anymore. One thing that appears in a lot of these guides and lists of \"SEO Facts\" online is the fact that one shouldn't optimize a page for more than a certain number of terms. This usually ranges between one and three. I agree with this if you have free reign to optimize the entire site. Unfortunately, the company I work for had a precedent of selling \"homepage optimization\" before I began working here and that was pretty much all that was offered, and all that the sales ladies were used to selling. That sounds bad, I know, but it's a web services company that deals primarily with building sites and offering hosting and advertising. SEO was an afterthought, but I'm working to correct that. So, since I've mostly been limited to optimizing homepages, I just wanted to say that there is nothing wrong with taking a stab at optimizing for up to ten or so carefully researched terms. The beauty of programs like Wordtracker is that you see these idiosyncratic combinations of words that for some collective unconscious reason a couple dozen people type every couple of months. Using these exact combinations of words in the content is sometimes all you have to do to rank inexplicably high for terms that aren't the most competitive, but that you know for sure that people have searched for and may search for again. These terms also tend not to be tied to a local term and therefore please your clients if they can find them on Google while hopefully bringing in some meaningful traffic. Surely, you focus on the most important 2-3 terms in the title, site description, and anchor text for links in directories, etc, but by sprawling the researched terms from your assuredly giant list into the content and perhaps a few appropriate alt tags, you may surprise yourself with the results. I was worried people (beginners) may be afraid to do this because of what so many of these guides say, but as long as you're not spamming, there's no reason not to. In fact, maybe there should be a contest for SEOs to see who can rank the highest for the MOST terms on a single page. I suppose it's what they call \"bang for the buck.\" Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Keyword Sprawl: You May Surprise Yourself"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Keyword Sprawl: You May Surprise Yourself"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Karen Browning-Cutler\n          \n            Karen Browning-Cutler"
}