{
  "url": "https://moz.com/blog/keyword-difficulty-tool-upgrade",
  "slug": "keyword-difficulty-tool-upgrade",
  "title": "Keyword Difficulty Tool Upgrade - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Matt's been hard at work this week, upgrading SEOmoz's KW Difficulty Tool. It's now faster, more accurate and comes with spiffier graphics. In honor, I thought it would be valuable to write a post on how to read this data:\n...",
  "content": "Keyword Difficulty Tool Upgrade Moz News By: Rand Fishkin June 29, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin June 29, 2006 Keyword Difficulty Tool Upgrade Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Matt's been hard at work this week, upgrading SEOmoz's KW Difficulty Tool. It's now faster, more accurate and comes with spiffier graphics. In honor, I thought it would be valuable to write a post on how to read this data: From the top, you can run new reports or view your existing reports from the past. We're nice enough to store all the data for you, which can really come in handy. We do require that you login and provide a Google API Key - search engines don't like the scraping and it allows us to store your reports for you. BTW - On average, it's taking between 7 and 12 minutes for a report to run, but there's no need to keep the tool open, as you can set the option to have it email you (to your SEOmoz profile email) when it's finished. The color coded chart at the top is there to provide a good reference for how competitive the term is. The percentage number provided (in the example above, 76% for \"Superman Returns\") isn't going to be precise, but it's useful for comparison purposes, and we've found, through experience, that the text chunks next to the color are pretty accurate in describing the level of work required to rank well. This list of factors gives you the breakdown of how the tool is scoring. You can see that, for example, the number of results for a search at quotes in Google gives us 29,300,000, which easily fits our criteria for 100% of the possible difficulty on that factor. For those who are seeking pure data, these numbers are pure gold. They'll also help a savvy SEO determine why one score might be unbalanced compared to another - remember, the tool isn't perfect, just useful :) The next two sectors show us the top 10 ranking pages/sites at Google & Yahoo!. We use this data to help figure out how strong these sites are and what it might take to rank in front of them. What you're seeing in the blue gradient bar is a graphic representation of toughness for each result. Yes - there are sometimes site with lower strength ranking in front of sites with higher strength (in this case, IMDB and BlueTights are both \"stronger\" than the offical movie site by our metrics), but reviewing this data can be invaluable to help see just who is in the rankings and why they're ranking so well. If you click the \"view details\" link we take you to this data: This final piece gives you a look at how we measure \"strength\" for each of the top ranked sites - checking data like how many sites link to them, their PageRank, the number of links from valuable edu, gov and mil sites and listings in places like Wikipedia, the Yahoo! Directory & DMOZ (and mentions in Google News). Hopefully you'll all enjoy using the upgraded tool. I can tell you that we find it invaluable in the day to day tasks of SEO for clients - reviewing their sites and their competition to help discover what's going on beneath the surface of the SERPs. If you've got comments, questions or suggestions, we'd love to hear them! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Keyword Difficulty Tool Upgrade"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Keyword Difficulty Tool Upgrade"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}