{
  "url": "https://moz.com/blog/keyword-research-techniques-you-might-not-use-but-should",
  "slug": "keyword-research-techniques-you-might-not-use-but-should",
  "title": "Keyword Research Techniques You Might Not Use, But Should - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Use your server or analytics search logs to find what people are looking for once on your site.The keywords used to search within your site or narrowed with search filters (by price, brand etc.) are a gold mine of fresh terms and phrases that can be used within your content and links to attract…",
  "content": "Keyword Research Techniques You Might Not Use, But Should Keyword Research By: Matt Franklin April 11, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Matt Franklin April 11, 2007 Keyword Research Techniques You Might Not Use, But Should Keyword Research This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. *note by Rebecca* This post was submitted with no author information Use your server or analytics search logs to find what people are looking for once on your site. The keywords used to search within your site or narrowed with search filters (by price, brand, etc.) are a gold mine of fresh terms and phrases that can be used within your content and links to attract those users. Track what your visitors search for on your site, see which filters are used the most, and try to incorporate those words within more of your content, page titles, inbound links, and anchor text. Heading tags are also a good place. Perform searches to find the related terms and phrases search engines recommend to you. Search engines like Google, Yahoo!, and MSN Live show related search terms on the right, bottom, or top of the results page to help you narrow down those results and get more specific within the topic you searched for. Often times these 'related searches' will only show up under broad search queries, which is natural. You can use related searches to find fresh keywords and phrases from broad to specific. Often times, if the search engines are recommending them to you, they are queried for often or commonly within that topic. Use a thesaurus or dictionary to find new terms and variations, such as plurals or stem words. This strategy is often used, but not necessarily in the correct manner. I use dictionaries and a thesaurus to find alternative search terms related to what I already use, and also to find the common forms of spelling and pluralization for my words. In general, I use the plural forms of words, but it's not always appropriate. Another good resource along these lines would be something like the Urban Dictionary, which can tell you common slang and alternative forms of spelling and speech used today. Perform interviews with actual people and ask them how they would search for what you offer. The public and general internet users are good sources to find keywords you may not have thought of using. We have all heard marketers say, \"Queries YOU might type in aren't always what OTHERS may type in.\" Fortunately, there are ways to find out other than the more traditional software and tools to tell us what is typed in the most (not saying this should replace those tools, just that you should do both). Perform interviews with friends and family members, go to your local shopping center and perform research by asking different shoppers what they might type in to find boots or shoes on search engines. In addition to getting the stats on other keywords to use, you may also find out more interesting facts about your potential users. Search yellow pages and print ads for heading words and adjectives to use with your primary terms. Both online and print yellow page publications are full of words related to industry or market niches. Many companies who list in these places have names, taglines, and categories (NAICS, SIC) related to what they do. To use this data, simply locate the sections that best describe your market, and browse the headings, categories, ad descriptions, and other text on the pages to find additional terms or adjectives to use along with the keywords you already have. Try offline methods like billboards or commercials to find words people are used to seeing and hearing. Commercials and billboards, along with other offline advertising methods, are full of the words and phrases people are used to hearing and used to seeing in their day to day activities. Take a peek at the signs in your gym, look closely at items in the grocery store, admire billboards and commercials. After you get in-tune with the lingo and presentation, you will find that many of these advertisers use words that can help you if used within your site. Type your main keywords into a search engine and look for words in the results titles and text to add. Lastly, use search engines and competitors listings to find additional keywords. Type your main keywords into a search engine and browse the titles and descriptions to find, fill, and replace. You may wish to add in words you have missed through the other methods of research, or just replace one word with another. Look for additional adjectives (discount, cheap, affordable) and phrases that can be used along with your main terms. The main phrases can be added to in order to create new phrases that are used to find what you offer. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Keyword Research Techniques You Might Not Use, But Should"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Keyword Research Techniques You Might Not Use, But Should"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Matt Franklin\n          \n            Matt Franklin\n          \n            Matt Franklin"
}