{
  "url": "https://moz.com/blog/keyword-filtering-needed-for-contextual-ad-publishers",
  "slug": "keyword-filtering-needed-for-contextual-ad-publishers",
  "title": "Keyword Filtering Needed for Contextual Ad Publishers - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I would like to make an economic argument for giving contextual ad publishers the ability to filter their ads by keyword.  \nToday I am feeling really sad about the contextual ads that have been showing on one of my websites.  I am getting ads with titles such as \"Afghanistan Sex\"...\"Pakistan…",
  "content": "Keyword Filtering Needed for Contextual Ad Publishers Paid Search Marketing (PPC) E By: EGOL December 20, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! E By: EGOL December 20, 2006 Keyword Filtering Needed for Contextual Ad Publishers Paid Search Marketing (PPC) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I would like to make an economic argument for giving contextual ad publishers the ability to filter their ads by keyword. Today I am feeling really sad about the contextual ads that have been showing on one of my websites. I am getting ads with titles such as \"Afghanistan Sex\"...\"Pakistan Girls\"...\"Pakistan XXX\"... I am also getting ads with content such as \"Locate Bars and Clubs.\" I really like contextual ads, but when they arrive with this type of content I feel a twisting pain in my gut. I'd like to become responsible for all of the content on my site - including the ads. I spend almost all of my time and energy trying building a good site on a wholesome subject and attract visitors who appreciate that type of content. However, when ads like these arrive they completely undermine the theme that my site stands for, and without a doubt have my visitors backbuttoning out and shaking their heads about me. The average visitor to my site probably doesn't understand how contextual ads work and how they are delivered. Instead, many of them think that I have some direct affiliation with these advertisers, approve of their content, and that they are paying me directly to run those ads on my site. It is also damaging to my \"brand.\" Perhaps more important is the ability to filter such ads so that children who visit our websites don't see them, or worse...click through to the pages where these ads are pointing. I've done a lot of ad filtering to stop ads like these, but I am unable to police every page of my site and every ad that appears on it. However, if I had the ability to filter about a dozen specific character strings, I would feel a lot better about my ads and my site might be more successful. I am willing to bet one month's pay that some visitors to my site have seen these ads and have done at least one of the following.... Questioned my sincerity Questioned my integrity Used the backbutton Left my site Doubted the reliability of my content Decided not to link to my site Formed a bad impression of my \"brand\" If these ads do the damage listed above, then they are hurting the success of a website and thus the income that it produces for the website owner and the income that it delivers to the provider of the advertising. Perhaps these ads are getting clicked enough to be among the ads served, but I think that the income that they bring to me is more than offset by the potential response of my visitors. They also change the way that I feel about what I am doing, and that is more important to me than the money. In many of these cases, keyword filtering is more valuable than the ability to filter a domain. The reason: Many of these ads are coming from some of the biggest names on the web - domains that also have LOTS of excellent ads that display on my site. So filtering the domain is not the most economic way to deal with this. I hope that there is an easy way for providers of contextual ads to give small publishers the ability to filter their ads by keyword. If that is hard to do, then maybe they could give us the opportunity to select an option in our account that will enable \"safe ad filtering\"...maybe landing page filtering could be added, too? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Keyword Filtering Needed for Contextual Ad Publishers"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Keyword Filtering Needed for Contextual Ad Publishers"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "EGOL\n          \n            EGOL"
}