{
  "url": "https://moz.com/blog/keyword-phrases-that-bring-conversions",
  "slug": "keyword-phrases-that-bring-conversions",
  "title": "Keyword Phrases that Bring Conversions - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A report from emarketer today - Search Query Keyword Insight - details the results of some research over the pas...",
  "content": "Keyword Phrases that Bring Conversions Keyword Research By: Rand Fishkin February 22, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 22, 2005 Keyword Phrases that Bring Conversions Keyword Research The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. A report from emarketer today - Search Query Keyword Insight - details the results of some research over the past year to analyze which types of search phrases yield the highest conversion rates. Not surprisingly, a direct correlation was found between the number of words in the phrase (query) and the liklihood of purchase - as the number of terms in the query rises, so too do the conversion rates. Most searchers are now using 3-4 words, with 2 and 5 word phrases being somewhat popular, while 1 and 6+ phrases are less common. The report also gives some insight into how users search - noting that very few searchers will attempt any of the so-called advanced operators, including quotes, link commands, allin or intitle, etc. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Keyword Phrases that Bring Conversions"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Keyword Phrases that Bring Conversions"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}