{
  "url": "https://moz.com/blog/keywords-to-concepts",
  "slug": "keywords-to-concepts",
  "title": "Keywords to Concepts: The Lazy Web Marketer's Guide to Smart Keyword Research - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Concepts have become more important for search marketing than individual keywords. Many people in the SEO space mistakenly assume that because Google withholds keyword referral data in the form of (not provided), keywords no longer matter. Nothing could be further from the truth.\n\nThe trick today…",
  "content": "Keywords to Concepts: The Lazy Web Marketer's Guide to Smart Keyword Research Keyword Research By: Cyrus Shepard January 7, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Cyrus Shepard January 7, 2014 Keywords to Concepts: The Lazy Web Marketer's Guide to Smart Keyword Research Keyword Research The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The SEO's system for themed keyword research. If Google's Penguin update and Knowledge Graph have taught us anything, it's that concepts have become more important than individual keywords for search marketing. Many people in the SEO space mistakenly assume that because Google withholds keyword referral data in the form of (not provided), keywords no longer matter. Nothing could be further from the truth. Every search begins with keywords. Over 5 billion Google searches a day. Consider the following: Google's entire business is based on selling keywords – over 40 billion dollars a year, most of it from keyword sales through advertising. (not provided) affects only post-click analytics. It doesn't influence the pre-click keywords users type into search boxes. Keywords and their meaning remain the primary input search engines use to deliver answers to users (while other inputs such as location data and app integration are on the rise). Marketers who invest in smart keyword research will continue to have a huge advantage over the competition. The trick today is turning those keywords into concepts. From single keywords to themed concepts When most of us first learned SEO, we learned to research one keyword at a time. We optimized our page for that keyword by placing it in the title tag, in the headline, a few times in the body, and maybe the alt text of a photo. If we were really fancy we'd optimize a page for two keywords. Oh dear. In truth, optimizing pages with a single keyword mentality hasn't worked well for a long time. Content today has to be about something. The difference today from years past is the shift from individual keywords to concepts. Concepts relate to search marketing in three primary ways: 1. What the user intends Search engines try to better understand what the user asks by relating that question to concepts. If I search for \"movie about tiger on boat\" Google will likely understand that I am asking about the movie Life of Pi, not about pages optimized for those specific keywords. 2. What your content is about Search engines read the keywords on your pages to try and figure out what those pages are conceptually about. 3. Relating concepts to one another The Knowledge Graph shows us how Google relates concepts to each other. In the case of Life of Pi, this may be showing how the film relates to ratings, reviews, actors, writers, and the cast. Keyword targeting: the dumb, hard way In the post How to Rank: 25 Step Master SEO Blueprint, I first addressed the concept of themed keyword research. The guide lists the biggest mistakes people make when choosing keywords. Here's what we want to avoid: Choosing keywords that are too broad Keywords with too much competition Keywords without enough traffic Keywords that don't convert Trying to rank for one keyword at a time Instead, let's take the opposite approach. The basic idea is that we're going to focus our content around ideas instead of keywords, and thus give us the potential to rank for 100s or 1000s of keywords at a time. The smart system of themed keyword research Let's explore a new way of thinking about keywords. It requires discarding some of our old ideas and taking advantage of how Google may likely decide what our content is about. To accomplish this, we'll leverage some obvious truths about search traffic. Truth #1: Over 70% of the traffic you earn for any given page will come from keywords you didn't try to optimize for. If you've ever seen a keyword report in your analytics platform or Google Webmaster Tools, you know this is true. What are these keywords? They may be synonyms, thematically related, or closely related ideas that search engines thought best matched your content. Sometimes they are way off base, but we won't concern ourselves with those. With this in mind, optimizing for a only a single keyword means ignoring the majority of your potential traffic. Truth #2: Ranking number one is not a requirement for earning thousands of visits. Given what we know about point #1, it's often better to rank in position 2 or lower for hundreds or thousands of long tail keywords than it is to rank number one for a single keyword. Truth #3: The best keyword tools in the world will only show you a fraction of the keywords you can potentially rank for. Have you ever compared your long tail keyword data with data from Google's own Keyword Planner? Most of those keywords will show little potential search traffic or won't even register, but you know this isn't true because these are the same keywords that brought you traffic. Relying on keyword research tools alone won't bring you to your full ranking potential. You need content that fully explores your themed concepts. Truth #4: Search engines sell keywords grouped into concepts and themes. We can learn from this strategy. When you purchase keywords through AdWords, Google suggests keywords to you in tightly grouped themes and ideas. In fact, they do everything they can to discourage you from bidding on individual keywords. Of course, this is one way for Google to make more money, but it's also because Google knows that concepts are often a better indicator of searcher intent than individual keywords. Part of this is due to the fact that 15% of all Google searches, or over half a billion per day, have never been seen by before. Now let's put these ideas into action. Step 1: Gather your keyword seeds Folks talk about different processes of keyword research depending on whether you are going after Traffic: good for pure pageviews and ad-based revenue sites, or Conversions: for example, when you sell goods or services or need brand awareness Most of the time, you already have a good idea of what your keyword topic broadly covers, especially if you're working with an established business or website. For our purposes, let's explore ideas around the keyword \"seo tools\" – a term near and dear to our hearts here at Moz. In reality, this is an extremely competitive keyword, and for your own research you'd likely want to begin with a longer-tail, less competitive term. Brainstorming There are literally hundreds of keyword research tools out there to experiment with, but a few SEO favorites include: Moz Keyword ExplorerÜbersuggest Google AdWords Keyword Planner Bing Keyword Tool Keyword Spy Wordstream Google Display Planner SEO Book keyword tools Google Trends Soovle SEMrush MarketMuse A relative newcomer in the space with interesting technology In the end, you will likely rely heavily on Moz Keyword Explorer, but you never want to rely on it as your sole tool. It's best to explore and play around with many tools to discover new ideas. Here are keyword suggestions from Grepwords. There are no rules except to have fun and try to discover new keywords you haven't considered before. Step 2: Get specific with modifiers This is basic stuff, but it bears emphasizing: The more specific your keywords, the easier it typically is to rank for those keywords. Sure, it would be great to rank for the keyword \"SEO tools\" itself, but most people aren't searching that way. Instead, they are likely looking for something more specific. Common keyword modifiers include: Time and Date: \"SEO Tools 2014\" Quality and/or Price: \"Free SEO Tools\", \"Fastest SEO Tools\" Intent: \"Buy SEO Tools\", \"Find SEO Tools\" Location: \"SEO Tools Online\", \"Canadian SEO Tools\" Your chosen keyword research tools will uncover these and many more qualifiers, but you'll want to include them in your searches as well. Case Study: the $70,000 keyword modifier Seasonal keywords are often super-effective. I discovered this myself a few years ago as an independent SEO with the keyword \"IRA contribution limits.\" The keyword had good volume but was super-competitive, so I knew I was never going to rank for it. Using Google Trends, I found that usage for this keyword spiked at certain times of the year, and that in fact people were looking for information for a specific year, i.e. \"IRA contribution limits 2012.\" Using Google Trends is a great way to validate any keyword idea, as it will often reveal hidden patterns and insight not present in other tools. Armed with the new knowledge, I found many more date-specific keywords themed around this topic and built an entire domain around them. Although it took a lot of hard work, the site eventually drew tons of seasonal traffic and I was able to sell the site with a significant profit. It's a good idea to validate all your important keyword ideas through Google Trends, as it will often reveal patterns and insights not present in other keyword research tools. Step 3: Using Google AdWords Keyword Planner For small and medium-sized research jobs, nothing beats going directly to Google's AdWords Keyword Tool for relevant suggestions and search volume. (For larger and enterprise-type projects, see the alternatives at the end of the post.) This is basic stuff, but you'll want to search for New Keyword and Adgroup Ideas and head straight to the to the Keyword Ideas tab. For a more complete guide to using the planner, Kristi Hines wrote a great guide here. Hint: While most seasoned SEOs skip over the Ad Groups tab, there's a wealth of ideas there tightly grouped into themed keywords – exactly what we are looking for! Traditionally, marketers use Google's keyword tool because of search volume and competition scores, but most web marketers underplay one of the most powerful features of this tool: the ability to sort keyword suggestions by relevance. This gives us a huge advantage in creating themed keyword lists, and helps us create more targeted content. Because the top suggestions often contain your core keywords, it's helpful to use negative keywords to discover more variation. Step 4: Defining the concepts further Now that you have your basic keyword idea, the next step is creating your keyword theme by finding keywords that are conceptually related. There are several ways to do this. For our example of \"SEO tools\" let's try the popular methods to build out our themed list. Google's Related Searches At the bottom of most Google results is a section called Related Searches. This is a gold mine of conceptually related concepts. By clicking through the results and then examining those related searches (and repeating this process over and over) you can quickly find many long-tail opportunities much easier than using Google's AdWords Keyword Planner. Google Trends At the bottom of each trends report is a \"Related Searches\" section that can be used to discover conceptually related queries. Wikistalker This cool tool introduced to me by Peter Bray \"illustrates the relations between different things by visualizing the semantic relevance between the inter-connected structure of their Wikipedia entry articles.\" So if we search Wikistalker for \"Search Engine Optimization\" it shows us the following Wikipedia articles with the highest semantic relevance. Internet Marketing: 85% relevant Google Webmaster Tools: 70% relevant Marketing: 59% relevant Other tools In fact, many other keyword research tools like Deeperweb Search, SEMRush, YouTube Analytics or WordStream can help you discover related keyword phrases. Step 5: Empathy, your secret keyword weapon Ask yourself what a visitor wants to find on this page. As Rand explains in this excellent Whiteboard Friday, putting yourself in the visitor's shoes and anticipating their needs provides a wealth of conceptually related keyword ideas. Searchers of \"SEO tools\" are usually asking a number of similar questions: How much does it cost? Free, plans and pricing, free trial What kinds of tools are there? Link building, crawling, and indexing Who are the tools for? Agency software, small business How good are the tools? Best, endorsed by, customer review By answering as many searcher questions as we can, we continue to build our themed keyword concept. Step 6: Can you rank? Getting strategic with competition In this case, it's much better to go straight to the search engine results page (SERP). This was covered in How to Rank, so let me plagiarize myself by repeating the important points here. You have two basic methods of ranking the competition: Automated tools like Moz's Keyword Difficulty Tool Eyeballing the SERPs If you have a paid subscription to Moz, or even a free trial, the Keyword Difficulty Tool calculates — on a 100-point scale — a difficulty score for each individual keyword phrase you enter. If you run a full report you can break down the SERP for each keyword and judge the individual strengths of each URL that ranks. You can even add your own URL to see how you stack up. Keyword phrases in the 60-100 range are typically very competitive, while keywords in the 30-40 range might be considered low to moderately difficult. Manual method: the eyeball check Even without automated tools, the best way to size up the competition is to simply look at the top results currently ranking. Run a non-personalized search query for your keywords. Examine the top few results and ask yourself the following questions (SEO toolbars like the MozBar or SEOquake can help speed up the process): Are the first few results optimized for the keyword? Is the keyword in the title tag? In the URL? On the page? What's the Page and/or Domain Authority of the URL? What's the inbound anchor text? Can you build links and/or mentions around this keyword? Can you deliver a higher quality resource for this keyword than the top ranking sites? The last question is the most important: can you deliver higher quality content for this keyword than the competition? The answer must be yes if you expect to deserve to rank. Step 7: Pulling it all together By this point, you've probably analyzed hundreds or thousands of keywords and organized them into themed, related groups. You've found keywords that relate to your business or website, around which you can create shareable content, with a high enough search volume, and that you believe you can rank for. Often, the keywords that you choose depend as much on your business or website as they do on the competition. We chose the keywords above not only because they relate to our primary keyword, but also because they relate to our business. Google may rank keywords based on relevance, but only you can decide if those keywords relate to your audience, product, and brand. In the case of our \"SEO Tools\" example, our themed keyword list might look like this. Free SEO Tools Best SEO Software Keyword Research Search Engine Optimization Link Building Toolset Best SEO Tools in 2013 Online Marketing SEO for Google Best SEO Tools for Agencies Remember, we started with a very broad keyword. In practice, your final keyword will be much more tightly focused. We'll now use this list for creating content around our keyword theme. In a future post, we'll discuss integrating these concepts for optimal on-page SEO. Tips for scaling and large sites The above method works if you're building out keyword lists for small to medium sites, but scaling this process for large and enterprise sites requires a different, more mathematical approach. If you want to research tens of thousands or even hundreds of thousands of keywords at a time, I highly recommend the looking into the following resources: Grepwords – Keyword Suggestion API with search volume SEOGadget for Excel – Link Research and Keyword Data. Integrates with Grepwords and SEMRush How to do Keyword Research for SEO – Written by Nick Eubanks, this $37 guide is well worth the money and offers a number of tips and tricks. Conclusion The above method is only one method of keyword research. There are hundreds more and you'll likely invent your own method. Regardless of the method you use, thinking about keywords in terms of concepts and themes represents a hugely important step in content development. What are your favorite keyword tips to organize content around concepts? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Keywords to Concepts: The Lazy Web Marketer's Guide to Smart Keyword Research"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Keywords to Concepts: The Lazy Web Marketer's Guide to Smart Keyword Research"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": "The SEO's system for themed keyword research."
    },
    {
      "level": "H2",
      "text": "From single keywords to themed concepts"
    },
    {
      "level": "H4",
      "text": "1. What the user intends"
    },
    {
      "level": "H4",
      "text": "2. What your content is about"
    },
    {
      "level": "H4",
      "text": "3. Relating concepts to one another"
    },
    {
      "level": "H2",
      "text": "Keyword targeting: the dumb, hard way"
    },
    {
      "level": "H2",
      "text": "The smart system of themed keyword research"
    },
    {
      "level": "H4",
      "text": "Truth #1: Over 70% of the traffic you earn for any given page will come from keywords you didn't try to optimize for."
    },
    {
      "level": "H4",
      "text": "Truth #2:  Ranking number one is not a requirement for earning thousands of visits."
    },
    {
      "level": "H4",
      "text": "Truth #3:  The best keyword tools in the world will only show you a fraction of the keywords you can potentially rank for."
    },
    {
      "level": "H4",
      "text": "Truth #4:  Search engines sell keywords grouped into concepts and themes."
    },
    {
      "level": "H2",
      "text": "Step 1: Gather your keyword seeds"
    },
    {
      "level": "H4",
      "text": "Brainstorming"
    },
    {
      "level": "H2",
      "text": "Step 2: Get specific with modifiers"
    },
    {
      "level": "H3",
      "text": "Case Study: the $70,000 keyword modifier"
    },
    {
      "level": "H2",
      "text": "Step 3: Using Google AdWords Keyword Planner"
    },
    {
      "level": "H2",
      "text": "Step 4: Defining the concepts further"
    },
    {
      "level": "H4",
      "text": "Google's Related Searches"
    },
    {
      "level": "H4",
      "text": "Google Trends"
    },
    {
      "level": "H4",
      "text": "Wikistalker"
    },
    {
      "level": "H4",
      "text": "Other tools"
    },
    {
      "level": "H2",
      "text": "Step 5: Empathy, your secret keyword weapon"
    },
    {
      "level": "H2",
      "text": "Step 6: Can you rank? Getting strategic with competition"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Step 7: Pulling it all together"
    },
    {
      "level": "H2",
      "text": "Tips for scaling and large sites"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Cyrus Shepard\n          \n            Cyrus Shepard\n          \n            Cyrus Shepard"
}