{
  "url": "https://moz.com/blog/keyword-research-for-the-modern-customer-journey",
  "slug": "keyword-research-for-the-modern-customer-journey",
  "title": "Keyword Research for the Modern Customer Journey - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As searcher behavior gets more complicated, we as marketers have to evolve our approach to keyword research. Here's how to match your keyword research process to your customer's purchase journey.",
  "content": "Keyword Research for the Modern Customer Journey Keyword Research By: Matt Gratt May 18, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Matt Gratt May 18, 2015 Keyword Research for the Modern Customer Journey Keyword Research The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. User behavior and customer purchase journeys are more complex today than they've ever been before. Modern consumers – especially those purchasing high-consideration or B2B products – look across a variety of media and conduct a lot of searches. Google reports that the average B2B researcher does 12 searches before they engage on a specific brand's site. They are seeking reinforcement and comfort not just from the information about the product, but also from the opinions of other customers. How SEOs and marketers approach keyword research has to evolve, along with this consumer behavior. In many industries people simply search, click, and transact. In some verticals, though, user search patterns have grown more complex – they look for: Reviews Adjacent topics Comparisons And even after they've bought they look for ways to get the most out of their products This is a model of SEO that is dramatically more complex than simply aiming to rank number one for a bunch of commercial keywords. It seeks to model a customer decision journey, optimize appropriately, give the right person the right message at the right time, and win the competitive battle before it even occurs. This same model also allows for a modern search practitioner to create significantly more value for a client or organization. In place of simply \"traffic plus conversion\", the value of search becomes \"awareness + branding + list building + traffic + conversion + competitive wins + reducing support costs + upsell, cross-sell, and customer success,\" justifying both more investment and a much larger organizational impact (and promotions or higher consulting fees for the practitioner). In this post, we'll look at a SaaS companies as examples, as SaaS and software comprise the majority of my experience, clients, and knowledge. However, this framework can be applied to many industries and verticals. One good example: Everette Sizemore recently wrote a great Moz post about using lead-gen tactics in ecommerce. The considered purchase search journey (also known as a funnel) No Problem AwarenessThis is the very beginning of the process, when the prospect is fully 'at rest.' They don't know you, they don't your product, and they don't even know they have a problem. So you might be wondering, can we even do SEO here? I would say yes – in this case, the opportunity is audience development, and building an audience of people interested in your topic (that can subsequently convert after they've grown to know, like, and trust you).When you think \"audience development,\" focus on trying to get the right people to come to your website. That means building that audience and affinity with a mix of content marketing and SEO before it starts. In this case, you'll want to target keywords that people would search for before or after they think about your product. This is one case where going for the high-volume, low-to-medium competition keywords with little purchase intent can be really helpful. (This is also the spot where that high-funnel, highly linkable content belongs.) For example, for a website optimization software company, in this stage content might include interviews with web performance experts, general resource guides, and other content that, while it ranks for keywords with volume, doesn't yet address a specific customer pain point. You see companies like Marketo doing this, creating guides around topics other than marketing automation but that are top of mind for their consumers, like international expansion and event marketing. Even though Marketo has some features here, they know that people interested in these topics may someday become loyal Marketo customers. You'll want to get the right people to your site and then bring them into a permission marketing asset – be it an email list (the best), a social audience (good but less so), or a retargeting pool (generally the least preferred).Vero is a company out in the market today that's doing a great job using email marketing teardowns, getting people who are interested in email marketing into their purchasing funnel while also building awareness and educating potential customers. Awareness of the problemThis is the next step on the buying path. Your prospect knows they have a problem and looks for information, but doesn't really understand what you're doing yet – or even what to do to solve their problem. This is an often-ignored opportunity. You can get ahead of people by creating landing pages and content about their problems and pain points. Action Item: Take your target audience's pain points and try to turn them into keyword lists. What problems does your product solve? How might someone search for those? Some of the best tools to do this are KeywordTool.io and Term Explorer, and I'll detail the process below.For example, if you consider the website speed optimization tool again, some of the things we'd look for are: \"Slow website\" \"Diagnosing a slow website\" \"Why is my website slow?\" \"How to speed up a website?\" \"Increase website speed\" \"Make my website fast\" And other similar phrases. How to do it Start by brainstorming a list of problems your product addresses, and begin by putting these keywords into something like Google suggest (or a tool like UberSuggest or KeywordTool.io): Then, I like to pick the best ones, and bring them into Term Explorer's keyword discovery engine, for further expansion: After that, I like to pick the ones I have a realistic chance of ranking for (based on SERP and PPC competition), and begin asking, \"How can I address this question? What content – topics, ideas, and forms – will help this person, while potentially moving them a step down the funnel?\" Sometimes the answer is a landing page. Sometimes it's something like a blog post or a free tool. All of these strategies should be judged against organizational resources, keyword competitiveness, and ultimately ROI. Solution awareness At this stage in the funnel, prospects know what they need. Coming back to our running example, they're looking for a marketing automation solution, or a website optimization solution, or something else they can clearly define. This is the land of the \"3-letter acronyms,\" where people know what they're looking for and it's up to you to provide it. For the tools used here, I would take your conventional ‘category' terms and put them into Keyword Tool and then Term Explorer to build out a larger collection of keywords, and then take a look at what has significant volume. The other area you can work on here is \"modifiers\" – descriptive terms like \"simple CRM system\" or \"secure web host.\"While you can look at your original positioning documents (sometimes this will be obvious), the other approach is to use your Net Promoter Score (NPS) feedback. NPS feedback is a wonderful source for the \"voice-of-the-customer\" that you can incorporate into your keyword research process. What traits do the promoters (NPS 9-10) like about your service? Those are the best modifiers to go after. Additionally, there's another positioning exercise here in your NPS data. If you don't have a clear idea of what exactly you should be optimizing for (there are, after all, some great products that don't lend themselves to a simple description), consider asking your 9 and 10 NP scores: \"So, if a friend of yours at a conference said, 'What's (Brand Name),' how would you describe it in a sentence or two?\"This can result in great customer language to use on landing pages and in A/B tests, as well as in keyword targeting. If your product does a lot – if you have more of a \"solution\" than a \"tool\" or simply have lot of good use cases for your tool – consider optimizing for each of those and doing additional keyword research around it. This is where prioritization is crucial. There will be some extremely competitive categorical keywords that will never provide much value and will take tons of time and money. Ideally you can go after keywords where you can rank in a reasonable amount of time and have enough volume to move the needle for your business. Solution comparisonIf you're in an established market, you will have competition, be it direct or indirect. If you have no competition, that's generally a bad sign, and is generally a segment where SEO is not going to be the best marketing channel. Remember, SEO is a tactic to harvest demand, not to create it from scratch. This is a part of people's search as well, and you can find these comparison terms and reach those people appropriately. These searches are often (for example) something like \"marketo vs hubspot\". You can find these by simply throwing [\"Your Brand\" vs] into a keyword tool. For example, for our friends here at Moz, it looks like this: These terms are interesting ones to optimize for – it generally means someone is towards the bottom of their purchase path. (It's also a great term set for affiliates to optimize for.) Now that you understand the competitive set, how should you approach these? Some companies are bold and make pages on their site for their comparison terms. For example, HubSpot has a page about how they compare with Marketo: If this isn't something you're comfortable with (many brands aren't, and in some countries with different commercial laws such comparisons are illegal – definitely a good idea to consult with your legal counsel before embarking on a strategy like this), you can think about how to enlist your community to help people make the right choice when they search for these terms. Some of the tools in your toolbox here are: Affiliates and friendly bloggers who write posts about tools Comparison sites like G2Crowd and TrustRadius Q&A sites like Quora which often rank for things As the chart below shows, B2B buyers really want independent reviews – making heavy use of the independent sites makes sense here. ProTip: If you have NPS data, consider asking your high-NPS customers to contribute to these sites about your product, so potential users can understand what your customers that really like your product think about it. It's also worth noting that you can step into competitor's funnels here (if you're comfortable with that.) \"[brandname] alternative\" is a structure that comes up in almost all SaaS searches – if you're a small, scrappy startup, you may want to create pages about being an alternative to the big goliath competitor. Buying Similar to the previous stage, here people are at the very bottom of the funnel, and often want to figure out a few things before they start with your product. This is a great opportunity to deliver a great, frictionless buying experience. For example, if you sell web hosting, people might want to know if you have cpanel or an alternative system – having a page on the site that addresses this can be really important. You can: Look at your brand searches in UberSuggest – I know I keep coming back to this, but this is an amazing technique. For every popular query, do you have a page or a piece of content that addresses this? Live chat logs – Live chat is a wonderful source of online marketing insight. If you have chat logs from a support department or wherever else, start looking through them. If you see the same questions coming up over and over again, you definitely want to have content somewhere that addresses them – it means other people have the question and aren't asking. Support requests and tickets – Similar to online chat logs, these support requests usually include specific language about what your customers are trying to accomplish and where they're confused. This language should not only be used to improve the use and experience of your product, but also as a keyword map for solution-focused content. Implementation, customer success, and upsellingNow that you've gotten the customer to become, well, at least a trial customer, go get something to drink – you've had your first small victory. But if you're in SaaS or another subscription business, it's time for coffee, not champagne, because the hard work is still in front of you. You have to earn that monthly recurring revenue.I would look at searches around your brand – can you help someone before they ever file a ticket? Are there common issues that you can proactively address? For example, the popular heatmap tool Crazy Egg has a frequently searched term around \"Crazy Egg Behind Login\". This means users are wondering if they can install Crazy Egg behind a log-in wall. You can see that the team behind Crazy Egg have gone ahead and created a page optimized for this question – turning what would be a pre-sales question or frequent support ticket into something that can be handled effortlessly by their website. And that's the SaaS customer life cycle. But before I leave you, one last thought… Thinking beyond the landing page As SEOs we often think about marketing to keywords in a somewhat simplistic way: If a given keyword exists, our page on our website must rank for it, or it's like it never happened. When we think that keyword searches represent one person on a mission to solve a problem and buy something – rather than \"traffic\" – we begin to see that strategy in a different light. And there are many terms that, frankly, we're just never going to rank for. But just because we may not be able to rank for a given term, doesn't mean we can't influence it. Rand Fishkin talks about \"Barnacle SEO,\" and I would suggest you take that mindset to other pages as well. Can you: Make an affiliate partnership with the ranking site? This way you can still influence people, often on a pay-per-lead or acquisition basis, rather than investing in SEO. (Not the best choice, but still an arrow in your quiver.) Do PR and get on the site that way? This is a great way to quickly rank for things that you may never be able to rank for organically – especially if you're new. Contribute bylined content (occasionally known as a guest post) to the site? Very similar to the above concept – but with a branding bonus as well. Buy an ad placement (through GDN, a service like BuySellAds, or directly) to get you placement on that site and page, and thus the search term? You have many options to reach searchers – too often SEOs fail to think beyond SEO and market to people rather than keywords.In closing As customer journeys get more complicated, we can adjust and take advantage fo the full customer cycle, from unaware to aware to solution comparison and more. And if we're creative, we can use these searche terms to not only deliver a great experience but to also capture customers early in the buying cycle, as well as lower support costs. Good luck and good SEO'ing. -- This post was co-authored by Matthew Gratt and Nick Eubanks. Nick Eubanks manages digital strategy for W.L. Snook & Associates, Inc., a digital asset holding company with a focus on Ecommerce and Software. He is also a founding partner at I'm From The Future, and an active investor and advisor to online businesses including SchoolSupplies.com, YourListen, Sports Pick Predictions, and others.Nick is the owner of top-ranked SEO Blog, SEONick.net and the creator of Master Keyword Research in 7 Days. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Keyword Research for the Modern Customer Journey"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Keyword Research for the Modern Customer Journey"
    },
    {
      "level": "H2",
      "text": "The considered purchase search journey (also known as a funnel)"
    },
    {
      "level": "H2",
      "text": "No Problem Awareness"
    },
    {
      "level": "H2",
      "text": "Awareness of the problem"
    },
    {
      "level": "H3",
      "text": "How to do it"
    },
    {
      "level": "H2",
      "text": "Solution awareness"
    },
    {
      "level": "H2",
      "text": "Solution comparison"
    },
    {
      "level": "H2",
      "text": "Buying"
    },
    {
      "level": "H2",
      "text": "Implementation, customer success, and upselling"
    },
    {
      "level": "H2",
      "text": "Thinking beyond the landing page"
    },
    {
      "level": "H2",
      "text": "In closing"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Matt Gratt\n          \n            Matt Gratt\n          \n            Matt Gratt"
}