{
  "url": "https://moz.com/blog/keyword-targeting-density-and-cannibalization-whiteboard-friday",
  "slug": "keyword-targeting-density-and-cannibalization-whiteboard-friday",
  "title": "Keyword Targeting and Density - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Enough has changed about keyword targeting that it's high time we offered a refresher. In today's Whiteboard Friday, Rand lays out best practices for targeting, and clears the air about density and cannibalization in today's world of search.",
  "content": "Keyword Targeting and Density Whiteboard Friday By: Rand Fishkin March 14, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 14, 2014 Keyword Targeting and Density Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Keyword targeting is still an integral part of online marketing, but it isn't the same as it used to be, and we want to make sure you're able to keep up with the changes. In today's Whiteboard Friday, Rand covers today's best practices for keyword targeting, and clears up some common misconceptions about keyword density and cannibalization. For reference, here's a still of this week's whiteboard! Video transcription Howdy Moz fans and welcome to another edition of Whiteboard Friday. This week I'm going to talk a little bit about some keyword targeting, density, keyword density, and cannibalization issues. These are issues that I've seen come up a few times. I've received some email questions about them, and so I thought maybe it's a good time to readdress some of these best practices and to talk about how things like Hummingbird, in particular, have changed some of the ways that we think about keyword targeting, as Google's engine has really evolved to be more sophisticated with how they identify and process keyword use than they have historically. So, first off, I'm going to start by identifying this page, actually a really wonderful blog and website from a local Seattle blogger, talking about Seattle Espresso. So I did a search for Seattle's best espresso, because that's a topic of us many here at the Mozplex and many of you who come to visit Seattle are often interested in, and I found this wonderful page. Now, there are some interesting things about it. It ranks very well. I think it's ranking number four, and another blog post from the same guy from the next year of his reviews is ranking number five. So he's got sort of two positions in there. But what's interesting to me is there's not a lot of keyword targeting. In fact, this particular gentleman even has something on his About page that says, \"If you're an SEO or a social media person, don't even contact me.\" So clearly this is not a guy who's thinking tremendously about SEO, doesn't have a lot of keyword targeting in mind, but is doing a tremendously good job of ranking, and that's because he's, perhaps unintentionally, following a lot of really smart rules. So first off, as opposed to early keyword targeting world of SEO, today I really don't stress repetition. I think repetition is something we can almost avoid. So I don't worry about, \"Hey, I only have four instances of the term 'Seattle's Best Espresso' on the page. That's not enough. I really need six or I need seven or I need five or I need three.\" I don't worry about the number. I do, generally speaking, like to make sure that at least somewhere on the page, at one point or another, the phrase is mentioned once or twice is generally good enough, and sometimes if it makes sense to have it in the copy anyway, for user experience reasons, for readability reasons, for content reasons, great, fine. That's okay. Also, I never, ever use a density metric. It used to be the case that density was somewhat reasonably okay, reasonably correlated with better keyword targeting. But, honestly, that went out the window so long ago. I think when I started in SEO, in 2002, it was already dying. People were already talking about keyword density being a relatively useless metric. Let me just explain what density is very briefly for anyone who might not know. So there's a lot of content here, in fact 67 unique words, and what I've done is highlight in purple these Seattle, espresso, best espresso, espresso, 67 unique words. Keyword density basically says, \"Well, there are four instances of espresso. Out of 67 words, that's a 5.97% density of espresso.\" Can you see how incredibly useless this is? So search engines evolved dramatically beyond keyword density, probably as soon as the late '90s. So we're talking a long time ago, and yet there are still a tremendous number of SEOs who look for a keyword density analysis and density tools and think this is a good way to do the best practice. It really is not. I would urge you not to use density as a metric, not to think about it. You won't find it in our keyword tools. You won't find it in most good keyword tools. Title is very useful. It's a very useful place to employ your keywords, but a click-worthy title is actually worth a lot more than just a perfectly keyword-targeted title. So perfectly keyword-targeted would be keyword phrase right at the beginning, exact match, so something like \"Seattle's Best Espressos,\" and then \"I review 113 different coffee places in the city.\" Okay, that's not a terrible title. You could imagine clicking that. I actually really like the title that this blogger's put together: \"The Best and Worst in Seattle Espresso, 2011 Edition.\" This isn't perfectly keyword-targeted. I searched for \"Seattle's best espresso,\" which is, by far, the most common phrasing that searchers are going to use. But he's got \"best\" separated from \"Seattle Espresso.\" It's not right at the front of the title. It's still a great title. You know what's even smarter, that I really like, is the way that he writes it. \"The Best and Worst in Seattle Espresso\" is almost more compelling to me than just knowing the best. I'm really curious about the worst. The worst holds a curious fascination for me. If I see some coffee shop that I really love on the worst list, well, I'm going to get all inflamed about that and riled up. But what a great way to write headlines, to write titles. He's employed the keywords intelligently, but he's made me want to click, and that's something that I think we should all take away from. On page is very useful. So putting the keyword on the page, especially important in the headline. Why is it so important in the headline? It's not because SEO is about perfect keyword placement and getting that H1 tag. It's not actually that important or critical that you get it in the H1 or the H2. It's a best practice, and I would generally recommend it, but it's okay if you don't. The reason I really recommend this is because when someone clicks on this title in the search results, \"The Best and Worst in Seattle Espresso, 2011 Edition,\" if they land on a page that does not have that headline, that title at the top of the page in some bigger font, instantly searchers will get the impression that they've landed on the wrong page and they'll click the Back button. As we know, pogo-sticking is a real problem. People jumping from a result over to the search results and then jumping back to search results, that gives the engine an indication that people were not satisfied and happy with this result. They're going and they're scrolling down and clicking on other people's results instead. You don't want that. You want to own that experience. You want to be the provider of the best possible relevancy and searcher experience that you can. That's why one of the other recommendations that I have, when it comes to on page, is never sacrificing user experience. If you're thinking to yourself, \"Well, Rand said I should really have the keyword on the page in some sort of exact format, like at least twice and in the headline,\" yes, but if you think that's making a worse user experience, then mixing it up a little bit like this blogger did, mix it up a little bit. Go for the better user experience every time. Particularly because of things like what Google did with Hummingbird, where they've gotten much more sophisticated about text, contextual analysis, relevancy, the way that they interpret things, you can see a lot of search results now where it is not keyword targeting that's winning the day, but really searcher intent. Meaning, if I'm going and searching and this blogger has done a really good job of connecting up the terms and concepts that Google has identified that they associate with best espresso, they're going to rank particularly well. Let me show you some really smart things that perhaps unintentionally this blogger did. He mentions coffee shop names -- Victrola, Cortona. He's got Vivace down there later. He has Herkimer Coffee. Herkimer is the maker of the espresso that they serve at Cortona Cafe. This is incredibly intelligent because when Google scans the Web and they see lots of people talking about Seattle's best espresso, these coffee shops and roasters are mentioned very frequently. There's a high degree of network connectivity, keyword connectivity between these terms and phrases. So when I see, as Google, Seattle's best espresso and I don't see any mention of Herkimer or Vivace or Victrola or Ballard Coffee Works, Seattle Coffee Works, I'm going to get a little suspicious. If I see things like Starbucks and Tully's and Seattle's Best Coffee, which is a brand, I'm going to think, \"Gosh, I don't know if they've actually localized. I don't know if this is relevant to that searcher's query.\" In fact, if you look at the front page for Seattle's best espresso, you will not find places that list, well, most of the results do not list places like Starbucks and Seattle's Best Coffee and Tully's, and these bigger national brands or regional brands. The last thing that I'll mention on targeting is that providing unique value is essential. I did a whole Whiteboard Friday about providing unique value and the uniqueness of content. But those topically relevant terms that I just mentioned can be very helpful here. But really it's about providing something that you'll never find anywhere else. Not just unique content, meaning this text is unique to the Web, but meaning the value provided by it is truly unique. I can't find this value. I can't get what I get from this article anywhere else on the Web. That's critically important. All right. Next piece is cannibalization, and keyword cannibalization is sort of a tough, meaty topic. It's not quite as important as it used to be, because Google has gotten much more sophisticated, more advanced in being able to tell. Basic idea behind cannibalization is, \"I've got a page targeting Seattle's Best Espresso, and then I have another page targeting Wallingford's Best Espresso, which is a neighborhood here in Seattle. Should I be really careful not to use the word Seattle on my Wallingford Best Espresso page? How do I link between them? How do I make sure that Google knows which one to rank well?\" In the past, Google was not smart enough, and a lot of times you would see these not as relevant pages outranking the one you really wanted to rank. So people in the SEO world came up with this term keyword cannibalization, and they tried to find ways to make Google rank the page that they wanted. Google's gotten much better about this. There are still a few best practices that we should keep in mind. So, first off, on page targeting for a unique keyword phrase is optimal. So if we know that we want a page that's Seattle's Best Espresso, great. Having that term in the title, in the headline of a unique page is a very good idea. If we know that we want another one that's Wallingford, that's great too. Bt it is okay if you have multiple pages employing part of a keyword term or phrase. So, for example, I've got my Wallingford page. It's okay on the Wallingford page if I also mention Seattle. I could say \"Seattle's Wallingford Neighborhood,\" or \"The Best Espresso in Seattle's Wallingford Neighborhood,\" or \"In Wallingford, Seattle.\" That's okay to do. That's not going to create the cannibalization that it might have in years past. Linking with appropriate anchor text is very helpful. So let's say here's my coffee addict's guide to Seattle, and I've got links in here: \"Best coffee roasters in Seattle,\" \"Best espresso in Seattle,\" \"Best coffee online from Seattle's roasters.\" Great. So now I have unique keyword phrases that I'm targeting, and I'm going to link out to each of these pages, and then from each of these pages, if I've got my best online coffee from Seattle roasters page, I probably do want to link to my best espresso in Seattle page with that anchor text. Call it what the page is. Don't just say, \"For some great espresso places in Seattle, click here.\" No. \"Click here,\" not great anchor text. \"Best espresso in Seattle,\" that's the anchor text I generally want to have, and that's not just for search engines. It's also for users. Number four, the last part about keyword cannibalization is if you have older pages, this happens a lot for bloggers and content marketers who are producing pages, lots of unique content over time, but some of it is repetitive. So if you have an older page, it can be very wise to retire that content in favor of something newer and fresher, and there's a number of ways to do this. I could 301 from the old URL to the new one. I could use a rel=canonical to point from my old piece of content to my new one on the same topic. Or I could refresh the existing page, essentially take the same URL, dump the old content, and put the new content on there. I could even archive the old content on a brand new page that's sort of like, \"Hey, if you want the old version of this, here it is.\" You can see we've done that at Moz several times with things like MozCon, with our industry survey, with our old ranking factors. We sort of move that old content off to another URL and put the new stuff up at the URL that's been ranking, been performing so that we don't have the challenge of having one trying to compete against another. These techniques can be really helpful for those of you who've got sites and you're producing lots of content, you're targeting many keywords, and you're trying to figure out how to organize these things. I look forward to some great comments. Thanks very much gang. I'll see you again next week for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Keyword Targeting and Density"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Keyword Targeting and Density"
    },
    {
      "level": "H2",
      "text": "Video transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}