{
  "url": "https://moz.com/blog/kill-it-on-facebook-by-being-tagfee",
  "slug": "kill-it-on-facebook-by-being-tagfee",
  "title": "Kill It on Facebook by Being TAGFEE - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Creating a great Facebook presence is not only a great way to hedge your web properties against changes in organic traffic, but an outstanding source of traffic in its own right. This post goes through the process of using the TAGFEE philosophy to build a social presence that is loyal, engaged, and…",
  "content": "Kill It on Facebook by Being TAGFEE Social Media By: Corey Shelton September 25, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Corey Shelton September 25, 2013 Kill It on Facebook by Being TAGFEE Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Last month, I presented a Mozinar on Deconstructing a Niche Market. Much to my surprise, the Q&A session focused almost entirely on my experience using Facebook as a niche marketing channel. It's true that Facebook is a dynamic and oft-misunderstood creature, especially in marketing. When building a strategy with long-term sustainability in mind, it's important to avoid relying on any one source of traffic. Any channel can be fickle, and Facebook has certainly proven to be no exception. That being said, Facebook still represents the largest share of the social space, and is at least worth considering for businesses looking to diversify their channel marketing portfolio, be it niche-targeted or otherwise. Just 9 months after we decided to give the platform the old college try, Facebook has become a substantial traffic source for our B2B business. As I mentioned in the Mozinar, our business has spent the last nine months developing our Facebook channel. As a result, we've seen traffic from Facebook increase to the point where it is roughly equal to 30% of our organic traffic. In this post, I'll be going through the philosophy we use to maximize engagement and traffic. Marketing like it's 2013 In a recent post on LinkedIn, marketing wizard Gary Vaynerchuk delivered this gem: \"It's 2013 and 99 percent of people are marketing their products like It's 2004.\" His assessment is spot on. Successfully building social media channels that drive converting traffic is about more than a content schedule. On Facebook, you have a built-in audience of anywhere from hundreds to millions of people who have opted in to your message. Remind you of another platform you use? Email, perhaps? Social media, of course, adds engagement into the mix. This means that you not only have the opportunity to push your message out to your droves of fans, but a responsibility to have conversations, contribute, and be a member of the community. If you want to market like it's 2013, you have to learn how to engage your audience, not just talk at them. The (not so) curious case of Sue Bryce Sue Bryce is an award-winning professional photographer that teaches photography through workshops on CreativeLIVE. If you take a look at her Facebook page, you'll see that her engagement is off the charts. 43,000 likes with 8,870 talking about her page. How does she do it? First things first, she's not even remotely shy about promoting herself or her work. As you progress down her page, you'll definitely see the occasional post promoting her events or cross-promoting her partners. But therein lies the rub. The occasional post. The promotional posts are woven into a cloth of intensely personal, fun, and sometimes catty quips about life, the photography business, and people that she meets along her journey. Among her most engaged-with recent posts? Sharing a story about getting dental work done, and how happy it makes her feel. I guarantee that each person who liked and/or commented on this post feels closer to Sue because of it. In addition to sharing elements of her personal life, Sue communicates with her Facebook community in her own voice. There is nothing that feels remotely fake or forced about her posts. This makes it extremely easy for her fans to feel a connection to her, and to respond to her posts, which they do quite regularly. Finally, Sue takes advantage of the fact that visual media performs exceptionally well on Facebook. In fact, a 2012 HubSpot study found that photos on Facebook generated 53% more likes than the average post. As possibly one of the world's best photographers, of course, Sue has an unfair advantage in this arena. Even still, one of her recent photo shares depicting her and fellow photography guru Kelly Brown in newborn poses garnered 2,174 likes, 156 shares, and 262 comments. Why? Because it was fun, relevant to the audience, and (let's be honest) darn cute. Despite the fact that you're probably not a world-renowned photographer, it's still extremely important to engage your audience with relevant visual media. Behind-the-scenes photos, product photos, and event photos are all a good place to start, and will work for most businesses. Obviously, as a sole proprietor, Sue Bryce has a much easier time incorporating her personal voice into her brand, and this type of strategy won't necessarily work for all types of businesses. If nothing else, this case exemplifies the possibilities of incorporating personality into your brand to achieve outlandish levels of engagement. Channeling your inner Sue by harnessing the power of TAGFEE Seeing success is great, but this article isn't here to tell you how awesome Sue is. Image credit: Nicholas L., from Minneapolis Interestingly, what makes her such a great example for the Moz audience is that her Facebook page is a ridiculously great example of being TAGFEE. How can you incorporate this attitude into your own social endeavors? Be transparent and authentic While transparency can get bogged down with organizational hurdles, the lesson is to be yourself. Decide who your company is, and talk about things that reflect that, even if they're uncomfortable. For example, if you sell industrial supplies, don't be afraid to talk about the downsides of certain products. Modern customers know better than to trust claims that everything you sell is made out of sunshine, rainbows, and Adamantium. Be generous Offer special benefits to your fans that follow you on Facebook. Offer free trials and products, highlight their success stories on your page, and intentionally seek to add as much value to them as possible. This means thinking critically about what you're adding to the conversation, not just extracting from the platform. Be fun Again, being fun is relative, and dependent on company culture. But, as can be seen in the example of Sue Bryce, fun drives engagement. The same goes for Moz. It never hurts to take a lighthearted approach, and a good brand personality will make your fans more engaged. Be empathetic On one level, empathy is about following the golden rule. Facebook manners are no exception. Strive to be professional and respectful on social media at all times. Additionally, I would argue that empathy is about continually seeking to understand how your audience feels, what challenges they face, and working hard to provide a product and resources that help them address those needs and challenges. Be exceptional There is no shortcut to being exceptional. Always seek to try new things, test new ideas, and be fresh and relevant. This is not only a healthy practice for your business, but a way for you to add unique value for your fans. Being exceptional lets you tell exceptional, unique, and fresh stories in a way that other brands in your industry may not be able to. It's all about setting yourself apart. Being exceptional includes making the most of the platform. Use well designed, cohesive image posts. Not only do you want each post to be interesting from a visual perspective, but you want your page as a whole to have a sense of visual flow. Doing this will not only boost your engagement, but also make your Facebook page look more professional and put together. The same goes for copy. Choose a voice that fits your brand, remember to edit, and deliver your message exceptionally well. Know how you plan to format your posts, and how formatting works on Facebook. If you mention one of your fans, tag their name with @Username. Create a style guide and stick to it. Paying to play The problem of \"pay to play\" on Facebook is worth mentioning, as past and future changes have and will alter your brand's visibility on the platform. As it stands, our brand's data shows that we can expect to reach between 7% to 32% of our built-in audience when posting without advertisements. Facebook indicated in early 2012 that the average reach of an \"organic\" post was 16%. Considering that open rates of between 15% and 25% are, in general, considered good in email marketing, we can say that non-boosted Facebook posts boast respectable performance as they are. The counter-intuitive twist is that paying to play isn't necessarily a bad thing. Much like a Google SERP in the dark ages of Internet marketing, a Facebook feed inundated with an uncomfortable slurry of poorly written brand messages and uninteresting posts isn't really a worthwhile place for your brand to be. A realignment in the signal-to-noise ratio is a serious come-up for a brand that uses Facebook responsibly and thoughtfully, and raises the bar to entry in a way that benefits brands that have their house in order. Considering that Facebook advertising is relatively affordable, and allows you to target a ridiculously granular audience outside of your normal fan base, it is definitely worth a go. Lauren Vaccarello from Salesforce gave an outstanding primer on Facebook advertising in a recent WBF, and there's an excellent crash course on YouMoz. I recommend checking out both of them if you think Facebook advertising is a good fit for your business. Additional resources The social media landscape is constantly evolving, and Facebook is no exception. Over time, citizens of the Facebook empire will likely grow more and more desensitized to advertising. While some best practices are bound to remain exactly the same, it's important to keep an eye out for developments in the ecosystem. That said, you can cover most of the basics with the following resources: 6 Facebook Marketing Best Practices Facebook Timeline: 9 Best Practices for Brands 7 Key Ways to Optimize Facebook Fan Page SEO And that's a wrap. Enjoy building an outstanding Facebook presence, and remember—keep it TAGFEE! Have you had great success driving traffic with Facebook? Please share your experiences in the comments below. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Kill It on Facebook by Being TAGFEE"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Kill It on Facebook by Being TAGFEE"
    },
    {
      "level": "H2",
      "text": "Marketing like it's 2013"
    },
    {
      "level": "H2",
      "text": "The (not so) curious case of Sue Bryce"
    },
    {
      "level": "H2",
      "text": "Channeling your inner Sue by harnessing the power of TAGFEE"
    },
    {
      "level": "H3",
      "text": "Be transparent and authentic"
    },
    {
      "level": "H3",
      "text": "Be generous"
    },
    {
      "level": "H3",
      "text": "Be fun"
    },
    {
      "level": "H3",
      "text": "Be empathetic"
    },
    {
      "level": "H3",
      "text": "Be exceptional"
    },
    {
      "level": "H2",
      "text": "Paying to play"
    },
    {
      "level": "H2",
      "text": "Additional resources"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Corey Shelton\n          \n            Corey Shelton\n          \n            Corey Shelton"
}