{
  "url": "https://moz.com/blog/knowledge-graph-eats-featured-snippets",
  "slug": "knowledge-graph-eats-featured-snippets",
  "title": "Knowledge Graph Eats Featured Snippets, Jumps +30% - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Over a 4-day period at the end of October, we saw a 10% drop in Featured Snippets. This co-occurred with an explosion (+30%) in Knowledge Panels. What happened, and how are these connected?",
  "content": "Knowledge Graph Eats Featured Snippets, Jumps +30% Search Engines By: Dr. Peter J. Meyers November 27, 2017 Table of Contents Copied! By: Dr. Peter J. Meyers November 27, 2017 Knowledge Graph Eats Featured Snippets, Jumps +30% Search Engines Over the past two years, we've seen a steady and substantial increase in Featured Snippets on Google SERPs. In our 10,000-keyword daily tracking set, Featured Snippets have gone from about 5.5% of queries in November 2015 to a recent high of just over 16% (roughly tripling). Other data sets, with longer tail searches, have shown even higher prevalence. Near the end of October (far-right of the graph), we saw our first significant dip (spotted by Brian Patterson and Chris Long on SEL). This dip occurred over about a 4-day period, and represents roughly a 10% drop in searches with Featured Snippets. Here's an enhanced, 2-week view (note: Y-axis is expanded to show the day-over-day changes more clearly): Given the up-and-to-the-right history of Featured Snippets and the investments people have been making optimizing for these results, a 10% drop is worthy of our attention. What happened, exactly?To be honest, when we investigate changes like this, the best we can usually do is produce a list of keywords that lost Featured Snippets. Usually, we focus on high-volume keywords, which tend to be more interesting. Here's a list of keywords that lost Featured Snippets during that time period: CRM ERP MBA buddhism web design anger management hosting DSL ActiveX ovulation From an explanatory standpoint, this list isn't usually very helpful – what exactly do \"web design\", \"buddhism\", and \"ovulation\" have in common (please, don't answer that)? In this case, though, there was a clear and interesting pattern. Almost all of the queries that lost Featured Snippets gained Knowledge Panels that look something like this one: These new panels account for the vast majority of the lost Featured Snippets I've spot-checked, and all of them are general Knowledge Panels coming directly from Wikipedia. In some cases, Google is using a more generic Knowledge Graph entry. For example, \"HDMI cables\", which used to show a Featured Snippet (dominated by Amazon, last I checked), now shows no snippet and a generic panel for \"HDMI\": In very rare cases, a SERP added the new Knowledge Panel but retained the Featured Snippet, such as the top of this search for \"credit score\": These situations seemed to be the exceptions to the rule. What about other SERPs?The SERPs that lost Featured Snippets were only one part of this story. Over the same time period, we saw an explosion (about +30%) in Knowledge Panels: This Y-axis has not been magnified – the jump in Knowledge Panels is clearly visible even at normal scale. Other tracking sites saw similar, dramatic increases, including this data from RankRanger. This jump appears to be a similar type of descriptive panel, ranging from commercial keywords, like \"wedding dresses\" and \"Halloween costumes\"... ...to brand keywords, like \"Ray-Ban\"... Unlike definition boxes, many of these new panels appear on words and phrases that appear to be common knowledge and add little value. Here's a panel on \"job search\"... I suspect that most people searching for \"job search\" or \"job hunting\" don't need it defined. Likewise, people searching for \"travel\" probably weren't confused about what travel actually is... Thanks for clearing that up, Google. I've decided to spare you all and leave out a screenshot for \"toilet\" (go ahead and Google it). Almost all of these new panels appear to be driven by Wikipedia (or Wikidata), and most of them are single-paragraph definitions of terms. Were there other changes?During the exact same period, we also noticed a drop in SERPs with inline image results. Here's a graph of the same 2-week period reported for the other features: This drop almost exactly mirrors the increase in Knowledge Panels. In cases where the new panels were added, those panels almost always contain a block of images at the top. This block seems to have replaced inline image results. It's interesting to note that, because image blocks in the left-hand column consume an organic position, this change freed up an organic spot on the first page of results for those terms.Why did Google do this?It's likely that Google is trying to standardize answers for common terms, and perhaps they were seeing quality or consistency issues in Featured Snippets. In some cases, like \"HDMI cables\", Featured Snippets were often coming from top e-commerce sites, which are trying to sell products. These aren't always a good fit for unbiased definitions. Its also likely that Google would like to beef up the Knowledge Graph and rely less, where possible, on outside sites for answers.Unfortunately, this also means that the answers are coming from a much less diverse pool (and, from what we've seen, almost entirely from Wikipedia), and it reduces the organic opportunity for sites that were previously ranking for or trying to compete for Featured Snippets. In many cases, these new panels also seem to add very little. Someone searching for \"ERP\" might be helped by a brief definition, but someone searching for \"travel\" is unlikely looking to have it explained to them.As always, there's not much we can do but monitor the situation and adapt. Featured Snippets are still at historically high levels and represent a legitimate organic opportunity. There's also win-win, since efforts invested in winning Featured Snippets tend to improve organic ranking and, done right, can produce a better user experience for both search and website visitors. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Knowledge Graph Eats Featured Snippets, Jumps +30%"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Knowledge Graph Eats Featured Snippets, Jumps +30%"
    },
    {
      "level": "H2",
      "text": "What happened, exactly?"
    },
    {
      "level": "H2",
      "text": "What about other SERPs?"
    },
    {
      "level": "H2",
      "text": "Were there other changes?"
    },
    {
      "level": "H2",
      "text": "Why did Google do this?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}