{
  "url": "https://moz.com/blog/know-your-playing-field-the-real-top-100-domains",
  "slug": "know-your-playing-field-the-real-top-100-domains",
  "title": "Know Your Playing Field: The Real Top 100 Domains - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "You would think that if someone didn’t know what they were searching for, they would stop looking. Yet everyday, I talk to people who aimlessly spend their time and energy looking for some far away holy grail.\n\nAs a SEO my quest for success is a little better defined. I want to work on websites…",
  "content": "Know Your Playing Field: The Real Top 100 Domains Marketing Industry By: Danny Dover May 22, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Danny Dover May 22, 2008 Know Your Playing Field: The Real Top 100 Domains Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. 60% of the Top 25 Domains Are Controlled By an Elite Six Download the complete spreadsheet here: CSV EXCEL PDF NUMBERS You would think that if someone didn’t know what they were searching for, they would stop looking. Yet everyday, I talk to people who aimlessly spend their time and energy looking for some far away holy grail. As a SEO my quest for success is a little better defined. I want to work on websites that drive immense traffic, be at the top of competitive SERPs, and most of all, I want to help people. I think many SEOs feel the same way. We have the advantage of knowing what we are searching for. Yet, we still have one huge problem. Where are we supposed to search to learn how to achieve the results we want? I have spent the last week trying to solve this problem. I have compiled a list of what I believe to be the top 100 domains based on estimated monthly visits. These are the companies that have found the success that most SEOs are striving for. To identify them, I downloaded lists of the most popular (US) websites from Alexa, Quantcast, and Compete. Since none of those sources are entirely accurate individually, I used all three sources so I could compare and contrast results. I then researched each company individually to find out what it did, who owned it, and how many visitors it likely received last month. Now that I have my list, I know exactly what I want to do with it. I am going to steal as many great ideas from each company on the list as I can. ;hl=en&rel=0\" name=\"movie\"> ;hl=en&rel=0\"> In fact, the very idea of stealing ideas was stolen from one of the companies on the list Studying the companies individually was useful, but studying them collectively was extremely useful. Below are some of the more interesting findings that helped me understand the online playing field. These graphs and statistics won't necessarily unlock any secrets, but they will help you understand conventional online success. The Big Guys Rule 60% of the top 25 domains are controlled by an elite six. These super internet companies dominate internet usage. This trend is continued when viewed on a larger scale. 43% of the top 100 domains are controlled by an elite dozen. This leads me to think that the surest way to conventional success is to be bought out. Together this elite dozen drives more than 1.3 billion monthly unique visits. This is ignoring the billions of page views made from these web giants' ad platforms. Niches Are Relative The internet seems to have unlimited avenues to success. In reality, there are only 14 likely paths. Location, Location, Location The most popular focus of websites in the top 100 is retail (21%). Of these, 64% do all of their business online. When It Comes To Choosing a URL, Your Choices Are Limited Web 2.0 names may be trendy, but the proven path to internet stardom is convention. 92% of the websites in the top 100 use .com as their primary top level domain name. Content Format Is King While websites like YouTube and Pandora receive a lot of press for being different, the proven path to the top is by focusing on text. Who Really Owns You The vast majority of the websites in the top 100 are publicly owned. This is more likely a symptom of success rather than a cause, but it does hint conventional wisdom. As a bonus, this graph looks like a diseased Pacman eating a piece of delicious blueberry pie I am posting this data here with the hope that other people can glean valuable information from my research. My only request is that you share insights you gather from the spreadsheet with the public. I think every internet marketer is looking for the same thing. Maybe by pooling our resources, one of us will find it. If you have any other advice that you think is worth sharing, feel free to post it in the comments. This post is very much a work in progress. As always, feel free to e-mail me or send me a private message if you have any suggestions on how I can make my posts more useful. All of my contact information is available on my profile: Danny Thanks! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Know Your Playing Field: The Real Top 100 Domains"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Know Your Playing Field: The Real Top 100 Domains"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Danny Dover\n          \n            Danny Dover\n          \n            Danny Dover"
}