{
  "url": "https://moz.com/blog/kpis-and-monthly-objective-metrics-for-people-who-do-seo",
  "slug": "kpis-and-monthly-objective-metrics-for-people-who-do-seo",
  "title": "KPI's and Monthly Objective Metrics for People Who Do SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Today’s post is part inspired by a brilliant question that came up recently in Q&A. The question was based on targets and objective setting for SEO’s and it went something like this:\nWhat metrics should an SEO’s monthly objectives be based on?\nHaving spent a good portion of my SEO career managing…",
  "content": "KPI's and Monthly Objective Metrics for People Who Do SEO Public Relations By: Richard Baxter March 30, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Richard Baxter March 30, 2010 KPI's and Monthly Objective Metrics for People Who Do SEO Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Today’s post is inspired by a brilliant question that came up recently in Q&A. The question was based on targets and objective setting for SEO’s and it went something like this: \"What metrics should an SEO’s monthly objectives be based on?\" Having spent a good portion of my SEO career managing SEO teams in-house, this question really reminded me how interesting the topic of organisational SEO can be, and how underserved it is on all but a few SEO industry blogs. In this in-house SEO focused post, let’s take a look at general KPIs for people and teams who do SEO. Search Engine Visibility (Rankings) While the value of measuring individual search engine rankings is a topic under frequent debate in our community, achieving consistently high rankings for target keywords is ultimately the reason we’re all doing SEO. In competitive markets, particularly, there will be key phrases that SEO teams will be expected to show progress towards gaining rankings for. Making search engine visibility a targeted metric provides a way for the SEO team to focus on the overall performance of the site in question. There are, however, two problems to solve with search engine visibility as a metric, the measurement of rankings and choice of keywords to be monitored. In my previous in-house role we developed a keyword selection methodology based on data from Hitwise UK, our own analytics platform and the Google Keyword Tool. As travel SEO’s, we knew that demand would change seasonally for certain destinations and their corresponding keywords. Using a little historical knowledge of our industry and plenty of data, we would always have a clear idea of seasonal demand for the top 200 industry terms. Measuring rankings on a daily basis allowed us to calculate a percentage based visibility score. What was really fascinating about the whole process was that because the keyword selection methodology remained consistent over a long period of time, we were able to compare visibility scores in year on year increments. As the activities of the SEO team continued to succeed, overall visibility increased from around 60% to 85% over a few years. If you’re interested in developing a similar methodology, you could consider using Advanced Web Ranking to capture rankings data and calculate the visibility score. The beauty of having a search engine visibility score as a KPI is that the metric acts as a key driver for all SEO based activity. Ultimately, as an SEO Manager you have to evaluate how all of your actions contribute to improved visibility, and therefore traffic. Search Engine Traffic Many companies in competitive niches will make use of models to predict traffic levels for the coming year. If you’re lucky, a business analyst will take care of the production of the model itself, leaning on your SEO expertise to help predict how forthcoming trends and planned initiatives may impact overall traffic levels on the site. Your role, as an SEO Manager or in-house SEO is to achieve those traffic levels through maintaining and growing search engine visibility, deploying technical SEO enhancements to grow all important traffic in the long tail and of course, building links! Link Building There’s no doubt that link building is critical to search engine visibility and traffic levels on your site, so it might make sense to create volume targets for a link builder. Unfortunately, deciding exactly how many links a link builder can build is a complex and frequently restrictive process because output depends on the person, the market and the method of link acquisition chosen. In my last in-house role, I found that creating small, seasonal link building projects for my team based on a few key phrases per person worked extremely well. Giving your link builders the creative freedom to design their own strategies based on their own projects and the resources available to them can yield far more valuable results in the long term. The KPI, therefore, may be measured on our new friend search engine visibility on the terms selected by the link building project. Conversion Getting the opportunity to have an input on your site’s conversion rate is a wonderful opportunity to learn a new skill, or improve an existing one! A word of caution, though – only sign up for KPI’s that you can control or heavily influence. In the case of conversion you’ll need a lot of business wide buy in and commitment to conversion rate optimisation projects. If you don’t have the tools or support for that, conversion might not be a great primary KPI to be assigned. Personal Development Goals As a search engine optimisation practitioner, you’ll have spent a fair amount of time learning your trade and perfecting your skills. When you’re managing an SEO team, don’t forget that it’s a good thing to assign some personal development time for each of your staff. I used to set a target of one presentation a quarter on a subject of choice (SEO related, of course). I still think the personal development targets are the best KPI’s of all. If you’re learning, you’re having fun. Of course, every organisation is slightly different and you may have different KPI’s to the ones above. Tell us about them in the comments below! This is a post by Richard Baxter, Founder and SEO Consultant at SEOgadget.co.uk - a niche UK SEO Agency specialising in helping people and organisations succeed in search. Follow him on Twitter and Google Buzz. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "KPI's and Monthly Objective Metrics for People Who Do SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "KPI's and Monthly Objective Metrics for People Who Do SEO"
    },
    {
      "level": "H2",
      "text": "Search Engine Visibility (Rankings)"
    },
    {
      "level": "H2",
      "text": "Search Engine Traffic"
    },
    {
      "level": "H2",
      "text": "Link Building"
    },
    {
      "level": "H2",
      "text": "Conversion"
    },
    {
      "level": "H2",
      "text": "Personal Development Goals"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Richard Baxter\n          \n            Richard Baxter\n          \n            Richard Baxter"
}