{
  "url": "https://moz.com/blog/landing-pages-for-seo",
  "slug": "landing-pages-for-seo",
  "title": "Landing Pages for SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "[Landing Page SEO] What is a Landing Page? A Landing Page is a page that focuses information targeted towards a particular user – and according to Seth Godin, optimized specifically to encourage 1 of 5 actions:",
  "content": "Landing Pages for SEO Link Building I By: IBrian November 3, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! I By: IBrian November 3, 2006 Landing Pages for SEO Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. What is a Landing Page?A Landing Page is a page that focuses information targeted towards a particular user – and according to Seth Godin, optimised specifically to encourage 1 of 5 actions: Get a visitor to click (to go to another page, on your site or someone else's) Get a visitor to buy Get a visitor to give permission for you to follow up (by email, phone, etc.). This includes registration of course. Get a visitor to tell a friend Get a visitor to learn something, which could even include posting a comment or giving you some sort of feedback Landing Pages are common in internet marketing campaigns, especially email and PPC marketing management.Aside from optimising for user action, Landing Pages can make it easier to track/analyse visitor actions, and modify as required.So the key aim of a Landing Page is to optimize the user experience when visiting a site, especially for the first time. This in itself is a good reason to apply them in SEO. After all, there's little point aiming to rank if you fail to convert.And unlike PPC and email marketing campaign's, we're not going to orphan these pages, but instead set them up as major navigational links across the site.In doing so, we’re aiming to: Increase the efficiency by which we can target primary keywords Increase the ability to capture related Longtail Increase the ability to convert visitors And, heck, maybe even track the ROI on the SEO campaign. :) Why Landing Pages for SEO is goodSimply linking and directing visitors to a home page can leave visitors confused, or unclear, as to the action they need to follow to order to find the exact information they need.After all, it can be difficult to provide a distinct call to action for each category of keyword search you target.Some sites will try and address this process to some degree, such as through main category links to help direct traffic to the most useful page. However, these pages are often not best optimised for either SEO or visitor purposes, with only a cursory attempt at putting keywords in titles, etc, rather than making it a pivotal element in a SEO campaign. For example, with ecommerce sites, the presumption is often that if you throw enough products in a category, the user will find what they wanted. It works if the visitor has already made a purchasing decision, and you can provide the product they're looking to buy.But what if the visitor hasn't made a purchasing decision yet? What if they're looking for a related product not listed?This is the benefit of having dedicated Landing Pages - optimised for full user experience, while also optimised to full SEO capacity,Landing Page SEOChances are, the target website covers a number of niche areas.Therefore we look to distil these areas into a handful of pages focused on each niche - and then make these pages the best source of information on these niches, for directing a targeted call to action for search engine visitors.We're not simply aiming to convert our visitors better - we're also aiming to catch more of them.A page dedicated on a specific keyword category can not simply target primary keywords, but also be leveraged to capture a far wider selection of Longtail searchs - a huge variety of longer search phrases based around and related to your primary targeted keywords.Overall, our Landing Page strategy aims to turn specific deep content pages into major portals for their keyword areas that works for both search engines and users, especially by utilising:1. ContentBy focusing on a specific topic area, we can throw in more keyworded headings, keyworded text, and keyworded links within that keyword category.We're not talking about simple keyword stuffing here - but by having a content page focused on a more defined subject niche, we can better develop the content towards visitors interested in specific and related niche topics.We're not simply trying to capture a larger number of keyword variations/related keywords. We're also trying to drive that traffic forward into using either that page or targeted pages within that site to achieve our call to action.TIP: Keep your pages fresh by publishing RSS feeds from within the site - product lists, latest articles, and forum discussion topics - all based around that keyword niche.2. LinksIf we're serious about ranking, at some point we need to apply a link development campaign. However, we've already read that that a site with links only to the index page can look top-heavy and unnatural. This is where Landing Pages truly come into their own.Setting up Landing Pages means we can immediately spread links around to make the ratio of homepage/deep pages much more natural.We also need to ensure that we use varied anchor text to all targeted pages. Ideally, we don't want different versions of the same keywords in our links to these Landing Pages, but instead different keywords used in different ways. We can throw in both generic keywords and product-specific keywords, and cater for the search engine user finding something related to these, and being offered a relevant call to action.TIP: Combining On-Page and Link keywordsAnother key adavantage of Landing Pages is to make your link anchor text work in tandem with page headings/subheadings and, in order to leverage an even wider number of related keywords. For example:Keyword Headings: blue widgets green widgets red widgets Keyword Links: cheap widgets best widgets discount widgets means powering up capture on keyword searchphrases and Longtail based around: cheap blue widgets cheap green widgets cheap red widgets bestblue widgets bestgreen widgets bestred widgets discount blue widgets discount green widgets discount red widgets 3. TrackingOf course, the fact that you’re focusing so much of your link juice on your Landing Pages means it’s easier to track actual results from organic search.Visitors whose first entry page is one of your Landing Pages, must have come about as a direct result of your targeted SEO strategy.You can then track visitor behaviour who come in via Landing Pages and their performance, making tweaks and modifications as required.For example, the chances are, one of your Landing Pages accidentally captures strong traffic from a search phrase you never realised to focus on. You can then modify your page as required to better convert this traffic, and attempt to target similar terms in order to capture similar lucrative traffic streams.SummaryUltimately, a Landing Page is the portalisation of a keyword category that provides an immediate call to action for the general keywords being targeted - but provides additional routes to related niche pages with their own call to action.By combining good content with good links, we can leverage Landing Pages not simply for ranking for primary targeted keywords, but also for major targeting of Longtail search based around our keywords.And, more importantly, Landing Pages can seek to better cater for - and convert - those very visitors who have come through via the search engines in the first place. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Landing Pages for SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Landing Pages for SEO"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "IBrian\n          \n            IBrian"
}