{
  "url": "https://moz.com/blog/landing-page-seo-conversion-or-both-whiteboard-friday",
  "slug": "landing-page-seo-conversion-or-both-whiteboard-friday",
  "title": "Should My Landing Page Be SEO-Focused, Conversion-Focused, or Both? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "What's more important: drawing in more traffic, or converting the traffic you have? When it comes to your landing pages, that may be a tough question to answer. After watching today's Whiteboard Friday, you'll be better equipped to decide whether you should opt for an SEO focus, a conversion focus,…",
  "content": "Should My Landing Page Be SEO-Focused, Conversion-Focused, or Both? SEO Basics | Whiteboard Friday | Conversion Rate Optimization (CRO) By: Rand Fishkin August 5, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 5, 2016 Should My Landing Page Be SEO-Focused, Conversion-Focused, or Both? SEO Basics | Whiteboard Friday | Conversion Rate Optimization (CRO) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. What's more important: drawing in more traffic, or converting the traffic you have? When it comes to your landing pages, that may be a tough question to answer. After watching today's Whiteboard Friday, you'll be better equipped to decide whether your site should opt for an SEO focus, a conversion focus, or a strategic balance of both. Click on the whiteboard image above to open a high-resolution version in a new tab! Video TranscriptionHowdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week we're going to chat about landing pages and conversion-focused landing pages versus SEO-focused landing pages. So a few weeks back, I was at Unbounce's CTA Conference up in Vancouver, Canada, which was an amazing event, one of the best conferences that's put on in our industry, in my opinion. I got a question from a few folks there about how to decide whether to target a landing page toward SEO, toward conversion rate optimization and conversion-focused, or whether we could combine those. So I thought we'd chat a little bit about that today. It is quite doable. An SEO-focused landing page has a few features that are unique from a conversion-focused landing page. In fact, both of them are unique. So what I'm going to do is use the example of Little Hotelier. Little Hotelier offers reservation software, front desk software for small hotels, B2Bs, guesthouses. I thought we could imagine basically a resource page on their website that was really a landing page that's focused on SEO around a hotel booking site database. So, of course, one of the things you have to do if you're a small hotel, or a B2B, or a guesthouse is you've got to get listed on hundreds if not thousands of different listing sites — Booking.com, Expedia, Travelocity, Kayak, etc., etc., all the way down the list, down to the very local-focused ones or regional-focused ones.Managing all those listings is a real pain. So is managing the front desk and the bookings and making sure that everything is convenient. So Little Hotelier manages all this for us and has a resource page. It's not quite as good as the one I'm going to describe here. But let's just imagine for a sec that they have this list of all the hotel booking sites, a database of it with all the information you might want. Then, of course, they have their conversion-focused page, littlehotelier.com, their homepage, which is really all-in-one business software for B&Bs, and guesthouses and small hotels. This is very conversion-focused. They're trying directly to get people to buy the product. This page is much more resource-focused. They're trying to get people to see, \"Hey, here are all of those sites that, well, of course, Little Hotelier can help list you on and manage for you, but also here's just generic and general information about them.\" I think it'd be awesome if they listed all of these sites and included things like traffic and the number of bookings that they saw from those sites in 2015, the requirements to get listed, and the submission page. Then they could have a CTA, a call to action like, \"Let Little Hotelier manage hotel bookings for your property.\" This would work really as an SEO-focused landing page. It's designed to draw traffic in, to drive keywords like \"list of hotel booking sites,\" \"where to submit my small hotel,\" \"most visited hotel booking sites.\" You could even make regional-focused ones of this, like \"hotel listing sites New Zealand\" if they wanted to have a New Zealand-focused set of sites where you could submit or manage yourself in the booking world. This one is really much more targeted, hypertargeted, only focused on the keywords that are going to convert people directly, like \"small hotel software\" or \"B&B hotel reservation software,\" that kind of stuff. The differences and identifying your needsThe differences between these two and the way to identify whether you need one or the other or need a mix of them is to ask a few questions. First off: Are you trying to rank for generic keywords or conversion-focused keywords? Are you trying to rank for both? Are you not worried about keyword rankings at all and you're only concerned with conversion? If you're only concerned with conversion, then you want this one. But if you are worried about both ranking for keywords and trying to convert some visitors, you probably want a more content-focused page like this one, a more SEO-focused landing page. Bounce rate and engagement rate One of the needs that you have with SEO is that you need low bounce rate and high engagement rate. But the reverse is true here. You don't necessarily need to worry about bounce rate, engagement rate, you only need to worry about conversion rate. SEO-focused: So this needs a low bounce rate and a high click-through rate. You want people staying on this page, you want them to click the call to action, and you want them to investigate more. Conversion-focused: But on this page, actually a high bounce rate is okay if the conversion rate is high. So if people are converting from this page, it doesn't matter too much if a lot of people visit and many of them go away from here. That's not too important to you. You're just worried about conversion rate and optimizing for that conversion rate. If you can bring that up a percent, you don't mind if bounce rate also goes up 5% or 6% or 7% because you're turning people off who are the wrong customers. Keyword targetingSEO-focused: Here, you've got to have keyword-targeted content. That means the content itself needs to fulfill all the requirements that Google has and that visitors have around what they're looking for. Conversion-focused: This, keyword targeting is secondary or might even be unnecessary entirely. Editorial linksSEO-focused: This needs to be able to earn editorial links or it can't rank. If it can't earn editorial links, it's going to have a very, very difficult time with manual link building to a conversion-focused page. Commercially-focused pages are much tougher. Conversion-focused: But this one doesn't even need to worry about links at all. AudienceSEO-focused: This one has to serve many audiences. It's treated really like a piece of content that helps anyone who's looking for this information and then has a CTA, a call to action on the page. Conversion-focused: But this one needs to be heavily focused on one particular audience, the particular audience Little Hotelier is trying to convert who's the right customer for them, for their software. Hopefully, those folks are already qualified. SEO-focused: These folks over here are not necessarily qualified. This might be part of the qualification process. If you visit this page and you then say, \"Huh, I'm kind of interested in letting them manage my bookings,\" maybe you should end up here, on this landing page that is conversion-focused. TrafficSEO-focused: This page should be driving traffic to those more conversion rate-focused pages. Conversion-focused: This page, yes, it might rank for some keywords, but it's primarily concerned with direct conversions, and hopefully it's receiving traffic from other onsite channels, like this one, or offsite paid channels that are driving very targeted visitors. What I'd urge you to do is ask yourself these questions when you're considering a landing page. Am I trying to earn traffic that might be interested in my content? If so, you're building one of these (SEO-focused). If you're trying to target an audience that is already qualified, that's already familiar with you, or that you're trying to get familiar with your product, then you're really trying to convert them, in which case you want one of these (conversion-focused). Conversion-focused: These pages are great for doing tons of landing page testing and optimization. They're great for videos. They're great for testimonials. SEO-focused: These types of pages are great for content. They're great for serving all sorts of visitor intense. They're great for targeting a large set of keywords that all have the same searcher intent. When you try and mix these, things get a little challenging. That's where you really need to balance out and decide: \"Hey, what is my primary goal here? Serve the searcher audience, which may not be conversion-focused, or convert people and not worry so much about the searcher audience. Maybe try to capture them on other pages before they get here.\" All right, everyone, look forward to your comments, and we'll see you again next week for another edition of Whiteboard Friday. Take care.Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Should My Landing Page Be SEO-Focused, Conversion-Focused, or Both?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Should My Landing Page Be SEO-Focused, Conversion-Focused, or Both?"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "The differences and identifying your needs"
    },
    {
      "level": "H3",
      "text": "Bounce rate and engagement rate"
    },
    {
      "level": "H3",
      "text": "Keyword targeting"
    },
    {
      "level": "H3",
      "text": "Editorial links"
    },
    {
      "level": "H3",
      "text": "Audience"
    },
    {
      "level": "H3",
      "text": "Traffic"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}