{
  "url": "https://moz.com/blog/landing-pages-report-in-moz-analytics",
  "slug": "landing-pages-report-in-moz-analytics",
  "title": "Help with (Not Provided): New Landing Pages Report in Moz Analytics - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "(not provided) created a big headache for SEOs. To help fill some of the reporting gaps, Moz Analytics is introducing a new Landing Pages report.",
  "content": "Help with (Not Provided): New Landing Pages Report in Moz Analytics Keyword Research | Moz Tools By: Jay Leary June 10, 2014 Table of Contents Copied! By: Jay Leary June 10, 2014 Help with (Not Provided): New Landing Pages Report in Moz Analytics Keyword Research | Moz Tools Update to the Update (7/2/14): Great news! The Landing Pages feature is now available to campaigns that track any one of the Google English-language search engines (identified by \"en-XX\" in Campaign Settings); it's no longer restricted to en-US. Keep in mind you'll also need to connect your Google Analytics account to take advantage of the reporting. Update: The Landing Pages feature is only available to campaigns that track Google US rankings. We are currently building compatibility for other Google English-language domains. You can add Google US on the Campaign Settings page of Moz Analytics by selecting 'United States (English) en-US' There's been a lot of talk about what (not provided) means for SEO practitioners, with Mozzers weighing in on broader implications and alternative strategies. When it comes down to it, we're stuck with a frustrating predicament that's forcing us to change our process. Activities like keyword gap analysis, editorial brainstorming, basic rank tracking, and even SEM planning have become harder to execute. More fundamentally, we're having a tough time answering simple questions like: \"Which keywords are sending traffic to my site(s)?\" \"Which keyword opportunities am I not leveraging? Where are the gaps?\" So where do we go from here? Many of you have already changed your reporting strategies to reflect the new SEO reality. Focusing on topics, landing pages, and broader content strategies is a solid pivot, and we'll be working hard at Moz to support those efforts. But we also recognize that keyword-level data remains an important signal for many SEOs. With that in mind, we're happy to announce a new report in Moz Analytics that will help answer some of those (not provided) questions. Quick Note: The new feature is only available to Moz Analytics campaigns connected to Google Analytics. If you're using the old version of our software (the SEOmoz PRO app) and want to take advantage, be sure to switch your campaigns over to Moz Analytics and connect GA. The Landing Pages report TL;DR We've grouped your tracked keywords by landing page and correlated them with a new metric, Estimated Traffic Share. Use the report to determine which keywords are your strongest traffic drivers. In the new data view, your tracked keywords are grouped by landing page and correlated with both ranking position and visits. The Estimated Traffic Share metric is our best guess at the percentage of visits each keyword contributes. The value is based on a combination of landing page traffic, keyword ranking position, estimated search volume, and SERP click-through-rates. Let's look at a quick example from Rand's blog: We know that Rand's evergreen post about stock options at startups received 170 organic visits. We also know it ranks decently for a couple of relevant phrases including \"startup stock options.\" Based on ranking position and search volume, however, it's a safe bet we're missing at least a few of the most important keyword targets. A peek at the Opportunities tab confirms our assumption: Tracking phrases like \"understanding stock starting a company\" provides additional insight into the post's organic footprint and gives back some of the basic data (not provided) took away. Sometimes you'll see the opposite: Estimated Traffic Shares that sum to a big chunk of the landing page total. In those situations you can make an educated guess that the primary traffic drivers are being tracked. Quick Note: This is obvious but worth stating: in order to get the most out of the new report you need to add tracked keywords to your Moz Analytics campaigns. Not only that, you'll probably want to add a healthy selection of terms to gain the most insight. For inspiration, take a peek at the Opportunities tab. Back to the big picture SEOs know how to adapt. The increase in (not provided) isn't the first time we've lost a valuable data source, and it's probably not the last. With the Landing Pages report and other Moz Analytics updates, we'll do our best to address the changing search landscape. Have a look at the latest release and share your thoughts. As always, if you have any insights or feedback feel free to shoot a message to our extra-helpful Help Team (help (at) moz.com) or sound off in the comments. Not a Moz Pro subscriber? No problem! Take your 30-day free trial. Thanks to our data source partners Big thanks to the team at Grepwords and their amazing data for helping to make this update happen. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Help with (Not Provided): New Landing Pages Report in Moz Analytics"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Help with (Not Provided): New Landing Pages Report in Moz Analytics"
    },
    {
      "level": "H2",
      "text": "The Landing Pages report"
    },
    {
      "level": "H2",
      "text": "Back to the big picture"
    },
    {
      "level": "H3",
      "text": "Thanks to our data source partners"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jay Leary\n          \n            Jay Leary"
}