{
  "url": "https://moz.com/blog/lastfm-best-signup-ever",
  "slug": "lastfm-best-signup-ever",
  "title": "Last.fm: Best. Signup. Ever. - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Last.fm's signup page is one of the best I've ever seen.  It's elegant, user-friendly, and does a fantastic job of keeping the user aware of what's going on. Rather than splitting the signup process into several steps across multiple pages or combining them all into one massive form,  it splits it…",
  "content": "Last.fm: Best. Signup. Ever. Design O By: Oatmeal June 15, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! O By: Oatmeal June 15, 2006 Last.fm: Best. Signup. Ever. Design The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Last.fm's signup page is one of the best I've ever seen. It's elegant, user-friendly, and does a fantastic job of keeping the user aware of what's going on. Rather than splitting the signup process into several steps across multiple pages or combining them all into one massive form, it splits it into three steps but keeps everything on one page. As you go through the signup process the steps you've completed become greyed out. It also uses just the right amount of AJAX to aid in the signup process. Kudos to the designers/developers that put this together. It'd be interesting to see if this process would work for an e-commerce checkout page. Last.fm's Three Column Layout As far as Last.fm's actual service goes, I've just gotten started with it so I can't vouch for how good it is. It did win first place in the music section of our Web 2.0 Awards, however. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Last.fm: Best. Signup. Ever."
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Last.fm: Best. Signup. Ever."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Oatmeal\n          \n            Oatmeal"
}