{
  "url": "https://moz.com/blog/lazy-searchers",
  "slug": "lazy-searchers",
  "title": "Lazy Searchers - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Are we creating lazy searchers? The thought came up while reading a blog mentioning that RSS technology has resulted in readers waiting for blogs to come to them. Are searchers beginning to wait for the search to come to them?    Google (toolbar), and recently Yahoo, will finish a search phrase for…",
  "content": "Lazy Searchers Public Relations S By: sarita-55215 December 9, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! S By: sarita-55215 December 9, 2007 Lazy Searchers Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Are we creating lazy searchers? The thought came up while reading a blog mentioning that RSS technology has resulted in readers waiting for blogs to come to them. Are searchers beginning to wait for the search to come to them? Google (toolbar), and recently Yahoo, will finish a search phrase for you. SEOrs and PPCrs think we know what words you want to use to find a site. Searchers barely have to type a single word before coming to a result…they don’t even have to spell the word correctly. Ads mysteriously show up like my mind was read, regardless if I could correctly articulate my end goal. Internet advances have done curious things to our society--for example, students not knowing how to correctly punctuate, and turning schoolwork in written like a text message. Are lazy searchers on the horizon? I’m curious to hear your opinions… Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Lazy Searchers"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Lazy Searchers"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "sarita-55215\n          \n            sarita-55215"
}