{
  "url": "https://moz.com/blog/leading-characteristics-of-reviews",
  "slug": "leading-characteristics-of-reviews",
  "title": "The Leading Characteristics of Review Writers, Review Readers, and Successful Owner Responses - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Following our publication of The Impact of Local Business Reviews on Consumer Behavior, Miriam distills the dominant traits, characteristics, and behaviors shown by reviewers and business owners. These insights are meant to help you envision both the public and practices in an approachable manner,…",
  "content": "The Leading Characteristics of Review Writers, Review Readers, and Successful Owner Responses Local SEO By: Miriam Ellis November 23, 2022 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis November 23, 2022 The Leading Characteristics of Review Writers, Review Readers, and Successful Owner Responses Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Common sense is a useful asset, and as it turns out, it’s a fairly reliable guide when it comes to navigating the big world of online local business reputation. However, for the very first time, thanks to the recent report, The Impact of Local Business Reviews on Consumer Behavior, I was able to test my intuition against original, hard data revealing the habits of real review readers, review writers, and successful owner responses. I highly recommend reading the full survey analysis, but today, I want to distill that mass of data down into three simple descriptions that emerged through the considerable work of analysis. These three descriptions codify dominant traits, characteristics and behaviors. They are meant to help you envision both the public and practices in an approachable manner, with the proviso that some people and industries will certainly fall outside these norms. For the bulk of local businesses, however, it’s my hope that this synthesis enables you to form a useful mental picture of who and what you’re working with when it comes to growing and managing your reputation. Review readers are: Habituated, very trusting unless faced with obvious signals of spam or low quality, much more trusting of other customers than of brands, still highly reliant on real world WOM recommendations, eager for a substantial amount of recent sentiment including negative sentiment, extremely forgiving when problems are resolved, and just one step away from interacting directly with your brand. The data: Review reading is now a given; 96% of the working age public will read reviews this year to navigate their local landscape. 56% of review readers are highly active daily or weekly readers. Even less active review readers (31%) will turn to reviews monthly or multiple times per year to get local business information.Reviewers spend the majority of their time reading Google-based reviews, but they cite at least a dozen other places where they are regularly reading reviews.With 86% of consumers citing reviews as either the most important or somewhat important signal of whether a business can be trusted, reviews are the most influential sales copy review readers will encounter. In fact, only 11% of consumers say they trust what a business says about itself more than they trust what customers say. 83% of review readers trust reviews as much or more than they did 3 years ago.When choosing between businesses, review readers evaluate the following elements in order of importance: star rating, text content, recency, overall number of reviews, and the presence of owner responses.Review readers are not as demanding as you might think. Only 13% of review readers require a perfect 5-star rating in order to choose a business. In fact, 44% cite flawless ratings as suspicious. 85% will consider a business with an overall 3 to 4-star rating.Review readers filter for recent and negative sentiment first.Review readers want a substantial amount of reading material. 70% will look at 5-20 reviews before considering a business.Review readers’ trust can be lost at a glance. When a local business reviews itself or has suspect profiles reviewing it, or when its star rating or review count is notably low compared to competitors’, trust is eroded and review readers may look elsewhere.Reviews exist on platforms over which businesses have only partial control, but a review readers’ next step lands them back in the brand’s own ball court most of the time, with a combined 91% of readers ending up on the website, at the place of business, or contacting the business directly as their next step. In other words, reviews have added to, but not replaced, traditional shopping behaviors.The tradition of your brand’s good name being on people’s lips also hasn’t changed. 67% of review readers cite the real-world recommendations of friends and family as being their top alternative resource to reading reviews. Review writers are: Civic-minded, appreciative, often self-motivated but more frequently in need of prompting, prone to forget to write when they are busy, highly likely to review you if asked via email, text, or face-to-face, active on multiple review platforms, deeply offended by rude service, bad products and incorrect online local business information, very willing to update what they’ve written and give a business a second chance when a complaint is resolved, and a key source of both sales and quality control. The data: Writing reviews is already a way of life for 41% of your customers who write reviews on a daily, weekly or monthly basis. An additional 44% who will write reviews several times a year may need to be asked, prompted and reminded.66% spend most of their time writing Google-based reviews, but review writers list at least a dozen other platforms where many spend time leaving sentiment.Review writers say 65% of the negative reviews they write stem from bad/rude customer service. 63% cite a bad product, 52% cite false or incorrect online business info on assets like local business listings, 38% cite low-quality work on a job, 28% cite the failure of the business to resolve complaints in-person, and 28% cite inadequate safety protocols.73% of review writers are civic-minded, leaving sentiment to benefit their community, 63% write to express appreciation to local businesses, and 38% write to tell a local business that it needs to improve.39% of review writers haven’t been directly asked to write a review in the past 5 years. If asked, 85% will always, usually or at least sometimes write a review. Just 4% never write reviews in response to requests.54% of review writers like to be approached via email, 45% prefer person-to-person, and 29% prefer texting.38% of review writers simply forget to review your business when they have free time. 30% find the review writing process too confusing, 26% don’t believe the business will care enough to read what is written, and 19% are not being directly asked to write a review. Successful owner responses should: Happen within a two-hour to two-day time frame to please most reviewers, resolve stated complaints, avoid any type of acrimony, offer thanks for positive feedback and apologies for negative experiences, and be written with exceptional care because they influence 90% of customers to a moderate or extreme degree. The data: Owner responses influence 90% of customers to a moderate or extreme degree.60% of customers expect a response to their review within 2 days or less; 11% expect a response within 2 hours, 21% expect a response within 24 hours, and 28% expect a response within 48 hours; 24% say they expect a reply within a week.54% of customers will definitely avoid a business that is failing to provide a solution to a problem, 46% will definitely avoid a business with an owner who argues with customers in reviews, 47% of consumers will definitely avoid the business when an owner response offers no apology.Only 40% of customers have come to expect thanks for positive reviews. 64% of customers expect a response to negative reviews.67% of negative reviewers had an improved opinion of a brand when the owner responded well. 62% of negative reviewers would give a business a second chance after an owner response solves their problem. 63% of consumers will update their negative review or low-star rating once an owner response resolves their complaint. In conclusion Any local business which is founded on a customer-centric and employee-centric model already has a built-in advantage when it comes to managing the offline experiences that form the online brand narrative. Shoppers and staff simply want to be treated fairly and well. Local companies that meet these criteria in-store are capable of utilizing the same skills online, where digital sentiment has become like the front porch on a general store – a meeting, greeting, and helping spot for the community. Local business owners and their marketers may need to invest in a few new tools to hang out on that porch effectively - think of them as the awning or wood stove you install to facilitate maximum comfort for everybody. But the skills that bring these tools to life are the ones the best local entrepreneurs already know - respect, attentiveness, accountability, empathy, responsiveness. Now we have the data to prove that the common sense approach of treating everyone well is actually very good business. Hungry for more review data? Read: The Impact of Local Business Reviews on Consumer Behavior. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Leading Characteristics of Review Writers, Review Readers, and Successful Owner Responses"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Leading Characteristics of Review Writers, Review Readers, and Successful Owner Responses"
    },
    {
      "level": "H2",
      "text": "Review readers are:"
    },
    {
      "level": "H3",
      "text": "The data:"
    },
    {
      "level": "H2",
      "text": "Review writers are:"
    },
    {
      "level": "H3",
      "text": "The data:"
    },
    {
      "level": "H2",
      "text": "Successful owner responses should:"
    },
    {
      "level": "H3",
      "text": "The data:"
    },
    {
      "level": "H2",
      "text": "In conclusion"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}