{
  "url": "https://moz.com/blog/lead-generator-mostchoice-must-pay-a-competitor-48-million-dollars-for-creating-fake-leads",
  "slug": "lead-generator-mostchoice-must-pay-a-competitor-48-million-dollars-for-creating-fake-leads",
  "title": "Jury Says Lead Generator MostChoice Should Pay Competitor 4.8 Million Dollars For Creating Fake Leads - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "May It Please the Mozzers, \n\nA Jury awarded 4.8 million USD to NetQuote after finding that its competitor, MostChoice, submitted more than 3,500 false applications for insurance quotes to the NetQuote website. \n\nThe jury was so pissed that it actually awarded double the punitive damages than...",
  "content": "Jury Says Lead Generator MostChoice Should Pay Competitor 4.8 Million Dollars For Creating Fake Leads E-Commerce SEO By: Sarah Bird November 10, 2008 Table of Contents Copied! By: Sarah Bird November 10, 2008 Jury Says Lead Generator MostChoice Should Pay Competitor 4.8 Million Dollars For Creating Fake Leads E-Commerce SEO May It Please the Mozzers, A Jury awarded 4.8 million USD to NetQuote after finding that its competitor, MostChoice, submitted more than 3,500 false applications for insurance quotes to the NetQuote website. The jury was so disgusted with MostChoice that it actually awarded double the punitive damages that NetQuote asked for in the lawsuit. Getting punitive damages is unusual; getting double what you asked for is extremely rare. After reviewing the allegations in the case, I'm not surprised that the jury wanted to teach MostChoice a lesson. Both companies operate websites where consumers submit applications for competitive quotes on insurance. Each company then resells the lead information to insurance brokers, who then contact the individuals with an insurance quote. Obviously, the challenge for lead generators is to produce accurate, genuinely interested leads. NetQuote filed suit in 2006 after receiving complaints from insurers that it was forwarding bogus leads. After investigating, NetQuote's attorneys discovered that MostChoice had hired a man named Brandon Byrd to submit false applications to NetQuote's website. Allegedly, Byrd worked 20-30 hours a week over nine months submitting at least 3,500 false applications, thus polluting NetQuote's lead database. Some insurance agents and brokers ended their relationship with NetQuote citing bad leads. As if this trickery wasn't enough, MostChoice also advertised on its site (and apparently still does) \"Better than Netquote Leads.\" Ouch. MostChoice had some creative defenses in this history of the case. It claimed at one point that it shouldn't be held liable for damages resulting from false leads because NetQuote often receives bad leads without MostChoice's help. It also claimed that it couldn't be held liable because it didn't know that NetQuote would actually act on the fake leads MostChoice was feeding NetQuote. MostChoice also argued at one point that it did NetQuote a favor; if MostChoice had never submitted all those false leads, NetQuote would never have developed its super awesome lead filtering system! Not too surprisingly, the Court rejected these argument and others. MostChoice also had the audacity to countersue NetQuote for \"click fraud.\" Allegedly, NetQuote's employees sometimes clicked on MostChoice ads for which MostChoice paid per click, without any intention of using MostChoice's service. NetQuote employees apparently did this 25 times from October 2004 through August 2005, and 27 times from January 2007 through September 2007. (Srsly?) The court dismissed the counter claim earlier in the case because there was no evidence that NetQuote engaged in any misrepresentation. They clicked on MostChoice's ads to see what services it was offering as part of their practice of checking out what the competition was doing on Google, Yahoo! and other search engines. NetQuote's employees never completed an application for insurance nor were they \"prompted by some illicit purpose.\" In addition to the Jury deciding that MostChoice should pay 1.6 million in actual damages and 3.2 million in punitive damages, the jury also decided that Byrd should pay $10,000.1 NetQuote only asked for $1 for damages against Byrd, but apparently the jury wasn't impressed with his conduct either. Although the jury issued its verdict, it is still possible for the judge to reduce the award if MostChoice succeeds in convincing the judge that the jury responded solely out of emotion and contrary to law. I wouldn't hold my breath. Best Regards, Sarah If you want to read more: Case filings on Justia.com Rebecca Tushnet covers all the legal angles on the Summary Judgment with aplomb. The Denver Post also gives you the nitty gritty. Insure.com also covers the jury award. 1. Under threat of legal action by Mr. Levy, I have changed to the language in this article to clarify that when a jury awards a verdict, the defendant is not required to pay until the judge enters the judgment. As indicated, judges don't always turn the jury verdict into a judgment. The lawyers can make arguments to the judge as to why a jury award should or should not be entered as a judgment. Mr. Levy informs me that there are many developments in the case since I wrote this article. I encourage readers to review his comments below. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Jury Says Lead Generator MostChoice Should Pay Competitor 4.8 Million Dollars For Creating Fake Leads"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Jury Says Lead Generator MostChoice Should Pay Competitor 4.8 Million Dollars For Creating Fake Leads"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Common Mistakes E-commerce Websites Make Using JavaScript"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sarah Bird\n          \n            Sarah Bird\n          \n            Sarah Bird"
}