{
  "url": "https://moz.com/blog/leaking-rumors-ses-smx-speaker-exclusivity",
  "slug": "leaking-rumors-ses-smx-speaker-exclusivity",
  "title": "Leaking Rumors... SES, SMX & Speaker Exclusivity - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Usually, I don't like to post unsubstantiated rumors because the potential for trouble is high and it's often not worthwhile. However, this time I'm posting with the express goal of stopping the situation from becoming a reality (or at least requesting a re-think). Here's the deal...\n\nToday at the…",
  "content": "Leaking Rumors... SES, SMX & Speaker Exclusivity Public Relations By: Rand Fishkin June 4, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin June 4, 2007 Leaking Rumors... SES, SMX & Speaker Exclusivity Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Usually, I don't like to post unsubstantiated rumors because the potential for trouble is high and it's often not worthwhile. However, this time I'm posting with the express goal of stopping the situation from becoming a reality (or at least requesting a re-think). Here's the deal... Today at the SMX conference, two sources that I trust told me independently that last week, the folks who run the Search Engine Strategies conference series, Incisive Media, were planning to institute a speaker exclusivity agreement following SES San Jose. This would mean that if you speak at SMX, you cannot be an SES speaker, and likewise, if SES gets you as a speaker, they'd require that you don't also speak for SMX. Obviously, there's some politics involved, but I think it's probably secondary to the business strategy on the part of Incisive, who doesn't want the increased competition form Danny's new SMX venture. From a strategic standpoint, I understand their position, and I have lots of friends in the SES hierarchy, Tim Walsh (with whom I recently spent some great times with in China), among them. I hadn't heard this from him - just the opposite - that he felt the market had plenty of room for both conference series. Thus, I'm guessing the decision may come from someone who doesn't regularly attend or participate in the conferences. To that unknown individual (or group), I'd ask you to reconsider. I know I'm just a search blogger, and a speaker (so it's hard to say I don't have a proprietary interest), but my gut feeling is this will be a divisive move that hurts the industry and many personal relationships. To the SEOmoz community, and to the wider search community, I pose this question - if you were Incisive, would you institute this rule? Do you think there's a strategic advantage there? p.s. The Google Dance tonight was fantastic, and Ask's new SERPs (which debuted, at least to me, right outside the entrance - thanks Patrick - look terrific). This is an amazing conference for networking - possibly the best relationship forming and building that I've done at any single event. Lots more coverage is on its way! UPDATE: Kevin Newcomb posted this below: Hi Rand, I just spoke with Tim Walsh, and he assures me that this rumor is false. Incisive Media has no plans to institute a speaker exclusivity agreement for any of our conferences. Hope this clears things up, Kevin Newcomb News Editor, Search Engine Watch Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Leaking Rumors... SES, SMX & Speaker Exclusivity"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Leaking Rumors... SES, SMX & Speaker Exclusivity"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}