{
  "url": "https://moz.com/blog/learn-from-a-search-ranking-dominator-nymagcom",
  "slug": "learn-from-a-search-ranking-dominator-nymagcom",
  "title": "Learn from a Rankings Dominator - NYMag.com - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Mystery Guest and I arrived in New York on Saturday and have been enjoying the city tremendously. During our stay, I've been conducting a remarkable number of searches to find museums, shows, restaurants and shopping. One site has consistently dominated the results at Google and, as an SEO, I…",
  "content": "Learn from a Rankings Dominator - NYMag.com Online Advertising By: Rand Fishkin April 10, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 10, 2007 Learn from a Rankings Dominator - NYMag.com Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Mystery Guest and I arrived in New York on Saturday and have been enjoying the city tremendously. During our stay, I've been conducting a remarkable number of searches to find museums, shows, restaurants and shopping. One site has consistently dominated the results at Google and, as an SEO, I couldn't be more impressed - NYMag.com has done a remarkable job building and marketing their site. A few of their top rankings: #1 for New York Restaurants #1 for New York Sales #1 for Best of New York #2 & 3 for New York Nightlife #1 for Balthazar Soho (a popular restaurant) #3 for New York Galleries They're at the top for general queries & specifics and the best part is - their content is truly top-notch. Every time I see them in the results, even if they're not #1, I click their listing. To help analyze why they've had this tremendous success, I'll point out a few of their best features. Layout & Design The layout follows some good conventions - top level navigation at the top, section-specific navigation on the left sidebar and featured content navigation in the center. Ads don't overwhelm the site, though they are present, and a multi-header on the right helps make for more accessible content. The design is terrific - simple, elegant & classic - it fits perfectly with the branding of the magazine. Navigation The navigation throughout the site is good, but the restaurant (and store) finder in particular are brilliant. The criteria allow you to refine quickly via a drop-out sidebar, sorting by price or cuisine, name or rating are easy. Content The content throughout the site is top notch - great reviews of restaurants (like this one for Craft) include maps, slideshows, a brief but informative write-up, user reviews, links to the official website (I hate when that's missing) and often, even a link to the menu. The screenshot above showcases their shopping section, where the latest sales are posted the day they're announced so smart New Yorkers can save on Allessandro Dell'Acqua's Italian fashion. Content like this is bound to attract links - it's one of the major advantagesof being a respected publication, too. With reporters and relationships in place, your access to breaking news and direct sources is considerably higher than a site like Yelp, Judy's Book or even Citysearch. Smart SEO NYMag.com has nearly perfect title tags & URLs: http://nymag.com/movies/ - Movies in New York City - Showtimes and Reviews - New York Magazine http://nymag.com/restaurants/openings/30315/ - New York Restaurant Openings - Provence - Resto - Gold St. - Zipper Tavern - New York Magazine http://nymag.com/realestate/ - Real Estate - New York Magazine http://nymag.com/listings/restaurant/provence/ - Provence - Soho - New York Magazine Restaurant Guide These follow nearly every rule I've got for good title tags & great URLs, and although I might try things a bit differently, when you compare them to the NY Times, Citysearch or other competitive listings, they're a clear leader. I've got to run, but please share with us some of the sites you learn from and what you've gathered. p.s. SES NYC is going great - Mystery Guest and I were treated to Babbo last night after the IM-NY event. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Learn from a Rankings Dominator - NYMag.com"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Learn from a Rankings Dominator - NYMag.com"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}