{
  "url": "https://moz.com/blog/learn-seo-cyoa",
  "slug": "learn-seo-cyoa",
  "title": "How to Learn SEO: Choose Your Own Adventure Edition - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "\"How can I learn SEO?\" is a deceptively simple question. The standard approach is to attempt to appeal to anyone who's interested in SEO without any idea of your previous experience or the actual reasons you want to learn SEO.  That's fun. Especially the part about weeding through tons of…",
  "content": "How to Learn SEO: Choose Your Own Adventure Edition SEO Basics By: Isla McKetta July 27, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Isla McKetta July 27, 2015 How to Learn SEO: Choose Your Own Adventure Edition SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. \"How can I teach myself SEO?\" is a common yet deceptively simple question. The standard approach is to attempt to appeal to anyone who's interested in SEO without any idea of your previous experience or the actual reasons you want to learn SEO. That's fun. Especially the part about weeding through tons of information that might not even apply to what you want to learn. So let's fix that. This guide is written to help you choose your own SEO adventure. If you know very little about SEO and just want to learn enough to impress your CMO, start at the beginning and stop when you feel like you understand enough concepts. Or if you've been doing SEO for years but need a brush up on the latest tips and tricks before impressing a potential client or employer, there's a path for you too. Be sure to follow the links. They refer you to resources that are much more in-depth than we could reproduce in one post. First choose your character SEO Newbie You may know what a title tag is, but you aren't quite sure how to use it or why. The SEO Newbie could be a web developing hobbyist on the verge of a new obsession or someone looking for the next growing career path. Regardless, you have the most to learn (and the most to gain) from this adventure. Start at the very beginning with What is SEO? and explore as many paths as you can. You might be surprised at the bits of information you pick up along the way. For a guided tour, follow the teal boxes. Don't forget to bookmark this page so you can come back and learn more once you've absorbed each batch of info. Veteran SEO You were doing SEO back in the days of AltaVista, so you know all the things to know. Except maybe you took a break for a few years or decided to swap that black hat for a gray (or even white) one and need to know what's the what with the major changes in the past few years. Make a quick stop at the Algorithm Change History to catch up on the latest updates and penalties. After that, we'll guide you through some of the topics that are more likely to have changed since you last checked. Just look for the purple boxes. SEO-Curious Marketer You've heard of SEO. You might even have worked with a few SEOs. Now you're ready to dig in and understand what everyone's talking about and how you can use all that new info to improve your marketing (and maybe level up your career at the same time). Start with What is SEO? and look for shortcuts in orange boxes along the path to gather highlights. You can always dig deeper into any topic you find especially interesting. Whichever path you choose, don't worry, we'll keep weaving you in and out of the sections that are relevant to your learning needs; just look for the color that's relevant to your chosen character. Table of contents For you table of contents types who like to read straight through rather than have someone set the path for you, here's a quick look at what we'll be covering: What is SEO? Building an SEO-friendly site Content and related markup On-site related topics Link-related topics Other optimization Test your new skills Celebrate your success Other resources 1. What is SEO? First things first. It's hard to learn the ins and outs of SEO (search engine optimization) before you even know what it is. In the following short video, Rand Fishkin (a.k.a. the Wizard of Moz) defines SEO as \"The practice of increasing the quantity and quality of the traffic that you earn through the organic results in search engines like Google, Yahoo, and Bing.\" Watch it to understand the difference between paid search and organic search and a few basic things about improving click-throughs from search pages. Ranking factors A lot of different factors, from site speed to content quality, are important in SEO. These are, as far as anyone can tell, the factors that search engines use in determining whether or not to show your page to searchers. For a great intro to those elements and how they interact to affect your site's overall ranking, check out Search Engine Land's Periodic Table of SEO Success Factors. Why SEO? That's all nice, but if SEO is starting to seem like a lot of work, you probably want to understand whether SEO is even worth it. The short answer is that yes, SEO is worth it, but only if you want potential customers to be able to find your site when they're searching on Google (or any other search engine). Yes, search engines are crawling your site, but those crawlers aren't as sophisticated as you might like. SEO gives you more control over how your site is represented in those search engine results pages. Good SEO can also improve how users experience your site. Learn more with Why Search Engine Marketing is Necessary. About search engines Who are these search engines anyway and why do we spend so much time worrying about how they see our sites? To get the best answer, let's look at that question from two points of view: search engines and searchers. How search engines operate First, it's important to understand how search engines crawl sites, build their indexes, and ultimately determine what's relevant to a user's query. Some of the specifics are trade secrets, but this section of the Beginner's Guide to SEO offers a solid overview. And for an introduction to how Google ranks pages, watch this video: As you're learning about SEO, remember that not everything you read on the Internet should be treated as gospel. Here are some common myths and misconceptions about search engines. The human side of search Understanding how people use search engines is as crucial to SEO as understanding their needs is to marketing. Learn about classic search query patterns and how people scan search results here. Search engine results pages So far we've dropped a lot of phrases like \"search results\" and \"search pages,\" but what does any of that really mean? Search Engine Land does a great job of decoding the standard search engine results page (SERP). It's a strong foundation for understanding why everyone is shooting to be in the top ten search results. But one thing you'll find the more you get into SEO is that SERPs are rapidly evolving. Ads move, knowledge graphs appear (and disappear) and sometimes local search results invade. Dr. Pete takes you on a tour of how SERPs have changed and why ten blue links are probably a thing of the past in this article. Penalties and algorithm updates And then there's the darker side of SEO, because once there's a system, there's someone trying to game that system. Spend more than a few minutes talking to anyone about SEO and you'll hear something or other about black hat tactics like keyword stuffing and unnatural linking. If you decide to use these tactics, you might soon become acquainted with search engine penalties. These algorithm updates, like Hummingbird and Penguin, are implemented by search engines at various intervals. The official word is that these updates improve user experience, but they can also be effective ways to penalize SEOs using spammy tactics. Learn more about Google's algorithm updates. That page includes not only a full history of prior penalties, but it's consistently refreshed when a new algorithm update is confirmed. SEO veterans, you get to skip ahead of the class now to learn about the current state of page speed, mobile web development, and competitive research along with info on the best tools available today. Analytics platforms (or how to measure SEO) As you can see, a lot of work can go into SEO, but the results can be pretty incredible, too. To track your progress in topping the SERPs, make sure you're using an analytics platform like Google Analytics or Omniture. You can get by with something like Rank Tracker to track rankings on keywords as a start, but eventually you're going to want some of the data those more sophisticated tools offer. Brain full? You've just learned everything a beginner needs to know about what SEO is. Go take a walk or get some coffee and let all that info soak in. Before you go, save this bookmark. SEO newbies, when you come back, you'll be in exactly the right place to start putting some of your new knowledge into action by practicing how to build an SEO-friendly site. SEO-curious marketers, you might not want to go to the trouble of actually building a site, but you'll learn a lot by reading through the next section and the related materials. 2. Building an SEO-friendly site First of all, don't freak out, you don't have to build a totally new site to get something out of this section. But if you're an SEO Newbie intent on making a career of this, you might want to set up a practice site to really get your hands dirty and learn everything you can. About domains and URLs Before you start worrying about site content and structure (aka the fun stuff), you have a real chance to set your site up for success by using a strong domain name and developing a URL structure that's SEO and user friendly. This stuff can be hard to change later when you have hundreds (or thousands) of pages in place, so you'll be glad you started out on the right foot. Domains While you're decades too late to score \"buy.com,\" it's never too late to find the right domain name for you. This resource will help you sort through the SEO dos and SEO don'ts of selecting a root domain and TLD (don't worry, all is explained) that are memorable without being spammy. There's even info on what to consider if you have to change your domain name. Don't skip the section on subdomains—it could save you from making some rookie duplicate content errors. Anatomy of a URL Oh the SEO havoc that can ensue when your URLs aren't set up quite right. Learn what not to do. Site structure Woo-hoo! Now that you have a site, it's time to think about how best to structure your site. Remember that you want to be thinking about both search engines and users as you set up that site. For example, that amazing Javascript menu you had designed might not be bot-friendly. Things to think about at this point are that your content is indexable (that the crawlers can actually find it) and that you don't have any orphaned pages. Learn more about those issues here. Sitemaps And then you're going to need a sitemap. Sitemaps help search engines index your content and understand the relationships between pages. So where better to get advice on how to build and implement a sitemap than straight from Google. Internal links Another vital way to show search engines what pages are most important/related (and to help humans navigate your content) is through internal links. You want enough links to show users what's what, but not so many that it's impossible to tell what's really important/related. Read more about optimal link structure and passing ranking power. Page speed How long it takes a page on your site to load (page speed) mattered when we were all using desktops, but it's crucial now that so much Internet traffic comes from mobile devices, plus it's one factor in how pages get ranked. So whether you're new to SEO or looking for new tricks, page speed might be a good place to start. Use Google's PageSpeed Insights to get specific recommendations on how to speed up your site and then get crackin'. Mobile web development Speaking of mobile traffic, is your site mobile friendly? Learn about the difference between responsive designs and device-specific solutions on our mobile optimization page. You'll also see a list of don'ts for mobile design (ever tried to close a pop-up on your iPhone?). This only gets more important the more mobile traffic you get (and want). Phew! That was a lot of information, but once you've absorbed it all, you'll have an excellent handle on site structure (which will save you a lot of trouble down the line). Bookmark this spot, then take a well-deserved break. We'll start back here together when you're ready. 3. Content and related markup Now that you have that site framework all set up, it's time to get to the good stuff—populating it with content! Competitor analysis Before you write or post too much of your own content, you might want to see what's working (and what isn't) for your competitors. This analysis helps you identify those competitors and then understand what their links, rankings, and keywords look like. It's important to update this research occasionally because your competition might change over time. Veteran SEOs, you can skip straight ahead to Schema structured data unless you want a refresh on any other topics related to content. SEO newbies, you'll want a deep understanding of keyword research, SEO copywriting, and the other content-related topics in this section. Get yourself a coffee and then settle back in to learn a ton. Marketers, this is your chance to learn all the basics for SEO-friendly content, so stick with us for a spell. You won't need the same depth of understanding as someone who plans to do SEO for a living, so let your curiosity guide you as deep into any of these topics as you want to go. Keyword research You may feel like you just did keyword research in the last step, but it's crucial enough that we're going to dive a little deeper here. Understand the value of a particular keyword and see what kind of shot you have at ranking for it by reading Chapter 5 of the Beginner's Guide to SEO. SEO copywriting We promised you'd get to actually create content and that time is finally here! Now that you have an understanding of the competitive landscape and the keywords you want to (and can) rank for, write away. Remember that while you're really writing content for users, a few simple tips can help your content stand out to search engines too. Isn't it nice when something does double duty? On-page factors and meta data For really search engine-friendly content, you're going to want to make sure your meta data is all in order. That includes title tags, meta descriptions, and alt attributes. Go the extra mile by incorporating Schema structured data into your content. This additional info gives search engines the data they need to include rich snippets (like review boxes) below your search results. Veteran SEOs, it's a good idea to skip ahead to on-site related topics now. Newbies, your SEO education is not complete without a solid understanding of duplicate content, SEO for video, and how to measure success, so stick with this section until the end. Marketers, duplicate content is something you're going to hear a lot about and it doesn't hurt to understand video SEO and how to measure success, so continue to read onward in this section. Duplicate content Duplicate content is the bane of a website. Even if you think you've done everything right with your content, there's a chance that a dynamic URL or something else is surfacing that same content to crawlers more than once. Not only does Google fail to see the logic in \"twice as much is twice as nice\" but they might also penalize you for it. Navigate around the most common pitfalls. SEO for video Content doesn't just mean words, but unfortunately, the crawlers aren't (yet) sophisticated enough to parse things like images and video. If your alt attributes are in good shape, you're covered for images, but there are some SEO tactics you need to incorporate if you're using video on your site. The good news is that once your video SEO is in good shape, video content often gets better rankings than text. Measuring success So you've got all that content on your site, but how do you know if it's actually helping your SEO? At the beginning is a good time to set yourself up to measure your success so you can establish a baseline. Learn more about what metrics you should be tracking and how. Time for yet another well-earned break. Grab a nap if you can and then spend a day or so observing how these issues are handled by other sites on the web. For maximum learning, try practicing some of your newfound knowledge on a site you have access to. Set your bookmarks before you go. When you're ready to continue learning SEO, Newbies should make a stop at on-site related topics to get familiar with Robots.txt and HTTPS. Any veterans still hanging about might want to take a quick read through on-site related topics to see what might have changed with Robots.txt and to take in the latest wisdom on HTTPS. Marketers, you get to sit that one out and head straight on over to link-related topics. 4. On-site related topics For the true SEO aficionado, there are some technical details that you must get right. We've all heard stories of people accidentally blocking their site from being crawled and then wondering where all the traffic is. To keep from being one of these, learn about Robots.txt: how it helps you get found and when blocking robots is not actually effective. The other technical on-site topic you'll want to master is the switching of your site from HTTP to HTTPS without slowing down your site or losing traffic. This is especially important since Google announced that HTTPS is a ranking factor. See how far you've leveled up already by getting current on just those two topics? Bet you aren't even tired yet. Newbies, it's time to dive straight into link-related topics. Veterans, go check out guest blogging for a look at how that practice has changed. 5. Link-related topics You now know a lot about how to make your site SEO friendly. Now it's time to look at how to bend the rest of the Internet to your SEO will. Don't worry, this'll be TAGFEE. External links External links are a fantastic way to show search engines that your site is credible and useful. They're also a great way for users to find you by navigating from sites they already use. In short, they build your authority with humans and bots. There are two effective ways to get more links from external sources: you can either earn them or build them. Chances are that you'll get the best results by focusing on some combination of those two tactics. Notice how we didn't say \"buy them\"? Don't buy links. Guest blogging One tried and true way to build external links is through guest blogging, although this tactic has evolved a lot in the past few years. What used to be an \"I give you content, you give me a link\" sort of exchange has given way to guest blogging with a purpose. Veterans, go ahead and pop on over to conversion rate optimization unless you want a refresh on link-related topics like link nofollow and canonicalization. Link quality When you're out there on the Internet trying to build links, be sure you're looking for good quality links. Those are links that come from sites that are trustworthy, popular, and relevant to your content. For more information on factors search engines use to determine link value, read this page. Anchor text Anchor text is simply the text that's used in a link whether it's a link to a site or within that site. The implications of anchor text, though, reach farther because while keywords in anchor text can help your site rank for those words, it's easy for keyword-stuffed anchor text to look spammy. Learn more about best practices for anchor text. Nofollow \"Nofollow\" is a designation you can apply to a link to keep it from passing any link equity (that's kind of like the SEO equivalent of an up-vote). What might surprise you is that links don't need to be \"followed\" to pass human authority. Even nofollowed links can help you build awareness and get more links. So when you're linking to a site (or to other content on your site) think about whether that link leads to something you're proud to be associated with. HTTP status codes Every Internet user eventually encounters a 404 error page, but that's just one of the many HTTP status codes found on the web. Learn the difference between a 500 and a 503 along with some best practices for 404 pages here. Redirection One of the most useful HTTP status codes for SEOs is the 301 redirect which is used to tell search engines a page has permanently moved elsewhere (and passes a good share of link equity). Gather all the in-depth info you ever needed about 301s and other redirects. Canonicalization Perhaps because it's one of the hardest SEO words to pronounce, canonicalization has a reputation for being complex. But the basic concept is simple: you have two (or more) pages that have similar content and canonicalization allows you to either combine those pages (using redirects) or indicate which version of the page you want search engines to treat as paramount. Read up on the details of using canonicalization to handle duplicate content. You've now mastered so much SEO knowledge that you could teach the stuff (at least on a 101 level). If you've read and digested all the links along the way, you now know so much more about SEO than when you started. But you're so self-motivated that you want to know even more, don't you? Newbies, read closely through other optimization to refine your knowledge and apply those newly-minted optimization skills to even more aspects of the sites you're working on. Marketers, you've done a fabulous job powering through all these topics and there's no doubt you can hold your own in the next SEO team meeting. To take your understanding of optimization even further, skim other optimization. Or scoot on ahead and test your skills with the SEO Expert Quiz. 6. Other optimization There are many ways (beyond the basic SEO knowledge you've been accruing here) to give your site an optimization boost. Find (and fix) what's keeping potential customers from converting with conversion rate optimization, get your storefronts found on the web with local SEO, and find out how to prep your site to show up in international SERPs with international SEO. Conversion rate optimization (CRO) If shoppers are abandoning their carts so fast you're looking around for the tornado, your marketing funnel is acting more like a sieve and it's time to plug some holes. Stop the bleeding with Paddy Moogan's five-step framework for CRO. And keep on learning by keeping up with the latest CRO posts from the Moz Blog. Local SEO Even if you do most of your business in person at a local shop, customers are still trying to use the Internet to find you (and your hours, phone number, menu, etc.). Make sure they're getting the right info (and finding you before they find your competitor across the street) by investing some time learning about local SEO. On that page you can also sign up for the Local 7-Pack, a monthly newsletter highlighting the top local SEO news you need to know. Or, watch for the latest local SEO developments on the Moz Blog. International SEO A global customer base is a good thing to have, but you want to use international SEO to make sure potential customers in the UK are finding your British shipping policies instead of your American ones. Master hreflang to direct Chinese customers to content using simplified Chinese characters while you send Taiwanese customers to content that uses the traditional characters they're used to. And find out how your site structure and whether you're using a country code top-level domain (ccTLD) (like \".uk\") affects your SEO and potential ranking in international SERPs. SEO newbies, we really can't call you newbies anymore. Congratulations! No one has read deeper into this blog post or learned more along the way than you have. SEO veterans, you knew a lot of this already, but now you're up to date on the latest tips, tricks, and techniques. And SEO-curious marketers, if you're still hanging around, bravo! You can safely add \"speaks SEO\" as a feather in your cap. You're all ready to test your skills against the experts and prove just how much you've learned, take the SEO Expert Quiz and brag about your score. 7. Test your new skills Feel like you've mastered SEO already? Take the New SEO Expert Quiz to see how you stack up. 8. You did it! Congratulations! You're well on your way to SEO mastery. Bask in that glow for a moment or two before moving on to your next project. 9. Other resources The fun thing about a developing field like SEO is that the learning and adventure never end. Whether you're looking for more advanced knowledge or just to learn in a different format, try Distilled U's interactive modules or Market Motive's web-based classes. If you're looking for a job in SEO, Carl Hendy might just have your roadmap. Thanks for following along with this choose your own adventure version of how to learn SEO. Share your favorite resources and ask us about any topics we might have missed in the comments. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Learn SEO: Choose Your Own Adventure Edition"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Learn SEO: Choose Your Own Adventure Edition"
    },
    {
      "level": "H2",
      "text": "First choose your character"
    },
    {
      "level": "H3",
      "text": "SEO Newbie"
    },
    {
      "level": "H3",
      "text": "Veteran SEO"
    },
    {
      "level": "H3",
      "text": "SEO-Curious Marketer"
    },
    {
      "level": "H2",
      "text": "Table of contents"
    },
    {
      "level": "H2",
      "text": "1. What is SEO?"
    },
    {
      "level": "H4",
      "text": "Ranking factors"
    },
    {
      "level": "H4",
      "text": "Why SEO?"
    },
    {
      "level": "H3",
      "text": "About search engines"
    },
    {
      "level": "H4",
      "text": "How search engines operate"
    },
    {
      "level": "H4",
      "text": "The human side of search"
    },
    {
      "level": "H3",
      "text": "Search engine results pages"
    },
    {
      "level": "H3",
      "text": "Penalties and algorithm updates"
    },
    {
      "level": "H3",
      "text": "Analytics platforms (or how to measure SEO)"
    },
    {
      "level": "H2",
      "text": "2. Building an SEO-friendly site"
    },
    {
      "level": "H3",
      "text": "About domains and URLs"
    },
    {
      "level": "H4",
      "text": "Domains"
    },
    {
      "level": "H4",
      "text": "Anatomy of a URL"
    },
    {
      "level": "H3",
      "text": "Site structure"
    },
    {
      "level": "H3",
      "text": "Sitemaps"
    },
    {
      "level": "H3",
      "text": "Internal links"
    },
    {
      "level": "H3",
      "text": "Page speed"
    },
    {
      "level": "H3",
      "text": "Mobile web development"
    },
    {
      "level": "H2",
      "text": "3. Content and related markup"
    },
    {
      "level": "H3",
      "text": "Competitor analysis"
    },
    {
      "level": "H3",
      "text": "Keyword research"
    },
    {
      "level": "H3",
      "text": "SEO copywriting"
    },
    {
      "level": "H3",
      "text": "On-page factors and meta data"
    },
    {
      "level": "H3",
      "text": "Duplicate content"
    },
    {
      "level": "H3",
      "text": "SEO for video"
    },
    {
      "level": "H3",
      "text": "Measuring success"
    },
    {
      "level": "H2",
      "text": "4. On-site related topics"
    },
    {
      "level": "H2",
      "text": "5. Link-related topics"
    },
    {
      "level": "H3",
      "text": "External links"
    },
    {
      "level": "H4",
      "text": "Guest blogging"
    },
    {
      "level": "H4",
      "text": "Link quality"
    },
    {
      "level": "H3",
      "text": "Anchor text"
    },
    {
      "level": "H3",
      "text": "Nofollow"
    },
    {
      "level": "H3",
      "text": "HTTP status codes"
    },
    {
      "level": "H3",
      "text": "Redirection"
    },
    {
      "level": "H3",
      "text": "Canonicalization"
    },
    {
      "level": "H2",
      "text": "6. Other optimization"
    },
    {
      "level": "H3",
      "text": "Conversion rate optimization (CRO)"
    },
    {
      "level": "H3",
      "text": "Local SEO"
    },
    {
      "level": "H3",
      "text": "International SEO"
    },
    {
      "level": "H2",
      "text": "7. Test your new skills"
    },
    {
      "level": "H2",
      "text": "8. You did it!"
    },
    {
      "level": "H2",
      "text": "9. Other resources"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Isla McKetta\n          \n            Isla McKetta\n          \n            Isla McKetta"
}