{
  "url": "https://moz.com/blog/learn-seo-in-30-minutes-a-day",
  "slug": "learn-seo-in-30-minutes-a-day",
  "title": "Learn SEO in 30 Minutes a Day - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Learning SEO can be a daunting experience. To make this process a little easier, I have broken down my method for learning SEO into bite-sized chunks that can be completed in 30 minutes or less. I have also tried to create a mechanism to make it easier to get help and expand personal networks.",
  "content": "Learn SEO in 30 Minutes a Day Public Relations By: Danny Dover June 9, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Danny Dover June 9, 2009 Learn SEO in 30 Minutes a Day Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Learning SEO can be a daunting experience. One of the most common questions we hear is \"How can I learn SEO for free?\" To make things a little easier, I have broken down my method for learning SEO into bite-sized chunks that can be completed in 30 minutes or less. I have also tried to create a mechanism to make it easier to get help and expand personal networks. Twitter Participation: I think the best benefit of learning SEO is getting to know the SEO community. As an experiment to facilitate this, I propose the following. While you complete the tasks below, feel free to share your progress on Twitter with the Hash Tag #30MinuteSEO. This will make it easier to find people who are doing the same thing and willing to help you. :-) Learn SEO in 30 Minutes a Day Learn the Basics: Your first group of tasks will teach you the fundamentals of Search Engine Optimization. You get to start slow by reading some helpful articles. 30 Minute Tasks: Read the new Beginner's Guide to SEO (30 mins) - This is the table of contents for the upcoming revision to the Beginner's Guide to SEO. (Note the ‘Parts’ are links to full articles.) I recommend this version over its predecessor because its material is more focused on today's SEO landscape. Example Tweet on Twitter: Finished reading the Beginner's Guide to SEO http://bit.ly/19cBGq #30MinuteSEO Read Google’s Starter Guide to SEO (30 mins) - Isn’t reading two beginner guides to SEO redundant? The information might be, but this will teach you to recognize and appreciate Google’s perspective on SEO. (As a side note, notice the juxtaposition between the message Google is saying and the SEO unfriendly URL structure of this page. This is your first chance to study the difference between what Google says and how Google acts. Oh snap!) Example Tweet: Finished reading Google’s SEO Starter Guide http://bit.ly/Lv4GU #30MinuteSEO Build a Basic Website (4 sets of 30 mins) - The Beginner's Checklist for Learning SEO will guide you through the process of building a basic website and teach you the basic SEO skills you need. (I apologize for linking to my own work. I wouldn’t recommend it if I didn’t believe it was worthy.) Example Tweet: Does anyone have any SEO advice for my new website at www.example.com #30MinuteSEO Start Using Your Skills: Your second group of tasks requires applying the theories you just learned. These tasks are presented as SEO challenges that will utilize everything you learned in the previous section and depend on your own creativity. Note: The work for these will take about 30 minutes. The time it takes for the content to actually get indexed may be much longer. 30 Minute Tasks: Rank for a long tail phrase (30 mins) - Choose a long tail keyword phrase and figure out how to rank for it. When I did this exercise nearly two years ago, I chose “fat people falling”. Please be aware that the subject manner and the language of the ranking page may be NSFW. It was written for a very specific audience and may be offensive to others. Hint: See if you can figure out how I got this page to rank with only one inbound link. Example Tweet: Look what I rank #1 for: “Orange Jean Jacket” #30MinuteSEO Rank in the top 10 in a local search (2 sets of 30 mins) - Find an actual small business that you appreciate and volunteer to do SEO at no cost. When I did this two years ago, I chose the preschool I originally attended and helped them rank in their area. Hint: Read David Mihm’s Local Search Ranking Factors Example Tweet: If you are in the Seattle area, be sure to check out Example Pastry #30MinuteSEO Rank an image (30 mins) - The image vertical is one of the most confusing search realms to work in. Dive in and see if you can get a relevant image to rank for a phrase of your choice. Hint: Read Google Image Search Ranking Factors Example Tweet: Look at the third image result on bing.com for “example”. Awesome! #30MinuteSEO Rank in the top 10 for a popular term on YouTube (30 mins) - Compared to the search engines, ranking in YouTube is a piece of cake. Try to rank for a semi-competitive term with a worthwhile video. When I originally did this, I ranked for a popular culture phrase and my relevant video made me $10,000 theoretical dollars. Hint: Read YouTube Ranking Factors Example Tweet: I now rank #4 on YouTube for “Example” #30MinuteSEO Outrank Google (3 sets of 30 mins) - This is an exercise with the domain-related metrics. Find a REALLY long tail phrase that Google ranks #1 for and see if you can create a page that can outweigh the domain strength of the big G. I have been experimenting with Google's spam filters and I am seeing if I can outrank Google Webmaster Central forums with my awesome website What Is The Best Thing To Do With a Colt with Five Hooves.com Example Tweet: You think SEO is difficult? I outrank Google for “Example Toe Jam” #30MinuteSEO Pitch SEO to a real client (2 sets of 30 mins) - This is the hardest but possibly most important task on this list. Go out and find a small business and sell them on your ability to do SEO. You will likely learn a lot about SEO and yourself in this process. Continue Learning: After completing the tasks above, it is a good idea to spend 30 minutes a day reading SEO blogs - I recommend the following: Search Engine Land - Authoritative up to minute search engine coverage. Search Engine Roundtable - High quality coverage of SEO as it evolves. SEOmoz Blog - SEO blog with a focus on teaching SEO. (Disclaimer - SEOmoz pays my bills and may have been the bearer of my first child. The jury is out.) Sphinn - A fair amount of fluff, but generally the first source to break inner-industry news. Alltop SEO - Great source for SEO News. Highly recommended the SEOmoz community in the comments below this post. Example Tweet on Twitter: Enjoying this post at searchengineland.com/post/example/ #30MinuteSEO Study Advanced SEO: This group of tasks has less direct return on investment but can lead to big wins. I try to complete these at least once a month. 30 Minute Tasks: Review ultra competitive Search Engine Result Pages (SERPs) (30 mins) - Watch the progress of SERPs like “Buy Viagra”, “Real Estate” and “Payday Loans”. Most of the techniques used to rank for these are Black Hat but it is important to know what you might be up against. Find a site that outranks Wikipedia and try to figure out why (2 sets of 30 mins) - This will likely help you with later work. Wikipedia’s domain strength is incredible. Find and study the sites that outrank it because they generally use the best SEO tactics. Attend search conference parties (4 sets of 30 mins) - Don’t get distracted by the people exchanging short term tricks and tips. Instead, mingle and start to talk to some of the most interesting people you will ever meet. Extra Tasks: These tasks are more difficult and only indirectly apply to SEO Write up an SEO-oriented resume (2 sets of 30 mins) - From what I have seen, when businesses are facing hard economic times they look inward to see what current assets they can maximize. This means that SEO is a great skill set to have when companies are looking to attract free search engine traffic. Hint: You can add your resume to the SEOmoz Marketplace Example Tweet: Check out my resume at the SEOmoz Marketpace http://bit.ly/APg9j #30MinuteSEO Review HTML Tags (30 mins) - In the same way that the typewriter dictated the course of keyboards, (the QWERTY layout was originally designed to prevent collisions on typewriters) HTML dictates the course of the internet. Become an HTML expert and your skills will apply for the rest of your life. Sign up for Social Media (30 mins) - If you haven’t already, sign up for Twitter, Facebook and any other social media sites that you find interesting. Start building your personal brand and make it work for you. If you have any other advice that you think is worth sharing, feel free to post it in the comments. This post is very much a work in progress. As always, feel free to e-mail me or send me a private message if you have any suggestions on how I can make my posts more useful. All of my contact information is available on my profile: Danny Thanks! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Learn SEO in 30 Minutes a Day"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Learn SEO in 30 Minutes a Day"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Danny Dover\n          \n            Danny Dover\n          \n            Danny Dover"
}