{
  "url": "https://moz.com/blog/legal-issues-the-economics-of-search-ppc-pitfalls-and-the-smx-search-bowl",
  "slug": "legal-issues-the-economics-of-search-ppc-pitfalls-and-the-smx-search-bowl",
  "title": "Legal Issues, The Economics of Search, PPC Pitfalls, and the SMX Search Bowl - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Yesterday I attended sessions, met some new folks, and attended Search Bowl. Below is a brief recap and my opinions of Day 1 of SMX West.\n\nRecent Legal News About Search\n\nClarke Walton went over search ad trademark policies. Google has the easiest trademark policies to understand. They allow…",
  "content": "Legal Issues, The Economics of Search, PPC Pitfalls, and the SMX Search Bowl SEO Events By: Rebecca Kelley February 27, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley February 27, 2008 Legal Issues, The Economics of Search, PPC Pitfalls, and the SMX Search Bowl SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Yesterday I attended sessions, met some new folks, and attended Search Bowl. Below is a brief recap and my opinions of Day 1 of SMX West. Recent Legal News About Search Clarke Walton went over search ad trademark policies. Google has the easiest trademark policies to understand. They allow trademarks as trigger keywords, but trademarks in the ad's text is not allowed. Both Yahoo and MSN do not allow trademarks as trigger keywords nor in the ad's text. The only exceptions are if you are a reseller, an information site (not an affiliate site), giving product reviews, or providing dictionary terms. Our very own Sarah Bird went over the legal developments on the Communications Decency Act, which inspired me to mention the CDA in my presentation on user-generated content that I'm giving at the end of the day today. I won't go over her presentation because we can make her presentation available online and because she's covered much of the information in her thorough and helpful Legal Monday posts. Eric Goldman is up next, but I don't have any notes because I got distracted by Digg (the downside of having free wifi available during sessions). Someone submitted a Drivl post I had written in November 2006 and it exploded on Digg, much to my surprise. The post, ironically titled \"Why I'll Never Make Digg Popular\" (because I've never submitted anything that's gone hot), was the #1 story of the day and currently has over 7800 diggs. Videos, Images, and Blended Results To me, the most interesting bit of this session was Todd Friesen giving an overview of the positioning of blended results in the SERPs. The placement typically follows this structure: Image results = usually at top (occasionally at the bottom). They're additive, meaning they're displayed in addition to the 10 organic results you see. Video results = the best example of blending. They can be in any spot in the SERPs, and they're the oly result to be subtractive, meaning video results kick other results out of the top 10 in order to be displayed. News results = top, bottom, or middle. They're additive results. Product results = top or bottom. They're also additive results. Blog results = bottom of the SERPs; additive results. Book results = bottom of the SERPs, additive results. The Economics of Search This was my favorite session of the day because each panelist is clearly very intelligent and had a lot of insight on the economics of the search industry. Michael Schwarz talked about how the most difficult question was the future of sponsored search. In his opinion, sponsored search's main competitor is organic listings. Why do people click on search ads? Because the ads are good and informative. The guy willing to pay the most for your eyeball is likely to be able to tell you something good, right? Sponsored search is successful because, to Michael, organic search sucks. People can spam organic search like crazy, but it's difficult to spam sponsored search. Someone will figure out how to make organic search beat the hell out of sponsored search, and when that happens, the business model will have to change. Hal Varian was up next, and he is so ridiculously intelligent that I leaned over to Jeff and whispered how I felt like a moron listening to his presentation. He's like the economic strategist for Google, for crying out loud. He essentially gave a Micro Economics course in the span of 15 minutes, and every time I was just about to get the gist of an AdWords formula he had up on the screen, he'd briskly move onto the next slide, leaving me with half-finished notes. I eventually gave up and just typed \"DOWNLOAD HIS PRESENTATION.\" Until that happens, here's a morsel of notes: Cost per conversion = acquisition = sale Determine bid (theory).Profit = Value Per Click x Number of Clicks – Cost of Clicks The profit increases if the value of the click is greater than the incremental cost per click (ICC) Bidding Rule: if the value of the click > ICC, increase your bid. Stop when the value of the click is just less than or equal to the ICC. Confusing but very valuable information (at least to me, anyway, but then again, I'm not a very quantitative thinker). Peter Coles discussed the two sides of the marketplace, advertisers and publishers. He had some general takeaways: Strong cross-side network effects in ad platforms make entry challenging Try the \"segmentation as an entry\" approach and gain traction vertical by vertical Differentiation, usually a powerful competitive force, can be a double-edged sword The linear costs argument suggests that a combined platform may present advertisers with a viable competitive option Lastly, Mark Mahaney shared some really cool data with the audience: U.S. advertising outlook: Forecasting 22% year over year growth in net advertising ($26 billion) in 2008 Internet 8.3% of total U.S. advertising; 1.22% increase in penetration There were eRetail figures, but I missed them :( 16% year over year growth in online travel to $106 billion in 2008 Online = 63.5% of total travel spending Google's search share continues to climb. Search budget shares are greater than search query shares. Mobile search opportunity: 35 monthly searches per installed PC worldwide in 2007 1 search per mobile device per month in 2010 means you could generate $2.3 billion in mobile search revenue worldwide. 10 monthly searches means mobile search will be greater than PC search. Peter also said that it's hard to see the Microsoft/Yahoo deal not happening. In his opinion, Microsoft can't accept a no from Yahoo. They will bid higher and this deal will happen. In the meantime, he addressed a few points regarding Microhoo: Will Microhoo lead to a search query shift among consumers? (Probably not.) Will a Microhoo research and development mashup create a better search engine? (Possibly, but he is skeptical.) Could a larger #2 search engine draw search budgets away from Google? To him, this is an interesting question. It may incentivize more search buyers to fully allocate budgets to the #2 search engine, which is an interesting implication of Microhoo. Unfortunately, we won't know the answer to this until the second half of 2009 or 2010, which is when a deal between the two search engines is likely to finalize. PPC Pitfalls Amy Konefal, Addie Conner, and David Szetela were all exceptionally good speakers, but I didn't take notes because I was half-listening, half working on my laptop (again, damn you, free wifi! Who are the bastards that sponsored that, anyway? Oh, wait a second...never mind.) I did run into Gab Goldenberg (aka bookworm-seo) from SEO ROI, who seemed very thrilled to be at SMX West. He had spoken earlier about local search, and he seemed incredibly eager to chat with very industry types and expand his knowledge of SEO. The Search Bowl That Did Not Bowl Me Over After sessions wrapped for the day, it was time for the much-anticipated Search Bowl, which consisted of two reps each from Google, Yahoo, MSN, and Ask, and a team of two SEM All Stars (Todd Frisen and Ian Lurie) pitted against each other in a battle of SEO wits. On paper, this sounds nerdily exciting to anyone in the search industry. However, I have to admit that I was disappointed by the event for the following reasons: Danny Sullivan, who I and virtually every other SEO on the face of this planet essentially love to death, was manic to the point of distracting. I guess he was really excited about seeing his Search Bowl idea finally come to fruition at a conference, but he showed it by screaming into the microphone (to the point where Rand went onstage and adjusted the mike for the sake of every audience member's ears), screaming at the Search Bowl contestants, and just screaming in general. The event wasn't very well paced or structured. Some questions took forever, while others were clicked through at a whirlwind pace. There didn't seem to be much communication between Danny and whoever was switching screens from the Powerpoint presentation to the video stream of the contestants, which often led to Danny reading a question at Micro Machine Man speed while the rest of us were shouting at him to stop so the question could get loaded up on the screen. The questions, well, they kind of sucked. Who the hell is going to know in which month and year the big Wired article about Google came out? I totally side with Todd on this point--he kept shouting that \"Nobody gives a shit!\" about these obscure yet incredibly specific questions that were compiled. In fact, I'd argue that Todd was the most entertaining part of the Search Bowl. His exasperation of the structure and the questions and his insistence that the Search Bowl be turned into a drinking game had the audience laughing. By the way, Google won, mostly because they answered virtually every Google-related question correctly (and there were a LOT). I think that if the Search Bowl were better structured and organized (and had better questions), it would be a lot of fun to attend. However, the inaugural Search Bowl seemed like it was fun for the people involved (the reps and Danny), but they seemed to forget that there were a couple hundred people watching their shenanigans. It's like showing vacation slides to your family: \"And then we went to the Grand Canyon. Boy, it sure is deep! *CLICK* Here's us next to a cactus! Boy, it sure looks prickly! *CLICK*\" You get the idea. Anyway, that wraps up Day 1 from my perspective. Today I'll be attending sessions, hanging out at our booth (stop by, pick up a t-shirt, and get a demo of our new SEO Analytics!), joining Jon Kelly for a WebmasterRadio piece, and presenting about UGC at the end of the day. I'll report on all of this later today. In the meantime, if you're attending the confernece, stop and introduce yourself! Oh, two closing notes: the music between sessions is RAD. Kudos to whoever put together that mix--Modest Mouse, The Shins, Franz Ferdinand, Amy Winehouse, Jet--it's like SMX tapped directly into my iPod. Also, Will Critchlow has asked a question at every session I've attended. He is a One Man Show of question askin'. You totally know that he was that kid in your class who shot his hand up every two minutes, much to the teacher's chagrin. ;) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Legal Issues, The Economics of Search, PPC Pitfalls, and the SMX Search Bowl"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Legal Issues, The Economics of Search, PPC Pitfalls, and the SMX Search Bowl"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}