{
  "url": "https://moz.com/blog/lessons-learned-from-3-years-of-blogging",
  "slug": "lessons-learned-from-3-years-of-blogging",
  "title": "Lessons Learned from 3 Years of Blogging - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The beginning of this month (May 2nd, to be exact) marked my 3 year anniversary as a blogger. My first post on SEOmoz was a paragraph long and consisted of asking our readers if they know of any Spanish-language SEO blogs. It attracted 18 comments. Huzzah! Since then, I've published 241 more posts,…",
  "content": "Lessons Learned from 3 Years of Blogging Content Marketing By: Rebecca Kelley May 21, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley May 21, 2009 Lessons Learned from 3 Years of Blogging Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The beginning of this month (May 2nd, to be exact) marked my 3 year anniversary as a blogger. My first post on SEOmoz was a paragraph long and consisted of asking our readers if they know of any Spanish-language SEO blogs. It attracted 18 comments. Huzzah! Since then, I've published 241 more posts, with this one being #243. I thought I'd reflect back on my three years of blogging and share the good, the bad, the downright ugly, and the lessons I've learned along the way. Phase I: Asking Questions I wrote 4 posts in May of 2006, and each of them centered on a question posited to the community: \"Know of any Spanish SEO blogs?\" \"Is there such a thing as too much website usability?\" \"What do you think of the (then-new) 'I'm a Mac/I'm a PC' commercials? \"Is cyberspace a Googlocracy?\" At this point in my long and storied career at SEOmoz, I had been occupying a desk within the company for 4 short months (3 of which were as an intern), so I still had a lot to learn about SEO, Internet marketing, and, actually, about the Internet in general. I didn't feel confident enough to blog about something as an \"expert\" or provide my input/opinion on a topic, so I resorted to asking open-ended questions in order to get feedback from our blog audience and establish a connection with them. Lesson Learned: The biggest lesson I learned with my first few posts was that you don't have to be the expert when you blog, especially when you've got a good chunk of readers. It's important to ask for feedback and reach out to your community for their input. I think they respect you more when you admit that you have limits and appreciate them for their opinions and level of expertise. Phase II: Editorializing Existing Articles My blogging evolved into me finding an article or blog post and talking about it (and, of course, ending with a question for our readers). With these types of posts I was able to inject a bit of personal interpretation and my input into them. I still wasn't touting my knowledge level or expertise, but providing opinions about other people's blog posts allowed me to step forward a bit and let my voice be heard. Lesson Learned: If you can't think of anything to blog about or still aren't confident in your \"expert\" abilities, there's always an article or some news that you can highlight and add a personal spin to. Phase III: Establishing a Voice Once I got a handful of posts under my belt, I started to feel more comfortable sitting at a keyboard, Doogie Howser-style, and I was able to add my personality and voice more freely to my blog posts. I've always had a knack for writing, so I really enjoyed (and still do) injecting a little bit of myself into the posts I authored. I think that if someone were to remove the authors from a bunch of different posts and ask \"Which one did Rebecca write?\", you'd be able to identify mine pretty easily. :) Lesson Learned: At this point, even though I was still learning and considered myself to be a beginner SEO, I was comfortable enough with our readers and my coworkers that I could start being myself and letting my posts reflect who I was as a person. I think that's one of the most important lessons learned when it comes to blogging. The thing that separates the good bloggers from the bad is their voice. What makes you read one blog over another? Sure, a lot of factors come into play, such as the frequency of updates, the quality of information, the level of expertise, etc. But for me, the thing that makes one blogger stand out amongst the throngs of everyone else is his ability to inject his personality into what he's writing. I'm still no SEO expert, and I don't pretend to be. Nonetheless, people still enjoy what I've got to say because I say it differently than anyone else, and that uniqueness I bring to the table is what defines me and makes me interesting. Now that I'm at Phase III (profit!!!), I thought I'd share some other blogging odds and ends that I noticed after perusing through old posts. Recurring Blogging Traits 1. Using punny titles that usually work in a movie, music or pop culture reference I Used to Care, But Things Have(n't) Changed Sometimes Sites Don't Look Like They Should...They Make It...Hurt So Good Marketing Sherpa States That SEM Clients Aren't Multiplying Like Wet Gremlins London (and Worthing) Calling An American in London Overheard in (SES) New York Wordze to Yo Mutha Lesson Learned: Constructing a fun and eye-catching title is a good way to attract attention to your posts. Since I'm a huge dork, I like working in some sort of pop culture reference--it's a good way to identify fellow nerds who march to the beat of the same drum as I do. :) 2. Feigning abuse at the hands of Rand \"...I thought I'd take my boss's 'Post blogs while I'm gone or you're fired!' threat seriously and attempt to bring something to the blog table.\" \"Rand has chained me to my desk and ordered me to summarize the next set of videos released by Matt Cutts.\" \"You don't know what Rand Fishkin is really like. He made it explicitly clear that if I don't keep summarizing your videos, I won't live past my birthday.\" \"Rand took a trip to both Houndstown and Badgersville to constantly bug me to finish this damn thing...\" \"In order to please the masses, Rand once again chained me to my desk and ordered me to do a recap of SES London in an amusing comic book fashion.\" \"My 'Don't Fire Me Rand' Recap of SES New York\" \"...okay, sometimes when I ask him non-work stuff ('Hey, how was your weekend buddy?') he barks \"Go write a blog entry!\" at me...\" Lesson Learned: Sometimes it's good to take a lighthearted, joking tone: it makes the post more fun to read, and if you can find a way to identify with the audience (by, say, pretending the leader of the company you blog for is a sadist), they'll enjoy your blogging even more. 3. Writing completely useless blog posts that people somehow nonetheless seem to like Ten Ways to Take a Break from Tedious SEO Work Ten Sad Signs Your Writing is Web-Influenced British Vocabulary 101 10 Different Types of Clients The Best Spam Submission Ever Lesson Learned: A little humor goes a long way. Sure, the posts are off-topic and have little to no actual marketing tips, but it's nice to take a break from the usual blogging schedule and present something fun for your readers. Plus, they seem to like it--the latter two posts I listed are among the most popular ever on SEOmoz, and they're certainly two of the most popular posts I've authored. 4. Using personal interests as an analogy or direct example (with food, movies and training/exercise being my most frequent go-to subjects) The Internet = The Ultimate Focus Group Why Good Content is Like a Pixar Film Punctured Tires and Lessons Learned About Paid Links Don't Create False Expectations, Especially When It Comes to Baked Potatoes Movie Websites: A Missed Opportunity Or a Case of the \"I Don't Care\"s? Content and Marketing Lessons Learned from the Dark Knight Sneaky Spam in Local Search Lesson Learned: I like using analogies and examples that I know/care about. Analogies and examples strengthen your point and make your post more understandable and relatable for your readers. If you use examples that have a close personal tie to you, you're more likely to be excited about blogging. Plus, your readers will get to know you and will establish a personal bond, which will bring them back to your blog again and again. Random Stats: Most popular blogging categories: Roundups (53ish): you jerkwads sure do love your roundups! Events and Conferences (around 42): I've blogged about SES Latino, SES San Jose, SES Chicago, SES London, SEMpdx's Searchfest, SES New York, SMX Advanced, SES Toronto, SES Travel, Shop.org events, SMX Social Media, SMX West, the eCommerce Summit, and some local Seattle meetups. Miscellaneous (23): this category houses most of my off-topic/silly/useless posts. :) SEOmoz news (15): we're a growing company, so it's only fitting that I announce the occasional company-related news to the masses. Google (16): in comparison, I've blogged about Microsoft and Yahoo! two times each. Cue the sad trombone. Social Media (13): one of my favorite topics. Search Community (12): there's always something interesting to blog about with regards to our industry's community. Web Design/Usability (11): I hadn't really thought about it, but I guess I'm more interested in usability than I thought. Number of posts about Matt Cutts: 10, 7 of which are video transcription posts, and all of which make fun of him in some capacity. Number of posts I published but didn't write: 6 (they were written by our six hiring candidates) Posts with the most thumbs (since the thumbs system has been implemented): The Best Spam Submission Ever (it's also the 4th most popular post ever on SEOmoz), currently sitting at 96 up, 4 down Please Stop Spamming Me for Votes (81 up, 2 down) 10 Different Types of Clients (67 up, 0 down) Apparently I Work for Google (49 up, 0 down) Are You Forcing Your Users to Superfluously Click (41 up, 0 down) Favorite Posts: Apparently I Work for Google. Oftentimes, the best posts I write are the ones that just come to me and that I don't have to spend any time researching. I wrote this one up one day while I was bored visiting my family in Michigan, and it really pleased me to see how well received (and relatable) it was by our readers. How NOT to Request a Link Via Email, Please Stop Spamming Me for Votes, Just When You Think Search Misconceptions Can't Get Any Worse, Your Users Aren't Intuitive, Which Is Why Your Forms Need to Be, and Customer Service and Reputation Management the Twitter Way: A Case Study. Sometimes a post falls directly into your lap based on a situation you encounter. The above posts were derived from conversations, a random email, a sign up process, and a customer service mishap. I was able to turn each experience into a lesson that I could share with the community. Content and Marketing Lessons Learned from the Dark Knight, 10 Different Types of Clients and Unusual Search Terms from the Month of November. Unlike the previous posts, these three are examples of posts I had ideas for and spent a lot of time on. There's always a fear and some worry that you'll pour all this effort into a post (or project) and that it will blow up in your face or fall flat, and I'm always relieved and happy to have the opposite happen. It's nice seeing your hard work get well received and rewarded. Are You Forcing Your Users to Superfluously Click, How Newsworthy Are Your Newsletters, Plan for the Holidays Nice and Early By Analyzing Search Trends, and How a Good Title and Description Can Make or Break Your Social Media Submission. These are the ones I had a lot of fun putting together because I really enjoyed finding and analyzing various examples. Lessons Learned: Try to find value in everyday situations. Think of how you can shape an experience you've had into something interesting and useful for your audience. Not every post has to be planned out ahead of time--sometimes a great idea can just come to you or you can be inspired by a random occurrence. If you put a lot of time and effort into a post and worry it'll never pay off, don't worry, oftentimes it will and you're just being paranoid. Use examples in your posts (websites, screenshots, movies, whatever)--they really help! Least Favorite Posts: The lazy posts (What Google Needs to Do with YouTube to Make Me Happy, Wikipedia vs. Britannica in a No-Holds-Barred Debate, Want to Make Up Stupid Words? Then Create a Social Media Site!). I think these posts had good potential, but I was lazy and essentially used them as a means to bitch about something without having much of a valid point to support my gripes. The clueless posts (Wikipedia: Now Telling You What's What While You're IM'ing, Google Adwords is Giving Me a Headache, Digg Has Shout-Blocked Me). I fired off these posts without doing adequate research and subsequently got my ass handed to me in the comments by people who were quick to point out that either what I was doing wrong or that the feature had been around for quite some time. The lame post (How to Get Banned from Digg). Yeah, this post sucks. (Hey, sometimes I can be painfully unfunny too!) Lessons Learned: There's a fine line between bitching with a point and just plain bitching. You don't want to come across as a whiner. Also, if you're blogging about a topic, you should do a bit of research beforehand just so you don't make a fool out of yourself (unless that's your intent). Oh, and don't try too hard to be witty, clever, smart, etc. It often falls flat and is embarrassingly obvious to your readers. Just be yourself! Polarizing Posts: All the Female Bloggers Say Heyyyy!...Hello? Ladies? This post inadvertantly turned into a bit of a gender war. Kim Krause Berg had blogged about the lack of recognition for female tech bloggers, and I said that it's because there aren't that many so there are very few to recognize. This post was pretty tame in terms of how much ire it raised, but nonetheless it was my first foray into taking a stance on a topic that had dissenting viewpoints. Hey, I'm Blogging! Pay Attention to Me! This post has the dubious distinction of attracting my first ever thumb down. Apparently some of our readers/bloggers didn't care to hear me call them attention whores. Oh well. I still think that bloggers (including me) are attention whores. Deal with it. ;P A-List vs. Blue Collar Blogging. This is one of my favorite posts in that it received 17 thumbs up and 13 thumbs down for a net gain of 4. That's pretty impressive. I still stand by my core message, which is that \"A-List\" bloggers do exist, and that not every blogger can become one in 90 days. I do feel a bit dumb for getting baited by Jason Calacanis, but then again, he was pretty good at getting attention (be it good or bad) back in the day (he seems to have quieted down more recently--maybe he's busy trying to de-suck Mahalo). Ron Paul is the Snakes on a Plane of 2008. Never fails--you talk about politics and end up stirring the pot, especially when you compare a popular politician to a B-grade movie about deadly snakes aboard a flight from Hawaii to Los Angeles. Generation Google a General Disappointment. This one's a bit tricky. While I still maintain that the panel could have been much better than it was, looking back I realize that I was too harsh to Danny Sullivan, Rand and his brother, Evan. Belated apologies--I could have gotten my point across without pouring on quite as much Haterade as I did, so I'm sorry. (Hey, better late than never, right?) No, Unfortunately Digg Doesn't Know Who You Are. I think this post got a lot of backlash partially because of the harshness of the original title and because some of the examples I highlighted were taken from actual user accounts, so they felt embarrassed to get called out. Again, I probably could have made my point without being quite so harsh, which is definitely an important takeaway. Nonetheless, I still like my post and stand behind it as an important thing to remember when doing social media marketing. Lessons Learned: Controversy attracts eyeballs, but you have to be prepared to take the good with the bad. If you can dish it out but your skin is too thin to take what gets bounced back at you, you probably shouldn't take such a harsh stance on things. (Thankfully, for the most part I've got a pretty thick skin. That's what you get when you grow up with two teasing older brothers.) Don't be afraid to stick up for yourself or defend your stance, but also know when to admit you're wrong. After looking back at some of these posts, I was able to identify moments where I crossed the line and should have checked myself before I riggity wrecked myself. This has more to do with a business blog, but try to stay respectful even when disagreeing with someone. I've sloooooooowly learned that over the past few years, and now I'm a bit more tempered than a couple years ago. I don't get as worked up or dragged into ridiculous wars between bloggers/marketers, and as a result it's made me a better employee, blogger and human being. Well, that about wraps up my retrospective on my three years of blogging here at SEOmoz. Blogging for this company has pretty much shaped my career and my image into what it is today, and it's opened countless doors for me professionally. I can definitively say for a fact that blogging can be an invaluable asset if you know how to approach it. I've learned a ton about blogging and about myself in the past few years, and I hope the lessons I've shared can be of some benefit to you too. In the meantime, here's to many more years of blogging about movies, marketing, and the wrath of Rand. ;) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Lessons Learned from 3 Years of Blogging"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Lessons Learned from 3 Years of Blogging"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}