{
  "url": "https://moz.com/blog/lessons-i-learned-from-my-seo-manager-position",
  "slug": "lessons-i-learned-from-my-seo-manager-position",
  "title": "Lessons I Learned from My SEO Manager Position - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "During the last three years I have been the search engine optimisation (SEO) manager of a leading Ecommerce agency based in Paris. I had the opportunity to deal with top fashion brands and with a bunch of big pure-players due to my position and SEO knowledge. As you might know, SEO is not an exact…",
  "content": "Lessons I Learned from My SEO Manager Position Marketing Industry By: Franck NLEMBA February 13, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Franck NLEMBA February 13, 2012 Lessons I Learned from My SEO Manager Position Marketing Industry This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. During the last three years I have been the search engine optimisation (SEO) manager of a leading Ecommerce agency based in Paris. I had the opportunity to deal with top fashion brands and with a bunch of big pure-players due to my position and SEO knowledge. As you might know, SEO is not an exact science; and sometimes when you drive an SEO strategy, it's not always easy to explain how Google works to a marketing director or to someone else in the board of government. I though it might be useful to share some situations I faced as the SEO manager in Paris. To ensure everybody is comfortable after publishing this, I won't give any names. Scene one: \"I dislike Google hegemony\" One day, one of my prospects refused to use Google Analytics because he didn't want Google to use its data and share it to competitors! Client statement \"I want to have a robust tool to track data on my website, but I don't want to use Google analytics because Google is everywhere on the Internet and I will not be happy if my competitors have access to my data\" My answer Google Analytics is a web analytics tool, which tracks data anonymously. The tool helps websites owners to understand how users engage with your website and Google doesn't record the name, email address, billing information etc. of your users. Websites owners have a total control of data they share on Google analytics and Google collects a huge amount of data with the help of variety reports. Outcome The client currently uses Google analytics as tracking tool and he is very happy, especially since Google analytics added recently social tracking features! Scene Two: \"I want to be first on my brand searches\" In 2008, I went to a meeting. The goal was to help a famous brand to recover rankings on brands keywords. Client statement \"I was the first one to sell this product on this market. People come from around the world to buy my goods, but I can't understand why Google doesn't show my website first when searchers perform queries with my brand's name. For that I hate Google and I'll give them a call to obtain top positions.\" My answer Google and others search engines try to give the best answer to a searcher based on a combination of several factors, even if you use Google Adwords. Some of these factors include; if you have the best offer and if people are happy (and link to your page), if bloggers and press write regularly about your brand… So if you want to obtain good rankings on your queries, you should improve the content of your page by adding relevant keywords first, attract links from big players, and you must be sure that when users reaches your website they really enjoy your content and share it. Outcome The client did not consider my reply, and I lost the deal. Scene Three: \"I don't want to use this keyword on my website\" In general, it was pretty straightforward to expose my SEO strategy to people with SEO skills or a good web culture, but those guys don't make any of the big decisions. Thus, I need to clearly explain my strategy to the top management and particularly to the VP of Marketing; and trust me it's not easy. Client statement \"We have a premium position on the market and our clothes are expensive so our targets are young mothers with good incomes. You should never use any \"cheap\" keywords (e.g. \"brand +cheap\" or \"product +brand +cheap\") in our pages' content.\" My Answer Dear madam, it seems like you have a clear view of the situation in your market and your market position is clear enough for me. However, I have observed in the keywords reports of your tracking tool that searches with the keyword \"discount\" or \"cheap + product\" or \"your brand + deal\" rise regularly. That means a fraction of your customers think that they could find good deals on your site! You need to satisfy them too. So my recommendation is to add a \"good deal\" section on your website, so that we could optimize the content and internal link structure of the website, to help those who look for good deals. Outcome That year, the client didn't follow my recommendation. But a few months later, she asked to my team to set up a \"good deals\" page because their main competitor performs well on this kind of queries. Scene Four: \"I will sign with you if you ensure me that I will be number one on Google\" This is my favourite one, because I have always lost prospects with this state of mind. Generally, most people concerns are \"short-term\" oriented. Client statement \"I want to be number one on Google for this query (a generic one). I will not deal with you if you don't guarantee me that I will rank first\" My answer Sir, Google's algorithm changes regularly. Last year they reported that they had made some improvements of the algorithm more than 500 times, so if you think that there is someone outside there who knows Google's secret sauce; please I will like to encounter him too. That said, you need to focus on metrics like, visits on a given keyword rather than on rankings, or you should use KPIs like sales, commerce conversion rate, number of page per visit, feed subscribers, etc. Outcome This client didn't sign the SEO agreement because he didn't trust in my ability to deliver. Anyway, I have improved the way I tackle this kind of objection since I read this article from Neil Patel on SEOmoz, Lessons Learned from Running an SEO Agency. Scene Five: \"SEO is automatic, and I will be first on Google SERPs without you\" A bunch of clients and prospects continue to think they don't need to hire SEO experts because they think Google employees decide alone which website will rank first and it is not necessary to hire someone who doesn't have the power to influence a Google employee's opinion. Client statement \"Are you friends with Google employees or have you partnered with Google in the past for websites under your control? My conviction is that Google is automatic and decide how they rank websites, so if you're a \"friend\" with Google my website might be on the top three results of the first page\" My answer There are many SEO agency which help pure-players and brands perform well on SERPs with good results. Google also shares a lot of information on the Google infrastructure and how they strive to crawl and index the web. Many websites, blogs, platforms, etc. try to be first on Google with good (white hat) and so call \"bad\" practices (grey hat) but its not so easy. I also recommended that he watch this video to learn more about SEO (and I showed the Search Engine Land video about SEO to the client.) Outcome I won the deal and this man is my client for three years :) I hope that the five real-life situations above will bring some fun into the vibrant SEOmoz community and that will really help young SEO players to be aware of these before facing the same objections from some \"difficult\" clients. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Lessons I Learned from My SEO Manager Position"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Lessons I Learned from My SEO Manager Position"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Franck NLEMBA\n          \n            Franck NLEMBA"
}