{
  "url": "https://moz.com/blog/lessons-from-1000-voice-searches",
  "slug": "lessons-from-1000-voice-searches",
  "title": "Lessons from 1,000 Voice Searches (on Google Home) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I ran 1,000 searches on Google Home to find out how voice answers differ from desktop answers. Includes data on Featured Snippets and some Google Home Easter eggs.",
  "content": "Lessons from 1,000 Voice Searches (on Google Home) Search Engines | Advanced SEO By: Dr. Peter J. Meyers May 23, 2017 Table of Contents Copied! By: Dr. Peter J. Meyers May 23, 2017 Lessons from 1,000 Voice Searches (on Google Home) Search Engines | Advanced SEO It's hardly surprising that Google Home is an extension of Google's search ecosystem. Home is attempting to answer more and more questions, drawing those answers from search results. There's an increasingly clear connection between Featured Snippets in search and voice answers. For example, let's say a hedgehog wanders into your house and you naturally find yourself wondering what you should feed it. You might search for \"What do hedgehogs eat?\" On desktop, you'd see a Featured Snippet like the following: Given that you're trying to wrangle a strange hedgehog, searching on your desktop may not be practical, so you ask Google Home: \"Ok, Google — What do hedgehogs eat?\" and hear the following: Google Home leads with the attribution to Ark Wildlife (since a voice answer has no direct link), and then repeats a short version of the desktop snippet. The connection between the two answers is, I hope, obvious. Anecdotally, this is a pattern we see often on Google Home, but how consistent is it? How does Google handle Featured Snippets in other formats (including lists and tables)? Are some questions answered wildly differently by Google Home compared to desktop search? Methodology (10K --> 1K)To find out the answer to these questions, I needed to start with a fairly large set of searches that were likely to generate answers in the form of Featured Snippets. My colleague Russ Jones pulled a set of roughly 10,000 popular searches beginning with question words (Who, What, Where, Why, When, How) from a third-party \"clickstream\" source (actual web activity from a very large set of users). I ran those searches on desktop (automagically, of course) and found that just over half (53%) had Featured Snippets. As we've seen in other data sets, Google is clearly getting serious about direct answers. The overall set of popular questions was dominated by \"What?\" and \"How?\" phrases: Given the prevalence of \"How to?\" questions, I've broken them out in this chart. The purple bars show how many of these searches generated Featured Snippets. \"How to?\" questions were very likely to display a Featured Snippet, with other types of questions displaying them less than half of the time. Of the roughly 5,300 searches in the full data set that had Featured Snippets, those snippets broke down into four types, as follows: Text snippets — paragraph-based answers like the one at the top of this post — accounted for roughly two-thirds of all of the Featured Snippets in our original data set. List snippets accounted for just under one-third — these are bullet lists, like this one for \"How to draw a dinosaur?\": Step 1 – Draw a small oval. Step 5 – Dinosaur! It's as simple as that. Table snippets made up less than 2% of the Featured Snippets in our starting data set. These snippets contain a small amount of tabular data, like this search for \"What generation am I?\": If you throw your money recklessly at your avocado toast habit instead of buying a house, you're probably a millennial (sorry, content marketing joke). Finally, video snippets are a special class of Featured Snippet with a large video thumbnail and direct link (dominated by YouTube). Here's one for \"Who is the spiciest memelord?\": I'm honestly not sure what commentary I can add to that result. Since there's currently no way for a video to appear on Google Home, we excluded video snippets from the rest of the study. Google has also been testing some hybrid Featured Snippets. In some cases, for example, they attempt to extract a specific answer from the text, such as this answer for \"When was 1984 written?\" (Hint: the answer is not 1984): For the purposes of this study, we treated these hybrids as text snippets. Given the concise answer at the top, these hybrids are well-suited to voice results. From the 5.3K questions with snippets, I selected 1,000, excluding video but purposely including a disproportionate number of list and table types (to better see if and how those translated into voice). Why only 1,000? Because, unlike desktop searches, there's no easy way to do this. Over the course of a couple of days, I had to run all of these voice searches manually on Google Home. It's possible that I went temporarily insane. At one point, I saw a spider on my Google Home staring back at me. Fearing that I was hallucinating, I took a picture and posted it on Twitter: I was assured that the spider was, in point of fact, not a figment of my imagination. I'm still not sure about the half-hour when the spider sang me selections from the Hamilton soundtrack. From snippets to voice answers So, how many of the 1,000 searches yielded voice answers? The short answer is: 71%. Diving deeper, it turns out that this percentage is strongly dependent on the type of snippet: Text snippets in our 1K data set yielded voice answers 87% of the time. List snippets dropped to just under half, and table snippets only generated voice answers one-third of the time. This makes sense — long lists and most tables are simply harder to translate into voice. In the case of tables, some of these results were from different sites or in a different format. In other words, the search generated a Featured Snippet and a voice answer, but the voice answer was of a different type (text, for example) and attributed to a different source. Only 20% of Featured Snippets in table format generated voice answers that came from the same source. From a search marketing standpoint, text snippets are going to generate a voice answer almost 9 out of 10 times. Optimizing for text/paragraph snippets is a good starting point for ranking on voice search and should generally be a win-win across devices. Special: Knowledge GraphWhat about the Featured Snippets that didn't generate voice answers? It turns out there was quite a variety of exceptions in play. One exception was answers that came directly from the Knowledge Graph on Google Home, without any attribution. For example, the question \"What is the nuclear option?\" produces this Featured Snippet (for me, at least) on desktop: On Google Home, though, I get an unattributed answer that seems to come from the Knowledge Graph: It's unclear why Google has chosen one over the other for voice in this particular case. Across the 1,000 keyword set, there were about 30 keywords where something similar happened. Special: Device helpGoogle Home seems to translate some searches as device-specific help. For example, \"How to change your name?\" returns desktop results about legally changing your name as an individual. On Google Home, I get the following: Other searches from our list that triggered device help include: How to contact Google? How to send a fax online? What are you up to? Special: Easter eggsGoogle Home has some Easter eggs that seem unique to voice search. One of my personal favorites — the question \"What is best in life?\" — generates the following: Here's a list of the other Easter eggs in our 1,000 phrase data set: How many letters are in the alphabet? What are your strengths? What came first, the chicken or the egg? What generation am I? What is the meaning of life? What would you do for a Klondike bar? Where do babies come from? Where in the world is Carmen Sandiego? Where is my iPhone? Where is Waldo? Who is your daddy? Easter eggs are a bit less predictable than device help. Generally speaking, though, both are rare and shouldn't dissuade you from trying to rank for Featured Snippets and voice answers. Special: General confusion In a handful of cases, Google simply didn't understand the question or couldn't answer the exact question. For example, I could not get Google to understand the question \"What does MAGA mean?\" The answer I got back (maybe it's my Midwestern accent?) was: On second thought, maybe that's not entirely inaccurate.One interesting case is when Google decides to answer a slightly different question. On desktop, if you search for \"How to become a vampire?\", you might see the following Featured Snippet: On Google Home, I'm asked to clarify my intent: I suspect both of these cases will improve over time, as voice recognition continues to advance and Google becomes better at surfacing answers. Special: Recipe resultsBack in April, Google launched a new set of recipe functions across search and Google Home. Many \"How to?\" questions related to cooking now generate something like this (the question I asked was \"How to bake chicken breast?\"): You can opt to find a recipe on Google search and send it to your Google Home, or Google can simply pick a recipe for you. Either way, it will guide you through step-by-step instructions. Special: Health conditionsA half-dozen or so health questions, from general questions to diseases, generated results like the following. This one is for the question \"Why do we sneeze?\": This has no clear connection to desktop search results, and I'm not clear if it's a signal for future, expanded functionality. It seems to be of limited use right now. Special: WikiHowA handful of \"How to?\" questions triggered an unusual response. For example, if I ask Google Home \"How to write a press release?\" I get back: If I say \"yes,\" I'm taken directly to a wikiHow assistant that uses a different voice. The wikiHow answers are much longer than text-based Featured Snippets. How should we adapt?Voice search and voice appliances (including Google Assistant and Google Home) are evolving quickly right now, and it's hard to know where any of this will be in the next couple of years. From a search marketing standpoint, I don't think it makes sense to drop everything to invest in voice, but I do think we've reached a point where some forward momentum is prudent.First, I highly recommend simply being aware of how your industry and your major keywords/questions \"appear\" on Google Home (or Google Assistant on your mobile device). Look at the recipe situation above — for 99%+ of the people reading this article, that's a novelty. If you're in the recipe space, though, it's game-changing, and it's likely a sign of more to come.Second, I feel strongly that Featured Snippets are a win-win right now. Almost 90% of the text-only Featured Snippets we tracked yielded a voice answer. These snippets are also prominent on desktop and mobile searches. Featured Snippets are a great starting point for understanding the voice ecosystem and establishing your foothold. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Lessons from 1,000 Voice Searches (on Google Home)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Lessons from 1,000 Voice Searches (on Google Home)"
    },
    {
      "level": "H2",
      "text": "Methodology (10K --> 1K)"
    },
    {
      "level": "H2",
      "text": "From snippets to voice answers"
    },
    {
      "level": "H2",
      "text": "Special: Knowledge Graph"
    },
    {
      "level": "H2",
      "text": "Special: Device help"
    },
    {
      "level": "H2",
      "text": "Special: Easter eggs"
    },
    {
      "level": "H2",
      "text": "Special: General confusion"
    },
    {
      "level": "H2",
      "text": "Special: Recipe results"
    },
    {
      "level": "H2",
      "text": "Special: Health conditions"
    },
    {
      "level": "H2",
      "text": "Special: WikiHow"
    },
    {
      "level": "H2",
      "text": "How should we adapt?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}