{
  "url": "https://moz.com/blog/lessons-learned-by-an-over-optimizer-14730",
  "slug": "lessons-learned-by-an-over-optimizer-14730",
  "title": "Lessons Learned by an Over-Optimizer - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I own and run ShirtsThatGo, which is a small ecommerce site running on the Volusion platform. I started the company about three years ago and have been learning everything myself. I have taken a particular interest in the marketing piece, especially search engine optimization. I have made all the…",
  "content": "Lessons Learned by an Over-Optimizer On-page SEO N By: Nick Morgan February 20, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! N By: Nick Morgan February 20, 2012 Lessons Learned by an Over-Optimizer On-page SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I own and run ShirtsThatGo, which is a small ecommerce site running on the Volusion platform. I started the company about three years ago and have been learning everything myself. I have taken a particular interest in the marketing piece, especially search engine optimization. I have made all the usual mistakes and I am sure I have many more lessons to come. I am a pure white hat and have done the SEO effort the hard way by slowly gaining links and trying to do everything by the book. I ran into a rather perplexing problem about one year ago and it took me over a year to resolve it. My home page www.shirtsthatgo.com and the ice cream truck product page disappeared from the SERPs. The pages looked fine in the index but they would not rank for anything including the title tags. I read some of the great SEOmoz posts about what to do when a page will not rank for its title tag and tried to follow the steps. I had inbound sidebar links (non-paid) taken down for fear that I was seen as buying links. Yes, I went through a phase of chasing Google PR so I begged everyone to give me sidebar links! Sound familiar to anyone? Next I reached out to some of you and begged for help to this issue. I was getting desperate to solve the problem and did not know how to solve it. I even asked folks on the Google Webmaster Forum and my forum posts would show up in the SERPs and not my missing page! As it turns out I just needed to learn to listen. I was getting some great guidance from Dean Peckenpaugh, who is an SEO and e-commerce specialist and one of the main contributors at the Volusion customer internal forum. Most forums tend to have one or two contributors who really know their stuff that everyone listens to. At the Volusion forum Dean is one of those guys. So Dean was pushing me away from over optimizing and telling me to think like a computer but to write my pages for people. I got so caught up in optimizing that the site content was (well it still is) written more for the bots than my prospective clients. My other product pages ranked so well that I was afraid to change anything. When I started to actually listen to what Dean was saying I took another look. Upon closer inspection the Ice Cream Truck page had maybe five more instances of the keyword than all the other product pages. I took a chance and backed way off the keyword count. I figured nothing would happen at all and that my needle in a haystack problem would still be there. On the next crawl the page was in position one on page one for the target keyword. Could it be this simple? I was blown away! I had badly overstuffed my site and my problem was so easy to fix!!! For any given page there is clearly a keyword limit and the algorithm will simply flag the offending page and refuse to serve it up. Stay above the limit and the page is banished. Drop below the limit and it will rank! My expectation is that this is going to differ somewhat from page to page but the rule will hold. Just this week I deployed some new product pages. I tend to put them online a few days in advance with a teaser product photo so that the page is already ranking by the time I have the product ready for the site. I ran into the problem again with our tank t-shirt page. I had inadvertently stuffed it a bit too full of the target keyword. On large pages a quick way to check this is to view source and use the find feature. This will paint all the instances and as you scroll through it will be apparent if a term is appearing too frequently. Note this screen shot does not show all the other instances that are below the fold. As my pages are ranking great I do not want to make any drastic moves. That said I know my pages are still way over-optimized. Over time I will pull back on the keywords in the body and see if I can rely on the title tag, a couple of headings, and maybe one instance of the keyword in the body. Once I find a happy medium I will update all the pages. As I see it Google knows what the page is about by the title and the H1. Everything else that is not written purely for humans is stuffing plain and simple. Here is a sample of our police car sell page and as you can see the target keyword is in there a lot. This page is ranking on page one for “kids police car t-shirts” and was just deployed a few days ago. Once the ice cream truck page was ranking it was time to deal with the home page. At the time the home page was relatively skinny but I had content with anchor links pointing to almost all of the product pages. The home page was not even ranking for its title tag, so definitely something was way wrong. In this case though I did not see a keyword stuffing issue so I decided to think like a computer on this one and looked at the structure of the page for anything that might be confusing. I noticed first that the page did not have an H1 or H2 which is how Volusion pages come out of the box. I read about how the importance of these tags is diminishing but they do add structure which is important. Also the page had content that was more about the various product pages. I had the idea that I was passing PR from my home page to all my product pages and thus helping them rank. It was not working! As a computer I might be confused by the home page so I made the following change to add a very clear structure to the page and overall site: Here are the changes that I made: Added structure by putting an H1 and H2 that had exact match to the title tag main keyword. Removed all content about product pages and the links to the product pages. Added new content that was built up around the target keyword and the general topic of my site. Added a link to the home page from the bottom of every product page with anchor text matching the <title> and <h1>< h2 >of the home page. Within a few days the page started to rank for the title tag! After a few weeks the site was sitting around position 70 or so for the target keyword “kids t-shirts”. About a month later the page jumped to around page 20 or so in the SERPs for “kids t-shirts”. Position 20 seems about right given the other players in the space and the authority we have built up. I find it interesting the way the site sat in a lower position for many weeks then as if something came unblocked it popped up in the SERPs. This may illustrate some kind of a holding place Google uses for pages recently emerging from being flagged prior to giving them full ranking. Here are the key takeaways from this experience that I wanted to share with you all: Consider keyword count if a page is indexed but not ranking for its title tag. Look closely at the structure of your site and ask yourself is it clear what the site is about. The idea of home page being general and product pages being specific makes a lot of sense. Be careful not to send mixed signals about what pages are about when building internal links. I welcome all and any feedback. Any feedback about my site as well would be very much appreciated! Thanks, Nick Morgan ShirtsThatGo Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Lessons Learned by an Over-Optimizer"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Lessons Learned by an Over-Optimizer"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Nick Morgan\n          \n            Nick Morgan"
}