{
  "url": "https://moz.com/blog/let-onpage-optimization-change-your-life",
  "slug": "let-onpage-optimization-change-your-life",
  "title": "Let On-Page Optimization Change your Life! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Do NOT underestimate the value of good content, on-page optimization, and strong theme building! As people involved in the SEO industry, we come across various websites in our scope of work. Ecommerce, lead-based information portals..the list is never ending!",
  "content": "Let On-Page Optimization Change your Life! On-page SEO By: Pallav Jain July 17, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Pallav Jain July 17, 2012 Let On-Page Optimization Change your Life! On-page SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Do NOT underestimate the value of good content, on-page optimization, and strong theme building! As people involved in the SEO industry, we come across various websites in our scope of work. Ecommerce, lead-based information portals..the list is never ending! Something that is common across these websites is the creation of good, unique and engaging content. The SEO world has always maintained that ‘Content is King’. However, there are times when it is difficult convincing a client that they need to add more content on the website, while maintaining the aesthetic and flow of the website. Clients generally prefer adding other elements such as images, videos, flash etc. to make the page more engaging instead of adding more meaningful content. Website: We had one client who came to us, who wanted to increase their visibility and brand value online. The website is an information portal with no lead forms. To give you a brief background of the website, these guys are an information portal providing information on local pubs, bars and cafes. Their unique selling proposition is that they list out different sports being showcased live in these bars and pubs. Their main target audience is people who wanted to catch a game in the nearest bar/pub. Website Structure: When we received the site from the client, they had very little going on in their site. The main pages can be broken down as follows: Matches / Games (showed various upcoming games and a list of all the local pubs broadcasting the game live) Bars (a list of various bars present in their inventory) Individual Match Pages (a page dedicated to a sporting event and all the bars which were broadcasting this particular sport live) And that was about it! Challenges: The main problem was that they did not have static pages. The Matches page was updated every day depicting the schedule for the next couple of weeks and the old URLs returned a 404. The only section we could work with was the individual Bars (and this was not their primary area of focus). Scope of Work: We identified two main objective The main objective of the campaign was to get more visitors to the site when they searched for generic terms as well as sport-specific terms. Improve brand visibility online. On-Page: The site needed to urgently add more themes and pages for specific sections for us to initiate work. The original number of pages would be workable only if we were trying to rank just for generic terms. However, for sport-specific terms, we needed to create pages on the site and build themes. During our keyword analysis, we observed that a lot of people also searched for sport + location based terms. Themes: Once we concluded our keyword analysis, we requested our client to create the following themes of pages on the site: A. Matches: Sport based sections Football F1 Cricket etc. Competition based section Olympics US Open Premier League etc. Location based sections Various locations where the client had bars showing a sport live B. Bars: Best Bars by Sport Best Bars by Location Best Bars by Team Once the client created the aforementioned themes, we had a lot of pages to work with and accordingly sent across content recommendations. Content: The client was asked to add engaging content for each page. Also, we encouraged the client to add more content on the top of the page, bearing in mind Google’s Page Layout Algorithm update. They added content focusing more on user engagement and less on SEO. After the implementation of content; we had at least 350-400 words on each page. The content was a natural as possible, with just one or two instances of a keyword present on the page. Optimization: We kept the optimization as natural as possible. All the tags on the page were kept brief and specific. We did not try and incorporate various keywords in the same tag or incorporate marketing messages in our descriptions. (Post the Penguin update, well; no one does anyway!) Simple was our motto! We already had the support of great content and that is such a big bonus when a client readily and quickly (read: turnaround times of one day or at most; a week to completely overhaul the website, including the creation of pages, addition of content and any other recommendations presented!) implemented changes and modifications which were suggested! In our internal linking strategy, we looked to strengthening our on-page themes. We interlinked related final landing pages of a particular category or theme. For example – under a particular sport, we have interlinked two different competitions, so on and so forth. We created a very tight and very relevant mesh of pages interlinked to each other through the content. This definitely goes a long way as our themes were structured very distinctly! Most of our recommendations were complete and pushed live on the website by the end of February and the first week of March. Results: Traffic: What resulted because of the creation of additional pages and strong themes was a complete site overhaul! Not only did we get more pages and content to work with, we virtually started ranking in the top five for most of the upcoming games (long-tail keywords no doubt, but the searches escalated considerably before games and matches)! If we were to only look at the traffic side of things, one would see an exponential growth in traffic! The following chart shows our traffic improvement month-on-month – We have compared the overall traffic coming to the website against the non-brand, organic visits (excluding not provided). As can be seen, the number of people coming to the site through non brand related keywords has increased by over 4000%! (264 in December, at the start of the campaign as compared to 11,652 in May) Visibility: New Visits: There is no doubt that the brand value and visibility has improved tremendously for the website. Right from ranking in the first page on SERPs for most ‘sport’ related terms as well as ‘sport + location’ based terms; the number of new visits on the website has increased substantially! The following depicts the same – Effectively what happened was that the number of new people coming to the site using non-brand, organic terms did increase tremendously. This meant that we were reaching out to more audiences online, meeting the client’s primary objective! The following table highlights the ‘percentage of new visits per month. Month Non Brand New Visits New Visits December 264 217 82.20% January 548 415 75.73% February 913 750 82.15% March 3,840 3,223 83.93% April 9,985 8,591 86.04% May 11,652 10,136 86.99% Page views: The addition of new pages has had a tremendous growth on the number of page views on the site. The following highlights that people have not only been coming to our website, but have been browsing through it! Taking into account that the site is an information portal where most people leave once they get the information they need (which is normally the page they land on), spikes in page views is indicative that the structure is well defined and that the content is engaging, which in turn encourages users to browse through the website. Closing: Many clients are hesitant to update content and increase pages on the site. Their reasons range from lack of funds to downright refusal as they believe that it may spoil the aesthetics of the website. From an SEO perspective, it is imperative that we convince our clients the value of a well-structured site architecture; hand-in-hand with good and engaging user-oriented content. Agreed that content marketing and link building (post the Penguin update, not sure if we can call it link building) play a very important role in our day-to-day lives, but the creation of good content and strong themes means that our job half done! PS: We have not built any links or engaged in content marketing activities for the aforementioned themes. We are ranking well; sorely on the basis of the work we have done on-page! This post is written by Anindita Debnath, who works with Convonix as a Project Manager - SEO. She manages a team of 10 SEO professionals handling well-over 25 campaigns together. Apart from this, she takes up the responsibility of training freshers, and ushering them in the dynamic world of SEO. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Let On-Page Optimization Change your Life!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Let On-Page Optimization Change your Life!"
    },
    {
      "level": "H2",
      "text": "Website:"
    },
    {
      "level": "H2",
      "text": "Website Structure:"
    },
    {
      "level": "H2",
      "text": "Challenges:"
    },
    {
      "level": "H2",
      "text": "Scope of Work:"
    },
    {
      "level": "H2",
      "text": "On-Page:"
    },
    {
      "level": "H3",
      "text": "Themes:"
    },
    {
      "level": "H3",
      "text": "Content:"
    },
    {
      "level": "H3",
      "text": "Optimization:"
    },
    {
      "level": "H2",
      "text": "Results:"
    },
    {
      "level": "H3",
      "text": "Traffic:"
    },
    {
      "level": "H3",
      "text": "Visibility:"
    },
    {
      "level": "H2",
      "text": "Closing:"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Pallav Jain\n          \n            Pallav Jain\n          \n            Pallav Jain"
}