{
  "url": "https://moz.com/blog/lets-talk-landing-pages",
  "slug": "lets-talk-landing-pages",
  "title": "Let's Talk Landing Pages - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Chapter 4 of Web Design for ROI is all about landing pages, and it's the best and most valuable chapter thus far. The chapter starts off with this little gem of a quote:\nEnter the custom landing page. It's a web site's stand-in for ambassador, concierge, and superstar salesperson rolled into one.…",
  "content": "Let's Talk Landing Pages Design By: Rebecca Kelley April 29, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley April 29, 2008 Let's Talk Landing Pages Design The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Chapter 4 of Web Design for ROI is all about landing pages, and it's the best and most valuable chapter thus far. The chapter starts off with this little gem of a quote: Enter the custom landing page. It's a web site's stand-in for ambassador, concierge, and superstar salesperson rolled into one. It's been carefully crafted to meet, assist, and convert visitors into customers. Carefully crafted, mind you. I think a huge problem with landing pages is that they're slapped together with a feature, a price, and a \"Buy\" button. You throw this heap of crap together and then wonder why your conversions are so poor. Well, it's time to get it through your head that a considerable amount of time and effort should be spent on your landing pages. Think about when someone clicks through and ends up on your page. They'll likely ask themselves, \"Is this what I searched for? Does this site look legit or is it just another spammy piece of poo? Is it worth my time to stay on this site?\" You simply need to get out of the \"Here's what I want\" mentality and shift to \"Here's what users want.\" Users are searching for things -- products, services, information -- and if you happen to appear for that search, you need to deliver and satisfy their expectations should they click on your result. If you don't, goodbye, they're off to find someone else who can. Not only should your landing page satisfy user expectations, it should also reflect your business goals. Do you want to collect contact information? Sell a product? Pitch your services? Whatever your goal, make sure your landing page, sign up procedure, and overall conversion process are constructed with your goal in mind. Establish your goals and get a good mental image of a searcher landing on your page. If he scratches his head, clicks at random stuff, and ultimately leaves, then congratulations, your goal of \"I want to confuse and alienate my user\" has been fulfilled. Wait, that's not what you want to accomplish? Well then, back to the drawing board! Loveday and Niehaus, the authors of Web Design for ROI, discuss some unique issues for landing pages, which I'll summarize below: They have to essentially perform the entire sales process. The landing page must offer a product, service, or information, capture your visitor's attention long enough to pique his or her interest and ultimately want to convert, and entice the user to take action (fill out a form, provide payment, etc). Basically, your landing page has to act as your best salesperson. That's a lot to ask of one little page. They have to capture attention very quickly. People skim, scan, and scoot. Your landing page has only a few precious seconds to keep your visitor from hitting the back button. They're viewed by a lot of new eyeballs. A lot of new visitors see your landing page compared to your built-in audience. These new people probably aren't going to know what your site's about or whether it's a reputable company. Now that a landing page's duties have been made clear, it's time to go over some design guidelines. The authors provide a lot of great suggestions that I'll share below. Hopefully you're already implementing some of these on your site--if not, there's plenty to test, so take these ideas and implement them on your own landing pages. Establish credibility. Is your design professional-looking? Are there any formatting or spacing issues? Has your copy been checked for spelling and grammar? Remember that your landing page is your visitor's first impression of your company. Don't show up to a date with a dirty shirt--you want to woo, not repulse. Make sure your design looks professional and is industry-appropriate. The book recommends looking at your competitors' landing pages and comparing them to your own. Even go so far as to print out the various pages and spread them out on a table to compare them. Keep in mind that while you don't have to exactly mimic your competitor's landing page (well, maybe you do if theirs is vastly outperforming yours), you do want your landing page to be industry-appropriate--no flashing boobies on a private school website, no glittery ringtone offers if you're marketing whitepapers, etc. Include positive resources and testimonials. Choose a few (emphasis on \"few\"--don't clutter your page with 20 testimonials and make it look like a friggin' love fest) quotes, awards, badges, etc from reputable sources, satisfied customers, and established colleagues, and display them on your landing page. Make sure nothing's broken. Does the landing page function or are there broken images and links? How does the page look in various browsers? Remember that a poorly functioning page reflects equally poorly on you--how's a visitor supposed to have faith in your product if your landing page doesn't even work properly? Simplify and separate. Simplify your landing page's design compared to the rest of your site. As Loveday and Niehaus put it, \"Think of a landing page as aplace to showcase your offer, like putting a spotlight on a Lamborghini or surrounding a diamond ring with a swirl of blue velvet.\" You should eliminate distractions so that your visitor can focus his or her attention on your offer. Reduce or eliminate navigation. People don't come to your landing page to check out the rest of your site, they come to see if what you're specifically offering on that single page aligns with what they're looking for. Don't give them ways to exit off the page; instead, provide them with what they're looking for, and nothing more. It's kind of like setting a cupcake at your feet and then diving the hell out of the way when a rampaging fat kid lumbers over to take the bait. Minimize your branding. The authors stress that, on a landing page, \"a company's identity is secondary to the offer.\" You have limited real estate on your page--don't waste space with a giant logo or multiple brand images. Keep it simple and small to avoid distractions and to maximize the space that's available for your offer and benefits. Think of your landing page as a continuation of your ad. Your AdWords or banner ad should provide a message that is continued onto your landing page. Think of a two-part television episode--the \"To Be Continued\" end of Part 1 doesn't lead to a completely different episode in Part 2. Provide searchers with a \"consistent, seamless experience.\" Don't make promises you can't keep. If you promise free shipping in your ad, your landing page better offer free shipping. Don't be misleading and offer incentives you have no intent on delivering. Match your ad's call to action. Your Google Quality Score will be better if you offer a consistent message on both your ad and your landing page, and users will benefit from the consistency as well. If your ad says \"The best printer money can buy,\" your landing page should say something to the effect of \"Introducing the SuperPrint 5000: The Best Printer Money Can Buy.\" Use the same keywords and phrases in both messages. Use consistent graphics and images. If your banner ad shows a picture of a frog leaping, use the same image on your landing page. (I think I'm noticing a theme here--do you think consistency is key?) Keep the language consistent. Don't be all \"Yo yo yo, check out dis pimp sneaker, wassup\" on your ad and then have your landing page say something like, \"The most luxurious running shoe you'll have the sublime pleasure of slipping your foot into.\" Segment for different audiences/customers. For example, we offer PRO memberships, but what if we offered different packages based on the size and scope of the customer? If we were to offer segmenting options on our landing page that provided paths for a single consultant, a small search marketing firm, and an \"enterprise\" edition for Fortune 500 companies, we'd probably have a better conversion rate than if all three visitors searched for \"seo tools,\" came to our landing page, and saw a one-size-fits-all offer that would either be too much for the single consultant or too limited for bigger companies. Personalize to your visitor. If you have an email marketing campaign, use the name of your recipient on your landing page when he or she clicks through from the email (\"Hi Jane!\"). If you offer state-specific information, use geotargeting to offer up the Washington state landing page when someone from Washington clicks through. Little personal touches like these are simple yet effective. User fewer but better graphics. As I said earlier, you have limited real estate on your landing page. Don't waste it with giant, superfluous graphics and images. If you do have a graphic or image, make sure it clarifies or supports your offer. Don't decorate for the sake of decorating. Make sure the medium is what's best for your offer. Don't have images, charts, videos, and Flash all on your landing page simply because you think that more is better. Do you really need a video demonstration, or are you just annoying visitors and driving them away? You need to be able to justify the medium and determine if it is truly augmenting your pitch. Speak the customer's language, not yours. Sometimes visitors are Average Joes, not the CEO of corporate headquarters for your company or industry. Thus, they might search for your product using laymen terms and not the technical jargon you're used to. This is where keyword research comes in. In order to provide what users are searching for, you have to know what search terms and phrases they're using. Emphasize benefits, not features. Loveday and Neihaus stress that \"Answering the questions 'What does my audience truly care about?' and 'What problems does my offer solve for my audience?' will help you write truly compelling copy.\" Too many landing pages get tripped up on features and end up overlooking their products' benefits to the searcher. Great, your product comes in electric blue or sea foam green and it can fit in your pocket for easy transportation. But why do I need this product? How will it make my life easier? Weed out all but the most essential points. Your time and space are limited, so don't waste your visitor's time with tons and tons of information. Determine what the most pertinent, relevant questions are and focus on those. (Note: obviously everyone has seen examples of long sales forms converting well. Why not test a short sales page against a long form and see which converts better--after all, the conversion rate is what it boils down to.) Cover all your bases. Bold words and sentences for the skimmers, include concise but information-rich paragraphs for the readers, and throw in an image for the visually oriented visitors. Be intelligent about how you display your information. Keep your most important information above the fold. If your landing page requires scrolling, repeat your call to action every couple of paragraphs (once per visual screen). Avoid \"false bottoms\" at the fold--visitors can miss information if they think they're at the bottom but there's actually more information below the fold. Put an image or a paragraph at the fold so users will know that they have to scroll down to continue reading or viewing. Provide a clear call to action. Here's where we start the conversion process. You need to make it exceptionally clear as to what your visitor's next step should be. Don't use stupid messages in an attempt to be clever--stick with direct, succinct, clear, and to the point words and phrases. \"Start Living!\" is vague and confusing compared to \"Book a Vacation.\" Consider providing a secondary call to action. A secondary call to action is a safety net that can potentially catch visitors who aren't ready to convert but still want to learn more. The secondary call to action should be smaller and less prominent than the primary call to action. An example a primary vs. a secondary call to action is \"Add to Cart\" vs. \"Download a Product Brochure.\" Other secondary calls to action would be a preview of the product or the option to view the first page of a whitepaper or article. If you do offer a secondary call to action, make sure you track it so that you can follow up on these leads and try to get them to convert to a primary CTA. Provide offline alternatives. Offer fax information or a phone number in case customers don't want to provide information via the 'net. Don't request more than the minimum information necessary. Your forms shouldn't require any superfluous information that will make your users uncomfortable. Web Design for ROI goes more deeply into form optimization in a later chapter, but the general rule is not to create a gigantically long form with information that you don't actually need to know. Make your buttons look like buttons, and make sure to optimize them. Generally, buttons have a rectangular or square border around them, and they look clickable. Don't go against conventions or else you'll confuse your users. Also, make those suckers noticeable! Don't make your buttons so small that they get lost within the rest of your landing page's content. Your buttons should be prominent on your page, and their labels should be concise yet clear and inviting. The book uses a good example of three buttons, one that says \"Register,\" one that says \"Register now,\" and one that says \"Get free newsletter.\" Which of the three do you think is the most enticing? Lastly, your button should, once again, keep the message consistent. If your button promises a free newsletter, link it to a free newsletter. Geez, there you go. 26 suggestions and tips for your landing pages. Of course, there's no perfect cookie cutter mold you can stuff your landing page into--different combinations work for different products and different websites. The most important thing to keep in mind about landing pages is that if something doesn't work, test a variation. Do some A/B or multivariate testing. Have several copies of your landing page and test a change on each one. Secondary calls to action don't work for you? No problem, get rid of them. Do you yield a great conversion rate from incorporating more images? Fine, throw in some more pictures. The above suggestions aren't necessarily set in stone--a lot of them are best practices, sure, but many are simple tidbits you can test for yourself. Now that we've gone over some landing page best practices and some suggestions on various layouts and iterations you can test, I'd love to hear if any of you have further suggestions or perhaps would like to share which tips have converted well for you. Let the sharing begin! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Let's Talk Landing Pages"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Let's Talk Landing Pages"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}