{
  "url": "https://moz.com/blog/lets-make-money-seo",
  "slug": "lets-make-money-seo",
  "title": "Let's Make Money: 4 Tactics for Agencies Looking to Succeed – Best of Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "What does it take for an agency to see success in a constantly changing industry? From confidently raising your prices to knowing when to say no, Russ Jones covers four essential tactics that'll ultimately increase your bottom line in this Whiteboard Friday.",
  "content": "Let's Make Money: 4 Tactics for Agencies Looking to Succeed – Best of Whiteboard Friday Whiteboard Friday | Advanced SEO | Digital Marketing Agencies By: Russ Jones August 21, 2020 Table of Contents Copied! By: Russ Jones August 21, 2020 Let's Make Money: 4 Tactics for Agencies Looking to Succeed – Best of Whiteboard Friday Whiteboard Friday | Advanced SEO | Digital Marketing Agencies We spend a lot of time discussing SEO tactics, but in a constantly changing industry and especially in times of uncertainty, the strategies agencies should employ in order to see success deserve more attention. In this popular (and still relevant) Whiteboard Friday, Russ Jones discusses four essential success tactics that'll ultimately increase your bottom line. Russ also delved into the topic of profitability in his MozCon Virtual presentation this year. To watch his and our other amazing speaker presentations, you can purchase access to the 2020 video bundle here. Click on the whiteboard image above to open a high-resolution version in a new tab! Video Transcription Howdy, Moz fans. I am Russ Jones, and I can't tell you how excited I am for my first Whiteboard Friday. I am Principal Search Scientist here at Moz. But before coming to Moz, for the 10 years prior to that, I was the Chief Technology Officer of a small SEO agency back in North Carolina. So I have a strong passion for agencies and consultants who are on the ground doing the work, helping websites rank better and helping build businesses. So what I wanted to do today was spend a little bit of time talking about the lessons that I learned at an agency that admittedly I only learned through trial and error. But before we even go further, I just wanted to thank the folks at Hive Digital who I learned so much from, Jeff and Jake and Malcolm and Ryan, because the team effort over time is what ended up building an agency. Any agency that succeeds knows that that's part of it. So we'll start with that thank-you. But what I really want to get into is that we spend a lot of time talking about SEO tactics, but not really about how to succeed in an industry that changes rapidly, in which there's almost no certification, and where it can be difficult to explain to customers exactly how they're going to be successful with what you offer. So what I'm going to do is break down four really important rules that I learned over the course of that 10 years. We're going to go through each one of them as quickly as possible, but at the same time, hopefully you'll walk away with some good ideas. Some of these are ones that it might at first feel a little bit awkward, but just follow me. 1. Raise prices The first rule, number one in Let's Make Money is raise your prices. Now, I remember quite clearly two years in to my job at Hive Digital — it was called Virante then — and we were talking about raising prices. We were just looking at our customers, saying to ourselves, \"There's no way they can afford it.\" But then luckily we had the foresight that there was more to raising prices than just charging your customers more. How it benefits old customers The first thing that just hit us automatically was... \"Well, with our old customers, we can just discount them. It's not that bad. We're in the same place as we always were.\" But then it occurred to us, \"Wait, wait, wait. If we discount our customers, then we're actually increasing our perceived value.\" Our existing customers now think, \"Hey, they're actually selling something better that's more expensive, but I'm getting a deal,\" and by offering them that deal because of their loyalty, you engender more loyalty. So it can actually be good for old customers. How it benefits new customers Now, for new customers, once again, same sort of situation. You've increased the perceived value. So your customers who come to you think, \"Oh, this company is professional. This company is willing to invest. This company is interested in providing the highest quality of services.\" In reality, because you've raised prices, you can. You can spend more time and money on each customer and actually do a better job. The third part is, \"What's the worst that could happen?\" If they say no, you offer them the discount. You're back where you started. You're in the same position that you were before. How it benefits your workers Now, here's where it really matters — your employees, your workers. If you are offering bottom line prices, you can't offer them raises, you can't offer them training, you can't hire them help, or you can't get better workers. But if you do, if you raise prices, the whole ecosystem that is your agency will do better. How it improves your resources Finally, and most importantly, which we'll talk a little bit more later, is that you can finally tool up. You can get the resources and capital that you need to actually succeed. I drew this kind of out. If we have a graph of quality of services that you offer and the price that you sell at, most agencies think that they're offering great quality at a little price, but the reality is you're probably down here. You're probably under-selling your services and, because of that, you can't offer the best that you can. You should be up here. You should be offering higher quality, your experts who spend time all day studying this, and raising prices allows you to do that. 2. Schedule Now, raising prices is only part one. The second thing is discipline, and I am really horrible about this. The reality is that I'm the kind of guy who looks for the latest and greatest and just jumps into it, but schedule matters. As hard as it is to admit it, I learned this from the CPC folks because they know that they have to stay on top of it every day of the week. Well, here's something that we kind of came up with as I was leaving the company, and that was to set all of our customers as much as possible into a schedule. Annually: we would handle keywords and competitors doing complete analysis.Semi-annually: Twice a year, we would do content analysis. What should you be writing about? What's changed in your industry? What are different keywords that you might be able to target now given additional resources?Quarterly: You need to be looking at links. It's just a big enough issue that you've got to look at it every couple of months, a complete link analysis.Monthly: You should be looking at your crawls. Moz will do that every week for you, but you should give your customers an idea, over the course of a month, what's changed.Weekly: You should be doing rankings But there are three things that, when you do all of these types of analysis, you need to keep in mind. Each one of them is a... ReportHours for consultingPhone call This might seem like a little bit of overkill. But of course, if one of these comes back and nothing changed, you don't need to do the phone call, but each one of these represents additional money in your pocket and importantly better service for your customers. It might seem hard to believe that when you go to a customer and you tell them, \"Look, nothing's changed,\" that you're actually giving them value, but the truth is that if you go to the dentist and he tells you, you don't have a cavity, that's good news. You shouldn't say to yourself at the end of the day, \"Why'd I go to the dentist in the first place?\" You should say, \"I'm so glad I went to the dentist.\" By that same positive outlook, you should be selling to your customers over and over and over again, hoping to give them the clarity they need to succeed. 3. Tool up! So number three, you're going to see this a lot in my videos because I just love SEO tools, but you've got to tool up. Once you've raised prices and you're making more money with your customers, you actually can. Tools are superpowers. Tools allow you to do things that humans just can't do. Like I can't figure out the link graph on my own. I need tools to do it. But tools can do so much more than just auditing existing clients. For example, they can give you... Better leads: You can use tools to find opportunities.Take for example the tools within Moz and you want to find other car dealerships in the area that are really good and have an opportunity to rank, but aren't doing as well as they should be in SERPs. You want to do this because you've already serviced successfully a different car dealership. Well, tools like Moz can do that. You don't just have to use Moz to help your clients. You can use them to help yourself. Better pre-audits: Nobody walks into a sales call blind. You know who the website is. So you just start with a great pre-audit. Faster workflows: Which means you make more money quicker. If you can do your keyword analysis annually in half the time because you have the right tool for it, then you're going to make far more money and be able to serve more customers. Bulk pricing: This one is just mind-blowingly simple. It's bulk pricing. Every tool out there, the more you buy from them, the lower the price is. I remember at my old company sitting down at one point and recognizing that every customer that came in the door would need to spend about $1,000 on individual accounts to match what they were getting through us by being able to take advantage of the bulk discounts that we were getting as an agency by buying these seats on behalf of all of our customers. So tell your clients when you're talking to them on the phone, in the pitch be like, \"Look, we use Moz, Majestic, Ahrefs, SEMrush,\" list off all of the competitors. \"We do Screaming Frog.\" Just name them all and say, \"If you wanted to go out and just get the data yourself from these tools, it would cost you more than we're actually charging you.\" The tools can sell themselves. You are saving them money. 4. Just say NO Now, the last section, real quickly, are the things you've just got to learn to say no to. One of them has a little nuance to it. There's going to be some bite back in the comments, I'm pretty sure, but I want to be careful with it. No month-to-month contracts The first thing to say no to is month-to-month contracts. If a customer comes to you and they say, \"Look, we want to do SEO, but we want to be able to cancel every 30 days.\" the reality is this. They're not interested in investing in SEO. They're interested in dabbling in SEO. They're interested in experimenting with SEO. Well, that's not going to succeed. It's only going to take one competitor or two who actually invest in it to beat them out, and when they beat them out, you're going to look bad and they're going to cancel their account with you. So sit down with them and explain to them that it is a long-term strategy and it's just not worth it to your company to bring on customers who aren't interested in investing in SEO. Say it politely, but just turn it away. Don't turn anything away Now, notice that my next thing is don't turn anything away. So here's something careful. Here's the nuance. It's really important to learn to fire clients who are bad for your business, where you're losing money on them or they're just impolite, but that doesn't mean you have to turn them away. You just need to turn them in the right direction. That right direction might be tools themselves. You can say, \"Look, you don't really need our consulting hours. You should go use these tools.\" Or you can turn them to other fledgling businesses, friends you have in the industry who might be struggling at this time. I'll tell you a quick example. We don't have much time, but many, many years ago, we had a client that came to us. At our old company, we had a couple of rules about who we would work with. We chose not to work in the adult industry. But at the time, I had a friend in the industry. He lived outside of the United States, and he had fallen on hard times. He literally had his business taken away from him via a series of just really unscrupulous events. I picked up the phone and gave him a call. I didn't turn away the customer. I turned them over to this individual. That very next year, he had ended up landing a new job at the top of one of the largest gambling organizations in the world. Well, frankly, they weren't on our list of people we couldn't work with. We landed the largest contract in the history of our company at that time, and it set our company straight for an entire year. It was just because instead of turning away the client, we turned them to a different direction. So you've got to say no to turning away everybody. They are opportunities. They might not be your opportunity, but they're someone's. No service creep The last one is service creep. Oh, man, this one is hard. A customer comes up to you and they list off three things that you offer that they want, and then they say, \"Oh, yeah, we need social media management.\" Somebody else comes up to you, three things you want to offer, and they say, \"Oh yeah, we need you to write content,\" and that's not something you do. You've just got to not do that. You've got to learn to shave off services that you can't offer. Instead, turn them over to people who can do them and do them very well. What you're going to end up doing in your conversation, your sales pitch is, \"Look, I'm going to be honest with you. We are great at some things, but this isn't our cup of tea. We know someone who's really great at it.\" That honesty, that candidness is just going to give them such a better relationship with you, and it's going to build a stronger relationship with those other specialty companies who are going to send business your way. So it's really important to learn to say no to say no service creep. Well, anyway, there's a lot that we went over there. I hope it wasn't too much too fast, but hopefully we can talk more about it in the comments. I look forward to seeing you there. Thanks. Video transcription by Speechpad.com Ready for more? You'll uncover even more SEO goodness in the MozCon 2020 video bundle. At this year's special low price of $129, this is invaluable content you can access again and again throughout the year to inspire and ignite your SEO strategy: 21 full-length videos from some of the brightest minds in digital marketingInstant downloads and streaming to your computer, tablet, or mobile deviceDownloadable slide decks for presentations Get my MozCon 2020 video bundle Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Let's Make Money: 4 Tactics for Agencies Looking to Succeed – Best of Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Let's Make Money: 4 Tactics for Agencies Looking to Succeed – Best of Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "1. Raise prices"
    },
    {
      "level": "H3",
      "text": "How it benefits old customers"
    },
    {
      "level": "H3",
      "text": "How it benefits new customers"
    },
    {
      "level": "H3",
      "text": "How it benefits your workers"
    },
    {
      "level": "H3",
      "text": "How it improves your resources"
    },
    {
      "level": "H2",
      "text": "2. Schedule"
    },
    {
      "level": "H2",
      "text": "3. Tool up!"
    },
    {
      "level": "H3",
      "text": "Better leads:"
    },
    {
      "level": "H3",
      "text": "Better pre-audits:"
    },
    {
      "level": "H3",
      "text": "Faster workflows:"
    },
    {
      "level": "H3",
      "text": "Bulk pricing:"
    },
    {
      "level": "H2",
      "text": "4. Just say NO"
    },
    {
      "level": "H3",
      "text": "No month-to-month contracts"
    },
    {
      "level": "H3",
      "text": "Don't turn anything away"
    },
    {
      "level": "H3",
      "text": "No service creep"
    },
    {
      "level": "H2",
      "text": "Ready for more?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Russ Jones\n          \n            Russ Jones\n          \n            Russ Jones"
}