{
  "url": "https://moz.com/blog/leveraging-panda-to-get-out-of-product-feed-jail",
  "slug": "leveraging-panda-to-get-out-of-product-feed-jail",
  "title": "Leveraging Panda to Get Out of Product Feed Jail - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This is a story about Panda, customer service, and differentiating your store from others selling the same products. I'm going to use a real-live example that I suffered through about a month ago: I was looking for a replacement sink stopper for a bathroom sink. It did not go well.",
  "content": "Leveraging Panda to Get Out of Product Feed Jail Content Marketing | On-page SEO | E-Commerce SEO M By: Michael Cottam January 29, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! M By: Michael Cottam January 29, 2015 Leveraging Panda to Get Out of Product Feed Jail Content Marketing | On-page SEO | E-Commerce SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This is a story about Panda, customer service, and differentiating your store from others selling the same products. Many e-commerce websites get the descriptions, specifications, and imagery for products they sell from feeds or databases provided by the manufacturers. The manufacturers might like this, as they control how their product is described and shown. However, it does their retailers no good when they are trying to rank for searches for those products and they've got the exact same content as every other retailer. If the content in the feed is thin, then you'll have pages with...well....thin content. And if there's a lot of content for the products, then you'll have giant blocks of content that Panda might spot as being the same as they've seen on many other sites. To throw salt on the wound, if the content is really crappy, badly written, or downright wrong, then the retailers' sites will look low-quality to Panda and users as well. Many webmasters see Panda as a type of Google penalty—but it's not, really. Panda is a collection of measurements Google is taking of your web pages to try and give your pages a rating on how happy users are likely to be with those pages. It's not perfect, but then again—neither is your website. Many SEO folks (including me) tend to focus on the kinds of tactical and structural things you can do to make Panda see your web pages as higher quality: things like adding big, original images, interactive content like videos and maps, and lots and lots and lots and lots of text. These are all good tactics, but let's step back a bit and look at a specific example to see WHY Panda was built to do this, and from that, what we can do as retailers to enrich the content we have for e-commerce products where our hands are a bit tied—we're getting a feed of product info from the manufacturers, the same as every other retailer of those products. I'm going to use a real-live example that I suffered through about a month ago. I was looking for a replacement sink stopper for a bathroom sink. I knew the brand, but there wasn't a part number on the part I needed to replace. After a few Google searches, I think I've found it on Amazon: Don't you wish online shopping was always this exciting?What content actually teaches the customer All righty... my research has shown me that there are standard sizes for plug stoppers. In fact, I initially ordered a \"universal fit sink stopper.\" Which didn't fit. Then I found 3 standard diameters, and 5 or 6 standard lengths. No problem...I possess that marvel of modern tool chests, a tape measure...so I measure the part I have that I need to replace. I get about 1.5\" x 5\". So let's scroll down to the product details to see if it's a match: Whoa. 1.2 POUNDS? This sink stopper must be made of Ununoctium. The one in my hand weighs about an ounce. But the dimensions are way off as well: a 2\" diameter stopper isn't going to fit, and mine needs to be at least an inch longer. I scroll down to the product description...maybe there's more detail there, maybe the 2\" x 2\" is the box or something. Well, that's less than helpful, with a stupid typo AND incorrect capitalization AND a missing period at the end. Doesn't build confidence in the company's quality control. Looking at the additional info section, maybe this IS the right part...the weight quoted in there is about right: Where else customers look for answers Next I looked at the questions and answers bit, which convinced me that it PROBABLY was the right part: If I was smart, I would have covered my bets by doing what a bunch of other customers also did: buy a bunch of different parts, and surely one of them will fit. Could there possibly was a clearer signal that the product info was lacking than this? In this case, that was probably smarter than spending another 1/2 hour of my time snooping around online. But in general, people aren't going to be willing to buy THREE of something just to make sure they get the right one. This cheap part was an exception. So, surely SOMEONE out there has the correct dimensions of this part on their site—so I searched for the part number I saw on the Amazon listing. But as it turned out, that crappy description and wrong weight and dimensions were on every site I found...because they came from the manufacturer. A few of the sites had edited out the \"designed for long long\" bit, but apart from that, they were all the same.What sucks for the customer is an opportunity for you Many, many retailers are in this same boat—they get their product info from the manufacturer, and if the data sucks in their feed, it'll suck on their site. Your page looks weak to both users and to Panda, and it looks the same as everybody else's page for that product...to both users and to Panda. So (a) you won't rank very well, and (b) if you DO manage to get a customer to that page, it's not as likely to convert to a sale. What can you do to improve on this? Here's a few tactics to consider.1. Offer your own additional description and comments Add a new field to your CMS for your own write-ups on products, and when you discover issues like the above, you can add your own information—and make it VERY clear what's the manufacturer's stock info and what you've added (that's VALUE-ADDED) as well. My client Sports Car Market magazine does this with their collector car auction reports in their printed magazine: they list the auction company's description of the car, then their reporter's assessment of the car. This is why I buy the magazine and not the auction catalog.2. Solicit questions Be sure you solicit questions on every product page—your customers will tell you what's wrong or what important information is missing. Sure, you've got millions of products to deal with, but what the customers are asking about (and your sales volume of course) will help you prioritize as well as find the problems opportunities. Amazon does a great job of enabling this, but in this case, I used the Feedback option to update the product info, and got back a total bull-twaddle email from the seller about how the dimensions are in the product description thank you for shopping with us, bye-bye. I tried to help them, for free, and they shat on me.3. But I don't get enough traffic to get the questions Don't have enough site volume to get many customer requests? No problem, the information is out there for you on Amazon :-). Take your most important products, and look them up on Amazon, and see what questions are being asked—then answer those ONLY on your own site.4. What fits with what? Create fitment/cross-reference charts for products. You probably have in-house knowledge of what products fit/are compatible with what other products. Just because YOU know a certain accessory fits all makes and models, because it's some industry-standard size, doesn't mean that the customer knows this. If there's a particular way to measure a product so you get the correct size, explain that (with photos of what you're measuring, if it seems at all complicated). I'm getting a new front door for my house. How big is the door I need? Do I measure the width of the door itself, or the width of the opening (probably 1/8\" wider)? Or if it's pre-hung, do I measure the frame too? Is it inswing or outswing? Right or left hinged...am I supposed to look at the door from inside the house or outside to figure this out? If you're a door seller, this is all obvious stuff, but it wasn't obvious to me, and NOT having the info on a website means (a) I feel stupid, and (b) I'm going to look at your competitors' sites to see if they will explain it...and maybe I'll find a door on THEIR site I like better anyway. Again, prioritize based on customer requests.5. Provide your own photos and measurements If examples of the physical products are available to you, take your own photos, and take your own measurements. In fact, take your OWN photo of YOURSELF taking the measurement—so the user can see exactly what part of the product you're measuring. In the photo below, you can see that I'm measuring the diameter of the stopper, NOT the hole in the sink, NOT the stopper plus the rubber gasket. And no, Kohler, it's NOT 2\" in diameter...by a long shot. Keep in mind, you shouldn't have to tear apart your CMS to do any of this. You can put your additions in a new database table, just tied to the core product content by SKU. In the page template code for the product page, you can check your database to see if you have any of your \"extra bits\" to display alongside the feed content, and this way keep it separate from the core product catalog code. This will make updates to the CMS/product catalog less painful as well.Fixing your content doesn't have to be all that difficult, nor expensive At this point, you're probably thinking \"hey, but I've got 1.2 million SKUs, and if I were to do this, it'd take me 20 years to update all of them.\" FINE. Don't update all of them. Prioritize, based on factors like what you sell the most of, what you make the best margin on, what customers ask questions about the most, etc. Maybe concentrate on your top 5% in terms of sales, and do those first. Take all that money you used to spend buying spammy links every month, and spend it instead on junior employees or interns doing the product measurements, extra photos, etc. And don't be afraid to spend a little effort on a low value product, if it's one that frequently gets questions from customers. Simple things can make a life-long fan of the customer. I once needed to replace a dishwasher door seal, and didn't know if I needed special glue, special tools, how to cut it to fit with or without overlap, etc. I found a video on how to do the replacement on RepairClinic.com. So easy! They got my business for the $10 seal, of course...but now I order my $50 fridge water filter from them every six months as well.Benefits to your conversion rate Certainly the tactics we've talked about will improve your conversion rate from visitors to purchasers. If JUST ONE of those sites I looked at for that damn sink stopper had the right measurement (and maybe some statement about how the manufacturer's specs above are actually incorrect, we measured, etc.), I'd have stopped right there and bought from that site.What does this have to do with Panda? But, there's a Panda benefit here too. You've just added a bunch of additional, unique text to your site...and maybe a few new unique photos as well. Not only are you going to convert better, but you'll probably rank better too. If you're NOT Amazon, or eBay, or Home Depot, etc., then Panda is your secret weapon to help you rank against those other sites whose backlink profiles are stronger than carbon fibre (that's a really cool video, by the way). If you saw my Whiteboard Friday on Panda optimization, you'll know that Panda tuning can overcome incredible backlink profile deficits.It's go time We're talking about tactics that are time-consuming, yes—but relatively easy to implement, using relatively inexpensive staff (and in some cases, your customers are doing some of the work for you). And it's something you can roll out a product at a time. You'll be doing things that really DO make your site a better experience for the user...we're not just trying to trick Panda's measurements. Your pages will rank better, and bring more traffic. Your pages will convert better, because users won't leave your site, looking elsewhere for answers to their questions. Your customers will be more loyal, because you were able to help them when nobody else bothered. Don't be held hostage by other peoples' crappy product feeds. Enhance your product information with your own info and imagery. Like good link-building and outreach, it takes time and effort, but both Panda and your site visitors will reward you for it. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Leveraging Panda to Get Out of Product Feed Jail"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Leveraging Panda to Get Out of Product Feed Jail"
    },
    {
      "level": "H2",
      "text": "What content actually teaches the customer"
    },
    {
      "level": "H2",
      "text": "Where else customers look for answers"
    },
    {
      "level": "H2",
      "text": "What sucks for the customer is an opportunity for you"
    },
    {
      "level": "H3",
      "text": "1. Offer your own additional description and comments"
    },
    {
      "level": "H3",
      "text": "2. Solicit questions"
    },
    {
      "level": "H3",
      "text": "3. But I don't get enough traffic to get the questions"
    },
    {
      "level": "H3",
      "text": "4. What fits with what?"
    },
    {
      "level": "H3",
      "text": "5. Provide your own photos and measurements"
    },
    {
      "level": "H2",
      "text": "Fixing your content doesn't have to be all that difficult, nor expensive"
    },
    {
      "level": "H2",
      "text": "Benefits to your conversion rate"
    },
    {
      "level": "H2",
      "text": "What does this have to do with Panda?"
    },
    {
      "level": "H2",
      "text": "It's go time"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Michael Cottam\n          \n            Michael Cottam"
}