{
  "url": "https://moz.com/blog/lexxe-natural-language-search",
  "slug": "lexxe-natural-language-search",
  "title": "Lexxe - Natural Language Search - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "At SEOChat, organicseo has posted a thread on Lexxe.com. I didn't have high hopes, but I performed several searches with very satisfactory results. The clustering technology is a good feature, and the s...",
  "content": "Lexxe - Natural Language Search Mobile SEO By: Rand Fishkin November 14, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 14, 2005 Lexxe - Natural Language Search Mobile SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. At SEOChat, organicseo has posted a thread on Lexxe.com. I didn't have high hopes, but I performed several searches with very satisfactory results. The clustering technology is a good feature, and the solid \"answer\" at the top of the page has been accurate for all of my queries so far. How many liters in a gallon? - 3.785 Where is the UN headquartered? - New York City How old is the Earth? - 4.56 billion years Not bad for a search engine from down under. Give Lexxe a try if you're stumped for a quick answer. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Lexxe - Natural Language Search"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Lexxe - Natural Language Search"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too"
    },
    {
      "level": "H3",
      "text": "Internal Linking for Mobile-First & Mobile-Only Indexing"
    },
    {
      "level": "H3",
      "text": "All About Fraggles (Fragment + Handle)"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}