{
  "url": "https://moz.com/blog/life-after-supplemental",
  "slug": "life-after-supplemental",
  "title": "Life After Supplemental - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A few months back, I posted the saga of how I helped a client finally escape from Google Supplemental. Given the positive response to that article and some great follow-up questions, I closely tracked some relevant Google data over the four months since and thought I'd share some of what I learned.…",
  "content": "Life After Supplemental Search Engines By: Dr. Peter J. Meyers August 29, 2007 Table of Contents Copied! By: Dr. Peter J. Meyers August 29, 2007 Life After Supplemental Search Engines A few months back, I posted the saga of how I helped a client finally escape from Google Supplemental. Given the positive response to that article and some great follow-up questions, I closely tracked some relevant Google data over the four months since and thought I'd share some of what I learned. April 22nd was \"E-Day\" (Escape Day). Weekly Google searches grew from a low point of 1,866 the week before E-Day to a high of 6,732 last week (a 361% increase). Before the complaints start coming, I'm not suggesting that this growth was entirely due to getting out of supplemental. Many of the SEO improvements that resulted in our escape were also generally positive, and we've been rewarded for them. The main point is that relatively rapid gains are possible (I'm sure many of you can demonstrate similar or even more impressive numbers). One of the problems with my client's site, SEO-wise, came down to massive content duplication (mostly due to being a large, database-driven site). Prior to E-Day, we had as many as 30,000 pages listed across the Google indexes; today, that number is closer to 5,000. While most people obsess about getting more pages into the Google indexes, there's a compelling case that much of our success came from helping Google to clean out and focus its index of our site. Of course, many people suffer from problems with Google successfully spidering their site, in which case it's natural to want to increase your overall number of indexed pages. Past a point, though, when duplication starts to occur, you not only face potentially diminishing returns but the very real possibility of indirect penalties. As always, quality trumps quantity. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Life After Supplemental"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Life After Supplemental"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}