{
  "url": "https://moz.com/blog/lifting-a-manual-penalty-given-by-google-personal-experience",
  "slug": "lifting-a-manual-penalty-given-by-google-personal-experience",
  "title": "Lifting A Manual Penalty Given By Google (Personal Experience) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "On August 15, 2012, our agency's website (which was in the middle of a complete redesign) was hit with a manual penalty by our friends over at Google. This came completely out of the blue as we're a fairly small agency that has never taken part in any unorthodox link building techniques. Here's the…",
  "content": "Lifting A Manual Penalty Given By Google (Personal Experience) Advanced SEO By: Lewis Sellers April 2, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Lewis Sellers April 2, 2013 Lifting A Manual Penalty Given By Google (Personal Experience) Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. On the 15th of August 2012, our agency's website (which was in the middle of a complete redesign) was hit with a manual penalty by our friends over at Google. This came completely out of the blue to us, as we're a fairly small agency that has never taken part in any unorthodox link building techniques. We offer link building services to our clients and pride ourselves on carrying out only high quality and white hat work. I should point out at this point that our clients have never received any unnatural links warnings. Since we lifted our penalty, we've also helped many new clients get manual actions revoked and back into Google. We straight away knew that we had been hit by Google's Panda 3.9.1 update (see comments for updated algorithm information) After looking at a lot of experts discussing this issue on the Internet, I could see a mixed bag of suggestions on what people would recommend we do. I first of all started by sending in a reconsideration request explaining that I believed there was a mistake. As the majority of our work comes from word of mouth, we've never taken part in any SEO, but this was something we were planning on starting very shortly. I later received a reconsideration request response that said the following: \"Dear site owner or webmaster of http://www.pinpointdesigns.co.uk/, We received a request from a site owner to reconsider http://www.pinpointdesigns.co.uk/ for compliance with Google's Webmaster Guidelines. We've reviewed your site and we still see links to your site that violate our quality guidelines. Specifically, look for possibly artificial or unnatural links pointing to your site that could be intended to manipulate PageRank. Examples of unnatural linking could include buying links to pass PageRank or participating in link schemes. We encourage you to make changes to comply with our quality guidelines. Once you've made these changes, please submit your site for reconsideration in Google's search results. If you find unnatural links to your site that you are unable to control or remove, please provide the details in your reconsideration request. If you have additional questions about how to resolve this issue, please see our Webmaster Help Forum for support. Sincerely, Google Search Quality Team.' In hindsight, I should have realised that this was never going to work. I read many articles on the Internet from top SEO experts and looked through the SEOMoz guides on how to clear up link penalties, but the general opinion was that if you had been hit by a manual penalty, that there was a very slim chance of having this reversed. I then decided to look at our backlinks using OSE (Open Site Explorer). By doing this, we were able to see a list of all of the anchor text variants and types of links coming back to our website. It became clear fairly quickly why we had been hit. Silly mistakes When developing websites for clients, we always include links in the bottom right footer of the client's website. Usually, this is something along the lines of \"Web Design Yorkshire | Pinpoint Designs\". These two blocks of text include links to the homepage of our agency's website. When looking at the webmaster guidelines, it's pretty obvious that we should never have been doing this, and most likely the cause of our penalty. At this time, we had around 65 domains pointing at our site, with over 1500 links showing anchor text that was similar to \"Web Design Yorkshire\", \"Website Design In Yorkshire\" and so on. Luckily, we manage the majority of our clients' websites, so it has been very easy for us to remove these. We updated the footer of each website to remove the anchor text \"Web Design Yorkshire\" and saved the changes. We also created a Google Docs file that included the URL of each website along with the changes we had made so that we could include this in our next reconsideration request. The second reconsideration request we sent had a lot more time spent on it. Instead of telling Google what they had done wrong, we wrote a long request that had the following structure: Who we were and what we do Why we believed we had been hit What we had done to rectify the issue (a link to the Google Docs file was attached) How we knew it wouldn't happen again An apology My name / contact details Note: If you are sending in a request because an SEO company has managed to get you banned, it's wise to let Google know the company's name and the work they've carried out. Any information you want to provide them should be added in a Google Docs document and a link attached. At this point, we had just launched our brand new website, so I explained to Google that we had just relaunched and that we were pushing quality content out to all of our users. The second reconsideration request came back unsuccessful, and my hopes started to fade as to how we were going to get back into the search engines. I then decided that I would contact SEOMoz via a private question to ask for further clarification and any more tips they could provide. I received a response from Carson Ward, an SEO Consultant from Distilled, who helped by providing a little more information. Carson said that footer links were indeed the problem. There were a ton of links that said \"web design yorkshire\" and similar, and this triggered the Penguin penalty. He recommended using more branded and varied anchor text, avoiding site-wide links, and, as a last resort, either removing or nofollowing footer links on sites we had designed. To minimize your risk, you can do a few things: Use branded anchor text the majority of the time. It looks a lot more natural to link back using your brand name. The safest example would be \"Web design by Pinpoint Designs\". The slightly riskier \"Web design by Pinpoint Designs\" can be a bit more beneficial. Mix up the anchor text - use different variations so that no single anchor is overwhelmingly common. Avoid site-wide links, especially with exact-match non-branded anchor text. Now that you've already been flagged, you could try doing the above and seeing if that's good enough for Google. You could also just nofollow or remove the links. These footer links are already devalued, but you'll lose a little bit of ranking power by nofollowing/removing them. He also indicated in a second email that Google has sometimes been stubborn on reinclusion requests, and that it might be necessary to jump through some hoops to get back in their good graces. It became clear that I would have to up my game If I wanted to ease Google's fears of us spamming them, so I got to work in trying to clear everything up properly. I decided to spend a month getting my head down and working on removing everything. Before setting all the links to no follow, I wanted to give it once more chance. We wanted to avoid the Disavow tool at all costs, as the links pointing to our website were not bad quality. What worked We logged into Google Webmaster Tools and looked at the links pointing to our site, we then went through each of these sites to make sure that any anchor text pointing to us was only brand based keywords. It occurred to me that during this point, the only links we really had were from clients websites, so Google wouldn't really see us as a website worth promoting. I then started writing articles for our website's blog - these revolved around social media, SEO and website launches for our clients. I wanted to build quality content on our website and had a positive attitude of trying to write engaging articles. We decided not to write articles every day, but longer length articles that were posted out once per week or so. Once this has been sorted, we started pushing our Twitter page. We followed local design agencies and people that we personally found interesting. We always try to engage with people and tweet about articles that we believe are interesting. We even wrote an article on our blog about social engagement and tried to provide useful information to people where possible. It was obvious this was working, as our Twitter account started growing very quickly and we were getting favourites, retweets and replies to our posts! Finally, we decided that we should start doing some actual SEO work on our website in the same way we do for our clients. We're a big fan of guest blogging on sites that are related to your industry, so we started out by writing articles about subjects we are interested in. This includes email marketing, social media, SEO, user interface design and so on. We then used some great web tools to find guest post opportunities and got in touch with the blog owners. An important point here is that we only linked back to our website using variations of our brand name. This was either 'Pinpoint Designs', 'Pin point designs' or our domain name. We wrote around 15-20 very high quality blog posts and submitted them to different guest blogs varying from PR2 - PR6 domains. We only posted to higher quality blogs, and made sure that they were reputable (as some blog owners only want your articles to boost their ranks for affiliate purposes). All sites were checked out by domain authority, PageRank and a visual check to make sure they didn't look 'spammy'. We also made sure that the niche fitted our website as best as possible. Useful websites Citation Labs - Garrett's tools are fantastic. I really cannot express how easy It is to find quality blogs. We used the Link Prospector tool in order to find high quality blogs that were related to our industry. Blogger LinkUp - Again, this website is amazing for a site that is free of charge. Enter in your email address and once a day (or once every couple of days) you will receive an email with guest post opportunities. You can then email the authors of the sites to write guest posts for them. We then went for reconsideration request number three. I put together a fairly short reconsideration request that was based around our previous request. I explained that we had worked on building quality content up across the Internet and that we were interacting with people on social media. I explained that we realised that we'd made silly mistakes and also included a link to our previous work. By this point, a lot of our links had updated in Webmaster Tools and the percentage of non-branded anchor text to branded anchor text had decreased which was positive. Only three days later, we received the following email: Summary Starting out as a fairly small company, our website wasn't the site we wanted it to be. In 2012, we decided that we would revamp our website and start promoting ourselves across the UK. We've been growing quickly year on year, but we very rarely acquire work via our website. Just as this had happened, we received a penalty from Google. After working with some companies who have received penalties from doing blackhat work, I would recommend the following tactics: Start by building up a list of all the links pointing to your website - This is extremely easy. Login to Open Site Explorer, Google Webmaster Tools and use other websites such as Ahrefs or Majestic SEO. Pull together a list of URLs and Anchor text pointing to your website and try to make sure that you always have more branded anchor text than non-branded. In the Google Panda updates, it should become apparent fairly quickly why you've been struck with a penalty. Work to remove those links hard! - Removing links isn't easy, there are numerous sites out there that will help remove links from you, but it's a fairly slow process. One of our clients had been using SENuke to build links to forums. We wrote a small script that logged into all of these forums using the username and passwords which luckily they had, and updated the info box to remove the links to their site. Unfortunately, if you don't have the luxury of having the passwords to hand, you'll have to contact the owners one by one. If you can't remove links - If you can't remove links, use the Google Disavow tool. That being said, don't use it unless absolutely necessary. If you're having to use the disavow tool on thousands of links, then you're in trouble! Write good quality content - Show Google that you can write good content! Make sure that all the content on your website is unique, up to date and interesting. Spend some time working out anything you are not happy with and show them that you are an authority site that they should promote. Get involved with the community, grow your social media accounts organically and tidy up your image. Spend time on your reconsideration request - Google must receive hundreds, if not thousands, of reconsideration requests each and every week. Rather than sending in a paragraph, spend some time telling them what you've done wrong and most importantly, be honest. Tell them why you think you've been targeted, what you've done to rectify it and how it won't happen again. Apologise for the mistake(s) and hold your hands up if you're in the wrong. Add in information from Google Docs to show what links you've cleared off and let them know why you're worth it! Don't get involved in the first place! - This is always easy to say in hindsight, but don't get yourself into the position where you need to clean up your websites rankings in the first place. We were initially targeted because of a bad choice of anchor text. Once we were targeted, we had to make sure we were squeaky clean before having the penalty revoked. Only stick to ethical link building practices and stay on Google's good side! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Lifting A Manual Penalty Given By Google (Personal Experience)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Lifting A Manual Penalty Given By Google (Personal Experience)"
    },
    {
      "level": "H3",
      "text": "We straight away knew that we had been hit by Google's Panda 3.9.1 update (see comments for updated algorithm information)"
    },
    {
      "level": "H2",
      "text": "Silly mistakes"
    },
    {
      "level": "H2",
      "text": "What worked"
    },
    {
      "level": "H2",
      "text": "Useful websites"
    },
    {
      "level": "H2",
      "text": "Summary"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Lewis Sellers\n          \n            Lewis Sellers\n          \n            Lewis Sellers"
}