{
  "url": "https://moz.com/blog/linguistics-and-seo",
  "slug": "linguistics-and-seo",
  "title": "Linguistics and SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There’s been talk here and there about the right kind of preparation for SEO professionals. My degrees are in linguistics, and I want to be the first to suggest that this is good preparation for SEO. For one thing, hardly anyone knows what it is. I spent all those years having conversations like…",
  "content": "Linguistics and SEO Content Marketing R By: Rebecca Haden July 11, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! R By: Rebecca Haden July 11, 2008 Linguistics and SEO Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. There’s been talk here and there about the right kind of preparation for SEO professionals. My degrees are in linguistics, and I want to be the first to suggest that this is good preparation for SEO. For one thing, hardly anyone knows what it is. I spent all those years having conversations like this: “What’s your major?” “Linguistics.” Pause. “Oh.” Further pause. “What’s that?” I am therefore completely prepared for conversations beginning with “What do you do?” “SEO.” Beyond that, though, I’d say that being able to analyze language is an enormous help in SEO. That’s what linguistics is, by the way: the scientific study of language. Linguists study language just as botanists study plants. You might find that it is useful to learn to be a little bit of linguist yourself, and I’m prepared to help you do that. When do you need to be able to analyze language? When you’re blogging for hire, for one thing. I blog for several clients. Last week, they gave me the following topics: “This thing can HotPort a MAC address across the network.” “We want them to sail into the sale and have fun.” “Persons will be mentally out of balance when the reality they experience is different from the way they perceive their world to be.” Obviously, we need different tones for each of these posts. Unless that comes naturally, though, recognizing that fact may not be enough to cause you to end up with different and appropriate tones for each. It’s not just blogging. The content of entire web sites has to fit the intended message and recipient, too. One web site I worked with had graphics with a very clear message: the scuffed rowboat on the sand, a worn leather bound book splayed open on the seat, a pair of old but expensive loafers lying nearby. These images say old money, relaxed, and self-confident. The words said, “We’re great! We’re great!” This is not an old money confident message. They seriously needed a rewrite. But your clients don’t want it to be obvious where their content ended and the pro’s began. You have to analyze what they already have, as well as what they want to accomplish, and provide a smooth transition. Even link requests should involve linguistic analysis. Is the web master you’re writing to a breezy, perky writer? Then your request should be breezy and perky, too. Writing to someone serious and academic? Back off on the slang and match the tone of the web site. There’s that phrase again. We talk about matching tone as though it were as easy as matching a pitch or a color – and let’s face it, those aren’t easy tasks for everyone either. What does it mean to talk about tone in language? Find a paragraph to practice on, and take some time to study it. Here are some things to look at: Syntax I could have said “grammar” here – both terms refer to the way you string words together to make sentences. But I know that for many people, the word “grammar” brings up memories of nerve-wracking tests or worries about “lie” and “lay,” so I’m going to talk about syntax instead. Read the paragraph you’re going to analyze. Does the writer use sentence fragments? Do the sentences usually have just one verb, or do they froth with complex clauses, embedding multiple verbs and subjects in their convoluted depths? Readers won’t think about this as they read, but it has an effect on their reaction to the text. This carries on beyond single sentences, too. One of the sites I blog for had an unintentional pattern in all the previous blog posts: a brief story followed by a rhetorical question. The rest of the post answered the question and carried the main message of the post. I follow the same pattern, and the transition has been seamless. Vocabulary Advice on requesting links often says to point out how similar you are to your target. Well, you know, anyone can say, “I’m an educator myself…” while courting those .edu sites, but the ability to throw around terms like “differentiated instruction” and “activating schemas” is far more convincing. And yes, “schemas” is what they say; “schemata” brands you as an outsider. Equally, using jargon from a group your target doesn’t belong to says, “You aren’t welcome here.” I have several therapist clients. I’m still trying to persuade them that saying “persons” is only appropriate when they’re talking to fellow therapists. It’s the same with marine biologists: they, and only they, say “fishes.” For search engines, the general populace, and people who might actually want to hire a therapist – none of them will be looking for “persons.” I don’t know whether anyone but marine biologists ever searches for a marine biologist. If you ever want one, though, type in “fishes.” Punctuation I once knew a man who seemed like quite an ordinary guy. He had graduated from seminary at Princeton, and he was, in person, just what you might expect such a graduate to be like. In emails, though, he used triple punctuation marks. Like “!!!” and “???” and even “??!” If you just knew him from his emails, you would assume he was a twelve year old girl, albeit a very well-read one. We tend to underestimate how much punctuation affects the impression our writing gives. If part of the content you’re working on is filled with dashes, question marks, and exclamation points, you can’t add sections without those embellishments without making them seem less exciting. If your client writes like Hemingway, you can’t jump in with semicolons without causing cognitive dissonance in the reader. If you have a client whose writing bristles with needless hyphens or decorative quotation marks, just take them all out. You have to draw the line somewhere. Some people are uncomfortable with this idea of matching someone else’s language. They worry that it seems manipulative or deceptive, or untrue to their own voice. To this I say, “Get over it.” If you write to someone whose site is in Italian, do you insist on writing in English for the sake of being true to yourself? Not if you know Italian. There’s no difference. You’re being courteous enough to follow the other person’s discourse rules, that’s all. In all this, we can’t forget the search spiders. I have a client who sells handmade aprons. She had, when I started working with her, been selling about two a month for years. (Now she sells fourteen a week, and can’t make more than that. She can call me back if she decides to hire more seamstresses.) One of the many problems with her site was that it rarely used the word “apron.” She likes descriptions more along the lines of, “Here’s a saucy little number reminiscent of the Bell Epoque!” I’m fairly sure that people who want to buy aprons online don’t begin by typing in “reminiscent of the Belle Epoque.” And I haven’t checked what Google serves up to those who confide a desire for a saucy little number, but I bet it’s not aprons. So write for the people who are actually going to read it, and simultaneously for search engines. Not easy? Maybe not. But it is certainly easier if you spend a little time analyzing the language first. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Linguistics and SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Linguistics and SEO"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Haden\n          \n            Rebecca Haden"
}