{
  "url": "https://moz.com/blog/link-reclamation",
  "slug": "link-reclamation",
  "title": "Reclaim Backlinks + Free Google Apps Script - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Learn how Hunter recovered 66 lost backlinks in just 30 days. Find effective tactics for backlink reclamation and protect your SERP positions.",
  "content": "How Hunter Reclaimed $10K Worth of Backlinks in 30 Days [Free Google Apps Script] Link Building | Advanced SEO By: Antonio Gabrić Edited By: Chima Mmeje January 31, 2024 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Antonio Gabrić Edited By: Chima Mmeje January 31, 2024 How Hunter Reclaimed $10K Worth of Backlinks in 30 Days [Free Google Apps Script] Link Building | Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. After analyzing our backlink profile, we discovered we lost nine percent (74 backlinks) of the backlinks we acquired in the last three years. With an average backlink acquisition cost of $320, we effectively lost over $24,000. The most common reasons we lost backlinks included website owners removing the links or technical issues. We didn’t want to leave that on the table and decided to run a backlink reclamation campaign. Within 30 days, we reclaimed 31 backlinks worth $10,000. In this article, I’ll show you how to create an automated backlink reclamation process that protects your investment and rankings in search engines. The two reasons we were losing backlinks After analyzing over 3,000 backlinks we acquired since 2020, we discovered the two most common reasons backlinks got lost: Website owners simply removed our links.404s or other technical issues. While some links are lost for good, we knew we could re-acquire many with a simple email asking the editor for a favor. The email approach also seemed best because that’s how we built most of these links in the first place. Our approach to reclaiming lost backlinks These were the steps we decided to take next: Build a script that can accurately identify lost backlinks.Diagnose why the links are missing (removed link, removed page, or other technical issues.)Find the contact information of the website owners or editors to reclaim lost links.Segment the recipients based on why the links are missing.Schedule an email outreach campaign, including follow-up emails, asking the recipients to re-add the links to our website. Build a script We tried a few tools for identifying lost backlinks but found them too complex or expensive for our use case, so we decided to build our own. The idea was simple. Add all referring and target page URLs in a Google Sheet and build a custom Google Apps Script that checks whether our target page URL is live on the referring page URL. Since I have zero coding experience, ChatGPT was the logical choice. One hour and two lattes later, I had a working script that automatically checks whether our backlinks are still live on the websites where we previously acquired links The screenshot below shows how a prompt might look: Here are the steps for making the script analyze your backlink profile and identify lost backlinks: Create a new spreadsheet.Add a referring page URL in column A (the page that should contain a backlink).Add a target page URL in column B (the page on your website).Go to Extensions -> Apps Script.Paste this script and click Run. The runtime depends on the number of rows. Once the script analyzes all pages, a new column with the status of the links (in our case, a column named \"Lost?\") will appear. Analyze the missing backlinks Remove all rows with the status \"Exists.\" This will leave only lost backlinks. Then, remove duplicates and irrelevant results before analyzing each page in detail. Although analyzing Domain Authority (DA) with Moz Link Explorer gives you a good idea about a website’s authority, it’s often not enough to decide whether it’s worth having a backlink from that domain. Try Moz Pro for free to speed up the backlink evaluation process. Here are a few additional metrics you should take into account to have a clearer picture of domain quality: Relevance: How relevant is the target website to your website?Ranking keywords: How many keywords do they rank for?Outgoing/incoming links ratio: Do they have more incoming than outgoing links?Content quality: Is their content helpful, and does it satisfy the user’s intent?Content calendar: How often do they publish new content? This is a manual process, but it is worth the time investment as it maximizes the impact of your campaign by focusing on reclaiming high-quality and relevant backlinks only. Next, create a new tab in your spreadsheet and build a matrix with all the metrics shared below. Target domains that satisfy four or more of these metrics. You can ignore the rest, as those websites aren’t the most relevant fit or highest quality. Find the right people to contact Identifying the right decision-makers and finding their email addresses is crucial to every cold email campaign. While we usually put much effort into this part of the process, with backlink reclamation, it’s a bit different. We were already in touch with decision-makers since we collaborated on link building in the past. The first step was to validate the decision-makers' email addresses and ensure they still worked at the same company. Next, we added all the contact information to the spreadsheet and ran the Hunter for Sheets add-on to verify all the email addresses. Most email addresses were still valid, so reaching out to these people was safe. To add an extra layer of security, we double-checked if these people still work at the company. The fastest way is by finding people on LinkedIn and checking their Experience tab. If your contact no longer works in the company, find an alternative contact with editorial power. Start by searching the company's LinkedIn page. Click on the People filter and search through the job titles. In my experience, titles containing the words content, marketing, editor, or SEO are the best bets. Once you identify the right person with the right seniority level in the company, use a tool like Hunter Email Finder to find a valid email address. Sending emails to valid addresses is crucial to keep the bounce rates low. Bounce rates higher than two percent negatively affect email deliverability, meaning not all emails you send will reach the primary inbox. Segment the recipients Segmentation is vital in cold emails because it helps target and personalize them. After sending over 10,000 emails in the last three years, I have learned that the more you segment your lists, the higher your chances of success. Sure enough, this was the case in our link reclamation campaign. Next, we segmented our list based on the reason our backlinks got lost, and it resulted in three main segments: Reclamation: pages that exist but simply deleted our backlinks404s: pages that no longer existPartners: domains that our link-building partners manage The final spreadsheet looked like this: We’d later tailor the email sequence based on the segment to keep it more personalized and relevant to the recipient. Creating and sending email outreach campaigns When crafting the perfect cold email, the usual advice is to hyper-personalize email sequences. In this campaign, we decided to use a generic approach with minimal personalization apart from a few custom attributes. The reason was that most people we contacted knew the context of our previous partnership, so spending time on personalization wasn’t necessary. For people we contacted for the first time, we shared a bit of context by explaining that we had a partnership with their colleagues and would love to continue working with them. The email copy differed slightly depending on the segment, but the amount of effort we put into personalization was the same. Here is the email copy we sent to prospects who removed our links: And a slightly different email copy for the 404 segment: Most of our sequences have three emails: Initial emailFirst follow-up: three days after the initial emailSecond follow-up: three days after the first follow-up If we don’t hear from recipients after the entire sequence, we mark it in our database and find alternative people in the company to contact in 3 — 6 months. Before giving up on the email, try reaching out on LinkedIn or X (formerly Twitter). This works exceptionally well for active prospects on these networks. If you don’t have a premium account, follow their profiles and engage with their content by adding genuine comments to their posts. After a few days, you can send a personalized connection request and continue discussing lost backlinks. Sending follow-ups Follow-ups are essential in every cold email campaign. People receive dozens of similar emails daily, so there’s a huge chance your email will get lost in their inbox. That’s why you should always follow up after your first cold email. Here are stats from our campaigns to prove the importance of follow-ups: Our follow-up sequences account for over 50% of the responses. We decided on a simplistic follow-up approach. Here's what it looked like: We included a few custom attributes to add a personalized flair to our emails, but you can automate this with any cold email tool. Results We sent 166 emails in total. Some recipients responded by building two or more backlinks to our target pages. With only a 30-day campaign, we reclaimed 31 backlinks. The average open rate was 47.6%, while the average reply rate was 15%. Interestingly, our click rate was relatively high at 22%, meaning prospects were clicking on the links in our emails and checking why backlinks got lost in the first place. Our conversion rate was 18.67% (31/166), which makes this campaign one of the most successful link building campaigns we’ve done in the last three years. Here are the SEO metrics of reclaimed backlinks: Average Domain Authority: 53 Average traffic: 65,780 Most of the responses looked like this: Response sample #1 Because backlinks tend to get lost over time, these results motivated us to set up a recurring campaign for backlink reclamation. The entire process only took a few hours and helped us identify lost backlinks, analyze domains, and find the right people to contact. The time commitment is one hour every quarter. Conclusion: Constantly monitor the status of your backlinks Losing backlinks over time is inevitable, and you can’t do anything to prevent it. The best way to reduce losses is to monitor the status of your backlinks and reach out to decision-makers to reclaim them. We had tremendous success and reclaimed 31 backlinks, translating to $9,920 in less than 30 days. With the custom Google Apps Script, imagine how easy it will be to rerun this campaign once or twice a year to repeat these results. Better yet, imagine how you can create your own campaign and enjoy similar results for your business! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Hunter Reclaimed $10K Worth of Backlinks in 30 Days [Free Google Apps Script]"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Hunter Reclaimed $10K Worth of Backlinks in 30 Days [Free Google Apps Script]"
    },
    {
      "level": "H2",
      "text": "The two reasons we were losing backlinks"
    },
    {
      "level": "H2",
      "text": "Our approach to reclaiming lost backlinks"
    },
    {
      "level": "H3",
      "text": "Build a script"
    },
    {
      "level": "H3",
      "text": "Analyze the missing backlinks"
    },
    {
      "level": "H3",
      "text": "Find the right people to contact"
    },
    {
      "level": "H3",
      "text": "Segment the recipients"
    },
    {
      "level": "H3",
      "text": "Creating and sending email outreach campaigns"
    },
    {
      "level": "H3",
      "text": "Sending follow-ups"
    },
    {
      "level": "H2",
      "text": "Results"
    },
    {
      "level": "H2",
      "text": "Response sample #1"
    },
    {
      "level": "H2",
      "text": "Conclusion: Constantly monitor the status of your backlinks"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    }
  ],
  "author": "Antonio Gabrić\n          \n            Antonio Gabrić\n          \n            Antonio Gabrić"
}