{
  "url": "https://moz.com/blog/link-building-expert-round-up",
  "slug": "link-building-expert-round-up",
  "title": "8 Experts Weigh in on the Past, Present, and Future Evolution of Link Building - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "How far have we come since the days of black hat link building schemes, and are there any lessons we can take from the past to inform where we go from here? We asked eight link building experts their thoughts on this very question, as well as what our readers can do to stay ahead of the link…",
  "content": "8 Experts Weigh in on the Past, Present, and Future Evolution of Link Building Link Building By: Hayley Bowyer June 16, 2021 Table of Contents Copied! By: Hayley Bowyer June 16, 2021 8 Experts Weigh in on the Past, Present, and Future Evolution of Link Building Link Building For over 20 years, SEOs and content marketers have built links across the web to get their content in front of their target audience. As Google grows smarter, so do these link-building SEOs – gone are the days of spammy link schemes and black hat SEO. Enter modern link builders who are focused on placing high quality, relevant links on sites guaranteed to drive the most important metrics: conversions and revenue. But how far have we really come, and are there any lessons we can take from the past to inform where we go from here? We asked eight link building experts their thoughts on this very question, as well as what our readers can do to stay ahead of the link building curve! For more link building tips, be sure to check out our recent update to The Beginner’s Guide to Link Building: Read the Guide! How important are links, really? Historically, links have been a sure-fire way to build authority and visibility for your business. However, as Google begins to focus on other tactics such as user experience, will that change how links factor into search visibility? Russ Jones, Search Consultant at Moz, says that the value of a well-placed link isn’t going anywhere: “Google will find more and more ways to extract value from the link graph and click stream data. The link remains king.” Britney Muller adds that “If Google disappeared tomorrow, would you still get qualified traffic to your website (via your link profile)? That’s exactly how I believe we should be thinking about link building today.” Backlinko founder, Brian Dean, has a different perspective: “I think links will be less important as time goes on,” he says, but agrees that they'll always be a major part of the algorithm. “Links are actually a really good signal! Especially today with Google more focused on E-A-T, links are a great way to size up whether a site is credible or not. Without links, they'd have no real way of knowing if the content on a page is legit.” Has the definition of a “high quality link” changed? The short answer is yes, and (surprise!) it depends on your goals. In the early days, SEOs tested Google with sketchy link schemes. These low quality links offered a quick fix of link juice, and a boost in rankings. Today, link builders have ditched the black hat tactics in favor of a more relevant and consumer-focused approach, and quality over quantity. Carrie Rose, CEO at Rise at Seven, has this to say: “The definition of a high-quality link has massively changed over the years. Relevancy is a huge topic online right now — but what does a relevant link actually mean? Ultimately, we track that based on is it a link that is driving traffic to your website, of whom are your audience? Too many link building strategies focus too much on ‘link juice’ and SEO metrics such as DA — but care less about link engagement metrics. SEOs, link builders, and digital PRs should care more about understanding where their audience is, high traffic websites, and gaining links from there instead.” Russ Jones agrees: “I believe that Google has dramatically increased the degree to which the relevancy of a link matters,” he says, adding, “Google has placed greater influence on links that come from topical authorities as they combat issues like fake news and link spam. If this is the case, it means that link builders need to narrow their focus and fight for links from industry peers.” As relevancy becomes more important, our experts encourage other link builders to focus on the audience rather than the outlet. Tamara Sykes, Public Relations Specialist at Postali, believes that “It’s obviously great to get a backlink in a recognizable outlet like the Wall Street Journal. However, if your audience isn’t there, it only serves half of its purpose. You’ll get a ‘vote’ from a high DA site to prove that yours is more trustworthy, but it may generate little to no traffic because the audience isn’t as invested in what content you have to offer.” Domenica D'Ottavio, Marketing Manager at Fractl, prefers to diversify her link portfolios, noting that high quality links can mean different things in different campaigns. “The definition of a high-quality link can change depending on your goals,” she says. “Not all links are created equally for every business. In my opinion, the ideal portfolio has a 1) high volume of 2) relevant and 3) high-quality backlinks. If you're a business in the personal finance space, for example, you might want a mix of links from sites like The Motley Fool, CNN Money, and smaller finance blogs like The Penny Hoarder, Budgets are Sexy, or I Will Teach You To Be Rich.” Lastly, as with most things in marketing and SEO, Andy Crestodina of OrbitMedia reminds us that there are also a half dozen other factors to consider including DA, follow vs. nofollow, outgoing links and much more! So be sure to take these factors into consideration as you develop your link building strategy. Image Source The role of link building in SEO is stronger than ever Developing high quality content and distributing that content to respected sites in your target market can be an extremely scalable and cost-effective way to build and maintain authority in your niche. So, it’s not surprising that link building and digital PR is rapidly becoming a core strategy for many brands. Carrie Rose highlights the fact that link building and digital PR industries have grown rapidly: “The responsibility to create good quality content and improve trust to a site no longer purely sits within SEO. Having a good link building strategy which is performing well can improve trust, authority, and therefore rankings for a site. High quality links and high traffic can also increase traffic in the masses… It also has a huge impact on branded search (the holy grail).” Brian Dean agrees, saying “Content and links have always had significant overlap (after all, people generally link to a page based on the content on that page). But the tie between the two is stronger than ever. That's because many other tried-and-true link building strategies (like large-scale guest posting) no longer work. Which means your link building efforts largely rely on the content that you're putting out.” Surena Chande believes that, overall, the quality of link building campaigns has improved since Google’s E-A-T update: “We’re producing more topic-relevant campaigns for our clients rather than thinking solely about ideas that would land coverage,” she says, adding that SEOs and link builders are now working together to “reevaluate their concepts and ensure they are true to a brand.” Getting buy-in is easier — if you focus on the metrics that matter Because of the extra visibility in recent years, our experts agree that it’s easier than ever to get the buy-in from higher-ups. “I don't need to tell an executive that a link is like a vote. They know that now,” says Russ Jones. “I don't have to say ‘80% of purchases online begin with a search’. They know that now, too.” “Link building has a way of showing direct results for executives and stakeholders and therefore becomes easier to get the buy-in,” Carrie Rose says. “Traditional PR, creative, or offline marketing strategies are receiving less and less budget and attention because of its inability to prove ROI and we see that budget reallocated to link building and digital PR efforts.” Andy Crestodina agrees: “Just show an executive the Moz Link Explorer ‘Compare Link Profiles’ report and they’ll get excited ...or upset. Once a stakeholder sees the data, they usually want to take action. The key is to guide the ideas away from the spammy actions and toward high-quality content marketing and influencer outreach.” With less internal education and campaigning at the executive level, marketers are now faced with tougher questions around how their specific strategies impact ROI. To do so, our experts recommend keeping things simple and taking it slow. “It’s important to explain that Domain Authority moves very slowly. It takes patience,” Andy says, adding, “it’s a proxy metric for PageRank. It’s not Google. Focus on the actions, not the reports.” If you need some help breaking down metrics, check out Andy’s Whiteboard Friday: Russ Jones breaks things down even further: “Report simple campaign statistics such as: ‘referring domains and referring traffic are increasing’. Coupled with a generic metric like DA or PA, this gives stakeholders the most important answers about the quality of the link building campaign. Second, we report the increased traffic and rankings relative to competitors based on the work. It is important, though, to provide context wherever possible. If a competitor has been out-spending you and acquiring more links because of it, we shouldn't let that go unreported.” Tamara Sykes finds that it’s helpful to provide some background on sites that link to her content. “I go as far as to share what that website’s purpose is, who its audience is and the website’s SEO stats,” she says. “This helps me paint a picture of why this link is relevant to a brand, rather than sharing a number that only shows ‘Hey, we got 12 backlinks’.” Where should link builders focus? Google is getting better and better at recognizing high quality, relevant links. “They're super good at identifying links that don't fit with a natural pattern. And it's not just obvious black hat spam,” Brian Dean says. “Google can also filter out many grey hat approaches (like mass guest posting), which basically only leaves a handful of link building approaches: digital PR, targeted outreach, and content designed to get links.” So when it comes to link building strategy, where should link builders and digital PRs focus their efforts? Get creative Test out new content mediums to stand out from the pack! Carrie Rose notes that, even though we’re seeing more automation in marketing, “Robots can’t manufacture creativity. That's where the best links come from — where content is more creative than their competitors and brands are getting links others can't replicate.” Andy Crestodina recommends creating new tools and original research that features bite-size, shareable nuggets such as stats, graphs, and infographics. “These are 100-times more link-worthy than anything else on your domain,” he says. Build relationships As the market becomes more saturated, it will be especially important for link builders and digital PRs to deepen relationships with respected publishers and authors in their industry. But you don’t need to overthink it. Andy believes that a little personalization goes a long way: “Link building has a bad reputation for a good reason: spam. Spammers send cold emails to website owners, clogging our inboxes with the same messages.” But how do you build those connections in the first place? Warm up the conversation by engaging with that author or editor on social media! Domenica D’Ottavia uses Twitter to connect. “Twitter is an excellent tool for building those relationships with journalists,” she says. \"Reach out to them, like their stuff, respond and retweet, show them you're a real person… When you finally outreach them with your link building project, they'll recognize your name from your interactions on Twitter and will be much more likely to respond positively to your PR pitch.” Others agree that the ROI of mass outreach continues to decline, remembering the days of in-person link building. “Believe it or not, I used to CALL people, introduce myself, explain how interesting I thought their ‘X’ business was,” says Britney Muller. “I’d ask some questions and then weave in a thoughtful proposition of us linking to each other's websites.” “People are becoming numb to any non-targeted outreach,” Brian Dean adds. “If you are good at personalization, there could still be a chance of securing links but the bar of what qualifies as ‘personalized’ is higher than ever. Now you almost need to mention their dog's name to get a response.” (Note to all the link builders out there: my dog's name is Ginger.) Learn more about great outreach from Britney's Whiteboard Friday on the subject! Tap into influencer networks Influencer marketing is a growing field and, no, it isn’t just for consumer brands and Instagram. Leveraging experts to elevate your content can capture the attention of your target publishers and audience. Surena Chande says that “utilizing expert commentary is one of the strongest and most overlooked techniques in link building. If you have clients who are experts in their field or have access to the CEO, you can utilize them to build links with minimal effort for both you and your client.” “Link building is influencer marketing,” says Andy Crestodina. “You’re pitching an influencer (usually blogger or editor) with a request, usually some kind of collaboration. When you combine influencer marketing with original research, you have the ingredients in place. Your content supports their content. Links begin to appear spontaneously. You’re attracting them. Do it right and high DA sites will link to you every few days. Magic.” Image Source Capitalize on trending topics In a news cycle that is constantly changing, hot topics can rise and fall in the blink of an eye. But if you have your timing right, you can ride the trend wave to secure extra eyeballs from editors and readers. “I believe that the pandemic, particularly the early stages in 2020, taught the industry a very harsh lesson in the form of reactive outreach and campaigns forming one of the best methods of outreach,” Surena Chande says. “I was so used to conceiving campaign ideas for large-scale interactive pieces, and the unpredictability of the situation taught us that we had to quickly change our approach to link building.” “Jumping on a trending topic and creating a project or link building campaign around something that's already earned the attention of journalists” says Domenica D’Ottavio, but notes to proceed with caution. “While newsjacking is a clever way to earn a ton of links very fast, it's also pretty risky. You have to work around the clock to get your idea created before the topic has lost relevance, and it might flop if you're too late to respond, wasting your investment.” Our experts also advise to stay on top of the news across the web, read articles from a variety of publications weekly, study what journalists are asking for when they put out #journorequests, and analyze what angles they take on topics as they go viral. This will ensure that you are well positioned when it comes time to pitch your content. Conclusion At the end of the day, link building has undergone some major changes in the last 15 years (likely for the better!), but what’s old is new, and many of the same rules continue to apply: Relevant content will always perform so long as you target the right audienceLinks remain a major part of how Google determined the expertise, authoritativeness, and trustworthiness of a site.Creativity and timeliness in link building will be rewarded Big thank you to our expert contributors: Andy CrestodinaBritney MullerBrian DeanCarrie RoseDomenica D'OttavioRuss JonesSurena ChandeTamara Sykes Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "8 Experts Weigh in on the Past, Present, and Future Evolution of Link Building"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "8 Experts Weigh in on the Past, Present, and Future Evolution of Link Building"
    },
    {
      "level": "H2",
      "text": "How important are links, really?"
    },
    {
      "level": "H2",
      "text": "Has the definition of a “high quality link” changed?"
    },
    {
      "level": "H2",
      "text": "The role of link building in SEO is stronger than ever"
    },
    {
      "level": "H2",
      "text": "Getting buy-in is easier — if you focus on the metrics that matter"
    },
    {
      "level": "H2",
      "text": "Where should link builders focus?"
    },
    {
      "level": "H3",
      "text": "Get creative"
    },
    {
      "level": "H3",
      "text": "Build relationships"
    },
    {
      "level": "H3",
      "text": "Tap into influencer networks"
    },
    {
      "level": "H3",
      "text": "Capitalize on trending topics"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H3",
      "text": "Big thank you to our expert contributors:"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Hayley Bowyer\n          \n            Hayley Bowyer"
}