{
  "url": "https://moz.com/blog/link-building-management",
  "slug": "link-building-management",
  "title": "Link Building Management - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I love freestyle link building. There is hardly anything more satisfying than getting in the zone and branching out into countless search iterations plucking opportunities one by one, thinking of great content ideas, implementing it, sending it out and watching it hatch. This article, however, is…",
  "content": "Link Building Management Link Building By: Dan Petrovic June 12, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Dan Petrovic June 12, 2011 Link Building Management Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I love freestyle link building. There is hardly anything more satisfying than getting in the zone and branching out into countless search iterations plucking opportunities one by one, thinking of great content ideas, implementing it, sending it out and watching it hatch. This article, however, is not about that. Instead I will take you through methodology evolved within Dejan SEO team over the period of last two years which helped us manage extremely competitive SEO projects. Large-scale link building campaigns for multiple websites require well-defined workflow, scalability and structure. Planning Stage Assessment of Current Backlink Profile Before getting carried away with anything else it's wise to take a look at the current backlink profile and understand its strengths and weaknesses. Risk Analysis During backlink examination process make note of any suspicious links and create a 'liability' list. If you notice obvious linking patterns, request additional feedback from the client. Questions to ask are: Do you know anything about this? Who was link building before us, you or another company? Did you have a link buying budget? Is there a list of all paid links? Do you still have contacts from link sellers and logins with text link brokers? During what time period did manipulative link techniques take place? Risk of algorithmic penalty decreases with the size of the site you're working on, and by 'size' I mean its natural organic status. Typically larger brands and well-known websites have complex link profiles with numerous sources of links. A few scattered paid links are probably not worth chasing after. If it's a part of an automated scheme though, something that might poke a quality rater in the eye then it might be worth going through the trouble of cleanup - especially if you work in a competitive industry where spam reporting is a common practice. Competitive Analysis Competitive analysis is not only useful for copying links, but also for understanding if a competitor is really a competitor. If you are a brand new book seller and you examine Amazon's backlink profile you will soon learn that Amazon is not really your competitor because you are far from their status. Targeting somebody in a closer niche will help you benchmark properly and help you focus on more realistic link targets. Qualitative Analysis While examining your competitors' links it's a good idea to pay attention to quality of their links. This will enable you to prioritise your link building activities from top down by targeting most potent links first and least important links last. Common tools available for this type of research are: Open Site Explorer - Accurate data. Majestic SEO - Deeper than OSE but contains noisy, unfiltered data. Official Google Toolbar (PageRank) - Single metric. Infrequently updated. Quantitative Analysis Search engines do care about numbers of inbound links. When examining numbers you can ignore the total link count and instead focus on unique linking domains and unique C-blocks. This is a no-brainer and more means better. Keep in mind that you've already performed risk assessment and already know if there are any liabilities and weak spots in your backlink profile which may reveal patterns and traces of link manipulation. Link Velocity It's good to have milestones in the SEO process. One of them might be to balance and overtake competitors in terms of quantity and quality of links. Pay attention to pace at which competing websites acquire new links as this may affect how your calculations work. Majestic SEO provides interesting graphs which may help understand your competitors' link building efforts in terms of newly discovered links for each month. Existing Links Log into Google Webmaster Tools and download all your links. Examine them manually looking for signs of quality (.gov, .edu, big brands). Observe what type of content attracted links and consider creating more of it. Take a look at your most linked pages and confirm your findings. Once the most obvious opportunities are noted run an automated link analysis and let the script do the rest. If you don't have the ability to create own link analysis software use OSE or Majestic SEO as an alternative. If you do use Majestic make sure you authorise your website so you don't pay for the analysis with much needed credits. Analysis of own backlink profile is an essential step which too many SEO professionals skip and ignore. It makes no sense to go hunting for new links if your old links could be fixed and great content ideas generated through observation of linking habits of others. While doing this keep an eye on 404 content and notify webmasters of your new pages and/or implement appropriate redirection to route link juice to new URLs. Defining Targets Pages / URLs This may seem like common sense but your link builders should be well informed about which pages they are to target and which phrases to use when negotiating links. What may seem like an obvious target to you may be something totally different to a link builder. Typically this happens when trying to replace the ranking page with another one which may convert better. Phrases Have a clearly defined list of phrases and type of content corresponding to different pages on the site. Include all possible phrase variations within this list and make it available to your link building team. It's a good practice to put priorities or importance percentages in place to balance your targets to desired effect. Assessment of Assets Making links is really hard. Don't give your link building team any ammunition and the quality of links will be poor. Before you brief your team, have a chat to the client and examine all existing assets which may be of use. Linkable Content It's easy to get a link to a piece of content that deserves it. Why not arm your link builders with highly linkable pages and make their job easier? Unused Assets Very often you will find digital content floating around emails, hard drives or just backed up on CD/DVD media - doing nothing. Not to use this type of content is silly. A single case study or a white paper may contain enough material for ten separate pages of content. Data Content is sometimes staring you in the face and you're unable to recognise it. This happens very often with data driven companies and even with e-Commerce websites. They collect information all the time without realising it. Using internal data such as analytics, pricing trends and consumer behaviour can provide valuable content which can add value to your content and arm your link building team with additional linkable assets. Relationships Yes, relationships are an asset - so you need to understand how the business you work with is connected in the digital and real world. Setup a meeting and go over this with the client and provide some original ideas which may help them think further. It's really hard to start thinking, but once you get warmed up great ideas will start popping up. Record all these ideas and prepare approach strategy and have client approve it. Asking existing partners, customers or suppliers for links could be a sensitive activity and could lead to embarrassing moments and even termination of your SEO contract. Keep in mind that everything you do online impacts your client's brand online - so try not to spam or upset people with your link building activities. You may not be aware of it, but a single person on your team may be doing it right now - quality control is essential. Forming a Schedule Having schedules means being organised, but with link building schedules are more or less an arbitrary structural thing so don't get obsessed if a deadline has been missed. We're dealing with third parties and heavily depend on the speed of response of others. Choosing Link Building Styles There are many methods of link acquisition, some are instant, some require negotiation or money transactions. It's a good practice to define link building styles available to the team and set rules around usage. If you don't do this you will inevitably end up with more of easy links and not necessarily the ones that will impact the rankings. Percentage Allocation Similarly to allocation of anchor text and target pages define what type of link building activity is allowed or recommended and set guidelines around importance. Balancing Targeting, Quality, and Quantity Whether it's yourself or one of your team leaders, somebody needs to keep a finger on the pulse all the time. If you are link building towards ten phrases and one of them pops into #1 spot in the first week it may happen that link building continues for that phrase until the end of the month with other phrases not moving at all. Recognising situations like that can make a big difference for your client's profits. If it has been several months and a particular link building exercise yields no results perhaps it's time to admit defeat and change approach. Support your link building team and make those decisions for them - as they will be too absorbed in the negotiation process to see the big picture at all times. Budget Everything you do costs money: staff, content, resources and transactions. Even if you don't buy links, you'll need a clearly defined budget for link building activities which do require transactions (e.g. memberships, sponsorships, paid directories). Prioritise your spending in order of potential impact and provide spend as part of your monthly report. This piece of data will be appreciated by marketers and business owners as it's something tangible and they can easily understand it. Selecting People If you have a whole team of link builders it is essential to select the right people to work on the right type of project. Look at personal interests and abilities of individual staff members and keep in mind their current engagement. Load balancing will ensure everyone contributes evenly and you're not overwhelming a single team member as this can have negative impact on their performance. Setup Setup of link building activities is not just creation and allocation of tasks, but mostly two way communication between SEO strategists and the link building department where a proper handover of information and assets takes place. Team Brief During the briefing session cover the following areas: The above are not just vague notions, provide solid lists and guidelines that are practical and actionable. You will also need to equip your staff with appropriate email addresses to use for link building and setup professional-looking email signatures. Each team member should already have their own developed online persona which will be looked at by people who are about to give a link or start communication with them. If they don't, then include it as part of the setup process. With directory submission details, keep in mind that you should probably not use own emails or phone numbers when submitting and also client's own email or office address may not be appropriate for public listing. Check with the client before you go sharing their contact details online. Use the brief session to allocate roles within the team in detail so they know who does what (e.g. content, research, negotiation). Content Generation I cannot imagine any type of whitehat link building to take place without great content to start with. There are numerous options available: articles, whitepapers, infographics, research material, multimedia content, downloads and templates. Start generating these early as they will take time to implement and often delayed in publishing due to approval process. Creative Idea Process Link Building Workflow Research Activities Research is the fun part of the link building and is much like surfing the web which can be enhanced with numerous research tools available out there, but not as a way of quality increase, but for productivity. Creative element of the research process remains with the individual performing it. Select your best and most creative people for this task, ideally somebody who understands the industry. Research should yield solid link opportunities and be well documented. Obstacles in Research Activities Link building research is meant to be just that - research, and its product is a tangible, actionable list of link opportunities. Anything that happens in the meantime fragments your process. Distractions You were researching links and all of a sudden you're watching a funny video, playing a game or reading a news article and you don't know how. It's good to have a break, but you can perhaps leave it for lunchtime. Fragmentation Resist the urge and temptation of trying to score a link straight away. Stay on your path and keep recording great link opportunities. You will be a lot more productive that way. Topical Iteration There are many paths research can take you and it's likely you will iterate into many sub-topics or your original research theme. Don't fear the scope, keep them coming. If your topics suddenly have no touching points perhaps it's time to zoom out, review your research and pick a new starting point. Flow Mapping Flow mapping is more of a productivity problem than anything and can help you get back on track much more efficiently than your million open tabs. One such tool is Voyage (for Firefox) which maps your browsing activity automatically. Outside Intrusions Close your email client, messenger, Twitter, Facebook and other forms of distraction. Tell everyone else to keep their questions for after your research is finished. Recording Targets Good record keeping is essential. If you don't have link building management software available to you then setup a collaborative spreadsheet and record your findings that way. Sharing link opportunities internally means less repetitive work for everyone and more links for clients. Balancing Placement Some links take time and others can happen straight away, surprisingly they may carry equal amounts of benefit in many cases. It's essential to recognise links you can get straight away and continuously grow the backlink profile while you research and negotiate others. Negotiation Negotiation is the hard part, so allocate people with best communication skills who are able to organise and followup. Remember to arm them all necessary tools and assets before they start. Quality Control Links can have a serious impact on both rankings and online reputation of your client. Continuous spot-checking and regular monthly link analysis is essential in order to stay out of trouble. Remember that no matter what measures you take there can always be new situations which you have not factored in during the planning stage. Google client communication and transparency can help in early detection of problems. This can potentially save both the contract and reputation of your SEO company. One measure which is easy to implement for monitoring of correspondence quality is setup Google Alerts. Result Monitoring Monitoring the results and overall performance of the SEO campaign is in the hands of an SEO strategist, however having link builders keep an eye on results can be very stimulating. Link building is not an easy task and celebrating success can do wonders to personal motivation of team members. Secondary benefit is that you end up with a better alert system if something should go wrong with the results or if particular phrase needs more or less attention. Coaching One of the most essential activities for large teams is regular coaching and sharing of internal knowledge. In-person or Skype and screen sharing sessions are ideal when in small groups of no more than four members. Focus on issues specific to their projects and do live link building, try out new advanced search queries and use the opportunity to collect feedback from people in the field. Outside of real-time coaching it's a good practice to send group email with wins and success stories. For rules and tips setup an internal wiki and allow members to make contributions. Followup regularly on new link building practices and ideas as they are not always adopted the first time - habits can be a touch thing to change. Reward individuals who adopt new strategies and perform well by both bonuses and public praise. Productivity Tools One area I did not discuss enough was the software-aided link building simply because there aren't any tools that truly satisfy our needs at present. We employ our own link management framework to record link building activities, opportunities, contact details, correspondence, categories, link building styles and stay on top of performance tracking. In a team of more than twenty link builders a lot of links are generated and it's hard to keep track of double contacting, link drop alerts, link partnerships and complex link scanning and data analysis. For those who are just starting out Ontolo and Raven may be a good solution. Conclusion If you are surprised by the amount of work that goes in the setup and execution of our link building campaigns, remember this is not a guide for managing small projects or a single account. Instead I have shared with you a set of measures we put in place to keep large-scale link building operations successful and manageable. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Link Building Management"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Link Building Management"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dan Petrovic\n          \n            Dan Petrovic\n          \n            Dan Petrovic"
}