{
  "url": "https://moz.com/blog/links-from-low-ranking-domains",
  "slug": "links-from-low-ranking-domains",
  "title": "Why It Can Pay to Get Links from Domains that Don't Always Rank Highly - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Contrary to popular opinion, high ranking pages aren't always the best targets for link building. This Whiteboard Friday delves into the pros and cons of targeting top ranking sites for links, and why you should consider a link intersect strategy, targeting sites that rank for broader topics, and…",
  "content": "Why It Can Pay to Get Links from Domains that Don't Always Rank Highly Link Building | Whiteboard Friday By: Rand Fishkin January 26, 2018 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 26, 2018 Why It Can Pay to Get Links from Domains that Don't Always Rank Highly Link Building | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Contrary to popular belief, the top ranking pages aren't always the best targets for your link building efforts. There are good reasons to chase those links, sure, but there are also drawbacks — as well as some hidden alternatives you may not have considered trying. This Whiteboard Friday delves into the pros and cons of targeting high-ranking sites for links and why you should consider a link intersect strategy, targeting sites that rank for broader topics, and earning links from publications ranking beyond page one of the SERPs. Click on the whiteboard image above to open a high-resolution version in a new tab! &amp;amp;lt;span id=\"selection-marker-1\" class=\"redactor-selection-marker\"&amp;amp;gt;&amp;amp;lt;/span&amp;amp;gt; Video TranscriptionHowdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week we're chatting about why it may not actually pay to get links expressly or exclusively from the websites and pages that are ranking highly for your keywords. There's a bunch of reasons why behind this. There's a corollary to it, which is high-ranking websites may not always be the best link targets. Are these the *best* links you can get to rank for \"target keyword(s)\"? So okay, let's start with this question of when you're trying to rank for a target keyword, let's say you're trying to rank for \"stylish sofas.\" You've decided you want to replace your couch, and you want something stylish. So you search for \"stylish sofas.\" The results that come up, we're not talking about the paid results. That would be a mistake to try and get links from those. They're pretty commercially focused. They probably don't want to link to you, and I'm not sure it's all that valuable, necessarily, at least from an SEO perspective. But are these links, the ones that rank in the organic results top five, are they necessarily the best links you could possibly get? There are some reasons for and some reasons against. In favor:Let's talk about in favor of why these are good link targets. The first one is pretty simple and pretty obvious. A. These pages get lots of real visitors interested in this topic who may click on/visit your site (if it's linked-to here) These pages get a lot of search volume, get a lot of search visits from this query. If you're somewhere in this page, if my website is linked to here, that's actually a really nice thing. Maybe someone will click on the top result and then they'll find me and they'll click on it and they'll go to my page instead. That would be great. So if it's linked to there, you could get direct traffic from those pages, so nice link to have. B. Google has put some trust/indication of authority in these pages and sites Google has put some sort of trust and a signal of authority for this keyword by ranking it here. It's saying, \"Hey, you know what? This top result and these top results are all highly relevant and authoritative for this particular query.\" So those are absolutely true things, but I think they bias SEOs and link builders to think in terms of, oh, if I want to rank well for this, these are the only things I should be looking at or the first things I should be looking at or the best places to get links from. Against:Here's why that's not necessarily the case, so some points against. A. Ranking is not actually an explicit signal from Google that these are the best quality links By putting a page here, in the top of the results, Google is saying, \"We, Google, believe that this page will do a great job of solving the searcher's query,\" not, \"We, Google, know that if you get a link from here, you have a very good chance to rank for this keyword.\" That's not explicitly or implicitly said. It's not an implication. Google has never stated that publicly. I don't think it's necessarily the smartest thing to do in their ranking algorithm to have this recursive system that looks at who that already ranks is linking to someone else and replace them. That would be poor for Google's own user experience for a bunch of reasons. B. Google and searchers expect that these pages that rank here are going to solve the searcher's query themselves (not force another click) Not they're going to link to something that's going to solve the searcher's query, at least certainly not necessarily, and definitely that they're not going to force you to make another click. Google wants to rank pages here that solve the searcher's problem directly. So saying, \"Oh, well, I don't think they do that and maybe they should link to me to solve this aspect of the problem,\" this is a spurious connection. C. Of course, earning links from these pages, incredibly difficult These people, especially if they're ranking for a commercial, non-branded query, like \"stylish sofas,\" they really, really don't want to link to one of their competitors, to someone who's trying to actively outrank them. That would be pretty challenging. I recognize that many times when link builders go about this, they look at, okay, this page is ranking. Let me see if I can find another page from this domain from which I can get a link. That's not terrible logic. That's a totally reasonable way to go about link building. But whether it's the best or the only one is what I'm going to challenge here. I don't think it is necessarily the best or only way that you should go about doing your link building for all these reasons we've just talked about. Alternatively, links like these may be more achievable and provide more ranking value:Now, what are the alternatives? You might be asking yourself, \"Well, Rand, show me where should I be doing this if not from here?\" I'm going to present a few alternatives. There's obviously an infinite number of link building tactics you could pursue, but I think some of the smarter ones would be to think about some alternatives like... 1. Sites and pages that link to multiple high-ranking targets For example, if one and three and four are all linked to by SiteA.com, SiteA.com seems to carry, not necessarily for sure, it could be correlation and not causation, but it's certainly worth looking at as to whether Site A is relevant and provides high-quality links and could conceptually link to you and whether that's a good resource. I think that link intersect concept is a really good one to start with. In fact, I think, from a logic perspective, it makes more sense that sites and pages that tend to link to these top results probably provide more potential power to your ranking authority than just the pages that are already ranking. 2. Sites and pages that rank well for what I'd call broader keywords/broader topics related to the space you're in So if it's \"stylish sofas,\" you might look at keywords like, well, who's ranking for \"interior design\" or \"interior design magazines\" or \"interior design events\" or perhaps it's \"decoration ideas.\" If I can find the people who are ranking for those sorts of things, that probably is going to say those are the types of places that will link out to other resources that have more specific targeting, like targeting \"stylish sofas,\" and probably provide a lot of value there. 3. Influential publications and resources in the topic space that may not be doing good keyword targeting or SEO I like going and trying to find influential publications and resources, that are in the topic space, that might not actually be doing good keyword targeting or good SEO, which means it's hard to use Google to find them. You may find them ranking on page two, page three, or page four. You may need to do some other types of research, like look on Instagram and see what companies or what publications are using these hashtags and have lots of followers in this interior design or decoration or furniture space. From there, that will lead you to influential publications in the space that maybe have lots of readership, lots of engagement on social channels or on their website, but haven't done a particularly great job in Google. Those influential publications, I think Google is doing a very good job of identifying, \"Hey, wait a minute. Here's a bunch of publications that are in important in space X and they are all linking to this website, which is doing a good job of targeting these keywords. So, therefore, that's who we should potentially rank.\" So hopefully, this Whiteboard Friday will help you to expand your link building opportunities and also to recognize why the top ranking pages might not always be and certainly aren't necessarily the best link targets. Thanks everyone. We'll see you again next week for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why It Can Pay to Get Links from Domains that Don't Always Rank Highly"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why It Can Pay to Get Links from Domains that Don't Always Rank Highly"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Are these the *best* links you can get to rank for \"target keyword(s)\"?"
    },
    {
      "level": "H3",
      "text": "In favor:"
    },
    {
      "level": "H3",
      "text": "Against:"
    },
    {
      "level": "H2",
      "text": "Alternatively, links like these may be more achievable and provide more ranking value:"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}