{
  "url": "https://moz.com/blog/linked-unstructured-citations",
  "slug": "linked-unstructured-citations",
  "title": "The Guide to Building Linked Unstructured Citations for Local SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Linked unstructured citations are only growing in importance when it comes to local SEO. But what's the best way to build them? In this comprehensive guide to local link building, we share how in 9 steps (and the risks to avoid, as well).",
  "content": "The Guide to Building Linked Unstructured Citations for Local SEO Link Building | Local SEO By: Miriam Ellis December 6, 2018 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis December 6, 2018 The Guide to Building Linked Unstructured Citations for Local SEO Link Building | Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This article was written jointly in partnership with Kameron Jenkins. You can enjoy her previous articles here. When you’ve accomplished step one in your local search marketing, how do you take step two? You already know that any local business you market has to have the table stakes of accurate structured citations on major platforms like Facebook, Yelp, Infogroup, Acxiom, and YP. But what can local SEO practitioners do once they’ve got these formal listings created and a system in place for managing them? Our customers often come to us once they’ve gotten well underway with Moz Local and ask, “What’s next? What can I do to move the needle?” This blog post will give you the actionable strategy and a complete step-by-step tutorial to answer this important question. A quick refresher on citations Listings on formal directories are called “structured citations.” When other types of platforms (like online news, blogs, best-of lists, etc.) reference a local business’ complete or partial contact information, that’s called an “unstructured citation.” And the best unstructured citations of all include links, of course! We refer to these as \"linktations.\" For example, the San Francisco branch of a natural foods grocery store gets a linked unstructured citation from a major medical center in their city via a blog post about stocking a pantry with the right ingredients for healthier eating. Google and consumers encounter this reference and understand that trust and authority are being conveyed and earned. The more often websites that are relevant to your location or industry link to you within their own content, the better your chances of ranking well in Google’s organic and local search engine results. Why linked unstructured citations are growing in importance right now Link building is as old as organic SEO. Structured citation building is as old as local SEO. Both practices have long sought to influence Google rankings. But a close read of the local search marketing community these days points up an increasing emphasis on the value of unstructured citations. In fact, local links were one of the top three takeaways from the 2018 Local Search Ranking Factors survey. Why is this? Google has become the dominant force in local consumer experiences, keeping as many actions as possible within their own interface instead of sending searchers to company websites. Because links influence rank within that interface, most local businesses enterprises will need to move beyond traditional structured citations to impress Google with mentions on a diverse variety of relevant websites. While structured citations are rightly referred to as “table stakes” for all local businesses, it’s the unstructured ones that can be competitive difference-makers in tough markets. Meanwhile, Google is increasingly monetizing local search results. A prime example of this is their Local Service Ads (LSA) program which acts as lead gen between Google and service area businesses like plumbing and housekeeping companies. Savvy local brands (including brick-and-mortar models) will see the way the wind is blowing with this and work to form non-Google-dependent sources of traffic and lead generation. A good linked unstructured citation on a highly relevant publication can drive business without having to pay Google a dime. Your goal with linked unstructured citations is to build your community footprint and your authority simultaneously. All you need is the right tools for the research phase! Fishing for opportunities with Link Intersect For the sake of this tutorial, let’s choose at random a small B&B in Albuquerque — Bottger.com — as our hypothetical client. Let’s say that the innkeeper wants to know how the big Tribal resort casinos are earning publicity and links, in the hopes of finding opportunities for a smaller hospitality business, too. *Note that these aren’t absolutely direct competitors, but they share a city and an overall industry. We’re going to use Moz’s Link Intersect tool to do this research for Bottger Mansion. This tool could help Bottger uncover all kinds of links and unstructured linked citation opportunities, depending on how it’s used. For example, the tool could surface: Links that direct or near-direct competitors have, but that Bottger doesn’t Locally relevant links from domains/pages about Bottger’s locale Industry-relevant links from domains/pages about the hospitality industry Step 1: Find the \"big fish\" A client may already know who the “big fish” in their community are, or you can cast a net by identifying popular local events and seeing which businesses sponsor them. Sponsorships can be pricey, depending on the event, so if a local company sponsors a big event, it’s an indication that they're a larger enterprise with the budget to pursue a wide array of creative PR ideas. Larger enterprises can serve as models for small business emulation, at scale. In our case study, we know that Bottger is located in Albuquerque, so we decided to locate sponsors of the famous Albuquerque International Balloon Fiesta. Right away, we spotted two lavish Albuquerque resort-casinos — Isleta and Sandia. These are the “big fish” we want our smaller client to look to for inspiration. Step 2: Input domains in Link Intersect We’re going to compare Bottger’s domain to Isleta and Sandia’s domains. In Moz Pro, navigate to “Link Explorer” and then select “Link Intersect” from the left navigation. Input your domain in the top and the domains you want to mine link ideas from in the fields beneath, as depicted below. Open Link Explorer in a new tab Next to Bottger’s domain, we've selected “root domain” as that will show us all competitor links who haven’t linked to us at all. We’re also going to select “root domain” on the resort domains, so we can see all of their backlinks, rather than just links to particular pages on their sites. Moz’s Link Intersect tool will let you compare your site with up to 5 competitors. It’s totally up to you how many sites you want to evaluate at once. If you’re just getting started with link building, you may want to start with just one domain, as this should yield plenty of link opportunities to start with. If you’ve already been doing some link building, you have more time to dedicate to link building, or you’d just generally rather have more options to work with, go ahead and put in multiple domains to compare. Step 3: Find link opportunities Once you’ve input your domain and your competitor(s) domains, click “Find Opportunities.” That will yield a list of sites that link to your competitors, but do not link to you. In this example, we’re comparing our client’s domain against two other domains: A (Isleta) and B (Sandia). In the “Sites that intersect” column, you will see whether Site A has the link, Site B has it, or if they both have it. Step 4: The link selection process Now that we have a list of link ideas from Isleta and Sandia’s backlink profiles, it’s time to decide which ones might yield good opportunities for our B&B. That’s right — just because something is in a competitor’s link profile doesn’t necessarily mean you want it! View the referring pages The first step is to drill down and get more detail about links the big resorts have. Select the arrow to expand this section and view the exact page the link is coming from. In this example, both Sandia and Isleta have links from the root domain marriott.com. By using the “expand” feature, we can see the exact pages those links are located on. Identify follow or no-follow You can use the MozBar Chrome plugin to view whether your competitor’s link is no-followed or followed. Since only followed links pass authority, you may want to prioritize those, but no-followed links can also have value in the form of generating traffic to your site and could get picked up by others who do eventually link to your site with a follow link. Select the MozBar icon from your browser and click the pencil icon. If you want to see Followed links, select “Followed” and the MozBar will highlight these links on the page in green. To find No-Followed links, click “No-Followed” and MozBar will highlight these links on the page in pink. Common types of links you’ll see in the profiles of local business websites If this is your first foray into link building for local businesses, you may be unfamiliar with the types of sites you’ll see in Link Intersect. While no two link profiles are exactly the same, many local businesses use similar methods for building links, so there are some common categories to be aware of. Knowing these will help you decipher the results Link Intersect will show you. Types of links and what you can do with them: Press releasesPress release sites like PRweb.com and PRnewsire.com are fairly common among local businesses that want to spread the word about their initiatives. Whether someone at the business won an award or they started a new community outreach program, local businesses often pay companies like PRweb.com to distribute this news on their platform and to their partners. These are no-followed links (don’t pass link authority aka “SEO value”) but they can offer valuable traffic and could even get picked up by sites that do link with a follow link.If your competitor is utilizing press releases, you may want to consider distributing your newsworthy information this way!Structured citations / directoriesOne of the primary types of domains you’ll see in a local business’ backlink profile is directories — structured citation websites like yellowpages.com that list a business’ name, address, and phone number (NAP) with a link back to the business’ website. Because they’re self-created and not editorially given, like Press Releases, they are often no-followed. However, having consistent and accurate citations across major directory websites is a key foundational step in local search performance.If you see these types of sites in Link Intersect, it may indicate your need for a listings management solution like Moz Local that can ensure your NAP is accurate and available across major directories. Typically, you’ll want to have these table stakes before focusing on unstructured linked citations.News coverageAnother favorite among local businesses is local media coverage (or just media coverage in general — it’s not always local). HARO (Help a Reporter Out) is a popular service for connecting journalists to subject matter experts who may be valuable sources for their articles. The journalists will typically link your quote back to your website. Aside from services like HARO, local businesses would do well to make media contacts, such as forming relationships with local news correspondents. As news surfaces, they’ll start reaching out to you for comment!If you see news coverage in your competitor’s backlink profile, you can get ideas of what types of publications want content and information that you can provide.Local / industry coverageBlogs, hobby sites, DIY sites, and other platforms can feature content that depicts city life or interest in a topic. For example, a chef might author a popular blog covering their dining experiences in San Francisco. For a local restaurant, being cited by this publication could be valuable.If you see popular local or industry sites in your competitor’s backlink profile, it’s a good signal of opportunity for your business to build a relationship with the authors in hopes of gaining links.Trade organizationsMost local businesses are affiliated with some type of governing/regulating body, trade organization, award organization, etc. Many of these organizations have websites themselves, and they often list the businesses they’re affiliated with.If your competitor is involved with an organization, that means your business is likely suited to be involved as well! Use these links to get ideas of which organizations to join.Community organizationsCommunity organizations are a great local validator for search engines, and many local businesses have taken notice. You’ll likely find these types of organizations’ websites in your competitor’s backlink profile, such as Chamber of Commerce websites or the local YMCA.As a local business, your competitors are in the same locale as you, so take note of these community organizations and consider joining them. You’ll not only get the benefit of better community involvement, but you can get a link out of it too!Sponsorships / event participationLocal businesses can sponsor, donate to, host or participate in community events, teams, and other cherished local resources, which can lead to both online and offline publicity.Local businesses can earn great links from online press surrounding these groups and happening. If an event/team page highlights you, but doesn’t actually link to benefactors/participants, don’t be shy about politely requesting a link.Scholarships / .edu sitesA popular strategy used by many local businesses and non-local businesses alike is scholarship link building. Businesses figured out that if they offered a scholarship, they could get a link back to their site on education websites, such as .edu domains. Everyone seemed to catch on — so much so that many schools stopped featuring these scholarships on their site. It’s also important to note that .edu domains don’t inherently have more value than domains on any other TLD.If your business wants to offer a scholarship, that is a great thing! We encourage you to pursue this for the benefit it could offer students, rather than primarily for the purpose of gaining links. Scholarship link building has become very saturated, and could be a strategy with diminishing returns, so don’t put all your eggs in this basket, and do it first and foremost for students instead of links.Other businessesBusinesses may sometimes partner with each other for mutually beneficial link opportunities. Co-marketing opportunities that are a byproduct of genuine relationships can present valuable link opportunities, but link exchanges are against Google’s quality guidelines.Stay away from “you link to me, I’ll link to you” opportunities as Google can see it as an attempt to manipulate your site’s ranking in search, but don’t be afraid to pursue genuine connections with other businesses that can turn into linking opportunities.SpamJust because your competitor has that link doesn’t mean you want it too! In Link Intersect, pay attention to the domain’s Spam Score and DA. A high spam score and/or low DA can indicate that the link wouldn’t be valuable for your site, and may even harm it. Also watch out for links generated from comments. If your competitor has links in their backlink profile coming from comments, you can safely ignore these as they do not present real opportunities for earning links that will move the needle in the right direction. Now that you’re familiar with popular types of local backlinks and what you can do with them, let’s actually dig into Isleta and Sandia’s backlinks to see which might be good prospects for us. Step 5: Imitation is the sincerest form of flattery Both the Albuquerque Marriott and Hilton Garden Inn link to Isleta and Sandia on their “Local Things to Do” pages. This could be a great prospect for Bottger! In many cases, “things to do” pages will include lists of local restaurants, historic sites, attractions, shops, and more. Note how their addresses are included on the following pages, making them powerful linked unstructured citations. Bottger hosts fancy tea parties in a lovely setting, which could be a fun thing for tourists to do. Isleta and Sandia also have links from a wedding website. If Bottger uses their property as a wedding venue, offers special wedding or engagement packages, or something similar, this could be a great prospect as well. Link Intersect also yielded links to various travel guide websites. There are plenty of links on websites like these to local attractions. In the following example, you can see an Albuquerque travel guide that's broken up by category, “hotels” being one of them: Isleta and Sandia also have been featured in the Albuquerque Journal. In this example, a local reporter covered news that Isleta was opening expanded bingo and poker rooms. This seems to be a journalist who covers local businesses, so she could be a great connection to make! Many other links in Isleta and Sandia’s backlink profiles came from sources like events websites, since these resorts are large enough to serve as the venue for major events like concerts and MMA matches. Although Bottger isn’t large enough to host an event of that magnitude, it could spark good ideas for link building opportunities in the future. Maybe Bottger could host a small community tea tasting event featuring locally sourced herbal teas and get in touch with a local reporter to promote it. Even competitor links that you can’t directly pursue can spark your creativity for related link building opportunities. And let’s not forget how we found out about Isleta and Sandia in the first place: the Albuquerque International Balloon Fiesta! Event sponsors are featured on an “official sponsors” page with links to their websites. This is a classic, locally relevant opportunity for any Albuquerque business. Step 6: Compile your link prospects in Link Tracking Lists If you’re thinking, “This sounds great, but it also sounds like a lot of work. How am I ever going to keep track of all this?” — we’ve got you covered! Moz Pro’s “Link Tracking Lists” was built for just this purpose. In Link Intersect, you’ll see little check boxes next to all your competitors’ links. When you find one you want to target, check the box. When you’re done going through all the links and have checked the boxes next to the domains you want to pursue, click “Add to Link Tracking List” at the top right. Since we’ve never done link building for Bottger before, we’re going to select “Create New List” from the dropdown, and label it something descriptive. Make sure to put your client’s domain in the “target URL” field. For Step 3, since we’ve just selected the links we want to track from Link Intersect, those will already be populated in this field, so no further action is needed other than to click “Save.” We’ll come back to Link Tracking Lists when we talk about outreach, but for now, all you need to know is that you can add the desirable competitor links (in our case, links from Isleta and Sandia) to Link Tracking lists straight from Link Intersect, making it easy to manage your data. Step 7: Find out how to connect with your link prospects Now it’s time to connect the dots: how do you go from knowing about your competitor’s links to getting those types of links for yourself? There are three main ways you can get unstructured linked citations to your local business’ website, and those categories are what’s going to dictate the strategy you need to take to secure that opportunity for yourself. Self-created: Self-created links are like voting for yourself, so sites that accept these types of submissions, like Yelp.com, will NoFollow the link to your business' website. Visitors are still referred to your website through that link, but the link doesn't pass authority from Yelp.com to your domain. You should only get authority from a website if they link to you on their own (what Google calls \"editorially placed\" links). Neither NoFollow nor Follow links are inherently good or bad on their own. They are just intended for different purposes, and it's the misuse of followed links that can get you in trouble with Google. We'll talk more about that in a later section titled “Avoiding the bad fish: Risks of ignoring Google’s link scheme guidelines” Prompted by outreach: In many cases, people won’t know about your content until you tell them. These links are editorially placed by the site owner (not self-created), but the site owner was only made aware of your content because you reached out to them. Organically earned: Sometimes, you get links even without asking for them. If you have a popular piece of content on your site that receives lots of traffic, for example, people may link to that on their own because they find it valuable. Since this tutorial is about proactively pursuing link opportunities, we’re going to focus on unstructured linked citations types one and two. Articles If your competitor has been featured in an article from say a local journalist or blogger, then your outreach will be focused on making a connection with that writer or publication for future link opportunities, rather than getting the exact link your competitor has. That’s because the article has already been written, so it’s unlikely that the writer will go back and edit their story just to add your link. The one exception to this rule would be if the article links to your competitor, but your competitor’s link is now broken. In this scenario, you could reach out to the writer and say something like, “Hey! I notice in your article [article title] you link to [competitor’s link], but that link doesn’t seem to be working. I have similar content on my website [your URL]. If you find it valuable, please feel free to use it as a replacement for that broken link!” Sometimes the contact information of the writer will be right next to the article, itself. For example: If there’s no email address or contact form in the writer’s bio, you can usually find a link to one of their social media accounts, like Twitter, and you can connect with them there via a public or direct message. If you live in a small, tight-knit community, you may even be able to meet with the author in person. Press releases If you notice your competitors are issuing a lot of press releases and you want to try that out for yourself, you’ll likely need to sign up for an account, as these are a primarily self-serve platform. Most quality press release sites charge per release, and the price can differ depending on length. Citations / directories You’ll either want to sign up for a citation service like Moz Local that distributes your data to these types of listings programmatically, or if you do it manually, you’ll want to find the link to create your listings. Please note that your business may already be on the directory even if you haven’t set up a profile. Before creating a new listing, search for your business name and its variants, your phone number, and current and former addresses to see if there are existing listings you can claim and update. Business websites Most businesses will make it easy to contact them. If you’re trying to contact another business for the purpose of proposing teaming up for a co-marketing opportunity, look in their footer (the very bottom of the website). If there’s no contact information there, search for a “Contact Us” or “About” page. You may not find an email address, but you may be able to find a contact form or phone number. Below is an example from Albuquerque Little Theater, where they have contact information on the right and advertising information in the top navigation for businesses that are interested in taking out ads in their printed show programs. Not an unstructured linked citation, but a great way to get your business known to the community! Organizations Most organizations will make it easy for those who want to join, unless they are more exclusive or invitation-only. In the event that you do wish to get involved in an invitation-only organization that has no public-facing contact information, try viewing a member list and seeing if there’s anyone you know. Or maybe you know someone who can introduce you to one of the members. Genuine connections are key for this type of organization. Step 8: Writing a good outreach email (for unstructured linked citations requiring outreach) Outreach emails are necessary when the link opportunity you’re pursuing isn’t a link you could create yourself, or if the link source is one where you can’t make face-to-face contact with decision-makers. One of the most important questions you should be asking yourself for these opportunities is, “Why would this website link to me?” Here’s how Bottger might go about sending an outreach email: Greeting that matches the nature of the outreach target “Hey Jill!” might be fine when outreaching to the author of a blog, while “Hello Ms. Smith” might be better for more professional outreach. Introduction Give a brief summary of who you are, what you do, and your interest in contacting them. For example: “I work with Bottger Mansion, a historic Bed & Breakfast in Old Town Albuquerque. I found your page about Albuquerque activities — you’ve really captured a lot of what Albuquerque has to offer!” The ask, and the value add This is where you’ll actually ask for the link. It’s a good idea here to add value. Don’t just ask for something; offer to give something back! To continue the same example: “As long-time residents of Old Town, we’d love to provide you with a comprehensive list of activities in the city’s historic district! We feel an Old Town Activities list would be a great addition to your page. Bottger Mansion regularly hosts high tea, for example, which we’d love to let more people know about with a spot on your list!” Close Wish them well, thank them for their time, and sign off. Make sure that it’s easy for them to find information about you by including your full name, title, organization, and website/social links in your email signature. Don’t be afraid to get on the phone, either! Hearing your voice can add a human element to the outreach attempt and offer a better conversion rate than a more impersonal email (we all get so many of those a day that ones from people we don’t know are easy to ignore). And remember that local businesses have a particular advantage in accruing unstructured linked citations. Lively participation in the life of your community can continuously introduce you to decision-makers at popular local publications, paving the way towards neighborly outreach on your part. Learn to see the opportunities and think of ways your business can add value to the content that is being written about your town or city. Step 9: Tracking your wins Next-to-last, we’re going to jump back to Link Tracking Lists for a second, because that’s going to come in extremely handy here. Remember when we created the list with Sandia and Isleta’s links that we were interested in pursuing? Those will now show up when we go to Moz Pro > Link Explorer > Link Tracking Lists. Every time Bottger successfully secures a link that they’ve added to their Link Tracking List, the red X in “Links to target URL?” column will turn blue, indicating that the site links to Bottger’s root domain. If we were pursuing links to individual pages, and a link prospect linked to our target page, the red X would turn green. Another handy feature is the “Notes” dropdown. This allows you to keep track of your outreach attempts, which can be one of the trickiest parts about link building! Avoiding the bad fish: Some words of caution before you get started Before starting this process for yourself, familiarize yourself with these four risks so that your fishing trip doesn’t result in a basket of bad catches that could waste your resources or get your website penalized. 1. Risks of a “copy only” strategy Link Intersect can be amazingly helpful for discovering new, relevant link opportunities for your local business, but link builders beware. If all you ever do is copy your competitors, the most you’ll ever achieve is becoming the second-best version of them. Use this method to keep tabs on strategies your competition is using, and even use it to spark your own creativity, but avoid copying everything your competitors do, and nothing else. Why be the second-best version of your competition when you can be the best version of yourself? 2. Risks of a “blindly follow” strategy Comparing your site’s backlink profile with your direct competitors’ backlink profiles will return a list of links that they have and you don’t, but don’t use Link Intersect results as an exact checklist of links to pursue. Your competitors might have bad backlinks in their profile. For example, avoid pursuing opportunities from domains with a high Spam Score or low Domain or Page Authority (DA/PA). Learn more about how to evaluate sites by their Spam Score or DA/PA. They might also have great backlinks that aren’t the right opportunity for your business, and those should be avoided too! Do you remember Isleta and Sandia’s links for events like MMA matches? If Bottger were to blindly take those resorts’ link profiles as directives, they might think they have to host a fight at their B&B, too! Take what you find with a grain of salt. Evaluate every link opportunity on its own merit, rather than deeming it a good opportunity simply because your competitor has it. 3. Risks of an “apples to oranges” strategy Choose the domains and pages you want to compare yourself against wisely. As a small local B&B, Bottger wouldn’t want to compare their backlink profile to that of Wikipedia or The New York Times, for example. Those sites are popular, but not relevant in any way to the types of unstructured linked citations Bottger would want to pursue, such as links that are locally relevant or industry-relevant. In other words, just because a site is popular doesn’t mean it will yield relevant unstructured linked citation opportunities for you. Here in this tutorial, we’ve outlined one potential use-case for Link Intersect: finding unstructured linked citations your local business competitors have. However, this is not the only use for Link Intersect. Instead of comparing your site against competitors or near-competitors, you could compare it against: Sites or pages about your locale (ex: sites like https://www.visitalbuquerque.org/ or http://www.albuquerqueoldtown.com/). This could yield locally relevant unstructured linked citation opportunities. Sites or pages about your industry (ex: sites like http://www.paii.com/ or http://lodgingmagazine.com/). This could yield industry-relevant unstructured linked citation opportunities. If you know what types of links you’re trying to find, choosing sites to evaluate against your own should be a lot easier, and yield more relevant opportunities. 4. Risks of ignoring Google’s “link schemes” guidelines If you’ve never embarked on link building before, we encourage you to read through Google’s quality guidelines for webmasters, specifically its section on “Link schemes.” If you were to distill those link guidelines down into a single principle, it would be: don’t create links for the purpose of manipulating your site’s ranking in Google search. That’s right. Google doesn’t want anyone embarking on any marketing initiatives solely for the purpose of improving their ranking. Google wants links to be the natural byproduct of the quality work you’re doing for your audience. Google can penalize sites that participate in activities such as: Buying links that pass PageRank (“followed” links) Excessive “you link to me and I’ll link to you” exchanges Self-created followed links that weren’t editorially placed by the site owner This underscores that the activities that are just good business, like being involved in the local community, are also the ones that can produce the links that Google likes. Sites owners might need a little nudge, which is why we’ve included a section on outreach, but that doesn’t mean the links are unnatural. Unstructured linked citations should be a byproduct of the good work local businesses are doing in their communities. In conclusion At Moz, we’re strong believers in authenticity, and there is no better pond for building meaningful marketing relationships than the local one. Focusing on unstructured linked citations can be viewed as a prompt to grow your community relationships — with journalists, bloggers, event hosts, business associations, and customers. It’s a chance for a real-world fishing trip that can reel in a basket of publicity for your local brand beyond what money can buy. Your genuine desire to serve and build community will stand you in good stead for the long haul. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Guide to Building Linked Unstructured Citations for Local SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Guide to Building Linked Unstructured Citations for Local SEO"
    },
    {
      "level": "H2",
      "text": "A quick refresher on citations"
    },
    {
      "level": "H2",
      "text": "Why linked unstructured citations are growing in importance right now"
    },
    {
      "level": "H2",
      "text": "Fishing for opportunities with Link Intersect"
    },
    {
      "level": "H2",
      "text": "Step 1: Find the \"big fish\""
    },
    {
      "level": "H2",
      "text": "Step 2: Input domains in Link Intersect"
    },
    {
      "level": "H2",
      "text": "Step 3: Find link opportunities"
    },
    {
      "level": "H2",
      "text": "Step 4: The link selection process"
    },
    {
      "level": "H3",
      "text": "View the referring pages"
    },
    {
      "level": "H3",
      "text": "Identify follow or no-follow"
    },
    {
      "level": "H3",
      "text": "Types of links and what you can do with them:"
    },
    {
      "level": "H2",
      "text": "Step 5: Imitation is the sincerest form of flattery"
    },
    {
      "level": "H2",
      "text": "Step 6: Compile your link prospects in Link Tracking Lists"
    },
    {
      "level": "H2",
      "text": "Step 7: Find out how to connect with your link prospects"
    },
    {
      "level": "H3",
      "text": "Articles"
    },
    {
      "level": "H3",
      "text": "Press releases"
    },
    {
      "level": "H3",
      "text": "Citations / directories"
    },
    {
      "level": "H3",
      "text": "Business websites"
    },
    {
      "level": "H3",
      "text": "Organizations"
    },
    {
      "level": "H2",
      "text": "Step 8: Writing a good outreach email (for unstructured linked citations requiring outreach)"
    },
    {
      "level": "H2",
      "text": "Step 9: Tracking your wins"
    },
    {
      "level": "H2",
      "text": "Avoiding the bad fish: Some words of caution before you get started"
    },
    {
      "level": "H3",
      "text": "1. Risks of a “copy only” strategy"
    },
    {
      "level": "H3",
      "text": "2. Risks of a “blindly follow” strategy"
    },
    {
      "level": "H3",
      "text": "3. Risks of an “apples to oranges” strategy"
    },
    {
      "level": "H3",
      "text": "4. Risks of ignoring Google’s “link schemes” guidelines"
    },
    {
      "level": "H2",
      "text": "In conclusion"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}