{
  "url": "https://moz.com/blog/linkscape-updates-new-task-list-pro-feature",
  "slug": "linkscape-updates-new-task-list-pro-feature",
  "title": "Linkscape Updates and Wireframes/Feedback on New Task List PRO Feature - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As you may have seen, Linkscape has just updated with a brand new index crawled primarily in early August. This means there's new data in the web app, in Open Site Explorer, the Link Intersect tool and the mozBar (note: the new Firefox 6 caused a ...",
  "content": "Linkscape Updates and Wireframes/Feedback on New Task List PRO Feature Moz Tools By: Rand Fishkin August 23, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 23, 2011 Linkscape Updates and Wireframes/Feedback on New Task List PRO Feature Moz Tools The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As you may have seen, Linkscape has just updated with a brand new index crawled primarily in early August. This means there's new data in the web app, in Open Site Explorer, the Link Intersect tool and the mozBar (note: the new Firefox 6 caused a bunch of issues w/ our toolbar displays, so it will be another week or so before it's re-compatible with this version).In Linkscape's previous index, we focused a bit more on crawling large, powerful, important domains more deeply at the expense of some smaller, low mozRank sites on the fringes of the web. This time, we're trying to compromise a bit with an index that's a bit more balanced - it's still quite large; 51 billion URLs (vs. prior index sizes in the 38-42 billion URL range), but contains more unique root domains - 98 million vs. 91 million in the prior index. As always, we'd love your feedback on this index's quality and value for competitive analysis / link building. Oh, and BTW, for those of you interested in link building with Linkscape data / Open Site Explorer, I'm giving a webinar on that topic this Friday, so sign up! Here are the latest Linkscape stats: 51,494,511,857 (51.5 billion) URLs 592,299,695 (592 million) Subdomains 98,626,331 (91.6 million) Root Domains 399,327,725,405 (399 billion) Links Followed vs. Nofollowed 2.25% of all links found were nofollowed 58.82% of nofollowed links are internal, 41.18% are external Rel Canonical - 10.12% of all pages now employ a rel=canonical tag The average page has 78.03 links on it 65.09 internal links on average 13.21 external links on average I've only run a few reports so far, but my sense is that there's a reasonably good balance here, though, of course, I'd still love to get a larger index and hope to achieve even more significant growth on that front over the next few months. If you ever find a link we're missing or something you expected that we didn't have, please let us know.I also have an upcoming feature of PRO that I can share today, and I'm pretty excited about it. The feature is currently called \"task list\" and it's part of how we're planning to make the SEO process and the data inside campaigns more actionable and useful. Here's a wireframe (note: not a screenshot!):The idea is to give marketing professionals working inside the app a list of potential \"to-do\" items. Obviously, we may not always know what's on your plate, but from the weekly crawl, ranking analyses and on-page reports, we can often get a sense of some good priorities. Along with these, we want to add a list of common tasks that every SEO may want to engage in with a campaign/site. You can see some examples of that in the wireframe above, but we'd also love to get your feedback/suggestions.To that end, we've got a survey on the task list you engage in as a professional marketer, and we'd love to get your input here.Thanks a ton - and feel free to add any color or additional ideas in the comments below!p.s. One more item - the anchor text tab in Open Site Explorer will be showing data from last index for a couple weeks, as we encountered some processing issues of anchor text in this index. We hope to have that fixed soon.p.p.s. Sadly, we discovered another issue with the new Linkscape indices (which likely won't be fixed until the October index). We've been crawling larger domains more deeply and have found that our crawler seems to recognize link-like code (<a href=\"xyz..\") in binary file types that search engines likely aren't counting. Thus, you may see a number of links from important domains that aren't actually HTML (some are PDFs, which probably do count, but others like .exe, etc. likely don't) in OSE export data or link lists. We're working to have this bug fixed, but it will be in the October index (we have one more index with this issue coming mid-September). Sorry about that! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Linkscape Updates and Wireframes/Feedback on New Task List PRO Feature"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Linkscape Updates and Wireframes/Feedback on New Task List PRO Feature"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "Moz AI: Introducing Augmented Intelligence"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}