{
  "url": "https://moz.com/blog/linkbuilding-tips-for-small-business-linkbuild-your-way-to-success-before-youve-even-started",
  "slug": "linkbuilding-tips-for-small-business-linkbuild-your-way-to-success-before-youve-even-started",
  "title": "Linkbuilding Tips for Small Business - Linkbuild Your Way to Success Before You've Even Started - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "After reading rishil’s post about linkbuilding for small business, I thought I’d throw in a post about linkbuilding for even smaller start ups – and how starting early with this nifty little linkbuilding tip could give you a sweet advantage. Er, by the way, some people may call this grey hat ...",
  "content": "Linkbuilding Tips for Small Business - Linkbuild Your Way to Success Before You've Even Started Link Building By: Richard Baxter July 3, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Richard Baxter July 3, 2008 Linkbuilding Tips for Small Business - Linkbuild Your Way to Success Before You've Even Started Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. After reading rishil’s post about linkbuilding for small business, I thought I’d throw in a post about linkbuilding for even smaller start ups – and how starting early with this nifty little linkbuilding tip could give you a sweet advantage. Er, by the way, some people may call this grey hat or whatever. I'm not actually sure where this one sits! Here’s my start up / SEO / linkbuilding idea for a niche online clothes shop . For example purposes, let’s say that idea was a vintage clothes store startup based in London. One of the biggest issues any start up site faces is traffic and the cost associated with getting that traffic on day one of launch. So, why not extend your marketing plan so you begin your marketing activity a long time before the business has even started? Let’s say a year. It’ll take some work, but it shouldn’t cost much more than a few pounds a month and some investment in time at the weekend, which is ideal for the shoestring budget of your usual pipe-dreamer-still-in-full-time-employment. The idea is simple: 1) Buy a domain and good Wordpress hosting. Go about the usual SEO setup and choose a theme. 2) Launch your blog and theme it around the subject you’re going to start trading in – vintage clothes, remember? 3) Write a number of quality blog posts around the subject, be it outfits, accessories, or good locations in London for shopping retro. Whatever. It helps if you’re interested in the subject, obviously. 4) Create a few example review pages of other vintage clothing shops in London, just so you can show them off when the time comes. Make the pages useful, maybe include embedded Google maps links, a link to the shop website and telephone number, write a breakdown of what products are on offer , optimise the pages by brand (company) name, product types, and location. That's a useful page for users, right? 5) Don’t monetise. Make your blog appear to be totally non-commercial. You're about to pitch yourself as an enthusiast. Here’s the good bit. Once you have your blog set up, your content written, you’re ready to go. Grab a map and a list of every vintage clothes shop in London. Every single one. Spend the next few months visiting each one of these in person. (A full day a weekend isn’t much to ask for the eventual outcome of vintage clothes empire.) For every shop you visit, the spiel is the same – you can explain that you run a blog and you’re a vintage clothing fanatic. Ask if it would be ok to do a shop review, include photos, and to create them a profile / review page on your blog. Here’s the cool bit. Ask them for a link in return back to your blog. Job done. A full year later you have a website that ranks, generates traffic and clickthroughs to some happy shop owners, and all you did was produce some good, useful content. Whenever you're ready, feel free to launch your online vintage clothes shop at your domain. Set up 301's all over the place and you're done. Would I do this? No, I don’t have time. It’s food for thought though, yes. Richard Baxter is the author of the Recruitment SEO guide and the Ubuntu Installation guide at SEOgadget. He loves a good linkbuilding tactic from time to time, and you can blip him or twitter him or even plurk him if that kind of thing floats your boat. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Linkbuilding Tips for Small Business - Linkbuild Your Way to Success Before You've Even Started"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Linkbuilding Tips for Small Business - Linkbuild Your Way to Success Before You've Even Started"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Richard Baxter\n          \n            Richard Baxter\n          \n            Richard Baxter"
}