{
  "url": "https://moz.com/blog/link-building-tactics-to-acquire-50-links",
  "slug": "link-building-tactics-to-acquire-50-links",
  "title": "The 3 Easiest Link Building Tactics Any Website Can Use to Acquire Their First 50 Links - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Without a solid base of links, your site's SEO won't be competitive. This Whiteboard Friday shows you three relatively quick, easy, and tool-free ways to (link) build a sturdy foundation for your site.",
  "content": "The 3 Easiest Link Building Tactics Any Website Can Use to Acquire Their First 50 Links Link Building | Whiteboard Friday By: Rand Fishkin September 8, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 8, 2017 The 3 Easiest Link Building Tactics Any Website Can Use to Acquire Their First 50 Links Link Building | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Without a solid base of links, your site won't be competitive in the SERPs — even if you do everything else right. But building your first few links can be difficult and discouraging, especially for new websites. Never fear — Rand is here to share three relatively quick, easy, and tool-free (read: actually free) methods to build that solid base and earn yourself links. Click on the whiteboard image above to open a high-resolution version in a new tab! Video TranscriptionHowdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week we're going to chat about how to get those first few links that every website needs to be able to compete. Many folks I know when you get started with link building, it can seem daunting and overwhelming. So let me walk you through what is essentially a half a day of work, maybe three or four hours of work to try these three tactics that will almost certainly get your business or your organization the first handful, let's say 50 links that you need to start being able to compete. Content can you take you a long way. Keywords can take you a long way. Engagement and interaction can take you a long way. But you've got to have a base of links. So let's get started here. #1. Your brand name, domain name, and founder's/execs namesThe first one is basically looking for links that come from your own name, your brand name, your domain name potentially, and the names of the founders or people who run your company. Step One: Search Google for the names in quotes. So if it was me and Moz, you'd be searching for \"Rand Fishkin\" or \"Moz.com\" in quotes, not the domain name in the URL field. But in the Google search bar, I'd be searching for \"Moz.com\" in quotes or \"Moz + SEO.\" Moz also has other meanings, including the singer Morrissey, which makes for confusing types of things. If you have that, you'll need to use your brand name plus some sort of signifier or identifier. It's very rare that Morrissey gets mentioned along with search engine optimization. It's very often that Moz gets mentioned along with SEO, and so I can combine those to search for it. So any of these searches will result in a big list of tons of Google results. Step Two: Manually check the top let's say 50 to 100 results to confirm that... They link to the right place, and if they don't, if there are mentions of Rand Fishkin that don't link to Moz, we should fix that. We're going to contact those people. If you can control the anchor text and where the link location points, you can update it. For example, I can go to my LinkedIn. My LinkedIn has a link to Moz. I could update that if I were at a different company or if Moz's domain name changed, for example when it did change from SEOmoz to just Moz. If it's missing or wrong, I find the right people, I email them, and I fix it. As a result, I should have something like this. Every single mention in Google has a link on the page to my website. I can get that from brand name, from domain name, and from founders and executives. That's a lot of great links. #2. Sites that list your competitionSo this is essentially saying we're going to... Step One: Identify your top 5 or 10 most visible on the web competitors. This is a process that you can go through on your own to identify, well, these are the 5 or 10 that we see on the web very frequently for searches that we wish we competed for, or we see them mentioned in the press a ton, whatever it is. Step Two: Search Google not for each one individually, but rather for combinations, usually two, three, or four of them all together. For example, if I were making a new whiteboard pen company, I would look for the existing ones, like Pilot and Expo and Quartet and PandaBoard. I might search for Pilot and PandaBoard first. Then I might search for Pilot and Expo. Then I might search for PandaBoard and Quartet and all these various combinations of these different ones. Step Three: Visit any sites in the SERPs that list multiple competitors in any sort of format (a directory structure, comparisons, a list, etc.)Then in each of those cases, I would submit or I would try and contact or get in touch with whoever runs that list and say, \"Hey, my company, my organization also belongs on here because, like these other ones you've listed, we do the same thing.\" So if it's here's whiteboard pen brands, Expo, PandaBoard, Quartet, and your site, which should now link to YourSite.com. This is a little more challenging. You won't have as high a hit rate as you will with your own brand names. But again, great way to expand your link portfolio. You can usually almost always get 20 or 30 different sites that are listing people in your field and get on those lists. #3. Sites that list people/orgs in your field, your geography, with your attributes.This is sites that list people or organizations in a particular field, a particular region, with particular attributes, or some combination of those three. So they're saying here are European-based whiteboard pen manufacturers or European-based manufacturers who were founded by women. So you can say, \"Aha, that's a unique attribute, that's a geography, and that's my field. I'm in manufacturing. I make whiteboard pens. Our cofounder was a woman, and we are in Europe. So therefore we count in all three of those. We should be on that list.\" You're looking for lists like these, which might not list your competitors, but are high-quality opportunities to get good links. Step One: List your organization's areas of operation. So that would be like we are in technology, or we're in manufacturing or software or services, or we're a utility, or we're finance tech, or whatever we are. You can start from macro and go down to micro at each of those levels. List your geography in the same format from macro to micro. You want to go as broad as continent, for example Europe, down to country, region, county, city, even neighborhood. There are websites that list, \"Oh, well, these are startups that are based in Ballard, Seattle, Washington in the United States in North America.\" So you go, \"Okay, I can fit in there.\" List your unique attributes. Were you founded by someone whose attributes are different than normal? Moz, obviously my cofounder was my mom, Gillian. So Moz is a cofounded-by-a-woman company. Are you eco-friendly? Maybe you buy carbon credits to offset, or maybe you have a very eco-friendly energy policy. Or you have committed to donating to charity, like Salesforce has. Or you have an all-remote team. Or maybe you're very GLBTQIA-friendly. Or you have a very generous family leave policy. Whatever interesting attributes there are about you, you can list those and then you can combine them. Step Two: Search Google for lists of businesses or websites or organizations that have some of these attributes in your region or with your focus. For example, Washington state venture-backed companies. Moz is a venture-backed company, so I could potentially get on that list. Or the EU-based manufacturing companies started by women, and I could get on that list with my whiteboard pen company based there. You can find lots and lots of these if you sort of take from your list, start searching Google and discover those results. You'll use the same process you did here. You know what the great thing about all three of these is? No tools required. You don't have to pay for a single tool. You don't have to worry about Domain Authority. You don't have to worry about any sort of link qualification process or paying for something expensive. You can do this manually by yourself with Google as your only tool, and that will get you some of those first early links. If you've got additional suggestions, please leave them down in the comments. I look forward to chatting with you there. We'll see you again next week for another edition of Whiteboard Friday. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The 3 Easiest Link Building Tactics Any Website Can Use to Acquire Their First 50 Links"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The 3 Easiest Link Building Tactics Any Website Can Use to Acquire Their First 50 Links"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "#1. Your brand name, domain name, and founder's/execs names"
    },
    {
      "level": "H3",
      "text": "Step One: Search Google for the names in quotes."
    },
    {
      "level": "H3",
      "text": "Step Two: Manually check the top let's say 50 to 100 results to confirm that..."
    },
    {
      "level": "H2",
      "text": "#2. Sites that list your competition"
    },
    {
      "level": "H3",
      "text": "Step One: Identify your top 5 or 10 most visible on the web competitors."
    },
    {
      "level": "H3",
      "text": "Step Two: Search Google not for each one individually, but rather for combinations, usually two, three, or four of them all together."
    },
    {
      "level": "H3",
      "text": "Step Three: Visit any sites in the SERPs that list multiple competitors in any sort of format (a directory structure, comparisons, a list, etc.)"
    },
    {
      "level": "H2",
      "text": "#3. Sites that list people/orgs in your field, your geography, with your attributes."
    },
    {
      "level": "H3",
      "text": "Step One:"
    },
    {
      "level": "H3",
      "text": "Step Two: Search Google for lists of businesses or websites or organizations that have some of these attributes in your region or with your focus."
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}