{
  "url": "https://moz.com/blog/link-opportunities-beyond-bloggers",
  "slug": "link-opportunities-beyond-bloggers",
  "title": "The World of Link Opportunities Beyond Bloggers - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Most link profiles include a majority of links earned from blogs. Especially given the recent controversy surrounding guest blogging, it's wise to diversify that portfolio, and this post shows you many ways to do so.",
  "content": "The World of Link Opportunities Beyond Bloggers Link Building By: James Agate May 7, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: James Agate May 7, 2014 The World of Link Opportunities Beyond Bloggers Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. There is an awful lot of controversy going around for things like guest posts, with techniques being proclaimed dead and blogs being decreed toxic, but the fact remains that if you handle blogger outreach in the right way, you can get a tremendous amount of value from blogs. Targeted audiences, run by passionate and receptive bloggers; these types of opportunities shouldn't be discounted. If you take a step back from your link profile, it is very likely to be heavily weighted towards blogs, whether that be as a result of guest posts, editorial mentions, competitions, or just about anything else. However, while all of the above add value (broadly speaking), they point to a link profile that looks skewed toward just one type of website. Links from blogs can be overcooked, and the reality of being an SEO in 2014 is that it is always wise to diversify the ways in which you get links—irrespective of which color hat you think you wear. You need to be proactive about what your link profile looks like. We've probably all recently seen instances of overly harsh penalties, websites that looked whiter than white (especially in relation to competitors) getting spanked. I've seen instances of sites getting hit that didn't even look like they cared all that much about SEO, and yet someone at Google arbitrarily decided they had fallen afoul of guidelines. Do I think Google is crazy? Sometimes, yes. But I'm not here to complain, because frankly it's their playground, so I guess we all need to learn to live in it and determine ways to make the most of it—or face the consequences. My point is we all have to think carefully about the things we do (even if they don't at first appear to impact SEO) and what knock-on effect that is likely to have. This especially applies when it comes to content generation and building links. It is easier to get bogged down in the day-to-day and think you are diversifying your link profile because you have a variety of blogs or because you are using different means to connect with bloggers, but from a bot's point of view those links probably all look quite similar. Here are just some of the wealth of link opportunities that are out there in almost every market: Resource pages Forums Directories Professional organizations Events Submission-based Press The sad thing is that at least one person reading this can probably find one instance of each of the above links being mentioned by someone at Google as \"unnatural.\" That being said, all of the above, if done right, are highly defensible and would pass the litmus test of \"would I still want this if Google didn't exist?\"Targeted acquisition The problem (actually, the opportunity, because it means fewer people will bother) is that there isn't usually a surefire step-by-step to finding these types of opportunities; the process can be quite serendipitous. I know that sounds like fluffy nonsense but there is no substitute for really getting to know a client and their market. This is why we often save this kind of activity for several months into an engagement: That is when some of the really golden opportunities seem to appear—after a few conversations with your contact, some research for a content piece, etc. It is also likely that opportunities are limited in certain markets. There's nearly always another link opportunity out there, but to be brutally truthful this process isn't going to be easy, and it isn't going to be one of those things where you can suddenly make it rain links. In most cases we have found markets to be a series of rabbit holes with niches, sub-niches, sub-sub-niches,etc.—the internet is HUGE, and if you are just focusing on \"Keyword\" + \"Write for us\" in your link prospecting, then you are leaving a world of opportunities on the table.Resource pages This type of opportunity is likely to form the foundation of any proactive \"blogless\" link building campaign because there are so many resource page opportunities out there. You can really shoot for the stars with this technique, though and we've secured placements on government, academic, and top-tier websites like About.com. I must stress that this isn't always an easy sell, because these types of websites don't link to just anyone so you'll need to adjust your expectations accordingly particularly if your business or client has only a small amount of value to offer outside of its usual commercial enterprise. It probably doesn't surprise you that these types of websites care very little for link-baity stuff. :-) A common mistake is to adopt the mindset of \"I have made this guide on {keyword}, it is really {useful | interesting | identical to everything else on your resource list} and so should be included on your page because it will be good for {your audience | me}\". You either need something completely new that brings diversity to that resource page, or you need to sell the webmaster on the asset you are asking them to link to. A common approach we adopt is to utilize an existing client asset and then look for multiple angles depending on the type of resource page you are targeting. If you think about, a governmental website, they want to help local citizens, so content about things like public safety is of interest to them. However, there is no incentive for them to link if they've already got three guides to the issue you are talking about. If you can find one governmental site that has a section on a specific public issue, though, you can use that in your pitch to another website, offering them a reason to link (because it rounds out their offering to their local citizens). In terms of finding these kinds of opportunities, there are two main ways we do this: Digging through an existing link profile (the client's or a competitor's) and extrapolating the tactic from there Surfacing (often) hundreds of opportunities using a combination of prospecting phrases that include a variation of resource, help, further reading, and the keywordForums Who would have thought a type of link usually reserved for the spammer could be valuable? Well, a number of our clients enjoy mountains of traffic from targeted forums; in fact, in some cases they are the biggest referrers. Naturally I am talking about the client adding value to the forum, or in most cases (this is easier if you don't have the client industry expertise and the client doesn't have the inclination) encouraging conversations about the client within the forum. Tread carefully, as most forums don't take all that kindly to marketers poking their noses in, but with a modicum of client participation you may be able to join a conversation and highlight a piece of content on the client's site. By doing so, you might just \"turn on\" the forum to the wealth of useful content you probably already have there. Our participation in forums is often content-led, and it is a very low-volume tactic, as there are often only a handful of worthwhile forums in the industry you are looking at.Directories A recent study found most web directories are dead, and I wouldn't disagree that most are simply live so they can charge for removal of links. Leaving this type of directory aside, there are a wealth of industry directories and localized business directories that real people actually use. These are the types of listings where you can get phone calls. Regardless of what you think of directories as a link type, that to me is a defensible link that is worthwhile irrespective of whether it is going to have an impact on your rankings. The US is a gold mine of link opportunities like this, with directories for cities that are relatively easy to get listed on and can actually generate calls and new business. If you are in the travel industry, for example, where people who don't know the area need to book a car service from the airport, they might use a site like SantaMonica.com to find a provider. There is that perceived credibility of being listed in what is an authoritative site in the area. How do we go about finding them? The Link Prospector tool from Citation Labs is very useful in surfacing these types of opportunities if you use a combination of local and niche-specific phrases. If you don't want to subscribe to the Link Prospector tool, then it is easy enough (albeit less automated) to do generic searches that include a combination of keywords or geographical locations and the directories themselves often show up. I actually prefer the manual method, as it allows for more serendipitous opportunities to present themselves.Professional organizations There won't be all that many, but as with directories you want to be thinking in terms of niche and location as well as a combination of the two. Especially in the US, there are a wealth of opportunities with local chapters of organizations that you or your client could join. There is often a cost involved with joining these professional organizations (at least the worthwhile ones), but the credibility associated with it and often the other business benefits for the client hugely outweigh the cost. We've been frequently surprised at how often a client is already paying a subscription fee for a membership that entitles them to a listing but they've simply never claimed it! These are very quick and easy wins, granted the impact isn't necessarily going to be life-changing. To find these kinds of organizations, again the Link Prospector tool is very useful if you need a quick and easy way to find these opportunities. You might find this list useful (albeit a little user unfriendly to navigate) as many trade publications have a corresponding association. Not always, but hey, it is still a useful resource if you want to find out about trade press.Events I strongly suggest you read this blog post on Link Building with Local Events by Kane Jamison from 2012. There is very little I can add to this specific topic that Kane hasn't already covered, but a few specific points are worth repeating: First, why would we want these links? Well, you are likely to be getting links on domains that are otherwise hard to get even a citation from, let alone a link, websites like well-respected news outlets. Similarly the links are geographically specific, there is nothing more difficult than obtaining links from blogs within a certain geographical area, because the pool is often really small. So when it comes to \"blogless\" link building, it is nice to add that local element to your profile, and event-based link building can really help with that. Secondly, think about the whole process when it comes to event-based link building, because there is more to it than just the \"submission to the event section.\" You need to consider how you structure the event pages on your website as well as selecting the right ticketing provider (e.g. Eventbrite) for maximum SEO-related benefits (and frankly to ensure a seamless experience for any attendees). Finally, consider all the angles for leveraging your event for link building goodness, from typical search queries that uncover submission opportunities to looking for footprints within event widgets.Submission-based This is an excellent way to maximize the reach of content either through finding or repurposing for a new audience. This guide, whilst painfully cringe-worthy in its analogy to food, is a mostly useful guide to repurposing your content. I am talking about worthwhile submission-based link opportunities here, though, whether that be making a presentation from a guide to go onto Slideshare or just submitting a podcast to the relevant directory. This is less about the resulting link (Google knows these aren't exactly tightly editorially controlled), but you can effectively plug into an audience that you didn't already have access to. I still get milestone notifications of a guide I wrote for eHow nearly five years ago. I'm actually a little embarrassed about the content so really must get around to updating it but that has had over 10,000 pageviews since it launched. I accept that's not viral traffic, but it was an extract of a longer piece on my site, and I linked my guide in the section beneath. My guide has subsequently had just over 4,000 visits since the eHow extract was published, which is almost certainly a lot more eyeballs than it would have gotten just sitting on one of my websites. Eric Ward is a big proponent of submitting content to different places; many of the Link Opportunity Alerts that you find in his LinkMoses newsletter service are submission-based, but often niche-specific and have a large audience or carry some real credibility. Press coverage Is doing PR a challenge as an SEO? Absolutely. It isn't always an option, because if your client has a PR department or existing agency you might just end up crunching toes. On the flipside, however, we as SEOs are often far better at actually getting the link than a PR exec might be. We've achieved coverage for clients on TV networks, offline magazines, radio interviews—lots of great things that any PR agency would be proud of, and that started as a way for us to build some links! The thing we have found is that most press opportunities present themselves and you have to be a bit reactive (or real-time) rather than proactively seeking coverage. We have also found some success in looking at how and why clients (and their competitors) have been covered in the past. Go into this with an open mind—I couldn't believe when we found one of our clients had received coverage for the release of a product brochure; my initial thought would have been \"who actually cares besides the owner of the business that our client has released a new product brochure??!\"... turns out the trade press cared, and would happily cover it. In situations like that you find an asset which even the best of us would have dismissed as little more than sales fodder that can actually be used effectively to garner links. Incidentally, I would be interested to hear your experience gaining press coverage with services like HARO. We've probably had 4 successful pieces of coverage from HARO pitches, and while you could argue our targeting was off, our pitch was poor, or the client wasn't a good fit, we've got coverage for those exact same clients through all sorts of other means so it truly baffles me when I see other people cite HARO as though it's a push-button way of getting publicity. Maybe we're doing it wrong, or maybe it's just inundated since all SEOs on planet Earth started using it. Who knows?A walkthrough It is often easy to illustrate a point with an example, so I wanted to do a quick runthrough of what we might do if we were to handle link building for Ontraport, a small business CRM provider. These guys aren't a client, and were selected at random after going through a list of a few of our providers (we use them for email auto-responders among many other things) I thoroughly recommend their software, but I digress. Let's look at the assets they already have that we might be able to work with... http://ontraport.com/ The software itself is likely to appeal to small business owners, seeing as it has been designed with them in mind. From a link building point of view, we might struggle given that there isn't a free version of the tool, but as a \"suggested tool\" on a small business website we might have an angle. The better angle here is that the company is itself a \"small business\" success story (or at least sort of small; they've featured on the INC500 list and Forbes Most Promising Companies). http://ontraport.com/women/ This one is buried in their footer, I actually found it digging through their link profile, but it is a sign-up page to join an online community for women in business. Ontraport's COO is a woman named Lena Requist and she wanted to create \"The Professionistas\" to be a community within the wider Ontraport community. It is such a great idea, and is likely to be a valuable asset for any link building campaign. http://ontraport.com/community-meetups/ This provides details on all their forthcoming in-person meetups. Loads of potential link building angles here. http://ontrapalooza.com Their annual event which seems to work a bit like MozCon. I saw details of the event last year but didn't actually attend, and there are opportunities aplenty with a large-scale event like this. Here are just some of the opportunities I came up with after little more than 10 minutes of research: The founder of Ontraport did an interview on Mixergy a while back, how about reaching out to BusinessInterviews.com? SBA.gov helped me find an office that supports female business owners that is local to Ontraport and that office has a resource page. The National Association for Female Executives has setup a page to help guide female executives in their career here. Perhaps Ontraport's Professionista community for women would be a good addition for any women looking to strike out on their own as a means of furthering their career? Their forthcoming in-person meetup in Santa Monica is likely to be of interest to the Santa Monica Chamber of Commerce in their business event listings: http://members.smchamber.com/events/ The Annual Ontrapalooza event I mentioned was held in Santa Barbara last year, so how about telling local residents about it and getting a link in the process? You can submit event details to the Santa Barbara Independent events section (granted most listings are aimed at general public but there are some specialist events in the calendar).Conclusion Ultimately you need diversity in the link building that you do. Many of the tactics described above are low-volume, high-value so are worth investing a bit more time in. Can you build a process around them? Yes, but it is likely to be more of a framework or alternatively very industry-specific because there are so many nuances hence why I haven't provided a step-by-step. I don't think that you should consider blogger outreach or links from blogs to be dead, but as with anything in SEO, there is such a thing as too much of something good. Hammering away at one tactic because that's what's cheap or in your comfort zone is only going to get you so far. I'd love to hear thoughts in the comments below, particularly success stories with \"less common\" types of links. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The World of Link Opportunities Beyond Bloggers"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The World of Link Opportunities Beyond Bloggers"
    },
    {
      "level": "H2",
      "text": "Targeted acquisition"
    },
    {
      "level": "H3",
      "text": "Resource pages"
    },
    {
      "level": "H3",
      "text": "Forums"
    },
    {
      "level": "H3",
      "text": "Directories"
    },
    {
      "level": "H3",
      "text": "Professional organizations"
    },
    {
      "level": "H3",
      "text": "Events"
    },
    {
      "level": "H3",
      "text": "Submission-based"
    },
    {
      "level": "H3",
      "text": "Press coverage"
    },
    {
      "level": "H2",
      "text": "A walkthrough"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "James Agate\n          \n            James Agate\n          \n            James Agate"
}