{
  "url": "https://moz.com/blog/link-navigation-tracking-system",
  "slug": "link-navigation-tracking-system",
  "title": "Link Navigation Tracking System - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Whitemark posted at Cre8asite about a system that uses link navigation tracking, sim...",
  "content": "Link Navigation Tracking System SEO Analytics By: Rand Fishkin February 24, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 24, 2006 Link Navigation Tracking System SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Whitemark posted at Cre8asite about a system that uses link navigation tracking, similiar to the mybloglog software you see here at SEOmoz. But, rather than showing each links popularity as it's hovered on, it asks the user to hit \"ctrl+x\" to view the nav percentages for each visible link on the page. It's a very spiffy system and as the writer, Glenn Jones, has made it openly available, anyone can copy and modify to their heart's content. I foresee a day very soon when the best analytics software is available entirely free through developers like this. I only wish we had the time and staff to manage it. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Link Navigation Tracking System"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Link Navigation Tracking System"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}