{
  "url": "https://moz.com/blog/link-building-101-the-almost-complete-link-guide-updated-for-post-penguin",
  "slug": "link-building-101-the-almost-complete-link-guide-updated-for-post-penguin",
  "title": "Link Building 101 - The Almost Complete Link Guide (Updated for Post-Penguin) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Quite a few things have changed in my approach to link building since my first link building guide back in 2010. One thing that hasn’t changed is my view that 80% of positive (and negative) SEO ranking factors still come from external sources – I’m not just talking about links here, but social and…",
  "content": "Link Building 101 - The Almost Complete Link Guide (Updated for Post-Penguin) Link Building S By: Scott McLay November 29, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! S By: Scott McLay November 29, 2012 Link Building 101 - The Almost Complete Link Guide (Updated for Post-Penguin) Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Quite a few things have changed in my approach to link building since my first link building guide back in 2010. For starters, there was a mass of link based algorithm updates, there was Penguin, and to top this all off I’ve changed jobs as well (you can find me amongst the masses here these days). One thing that hasn’t changed is my view that 80% of positive (and negative) SEO ranking factors still come from external sources – I’m not just talking about links here, but social and citations, also. Once again, most of the information I’m giving away here will most likely be available from a large number of other sources including SEOmoz, so I will try to attribute these where I can. Creating your Link Building Strategy Creating a solid strategy should be the starting point for any link building campaign, not having one in the current climate would be like running into a minefield wearing a blindfold – It limits your success of survival! Before you set out on any strategy you need to ask yourself questions like the following: What does the current profile look like? (if existing website) Do I need to remove links before I start? Do I need to gain authority or noise? Do I actually need more links or would I benefit from other factors? How will I generate the links? Should I run creative projects such as Infographics? Should I do blogger outreach / guest posts? Should I suggest webmasters replace broken links with my client? How will I reach out to webmasters? Social networks? Networking events? Telephone? Email? What type of anchor text should I work with? Is there enough covering fire from brand and phrase anchor text? What would Google’s web spam team look for during manual reviews? What type of anchor text would look most natural for the sites you want to target? Is there enough supporting pages for the landing page or should more be created? Every website is different so no two people will have the same answers to these types of questions but hopefully it will give you a good starting point – just remember to document and track everything. Link Placement Since my last post a few changes have been made to how Google views link placement, back in 2010 I hinted that footer links still had some sort of value, since Panda and Penguin link placement in the footers and even sidebars could cause more damage than good and could leave you with either Keywords being filtered or even penalised in the SERPs. These days the safest form of link building is gaining links from within content, even better if you can get these within the first paragraph – but remember to keep it looking natural. Nofollow and Dofollow Links Two years ago I was going on about how every website should have a good mix of Nofollow links and while this is still true I have been asked countless times what ratios I use when working on a link campaign. The truth is there is no hard figure I can give you, although what you can do is research the average nofollow vs. dofollow ratios for the top ranking websites in your niche, just ignore spam websites while doing this as these will inflate the end number. Branded Links I still believe that Google have their own authority and trust metrics which attribute to Google’s internal PageRank algorithm (not talking about TBPR here but true PageRank) or if not this then some subroutine which feeds back into the ranking algorithm. With this in mind it is very important that you gain Brand links to not only your homepage but to landing pages across your entire website. Keyword-Focused Anchor Text Over the years every SEO has built his/her fair share of anchor text rich links, sadly this isn’t a feasible strategy since Google introduced automated keyword filters and even more so since Penguin came along. Anchor text profiles are something which is even reviewed manually by the spam team – this was confirmed by Andre Weyher, an ex-member of the Search Quality team at Google. If you haven’t read the interview with Andre then do so now you can find it here. Landing Page Distribution At the strategy creation stage ensure you set clear volume levels for each landing page being targeted to ensure that a particular section of the website does not become over-weighted as this could be a hard issue to fix. If you’re worried about volume of links going into pages the best option is to create additional supporting pages for each area and use these to spread out the load. Content Quality and Relevancy With Google’s unnatural link detection getting better and better and Panda penalising low quality content, I can’t stress how important it is to not only put effort into content generation but checking the quality of existing content on a website before even thinking about publishing an article. The last thing you want is to find the website you have just spent an hour or so writing a post for has been penalised and that post has no value to either users or search engines. Try to keep the end user in mind when writing content. You not only want links to increase rankings, but to send traffic as well to provide a subtle call to action either within the anchor text or before the link without being too sales-focused. Also, keep the content not only on topic for your client's site but on topic to the website your publishing to. Sourcing Links In the current climate there should be less focus on sourcing links and more on generating them. This is a topic which Rand has been going on about for a long time now (he has been ahead of the curve) but at the same time it takes time to get to the stage where you are generating enough links to make a difference to your client's campaign. In the short term clients still want results so there will still be a need for sourcing links the old-school way. Getting to grips with finding relevant websites and webmaster outreach can take a bit of work; here are some of the tools I use for the job: Open Site Explorer (Free / SEOmoz Pro Members) OSE How to Use OSE Majestic SEO (Paid from £29.99 ex VAT) Majestic SEO Using Majestic SEO for Competitor Analysis Advanced Search Operators in Google (Free) How Search Operators Work NP Checker – (Free Software Download) NP Checker Download Overview of NP Checker Mozilla Thunderbird (Free) Thunderbird Download How to Mass Email with Thunderbird Competitor Backlink Mining When initially starting out with sourcing links it is worth reviewing what links your competitors have. While this will not help you overtake them, it will help you close the gap or add that extra dimension to your link profile. Just be wary when doing this not to go after their lower quality links but stick to the highest quality to ensure you don’t get yourself in hot water with the Google gods. Advanced Search Operators The best way to get ahead of your competitors in terms of manual link building is still to come up with creative link advanced search operator queries and scour the depths of the web. When coming up with these queries I do research on my topic using websites like Wikipedia to gain knowledge on related topics. After two years my recommended query is still the same and has helped me gain some valuable links that I wouldn’t have found otherwise: [search term] -site:Wikipedia.org -site:blogspot.com -site:telegraph.co.uk -site:wordpress.com -site:about.com -site:guardian.co.uk -\"directory\" -\"add link\" -\"advertising\" This string does not work for every single niche and you may have to experiment with filtering out additional domains from your search (those that show up often). Directories This form of link building sadly is no longer as effective as it once was, so I don’t recommend you spend too much time on this. But, it is still worth investing some time into submitting websites into well-known/authority directories like BOTW and established, smaller niche directories as these can add a small boost to any link campaign. Blog and Forum Commenting All I can say here is don’t do it, no matter how hard you try it will still end up looking like spam, instead use this a way of engaging with the community to gain other link opportunities. Creative Link Building Looking into the future, the only viable way to safely get more links pointing to your website will be via content marketing. I myself have been a slow adopter of this way of thinking and missed the whole infographic and widgets craze that have been called out by Google as being 'unnatural'. As off-site SEO moves ever closer to being like offline marketing we need to be thinking as marketers and do the following to generate links: Create ‘good news’ stories Create external resources Create interactive properties (like Conflict of Pintrest) Create content that reaches out to your target demographic Sit down face to face with bloggers and find out what they really want But above all you need to ensure all projects are in line with the client's Brand or they might go somewhere else. Guest Blogging Communities Guest blogging communities are full of bloggers looking for free content; these can be used not just for link building campaigns but for promoting more creative projects as well. When using these types of services just ensure you keep a firm eye on the quality of the blogs being offered as although there are quite a few gems, spam websites heavily outweigh these. Some of the services I have used previously include: Blogdash (Free to Join & Browse, Pay to Contact) Bloggerlinkup (Free) Guestr (Free) MyBlogGuest (Free) Link Removal With all this talk of penguins and negative SEO over the last year, chances are that a majority of SEOs have had to undertake backlink health checks to see if their clients are at risk. The unlucky ones within the industry may have had to actually remove links. Link removal itself is not a hard task but it does take quite a bit of time, in particular finding contact details. If you want to save yourself a bit of time I would recommend using Link Research Tools as it does a pretty good job of analysing your profile and even provides some email address data but if you require more detailed analysis you will require the following: Majestic SEO NP Checker Mozilla Thunderbird MS Excel skills Loads of time If you are going to do manual analysis an your profile I am currently working on an Excel document to do most of the work for me – I will be tweeting a link to it when it’s finished so follow me on twitter if you’re interested. Email Outreach Initial Outreach remains one of the hardest tasks within the link building process. Why? Because you generally only get one chance to get it right. Of course you could just re-email everyone who didn’t reply but this tactic could soon see you in hot water unless you use multiple fronts. To get higher response rates with outreach you need to ensure you are doing the following: Personalisation Interact with them i.e. asking about their day/week Keep your request brief Use a female persona Email on a Friday Don’t forget that you can also do personalised bulk emails to save you time. Alternative Outreach If you’re looking for quality over quantity then sending out email templates isn’t going to cut it, you need to get yourself noticed in other ways to get the links that really matter. One of the easiest ways to get yourself on the radar of a high profile publisher / webmaster is to interact with them over Twitter. Follow them for a while and look at the types of mentions they reply to before making your move. It may take a few tries to get this spot on but once you get the hang of it you should be able to strike up conversations at will and then potentially move the subject on what you can do to help them and vice versa. Something else you can use Twitter conversations for is to arrange to meet your target for drinks at a conference, usually if you manage to bag one high profile publisher within a niche other publishers will come and join in the conversation free of will – a great way to get yourself known and build lasting relationships. Tracking Progress Since link building has become a more dangerous task you should be tracking each link built along with metrics, anchor text and the landing page the link points to. This data can be used to track progress, check metrics over time (checking back looking for sites gaining penalties) or looking out for overweighting specific parts of your client’s website. At the end of the day the more data we track the better chance we have of spotting potential issues and getting them fixed quickly, most likely saving your client from future ranking issues. You can find a basic example of one I use currently over here. What Does the Future Hold? Looking at the direction Google has been taken over the last year, it has become very clear that they have started cracking down on a large number of unnatural linking activities -- but as I mentioned that does not mean we need to step away from traditional link building. At the end of the day if you use traditional techniques to find your targets then get out of the office and build relationships with your niche, you have a better chance of getting not only links that will impact your search rankings but start to build a connection between the publishers and the brand -- which in turn will look natural to both algorithms and the human eye, especially if you use news stories and trends as a basis for your external content. I hope you have enjoyed my updated link building 101. You can read more of my stuff either on my personal blog, Equators blog or just watch my personal twitter account. I look forward to reading your comments. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Link Building 101 - The Almost Complete Link Guide (Updated for Post-Penguin)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Link Building 101 - The Almost Complete Link Guide (Updated for Post-Penguin)"
    },
    {
      "level": "H2",
      "text": "Creating your Link Building Strategy"
    },
    {
      "level": "H3",
      "text": "Link Placement"
    },
    {
      "level": "H3",
      "text": "Nofollow and Dofollow Links"
    },
    {
      "level": "H3",
      "text": "Branded Links"
    },
    {
      "level": "H3",
      "text": "Keyword-Focused Anchor Text"
    },
    {
      "level": "H3",
      "text": "Landing Page Distribution"
    },
    {
      "level": "H3",
      "text": "Content Quality and Relevancy"
    },
    {
      "level": "H2",
      "text": "Sourcing Links"
    },
    {
      "level": "H3",
      "text": "Competitor Backlink Mining"
    },
    {
      "level": "H3",
      "text": "Advanced Search Operators"
    },
    {
      "level": "H3",
      "text": "Directories"
    },
    {
      "level": "H3",
      "text": "Blog and Forum Commenting"
    },
    {
      "level": "H3",
      "text": "Creative Link Building"
    },
    {
      "level": "H3",
      "text": "Guest Blogging Communities"
    },
    {
      "level": "H3",
      "text": "Link Removal"
    },
    {
      "level": "H3",
      "text": "Email Outreach"
    },
    {
      "level": "H3",
      "text": "Alternative Outreach"
    },
    {
      "level": "H2",
      "text": "Tracking Progress"
    },
    {
      "level": "H2",
      "text": "What Does the Future Hold?"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Scott McLay\n          \n            Scott McLay"
}