{
  "url": "https://moz.com/blog/link-relevance-seo",
  "slug": "link-relevance-seo",
  "title": "Topical SEO: 7 Concepts of Link Relevance & Google Rankings - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "To rank in Google, it’s not simply the number of votes you receive from popular pages, but the relevance and authority of those links as well.",
  "content": "Topical SEO: 7 Concepts of Link Relevance & Google Rankings Advanced SEO | On-page SEO | Link Building By: Cyrus Shepard April 1, 2019 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Cyrus Shepard April 1, 2019 Topical SEO: 7 Concepts of Link Relevance & Google Rankings Advanced SEO | On-page SEO | Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Links matter for SEO. A lot. Most marketers understand that links to websites count as “votes” on the web. Google — and other search engines — use these votes to rank web pages in search results. The more votes a page accumulates, the better that page’s chances of ranking in search results. This is the popularity part of Google’s algorithm, described in the original PageRank patent. But Google doesn’t stop at using links for popularity. They’ve invented a number of clever ways to use links to determine relevance and authority — i.e. what is this page about and is it a trusted answer for the user’s search query? To rank in Google, it’s not simply the number of votes you receive from popular pages, but the relevance and authority of those links as well. The principals Google may use grow complex quickly, but we’ve included a number of simple ways to leverage these strategies for more relevant rankings at the bottom of the post. 1. Anchor text In the beginning, there was the original PageRank patent, which changed the way search engines worked. It talked about anchor text a lot: “Thus, even though the text of the document itself may not match the search terms, if the document is cited by documents whose titles or backlink anchor text match the search terms, the document will be considered a match.” In a nutshell, if a page links to you using the anchor text \"hipster pizza,\" there's a good chance your page is about pizza — and maybe hipsters. If many pages link to you using variations of “pizza”— i.e. pizza restaurant, pizza delivery, Seattle pizza — then Google can see this as a strong ranking signal.(In fact, so powerful is this effect, that if you search Google for “hipster pizza” here in Seattle, you’ll see our target for the link above ranking on the first page.) How to leverage Anchor Text for SEO: Volumes could be written on this topic. Google’s own SEO Starter Guide recommends a number of anchor text best practices, among them: Use (and seek) descriptive anchor text that describes what your page is aboutAvoid generic anchor text, off-topic anchor textKeep anchor text concise - no more than a few words While some Google patents discuss ignoring links with irrelevant anchor text, other Google patents propose looking at the text surrounding the anchor text for additional context, so keep that in mind. A word of caution: While optimizing your anchor text is good, many SEOs over the years have observed that too much of a good thing can hurt you. Natural anchor text on the web is naturally varied. Check out the variety of anchor text to Moz’s page on Domain Authority, illustrated here using Link Explorer. Over-optimization can signal manipulation to Google, and many SEOs recommend a strategy of anchor text variety for better rankings. Additional Resources: All About Anchor TextAnalyzing Anchor Text with Link Explorer 2. Hub and authority pages In the early days of Google, not long after Larry Page figured out how to rank pages based on popularity, the Hilltop algorithm worked out how to rank pages on authority. It accomplished this by looking for \"expert\" pages linking to them. An expert page is a document that links to many other topically relevant pages. If a page is linked to from several expert pages, then it is considered an authority on that topic and may rank higher. A similar concept using \"hub\" and \"authority\" pages was put forth by Jon Kleinberg, a Cornell professor with grants from Google and other search engines. Kleinberg explains: \"...a good hub is a page that points to many good authorities; a good authority is a page that is pointed to by many good hubs.”– Authoritative Sources in a Hyperlinked Environment (PDF) While we can't know the degree to which these concepts are used today, Google acquired the Hilltop algorithm in 2003. How to leverage Authority Pages for SEO: A common practice of link builders today is to seek links from “Resource Pages.” These are basically Hub/Expert pages that link out to helpful sites around a topic. Scoring links on these pages can often help you a ton. Additional Resources: Resource Page Link Building 3. Reasonable Surfer All links are not created equal. The idea behind Google's Reasonable Surfer patent is that certain links on a page are more important than others, and thus assigned increase weight. Examples of more important links include: Prominent links, higher up in the HTMLTopically relevant links, related to both the source document and the target document. Conversely, less important links include: \"Terms of Service\" and footer linksBanner adsLinks unrelated to the document Because the important links are more likely to be clicked by a \"reasonable surfer,\" a topically relevant link can carry more weight than an off-topic one. \"...when a topical cluster associated with the source document is related to a topical cluster associated with the target document, the link has a higher probability of being selected than when the topical cluster associated with the source document is unrelated to the topical cluster associated with the target document.\"– United States Patent: 7716225 How to leverage Reasonable Surfer for SEO: The key with leveraging Reasonable Surfer for SEO is simply: work to obtain links that are more likely to get clicked. This means that you not only benefit from getting links from prominent areas of high-traffic pages, but the more relevant the link is to the topic of the hosting page, the more benefit it may provide. Neither page topics/anchor texts have to be an exact match, but it helps if they are in the same general area. For example, if you were writing about \"baseball,\" links with relevant anchor text from pages about sports, equipment, athletes, training, exercise, tourism, and more could all help boost rankings more than less relevant links. 4. Topic-sensitive PageRank Despite rumors to the contrary, PageRank is very much alive and well at Google. PageRank technology can be used to distribute all kinds of different ranking signals throughout a search index. While the most common examples are popularity and trust, another signal is topical relevance, as laid out in this paper by Taher Haveliwala, who went on to become a Google software engineer. The original concept works by grouping \"seed pages\" by topic (for example, the Politics section of the New York Times). Every link out from these pages passes on a small amount of Topic-Sensitive PageRank, which is passed on through the next set of links, and so on. In the example above, 2 identical pages target “Football”. Both have the same number of links, but the first one has more relevant Topic-Sensitive PageRank from a linking sports page. Hence, it ranks higher. How to leverage topic-sensitive PageRank for SEO: The concept is simple. When obtaining links, try to get links from pages that are about the same topic you want to rank for. Also, get links from pages that are themselves linked to by authoritative pages on the same topic. 5. Phrase-based indexing Phrase-based indexing can be a tough concept for SEOs to wrap their heads around. What's important to understand is that phrase-based indexing allows search engines to score the relevancy of any link by looking for related phrases in both the source and target pages. The more related phrases, the higher the score. In the example below, the first page with the anchor text link “US President” may carry more weight because the page also contains several other phrases related to “US President” and “John Adams.” In addition to ranking documents based on the most relevant links, phrase-based indexing allows search engines to consider less relevant links as well, including: Discounting spam and off-topic links: For example, an injected spam link to a gambling site from a page about cookie recipes will earn a very low outlink score based on relevancy and would carry less weight.Fighting \"Google Bombing\": For those that remember, Google bombing is the art of ranking a page highly for funny or politically-motivated phrases by \"bombing\" it with anchor text links, often unrelated to the page itself. Phrase-based indexing can stop Google bombing by scoring the links for relevance against the actual text on the page. This way, irrelevant links can be discounted. How to leverage phrased-based indexing for SEO: Beyond anchor text and the general topic/authority of a page, it’s helpful to seek links from pages with related phrases. This is especially helpful for on-page SEO and internal linking — when you optimize your own pages and link to yourself. Some people use LSI keywords for on-page optimization, though evidence that this helps SEO is disputed. Solid keyword research typically provides a starting point to identify related keyword phrases. Below are closely related phrases to “best SEO tools” found using Keyword Explorer. 6. Local inter-connectivity Local inter-connectivity refers to a reranking concept that reorders search results based on measuring how often each page is linked to by all the other pages. To put it simply, when a page is linked to from a number of high-ranking results, it is likely more relevant than a page with fewer links from the same set of results. This also provides a strong hint as to the types of links you should be seeking: pages that already rank highly for your target term. How to leverage local inter-connectivity for SEO: Quite simply, one of the easiest ways to rank is to obtain topically relevant links from sites that already rank for the term you are targeting. Oftentimes, links from page 1 results can be quite difficult to obtain, so it’s helpful to look for links that: Rank for variations of your target termsAre further down in Google’s results pagesRank well for different, but still topically-related terms 7. The golden question If the above concepts seem complex, the good news is you don't have to actually understand the above concepts when trying to build links to your site. To understand if a link is topically relevant to your site, simply ask yourself the golden question of link building: Will this link bring engaged, highly qualified visitors to my website? The result of the golden question is exactly what Google engineers are trying to determine when evaluating links, so you can arrive at a good end result without understanding the actual algorithms. How to leverage the golden question for SEO: Above all else, try to build links that bring engaged, high-value visitors to your site. If you don’t care about the visitors a link may bring, why should Google care highly about the link? SEO tips for topically relevant links Consider this advice when thinking about links for SEO: DO use good, descriptive anchor text for your links. This applies to internal links, outlinks to other sites, and links you seek from non-biased external sites.DO seek relationships from authoritative, topically relevant sites. These include sites that rank well for your target keyword and \"expert\" pages that link to many authority sites. (For those interested, Majestic has done some interesting work around Topical Trust Flow.)DO seek links from relevant pages. This includes examining the title, body, related phrases, and intent of the page to ensure its relevance to your target topic.DO seek links that people are likely to click. The ideal link is often both topically relevant and placed in a prominent position.AVOID generic or non-descriptive anchor text.AVOID over-optimizing your links. This includes repetitive use of exact match anchor text and keyword stuffing.AVOID manipulative link building. Marie Haynes has written an excellent explanation of the kinds of unnatural links that you likely want to avoid at all costs. Finally, DO try to earn and attract links to your site with high quality, topically relevant content. What are your best tips around topically relevant links? Let us know in the comments below! Note: A version of this post was published previously, and has since been substantially updated. Big thanks to Bill Slawski and his blog SEO by the Sea, which acted as a starting point of research for many of these concepts. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Topical SEO: 7 Concepts of Link Relevance & Google Rankings"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Topical SEO: 7 Concepts of Link Relevance & Google Rankings"
    },
    {
      "level": "H2",
      "text": "1. Anchor text"
    },
    {
      "level": "H3",
      "text": "How to leverage Anchor Text for SEO:"
    },
    {
      "level": "H2",
      "text": "2. Hub and authority pages"
    },
    {
      "level": "H3",
      "text": "How to leverage Authority Pages for SEO:"
    },
    {
      "level": "H2",
      "text": "3. Reasonable Surfer"
    },
    {
      "level": "H3",
      "text": "How to leverage Reasonable Surfer for SEO:"
    },
    {
      "level": "H2",
      "text": "4. Topic-sensitive PageRank"
    },
    {
      "level": "H3",
      "text": "How to leverage topic-sensitive PageRank for SEO:"
    },
    {
      "level": "H2",
      "text": "5. Phrase-based indexing"
    },
    {
      "level": "H3",
      "text": "How to leverage phrased-based indexing for SEO:"
    },
    {
      "level": "H2",
      "text": "6. Local inter-connectivity"
    },
    {
      "level": "H3",
      "text": "How to leverage local inter-connectivity for SEO:"
    },
    {
      "level": "H2",
      "text": "7. The golden question"
    },
    {
      "level": "H3",
      "text": "How to leverage the golden question for SEO:"
    },
    {
      "level": "H2",
      "text": "SEO tips for topically relevant links"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Cyrus Shepard\n          \n            Cyrus Shepard\n          \n            Cyrus Shepard"
}