{
  "url": "https://moz.com/blog/link-building-with-discounts",
  "slug": "link-building-with-discounts",
  "title": "Link Building with Discounts - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "While in a particularly inquisitive mood today, I picked up my girlfriend's copy of Lucky Magazine, which is subtitled - the magazine about shopping. Sure enough, inside were \"links\" to hundreds of stores both online and off from which to ...",
  "content": "Link Building with Discounts Link Building By: Rand Fishkin April 13, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 13, 2005 Link Building with Discounts Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. While in a particularly inquisitive mood today, I picked up my girlfriend's copy of Lucky Magazine, which is subtitled - the magazine about shopping. Sure enough, inside were \"links\" to hundreds of stores both online and off from which to purchase the trendy gear (clothing, accessories, hygiene products, furnishings, etc.) that was featured in the spreads.As I flipped around near the back of the magazine, a page caught my eye - luckymag discounts. These discounts were purchase codes that could be entered online during checkout to receive a discount on the merchandise featured at the site or in the magazine. I thought to myself - now this is a brilliant method of combining traditional and online marketing, and it works well for link building campaigns too.If you've ever checked out at Gap.com, EddieBauer.com or the hundreds of other online retailers (lately I've been partial to UrbanOutfitters.com), you've seen the spot to enter a discount code on the checkout or shopping cart page. What you may not realize is that almost every time that discount code is mentioned online, there's a link to the website in question accompanying the code - a fantasticly simple way to conduct SEO link building without even trying.I plan to give this new methodology (which I haven't seen mentioned before on the forums) a try in the near future as we will be launching two e-commerce sites in the next six months. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Link Building with Discounts"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Link Building with Discounts"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}