{
  "url": "https://moz.com/blog/link-magnets-a-new-paradigm-in-link-acquisition",
  "slug": "link-magnets-a-new-paradigm-in-link-acquisition",
  "title": "Link Magnets: A New Paradigm in Link Acquisition for SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This morning I gave a presentation at SES New York on a session entitled \"How to Become a Link Magnet.\" Below, I've copied the presentation into this post and hope to create some context around it.\nIn my opinion, the \"link magnet\" concept, however it's phrased, is one of the most powerful...",
  "content": "Link Magnets: A New Paradigm in Link Acquisition Link Building By: Rand Fishkin March 23, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 23, 2010 Link Magnets: A New Paradigm in Link Acquisition Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This morning I gave a presentation at SES New York on a session entitled \"How to Become a Link Magnet.\" Below, I've copied the presentation into this post and hope to create some context around it. In my opinion, the \"link magnet\" concept, however it's phrased, is one of the most powerful and important to understand for companies who want a true strategic advantage from their link graph profile. For a long time, SEOs have recommended the creation of \"linkbait\" content or \"high quality content\" in order to naturally attract links from the web's link-able population (those who have places to publish on the web that could include a linking or sharing activity - Facebook, Twitter, blogs, media publications, hobby websites, etc.). Magnetism as link acquisition is the idea that rather than simply producing and hoping people like it enough to link, you build a true incentive for them to do so. Incentives can range across the psychological spectrum (but shouldn't venture into the financial). You might, for example, build a resource that ranks the top 50 tourist destinations in New Orleans, contact each of them to tell them they've won, and provide them with a great-looking badge to help show off their new accolade. Their websites now all have an incentive to link to your article, as they can take pride in the award (and possibly be rewarded with more visitors who'll want to take a trip). In the presentation below, I walk through this in a more visual way and show some examples: How to be a Link Magnet: SES NY 2010 The examples from the embedded deck include: Vimeo - the online video sharing site has a great looking player and each time it's embedded, they earn 3 links back to their site by default. Linkers are rewarded by having the attractive player, easy functionality and solid uptime Vimeo provides. This is a classic widget-reward strategy that sites like Scribd (see the presentation above for example), Docstoc, Slideshare and many others employ. OKCupid's Blog - one of the few pieces of content that I'd describe as both \"linkbait\" and a \"link magnet.\" The content is so unique, so appealing to a wide swath of humanity (who among us isn't interested in the science of attraction?) and so well documented as to be rewarding to those who share. When I personally tweeted about some content from them a few months back, I saw great responses on Twitter, more retweets and more followers. That's how publishers want to position content - as a way to earn a reward if/when you share it. Techmeme's Leaderboard - when Techmeme added this feature, they had links from dozens of the listed sites within hours. Today, nearly all of those who appear, have linked to the page at one time or another, and some even do so on every page of their blog. It's a way for those listed to show that they're a \"serious\" source and a well-regarded one. SimplyHired - The job site uses a research content embed strategy that more folks need to be adopting. By performing any combination of searches around salaries or popularity, you can retrieve a graph showing the trendline and numbers. Embedding the graph widget on your site creates a link back to SimplyHired and bolsters your credibility whenever you're trying to make a point about a job/industry's value or historical performance. I've talked previously about this type of link acquisition strategy being built into the product process, but I hope this presentation has been valuable in showing off even more about what can be accomplished and why it's so critical. Looking forward to your comments and questions as always (and to my three other sessions here at SES: NY)! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Link Magnets: A New Paradigm in Link Acquisition"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Link Magnets: A New Paradigm in Link Acquisition"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}