{
  "url": "https://moz.com/blog/linkbait-within-a-nontech-niche",
  "slug": "linkbait-within-a-nontech-niche",
  "title": "Linkbait Within A Non-Tech Niche - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I have read much of the stuff that you write, and other SEO/SEM folks write, about how to build links, and grow in ranking on Google.  One concept that I'm particularly interested in is linkbaiting.  I have a problem, however.My blog is in the area of self development, and some other related…",
  "content": "Linkbait Within A Non-Tech Niche Content Marketing H By: HollywoodPrince September 18, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! H By: HollywoodPrince September 18, 2007 Linkbait Within A Non-Tech Niche Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I have read much of the stuff that you write, and other SEO/SEM folks write, about how to build links, and grow in ranking on Google. One concept that I'm particularly interested in is linkbaiting. I have a problem, however. My blog is in the area of self development, and some other related topics. As you can probably guess, that means that most of my articles are serious and in-depth... and not necessarily appealing to, as your landing page submission dubbed them, the Linkerati. I know how to write about things that would be link bait for that type of person. I AM that type of person, after all... I'm a blogger, a web developer, etc. I don't want to \"adulterate\" my site with that type of thing ONLY for links, though. I want to keep a consistent site, a consistent tone. I do what I can for on-site SEO, and I occasionally end up in the first page or two of Google results for one of my articles... for a short time. But I would really like to have someone help me figure out how to produce linkbait with an audience that isn't necessarily composed of many of the Linkerati, while keeping it in sync with my other writings. So... can anyone help? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Linkbait Within A Non-Tech Niche"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Linkbait Within A Non-Tech Niche"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "HollywoodPrince\n          \n            HollywoodPrince"
}