{
  "url": "https://moz.com/blog/linkbuilding-in-2019",
  "slug": "linkbuilding-in-2019",
  "title": "Link Building in 2019: Get by With a Little Help From Your Friends - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In 2015, this outreach approach resulted in a 187% increase in email reply rates. But would the same approach work in 2019?",
  "content": "Link Building in 2019: Get by With a Little Help From Your Friends Link Building | Marketing Industry | Email Marketing By: Kelsey Reaves June 25, 2019 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Kelsey Reaves June 25, 2019 Link Building in 2019: Get by With a Little Help From Your Friends Link Building | Marketing Industry | Email Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Editor's note: This post first appeared in December of 2015, but because SEO (and Google) changes so quickly, we figured it was time for a refresh! The link building world is in a constant state of evolution. New tools are continually introduced to the market, with SEOs ready to discover what works best. In 2015, I wrote an article for Moz about how our team switched over to a new email automation tool that drastically improved our overall outreach system — we increased our email reply rates by 187 percent in just one month. Which meant that our number of attainable backlinks also drastically increased. I wanted to see what's changed since I last wrote this post. Because in 2019, you need a lot more than new tools to excel in link building. But first... Looking back, it was pretty ingenious: Our link building program had automated almost every step in the outreach process. We were emailing hundreds of people a week, guest posting on numerous websites, and raking in 20–30 links per week. If anyone has been in the game long enough, you’ll know that’s an insane amount of links. With its success at my first company, I took the concept and applied it to several freelance link building projects I was working on. It proved to work for those sites, too. Later on, I built out a similar system for the second startup I worked for. And again, it proved to be just as successful. Every link building project I took on, my thinking was: How can I scale this thing to get me 10x the number of links? How can I email 5x the number of people? How can I automate this as much as possible so I can create a link building machine that’s completely hands off? Well...at least for a period of time. While I had the best of intentions, this thinking is what ultimately got me in trouble and lead to the inevitable: I was hit with a manual action for participating in link schemes. I remember opening up Search Console and reading that message. At that moment, I felt like a kid caught with their hand in the cookie jar. My stomach was in knots. I had heard of people getting manual actions before but didn’t think it was something that would happen to me. In hindsight, this was probably one of the most important moments of my SEO/growth career. It sobered me up and pushed me into thinking about outreach in a whole different light, and taught me the most important lesson to date: building links isn’t about using automation to create processes that scale. It’s about building relationships — and value — that scales. What outreach looked like in 2015 I’m not surprised I got away with what I was doing for so long. From 2015 to 2017, it seemed like everyone and their Mom was guest posting. During that time, this is what I noticed: 1. It was a numbers game Most of the SEOs I talked to from 2015 to 2017 were using a similar strategy. It was all about finding tools that could help scale your guest posting program and contact as many people as possible. Most companies had some arbitrary link quota for their outreach teams to hit every month, mine included. 2. It promoted somewhat decent content that was templatized In our outreach program, we were pitching the same three to four topics over and over again and while the content we wrote was always original, there was nothing novel about the articles we were putting out there. They were cute, engaging — but none of it was on the cutting edge or had a solid opinion. It’s what our friend John Collins from Intercom calls Happy Meal content: “It looks good from a distance, but you’re left feeling hungry not long after you consume it.” 3. It idolized automation and processes At the time, most outreach programs were about leveraging tools to automate processes and scale every step of the way. We were using several tools to scrape websites and hired virtual assistants off of Upwork to find email addresses of just about anyone associated with a company, whether they were actually the ideal person to contact or not. This process had worked in 2015. But in 2019, there’s no way it could. What outreach looks like in 2019 Since joining the team at OG Marketing this last fall, I’ve vastly altered the way I approach outreach and link building. Our strategy now focuses on three main concepts. 1. Helping editors cite good sources The link building relationships I’ve built this year are almost entirely centered around editors and content managers of notable sites who only want to link to high-quality, relevant content. And luckily for us, we work with some of the best content creators in the B2B SaaS-verse. We don’t have to go out and beg for links to mediocre (at best) content: We’re building authority to pages that truly deserve it. More importantly, we’re actually fulfilling a need by providing great sources of information for other quality content. 2. Understanding backlinks are only one piece to the puzzle Link building is only one lever and shouldn’t be your whole SEO strategy. Depending on the site you’re working on, building links may be a good use of your time — or not at all. In our strategy, we account for the fact that sometimes links aren’t always necessary. They will definitely help, but it’s possible to excel without them. For example, Hotjar recently published an article on 5 ways to use scroll maps. Looking at the backlink profile for the top three results for “scroll map,” CrazyEgg has more referring domains than Hotjar, but is currently in position three. Omniconvert has zero backlinks and still ranks above CrazyEgg in position two. With only three referring domains, Hotjar has earned the 1st position and a coveted featured snippet. 2015 me would’ve had a knee jerk reaction to kick off an outreach campaign as soon as we hit publish on the new article. But considering the fact that you may not even need a ton of links to rank well, you can actually spend your time more efficiently elsewhere. 3. Creating quality content that earns links naturally There’s definitely a tipping point when it comes to generating backlinks naturally. When your article appears on page one for the query you’re targeting, your chances of having that article cited by other publications with zero effort on your part just naturally goes up. Why? Because people looking to add credible citations to their article will turn to Google to find that content. This prompts our team to always ensure that each piece of content we create for our clients satisfies searcher intent. To do this, we start off by researching if the intent behind the keyword we want to rank for has purchase, consideration or informational intent. For example, the keyword “best video conferencing camera” has consideration-based intent. We can determine this by looking at the SERPs. In the screenshot below, you can see Google understands users are trying to compare different types of cameras. By seeing this, we know that our best bet for creating content that will rank well is by writing a listicle-style post comparing the best video cameras on the market. If we had instead created an informational article targeting the same keyword about why you should invest in a video conferencing camera without a list of product comparisons, the article probably wouldn’t perform well in search. Therefore, if we start off on the right foot by creating the right type of content from the very beginning, we make it easier for ourselves down the road. In other words, we won’t have to build a million links just to get a piece of content to rank that wasn’t the right format, to begin with. What we’ve found with our outreach strategy Centering our strategy around creating the right content and then determining whether or not that content needs links, has helped us prioritize what articles actually need to be a part of an outreach campaign. Once this is determined, we then call on our friends — or our content partners — to help us drive link equity quickly, efficiently, and in a way, that enhances the source content and makes sense for end users (readers). A few months into building out our homie program, there are several things we noticed. 1. Response rates increased Probably because it’s not as templatized and, generally, I care more deeply about the email I’m sending and the person I’m reaching out to. On average, I get about a 65–70 percent response rate. 2. Opt-in rates increased Once I get a response, build the relationship, then ask if they want to become a content partner (“friend”), we typically see a 75 percent opt-in rate. 3. You get the same amount of links, using half the amount of work, in half the amount of time I’m gonna repeat that: we generate the same, if not more, backlinks month over month with less effort, time and manpower than with the process I built out in 2015. And the more partners we add, the more links we acquire, with less effort. Visually, it looks like this: I (somewhat) paid attention during economics class in college, and I remember a chart with this trajectory being a really good thing. So, I think we’re on to something... How our outreach process works (and how you can create your own) Our current link building program still leverages some of the tools mentioned in my post from 2015, but we’ve simplified the process. Essentially, it works like this: 1. Identify your friends Do you have friends or acquaintances that work at sites which touch on topics in your space? Start there! I got connected to the CEO of Proof, who connected me with their Content Director, Ben. We saw that there was synergy between our content and each needed sources about what the other wrote about. He was able to connect me with other writers and content managers in the space, and now we’re all best of friends. 2. Find new friends Typically we look for similar sites in the B2B SaaS space that we want to partner with and are relevant to our client sites. Then, we use several tools like Clearbit, Hunter.io, and Viola Norbert to identify the person we want to reach out to (usually SEO Managers, Marketing Directors or Content Managers) and find their email. This step has been crucial in our process. In the past, we left this to the virtual assistants. But since bringing this in house, we’ve been able to better identify the right person to reach out to, which has increased response rates. 3. Reach out in an authentic way In our outreach message, we cut to the chase. If you’ve identified the right person in the previous step, then they should know exactly what you’re trying to do and why it’s important. If the person you outreached to doesn’t get the big picture and you have to explain yourself, then you’re talking to the wrong person. Plain and simple. Compared to 2015, our lists are much smaller (we’re definitely not using the spray and pray method) and we determine on a case by case basis what the best method for outreach is. Whether that be email, Linkedin, or at times, Instagram. Here’s an example of a simple, straightforward message I send out: 4. Share content priorities Once someone expresses interest, I’ll find a place on their website using a site search where they can reference one of our client’s content priorities for the month. In return, I’ll ask them what content they’re trying to get more eyes on and see if it aligns with our other client sites or the other partners we work with. If I think their content is the perfect source for another article, I’ll cite it. If not, I’ll share it with another partner to see if it could be a good resource for them. 5. See if they want to be a \"friend\" Once we have that first link nailed down, I’ll explain how we can work together by using each other’s awesome content to enhance new blog articles or article contributions on other sites. If they’re down to be content friends, I’ll share their priorities for the month with our other partners who will then share it with their wider network of websites and influencers who are contributing articles to reputable sites and are in need of content resources to cite. From there, the writers can quickly scan a list of URLs and cite articles when it makes sense to help beef up new content or improve existing content with further resources. It’s a win-win. If the site is interested in being friends, I’ll send over a spreadsheet where we can track placements and our priorities for the month. Here’s the link to a partner template you can download. Unlike the guest posting programs I was doing over the last few years, with this process, we’re not leaving a digital footprint for Google to follow. In other words, we don’t have our author bios mentioning our website plastered all over the internet, essential saying “Hey, Google! We guest posted here and inserted these links with rich anchor text to try and help our page rank. Oh, and we did the same thing here, and here, and here.” With this process, we’re just offering a list of resources to well-known writers and other websites creating badass content. Ultimately, it’s their choice if they want to link to it or not. I’ll definitely make suggestions but in the end, it’s their call. 6. Grow the friend list Now, if I’m looking to drive link equity to a certain page, I don’t have to build a new list, queue up a campaign, and kick off a whole automation sequence to an ungodly amount of people like I did in the past. I just hit up one of our partners on our friend's list and voila! — quality citation in 0.45 seconds. And on a personal note, waking up to emails in my inbox of new citations added with zero effort on my part feels like the Link Gods have blessed me time and time again. Results With our friend network, the numbers speak for themselves. This last month, we were able to generate 74 links. In 2015, I was hitting similar monthly numbers, but link building was my full-time job. Now, link building is something I do on the side (I’d estimate a few hours every week), giving me time to manage my client accounts and focus on everything else I need to do — like drive forward technical SEO improvements, conduct keyword research, optimize older pages, and use SEO as an overall means to drive a company’s entire marketing strategy forward. Building out a friend network has also opened up the door to many other opportunities for our clients that I had never dreamed of when I viewed my link building relationships as one and done. With the help of our friends, we’ve had our clients featured on podcasts (shout out to Proof’s Scale or Die podcast!), round-ups, case studies, video content, and many, many more. Final thoughts As an instant-gratification junkie, it pains me to share the honest truth about building a friend network: it’s going to take time. But think of the tradeoffs — everything I mentioned above and that in a way, you’re acting as a sort of matchmaker between high-quality content and sites who are open to referencing it. I also believe that this type of outreach campaign makes us better marketers. Spamming people gets old. And if we can work together to find a way to promote each other's high-quality content, then I’m all for it. Because in the end, it’s about making a better user experience for readers and promoting content that deserves to be promoted. How has your link building program evolved over the years? Have you been able to create a network of friends for your space? Leave a comment below! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Link Building in 2019: Get by With a Little Help From Your Friends"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Link Building in 2019: Get by With a Little Help From Your Friends"
    },
    {
      "level": "H2",
      "text": "But first..."
    },
    {
      "level": "H2",
      "text": "What outreach looked like in 2015"
    },
    {
      "level": "H3",
      "text": "1. It was a numbers game"
    },
    {
      "level": "H3",
      "text": "2. It promoted somewhat decent content that was templatized"
    },
    {
      "level": "H3",
      "text": "3. It idolized automation and processes"
    },
    {
      "level": "H2",
      "text": "What outreach looks like in 2019"
    },
    {
      "level": "H3",
      "text": "1. Helping editors cite good sources"
    },
    {
      "level": "H3",
      "text": "2. Understanding backlinks are only one piece to the puzzle"
    },
    {
      "level": "H3",
      "text": "3. Creating quality content that earns links naturally"
    },
    {
      "level": "H2",
      "text": "What we’ve found with our outreach strategy"
    },
    {
      "level": "H3",
      "text": "1. Response rates increased"
    },
    {
      "level": "H3",
      "text": "2. Opt-in rates increased"
    },
    {
      "level": "H3",
      "text": "3. You get the same amount of links, using half the amount of work, in half the amount of time"
    },
    {
      "level": "H2",
      "text": "How our outreach process works (and how you can create your own)"
    },
    {
      "level": "H3",
      "text": "1. Identify your friends"
    },
    {
      "level": "H3",
      "text": "2. Find new friends"
    },
    {
      "level": "H3",
      "text": "3. Reach out in an authentic way"
    },
    {
      "level": "H3",
      "text": "4. Share content priorities"
    },
    {
      "level": "H3",
      "text": "5. See if they want to be a \"friend\""
    },
    {
      "level": "H4",
      "text": "Here’s the link to a partner template you can download."
    },
    {
      "level": "H3",
      "text": "6. Grow the friend list"
    },
    {
      "level": "H2",
      "text": "Results"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kelsey Reaves\n          \n            Kelsey Reaves\n          \n            Kelsey Reaves"
}