{
  "url": "https://moz.com/blog/linkscape-index-update-visualize-data",
  "slug": "linkscape-index-update-visualize-data",
  "title": "Linkscape Index Update: Now with More Visualization - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Last night we rolled out our latest Linkscape index update (we call it \"index13\" internally).  From a data perspective we've got a few things wrapped in here that might interest you guys:\n\n    53 billion urls (our biggest index to date)\n    \n    500 billion links\n    Everything crawled within th...",
  "content": "Linkscape Index Update: Now with More Visualization SEO Tools June 16, 2009 Table of Contents Copied! June 16, 2009 Linkscape Index Update: Now with More Visualization SEO Tools Last night we rolled out our latest Linkscape index update (we call it \"index13\" internally). From a data perspective we've got a few things wrapped in here that might interest you guys: 53 billion urls (our biggest index to date) 500 billion links Everything crawled within the last two months We crawled every blog post pulled from Blogscape up until May 1 We're now counting # of Root Domains linking to a Subdomain instead of Subdomains linking to a Subdomain In this update we've focused on a small amount of growth, up-to-date fresh data, and including the fast moving web, which has traditionally been difficult to capture for us. So go check out some reports, links, and top pages. In light of the recent discussion across the SEO world about revelations about nofollow, here are some stats on nofollow usage we've observed: nearly 15 billion links (~3% of all links) using the nofollow attribute over 11 billion of those were internal (73% of instances of nofollow) I don't pretend to know what motivates these internal usage of nofollow, but this is certainly consistent with the hypothesis that nofollow is used extensively for internal architecture reasons. We're looking into this issue a great deal. Be sure to check out WBF this week :) This update calculates mozRank as Rand describes as the \"old\" way. We're working on changes to include the \"new\" behavior and when we get that out (in about a month) we'll include some notes about correlations and changes. We've also been keeping a close eye on adoption of rel=canonical. Our data shows a low, but growing level of adoption. We've got just over 38 million instances. From our anecdotal view we've seen it used pretty successfully on a few large sites. But I know there's still a lot of skepticism about it in some cases, so your mileage may vary. Still, it's not hard to include, so it might be a worthwhile investment regardless. Shortly after each index update we also update our list of the Top Domains and Top Pages on the web. So be sure to keep an eye out for that data being updated very soon. Another thing we've been doing since launch is saving Linkscape reports. So if you're looking for history of sites and pages you've run in the past, be sure to check those out. In addition to the index update, some of you may have read about a new addition to our SEOmoz Labs offering, a Linkscape Visualization Tool, which we're very happy to make available to you. As usual, this is a prototype, providing some advanced functionality we hope to include in future versions of our products. In the meantime head over to Labs and check out what else we've got :) The visualization tool itself provides a lot of neat features that make what we're trying to do with Linkscape much more intuitive: What we've done is to lay several key factors onto a radar graph to illustrate the comparison between these two sites. Radar graphs are a bit fancy, but the idea is pretty neat: each leg represents a different dimension. For instance to the upper right we've illustrated that shopstyle.com beats revolveclothing.com on a pure external link count, but revolveclothing.com beats shopstyle.com in terms of domain diversity of those links. Overall these two sites are competitive with each other, but the larger shopstyle.com area suggests that shopstyle has a slight edge from a pure link profile perspective. We've powered a few consulting gigs of our own with this kind of visualization and it makes a great way for clients to see visually how they stand against competition, how internal pages compare to a site's homepage, and where the greatest weaknesses between two pages lies. But we don't just visualize the data. We also provide the raw data in a table: So far it seems like that \"Overall Score\" is pretty well correlated with ranking for sites with similar content. So we feel like this is a pretty good view of a page's link profile. More importantly we've built some of our SEO experience and analysis into suggestions and next steps: These suggestions are a good place to look if you want to know your biggest strengths and weaknesses. And we've got some contextual links to get some more information. So try out the tool and the new index and let me know what you think! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Linkscape Index Update: Now with More Visualization"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Linkscape Index Update: Now with More Visualization"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": ""
}