{
  "url": "https://moz.com/blog/linkbuilder-gmail-productivity-setup-and-outreach-examples",
  "slug": "linkbuilder-gmail-productivity-setup-and-outreach-examples",
  "title": "A Linkbuilder's Gmail Productivity Setup (with Outreach Emails from 4 Industry Linkbuilders) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Because linkbuilding is hard, we all look for ways to make the process less painful and our outreach more effective. I constantly struggled with how to make my job more effective when working in-house, and since coming to Distilled I have had to become even more of a productivity ninja in order to…",
  "content": "A Linkbuilder's Gmail Productivity Setup (with Outreach Emails from 4 Industry Linkbuilders) Link Building By: John Doherty January 15, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: John Doherty January 15, 2012 A Linkbuilder's Gmail Productivity Setup (with Outreach Emails from 4 Industry Linkbuilders) Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Because linkbuilding is hard, we all look for ways to make the process less painful and our outreach more effective. I constantly struggled with how to make my job more effective when working in-house, and since coming to Distilled I have had to become even more of a productivity ninja in order to keep up with the fast pace of an agency. The goal of today's post is to teach you some ninja ways that will markedly increase the speed of sending linkbuilding emails, as well as help you provide context to them with the goal of increasing your response rate. A quick note: These tips I am showing today apply to people who use Gmail as their email provider. There are probably similar tools available for other programs like Outlook. So take the principles applied here, suit them to your needs, and then share the knowledge! Gmail Tools and Tips Let's look at some Gmail tools, tips, and tricks that can improve your productivity. Gmail Shortcuts Gmail shortcuts are a linkbuilder or email productivity ninja's best friend. Once enabled in Labs, you have a whole wealth of shortcuts to use so that you never have to touch your mouse, unless you need to edit text or do something like inserting a canned response (see below). You'll find that shortcuts tend to eliminate many superfluous steps, and when used in combination with the other tools mentioned, you can drastically speed up your email processing time. The most important shortcuts are, in my opinion: C - compose a new message E - archive a message G then I - return to inbox from a message R - reply to a message A - reply all to a message F - forward the message J - when in your inbox, move to the next message K - when in your inbox, move to the previous message X - when in your inbox, mark an email. Most useful when processing out emails that don't require any attention (such as daily emails). You should think about shortcuts as \"recipes\" of sorts. Use them in combination, like Tab+Enter for sending, J+X+E for archiving messages in your inbox, or R+message+tab+enter for responding to a message. String them together, and you'll be more awesome. For a complete list of Gmail shortcuts, go here Pro tip: Combine this with Send and Archive (mentioned below) to take your processing to the next level. Canned Responses Canned responses are something that our New York Sales Exec Ron Garrett recently introduced me to. Another Labs tool, it allows you to save email templates to use so that you are not constantly copying and pasting from one source to another, risking making a mistake. As you can see in the image below, it installs a \"Canned Responses\" button right under the Subject field. This is where you can save drafts of canned responses for quick access. Here is how a canned email might look if I was sending an email to Tom Critchlow: Pro tip: Highlight the text to change in yellow so that you make sure to insert all relevant information. Also, make sure you check out some example linkbuilding emails from some industry experts at the bottom of this post. Rapportive Rapportive is a Gmail plugin that I've been hyping recently, because it's so freakin awesome. The idea is simple, but the outcome is powerful. After you download it from Rapportive.com and install into Gmail, the box will appear on the right side of your screen when you go to compose a new email. The Rapportive feature that makes it so powerful for linkbuilding and connecting with others is the social features. You can see many different ways for you to connect with, or build rapport with (see what I did there?), your email contact. You can even connect with them, such as sending a LinkedIn invitation, directly from within Rapportive. BOOM. Check out all the options I get when I go to email Ross: Pro tip: Use Rapportive to help you find contact emails. If you are not sure of the combination of their company's email (john.doherty, john-doherty, jdoherty, dohertyj, for example), try different combinations. When you hit the right one, their information will appear :-) Boomerang Boomerang is a Gmail plugin that I found via Napoleon Suarez. After you install, a little \"Boomerang\" icon will appear in your Gmail screen and a Send Later button will appear on every email you go to send. When expanded, it looks like this: The really powerful features of Boomerang are: Send emails at a designated time (ie you write an email at 2am on Saturday night. Set it to send at 9am on Monday so it doesn't look like you are working at 2am on Saturday night) Send an email back to the top of your inbox at a later point in the day (I do this with emails that I want to respond to at a designated email time later in the day). Send the message back to you if you don't hear back within a set amount of time (great for recontacting people you emailed about links). I'd love to hear other ways you find to use Boomerang as well! FYI - Boomerang is also available for Outlook! Also, you receive a certain number of Boomerangs per month, and then it moves to a paid service. If I was doing more link outreach, I definitely think the paid service would be worth the money, but at this point I have never hit my max. Undo Send Another awesome Labs tool that is handy to have around is Undo Send. What it does is allow you a time buffer (I believe 5 seconds) to recall an email before it sends. Once you send the email, you will be returned to your email but this little box will show up: Pro tip: To avoid sending an email early, even with this tool, don't put the recipient's name in the To: field until you're done. After you've completed your email, use the Shift+tab combination twice to return to the To: field. Insert the email, tab three times, and Send and Archive. Send and Archive The final Gmail productivity ninja tip I have for you is the Send and Archive Labs tool. Once installed, a Send and Archive button appears on your Compose screen. If you're an InboxZero nut (like most of Distilled), then you're already excited by this. Here's a screenshot of the button: Now, when you have finished composing an email and you are ready to send it, simply Tab from your message and press Enter. Boom! Email sent and the message is now out of your inbox. You've just eliminated the step of archiving the message after the fact. Go and do something awesome. Pro tip: Just install and use it. Nothing more to be said. Linkbuilding Email Templates from Industry Linkbuilders I emailed some friends to ask for some examples of actual link request emails that they have sent to prospective link partners. The following are those examples. Please note that these are drafts, and emails should always be as customized as possible to the recipient. Broken Linkbuilding Ross Hudgens is the SEO Manager at Full Beaker, a lead-gen focused SEO company outside Seattle. Ross responded to my email with this gem of a broken link email that he sends to people when asking to be included on their list, but wants to provide them value by helping them out with some links broken on their site. Here's the email: Hello NAME, I was browsing through your site/links as a NICHE SPECIFIC DESCRIPTION myself, and they're great. ONE/TWO SENTENCES TAILORED TO SAID WEBSITE. I'm contacting you specifically because I was looking through your links and I noticed a few broken ones - specifically to BROKEN LINK1, BROKENLINK2. Other than that you've got a great list! I have two more suggestions for sites that were extremely helpful to me as a NICHE SPECIFIC DESCRIPTION might make good additions to your list - GREATRESOURCE and MYWEBSITE. GREATRESOURCE is a comprehensive and entertaining resource and MYWEBSITE has some great tips for NICHESPECIFIC DETAIL. Just a thought. Anyways, just wanted to let you know and say thanks - have a great new year! Regards, EMAIL NAME Notice how he has put information to change in CAPS so as not to forget to change a field. Boom! Guest Posting This email comes from Distilled SEO Geoff Kenyon, who works in our Seattle office. Geoff has been killing it for his clients for a while now, so I asked him for an example of what he sends to people. He came back with this example of a templated email sent to people for guest posts. Hey NAME, I saw that you're the THEIR POSITION over at THEIR COMPANY and I wanted to get in touch. I've seen guest contributions before on the TOPIC blog and wanted to know if you were open to any more guest contributions. I am looking to write about something related to NICHE and thought that the topics I had in mind may go well on the TOPIC blog. I was thinking about the following subjects: IDEA 1 IDEA 2 IDEA 3 What do you think about these? If you're interested, I am happy to get something written up and sent over to you - or if you have another topic you'd like to see covered, I am more than happy to write on that. Thanks, NAME Note: Do not mass email a ton of people your content ideas, but customize them per person. Also, don't mass email. Send emails one at a time. It doesn't scale easily, but it's more effective. Also, don't send emails like this to high-level contacts. Those MUST be totally personalized. PR This next example comes from Paul May over at Buzzstream, which is a linkbuilding CRM tool that we use and love at Distilled. Paul sent me this example of an email they sent out during their most recent launch. I think it's a great mix of professional and personal with a lot of detail. I especially love the \"Pick your poison ;)\" part! Hi , Don't know if you remember me, but I've commented on a number of your blog posts and we've written a couple of posts on the (YOUR COMPANY) blog that continued discussions you'd started (I think the TOPIC post was the most recent one). I wanted to reach out to you about YOUR COMPANY, the PR/SEO startup I co-founded. We're now preparing to launch (DATE) and I wanted to see if we could setup a time to brief you on it. QUICK BACKGROUND ABOUT YOUR COMPANY. WHY YOUR COMPANY IS GREAT. Here’s the gist. You can: SELLING POINT 1 SELLING POINT 2 SELLING POINT 3 Launch is happening DATE. We’d love to find some time to show the thing to you. Are you comfortable with an embargo until TIME a.m. ET on DAY, DATE (i.e. late Monday night PT)? If so, here are some suggested times...pick your poison ;) TIME OPTION 1 TIME OPTION 2 TIME OPTION 3 Thanks in advance. Regards, NAME Push Content This final example comes from Mike Essex at Koozai in the UK. Mike shared this example email that he sends to people when they are pushing out content that they have created, to help generate a buzz. In Mike's own words: \"The first method I use is to find content that we have, which could be relevant to other websites and then I get in touch with them to ask them to link or continue to debate the issue. This works well as it gives them a reason to link, and an opportunity to add new content to their websites.\" Here's the example: Hi NAME, ONE OR TWO SENTENCES ABOUT THE PURPOSE OF THE EMAIL AND WHY YOU CREATED THE CONTENT. ALSO, WHY THEY SHOULD CARE ABOUT THE CONTENT. The guide can be found at LINK and I’d love if you could share this with your readers and help make them aware of THE POINT OF THE RESOURCE, and how they can help. If you need any further information please let me know. NAME Exchange for a link (but not a link exchange) This next email comes from Allie Brown at SEER Interactive. Linkbuilding used to be all about link exchanges. I give you a link, you give me a link, everyone's happy. Those days are over, so we either have to create content for people to link to, or you offer someone something in return (but not a link). That's what I like about this email from Allie. Hi NAME, My name is Allie and I work with [Client] online marketing team. First, I have to thank you for repeatedly featuring [Client] on [your blog name]. The [client] team truly loves it when their customers share their favorite looks with others on their personal blogs. Secondly, I wanted to see if you would be interested in linking to [Client] the next time you feature one of their products. I noticed that you often mention us in your \"XYZ\" posts and I want to propose an idea that I think we could both benefit from. In exchange for linking to [Client], we'd like to post a Tweet about your blog sometime within the next week. As you may know, we have over x followers, so the opportunity for exposure is pretty grand. You'd also be helping our team out by sending your readers directly to our site when they see a product they like. Let me know if you're interested in this idea, and hopefully we can find some way to work together! Thanks again for all your support and Happy New Year! Incentivized Reviews for Ecommerce This email template comes from Abbott Shea, also from SEER. This email proposes some free product in exchange for someone leaving a review. It provides a lot of detail and adds value to the recipient. Subject: Merrrrrrry Christmas! Wait, too early....? Body: Hi [Name], My name is Abbott, and I work with [client] web promotions team. I came across [blog name] and wanted to see if you were interested in working with us. Our site, [client] has over 48,000 custom [product] designs across 113 categories. We were inspired by [something about their site], and seeing as how you love the holidays just as much as we do we'd like to provide you with 5 free Christmas cards for a product review on [URL]. You can either design these cards yourself with your own photos and text or select one from our already pre-designed cards - regardless we'll be crediting you with free shipping. Please let me know if you are interested in this idea or if you have any suggestions of how we can collaborate on something else. I look forward to hearing from you! Take care, Abbott I hope this post has been helpful to you! I'd love to hear any more email productivity tips that you have, especially for people using Outlook as that has not been talked about much in this post. Also, don't forget that Distilled is running our annual linkbuilding conference called Linklove in London and Boston in March and April. Don't miss it! Cheers! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Linkbuilder's Gmail Productivity Setup (with Outreach Emails from 4 Industry Linkbuilders)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Linkbuilder's Gmail Productivity Setup (with Outreach Emails from 4 Industry Linkbuilders)"
    },
    {
      "level": "H2",
      "text": "Gmail Tools and Tips"
    },
    {
      "level": "H3",
      "text": "Gmail Shortcuts"
    },
    {
      "level": "H3",
      "text": "Canned Responses"
    },
    {
      "level": "H3",
      "text": "Rapportive"
    },
    {
      "level": "H3",
      "text": "Boomerang"
    },
    {
      "level": "H3",
      "text": "Undo Send"
    },
    {
      "level": "H3",
      "text": "Send and Archive"
    },
    {
      "level": "H2",
      "text": "Linkbuilding Email Templates from Industry Linkbuilders"
    },
    {
      "level": "H3",
      "text": "Broken Linkbuilding"
    },
    {
      "level": "H3",
      "text": "Guest Posting"
    },
    {
      "level": "H3",
      "text": "PR"
    },
    {
      "level": "H3",
      "text": "Push Content"
    },
    {
      "level": "H3",
      "text": "Exchange for a link (but not a link exchange)"
    },
    {
      "level": "H3",
      "text": "Incentivized Reviews for Ecommerce"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "John Doherty\n          \n            John Doherty\n          \n            John Doherty"
}