{
  "url": "https://moz.com/blog/link-building-guide",
  "slug": "link-building-guide",
  "title": "New & Improved: Announcing The Beginner's Guide To Link Building - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Moz first published the Beginner's Guide to Link Building in 2014. While much has changed in link building since then, a lot has stayed the same. If you're new to link building, or simply want to improve your success rate and/or processes, we encourage you to give this new and updated guide a read.",
  "content": "New & Improved: Announcing The Beginner's Guide To Link Building Link Building | Moz News By: Cyrus Shepard March 30, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Cyrus Shepard March 30, 2021 New & Improved: Announcing The Beginner's Guide To Link Building Link Building | Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Link building isn't always easy, but if you want to rank with SEO, links are often the cost of admission. While Google says SEOs sometimes focus too much on links, links remain one of the few confirmed ranking factors. Indeed, every study over the past decade shows a high correlation between links and ranking. And while links alone can't guarantee a #1 spot at the top of Google, previous research has shown that it's nearly impossible to rank without any links at all. For many, link building also presents a challenge. Folks get sincerely frustrated with wasted link building efforts, poor outreach processes, and lack of results. It doesn't have to be that way. Good link building actually helps everyone involved: the content owner, the linker, the audience, and search engines alike. Google evaluates links in so many ways, you could say its search engine couldn't exist without them. Good link building also encourages the creation of useful content and good marketing practices. When done right, link building can also be a joy (and profitable!). Read the Guide! 1. Updating an instant classic Moz first published the Beginner's Guide to Link Building in 2014. Back then, the SEO world was still adjusting to the fallout of Google's Penguin Algorithm, which punished sites engaging in manipulative link building practices. The SEO world was looking to transition to more holistic, value-added forms of link building that wouldn't run afoul of Google's initiatives to sweep the web of shady practices. Enter Paddy Moogan. At the time, Paddy was already a respected voice among link builders, and had authored one of the few good books on link building. It was the same year that he and co-founder Matt Beswick conceived Aira, the digital marketing agency that would compel them to new heights. Moz was honored to have Paddy write the first edition of the Beginner's Guide to Link Building. Now, in 2021, Paddy has done it again. A lot has changed in link building since 2014, and weirdly, much has stayed the same. Many of the tools and tactics have certainly evolved, along with Google's algorithm (rel=ugc anyone?). As we worked with Paddy to update this edition of the guide, we realized how so many of the fundamentals of link building remain as true today as they did when we launched the first edition of the guide. As Paddy writes: \"Arguably, link building these days is more akin to great marketing, and the organizations who understand this are usually the ones who win long term.\" Without links, it's likely Google would have never been invented in the first place. Understanding how websites link to one another allowed Google's founders to create a search engine so superior to any other, that it grew to world domination. In fact, over 20 years later, links remain one of the most consistent Google ranking signals that we know of. In this chapter, learn the fundamentals of why link building is important, how they help websites to rank, and other ways in which links are important to a web-based business. Read Chapter 1 - What Is Link Building & Why Is It Important? 2. Types of Links The truth is, not all links are created equal. In truth, the web consists of billions of links. Google, in its ranking algorithms, may only consider a fraction of these links. Indeed, algorithms like Penguin, released years ago, are specifically designed to ignore many types of links. Understanding the types of links that you actually need, and that actually help you to rank, is crucial to effective link building. This chapter covers: Editorial Links (the most important kind)User-generated linksNofollow linksRisky vs Non-risky linksSustainable links Read Chapter 2 - Types Of Links 3. Structuring a Link Building Campaign It all starts with a plan. Some websites are able to attract links without much forethought, but this is rare. In truth, most successful sites have a plan for attracting links sustainably and at scale. Planning the right strategy in advance can make the difference between success and wasted effort. Questions covered include: What are our goals?How many links do we need to rank?What assets can we use/create?How long will it take?What types of links do we need? Read Chapter 3 - Structuring a Link Building Campaign 4. Finding your audience to get links from Want to know what separates successful link builders from unsuccessful ones? Successful link builders almost always know in advance who will link to their content, even before they create it.Unsuccessful link builders build content based on guesses, and only later work to find an audience that may or may not link to it. More often than not, this approach fails. This is a big, important chapter, involving a bit of competitive SEO research to lay the foundation in advance of your link-building campaign to better ensure success. This includes identifying the types of content already earning links, the audiences linking to them, how to find contact information, and more. Read Chapter 4 - Finding your audience to get links from 5. Link Building Outreach Outreach good. Outreach bad. Outreach has earned a rough reputation in SEO. We've nearly all been the recipient of really bad, really terrible outreach emails. Good outreach makes all the difference. Good outreach doesn't get marked as spam. Good outreach actually adds value for the person you're contacting. Good outreach builds links -- and relationships. In this chapter, learn the exact outreach tactics agencies use for successful link building campaigns, including detailed tips and real-world email templates to find inspiration. Read Chapter 5 - Link Building Outreach 6. Link Building Tactics This is what you came here for, right? There are hundreds of legitimate link-building tactics. Which one(s) you choose will depend on your business goals, available resources, your niche, and available time. A few of the tactics covered include: Content-based link building (with examples)Guest blogging (no, it's not dead!)Broken link buildingLink reclamationBuying links - against Google's guidelines! Read Chapter 6 - Link Building Tactics 7. Link Building Measurement and Metrics If you build links, will traffic come? Building links doesn't happen in a vacuum. Regardless if you work for an agency, in-house, or build links for your own projects, measuring the success of your efforts is vitally important. In this chapter, explore and understand how the proper use of metrics such as Domain Authority, Page Authority, and even PageRank help in link building and reporting. Also, look at how anchor text and raw link counts may or may not influence your link-building campaigns. For more advanced link builders, even the position of the link on the page may be tracked! Read Chapter 7 - Link Building Measurement and Metrics Bonus: Link Building Case Studies Updating the link building guide was a ton of fun. Paddy was an absolute joy to work with, and his experience and expertise added immense value. We also wanted to include real-world examples from some of the top link builders working in the industry. To this end, we reached out to experts such as: James Wirth, Citation LabsGarret French, Citation LabsAmanda Milligan, FractlNick Katseanes, Page One PowerColby Stream, Page One PowerMaddie Baker, Page One PowerNorm Vogele, Page One PowerDanica Barnack, Page One PowerKyle Ochsner, Page One PowerTim Legore-Hand, Page One PowerAoife O’Connor, AiraShannon McGuirk, AiraAnd many more! Collectively, these individuals have built thousands of links for some of the most successful brands and campaigns on the planet. They generously contributed their expertise to the guide, and we've sprinkled this wisdom throughout. What are your greatest link building tips? Let us know in the comments below. Read The Beginner's Guide to Link Building Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "New & Improved: Announcing The Beginner's Guide To Link Building"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "New & Improved: Announcing The Beginner's Guide To Link Building"
    },
    {
      "level": "H2",
      "text": "1. Updating an instant classic"
    },
    {
      "level": "H2",
      "text": "2. Types of Links"
    },
    {
      "level": "H2",
      "text": "3. Structuring a Link Building Campaign"
    },
    {
      "level": "H2",
      "text": "4. Finding your audience to get links from"
    },
    {
      "level": "H2",
      "text": "5. Link Building Outreach"
    },
    {
      "level": "H2",
      "text": "6. Link Building Tactics"
    },
    {
      "level": "H2",
      "text": "7. Link Building Measurement and Metrics"
    },
    {
      "level": "H2",
      "text": "Bonus: Link Building Case Studies"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Cyrus Shepard\n          \n            Cyrus Shepard\n          \n            Cyrus Shepard"
}