{
  "url": "https://moz.com/blog/linkcontent-linkclustering-conjectures",
  "slug": "linkcontent-linkclustering-conjectures",
  "title": "Link-Content & Link-Clustering Conjectures - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In a paper titled,  Lexical and Semantic Clustering by Web Links, Filippo Menczer of the Dept. of Computer Science at Indiana University, sets out...",
  "content": "Link-Content & Link-Clustering Conjectures Search Engines By: Rand Fishkin February 8, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 8, 2005 Link-Content & Link-Clustering Conjectures Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In a paper titled, Lexical and Semantic Clustering by Web Links, Filippo Menczer of the Dept. of Computer Science at Indiana University, sets out to empiracally test two conjectures proposed by his colleagues in the field of search engineering for the web. Menczer's paper reaches some practical conclusions that should be applied by search optimizers. First off, let's describe the two conjectures Menczer's paper covers: Link-Content ConjectureThis makes the assumption that pages which link to each other are closely topically related, i.e. a page on bananas is likely to link to other pages about bananas (or at least fruit). Link-Cluster ConjectureThis assumes that pages which are clustered together, or in the same \"web-community\" are closely topically related, i.e. the page about bananas from above links to a page about fruit which links to a page about food - all three are closely topically related. In a thread at SEW, I comment on the paper and draw out some conclusions that can be put to use by SEOs as they optimize their sites & pages for the web. The applications generally backup suggestions made in the past: It is as important (or more important)to get links from on-topic TLDs (top-level-domains) as it is to get links from on-topic pages. Links (both internal & external) will be better if they remain on the subject matter of the page. Getting links from the same pages/sites that link to your top competition is critically important as it suggests you are part of the \"web-community\" on that subject. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Link-Content & Link-Clustering Conjectures"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Link-Content & Link-Clustering Conjectures"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}