{
  "url": "https://moz.com/blog/linking-internally-externally-from-your-site-whiteboard-friday",
  "slug": "linking-internally-externally-from-your-site-whiteboard-friday",
  "title": "Linking Internally and Externally from Your Site - Dangers, Opportunities, Risk and Reward - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Navigating linking practices can be a treacherous process. Sometimes it feels like a penalty is lurking around every corner. In today's Whiteboard Friday, Rand talks about the ins and outs of linking internally and externally, identifying pitfalls and opportunities both.",
  "content": "Linking Internally and Externally from Your Site - Dangers, Opportunities, Risk and Reward Link Building | Whiteboard Friday By: Rand Fishkin April 15, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 15, 2016 Linking Internally and Externally from Your Site - Dangers, Opportunities, Risk and Reward Link Building | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. [Estimated read time: 9 minutes] Navigating linking practices can be a treacherous process. Sometimes it feels like a penalty is lurking around every corner. In today's Whiteboard Friday, Rand talks about the ins and outs of linking internally and externally, identifying pitfalls and opportunities both. Click on the whiteboard image above to open a high resolution version in a new tab! Video Transcription Howdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week we're chatting about linking externally and linking internally, and some of the risks and rewards that are involved. So some of you probably have seen April 11th, Google made this big move. They sent out a bunch of penalties to, well, a noticeably large number of websites — it was covered on a bunch of the SEO forums and in the SEO news — basically saying, this is Google sending out these warnings saying, \"You are linking to unnatural looking sites or in unnatural patterns, and we've noticed and we think that those links shouldn't be there. We may be penalizing your site, or we may not be passing PageRank or other types of link mechanisms, link value through your website anymore.\" This isn't the first time Google has done this. They've done it many, many times over the last 10, 15 years. We've seen plenty of this. This was just another explosion in that. It is also the case that we've seen some other cool things on the other side of the aisle, which is Google rewarding internal links in a way we had not seen previously. In fact, some cool experiments were done recently — hopefully they'll be made public soon, and then we can link over to them — around internal links and the power that internal links still have. So we know that it still matters and it's still important to consider who we link to and what we link to from our sites and pages. So I thought maybe we'd talk through a few of those scenarios. 1) When you're linking to external sites and pages. Let's say I've got my mobile phones compared website here. It is actually a very positive thing to link out to places like the official website of maybe Samsung's S7, or to link out to the Engadget review if I'm collecting a bunch of reviews and aggregating that data there to give the reference point. This is positive. However, if I'm linking, let's say I'm getting some affiliate value or someone's paid me to link, or I'm linking to the site because it turns out that I own it or someone connected to me owns it and I'm getting some benefit from it, this \"mobile info 4 UR life,\" maybe that could be a little suspicious. It is the case, it is true and we've seen plenty of evidence to support this. I think ever since Marshall Simmonds from Define came in here many years ago and did his Whiteboard Friday about how The New York Times saw so much benefit from linking out, lots of folks have been investigating that and seen that benefit repeated over and over. So good external pointing links can give a boost to your site's relevance, to how search engines consider you, and even to your rankings. Linking out is a positive thing. It's also the case that sites and pages that link out tend to earn more links back in, which seems obvious. They're more helpful and relevant to people, they can serve as better resources, and it's also the case that often that's a very direct correlation because linking out might drive traffic to other websites who then notice it and say, \"Oh yeah, I'd like to check you out. I might link to you.\" Engadget might see my link and say, \"Oh, you guys do a great job of that comparison stuff. Maybe we'll link to one of those in a future blog post that we do.\" Or Samsung might see our comparison and say, \"Hey, that's some pretty cool data you've got. Do you think we could partner with you on a future research project and maybe we'd link to you from that project?\" Very cool things. That said, manipulative linking is dangerous. This is sort of the inverse of what we classically think of as link penalties, where we've gotten links that have pushed us up in the rankings, and they are from bad places, linking out to bad places or to good places for bad reasons, bad reasons being manipulative reasons, someone's paid you, you're getting some benefit from it. Google recently, a few months ago, made this announcement around how if bloggers are receiving free items from companies, and then they're linking back to those products, that could be penalized or could be perceived as violating FTC rules if there's not an advertisement or advertorial sponsor message on there. So all kinds of things here. 2) Linking to internal pages or other sites you own or control. All right. Let's move over to internal links. On internal links, we've got a little bit of the same story but with some caveats. So again, my mobile phones compared page is here. I could be linking off to my own review. I could be linking off to my video category, maybe if I've got a video at the bottom of this page. I'm providing navigation. I'm helping visitors go where they want to go. This is a very positive thing. It cannot only help to get those pages indexed and crawled, it may also help them rank higher with a few caveats. So the right internal links, good ones, can have a large positive impact across a big website. Internal links that tend to perform the best, the ones that help the most tend to be the ones that drive real traffic, and they sort of continue a visitor's journey. They help people find what they're looking for, and it's also the case that the ones that don't drive traffic, that aren't perceived as helpful seem to have less of an impact on the pages they link to. Now, I will point this out. If you're worried about like, \"Oh, should I add one more link on here to another category page, or should I reference another page from here,\" you generally don't need to worry about that. As long as you think that some small portion, even a small portion of your audience would be potentially interested in that and it makes sense from a usability perspective, you should go ahead and add the link. I don't tend to worry at all about like, \"Well, the difference between 52 links on a page and 53 links is those 52 links will get a little bit less PageRank or a little bit less link energy, whatever it is, voting power than the 53rd link.\" I would not sweat that at all. Those days are long since gone. But it is true that internal links tend to have the largest impact on already authoritative sites. If you've already got a lot of authority on your site, you can help many of the pages deep in your site structure to get crawled and indexed and to rank better by linking to them. We've seen this pretty substantially with some very big websites lately where they've gone through these redesigns and had remarkable results. That said, manipulative links, for example, let's say I went through and I just wrote a little bot that crawled my entire website, found every instance of the word \"LG,\" the manufacturer, the phone manufacturer and linked to my LG page. It gets a little manipulative. There's probably some places where it makes great sense, but every single time the word is mentioned — you've probably seen some websites like these, although fewer of them in the last three or four years than in the five years before that when this tactic was really prevalent and Google wasn't penalizing for it. We've actually seen examples where people removed that, and they made it much more subtle. They only did it on the first instance of the word on a page, and they only did it on category-level pages or blog-level pages, not deeply index pages or paginated versions of things, that kind of stuff. In fact, they saw their rankings rise. I love this. They saw their rankings rise like almost immediately. There was a really a cool example a few years back. I think I might have done a Whiteboard Friday about that (correction: I didn't do a WB Friday on this topic after all - apologies!). So with manipulative internal links, especially ones that are stuffed into footers or jammed into every word instance or those kinds of things, Google tends to perceive that as manipulative, which in fact it really is. You're not doing that for visitor's benefit. You're hoping that it helps you with your rankings, and in fact it's probably doing the opposite. General rule of thumb: If you can't find any way to justify how something that you're doing for SEO also benefits a visitor, maybe you should reconsider it, with a few exceptions. XML sitemaps might be a reasonable one. It's the case that oftentimes the ones that are in footers or in structured template areas of a website that tend not to get clicked by people, sometimes a sidebar can do it, sometimes top nav can do it, sometimes even in-content stuff that's wrapped around can do it, that tends to be the most dangerous places, but it's not the only kind that gets penalized. In fact, it's not even always bad. We've seen instances again on very big websites where they've done very significant footers and linked off to all their properties that the site or the company owns and controls. We've seen it where they use it to get greater indexation, and in fact it's positive because the footer is well done, because it tends to link to good places, because it's clearly a high-quality one, and it's not anchor text stuff. Anchor text is again a big risk here with internal linking. So this is a very fine line, and it's a fine meandering line. I can't give you a clear-cut \"never do this, always do this.\" It's a considered process. That's true for internal linking, and it's true, maybe a little less true for external linking. If you've got great advice that you'd like to share, or some experiences, or you want us to take a look at some of your internal or external linking practices, feel free to leave a comment. We'll check them out, and I'll see you again next week for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Linking Internally and Externally from Your Site - Dangers, Opportunities, Risk and Reward"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Linking Internally and Externally from Your Site - Dangers, Opportunities, Risk and Reward"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "1) When you're linking to external sites and pages."
    },
    {
      "level": "H2",
      "text": "2) Linking to internal pages or other sites you own or control."
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}