{
  "url": "https://moz.com/blog/livejournals-awesome-404-error",
  "slug": "livejournals-awesome-404-error",
  "title": "Livejournal's Awesome 404 Error - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When dealing with client recommendations for design, usability, and accessibility, we always stress the importance of a custom 404 page. Why? Because I think everyone gets a little sick of seeing standard pages that do little to direct users toward a useful solution. These boring, default 404s are…",
  "content": "Livejournal's Awesome 404 Error Design K By: katfive July 31, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! K By: katfive July 31, 2006 Livejournal's Awesome 404 Error Design The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. When dealing with client recommendations for design, usability, and accessibility, we always stress the importance of a custom 404 page. Why? Because I think everyone gets a little sick of seeing standard pages that do little to direct users toward a useful solution. These boring, default 404s are not friendly, they're hostile. And without the proper presentation they risk scaring away less savvy visitors who might not be content to just hit the Back button and get over it. I stumbled across a witty custom 404 page this weekend. Though an extreme example (and slightly stupid) Livejournal's server error made me smile: Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Livejournal's Awesome 404 Error"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Livejournal's Awesome 404 Error"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "katfive\n          \n            katfive"
}