{
  "url": "https://moz.com/blog/live-blogging-extra-extra-the-social-news-sites-at-smx-social-media",
  "slug": "live-blogging-extra-extra-the-social-news-sites-at-smx-social-media",
  "title": "Live Blogging \"Extra! Extra! The Social News Sites\" at SMX Social Media - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Having just wrapped up my presentation for Linkbait: Chumming for Traffic on Social Media Sites (I linked to Vanessa Fox's session coverage on Search Engine Land in case you want a recap), I thought I'd turn the tables and live blog Extra! Extra! The Social News sites. \n\n(Side note: My allergies…",
  "content": "Live Blogging \"Extra! Extra! The Social News Sites\" at SMX Social Media SEO Events By: Rebecca Kelley October 16, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley October 16, 2007 Live Blogging \"Extra! Extra! The Social News Sites\" at SMX Social Media SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Having just wrapped up my presentation for Linkbait: Chumming for Traffic on Social Media Sites (I linked to Vanessa Fox's session coverage on Search Engine Land in case you want a recap), I thought I'd turn the tables and live blog Extra! Extra! The Social News Sites. (Side note: My allergies have been a pain in the ass ever since I got to New York, and as such, I guzzled two and a half bottles of water during my session to minimize Scratchy Throat Syndrome. As a result, I may have to make repeated runs to the bathroom, so coverage for this session could be a bit fragmented. Thanks, tiny bladder.) Neil Patel, co-host of SMX Social Media and Digg extraordinaire, starts off by talking about porn. He said something about how he loves Digg like boys love porn. I bet he loves porn, too. Don't lie, Neil. Okay, now he's swearing. A lot. I think he's part pirate. Neil gives a quick overview of Digg and says that if the story gets a ton of buries, it'll get knocked off the front page. Why should you care about Digg? The average story that makes the home page gets 129 links and great branding benefits. It also gets a ton of traffic--some of Neil's clients have gotten over 10,000 visitors in one hour. Now Neil is going all mimbo about being in The Wall Street Journal. I can't believe people take this guy seriously. Requirements for being on Digg are having a website. He actually said that. Well, he clarified by saying you need content, pictures, video, or audio, and he specifically recommends leveraging the video section. Important factors include the number of votes, the amount of time it takes to collect votes, voters (have them be active, diverse users), the submitter, and friends (act like a \"Tom Cruise\" and befriend everyone out there). Unwritten rules: no self promotion! If you are going to do it, be smart about it. Use a non-company specific user name. Also, don't pay for votes. Digg doesn't like it when people pay for votes. Don't spam, either. Oh, and Digg hates SEOs. Neil provided an example of how some dude outed him as an SEO/\"spammer,\" and for a couple weeks after that all of his submissions got flooded with \"This dude's a filthy SEO spammer\" comments. Fun facts about Digg: .7% of all stories get to the home page. Yikes. He then cites Rand's SEOmoz post about how the top 100 Diggers control 56% of the content on the home page. Thirdly, you can't control what people say. The reality is that you can't control the comments on Digg, so you might as well embrace the attention you're getting and hope to get votes. Very eloquent, Neil. Tamar Weinberg is up next. She looks nervous. It's her first public speaking gig and apparently Danny made her appear on the panel so she can talk about how much of a Digg Rockstar she is. I bet it'll be a while before she forgives him. She'll be talking about Digg Tips and Tricks (she practiced her presentation on me the night before, which was quite adorable). She starts off with some advice for content that wins. Viral content is key, such as lists, games and quizzes, controversy, tools, breaking news, videos, pictures, and tech/science-related stories. She reiterated what Brent focused on in the earlier session, which is that a solid title and description are extremely critical. Don't put unrelated content on a salesy site. Diggers are pretty savvy and will see that a story about blogging tips looks funny being on a mortgage website. Next, Tamar gives advice for promotion as a Digg user. She recommends making yourself identifiable by getting an avatar and providing contact information (such as a link to your blog, your email address, IM screen names, etc). Befriend users and Digg their stories before they get popular. Also, comment on stories early--the snarkier, the better. If you're going to try and promote your Digg stories, do it privately to be safe. Pownce, Twitter, and Facebook are popular networks for leveraging diggs, but they're a bit riskier. Tamar recommends a couple tools to enhance your Digg experience, such as the smart Digg button, the Digg Alerter, and the Social Media add on for Firefox (which Jane blogged about). She talks about things to note. (Tamar, use less text next time. I'm in the back of the room and can barely read these!) First, Diggers hate \"marketed\" or \"SEO'd\" content. Avoid jargon/terminology in titles and the descriptions that can kill your story's potential. Also, don't just ask someone to digg your story when networking. Become friends and have similar interests--don't just spam people and ask for votes all the time. Also, Digg's algo plays on the diversity of the number of Diggs per story within a specific time frame. Don't get the same people to digg your story over and over again. Also, don't promote your story too quickly, or it will seem unnatural. Check out the stories in the Upcoming section to promote your stories to the front page. Once you're on page 1-2 of Upcoming, you're usually on the path to getting on the home page. Some lesser-known tricks she recommends are promoting your Digg content elsewhere (e.g. StumbleUpon). Also, subscribe to the Digg RSS feed and check it regularly for dupes and trends (you can do the same by browsing through the Digg archives). Focus on categories when submitting. Certain categories require fewer diggs than others to get to the front page. A really interesting tip Tamar shares is that if you become a popular user, you'll require more diggs from more users to get your stuff to the home page. You can either stop submitting for a few days to reduce your popularity (so you'll need fewer diggs again), or you can just continue to submit as-is (but you'll need a lot more votes). Newer users have a better chance of hitting the home page since they'll require fewer diggs. And she's done! Well done, Tamar. You're no longer a presenting virgin. Wahoo. Next, Chris Winfield talks about how to Digg Your Way to the Top. Why would you want to be on the Digg home page? Well, for traffic and exposure (and, of course, links). Chris asserts that sales are also a big incentive. People can come into your site and realize that it exists and what it offers, which can potentially lead to sales/conversions. Chris recommends that you understand the Digg landscape. Know the language (e.g. \"ftw,\" \"i can has?\", \"RTFA\"). Also, know what Diggers like (Apple products, Heroes, The Office, Ron Paul). More importantly, know what Diggers don't like (the RIAA, Fox News, George W. Bush). Don't do press releases--they're boring and don't work on Digg. Also, don't overtly sell anything or \"fake\" it. What does work? Know your audience. Digg loves Chuck Norris, videos, and seeing things get destroyed. Chris submitted a video that answers the question of \"Will Chuck Norris Blend?\", and there you have it, Diggers ate it up. Also, get featured on a popular blog--it's easier to get on the Digg home page that way. He mentions as well that sometimes all it takes is a creative idea to get on Digg (e.g. one company buys Radiohead's newest set-your-own-price CD for $1,000). Chris goes into some more case studies, but he's zipping through them pretty quickly (though I did catch him making fun of Michael Gray's obsession with all things Disney). Chris stresses the importance of crafting good titles and descriptions and choosing the appropriate category. His case study resulted in over 20,000 visitors from Digg in a 24 hour period. Successful Digg stories spread to other social networks (he gets a ton of traffic from StumbleUpon) and to influential blogs. Lastly, Chris gives one Digg tip to live by: have good hosting. We talked about this in our link bait panel, so I'm sure the audience will get this hammered into their heads over the next two days. GOOD HOSTING GOOD. BAD HOSTING BAD. Okay, time for Q&A. I have to blow my nose. And go to the bathroom (again). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Live Blogging \"Extra! Extra! The Social News Sites\" at SMX Social Media"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Live Blogging \"Extra! Extra! The Social News Sites\" at SMX Social Media"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}