{
  "url": "https://moz.com/blog/living-without-the-linkerati",
  "slug": "living-without-the-linkerati",
  "title": "Living Without the Linkerati - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Rand's post on Monday \"The Secret to Ranking at the Search Engines (that's really no secret at all)\" highlights the importance of website content appealing to the linkerati for the purposes of encouraging plenty of high quality, on-topic (possibly) and most impo...",
  "content": "Living Without the Linkerati Link Building J By: James Wittering March 19, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! J By: James Wittering March 19, 2007 Living Without the Linkerati Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Rand's post on Monday, \"The Secret to Ranking at the Search Engines (that's really no secret at all)\", highlights the importance of website content appealing to the linkerati for the purposes of encouraging plenty of high quality, (possibly) on-topic, and most importantly, natural inbound links. All good. Makes sense. One problem: My first thought was \"Oh my god - I knew this was on the cards and now Rand has said it it must be real and I have to face it. I'm a small SEO company and I have small clients and none of them are even remotely \"linkerati\" worthy. So we are all doomed...\" My client base is made up of local (to me in the UK) companies who are looking for a competitive edge on the web. I am not based in London, Manchester, or Birmingham, and as such, do not compete with SEO firms in those larger cities. I have been able to involve myself in the local business community, and most of my business comes from word of mouth referrals. Consider a typical client of mine: A nursing agency looking to dominate the rankings for people searching for their services, in several key areas, locally. It's fairly straightforward. I'm addressing the conversion rate of the website, managing a PPC campaign that shows them a good ROI allied to that conversion rate, and building appropriate links for future organic rank joy. So, what's the problem? My typical client, much like many of yours, I suspect, is not exactly within an industry that holds much \"respect\" for the \"linkerati.\" It's not a natural destination for the geek set. It's not likely that linkbait content with headlines like \"Top 5 Ways to Care for the Elderly\" is going to make the front page of digg. Neither are videos of nurses fighting whilst installing linux* going to be considered appropriate content for their site. Neither will their budget stand the excitement if we get truly creative. Clients like this and thousands like them are the bread and butter for many of us. And we know that appealing to the linkerati is not always a realistic proposition. Does this mean that smaller clients will not be able to compete in the long term and that we, as smaller SEO firms, need to either get bigger, geek-friendly clients or forget about it? After a bit of thought I decided that - no - there's nothing really to worry about, and I felt an urge to impart this just in case anyone else was worried about it, too. Or just mildly interested... It's all relative. Our clients may be smaller and our topics may not have the geek appeal nor the budgets to become geekified, but neither do our client's competitors. My nursing agency is competing against other local nursing agencies. They don't need the quantity of link currency that the linkerati grant the geeks. They just need the best links they can get to suit the purpose, appropriate on-site considerations, solid landing pages, and plenty of thought applied to conversion rates. I suspect that this applies to the majority. The world isn't generally a geeky place - it's more high-streety. Geeks rule the links but demand is fed by users, and most users are just looking to solve a problem, not share a story. Clearly, at the top end, where Rand is, there are some big budgets laden with geek love potential, and to compete here obviously requires this approach. But that is the exception for me. The rule is much more modest, and for now I think I can live without the linkerati. * I've actually got some of these, if anyone's interested... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Living Without the Linkerati"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Living Without the Linkerati"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "James Wittering\n          \n            James Wittering"
}