{
  "url": "https://moz.com/blog/local-seo-expert-roundup",
  "slug": "local-seo-expert-roundup",
  "title": "The State of Local SEO: Experts Weigh in on Industry-Specific Tactics - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We asked five local SEO experts to zero in on the trends and tactics businesses across five industries should focus on to get ahead — and stay ahead — during this time.",
  "content": "The State of Local SEO: Experts Weigh in on Industry-Specific Tactics Local SEO | Marketing Industry By: Miriam Ellis October 19, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis October 19, 2020 The State of Local SEO: Experts Weigh in on Industry-Specific Tactics Local SEO | Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The COVID-19 pandemic has upended the way we engage with local businesses. We're ordering more food for delivery, spending more money in online shops, and checking for safety measures on the web listings of businesses of all kinds. But what do these new trends mean for the ways businesses market themselves online? We asked five local SEO experts to zero in on the trends and tactics businesses across five industries should focus on to get ahead — and stay ahead — during this time. For more local insights, download our State of Local SEO Industry Report. 1. 70% of local marketers reported marketing budget cuts due to COVID-19, leading marketers to focus even more on the most impactful local SEO campaign elements. Which three local search marketing tactics are delivering the most value for businesses right now, and why? Phil Rozek: Health and Wellness Services 1. Detailed, recent reviews — especially on Google Maps, but preferably also on other sites. 2. Where applicable, a “telehealth”-type page that goes into great detail on what specific problem(s) the doctor or wellness profession can help with remotely. 3. A detailed page on every specific service, procedure, or condition the practice handles, each with a section that explicitly states whether a telehealth or similar “virtual” option is applicable to it. Joy Hawkins: Legal Services 1. Link building. A lot of businesses have a hard time getting quality links on their own, so when you have link building tactics at an agency that work, it can be a huge value add. 2. Optimizing internal linking structure on the business website. Most websites for small businesses are not structured properly, and making a few adjustments to internal linking can make fairly impressive changes in the search results. It also impacts both the local and organic search results, just like link building. 3. Localizing content on the website. Taking existing pages on a business’ website and optimizing them for city, county, or state queries can have really great impacts on both local and organic results. We’ve also seen great results from optimizing for “near me” queries. Tweet this! Blake Denman: Home Services For home services, identifying and reporting Google My Business spam/violations are the most impactful. Why? If you’re using accurate rank tracking and see that you rank #5 for a popular keyword in your target market BUT three of the listings above you are violating Google My Business guidelines, getting those listings updated or removed (depending on the violation) would move you up three spots. Knowing the Google My Business guidelines is crucial along with knowing how to spot violations. The second most impactful marketing “tactic” is implementing and maintaining a review building strategy. You can’t outrank a sh*tty reputation. The third most important marketing tactic is understanding who your customers are, where they live, how you can relate to them, and what they care about. From a strategic standpoint, the more information you have on your target customers, the more you’re able to get involved in the local community that they belong to. For local search, I’m of the opinion that Google wants to highlight popular companies from the offline world in the online world. Start focusing on building a better, LOCAL brand. Brodie Clark: Hospitality For restaurant and hotel listings in particular, there’s certainly a lot that can be done to stand out from other listings. With COVID, both categories have been impacted heavily. Many listings needed to either be marked as “Permanently Closed” or the newly created “Temporarily Closed”. Three tactics that are important to utilize right now include: Effective attribute usage: There are now attributes in GMB for “Health & Safety” and “Service Options”. Both are extremely important right now, especially the mask-related attributes, which can give customers a lot of reassurance. The same goes for how hospitality businesses are operating with respect to whether there are in-store or pick-up options.Google Post notices: Google Posts are an effective way of communicating important changes to operations. The COVID-19 update post is a great one to use because it never expires. But there is the downside that other posts are buried as COVID-19 posts are given prominence. (Note: hotels don't have the option to use Google Posts.)Proactive updates: For hotel listings, GMB can be a complicated space with how booking sites are deeply integrated into the UI. As COVID regulations change based on your location, details on these sites need to be kept updated quickly to reach customers and avoid negative experiences. Amanda Jordan: Financial Services Make sure that your GMB listings use the COVID posts to share information about how you are keeping your clients safe. Our financial client created COVID landing pages for both personal and business accounts. This client saw a 95% increase in organic goal completions from February to March. There was also a 97% increase in organic goal completions YoY. Google posts that focused on coronavirus-related services and products have also performed well. 2. 75% of marketers agree that elements of Google My Business profiles (categories, reviews, photos, etc.) are local search ranking factors. Which three GMB elements do you recommend businesses focus on right now to influence their local pack rankings, and why? Phil Rozek: Health and Wellness Services Number one: reviews. Number two: categories — particularly the “primary” category. Number three: getting your “practitioner” GMB pages right, by which I mean you’ve got a detailed “bio” page serving as the GMB landing page, a primary category that reflects the practitioner’s specialty, and Google reviews for each practitioner from their patients. Joy Hawkins: Legal Services There are only four elements inside Google My Business that really impact ranking. Since the first one is the business name, I’d suggest focusing on the other three: Reviews, the page on your website you link the listing to, and the categories you choose. For example, in this article, I detailed the difference between the family lawyer category and the divorce lawyer category, and which keywords they correlate to. Blake Denman: Home Services Specifically for the home services industry, adjusting your primary category in Google My Business when seasons change. HVAC company? Winter is fast approaching, your primary category should be changed to a relevant heating category instead of your summer category, AC. Your primary Google My Business category is going to have more of a ranking improvement than secondary categories. I hate to sound like a broken record, but take a look at all of your competitor’s listings for Google My Business violations. And finally, reviews are going to make or break your listing. If you haven’t implemented a review building strategy by now, you really need to get one set up ASAP. Tweet this! Brodie Clark: Hospitality As a starting point, opening hours and whether a listing is marked as permanently/temporarily closed are major influencers of local pack rankings. Each is key to showing up at all, but incremental increases can certainly be achieved with gaining a high volume of positive reviews and making sure both your primary and secondary categories are set effectively. With categories, a great place to start is completing a competitor analysis with GMBspy Chrome extension. Amanda Jordan: Financial Services Reviews are one of the most important ranking factors, as well as being important for improving conversions. Second is the proximity to searchers — are there ATMs or branches that currently do not have GMB listings? New listings can help increase visibility in Google Maps. Build local links. Now is a great time to work on link building. Try to find directories and organizations specific to your geographic location to join. 3. 90% of our survey respondents agree that GMB reviews influence local pack rankings. What advice can you offer businesses looking to maximize the value of reviews? Phil Rozek: Health and Wellness Services Stop going for easy, fast, drive-by email requests, and start trying to identify patients who might go into a little detail in their reviews. Lazy requests result in lazy reviews. At the very least, don’t send “Dear Valued Patient”-type requests by email, but ideally you also find a discreet way to ask in-person, with a follow-up email to come later. See my 2017 post on “Why Your Review-Encouragement Software Is a Meat Grinder”. These days, more than ever, patients want to know things like what safety and hygiene procedures you follow, what wait times are like, whether the standard of care has changed, etc. Longtime patients are in the best position to write crunchy, detailed reviews, but you should encourage every patient to go into as much detail as they can. Try having a designated “review person” who knows a thing or two about any given patient, and will take a couple of minutes to make a personal and personalized request. Do it because you want “keywords” in your reviews, and because a five-star review that doesn’t impress anyone won’t help your practice much. Tweet this! Joy Hawkins: Legal Services Make sure you ask every customer for a review and come up with a process that is streamlined and easy to keep organized. We normally suggest using a paid platform for review management (we use GatherUp) because it can automate the process and send reminders to people who haven’t responded yet. Blake Denman: Home Services Figure out the best method for earning reviews. Test email, texting, and in-person requests from your team, physical cards with a bit.ly link, etc. Test each one for a few months, then switch to a different method. Test until you find the method that works best for your customers. The other thing that really needs to be considered is how to get customers to write about the specific services they used when working with your company. Little prompts or questions that they could answer when you reach out will help customers write better reviews. Brodie Clark: Hospitality Getting reviews on GMB has never been easy. You can always try to take the manual route, but that’s impossible to properly scale. I rely on and recommend using GatherUp for hospitality business with multiple listings that need an integrated strategy to gather reviews effectively. The upside of using GatherUp is that you can capture first party reviews to use on your website or as an internal feedback mechanism. Amanda Jordan: Financial Services My number one tactic for reviews has always been to have an actual person ask for a review during key points in the customer journey. For example, an associate that helps someone open a checking account, a mortgage advisor who is helping a family refinance their home, etc. 4. Prior to the COVID-19 pandemic, 78% of local marketers agreed with Mike Blumenthal's popularized concept that Google is the new homepage for local businesses. Do your observations and analytics data indicate that this concept is still correct? Has the role of websites for currently operational businesses grown or decreased as a result of the public health emergency, and what does that mean for those websites? Phil Rozek: Health and Wellness Services I’ve never been too much of that school of thought, and have been even less so since roughly the start of the COVID era: See my March 26, 2020 post: “Is COVID-19 the End of “Google As Your New Homepage?” For casual, drop-in businesses, where customers or clients don’t need to do much research or make a big decision, I could see how maybe Google has made the SERPs an almost-suitable substitute for the homepage. That may also be true of medical practices to the extent they have current or returning patients who just want or need quick information fast on a practice they’re already familiar with. But when people’s health is at stake, they tend to dig a little deeper. Often they want or need to find out what procedures a practice does or doesn’t offer, learn more about the doctors or other staff, learn more about insurance and billing, or confirm what they saw in the search results. Joy Hawkins: Legal Services I agree that Google My Business is becoming a more important factor, as there are a ton of options that Google is pushing out due to COVID-19 that you can take advantage of. For example, you can use the online appointments attribute, which shows up prominently in the Knowledge Panel and the 3-pack. They also recently added online operating hours as an additional hours set. I think it’s important, though, for people to realize that Google My Business is mainly there to provide the opportunity to share more about what your business does and provide ways for customers to contact you. Most of the fields inside Google My Business do not impact ranking. Traditional SEO factors are needed to make sure your business actually ranks on Google, and then Google My Business will help ensure those customers see the right information. Additionally, Google My Business has not replaced the need for a website — it’s simply another place that needs to be monitored and updated frequently. Blake Denman: Home Services Yes, Google My Business might be the first interaction people have with before (or needing) to go to your website. Websites are still really important — not just for traditional organic SEO, but for traditional SEO signals that influence Google My Business rankings, too. Since the public health emergency emerged, we’re seeing an uptick in traffic to websites. Yes, you can add certain attributes to your GMB listing to address public health concerns, but people need more information. What kinds of protocols are you taking? How far out are you booked? Brodie Clark: Hospitality It really depends on the business type, but at the moment, many local businesses (especially in hospitality) are under a lot of pressure. This means they might not have the capacity to keep their websites updated or their GMB listings in check. So, they’re having to resort to food delivery services like UberEats — which has become far more mainstream in recent years, and I’m guessing there’s been an increase during 2020. And hotels, where I’m located in Melbourne, anyway, haven’t been able to operate for some time, but I probably wouldn’t be relying on their GMB listing to give the most up-to-date information. Amanda Jordan: Financial Services The role of the website has definitely grown for our financial clients. Websites are hubs for useful information, especially in the case of a crisis or for products and services that play a large role in your life. For many business categories, the information found on GMB listings is enough to get conversions. Consumers do significant research when choosing a financial product, and they need all of the information they can get to make a well-informed decision based on rates, fees, and policies. Tweet this! 5. Only 39% of marketers feel that Google's emphasis on user-to-business proximity always delivers high-quality results. In the industry, does Google tend to prioritize proximity over quality for core search terms? Would you say they over-emphasize proximity in your experience? Phil Rozek: Health and Wellness Services That’s truest in saturated industries, in my experience. But in more specialized fields, or for more specific (niche) terms, Google doesn’t seem to fixate on proximity as much. To some extent that’s because it can’t: Google needs to go a little farther afield to grab enough relevant results to fill up a page or a 3-pack. Joy Hawkins: Legal Services Absolutely. Proximity is one of the main reasons why spam is a problem in the legal services industry. Marketing companies will create lead-generating Google My Business listings and be able to get them to rank simply based on having keyword-rich business names. They create them in mass so they rank when people close to them are searching (due to the proximity factor). Here is an example of some of the spam we see in the legal services industry. Blake Denman: Home Services Proximity for certain types of industries (restaurants, coffee shops, dry cleaners, etc.) are great, but for others, like home industries, they are not. Most home service businesses should not be displaying their address since they are a Service Area Business, but this doesn’t stop some from keeping their address up to rank in that city. Google does tend to prioritize proximity in the home services industry, unfortunately. Tweet this! Brodie Clark: Hospitality I think Google does a reasonable job at dialing up the proximity meter where necessary. If you were to pin keywords in a business listing name against proximity, keywords in the business name would win nine times out of 10. So in that instance, other signals should be dialled up further, but proximity may only be relevant in certain cases. Amanda Jordan: Financial Services Absolutely. With digital banking and the amount of trust we put into financial organizations, proximity isn’t a major factor when considering a financial service provider, but Google results don’t reflect that. Proximity is a much bigger factor when you’re choosing a place to order takeout from than it is when you’re choosing who to trust with your 30-year mortgage. Reviews should definitely play a bigger factor than proximity for financial institutions. 6. 91% of marketers tell us they have a strategy in place for capturing featured snippet visibility in the SERPs. Which featured snippets should businesses focus on most, and why? Phil Rozek: Health and Wellness Services Focus on FAQs, particularly on your “service,” “treatment,” or “condition” pages. Focus on those sorts of pages rather than on blog posts or other purely informational resources, which generally are less likely to help bring you new patients. Those FAQs and your answers, of course, should be specific to the service, treatment, procedure, or condition you describe on a given page. The questions should be phrased in the way your patients (or searchers) would phrase them, and your answers should be blurb-length and relatively simple. Joy Hawkins: Legal Services I have seen featured snippets for lots of really long-tail, commercial-intent keywords that probably shouldn’t have featured snippets. These can be really amazing sources of traffic if you get one of them (see photo below). Additionally, creating content around things like “can you sue for [insert information]” can be a great way to win featured snippets. Tweet this! Blake Denman: Home Services With more and more personalization coming into the SERPs, I believe that featured snippets will become more and more regionally specific. If you do a search for “new water heater cost” you see a featured snippet for Home Advisor. If a company that is local to me published content around the cost and installation, why wouldn’t Google serve that snippet to me instead of what is shown nationally? Brodie Clark: Hospitality Featured snippets are a topic that I write about regularly. When it comes to hospitality businesses, featured snippets can be a lower-end priority. According to the MozCast, featured snippets appear on ~9% of all SERPs in the ~10K MozCast query set. I would expect it to be lower than that for most hospitality businesses. Focus on the featured snippets that provide the highest return for your time, and ensure you’ve got a tracking strategy in place. I wrote a post recently that described a method for using Google Analytics and Google Tag Manager to capture these insights. Tweet this! Amanda Jordan: Financial Services We teach our financial clients to focus on educating their customers by making sure we research the right topics and provide the best possible answer. Paragraph, table, and carousel featured snippets are typically the types that we see financial websites achieving most often. 7. We saw an increase in the number of consultants advising clients about offline strategy, instead of keeping strictly to online SEO consulting. What can businesses be doing offline right now to strengthen their chances of success? Phil Rozek: Health and Wellness Services Don’t keep patients waiting anywhere close to how long they’d wait pre-COVID. Patients should think, “I wish it happened under better circumstances, but I do like that I don’t wait around as much as I used to.” Make sure your patient-facing staff are always friendly, patient, and organized. Many practices get bad reviews online not because of the doctor(s), but because of complaints regarding staff. Yes, admins and other staff have a tough job, and no, patients aren’t always reasonable. Just the same, staff-patient issues can bring down a practice. Continually working with staff on soft skills is time well-spent. Get to know more doctors or business owners outside of your field of practice. Occasionally they have great ideas that you can adapt to your situation, to your practice. Joy Hawkins: Legal Services I would focus on tactics offline that would increase branded searches on Google. Branded searches are one of the things we’ve found that correlate with your business getting a place label on Google Maps. Our study on this is releasing later this year. Blake Denman: Home Services Start focusing on building a BETTER. LOCAL. BRAND. I’ve come across websites that have a horrible backlink profile or haven’t updated their website since 2010, yet they rank prominently in their market — why? They have been involved in their local community for a long time. If you know who your customers are and have dived into your affinity categories in Google Analytics, you will have a really good understanding of what your target audience cares about outside of your service. Brodie Clark: Hospitality Talk to your customers. Ask them questions and understand their concerns. Taking important conversations offline still plays an important role in your marketing strategy. Amanda Jordan: Financial Services Review strategies should include offline tactics. Community outreach and involvement are crucial. I would argue that anyone who is consulting about online reputation management should focus on the company’s reputation offline as well. Tweet this! Every business is different and no tactic is one-size-fits-all. As with all good things in SEO, the key is testing. Whether you’re releasing a new product or service, upleveling your review management process, or changing the way you use Google My Business, we encourage you to try out some of these expert tips to see what will stick for your business. Have a local SEO strategy that’s working well for your business, or want us to feature your industry in our next post? Let us know in the comments below. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The State of Local SEO: Experts Weigh in on Industry-Specific Tactics"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The State of Local SEO: Experts Weigh in on Industry-Specific Tactics"
    },
    {
      "level": "H2",
      "text": "1. 70% of local marketers reported marketing budget cuts due to COVID-19, leading marketers to focus even more on the most impactful local SEO campaign elements. Which three local search marketing tactics are delivering the most value for businesses right now, and why?"
    },
    {
      "level": "H3",
      "text": "Phil Rozek: Health and Wellness Services"
    },
    {
      "level": "H3",
      "text": "Joy Hawkins: Legal Services"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Blake Denman: Home Services"
    },
    {
      "level": "H3",
      "text": "Brodie Clark: Hospitality"
    },
    {
      "level": "H3",
      "text": "Amanda Jordan: Financial Services"
    },
    {
      "level": "H2",
      "text": "2. 75% of marketers agree that elements of Google My Business profiles (categories, reviews, photos, etc.) are local search ranking factors. Which three GMB elements do you recommend businesses focus on right now to influence their local pack rankings, and why?"
    },
    {
      "level": "H3",
      "text": "Phil Rozek: Health and Wellness Services"
    },
    {
      "level": "H3",
      "text": "Joy Hawkins: Legal Services"
    },
    {
      "level": "H3",
      "text": "Blake Denman: Home Services"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Brodie Clark: Hospitality"
    },
    {
      "level": "H3",
      "text": "Amanda Jordan: Financial Services"
    },
    {
      "level": "H2",
      "text": "3. 90% of our survey respondents agree that GMB reviews influence local pack rankings. What advice can you offer businesses looking to maximize the value of reviews?"
    },
    {
      "level": "H3",
      "text": "Phil Rozek: Health and Wellness Services"
    },
    {
      "level": "H3",
      "text": "Joy Hawkins: Legal Services"
    },
    {
      "level": "H3",
      "text": "Blake Denman: Home Services"
    },
    {
      "level": "H3",
      "text": "Brodie Clark: Hospitality"
    },
    {
      "level": "H3",
      "text": "Amanda Jordan: Financial Services"
    },
    {
      "level": "H2",
      "text": "4. Prior to the COVID-19 pandemic, 78% of local marketers agreed with Mike Blumenthal's popularized concept that Google is the new homepage for local businesses. Do your observations and analytics data indicate that this concept is still correct? Has the role of websites for currently operational businesses grown or decreased as a result of the public health emergency, and what does that mean for those websites?"
    },
    {
      "level": "H3",
      "text": "Phil Rozek: Health and Wellness Services"
    },
    {
      "level": "H3",
      "text": "Joy Hawkins: Legal Services"
    },
    {
      "level": "H3",
      "text": "Blake Denman: Home Services"
    },
    {
      "level": "H3",
      "text": "Brodie Clark: Hospitality"
    },
    {
      "level": "H3",
      "text": "Amanda Jordan: Financial Services"
    },
    {
      "level": "H2",
      "text": "5. Only 39% of marketers feel that Google's emphasis on user-to-business proximity always delivers high-quality results. In the industry, does Google tend to prioritize proximity over quality for core search terms? Would you say they over-emphasize proximity in your experience?"
    },
    {
      "level": "H3",
      "text": "Phil Rozek: Health and Wellness Services"
    },
    {
      "level": "H3",
      "text": "Joy Hawkins: Legal Services"
    },
    {
      "level": "H3",
      "text": "Blake Denman: Home Services"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Brodie Clark: Hospitality"
    },
    {
      "level": "H3",
      "text": "Amanda Jordan: Financial Services"
    },
    {
      "level": "H2",
      "text": "6. 91% of marketers tell us they have a strategy in place for capturing featured snippet visibility in the SERPs. Which featured snippets should businesses focus on most, and why?"
    },
    {
      "level": "H3",
      "text": "Phil Rozek: Health and Wellness Services"
    },
    {
      "level": "H3",
      "text": "Joy Hawkins: Legal Services"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Blake Denman: Home Services"
    },
    {
      "level": "H3",
      "text": "Brodie Clark: Hospitality"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Amanda Jordan: Financial Services"
    },
    {
      "level": "H2",
      "text": "7. We saw an increase in the number of consultants advising clients about offline strategy, instead of keeping strictly to online SEO consulting. What can businesses be doing offline right now to strengthen their chances of success?"
    },
    {
      "level": "H3",
      "text": "Phil Rozek: Health and Wellness Services"
    },
    {
      "level": "H3",
      "text": "Joy Hawkins: Legal Services"
    },
    {
      "level": "H3",
      "text": "Blake Denman: Home Services"
    },
    {
      "level": "H3",
      "text": "Brodie Clark: Hospitality"
    },
    {
      "level": "H3",
      "text": "Amanda Jordan: Financial Services"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}