{
  "url": "https://moz.com/blog/local-transparency-empathy-holidays-tips-checklist",
  "slug": "local-transparency-empathy-holidays-tips-checklist",
  "title": "Local Business Transparency & Empathy for the Holidays: Tips + Downloadable Checklist - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Consumers expect brands to be responsive and empathetic, especially during the holidays; if you're not, you risk both sales and dreaded 1-star reviews. Learn how to guard your business and delight your customers (we've got a checklist to help!).",
  "content": "Local Business Transparency & Empathy for the Holidays: Tips + Downloadable Checklist Local SEO By: Miriam Ellis September 12, 2018 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis September 12, 2018 Local Business Transparency & Empathy for the Holidays: Tips + Downloadable Checklist Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Your local business will invest its all in stocking shelves and menus with the right goods and services in advance of the 2018 holiday season, but does your inventory include the on-and-offline experiences consumers say they want most? Right now, a potential patron near you is having an experience that will inform their decision of whether to do business with you at year’s end, and their takeaway is largely hinging on two things: your brand’s transparency and empathy. An excellent SproutSocial survey of 1,000 consumers found that people define transparency as being: Open (59%) Clear (53%) Honest (49%) Meanwhile, after a trying year of fake news, bad news, and privacy breaches, Americans could certainly use some empathy from brands that respect their rights, needs, aspirations, and time. Today, let’s explore how your local brand can gift customers with both transparency and empathy before and during the holiday season, and let’s make it easy for your team with a shareable, downloadable checklist, complete with 20 tips for in-store excellence and holiday Google My Business best practices: Grab the Holiday Checklist now! For consumers, even the little things mean a lot Your brother eats at that restaurant because its owner fed 10,000 meals to displaced residents during a wildfire. My sister won’t buy merchandise from that shop because their hiring practices are discriminatory. A friend was so amazed when the big brand CEO responded personally to her complaint that she’s telling all her social followers about it now. Maybe it’s always been a national pastime for Americans to benefit one another with wisdom gained from their purchasing experiences. I own one of the first cookbooks ever published in this country and ‘tis full of wyse warnings about how to avoid “doctored” meats and grains in the marketplace. Social media has certainly amplified our voices, but it has done something else that truly does feel fresh and new. Consider SproutSocial’s findings that: 86% of Americans say transparency from businesses is more important than ever before. 40% of people who say brand transparency is more important than ever before attribute it to social media. 63% of people say CEOs who have their own social profiles are better representatives for their companies than CEOs who do not. What were customers’ chances of seeking redress and publicity just 20 years ago if a big brand treated them poorly? Today, they can document with video, write a review, tweet to the multitudes, even get picked up by national news. They can use a search engine to dig up the truth about a company’s past and present practices. And… they can find the social profiles of a growing number of brand representatives and speak to them directly about their experiences, putting the ball in the company’s court to respond for all to see. In other words, people increasingly assume brands should be directly accessible. That’s new! Should this increased expectation of interactive transparency terrify businesses? Absolutely not, if their intentions and policies are open, clear, and honest. It’s a little thing to treat a customer with fairness and regard, but its impacts in the age of social media are not small. In fact, SproutSocial found that transparent practices are golden as far as consumer loyalty is concerned: 85% of people say a business' history of being transparent makes them more likely to give it a second chance after a bad experience. 89% of people say a business can regain their trust if it admits to a mistake and is transparent about the steps it will take to resolve the issue. I highly recommend reading the entire SproutSocial study, and while it focuses mainly on general brands and general social media, my read of it correlated again and again to the specific scenario of local businesses. Let’s talk about this! How transparency & empathy relate to local brands “73.8% of customers were either likely or extremely likely to continue to do business with a merchant once the complaint had been resolved.” - GetFiveStars On the local business scene, we’re also witnessing the rising trend of consumers who expect accountability and accessibility, and who speak up when they don’t encounter it. Local businesses need to commit to openness in terms of their business practices, just as digital businesses do, but there are some special nuances at play here, too. I can’t count the number of negative reviews I’ve read that cited inconvenience caused by local business listings containing wrong addresses and incorrect hours. These reviewers have experienced a sense of ill-usage stemming from a perceived lack of respect for their busy schedules and a lack of brand concern for their well-being. Neglected online local business information leads to neglected-feeling customers who sometimes even believe that a company is hiding the truth from them! These are avoidable outcomes. As the above quote from a GetFiveStars survey demonstrates, local brands that fully participate in anticipating, hearing, and responding to consumer needs are rewarded with loyalty. Given this, as we begin the countdown to holiday shopping, be sure you’re fostering basic transparency and empathy with simple steps like: Checking your core citations for accurate names, addresses, phone numbers, and other info and making necessary corrections Updating your local business listing hours to reflect extended holiday hours and closures Updating your website and all local landing pages to reflect this information Next, bolster more advanced transparency by: Using Google Posts to clearly highlight your major sale dates so people don’t feel tricked or left out Answering all consumer questions via Google Questions & Answers in your Google Knowledge Panels Responding swiftly to both positive and negative reviews on core platforms Monitoring and participating on all social discussion of your brand when concerns or complaints arise, letting customers know you are accessible Posting in-store signage directing customers to complaint phone/text hotlines And, finally, create an empathetic rapport with customers via efforts like: Developing and publishing a consumer-centric service policy both on your website and in signage or print materials in all of your locations Using Google My Business attributes to let patrons know about features like wheelchair accessibility, available parking, pet-friendliness, etc. Publishing your company giving strategies so that customers can feel spending with you supports good things — for example, X% of sales going to a local homeless shelter, children’s hospital, or other worthy cause Creating a true welcome for all patrons, regardless of gender, identity, race, creed, or culture — for example, gender neutral bathrooms, feeding stations for mothers, fragrance-free environments for the chemically sensitive, or even a few comfortable chairs for tired shoppers to rest in A company commitment to standards like TAGFEE coupled with a basic regard for the rights, well-being, and aspirations of customers year-round can stand a local brand in very good stead at the holidays. Sometimes it’s the intangible goods a brand stocks — like goodwill towards one’s local community — that yield a brand of loyalty nothing else can buy. Why not organize for it, organize for the mutual benefits of business and society with a detailed, step-by-step checklist you can take to your next team meeting?: Download the 2018 Holiday Local SEO Checklist Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Local Business Transparency & Empathy for the Holidays: Tips + Downloadable Checklist"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Local Business Transparency & Empathy for the Holidays: Tips + Downloadable Checklist"
    },
    {
      "level": "H2",
      "text": "For consumers, even the little things mean a lot"
    },
    {
      "level": "H2",
      "text": "How transparency & empathy relate to local brands"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}