{
  "url": "https://moz.com/blog/local-serp-tracking",
  "slug": "local-serp-tracking",
  "title": "Ecom, Locom, or Informational: Google Tracks Locally and so Should You - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Local SERP tracking has historically been seen as challenging for any business type, but today, we’ll take a look at the lay of the competitive landscape and offer some helpful solutions.",
  "content": "Ecom, Locom, or Informational: Google Tracks Locally and so Should You Local SEO | Search Engines By: Miriam Ellis December 13, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis December 13, 2021 Ecom, Locom, or Informational: Google Tracks Locally and so Should You Local SEO | Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The majority of surveyed consumers say that about half of their searches have a local intent, while the other half of queries can be satisfied with remote solutions. On either side of the chess board are businesses hoping Google will surface them fairly for appropriate keywords. SEOs and marketers hear both sides of what can sometimes sound like a battle, with clients of multiple models rarely satisfied with the SERPs. Meanwhile, the last two years have so blurred the lines of intent and fulfillment that it can start to feel rather vague at the agency level where a client falls within all of these possible identity categories: Local and independent/smallLocal and part of a chainBrick-and-mortar with in-store transactions onlyBrick-and-mortar with digital shopping/deliverySAB with or without online transactionsSolely virtual and independent/smallSolely virtual national brandNational brand that was virtual but is now showrooming or opening physical storesB2B or B2CInformational with unique income streams not from traditional sales Defining the client’s model properly should be the first step in any campaign. What and where the business is has long defined a major portion of its opportunities for visibility in Google results. But the SEO game is changing. Whether a particular client is best served by focusing more on the guidelines for representing your business on Google or the QRG, SEOs need to be able to effectively track local SERPs, because they are either the main goal or the main competitor, and without a doubt, because Google is so local-aware. Local SERP tracking has historically been seen as challenging for any business type, but today, we’ll take a look at the lay of the competitive landscape and offer some helpful solutions. Rooks: businesses for which physical locations are the stronghold Whether a brand is little-known or a household name, if physical locations are its castle, then it will have become accustomed to eyeing virtual competitors warily. Local businesses are understandably frustrated when page one organic SERPs are gobbled up by virtual competitors, regardless of what is shown above them in the local packs: And SMBs are not pleased by national brands being given the spotlight in features like this one documented by Mike Blumenthal, in which Google is weirdly populating the People Also Search segment with big brand chains that don’t even have locations in his town: Meanwhile, Google’s increasingly powerful shopping environment largely defaults to massive and frequently virtual sellers unless the searcher filters results down with the “available nearby” or “smaller stores” option: Knights: business without physical locations that ship everywhere Fully virtual brands that don’t have a public physical home base but can gallop deliveries to customers everywhere have two main sources of concern. The first is the mere existence of local packs, which eat up so much mobile and desktop screen space that formerly belonged to organic results only: The second is the sheer volume of searches for which Google shows local packs and localized organic results. We’re fortunate to have some original data today from Moz’s own Dr. Peter J. Meyers. Pete ran 10,000 keywords through MozCast, half of which were localized to specific cities and half of which weren’t, and found that about one-third returned local pack results: When a search is explicitly local, because the searcher has included a city name or a similar refinement in their language, we call this a “geo-modified” query, and it’s hard to complain when Google responds with nearby results. But Google almost always knows where a device is located, and virtual business owners find it hard that these “geo-located” searches frequently yield localized results as well, even though the searcher hasn’t specified a town, zip code, or similar modification. Google is quite convinced of the implicit local intent of countless keyword phrases. Clients running remote-only companies can find it hard to compete when Google places such emphasis on searcher locality and the localization of results. In order to vye for visibility, these entities have to be equipped to track local SERPs. Bishops: businesses based on information with complex revenue streams The owners of directories, affiliate sites, enterprises that make their money from Google Adsense and other intricately woven indirect revenue streams are used to having to look at one another across a board cluttered with pieces owned by competitive virtual and physical commercial brands. They may have so much wisdom and learning to share, but it can be very hard to be seen. Often, these informational entities will have invested even more in the quality of their content than their more sales-y competitors. Look at a site like TripAdvisor, which has devoted itself to both UGC and original travel writing in an effort to be of use, but which is also running Adsense in quest of profits: When an informational entity isn’t set up to track local SERPs, they will miss out on fully comprehending both user intent and neglected gaps they could potentially fill within the localized results. Queens: emergent hybrids that can rule the board “What we’re seeing is that the more brick-and-mortar businesses that we’re creating, the more the digital is happening in those particular ZIP codes,” says Macy’s CEO, Jeff Gennette. By the dawn of 2020, we’d had nearly two decades of rooks, knights and bishops -- each rigidly limited by the maneuvers available to their business model -- battling one another for maximum control of the Google board. But: A few weeks later, with lockdowns in place around the globe, the Internet became a source of vital information in our homes in an unprecedented way, both for public health data and as a connector to sourcing basic daily needs and remote interaction with our teams, customers, friends, and family. Six months later, 92% of American SMBs had reinvented themselves to adapt to the pandemic, implementing digital shopping, delivery and curbside fulfillment, and even making local products when national brands disappeared. Nine months in, over a third of consumers were buying new brands, anxious to access goods from anywhere they could, whether on or offline.Two years in, it’s being predicted that retailers will open more stores than they close for the first time since 2017.Going forward, stores are finally being seen as essential to virtual and national brands which want to fulfill maximum orders from distribution hubs instead of remote warehouses while also ensuring shoppers can conveniently pick up and return digital purchases. What is happening now is critical for every SEO and marketer to understand: The pieces on the board can now move in every direction. Whether a brand used to be solely physical, virtual, or informational, being all three is likely going to be the strongest strategy going forward for most companies. This means serious entities will invest in real-world locations, digital conveniences, and excellent, optimized content that generates income.Nevertheless, Google remains deeply tied to the physical location of the searcher. Because of this, whether you stick to your swim lane in the coming decade or reinvent the brands you market as powerful hybrids, you will always have to think locally, because Google does. Ready to start strategizing for this new contest of possibilities? Download this free guide to tracking local SERPs so that you can read the board and beginning making data-based moves in new directions: This guide will coach you in: Local search essentialsHow mobile and local interact (and how to handle it)The difference between geo-location and geo-modificationSearcher intent and all its nuancesSeven local SERP tracking strategies that you can tailor to your specific industry In this developing environment, it’s exciting to think that a family-owned country store can have digital sales and lucrative content, national brands can localize themselves and prove their commitment to localism by contributing to community tax bases, and informational enterprises can consider how developing a local footprint and developing product lines that fill gaps in the supply chain uncovered by their deep study of a market. Creativity is more welcome and more essential than ever before, and your study of Google’s obvious local leanings could stand the brands you market in good stead for many years to come. Image credits: Wayne S. Grazio, Tom Page, Joshua Alan Eckert. Will C. Fry, and Bob Whitehead Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Ecom, Locom, or Informational: Google Tracks Locally and so Should You"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Ecom, Locom, or Informational: Google Tracks Locally and so Should You"
    },
    {
      "level": "H2",
      "text": "Rooks: businesses for which physical locations are the stronghold"
    },
    {
      "level": "H2",
      "text": "Knights: business without physical locations that ship everywhere"
    },
    {
      "level": "H2",
      "text": "Bishops: businesses based on information with complex revenue streams"
    },
    {
      "level": "H2",
      "text": "Queens: emergent hybrids that can rule the board"
    },
    {
      "level": "H2",
      "text": "Master the complexities of local SEO with our new guide: Strategies for Local SERP Tracking!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}