{
  "url": "https://moz.com/blog/local-seo-exercises-least-technical",
  "slug": "local-seo-exercises-least-technical",
  "title": "Heart, Ear, Eye, Mind, Mouth: Local SEO Exercises for Your Least Technical Clients - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Instead of signaling via SEO, CTR, USPs, and GMB, let’s relax with clients by relating successful local search marketing practices to experiences people at any level of technical proficiency already understand.",
  "content": "Heart, Ear, Eye, Mind, Mouth: Local SEO Exercises for Your Least Technical Clients Local SEO By: Miriam Ellis March 3, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis March 3, 2020 Heart, Ear, Eye, Mind, Mouth: Local SEO Exercises for Your Least Technical Clients Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. When was the last time you relaxed with a client? As a local business consultant, I know that deeper marketing insights can be discovered when you set aside formality and share experiences: a moment, a laugh, a common bond. When I’m looking for ways to make life easier for a client, I sometimes reflect on ancient practices like yoga, tai chi, and mindful breathing, which are increasingly understood as beneficial to human health. For a space in time, they reduce the complex world we live in to a simpler one where being, breath, movement, and focus bring the practitioner to a more intuitive state. Local marketing agencies can empathize with the complex world their clients inhabit. Local business owners must manage everything from rent and employee benefits to customer service, business reviews, web content, and online listings. When you take on a new client, you expect them to onboard a ton of information about marketing their brand online. Sometimes, the most basic motivations go unaddressed and get lost in assumptions and jargon — instead of decreasing client stress for your least technical clients, you can accidentally increase it. Today, I’ll help you newly create an intuitive space by sharing five simple meditation exercises you can use with your agency’s clients. Instead of signaling via SEO, CTR, USPs, and GMB, let’s relax with clients by relating successful local search marketing practices to experiences people at any level of technical proficiency already understand. Heart To show their heart is in the right place, the Vermont Country Store publishes a customer bill of rights. For a local business owner, there is no more important quality than having their heart in the right place when it comes to their motivation for running a company. Yes, all of us work to earn money, but it’s the dedication to serving others that is felt by customers in every interaction with them. When customers feel that a business is there for them, it establishes the loyalty and reputation that secure local search marketing success. Heart meditation Close your eyes for a few seconds and think of a time in your life when you most needed help from a business. Maybe you needed a tow truck, a veterinarian, a dentist, or a plumber. You really needed them to understand your plight, deliver the right help, and treat you as an important person who is worthy of respect. Whether you received what you required or not, remember the feeling of need. Now, extend that recognition beyond your own heart to the heart of every customer who feels a need for something your client can offer them. A business owner with their heart in the right place can powerfully contribute to local search marketing by: Running a customer-centric business.Creating customer guarantees that are fair.Creating an employee culture of respect and empowerment that extends to customers.Creating a location that is clean, functional, and pleasant for all.Honestly representing their products, services, location, and reputation.Refraining from practices that negatively impact their customers and reputation.Participating positively in the life of the community they serve. A good local search marketing agency will help the business owner translate these basics into online content that meets customer needs, local business listings that accurately and richly represent the business, and genuine reviews that serve as a healthy and vital ongoing conversation between the brand and its customers. A trustworthy agency will ensure avoidance of any tactics that pollute the Internet with spam listings, spam reviews, negative attacks on competitors, and negative impacts on the service community. An excellent agency will also assist in finding and promoting community engagement opportunities, helping to win desirable online publicity from offline efforts. Ear Keter Salon of Berkeley, Calif. really listens to customers and it shows in its reviews. Local business success is so linked to the art of listening, I sometimes think Google should replace their teardrop map markers with little ears. In the local SEO world, there are few things sadder than seeing local business profiles filled with disregarded reviews, questions, and negative photos. (Someone cue “The Sound of Silence”.) From a business perspective, the sound of branded silence is also the sound of customers and profits trickling away. Why does it work this way? Because only 4% of your unhappy customers may actually make the effort to speak up, and if a business owner is not even hearing them, they’ve lost the ability to hear consumer demand. Let’s make sure this doesn’t happen. Ear meditation Close your eyes for a few seconds and listen closely to every noise within the range of your hearing. Ask yourself, “Where am I?” The sound of typing, phone calls, and co-workers chatting might place you in an office. Sliding doors, footsteps on linoleum, and floor staff speaking might mean you’re at your client's brick-and-mortar location. Maybe it’s birdsong outside and the baby in their crib that tell you you’re working from home today. Listen to every sound that tells you exactly where you are right now. Now, commit to listening with this level of attention and intention to the signals of customer voices, telling you exactly where a local brand is right now in terms of faults and successes. A business owner who keeps their ears open can actively gauge how their business is really doing with its customers by: Having one-on-one conversations with customers.Recording and analyzing phone conversations with customers.Reading reviews on platforms like Google My Business, Yelp, Facebook and sites that are specific to their industry (like Avvo for lawyers or Healthgrades for physicians).Reading the Q&A questions of customers on their Google Business Profile.Reading mentions of their brand on social media platforms like Twitter, Facebook, and Instagram.Reading the responses to surveys they conduct.Reading the emails and form submissions the company receives. A good local search marketing agency will help their client amass, organize, and analyze all of this sentiment to discover the current reputation of the business. From this information, you and your client can chart a course for improvement. Consider that, in this study, a 1.5 star improvement in online reputation increased consumer activity by 10%-12% and generated 13,000 more leads for the brands included. The first step to a better reputation is simply listening. Eye Moz’s Local Market Analytics (Beta) helps you see your market through customer location emulation. When your clients choose their business locations, they weigh several factors. They compare how the mantra of “location, location, location” matches their budget, and whether a certain part of town is lacking something their business could provide. They also look at the local competitors to see if the competition would be hard to beat, or if they could do the job better. Success lies in truly seeing the lay of the land. Local search mirrors the real world. The market on the Internet is made up of the physical locations of your clients’ customers at the time they search for what your client has to offer. Eye meditation You already know most of the businesses on your street, and many of them in your neighborhood. Now, with eyes wide open, start searching Google for the things your listening work has told you customers need. Where appropriate, include attributes you’ve noticed them using like “best tacos near me”, “cheapest gym in North Beach”, or “shipping store downtown.” See how your client is ranking when a person does these type of searches while at their location. Now, walk or drive a few blocks away and try again. Go to the city perimeter and try again. Where are they ranking, and who is outranking them as you move about their geographic market? A local business keeping its eyes open never makes assumptions about who its true competitors are or how its customers search. Instead, it: Regularly assesses the competition in its market, taking into account the distance from which customers are likely to come for goods and services.Regularly reviews materials assembled in the listening phase to see how customers word their requests and sentiments.Makes use of tools to analyze both markets and keyword searches. A good local search marketing agency will help with the tools needed for market and search language analysis. These findings can inform everything from what a client names their business, to how they categorize it on their Google My Business listing, to what they write about to draw in customers from all geographic points in their market. Clear vision simultaneously enables you to analyze competitors who are outranking your client and assess why they’re doing so. It can empower your client to report spammers who are outranking them via forbidden tactics. An excellent agency will help their client see their competitive landscape with eyes on the prize. Mind When an independent Arizona appliance chain surprised three shoppers with $10,000, it made headlines. With hearts ready for service, ears set on listening, and eyes determined to see, you and your client have now taken in useful information about their brand and the customers who make up their local market. You know now whether they’re doing a poor, moderate, or exceptional job of fulfilling needs, and are working with them to strategize next steps. But what are those next steps? Mind meditation Sit back comfortably and think of a time a business completely surprised you, or a time when an owner or employee did something so unexpectedly great, it convinced you that you were in good hands. Maybe they comped your meal when it wasn’t prepared properly, or special-ordered an item just for you, or showed you how to do something you’d never thought of before. Recall that lightbulb moment of delight. Ask yourself how your client’s brand could surprise customers in memorable ways they would love. Create a list of those ideas. A creative local business gives full play to the awesome imaginative powers of the brain. It gives all staff permission to daydream and brainstorm questions like: What is something unexpected the business could do that would come as a delightful surprise to customers?What is the most impactful thing the business could do that would be felt as a positive force in the lives of its customers?What risks can the business take for the sake of benevolence, social good, beauty, renown, or joy? A good local search marketing agency will help sort through ideas that could truly differentiate their clients from the competition and bring them closer to making the kinds of impressions that turn local brands into household names. An excellent agency will bring ideas of their own. Study “surprise and delight marketing” as it’s done on the large, corporate scale, and get it going at a local level like this small coffee roaster in Alexandria, Va. selling ethical java while doubling as funding for LGBTQ+ organizations. Mouth Put your best stories everywhere, like in this social media example. Moz Local can help with publishing those stories. “Think before you speak” is an old adage that serves well as a marketing guideline. Another way we might say it is “research before you publish”. With heart, ear, eye, and mind, you and your client have committed, collected, analyzed, and ideated their brand to a point where it’s ready to address the public from a firm foundation. Mouth meditation Open your favorite word processor on your computer and type a few bars of the lyrics to your favorite song. Next, type the first three brand slogans that come to your mind. Next, type a memorable line from a movie or book. Finally, type out the the words of the nicest compliment or best advice someone ever gave you. Sit back and look at your screen. Look at how those words have stuck in your mind — you remember them all! The people who wrote and spoke those words have indelibly direct-messaged you. How will you message the public in a way that’s unforgettable? A well-spoken local business masters the art of face-to-face customer conversation. In-store signage and offline media require great words, too, but local search marketing will take spoken skills onto the web, where they'll be communicated via: Every page of the website Every article or blog post Social media contentReview responsesAnswers to questions like Google Business Profile Q&ABusiness descriptions on local business listingsGoogle postsFeatured snippet contentLive chatEmailPress releasesInterviewsImages on the website, business listings, and third-party platforms like Google Images and PinterestVideos on the website, YouTube, and other platforms A good local search marketing agency will help their client find the best words, images, and videos based on all the research done together. An excellent agency will help a local business move beyond simply being discovered online to being remembered as a household name each time customer needs arise. An agency should help their clients earn links, unstructured citations, and other forms of publicity from those research efforts. Determine to help your client be the \"snap, crackle, pop\", \"un-Cola\", \"last honest pizza\" with everything you publish for their local market, and to build an Internet presence that speaks well of their business 24-hours a day. Closing pose One of the most encouraging aspects of running and marketing a local business is that it’s based on things you already have some life experience doing: caring, listening, observing, imagining, and communicating. I personally should be better at technical tasks like diagnosing errors in Schema, configuring Google Search Console for local purposes, or troubleshooting bulk GMB uploads. I can work at improving in those areas, but I can also work at growing my heart, ear, eye, mind, and mouth to master serving clients and customers. Business is technical. Business is transactional. But good business is also deeply human, with real rewards for well-rounded growth. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Heart, Ear, Eye, Mind, Mouth: Local SEO Exercises for Your Least Technical Clients"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Heart, Ear, Eye, Mind, Mouth: Local SEO Exercises for Your Least Technical Clients"
    },
    {
      "level": "H3",
      "text": "Heart"
    },
    {
      "level": "H4",
      "text": "Heart meditation"
    },
    {
      "level": "H3",
      "text": "Ear"
    },
    {
      "level": "H4",
      "text": "Ear meditation"
    },
    {
      "level": "H3",
      "text": "Eye"
    },
    {
      "level": "H4",
      "text": "Eye meditation"
    },
    {
      "level": "H3",
      "text": "Mind"
    },
    {
      "level": "H4",
      "text": "Mind meditation"
    },
    {
      "level": "H3",
      "text": "Mouth"
    },
    {
      "level": "H4",
      "text": "Mouth meditation"
    },
    {
      "level": "H3",
      "text": "Closing pose"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}