{
  "url": "https://moz.com/blog/local-customer-service-ecosystem-2019",
  "slug": "local-customer-service-ecosystem-2019",
  "title": "What the Local Customer Service Ecosystem Looks Like in 2019 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Excellent customer service is baked into every aspect of your local search strategy. For success in 2019, learn how to market a local business with the customer in mind at every point, from GMB to link building to in-store training.",
  "content": "What the Local Customer Service Ecosystem Looks Like in 2019 Local SEO By: Miriam Ellis November 5, 2018 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis November 5, 2018 What the Local Customer Service Ecosystem Looks Like in 2019 Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Everything your brand does in the new year should support just one goal: better local customer service. Does this sound too simple? Doesn’t marketing brim with a thousand different tasks? Of course — but if the goal of each initiative isn’t to serve the customer better, it’s time for a change of business heart. By putting customers, and their problems, at the absolute center of your brand’s strategy, your enterprise will continuously return to this heart of the matter, this heart of commerce. What is local customer service in 2019? It’s so much more than the face-to-face interactions of one staffer with one shopper. Rather, it’s a commitment to becoming an always-on resource that is accessible to people whenever, wherever and however they need it. A Google rep was recently quoted as saying that 46% of searches have a local intent. Mobile search, combined with desktop and various forms of ambient search, have established the local web as man’s other best friend, the constant companion that’s ever ready to serve. Let’s position your brand to become that faithful helper by establishing the local customer service ecosystem: Your Key to the Local Customer Service Ecosystem At the heart sits the local customer, who wants to know: Who can help them, who likes or dislikes a business, who’s behind a brand, who’s the best, cheapest, fastest, closest, etc. What the answer is to their question, what product/service solves their problems, what businesses are nearby, what it’s like there, what policies protect them, what’s the phone number, the website URL, the email address, etc. Where a business is located, where to find parking, where something is manufactured or grown, etc. When a business is open, when sales or events are, when busiest times are, when to purchase specific products/services or book an appointment, etc. Why a business is the best choice based on specific factors, why a business was founded, why people like/dislike a business, etc. How to get to the business by car/bike/on foot, how to learn/do/buy something, how to contact the right person or department, how to make a complaint or leave feedback, how the business supports the community, etc. Your always-on customer service solves all of these problems with a combination of all of the following: In-store Good customer service looks like: A publicly accessible brand policy that protects the rights and defends the dignity of both employees and consumers. Well-trained phone staff with good language skills, equipped to answer FAQs and escalate problems they can’t solve. Sufficient staff to minimize hold-times. Well-trained consumer-facing staff, well-versed in policy, products and services. Sufficient staff to be easily-accessible by customers. In-store signage (including after-hours messaging) that guides consumers towards voicing complaints in person, reducing negative reviews. In-store signage/messaging that promotes aspects of the business that are most beneficial to the community. (philanthropy, environmental stewardship, etc.) to promote loyalty and word-of-mouth. Cleanliness, orderliness and fast resolution of broken fixtures and related issues. Equal access to all facilities with an emphasis on maximum consumer comfort and convenience. Support of payment forms most popular with local customers (cash, check, digital, etc.), security of payment processes, and minimization of billing mistakes/hassles. Correctly posted, consistent hours of operation, reducing inconvenience. Clear messaging regarding special hours/closures. A brand culture that rewards employees who wisely use their own initiative to solve customers’ problems. Website Good customer service looks like: Content that solves people’s problems as conveniently and thoroughly as possible in language that they speak. Everything you publish (home, about, contact, local landing pages, etc.) should pass the test of consumer usefulness. Equal access to content, regardless of device. Easily accessible contact information, including name, address, phone number, fax, email, text, driving directions, maps and hours of operation. Signals of trustworthiness, such as reviews, licenses, accreditations, affiliations, and basic website security. Signals of benefit, including community involvement, philanthropy, environmental protections, etc. Click-to-call phone numbers. Clear policies that outline the rights of the consumer and the brand. Organic SERPs Good customer service looks like: Management of the first few pages of the organic SERPs to ensure that basic information on them is accurate. This includes structured citations on local business directories, unstructured citations on blog posts, news sites, top 10 lists, review sites, etc. It can also include featured snippets. Management also includes monitoring of the SERPs for highly-ranked content that cites problems others are having with the brand. If these problems can be addressed and resolved, the next step is outreach to the publisher to demonstrate that the problem has been addressed. Email Good customer service looks like: Accessible email addresses for customers seeking support and fast responses to queries. Opt-in email marketing in the form of newsletters and special offers. Reviews Good customer service looks like: Accuracy of basic business information on major review platforms. Professional and fast responses to both positive and negative reviews, with the core goal of helping and retaining customers by acknowledging their voices and solving their problems. Sentiment analysis of reviews by location to identify emerging problems at specific branches for troubleshooting and resolution. Monitoring of reviews for spam and reporting it where possible. Avoidance of any form of review spam on the part of the brand. Where allowed, guiding valued customers to leave reviews to let the greater community know about the existence and quality of your brand. Links Good customer service looks like: Linking out to third-party resources of genuine use to customers. Pursuit of inbound links from relevant sites that expand customers’ picture of what’s available in the place they live, enriching their experience. Tech Good customer service looks like: Website usability and accessibility for users of all abilities and on all browsers and devices (ADA compliance, mobile-friendliness, load speed, architecture, etc.) Apps, tools and widgets that improve customers’ experience. Brand accessibility on social platforms most favored by customers. Analytics that provide insight without trespassing on customers’ comfort or right to privacy. Social Good customer service looks like: Brand accessibility on social platforms most favored by customers. Social monitoring of the brand name to identify and resolve complaints, as well as to acknowledge praise. Participation for the sake of community involvement as opposed to exploitation. Sharing instead of selling. Advocacy for social platforms to improve their standards of transparency and their commitment to protections for consumers and brands. Google My Business Good customer service looks like: Embrace of all elements of Google’s local features (Google My Business listings, Knowledge Panels, Maps, etc.) that create convenience and accessibility for consumers. Ongoing monitoring for accuracy of basic information. Brand avoidance of spam, and also, reporting of spam to protect consumers. Advocacy for Google to improve its standards as a source of community information, including accountability for misinformation on their platform, and basic protections for both brands and consumers. Customers’ Problems are Yours to Solve“$41 billion is lost each year by US companies following a bad customer experience.” - New Voice Media When customers don’t know where something is, how something works, when they can do something, who or what can help them, or why they should choose one option over another, your brand can recognize that they are having a problem. It could be as small a problem as where to buy a gift or as large a problem as seeking legal assistance after their home has been damaged in a disaster. With the Internet never farther away than fingertips or voices, people have become habituated to turning to it with most of their problems, hour by hour, year by year. Recognition of quests for help may have been simpler just a few decades ago when customers were limited to writing letters, picking up phones, or walking into stores to say, “I have a need.” Now, competitive local enterprises have to expand their view to include customer problems that play out all over the web with new expectations of immediacy. Unfortunately, brands are struggling with this, and we can sum up common barriers to modern customer service in 3 ways: 1) Brand Self-Absorption “I’ve gotta have my Pops,” frets a boy in an extreme (and, frankly, off-putting) example in which people behave as though addicted to products. TV ads are rife with the wishfulness of marketers pretending that consumers sing and dance at the mere idea of possessing cars, soda, and soap. Meanwhile, real people stand at a distance watching the song and dance, perhaps amused sometimes, but aware that what’s on-screen isn’t them. “We’re awesome,” reads too much content on the web, with a brand-centric, self-congratulatory focus. At the other end of the spectrum, web pages sit stuffed with meaningless keywords or almost no text as all, as though there aren’t human beings trying to communicate on either side of the screen. “Who cares?” is the message untrained employees, neglected shopping environments, and disregarded requests for assistance send when real-world locations open doors but appear to put customer experience as their lowest priority. I’ve catalogued some of my most disheartening customer service interludes and I know you’ve had them, too. Sometimes, brands get so lost in boardrooms, it’s all they can think of to put in their million-dollar ad campaigns, forgetting that most of their customers don’t live in that world. One of the first lightbulb moments in the history of online content marketing was the we-you shift. Instead of writing, “We’re here, isn’t that great?”, we began writing, “You’re here and your problem can be solved.” This is the simple but elegant evolution that brands, on the whole, need to experience. 2) Ethical DeficitsSometimes, customers aren’t lost because a brand is too inwardly focused, but rather, because its executives lack the vision to sustain an ethical business model. Every brand is tasked with succeeding, but it takes civic-minded, customer-centric leadership to avoid the abuses we are seeing at the highest echelons of the business world right now. Google, Facebook, Amazon, Uber, and similar majors have repeatedly failed to put people over profits, resulting in: Scandals Lawsuits Fines Boycotts Loss of consumer trust Employee loss of pride in company culture At a local business level, and in a grand understatement, it isn’t good customer service when a company deceives or harms the public. Brands, large and small, want to earn the right of integration into the lives of their customers as chosen resources. Large enterprises seeking local customers need leadership that can envision itself in the setting of a single small community, where dishonest practices impact real lives and could lead to permanent closure. Loss of trust should never be an acceptable part of economies of scale. The internet has put customers, staffers, and media all on the same channels. Ethical leadership is the key ingredient to building a sustainable business model in which all stakeholders take pride. 3) Lack of StrategyHappily, many brands genuinely do want to face outward and possess the ethics to treat people well. They may simply lack a complete strategy for covering all the bases that make up a satisfying experience. Small local businesses may find lack of time or resources a bar to the necessary education, and structure at enterprises may make it difficult to get buy-in for the fine details of customer service initiatives. Priorities and budgets may get skewed away from customers instead of toward them. The TL;DR of this entire post is that modern customer service means solving customers’ problems by being wherever they are when they seek solutions. Beyond that, a combination of sufficient, well-trained staff (both online and off) and the type of automation provided by tools that manage local business listings, reviews and social listening are success factors most brands can implement. Reach Out... We’ve talked about some negative patterns that can either distance brands from customers, or cause customers to distance themselves due to loss of trust. What’s the good news? Every single employee of every local brand in the US already knows what good customer service feels like, because all of us are customers. There’s no mystery or magic here. Your CEO, your devs, sales team, and everyone else in your organization already know by experience what it feels like to be treated well or poorly. And they already know what it’s like when they see themselves reflected in a store location or on a screen. Earlier, I cited an old TV spot in which actors were paid to act out the fantasy of a brand. Let’s reach back in time again and watch a similar-era commercial in which actors are paid to role play genuine consumer problems - in this case, a family that wants to keep in touch with a member who is away from home: The TV family may not look identical to yours, but their featured problem - wanting to keep close to a distant loved one - is one most people can relate to. This 5-year ad campaign won every award in sight, and the key to it is that consumers could recognize themselves on the screen and this act of recognition engaged their emotions. Yes, a service is being sold (long distance calling), but the selling is being done by putting customers in the starring roles and solving their problems. That’s what good customer service does, and in 2019, if your brand can parlay this mindset into all of the mediums via which people now seek help, your own “reach out and touch someone” goals are well on their way to success. Loyal Service Sparks Consumer Loyalty“Acquiring a new customer is anywhere from five to twenty times more expensive than retaining an existing one.” – Harvard Business Review “Loyal customers are worth up to ten times as much as their first purchase.” – White House Office of Consumer Affairs I want to close here with a note on loyalty. With a single customer representing up to 10x the value of their first purchase, earning a devoted clientele is the very best inspiration for dedication to improving customer service. Trader Joe’s is a large chain that earns consistent mentions for its high standards of customer service. Being a local SEO, I turned to its Google reviews, looking at 5 locations in Northern California. I counted 225 instances of people exuberantly praising staff at just these 5 locations, using words like “Awesome, incredible, helpful, friendly, and fun!”. Moreover, reviewers continuously mentioned the brand as the only place they want to shop for groceries because they love it so much. It’s as close as you can get to a “gotta have my Pops” scenario, but it’s real. How does Trader Joe’s pull this off? A study conducted by Temkin Group found that, “A customer’s emotional experience is the most significant driver of loyalty, especially when it comes to consumers recommending firms to their friends.” The cited article lists emotional connection and content, motivated employees who are empowered to go the extra mile as keys to why this chain was ranked second-highest in emotion ratings (a concept similar to Net Promoter Score). In a word, the Trader Joe’s customer service experience creates the right feelings, as this quick sentiment cloud of Google review analysis illustrates: This brand has absolutely perfected the thrilling and lucrative art of creating loyal customers, making their review corpus read like a volume of love letters. The next move for this company - and for the local brands you market - is to “spread the love” across all points where a customer might seek to connect, both online and off. It’s a kind of love when you ensure a customer isn’t misdirected by a wrong address on a local business listing or when you answer a negative review with the will to make things right. It’s a kind of love when a company blog is so helpful that its comments say, “You must be psychic! This is the exact problem I was trying to solve.” It’s a kind of love when a staff member is empowered to create such a good experience that a customer tells their mother, their son, their best friend to trust you brand. Love, emotions, feelings — are we still talking about business here? Yes, because when you subtract the medium, the device, the screen, it’s two very human people on either side of every transaction. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What the Local Customer Service Ecosystem Looks Like in 2019"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What the Local Customer Service Ecosystem Looks Like in 2019"
    },
    {
      "level": "H2",
      "text": "What is local customer service in 2019?"
    },
    {
      "level": "H3",
      "text": "Your Key to the Local Customer Service Ecosystem"
    },
    {
      "level": "H4",
      "text": "In-store"
    },
    {
      "level": "H4",
      "text": "Website"
    },
    {
      "level": "H4",
      "text": "Organic SERPs"
    },
    {
      "level": "H4",
      "text": "Email"
    },
    {
      "level": "H4",
      "text": "Reviews"
    },
    {
      "level": "H4",
      "text": "Links"
    },
    {
      "level": "H4",
      "text": "Tech"
    },
    {
      "level": "H4",
      "text": "Social"
    },
    {
      "level": "H4",
      "text": "Google My Business"
    },
    {
      "level": "H2",
      "text": "Customers’ Problems are Yours to Solve"
    },
    {
      "level": "H3",
      "text": "1) Brand Self-Absorption"
    },
    {
      "level": "H3",
      "text": "2) Ethical Deficits"
    },
    {
      "level": "H3",
      "text": "3) Lack of Strategy"
    },
    {
      "level": "H2",
      "text": "Reach Out..."
    },
    {
      "level": "H2",
      "text": "Loyal Service Sparks Consumer Loyalty"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}