{
  "url": "https://moz.com/blog/localup-advanced-video-bundle",
  "slug": "localup-advanced-video-bundle",
  "title": "Get Unbeatable Insights into Local SEO: Buy the LocalUp Advanced Video Bundle - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Get the LocalUp Advanced 2015 Video Bundle, presented by Local U and Moz, for only $99! All 13 amazing videos, chock full of local SEO knowledge, tips, tactics, and tools.",
  "content": "Get Unbeatable Insights into Local SEO: Buy the LocalUp Advanced Video Bundle SEO Events | Video By: Erica McGillivray April 7, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Erica McGillivray April 7, 2015 Get Unbeatable Insights into Local SEO: Buy the LocalUp Advanced Video Bundle SEO Events | Video The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Missed LocalUp Advanced 2015? Forgot to take notes, or just want to relive the action? You can now purchase the bundle of 13 videos in order to get all the knowledge our speakers shared about local SEO in. Dive deep and learn how to wrangle content, get reviews, overcome technical mobile challenges, and so much more from top industry leaders. Moz and Local U are offering a super-special $99 deal for everyone—an unbeatable value for anyone looking to level-up their local SEO skills. LocalUp Advanced 2015 Video Sales Promo In addition to the videos, you also get the slide decks. Follow along and go back as you start implementing these tips into your strategy and work. You can watch these videos and download them to any device you use: desktop, laptop, tablet, and mobile. Watch the following great talks and more: Getting Local Keyword Research and On-page Optimization Right with Mary Bowling Local keyword data is often difficult to find, analyze, and prioritize. Get tips, tools, and processes for zeroing in on the best terms to target when optimizing your website and directory listings, and learn how and why to structure your website around them. Exposing the Non-Obvious Elements of Local Businesses That Dominate on the Web with Rand Fishkin In some categories and geographies, a local small business wholly dominates the rankings and visibility across channels. What are the secrets to this success, and how can small businesses with remarkable products/services showcase their traits best online? In this presentation, Rand digs deep into examples and highlight the recurring elements that help the best of the best stand out. Local Content + Scale + Creativity = Awesome with Mike Ramsey If you are wondering who is crushing it with local content and how you can scale such efforts, then tune in as Mike Ramsey walks through ideas, examples, and lessons he has learned along the way. Don't Just Show Up, Stand Out with Dana DiTomaso Learn how to destroy your competitors by bringing personality to your marketing. Confront the challenges of making HIPPOs comfortable with unique voice, keep brand standards while injecting some fun, and stay in the forefront of your audience's mind. Playing to Your Local Strengths with David Mihm Historically, local search has been one of the most level playing fields on the web with smaller, nimbler businesses having an advantage as larger enterprises struggled to adapt and keep up. Today, companies of both sizes can benefit from tactics that the other simply can't leverage. David shares some of the most valuable tactics that scale—and don't scale—in a presentation packed with actionable takeaways, no matter what size business you work with. Wondering if it's truly \"advanced?\" Seventy-nine percent of attendees found the LocalUp Advanced presentations to be at just the right level. Buy the LocalUp Advanced Video Bundle Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Get Unbeatable Insights into Local SEO: Buy the LocalUp Advanced Video Bundle"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Get Unbeatable Insights into Local SEO: Buy the LocalUp Advanced Video Bundle"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Erica McGillivray\n          \n            Erica McGillivray\n          \n            Erica McGillivray"
}