{
  "url": "https://moz.com/blog/local-seo-ranking-your-local-business-in-2017",
  "slug": "local-seo-ranking-your-local-business-in-2017",
  "title": "Local SEO & Beyond: Ranking Your Local Business in 2017 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There's a whole world of possibilities beyond the local 3-pack to explore. Broaden your horizons beyond your existing local SEO strategies to come out on top this year.",
  "content": "Local SEO & Beyond: Ranking Your Local Business in 2017 Local SEO | Advanced SEO | Link Building By: Casey Meraz February 23, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Casey Meraz February 23, 2017 Local SEO & Beyond: Ranking Your Local Business in 2017 Local SEO | Advanced SEO | Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In 2016, I predicted that ranking in the 3-pack was hard and it would continually get more competitive. I maintain that prediction for 2017, but I want to make one thing clear. If you haven't done so, I believe local businesses should start to look outside of a local-SEO-3-Pack-ONLY focused strategy. While local SEO still presents a tremendous opportunity to grow your business, I'm going to look at some supplementary organic strategies you can take into your local marketing campaign, as well. In this post I'm going to address: How local search has changed since last year Why & how your overall focus may need to change in 2017 Actionable advice on how to rank better to get more local traffic & more business In local search success, one thing is clearThe days of getting in the 3-pack and having a one-trick pony strategy are over. Every business wants to get the free traffic from Google’s local results, but the chances are getting harder everyday. Not only are you fighting against all of your competitors trying to get the same rankings, but now you’re also fighting against even more ads. If you thought it was hard to get top placement today in the local pack, just consider that you're also fighting against 4+ ads before customers even have the possibility of seeing your business. Today's SERPs are ad-rich with 4 paid ads at the top, and now it's not uncommon to find paid listings prioritized in local results. Just take a look at this example that Gyi Tsakalakis shared with me, showing one ad in the local pack on mobile ranking above the 3-pack results. Keep in mind, there are four other ads above this. If you were on desktop and you clicked on one of the 3-pack results, you're taken to the local finder. In the desktop search example below, once you make it to the local finder you'll see two paid local results above the other businesses. Notice how only the companies participating in paid ads have stars. Do you think that gives them an advantage? I do. Don't worry though, I'm not jaded by adsAfter all of that gloomy ad SERP talk, you're probably getting a little depressed. Don't. With every change there comes new opportunity, and we've seen many of our clients excel in search by focusing on multiple strategies that work for their business. Focusing on the local pack should still be a strong priority for you, even if you don't have a pay-to-play budget for ads. Getting listed in the local finder can still result in easy wins — especially if you have the most reviews, as Google has very handy sorting options. If you have the highest rating score, you can easily get clicks when users decide to sort the results they see by the business rating. Below is an example of how users can easily sort by ratings. But what else can you do to compete effectively in your local market? Consider altering your local strategyMost businesses I speak with seem to have tunnel vision. They think it's more important to rank in the local pack and, in some cases, even prioritize this over the real goal: more customers. Every day, I talk to new businesses and marketers that seem to have a single area of focus. While it's not necessarily a bad thing to do one thing really well, the ones that are most successful are managing a variety of campaigns tied to their business goals. Instead of taking a single approach of focusing on just free local clicks, expand your horizon a bit and ask yourself this question: Where are my customers looking and how can I get in front of them? Sometimes taking a step back and looking at things from the 30,000-ft view is beneficial. You can start by asking yourself these questions by examining the SERPs:1. What websites, OTHER THAN MY OWN, have the most visibility for the topics and keywords I'm interested in?You can bet people are clicking on results other than your own website underneath the local results. Are they websites you can show up on? How do you increase that visibility? I think STAT has a great tracking tool for this. You simply set up the keywords you want to track and their Share of Voice feature shows who's ranking where and what percentage of visibility they have in your specific market. In the example below, you can see the current leaders in a space I'm tracking. Notice how Findlaw & Yelp show up there. With a little further research I can find out if they have number 1–2 rankings (which they do) and determine whether I should put in place a strategy to rank there. This is called barnacle SEO. 2. Are my customers using voice search?Maybe it's just me, but I find it strange to talk to my computer. That being said, I have no reservations about talking to my phone — even when I'm in places I shouldn't. Stone Temple recently published a great study on voice command search, which you can check out here. Some of the cool takeaways from that study were where people search from. It seems people are more likely to search from the privacy of their own home, but most mobile devices out there today have voice search integrated. I wonder how many people are doing this from their cars? This goes to show that local queries are not just about the 3-pack. While many people may ask their device \"What's the nearest pizza place,\" other's may ask a variety of questions like:Where is the highest-rated pizza place nearby?Who makes the best pizza in Denver?What's the closest pizza place near me? Don't ignore voice search when thinking about your localized organic strategy. Voice is mobile and voice can sure be local. What localized searches would someone be interested in when looking for my business? What questions might they be asking that would drive them to my local business? 3. Is my website optimized for \"near me\" searches?\"Near me\" searches have been on the rise over the past five years and I don't expect that to stop. Sometimes customers are just looking for something close by. Google Trends data shows how this has changed in the past five years:Are you optimizing for a \"near me\" strategy for your business? Recently the guys over at Local SEO Guide did a study of \"near me\" local SEO ranking factors. Optimizing for \"near me\" searches is important and it falls right in line with some of the tactical advice we have for increasing your Google My Business rankings as well. More on that later.4. Should my business stay away from ads?Let's start by looking at a some facts. Google makes money off of their paid ads. According to an article from Adweek, \"During the second quarter of 2016, Alphabet's revenue hit $21.5 billion, a 21% year-over-year increase. Of that revenue, $19.1 billion came from Google's advertising business, up from $16 billion a year ago.\"This roughly translates to: \"Ads aren't going anywhere and Google is going to do whatever they can to put them in your face.\" If you didn't see the Home Service ad test with all ads that Mike Blumenthal pointed out, you can check it out below. Google is trying to find more creative ways to monetize local search. Incase you haven't heard it before, having both organic and paid listings ranking highly increases your overall click-through rate. Although the last study I found was from Google in 2012, we've found that our clients have the most success when they rank strong organically, locally, and have paid placements. All of these things tie together. If potential customers are already searching for your business, you'll see great results by being involved in all of these areas. While I'm not a fan of only taking a pay-to-play approach, you need to at least start considering it and testing it for your niche to see if it works for you. Combine it with your overall local and organic strategy. 5. Are we ignoring the featured snippets?Searches with local intent can still trigger featured snippets. One example that I saw recently and really liked was the snowboard size chart example, which you can see below. In this example, someone who is interested in snowboards gets an answer box that showcases a company. If someone is doing this type of research, there's a likelihood that they may wish to purchase a snowboard soon. Depending on your niche, there are plenty of opportunities to increase your local visibility by not ignoring featured snippets and creating content to rank there. Check out this Whiteboard Friday to learn more about how you can get featured snippets. Now that we've looked at some ways you can expand your strategies, let's look at some tactical steps you can take to move the needle. Here's how you can gain more visibilityNow that you have an open mind, let's take a look at the actionable things you can do to improve your overall visibility and rankings in locally centric campaigns. As much as I like to think local SEO is rocket science, it really isn't. You really need to focus your attention on the things that are going to move the needle. I'm also going to assume you've already done the basics, like optimize your listing by filling out the profile 100%. Later last year, Local SEO Guide and Placescout did a great study that looked at 100+ variables from 30,000 businesses to determine what factors might have the most overall impact in local 3-pack rankings. If you have some spare time I recommend checking it out. It verified that the signals we put the most effort into seem to have the greatest overall effect. I'm only going to dive into a few of those factors, but here are the things I would do to focus on a results-first strategy: Start with a solid website/foundationWhat good are rankings without conversions? The answer is they aren't any good. If you're always keeping your business goals in mind, start with the basics. If your website isn't loading fast, you're losing conversions and you may experience a reduced crawl budget. My #1 recommendation that affects all aspects of SEO and conversions is to start with a solid website. Ignoring this usually creates bigger problems later down the road and can negatively impact your overall rankings. Your website should be SEO-friendly and load in the 90th percentile on Google's Page Speed Insights. You can also see how fast your website loads for users using tools like GTMetrix. Google seems to reduce the visibility of slower websites, so if you're ignoring the foundation you're going to have issues. Here are 6 tips you can use for a faster Wordpress website. Crawl errors for bots can also wreak havoc on your website. You should always strive to maintain a healthy site. Check up on your website using Google's Search Console and use Moz Pro to monitor your clients' campaigns by actively tracking the sites' health, crawl issues, and domain health over time. Having higher scores and less errors should be your focus. Continue with a strong review generation strategyI'm sure many of you took a deep breath when earlier this month Google changed the review threshold to only 1 review. That's right. In case you didn't hear, Google is now giving all businesses a review score based on any number of reviews you have, as you can see in the example below: I know a lot of my colleagues were a big fan of this, but I have mixed feelings since Google isn't taking any serious measures to reduce review spam or penalize manipulative businesses at this point.Don't ignore the other benefits of reviews, as well. Earlier I mentioned that users can sort by review stars; having more reviews will increase your overall CTR. Plus, after talking to many local businesses, we've gotten a lot of feedback that consumers are actively using these scores more than ever. So, how do you get more reviews?Luckily, Google's current Review and Photo Policies do not prohibit the direct solicitation of reviews at this point (unlike Yelp).Start by soliciting past customers on your listIf you're not already collecting customer information on your website or in-store, you're behind the times and you need to start doing so immediately. I work mainly with attorneys. Working in that space, there are regulations we have to follow, and typically the number of clients is substantially less than a pizza joint. In pickles like this, where the volume is low, we can take a manual approach where we identify the happiest clients and reach out to them using this process. This particular process also creates happy employees. :) List creation: We start by screening the happiest clients. We then sort these by who has a Gmail account for priority's sake. Outreach by phone: I don't know why digital marketers are afraid of the phone, but we've had a lot of success calling our prior clients. We have the main point-of-contact from the business who's worked with them before call and ask how the service they received was. The caller informs them that they have a favor to ask and that their overall job performance is partially based off of client feedback. They indicate they're going to send a follow-up email if it's OK with the customer. Send a follow-up email: We then use a Google review link generator, which creates an exact URL that opens the review box for the person if they're logged into their Gmail account. Follow-up email: Sometimes emails get lost. We follow up a few times to make sure the client leaves the review... You have a new review! The method above works great for low-volume businesses. If you're a higher-volume business or have a lot of contacts, I recommend using a more automated service to prepare for future and ongoing reviews, as it'll make the process a heck of a lot easier. Typically we use Get Five Stars or Infusionsoft integrations to complete this for our clients. If you run a good business that people like, you can see results like this. This is a local business which had 7 reviews in 2015. Look where they are now with a little automation asking happy customers to leave a review: Don't ignore & don't be afraid of links One thing Google succeeded at is scaring away people from getting manipulative links. In many areas, that went too far and resulted in people not going after links at all, diminishing their value as a ranking factor, and telling the world that links are dead. Well, I'm here to tell you that you need good links to your website. If you want to rank in competitive niches or in certain geographic areas, the anchor text can make a big difference. Multiple studies have shown the effectiveness of links to this very day, and their importance cannot be overlooked. This table outlines which link tactics work best for each strategy: Strategy Type Link Tactic Local SEO (3-Pack) Links to local GMB-connected landing page will help 3-pack rankings. City, state, and keyword-included anchor text is beneficial Featured Snippets Links to pages where you want to get a featured snippet will help boost the authority of that page. Paid Ads Links will not help your paid ads. \"Near Me\" Searches Links with city, state, or area anchor text will help you in near me searches. Voice Search Links to pages that are FAQ or consist of long-tail keyword content will help them rank better organically. Barnacle SEO Links to websites you don't own can help them rank better. Focus on high-authority profiles or business listings. There are hundreds of ways to build links for your firm. You need to avoid paying for links and spammy tactics because they're just going to hurt you. Focus on strong and sustainable strategies — if you want to do it right, there aren't any shortcuts. Since there are so many great link building resources out there, I've linked to a few of my favorite where you can get tactical advice and start building links below. For specific tactical link building strategies, check out these resources: Link Building Tactics by Jon Cooper - This is the most comprehensive list I have found. Link Building: The Definitive Guide from Backlinko 21 Link Building Tips from Juris Digital The Ultimate List of Local Link Building Ideas from Nifty Marketing If you participate in outreach or broken link building, check out this new post from Directive Consulting — \"How We Increased Our Email Response Rate from ~8% to 34%\" — to increase the effectiveness of your outreach. Get relevant & high-authority citationsWhile the importance of citations has taken a dive in recent years as a major ranking factor, they still carry quite a bit of importance. Do you remember the example from earlier in this post, where we saw Findlaw and Yelp having strong visibility in the market? These websites get traffic, and if a potential customer is looking for you somewhere where you're not, that's one touchpoint lost. You'll still need to address quality over quantity. The days of looking for 1,000 citations are over and have been for many years. If you have 1,000 citations, you probably have a lot of spam links to your website. We don't need those. But what we do need is highly relevant directories to either our city or niche. This post I wrote over 4 years ago is still pretty relevant on how you can find these citations and build them with consistency. Remember that high-authority citations can also be unstructured (not a typical business directory). They can also be very high-quality links if the site is authoritative and has fewer business listings. There are millions of listings on Yelp, but maybe less than one hundred on some other powerful, very niche-specific websites. Citation and link idea: What awards was your business eligible or nominated for?One way to get these is to consider awards where you can get an authoritative citation and link to your website. Take a look at the example below of a legal website. This site is a peanut compared to a directory like Yelp. Sure, it doesn't carry near as much authority, but the link equity is more evenly distributed. Lastly, stay on point2017 is sure to be a volatile year for local search, but it's important to stay on point. Spread your wings, open your mind, and diversify with strategies that are going to get your business more customers. Now it's time to tell me what you think! Is something I didn't mention working better for you? Where are you focusing your efforts in local search? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Local SEO & Beyond: Ranking Your Local Business in 2017"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Local SEO & Beyond: Ranking Your Local Business in 2017"
    },
    {
      "level": "H3",
      "text": "In local search success, one thing is clear"
    },
    {
      "level": "H2",
      "text": "Don't worry though, I'm not jaded by ads"
    },
    {
      "level": "H2",
      "text": "Consider altering your local strategy"
    },
    {
      "level": "H2",
      "text": "You can start by asking yourself these questions by examining the SERPs:"
    },
    {
      "level": "H3",
      "text": "1. What websites, OTHER THAN MY OWN, have the most visibility for the topics and keywords I'm interested in?"
    },
    {
      "level": "H3",
      "text": "2. Are my customers using voice search?"
    },
    {
      "level": "H3",
      "text": "3. Is my website optimized for \"near me\" searches?"
    },
    {
      "level": "H3",
      "text": "4. Should my business stay away from ads?"
    },
    {
      "level": "H3",
      "text": "5. Are we ignoring the featured snippets?"
    },
    {
      "level": "H2",
      "text": "Here's how you can gain more visibility"
    },
    {
      "level": "H3",
      "text": "Start with a solid website/foundation"
    },
    {
      "level": "H3",
      "text": "Continue with a strong review generation strategy"
    },
    {
      "level": "H4",
      "text": "So, how do you get more reviews?"
    },
    {
      "level": "H3",
      "text": "Don't ignore & don't be afraid of links"
    },
    {
      "level": "H5",
      "text": "This table outlines which link tactics work best for each strategy:"
    },
    {
      "level": "H3",
      "text": "Get relevant & high-authority citations"
    },
    {
      "level": "H2",
      "text": "Lastly, stay on point"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Casey Meraz\n          \n            Casey Meraz\n          \n            Casey Meraz"
}