{
  "url": "https://moz.com/blog/local-search-landscape",
  "slug": "local-search-landscape",
  "title": "Uncover How You Stack Up in the Local Search Landscape - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Sometimes, it’s not about increasing traffic to your website. Sometimes, it’s about getting people through your physical door.",
  "content": "Uncover How You Stack Up in the Local Search Landscape Local SEO | Advanced SEO | Competitive Research By: Roger MozBot May 28, 2019 Table of Contents Copied! By: Roger MozBot May 28, 2019 Uncover How You Stack Up in the Local Search Landscape Local SEO | Advanced SEO | Competitive Research This blog post was originally published on the STAT blog. With local search as competitive as it is, it’s no longer a question of whether or not you should optimize for local — it’s how soon. And when your goal is to get your online customers to visit your location IRL, your strategy needs to be the real deal. That’s exactly why we asked Christina Miazgowicz, the Senior SEO Account Manager at Seer Interactive, to give us her tried and true guide to local optimization. Christina is a local search wizard who spoke at City Crawl Austin and blew us all away with her insight. Get the competitive edge with a local strategy It goes without saying (but we’re saying it anyway) that search engines deliver relevant, location-based results for a business’ products or services. It’s how the searcher finds results that are, well, local. We already know that Google leverages factors such as name, address, and phone number to surface local businesses. But it’s also a good idea if a website is crawlable, has a decent collection of citations, and has a steady stream of backlinks. Does your site have proper categorization? It should. Bonus points if there are ads in place. If that sounds like a lot, fear not — you have an expert on your side. Thanks to Christina’s buffet of takeaways, you’ll learn how to collect local search data, how to analyze your insights to uncover where you stand in the search landscape, and how to carve out a local search strategy that works for you and your data. 1. Know before you go While it might be a no-brainer, you’d be surprised by how many people skip uncovering where they sit in all the noise before executing a strategy. As Christina says, “Knowing where you stand in the local search landscape isn’t just a good step — it’s crucial to a concrete local search strategy.” For instance, do you know if you’re showing up in a local pack? Who’s competing with you in it? Is your Google My Business (GMB) listing complete (and accurate)? Christina and her team conduct a local content audit to help answer these questions. They take a look at the GMB listing, website and landing pages, citations, and ads — the whole nine yards — to help reveal all kinds of goodies, like: Organic search competitors.Google ranking factors.What your searchers are looking for.Where you’re showing up on the SERP. Once an audit is complete, they are one step closer to implementing a comprehensive strategy. But first: it’s data time. And when they need to get the full local picture, Christina and her team turn to STAT. How Seer uses STAT for local SEO Let’s say Christina has a client who’s in the business of designing luxury dog collars (someone is clearly living their best life). They own a storefront boutique that gets a decent amount of web traffic that they’d like to convert into foot traffic. How does Christina make sure their searchers can find them on the SERPs — and then, get them through the door to buy designer dog collars? With a slew of well-researched keywords tracking in STAT, Christina gets fresh, daily insights that she can combine with the knowledge she’s acquired from her local audit. With that in hand, she can tell exactly what trees her clients’ searchers are barking up. Christina notes: “With STAT we get a really drilled down look. We can see how our clients’ URLs are performing rank-wise and if keywords are surfacing SERP features — what type, if they own any of those, and what the competition owns. We can use that data to help surface keywords that matter most in specific zip codes or cities for each client.” In one of our handiest reports, you get all the details hiding in a local pack. Having business names, URLs, ranking positions, Google ratings, counts of ratings, and ads at your fingertips make measuring your local SEO efforts infinitely easier. Christina recommends organizing your top 20 results to keep things neat and tidy — it’s much easier to visualize the landscape. Her tip: “Sort by location, regional monthly search volume, result type (organic, shopping box, local pack), and ranking URL to see all that data at a quick glance.” 2. Visualize and analyze all that data For one of her clients in the banking industry, Christina looked at keywords in 582 zip codes in 49 locations in STAT. And free to export that mountain of data out of STAT, Christina was able to get creative with her analysis and uncover major insights. For instance, she found that 94 percent of listings in the local pack contained the tracked keyword “bank” in the business name. She also determined that for organic page one results, a business’ homepage isn’t as important as the business’ location page, which dominated first page results by 91 percent. Other golden nuggets she discovered in the data: 37 percent of local packs were owned by two competitors.85 percent of listings were verified.99 percent of listings had a website.97 percent of categories were the same as the keyword. Having this detailed level of analysis helps Christina’s clients get a clear understanding of where, realistically, they’re showing up, how they’re performing, who their competition is, and why they may be outranking them. Christina can even provide insight into what searchers are looking for. And when she knows what their intent is, she can help guide optimization efforts to get eyes on her clients — whether they’re in the banking industry or the designer dog collar business. 3. Put together a strategy Now that Christina knows where her client is showing up and what opportunities are up for grabs, it’s finally time to throw down a strategy. Here are the steps she takes to get her clients showing up at the right moment for searchers. Optimize GMB like there’s no tomorrow First things first, says Christina, take a look at your current GMB listing and fill in the gaps to up your organic ranking game: “Make sure your GMB listing matches what’s showing up on your site, with information that’s specific to your business — so your business name, address, and phone number, as well as different content around what’s being searched. Don’t forget photos, reviews, a business category, and any special features.” If it’s a local pack you’re after, the addition of your business address and phone number will up your chances of snagging one. That’s because Google gives ranking strength in local packs to proximity, often more so than to website links, citations, and reviews. Turn up the dial on content Next, Christina suggests optimizing local content to improve your businesses recognition, reviews, and potential reach. Again, think location, hours, and your business name, but also consider creating new content that gives your searchers the inside scoop of your storefront’s community. Seer has an incredibly handy survey tool to help generate new content. You can also apply this to any landing page optimization efforts. Make sure you are present in industry sites that appear in organic results, such as Yelp, which contain a heckin’ ton of backlinks. This is also where you can build up your citation game to gain even more traffic. Pay attention to paid Once your organic strategy is in a good place, shift your focus to paid. Local ads enhance your businesses visibility and showcase what you do and where you are to give you the best chance of appearing in front of potential customers at the right moment. Ready? Go! When you have the full picture of the local landscape, you not only have a realistic understanding of where you’re sitting (and where you can show up), you have the power and precision to make informed decisions — before diving into a strategy. Curious how STAT can help you with your local search endeavors? Say hello and request a demo! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Uncover How You Stack Up in the Local Search Landscape"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Uncover How You Stack Up in the Local Search Landscape"
    },
    {
      "level": "H2",
      "text": "Get the competitive edge with a local strategy"
    },
    {
      "level": "H2",
      "text": "1. Know before you go"
    },
    {
      "level": "H3",
      "text": "How Seer uses STAT for local SEO"
    },
    {
      "level": "H2",
      "text": "2. Visualize and analyze all that data"
    },
    {
      "level": "H2",
      "text": "3. Put together a strategy"
    },
    {
      "level": "H3",
      "text": "Optimize GMB like there’s no tomorrow"
    },
    {
      "level": "H3",
      "text": "Turn up the dial on content"
    },
    {
      "level": "H3",
      "text": "Pay attention to paid"
    },
    {
      "level": "H2",
      "text": "Ready? Go!"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Roger MozBot\n          \n            Roger MozBot\n          \n            Roger MozBot"
}