{
  "url": "https://moz.com/blog/local-content-helping-smbs-keep-big-brands-at-bay",
  "slug": "local-content-helping-smbs-keep-big-brands-at-bay",
  "title": "How Local Content is Helping SMBs Keep Big Brands at Bay - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Separate your brand from the competition by delivering knockout personalized content at every point of engagement.",
  "content": "How Local Content is Helping SMBs Keep Big Brands at Bay Content Marketing | Local SEO | Link Building By: Ronell Smith July 7, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Ronell Smith July 7, 2016 How Local Content is Helping SMBs Keep Big Brands at Bay Content Marketing | Local SEO | Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Darren Shaw of Whitespark speaking at Mozcon Local The gentleman sitting across the table from me at a crowded lunch spot has what he sees as a workable business idea for a local business, a sound plan to get it off the ground, enough funds to weather the ups and downs of the current business climate in his area, and the determination to stick around long enough to be successful. However, what he doesn't have are the answers to three questions pertaining to content marketing for his small business: \"What should I write about?\" \"How do I [rank higher in local SERPs?]\" \"Do I need to use social media? Will it help my brand?\" My heart breaks a little as he looks down to pick at his salad. Not because I don't like questions, or because the questions are difficult to answer. They aren't. In fact, the answer I gave comes from a slogan i learned of in college and have used repeatedly when attempting to get small brands to see the shortest path to success: \"Think globally, act locally.\"The SERPs won't save youEvery brand wants to be No. 1 in the SERPs, or so they think. What they really want, however, is to be the No. 1 most-chosen brand. What ultimately matters in the earliest stages of your relationship with prospects is that they see you in the SERPs, recognize your brand for its quality of service and/or excellent products(s), and reward you with a click. Far too often, however, local brands think too broadly (often as a result of poor keyword selection) and attempt to rank for terms and/or categories they'll never be able to consistently rank for. All the while, they ignore low-hanging fruit, such as ensuring their Google My Places is up-to-date, their citations are accurate, and prioritizing reviews on third-party sites. Worse still, even brands that do commit to these efforts too often ignore creating local-specific pages, which can be a tremendous asset for capturing traffic, leads, and driving conversions for local brands. Individually, not capitalizing on these areas is bad for brand health; collectively, they amount to leaving the door open to the competition. Image sourceAnd if you're a small or midsize business (SMB) owner, your focus must be on closing doors to the competition. To do that you'll need to use your size and the knowledge of your local service area to your advantage. As I'm wont to say, it's simple, but it won't be easy. Local SEO to the rescueA few months, I had the distinct pleasure of getting to work with Local SEO expert Mary Bowling as she prepared for Mozcon Local. During a phone conversation, I shared with her my frustration at seeing local brands get pwned by big brands, in large part because the former has all but given up on the quest to be competitive, even when they have wood to throw on the fire. She agreed that there some holes SMBs are refusing to expose. \"Big brands do have the resources to dominate in local search, but to a large degree they often won't spent the money needed to be successful, specifically as it regards local-specific content,\" says Bowling, owner of Ignitor Digital, which provides online marketing and Local Search marketing solutions to SMBs. \"Often small brands don't create good content because they don't think they have the time. But it's not as complicated as they believe. Also, being that they are the local experts, local-specific content is easier to create than they think and can provide the [perfect vehicle to ward off bigger brands].\" That conversation was the wellspring for discussions I'd later have at Mozcon Local with speakers Mike Ramsey of Nifty Marketing and Darren Shaw of Whitespark. I also had the privilege of interviewing each of them, in addition to Local SEO whiz Phil Rozek of Local Visibility Systems, after the event. What follows is a post based on the entirety of those conversations, with the goal of answering one question: How can local SMBs better compete with big brands in their respective areas? Local content is David's slingshot to Goliath's plate of armorOne of the toughest parts of working with SMB owners is getting them to realize the vast world around them is actually much smaller than they assume, in at least two key ways: Big brands with local or regional offices/locations are always a threat for stealing local customers. Their reach is as limited as their resources, in that while their service area is small, so too is their ability to rank in the SERPs. That is, unless SMBs use the biggest and best weapon available to them: Local-focused content that makes a priority of using people, personalization and events to help them stave off the typically much stronger competition. Full disclosure: Nothing related to business pisses me off more than seeing big brands dominate local search queries, when I know smaller brands that provide better service are all around. Equally frustrating is seeing these small brands try to compete outside their league by relying too heavily on paid search and ignore how effective content marketing can be for their business's long-term success. If this sounds like your brand, I implore you to own your local turf by following the three steps outlined below. #1 — Think quality > quantityAs a business strategist, two questions comes up over and over from SMB owners: \"What should I write about?\" \"How often should I post blogs?\" A better question is, \"What topics are my prospects most interested in, and how can I write about those topics with the quality necessary to gain and retain their attention?\" The process begins with you thinking less about how often you write and more about how well you write on the topics your prospects and customers care most about. \"If you want to get local content, and get ranking but also customers, think quality over quantity,\" says Phil Rozek. \"Get your sea legs. Can you create a page that gets rankings but also customers?\" The last point, which I discussed extensively with Rozek via phone, is a very important one. The key to success for any brand's content goes well beyond the SERPs, and that applies doubly so for local SMBs, where butts in the door or phone calls are the lifeblood of the business. The focus, he says, must be on producing content of sufficient quality and relevancy to move the needle, not simply attain eyeballs. \"The goal is to get the phone to ring,\" adds Rozek. \"You want it to rank and continue to get the phone to ring. But you also want it to be good enough that you get customers who become brand advocates. If you can't do that, you need to go back to the drawing board.\" Ramsey says well-performing local content should hit at least one of the following points perfectly: \"It's unifying. Think of sporting events — it's one thing in a local place that brings everyone together across different walks of life and puts everyone on the same page. Good local content that gets shared and loved does the same.\" \"It's educational. Local is confusing. Whether explaining history, directions, or tips, people crave good information about places.\" \"It's insider. There is nothing worse than someone talking about a place that they don't understand. It's why content 'only' locals perform so well.\" As an example, Ramsey uses Movoto, a service provides tools and information for the real estate, as a great example. You can see from the example below that localized pages they create go way beyond what we typically see for city-specific pages, as the content is compelling visually and topically, creating a rich experience visitors are likely to read, share, and link to. Adds Ramsey, \"SMBs should ask every customer where they spend their time online. When they know that, they can start to create content that will appeal to them. The problem that most SMBs have is they get 'sold' on products that will update feeds with garbage or create content that doesn't really relate to their audience. \"Then they give up. I think they have to step back and realize that you can't outsource strategy. They need to be a part of it. They know their customer and need to be involved in determining how best to reach them.\" What this tells us: Content quality goes beyond good grammar and solid images. Creating a content experience is the optimal goal. How to make it for your brand: Focus on creating content that is uniquely better than anything you've seen or that could be easily created by the competition, no matter how large. Think of the elements that make your area unique and interesting, then work to create content that provides a sensory experience worthy of being talked about and shared. Recommended reading/viewing: How to Create 10x Content - Whiteboard Friday #2 — Relish the role of local expert Mary Bowling speaking at Mozcon Local Each time I do a search for a local service provider and see a large national or regional brand show up, a little of the strategist in me dies insides. Yes, I get that larger brands have the deep pockets to spend on Google Adwords and the domain authority to wreak havoc in the organic search. But come on... A lot of small brands aren't even trying to compete, and that's a shame. \"Too often, with small brands, they think they'll have to hire someone else to create it,\" says Bowling. \"They don't realize they are the local authorities, and simply writing what they know can go a long way. Most sales are taken at the location level, but small brands often don't do enough location-specific content to help their business. Often, with a simple phone call and a fifteen minute interview, we can create a post that's able to move the needle for their brand.\" Bowling further added: \"The goal for the content these small brands create is localized excellence.\" Rob Robillard, aka A Concord Carpenter, provides an excellent example of how local brands can use the expert mantle to own their space. A general contractor, carpenter, and woodworker, Robillard has parlayed his expert and local knowledge into a correspondence gig for the Boston Globe. Image courtesy of A Concord Carpenter Says Rozek, \"Robillard doesn’t write 'local' content as much as he’s a local business owner whose business has benefitted from his having become a noted local authority. Not only does he write for the Boston Globe, he also has a cable show\" and a popular video series. Also, stresses Rozek, different types of businesses will have different goals for their content. A plumber, for example, is likely less concerned with having a piece of content that draws and engagement and get links; she needs the phone to ring. So having strong city-specific pages that have the ability to rank and get the phone to ring would likely be a more desirable option. However, if a small brand can do both, they're better positioned to enjoy success. \"If you have a small site that has good authority and some good links, they're in the bully pulpit because any page they create is a little more likely to rank,\" says Rozek. \"The name of the game, then, is to use the other pages of the site to help the city pages rank, since even if they are done well doesn't guarantee that they rank by themselves. But if you build links to other related pages on the site, those city pages are [likely to see a lift as well in organic reach], which is significant for building authority and engagement, even if the pages the links are pointing to don't get the phone to ring.\" What this tells us: Don't focus solely on creating content that gets the phone to ring. Devote some resources to attaining links on other parts of the site.How to make it for your brand: Spend time building your reputation as an expert of note in your area, then create and share content on your site and other sites you're able to partner with. Also, while city pages get people in the door, effective outreach can help you build links to other parts of the site that, in turn, provide a boost to the other pages on the site, including the city-specific pages. Recommended reading: Top-3 Local SEO \"Content” Wins for People Who Hate to Write#3 — Get personalOne of the toughest sells to SMBs is getting them to see the value of making the content they share personal in nature. Makes zero sense when you consider that unique-to-only-you content is the one thing the competition cannot effectively copy. \"Small companies can create more unifying, educational, and insider content, but to do so they have to find the time and money to do it,\" says Ramsey, adding, if they do, \"Small businesses can blow away competition.\"Mike Ramsey speaking at Mozcon LocalAn impressive example of a small brand outpacing all comers is Danburry Barbershop in Provo, Utah. The site has a welcoming, old-school feel and contains images of customers before, during, and after they receive service.Danburry is getting right to the heart of personalized content by making local folks celebrities of sorts for, well, simply sitting in a chair and getting a trim or a wash. Let's be honest: Who doesn't want to show off their new 'do? You know the customers are sharing the experience with friends and family members while providing the barber shop with ready-made personalized content. Also, the brand posts images to social media, including Facebook and Twitter, creating a web of personalized content even large brands must envy.\"The Danburry Barbershop is killing it with a subdomain on a .blogspot site simply because he uses his site to showcase his customers,\" says Ramsey. \"His Facebook feed is also filled with his customer stories and what they do. He is creating a loyal community of unified, educated, and insider Provo people.\"My question to small business owners is, \"What's stopping you from doing the same?\" And for those who work with SMBs, either as strategists, SEOs, or content people, we mustn't shy away from making recommendations of this sort, especially when a brand has the bandwidth and the clientele to make it work. What this tells us: Look for ways to get personal with your clientele, particularly as it regards the sharing of information involving them.How to make it for your brand: Think of the people who've talked or written about how much they enjoy your product or service. Why not reach out to them for a quick interview, which could take the form of a short video that could posted to Instagram or YouTube or hosted directly on your site?All you'd need is a few questions to ask them — don't make it about your brand. Make it about the audience: getting to know them, who they are, etc.Recommended reading: The Power of the Personal: Personal Brands for Company Brands Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Local Content is Helping SMBs Keep Big Brands at Bay"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Local Content is Helping SMBs Keep Big Brands at Bay"
    },
    {
      "level": "H2",
      "text": "The SERPs won't save you"
    },
    {
      "level": "H2",
      "text": "Local SEO to the rescue"
    },
    {
      "level": "H2",
      "text": "Local content is David's slingshot to Goliath's plate of armor"
    },
    {
      "level": "H2",
      "text": "#1 — Think quality > quantity"
    },
    {
      "level": "H2",
      "text": "#2 — Relish the role of local expert"
    },
    {
      "level": "H2",
      "text": "#3 — Get personal"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ronell Smith\n          \n            Ronell Smith\n          \n            Ronell Smith"
}