{
  "url": "https://moz.com/blog/local-communication-bridges",
  "slug": "local-communication-bridges",
  "title": "8 Local Communication Bridges and 4 Experts to Help You Build Them - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Where can we look for inspiring models and methodologies to help us build better communication bridges with the communities we serve? Miriam chatted with respected experts including David Mihm, Aaron Weiche, Claire Carlile, and Ellen Dunne to equip you with tips for becoming the most connected…",
  "content": "8 Local Communication Bridges and 4 Experts to Help You Build Them Local SEO By: Miriam Ellis June 21, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis June 21, 2021 8 Local Communication Bridges and 4 Experts to Help You Build Them Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. “They weave a web of reciprocity, of giving and taking. In this way, the trees all act as one because the fungi have connected them. Through unity, survival. All flourishing is mutual...all are the beneficiaries of reciprocity.” — Robin Wall Kimmerer, Braiding Sweetgrass: Indigenous Wisdom, Scientific Knowledge, and the Teachings of Plants Local business communications options are rapidly expanding, and customers are trying to reach out to your business for help in many ways. Simultaneously, any local business you're marketing has multiple options for initiating welcome outreach. Where can we look for inspiring models and methodologies to help us build communications bridges with the communities we serve? The model of nature relies on abundance and connectivity. Instead of standing alone, one tree is connected to all the others in its forest via fungal bridges, through which trees provide carbohydrates to mushrooms, and they return the favor with water and minerals. Reciprocity in our digital marketing scenario consists of a business offering something people need while throwing open as many doors of communication as possible. Meanwhile, the consumer contributes their money, time, feedback, loyalty, WOM referrals, and even user-generated content. It’s a very different model than artificial scarcity, which underpins monopoly, arbitrarily limiting things humans need and creating hardship instead of sharing. Think of agonizing automated phone trees vs. well-trained live customer service representatives, and you’ll feel the difference in your gut. Do you find nature’s model to be the more inspirational of the two? Let’s apply it! Google says searches for “local” and “business” grew by an astounding 80% last year as communities earnestly sought reconnection in changed circumstances. Customers truly want a relationship with your business. Let’s look at technological bridges for facilitating relationships with people you want to serve. We’ll chat with respected experts including David Mihm, Aaron Weiche, Claire Carlile, and Ellen Dunne and equip you with tips for becoming the most connected local business in town. 8 ways to connect with modern local business customers Evaluate each of these local business communications bridges to find the best fit for each local business you're marketing. 1. Texting & messaging: winning right now 91% of consumers are interested in texting with you. To learn more about this mode of customer communication, I caught up with my friend Aaron Weiche, whose new business texting and messaging app Leadferno could lead the way in making this technology accessible and simple for local brands at every level. When I asked Aaron to describe the goal of his startup, he emphasized that “win right now” is a key objective for brands considering SMS, and summarized three basic concepts: “Conversion: Our goal is to make having conversations easy and fast. Having an always visible CTA during your web experience attracts more conversations. By offering text messaging to website visitors, they gain a known and trusted channel to ask questions, gain confidence and convert to a customer. Efficiency: Leadferno lets you manage your SMS and Facebook Messenger conversations in one place (GMB messages by fall 2021), giving the business one interface for multiple channels. We’ve layered on time-saving tools like shortcuts to saved replies, scheduled messages, and conversation reminders to shave minutes from conversations for both the business and the consumer. Organization: Businesses miss so many leads in their email or voicemails by not being able to organize them, track their status, assign them, or ensure it’s tied off. Leadferno brings a set of tools and cues so that you stop missing leads and opportunities to help your customers.” Aaron added: “Today’s consumer has growing expectations in timing as they have many options at their fingertips (or search results). If you want to win that business, you better have tools to win right now…or your competitor will.” I concur that now is the right time to start messaging with local customers, and Aaron offered these stats, which underscore this interesting moment of opportunity: 78% of consumers wish they could text businesses66% of consumers would actually pay more for something if it was supported by a mobile messaging channel 69.4% of consumers are extremely likely or likely to interact with a business for customer service via text. Another 24.4% were a maybe with just 6.2% being unlikely. Finally, Aaron offered some tips for brands to be successful with this communications bridge: “Embrace text messaging as a two-way channel, not another blast or campaign. While these might have their place, consumers really want quick answers on a channel they already use more than any other (phone or email). Texting is where the customer is…go to them! SMS offers a quicker conversation for both sides. Text messages are quickly seen and read, allowing for short cycles of responses. Use SMS to help prospects and customers faster. Market that you offer text messaging as a channel. While I feel we will arrive at SMS as an expectation when we see any phone number, you want to use it as a benefit to working with you now. Placing 'you can text us' on your website, landing pages, and traditional marketing lets customers know you have an easy channel to access you.” Considering the statistics surrounding texting, I’d say that nearly every local business should simply be saying “sign me up!” at this point. 2. Google My Business Messaging: built-in visibility Aaron mentioned that Leadferno will start supporting Google My Business Messaging later this year, and it’s an option you should be carefully considering now. With Google’s dominance of local search, anything they develop has built-in visibility, so I reached out to my friend Claire Carlile to see how early adoption of this function is working out for local business clients of Claire Carlile Marketing. I was eager to hear whether the clients she’s implemented this for were actually getting leads from it, and what the volume of messages looked like. She explained: “Yes, they are getting leads! I have stores, attractions, therapists, campsites, and event providers with messaging currently turned on. Volume of messages is very variable. One client, a wine store, can have a few a day, and the others maybe only a couple a week.” This sounds both intriguing and manageable for almost any business, but I asked Claire to share some field notes with me based on her early experience with this feature, and from client opinions while using it, because it might not be right for every local brand. She mentioned: “Ultimately, if the client is keen and has the resources to manage messaging, we've found that it's worthwhile to turn it on. I'd be reticent to turn it on for a customer who was consistently struggling to manage communication channels, as it's a poor customer experience to message a business and not get a reply. All clients have personalized the message that is seen when you click through to message a business — something like 'please do message us here and we'll get back to you as soon as we can. If your enquiry is urgent please call on...Thanks!'” Claire offered some additional words to the wise: “One client had messaging turned off by Google because they did not respond within a 24-hour timeframe. The UI is potentially confusing for both business and people using messaging — it's easier for a business now that they can turn messaging on and off via the GMB app AND the GMB dashboard on a desktop. I've found that if you enable notifications in messaging in the GMB dashboard on a desktop, there don't appear to be any notifications.” So, we’ve learned that Google hasn’t perfected the UX of this feature, but that it can deliver leads for the right businesses with adequate resources for responsiveness. Now is a good time for brands you’re marketing to weigh whether inviting Google into conversations with customers will be a win. 3. Live chat: recreating in-store assistance experiences Like many of you, I’ve been keeping a close eye on the intriguing rise of Shopify, and I was thrilled when Senior Product Lead Ellen Dunne made time to talk with me about trends and tactics surrounding Shopify’s live chat feature. I started by asking her for some basic statistics about the benefits of implementing website-based live chat, and was fascinated by what Ellen shared: “During the COVID period, we saw chat volume increase 85%. As a result, merchant sales revenue attributed to chat increased 200%. A great example of this comes from London homeware brand Earl of East when they had to close the doors of their retail store. They learned a new approach to foot traffic: thinking digitally. They realized that if customers would leave their website because they didn’t get a question answered, it was the same as a customer walking out of their shop. They added chat to their online store, and saw the value of having knowledgeable staff chat with customers to make sales and turn a one time shopper into a loyal customer. There is a strong consumer trend to shop local. When customers can reach a merchant in a chat and connect with a human, an authentic connection is made. The customer is 70% more likely to make a purchase, then to refer friends, come back for subsequent purchases, and so on. The customer relationship is so essential for small/local businesses and we have really seen chat as an invaluable tool for accelerating those relationships and driving sales.” As for top tips for maximizing the potential of live chat, Ellen noted: “It’s not surprising that there is a direct correlation between response time and sales. 10% of customers who initiate a chat from the online store will make a purchase, which is already an impressive conversion rate. That number goes up to 17% when the merchant responds within five minutes. Timeliness is key. Next, understanding that chat is a really effective sales tool is important! Ask the customer the right questions to get a better understanding of what they are looking for so that you can make specific product recommendations and share products right in the conversation. Don’t be afraid to offer a discount if the customer has a high cart value or you feel like it might nudge them to make the purchase now. If merchants can recreate the in-store shopping experience for customers through chat, it works really well.” Finally, I wanted to take the time to ask what it is about Shopify’s offerings that are contributing to the popularity of the company and of features like its live chat. Our search industry can be very choosy about praising software, and it stands out to me that I’m continuously hearing praise for Shopify from so many colleagues. Ellen mentioned these benefits and strategies winning favor with their customers: “1. Chat where people shop. We believe that chat is a tool to help merchants convert more of their hard-earned traffic into sales. Shopify Chat is free, and can be set up on a merchants’ online store in just a few clicks. It also pulls in all chats from channels like Facebook and Apple business chat so all your conversations are in one place. 2. Focus on conversations that lead to sales. Make it easy for you and your team to focus on conversations that lead to sales by using frequently asked questions and reply templates to speed up response time. Automated order lookup through our chat bot can handle conversation volume, which frees up a merchant’s time to focus on pre-purchase conversations that have a high likelihood to result in an order. 3. Give visitors a personalized shopping experience. You can see what customers have in their online shopping cart while chatting with you, and the total cart value. You can use this context to help you prioritize a fast response, anticipate a customer’s questions, or give them additional guidance that you know might be helpful on sizing, materials, etc.” If the local brands you’re marketing have made the O2O leap as a result of the pandemic, don’t overlook live chat as part and parcel of e-commerce. Holding customers’ hands, even at a distance, is a generous and smart strategic choice. 4. Email & email newsletters: consistency is key Email was invented in the 1970s, and I’ll take it as a given that any local business owner or marketer reading this knows that responding to customers’ support request emails in a timely manner is basic to customer service at this point. But what we hear less about is the power of communications initiated by the brand, namely newsletters. I know I’m not alone in having read more brand emails during the pandemic just to understand what was happening with businesses I support, and I wanted to sit down with Tidings founder David Mihm to ask my good friend for the latest happenings, stats, and tips for seeing success with newsletters. David said: “I highlighted a number of (I think) interesting stats in my Whitespark Summit presentation last year — probably the most interesting was Mailchimp’s analysis of the impact of send frequency on open rates: To me that suggests at LEAST through the end of the COVID pandemic, and possibly beyond, that businesses should be staying in touch with their customers on a once-a-week basis for maximum impact. That finding is validated by a much older Marketing Sherpa consumer survey.\" He added: \"My top tip is to be consistent with your sending routine. Per the Mailchimp stats, the most effective businesses send emails to their customers at least monthly, and in many cases weekly. Email is most effective when it keeps you top of mind with your customers (in addition to being a direct transactional channel). Search for the 'mere presence effect' in psychology. Simply sending a once-a-year birthday email, and maybe a Black Friday discount, doesn’t really keep you top of mind. Beyond that, I’d say make sure you’re sending engaging content. What that content is varies by industry, but for many the 80-20 rule of thumb holds. That is, 80% of your emails should be educational/informational, and 20% of them should be promotional. There are a number of studies that back this up. Promotions might be the primary reason your subscribers sign up to hear from you, but if all you do is bombard them with discounts (which might also impact your bottom line), you could see a drop-off in engagement.” While I had David with me, I also asked what has made Tidings successful, and he explained its customer-centric benefits: “Our goal is to make it as easy as possible to share great content with your subscribers via email. For those local businesses who are active on social media, we pull in your existing social content by default, but even if you’re not active, you can just drop in bookmarked articles as you come across them and build a really engaging newsletter in seconds. We integrate with the major small business email Service Providers (Mailchimp, Constant Contact, ActiveCampaign), so you can just send to your customer segment(s) directly from Tidings — you don’t need to migrate your lists or set up new forms on your website.” I’d sum up by recommending that if you’re considering starting a newsletter, be sure any tool you consider offers the types of conveniences David just described, and that you build a bridge readers love crossing to get to you! 5. Phone: pain points and pet peeves you can solve with people You know what automatically raises my hackles like the spines on a disgruntled hedgehog? Robots, phone trees, and automated messaging blocking my access to human beings when I call a business for help. Microsoft found that being trapped by automated phone systems was the #1 cause of customer frustration linked to churn. Unless I’m dialing after hours or the business is one you wouldn’t normally contact by phone, anything other than fast access to a live person signals to me, as a customer, one or more of the following negative sentiments: This business doesn’t care about me and my experience contacting them.This business is too big to speak to me and has doomed me to shouting at a senseless robot.This business is too small/understaffed to answer their own phone.This business is inaccessible.This business is hiding from the public.This business replaced a bunch of their staff with robots, costing my fellow citizens their jobs and me the information and pleasure of learning what it’s like to interact with their team. In short, I’m not reaching out to do business with a robot, so why am I being greeted and gate-kept by one? Pet peeves and pain points abound, and the least digestible aspect of this is that it’s a problem brands have created for themselves in defiance of the basic tenets of good customer service (not to mention, good manners). In Why is Customer Service So Bad? Because It’s Profitable, Harvard Business Review found that: “American consumers spend, on average, 13 hours per year in calling queue...a third of complaining customers must make two or more calls to resolve their complaints and that ignores the portion who simply give up in exasperation after their first call.” This study suggests that by putting as many hassles as possible in the way of customers, companies have to pay out less in redressals, and if they have enough market share, they aren’t worried about resulting reputation damage. Most distressingly, data indicates that women, Black, and Latino customers are treated to the worst customer service hassles. This may be someone’s idea of how to run a good business, but don’t let it be yours. Local businesses and monopolies are on opposite sides of this equation, and a well-trained phone staff can be an incredible differentiator between a business you’re marketing and its more uncaring corporate peers. I’d bet my hat (and my hackles) that there isn’t an average American citizen right now who can’t readily empathize with consumer loathing for bureaucracy in phone UX, especially after a year of trying to reach government resources for vaccinations, DMV, unemployment, and a host of other stressful scenarios. Rescue your customers from that awful feeling of being disregarded by employing people to answer your phones — with excellent customer service as their absolute mission. 6. Google Questions & Answers: leads gathering dust This pie chart capture from my original 2020 survey of US grocery stores tells the sad story of Google’s experimental Q&A feature, located within Google Business Profiles. The 50 top-ranked supermarkets I studied across the country had received 1,145 leads, requests for help, and other timely inquiries in the form of Q&A, but 86% of the markets were simply ignoring this content. My earlier research on restaurants surfaced similar neglect. Some of my peers are starting to chalk up Q&A as a failed bridge Google tried to build because of lack of brand adoption (not to mention a preponderance of useless non-answers being provided by the public in the absence of any official response). I think there’s still reason to explore use of this overlooked feature for three forms of communication: To post company FAQs as a means of having answers to common questions visible right on your Google listings. Even if you get zero queries from the public, you can do a one-and-done session of adding and answering your own top FAQs and walk away feeling good.To capture leads. Walking away from Q&A queries that are clearly leads is as senseless as ignoring someone at your real-world customer service desk. To demonstrate responsiveness. Google’s bridge may not be ideal here, but if you meet your customers on it with timely replies, you’re building the right kind of reputation. I think one of the biggest challenges preventing businesses from using Q&A to its full potential is simple lack of awareness that the public is out there asking questions. Need a solution? Moz Local alerts you every time you get a new question on any of your listings, supporting your development of a reputation for superlative accessibility. 7. Google Posts: publication without blogging Blogging isn’t right for every local business, although sources estimate that there are 600,000,000 blogs on the web and that 85% of B2C marketers utilize this form of publication. Read Chapter 5 of The Essential Local SEO Strategy Guide to determine whether blogging is right for any local business you’re marketing. If you decide a formal investment in this type of content isn’t a good match for a particular brand and/or its audience, microblogging in the form of Google Posts could still be a win for you. Google Posts are a communications bridge you initiate on your end — either using the Moz Local dashboard or the GMB dashboard. They’re a form of publication that’s so easy to write, so there’s no reason not to experiment with them. They can do wonders for intent matching when you focus on topics customers are searching for, but to find out whether people are actually crossing the bridge you’re building with Google Posts, don’t miss Joy Hawkins’ tutorial on how to track them in Google Analytics and Google Search Console. Focus your Google Posts on attention-grabbing topics of interest to your customers, use images (including images with text in them), and be sure they feature strong calls-to-action. 8. Telesupport: next best thing to in person, or, sometimes, even better Check out Crate & Barrel’s virtual customer services and consider whether this type of telesupport is a good fit for a local brand you’re marketing. PCMag ran a good piece recently on the best video conferencing software, and after a year of celebrating family events over Zoom, think of the segments of your consumer base who have now gained a new comfort level with video-based communications. We’re still in the early stages of this. A recent Biteable survey found that just 19% of businesses are using video as part of their customer service solutions, though 32% are now using filmed media for sales. Local brands looking to differentiate themselves have a limited time window for becoming early adopters of this technology in order to develop a reputation for multimedia accessibility before their competitors do. Surveys indicate that the shopping public is eager for the return of in-store local business experiences when safer days arrive, but our taste for online convenience will not be soon forgotten. If there are elements of a business model you’re marketing that can be supported by video — like consultation, complaint resolution, or showcasing — there are many customers who would like to catch up with you online rather than fighting traffic to get to you. Even in more normal times, all of us have sick days, busy weeks, and downtime when we’d just prefer to stay comfy at home. Telesupport makes consumer-to-brand connection possible when it wouldn’t be otherwise, making it an opportunity worthy of exploration. Customer service = conversation Image credit: Mike Goad Customer service — that make-or-break foundation of all local brands — really boils down to how good you are at sparking, facilitating, managing, and resolving conversations. If you can think like a glorious tree and span your neck of the woods with accessible communications bridges, you can go far towards resolving one of the oldest challenges in commerce. As a local SEO, I read more consumer reviews than most people do, and an ever-present theme is that many customers fear businesses are in some way trying to rip them off. I see all kinds of anxiety and anger, often groundless, emerging in the way unhappy customers review businesses. I picture these reviewers sitting remote from the business, alone with their device and their unresolved complaints. Somehow, they’ve been left to brood on dissatisfactions, rather than encouraged to trust that if they speak up, they’ll be helped. Let’s bring some photosynthesis into this age-old, stale situation. Imagine this same customer welcomed across many bridges: texting, messaging, live chat, newsletters, microblogging, humans on phones, humans on film, and all questions answered. It’s all as simple as talking + tech, and if you get it right, reciprocal benefits will follow. Earn customers’ trust by showing that you’re always ready to talk, and they’ll grow your business for you. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "8 Local Communication Bridges and 4 Experts to Help You Build Them"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "8 Local Communication Bridges and 4 Experts to Help You Build Them"
    },
    {
      "level": "H2",
      "text": "8 ways to connect with modern local business customers"
    },
    {
      "level": "H3",
      "text": "1. Texting & messaging: winning right now"
    },
    {
      "level": "H3",
      "text": "2. Google My Business Messaging: built-in visibility"
    },
    {
      "level": "H3",
      "text": "3. Live chat: recreating in-store assistance experiences"
    },
    {
      "level": "H3",
      "text": "4. Email & email newsletters: consistency is key"
    },
    {
      "level": "H3",
      "text": "5. Phone: pain points and pet peeves you can solve with people"
    },
    {
      "level": "H3",
      "text": "6. Google Questions & Answers: leads gathering dust"
    },
    {
      "level": "H3",
      "text": "7. Google Posts: publication without blogging"
    },
    {
      "level": "H3",
      "text": "8. Telesupport: next best thing to in person, or, sometimes, even better"
    },
    {
      "level": "H2",
      "text": "Customer service = conversation"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}