{
  "url": "https://moz.com/blog/local-search-moving-locations",
  "slug": "local-search-moving-locations",
  "title": "Moving to a New Location? Don't Forget about Local Search - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It’s obviously not uncommon for small businesses to move. However, few business owners realize the Local Search headaches they may be creating for themselves or their customers as a result of a move. The problem is so common that I thought I’d turn my advice into a blog post/case study.",
  "content": "Moving to a New Location? Don't Forget about Local Search Local SEO By: David Mihm January 30, 2013 Table of Contents Copied! By: David Mihm January 30, 2013 Moving to a New Location? Don't Forget about Local Search Local SEO It’s obviously not uncommon for small businesses to move -- fluctuating rents, growth, lifestyle concerns for the business owner or employees, and any number of factors make good reasons to move. However, few business owners understand the Local Search headaches they may be creating for themselves or their customers as a result of a move. Celia Bell, Assistant Director of SCORE, is currently experiencing some of those headaches and sent me an email last week to ask for my advice on how to alleviate them. Given her essential help with Local University Austin next week, it was the least I could do to respond. The problem Celia’s having is so common, though, that I thought I’d just turn my advice into a blog post/case study. The situation SCORE is a nationwide volunteer-driven non-profit organization that mentors small business owners and prospective entrepreneurs in 340 markets across the country. Each of its chapters operates relatively independently from a physical location, with significant support from the parent organization -- not unlike a typical commercial franchise or chain-store model. SCORE’s Austin chapter recently moved to a location about eight miles northwest of its old local headquarters. Unfortunately, Google was displaying its former headquarters right on the main search result for “SCORE Austin,” and SCORE clients were actually visiting the old address for meetings and workshops. (In fairness to Google, other search engines were confused as well, though not quite to the same extent.) The goal of this exercise: Ensure all prominent web, mobile, and app search results display only the current, proper information for the SCORE chapter. Getting started SCORE’s volunteer webmaster only increased her frustration level by attempting to edit the group's Google Plus Local page over and over again, with nothing to show for it. Sadly, I suspect many business owners (and marketing agencies) go through the same process, with equally unsatisfying results. I hope that this guide yields more success and helps explain why the process must be more comprehensive than just a quick edit at Google. The reason that simply correcting misinformation about your business at Google does not solve the problem is that Google's Local index pulls in business data from a nearly-infinite number of sources across the web. Some of these are more authoritative than others (such as those provided by Localeze, Infogroup, and Acxiom--see below), but a business owner's verified listing is only one source of this data. If all you're doing is updating your Google+ Local Page, you're going to continue to see problems because \"new\" erroneous data will constantly feed into Google from all of its other sources. Assessing the damage One of the central tenets of local search engine optimization is to ensure that your business’s Name, Address, and Phone number, NAP for short, is consistent everywhere it’s mentioned around the web (and offline, too). Your NAP is basically your digital thumbprint -- Google’s unique identifier for an individual business. When you move locations, you create an inconsistency in the A of your NAP. Sadly, there’s no “301 redirect” or “forward location” command that you can give the local search engines, similar to what you can file with the U.S. Postal Service. Google, Bing, and others can't identify your new NAP as belonging to the same business. In the best case, inconsistencies lead to lower search engine rankings for keyword searches you want to rank for. But in the worst case (SCORE’s), not even customers who are specifically looking for your business can find you! So, unfortunately, it's up to you to update this information yourself. The first thing I did was to run an Accuracy Report on GetListed for both SCORE's old and new NAP information. I wanted to see which search engines had indexed which location(s), and in what manner. Incorrect (Old) NAP: SCORE Austin 3809 S 2nd St Austin, TX 78704 (512) 928-2425 Correct (New) NAP: SCORE Austin 5524 Bee Cave Rd., Building M Austin, TX 78746 (512) 928-2425 Running this report provided three key insights: 1) SCORE’s phone number did not change during the move. 2) Their business name is actually an acronym for “Service Corps Of Retired Executives” -- which is how they’re listed on four of the most prominent local search engines: US Score-Services Corps of Retired (Google) US SCORE-SVC CORPS OF RETIRED (Infogroup) US Score-Svc Corps of Retired (YP.com) Service Corps of RTRD Exctvs Assctn (Nokia) 3) SCORE recently implemented a nationwide effort to unify branding across all of its chapters--moving from an older strategy of each chapter operating its own unique website (scoreaustin.org, e.g.) to giving each chapter its own subdomain on the national website (austin.score.org). Item #1 is a major advantage over many small businesses who move locations -- a constant phone number means that Google and other search engines should be able to verify changes much more quickly. Item #2 is a disadvantage, since neither the old NAP or new NAP is 100% clean. This will mean multiple rounds of clean up. Item #3 may be a disadvantage depending on the email address in which SCORE’s Google Plus Local pages are claimed. The cleanup process After running your Accuracy Report, go back to Google and perform a search, where your query is any combination of incorrect/old NAP information. Make note of the webpages that Google returns near the top of its rankings, as Google is likely pulling data from most of these sites. I find it useful to keep track of this information on an Excel or Google Spreadsheet, from a task management standpoint. You can also click through to any Plus Pages returned by these searches. If you're lucky, sometimes Google will even tell you a few of the sites they are pulling this information from towards the bottom of those pages. In SCORE's case, Citysearch was a very important site feeding Google bad information. You should also search Google Maps for out-of-date information. Once you do, click the little triangular drop-down button and select \"Report a problem\" at the bottom of the list. On the report a problem screen, correct any misinformation and explain to Google why you are requesting the change (i.e. you've moved!). Pay special attention to the bottom of the webpages where your information is incorrect. Many of these are local directory sites where you will be able to update the information yourself--but they, in turn, may be getting this misinformation from another source. Good examples of this in SCORE's case were sites like this one for the Honolulu Star-Advertiser -- a newspaper that was not even in SCORE's market -- which was supplied with data by both Local.com and Acxiom. In addition to fixing your data on these local directories, you'll want to fix it on sites that supply them with this data. These sites are Acxiom, Infogroup (ExpressUpdateUSA) and Localeze. Together, these are the three most important business data providers to Google, and if you want to update your old information permanently, you'll need to update it at all three of these sites. These companies also feed most major mobile apps like Facebook Nearby, Foursquare, and Apple Maps. After searching Google and Google Maps, reporting problems directly, and keeping note of all of their erroneous data sources, you'll want to check one more site that Google operates: Google MapMaker. Think of MapMaker as a Wikipedia for locations. Google users from all of the world can add, edit, delete, and consolidate business information using this tool. For the most part, each edit is reviewed by other Google users before it goes live to the public. Not many business owners (or even marketers, for that matter) know about MapMaker, but it seems to have become a very important element in Google's business data cluster over the last few years, and it can be very helpful in cleaning up out-of-date information. Remember the \"Report a problem\" step above? My understanding is that that process actually feeds into the MapMaker community, but I've found that edits requested directly in MapMaker sometimes get processed more quickly than \"reported problems.\" To request an edit, simply click the \"Edit\" link under any incorrect listing for your business on MapMaker, update your information, and tell the community why you are asking for a change (i.e. your business has moved!). Whew! This all seems a little complicated. As I said above, though, keeping track of all of the sites where you're listed incorrectly via an Excel or Google Spreadsheet can make things a lot simpler. Most of these major data sources for Google allow you to update information on out-of-date listings by creating a free account. Note: it's important to UPDATE old, out-of-date listings rather than create new ones. Just creating new, correct ones won't make the old, incorrect ones go away. During the course of your research, you may also find some independently-operated sites (such as local libraries or chambers of commerce), where you'll just have to reach out via email or by placing a phone call. In my spreadsheet, I typically enter the profile page along with username, email address, and password information for each major data source on its own line. I then make a note of the last time I \"touched\" each listing and any notes that will help me remember special treatment for each. It's a best practice to choose a generic email address for your business (something like frontdesk@mybusiness.com) rather than a personal one (doglover@yahoo.com), so that future employees or agencies will be able to log in and update your information without you giving away any personal details. Frustratingly, even though this is 2013 and this is the INTERNET, it typically takes 2-3 months for all of these updates to flow through the Local Ecosystem. So you may continue to see incorrect information showing up at Google while it assimilates all of these changes. If you've followed the process above, however, you should see a permanent update of your information at Google and other major search engines and mobile apps. N.B. #1 I realize this guide is U.S.-Centric, and here on the SEOmoz Blog we have many international users. Over the course of the Spring, I'll be releasing Local Search Ecosystems for a number of major search markets around the world, including the UK, Germany, France, Spain, and Brasil. I already released the Canadian Ecosystem last year. Although the data aggregators that feed Google vary across the world, the same process can be followed in other countries. N.B. #2 I realize the additional step of querying Google and Google Maps for out-of-date NAP information seems unnecessary and duplicative, given what GetListed.org is designed to do. We are currently working on surfacing this information much more efficiently within the next version of GetListed, so stay tuned! Fixing bad data across the Local Search ecosystem: The Cliffs Notes Version 1) Search Google.com and Maps.Google.com for your business name and city. 1a) In this era of increasing mobile engagement, you may also want to check Apple Maps or other primary mobile applications. 2) Run an Accuracy Report on GetListed.org for both correct and incorrect information returned by Google. 3) Search Google.com for your incorrect NAP. 4) From your Google.com searches and GetListed.org Accuracy Report, keep track of major data sources that list your information incorrectly in an Excel or Google Spreadsheet. 5) Search Google Maps for your incorrect NAP and \"Report a problem\" for any listing that is incorrect. 6) Visit Infogroup, Localeze, and Acxiom to check for out-of-date information. 7) Create accounts on major search engines and update incorrect listings. 8) Search Google MapMaker for your incorrect NAP. Make edits as needed for any listing that is incorrect. 9) Keep track of your accounts and your progress in an Excel or Google Spreadsheet. Other great resources for helping you move locations digitally Marking Your Place as Closed or Moved from the Google Places for Business Help Section Google Support Guru Joel Headley on the best way to move your business Moving? No Need for Your Local Search Ranking to Suffer (VIUS) 31 Places to Change Your Business Address (Outspoken Media) Closing an Old Google Local Listing vs Editing It (NGS Marketing) How to Remove Duplicate Listings from Different Business Directories (NGS Marketing) Improved Messaging for Moved Businesses (Mike Blumenthal) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Moving to a New Location? Don't Forget about Local Search"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Moving to a New Location? Don't Forget about Local Search"
    },
    {
      "level": "H2",
      "text": "The situation"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Getting started"
    },
    {
      "level": "H3",
      "text": "Assessing the damage"
    },
    {
      "level": "H2",
      "text": "The cleanup process"
    },
    {
      "level": "H3",
      "text": "Fixing bad data across the Local Search ecosystem: The Cliffs Notes Version"
    },
    {
      "level": "H2",
      "text": "Other great resources for helping you move locations digitally"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "David Mihm\n          \n            David Mihm\n          \n            David Mihm"
}