{
  "url": "https://moz.com/blog/local-business-incentive-ideas",
  "slug": "local-business-incentive-ideas",
  "title": "7 Local Business Incentives to Offer Instead of Amazon Gift Cards - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When budget is allocated to increase sign-ups or improve retention with gifts, we want recipients to feel intrigued, recognized, engaged, welcomed, and understood. And when 65% of your local business customer base views Amazon’s market dominance as a challenge to the existence of their business, it…",
  "content": "7 Local Business Incentives to Offer Instead of Amazon Gift Cards Local SEO By: Miriam Ellis April 18, 2022 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis April 18, 2022 7 Local Business Incentives to Offer Instead of Amazon Gift Cards Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. If you sell software, marketing services, or other goods to local business owners, it’s time to reconsider offering Amazon gift cards as incentives. According to ILSR’s 2022 survey of independent business owners: 65% of your customer base views Amazon’s market dominance as a challenge to the existence of their business70% want the government to either break up or regulate Amazon When budget is allocated to increase sign-ups or improve retention with a douceur, we want recipients to feel intrigued, recognized, engaged, welcomed, and understood. It turns out there are much better ways to sweeten a deal than sending a gift card with a logo on it that stands for a threat to the livelihood of the community we want to serve. Quotes from survey participants indicate how hard they are struggling, and how forgotten they can feel: “Hard to understand how the growth and survival of small businesses has taken such a back seat in both political parties over the years.” “Make Amazon […] pay their taxes. I have to pay mine, they should pay theirs.” “We frequently have the opportunity to bid on school district purchase orders, and we lose them when Amazon's prices undercut our margin.” “Amazon is killing the independent office supply industry.” “If our cities and towns lose small businesses, we lose essential and culturally significant institutions. If large retailers continue to … monopolize industries, we as individuals also lose the ability to make meaningful choices with our purchases.” Clearly, with distress signals like these being emitted by the majority of the local business sector, the last thing that will make them feel championed is the sight of an Amazon gift card in their inbox. Better news via awareness and allyship The better news is that survey data like this empowers our agencies to ditch vague assumptions that “everyone loves Amazon” in favor of some truly nice, thoughtful, useful alternatives that will demonstrate awareness of clients’ reality! Here are seven Amazon alternatives to suggest at your next marketing huddle: 1) Free consulting with your experts Experience has taught me that the one thing local business owners may appreciate more than any other incentive you can offer them is a little bit extra of your time. Yes, the time of the experts at your company is very valuable, and you need to charge for it, but you can make a sales campaign much stronger by bundling it with some gratis consulting. Generously helping small entrepreneurs power through a session of their most important FAQs also turns out to be a great way to forge new relationships based on meaningful conversations. You will find out that you learn a lot from the experience that can be of use to your agency. Win-win, indeed! 2) A local business book bag Offer a tote holding a selection of excellent books for small entrepreneurs. Topics could include economics, tech, marketing, DEI, environment, advocacy, history, and something just for fun. Choose titles that you feel will be of real help to SMBs learning to set up, improve, and market their business. And don’t forget to throw in a copy of “How to Defeat Amazon and Why” by independent bookstore owner, Danny Caine. 3) A ticket to an online local business event or training course Image credit: Lynn Friedman Offer a free pass to a virtual conference which business owners can attend from anywhere, a ticket to a post-conference video bundle, or access to an SEO training course like Moz Academy. The chance to learn from experts can take a local business owner to the next level of proficiency in their marketing skills and contribute to their success. 4) Paid subscriptions How about an offer to pay the company’s subscription for a year to whatever their local newspaper is? We all know these outlets are really suffering with 2,100 local papers having closed since 2004, and this promotion could help both the business owner and their community at the same time. Alternatively, a subscription to one of the larger national publications will give SMBs access to paywalled financial and marketing advice they might otherwise be unable to afford. If doing appeals more than reading, consider paying a few months’ subscription to software or tools to get the business moving forward with their operations or marketing. 5) Grocery gift cards 1 in 5 Americans don’t have enough to eat and of those going hungry, nearly 12 million are children. Even in households where people are still managing to get by, the 7.4% increase in grocery prices over the past year is being felt by most of us. When we refine these overwhelming statistics to a story about just one person, we can easily imagine a mother or father who has a good local business idea which they do not have the ease to pursue because the struggle to put food on the table is all-consuming. Offering a grocery gift card could be a very practical, inclusive, down-to-earth way to create that tiny bit of breathing room a small entrepreneur needs to take the next step in their business plan. 6) Philanthropic options When your customer base is independent business owners and not the rich, it’s good to remember that multiple studies indicate that the less people have, the more they tend to give. A philanthropic offer could be the perk that helps a local business choose your service over a competitor’s. I’ve seen some good marketing lately. Salesforce, Timberland, Clifbar and Microsoft are planting millions of trees. 4Ocean pulls a pound of plastic refuse out of the sea every time you buy from them. Everlane’s 100% Human clothing collection is underpinned by a 10% donation to the ACLU and Bombas gives clothing to homeless shelters for every piece of apparel you buy. Buy a toothbrush from Mable and they’ll match it by giving one to a child, buy bedding from SolOrganics, and they’ll give you a few bucks to donate to the charity of your choice. The ROI of cause-driven marketing varies. One survey found that 87% of people will buy a product because the vendor aligns with a cause that matters to them. If your agency has an authentic conviction about a particular cause, extend the opportunity to do good to your potential customers so that benefits flow beyond the narrow confines of a single transaction. 7) General gift cards If you feel that a gift card to a large, general marketplace is really the best fit for the audience you’re trying to attract, Etsy has historically been more in keeping with the small business ethic than Amazon. Etsy’s sellers are nearly all small entrepreneurs, with over 90% operating from home and over 80% identifying as women. If you tend to associate Etsy with random crafts, check them out again. There are all kinds of useful office supplies, executive gifts, custom tech goodies, and other items on offer that would be appreciated by most business owners. Unfortunately, the April Etsy seller strike due to the marketplace raising merchant fees by 30%, despite the brand pulling in record profits, is dimming the once-shiny small business rep of the brand. If this concerns you, you might consider a GoldBelly gift card, with its emphasis on gourmet food, an Ultimate Green Store gift card for a wide selection of eco-oriented merchandise, something from the GiveandGetLocal directory, or simply a pre-paid card from Visa, American Express or another vendor to allow the customer to spend where they choose. It really is the thought that counts It was Winston Churchill who said that we make a living by what we get but that we make a life by what we give. When your agency is seeking to give something to the local business community, survey data like ILSR’s can help you choose a gift that will make customers respond with that magic phrase, “This company really gets me.” A final tip is to reach out for potential partnerships with other companies once you’ve narrowed your selection down to the gifts you’d most like to offer. Vendors will sometimes come up with a good deal for you if you’re using their product or service as part of your agency’s promotion, which can be a great opportunity to further grow your own B2B relationships. Local business owners are already longing to make a life beyond Amazon, and with a little thoughtfulness, you can demonstrate your brand’s awareness and support. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "7 Local Business Incentives to Offer Instead of Amazon Gift Cards"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "7 Local Business Incentives to Offer Instead of Amazon Gift Cards"
    },
    {
      "level": "H2",
      "text": "Better news via awareness and allyship"
    },
    {
      "level": "H3",
      "text": "1) Free consulting with your experts"
    },
    {
      "level": "H3",
      "text": "2) A local business book bag"
    },
    {
      "level": "H3",
      "text": "3) A ticket to an online local business event or training course"
    },
    {
      "level": "H3",
      "text": "4) Paid subscriptions"
    },
    {
      "level": "H3",
      "text": "5) Grocery gift cards"
    },
    {
      "level": "H3",
      "text": "6) Philanthropic options"
    },
    {
      "level": "H3",
      "text": "7)  General gift cards"
    },
    {
      "level": "H2",
      "text": "It really is the thought that counts"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}