{
  "url": "https://moz.com/blog/local-seo-tasks-for-summer-success",
  "slug": "local-seo-tasks-for-summer-success",
  "title": "6 Local SEO Tasks for Summer Success - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Every small effort in optimizing your local SEO presence can add up, allowing you to build habits, content, and connections that should help your business stand out in all seasons. With AI being the talk of the town, it’s more important than ever to keep up with trends and the ever-changing local…",
  "content": "6 Local SEO Tasks for Summer Success Local SEO By: Miriam Ellis June 13, 2023 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis June 13, 2023 6 Local SEO Tasks for Summer Success Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Edited by Emilie Martin I hope this summer features at least a few lazy days for you, kicking back in the shade with loved ones and a pitcher of iced tea or a tray of homemade popsicles. But the next few months can also be a really exciting time to try out new local SEO and marketing tasks well ahead of the holiday season to see what’s resonating with your community in 2023. Here are 6 smart things to try that could sweeten your local business’ summer success. 1. Get on the Search Labs waiting list No one likes standing in line, but there’s one queue you should get in this summer and that’s for Google Search Labs so that you can get the earliest possible access to the new Search Generative Experience (SGE), shown above in Joy Hawkins’ tweet linking to this early bird article. SGE is one of Google’s experiments at incorporating AI into their search results, and while the good news is that early testers are seeing local pack-like results for local SGE searches, the rankings of these “new packs” don’t match up point-for-point with traditional packs or organic results and that’s news your business needs to know. As Noah Learner reports: And as I reported back in April regarding Google’s AI chat Bard rollout, there is definitely some overlap between AI results and older layouts, but there are also some differences. Getting access to SGE so that you can work on puzzling out what causes those differences and understand how to earn top visibility in the new formats will be smart work for any local business. Whether all of these AI experiments will fundamentally change your business operations or marketing practices remains to be seen. We’re all waiting to find out which products will actually move forward and how many customers will actually integrate them into their daily lives as they have with local packs, Google Maps, Apple Maps and other familiar features. While you’re in line, I recommend reading Greg Sterling’s piece, Google SGE: Meet the New Pack. 2. Study the weather and serve the people If any part of your business or inventory ties to seasonality, you’re quickly learning that you can’t count on the weather anymore. In 2021, millions of people in Oregon and Washington were desperately hunting for air conditioners when their summer temperatures became 30-40 degrees above normal. Air conditioners just weren’t a “thing” in the Pacific Northwest before, but they are now. Where I live in Northern California, the extreme drought had gone on for so long, memories of wet winters were fading into myth. Then we got inundated with such rain this past winter that people were scrambling for umbrellas, for wood chips to fill their flooded driveways so that cars wouldn’t sink, for sandbags and French drains. No one is sure what is going to happen when our massive snowpack melts here this year... The thing about Climate Change is that it causes erratic weather, and we’re just not able to make statements any more like “England is a wet, cool country” or “New York gets heavy winter snowfall”, or “California is dry” and base our inventory on these “facts”. Many local businesses will need to re-think seasonality and activate a more fluid supply chain and inventory structure to accommodate for weather and conditions locals aren’t prepared for or accustomed to. They may need to extend floorspace time for seasonal products, or at least warehouse them, to be brought out at time of need so that they can be the ones selling the air conditioners to Portland and Seattle and the galoshes to people in San Francisco. Even restaurant menus need to incorporate awareness, because diners may not want to eat cold salads in a wet, foggy summer, or hot chowder when the temperature at the coast is 116 degrees. Ready your business to respond speedily to sudden changes, using social media and your website to let locals know that you - at least - are prepared to serve them in novel conditions. And don’t overlook how upset people are feeling about these changes. Use your voice to advocate for the transition to green energy in your community and in your nation so that the detriments of Climate Change are actually being addressed instead of simply reacted to on a town-by-town basis. 3. Put on your pro-active shorts You’ve noticed that video is everywhere in the SERPs, right? When I looked at MozCast this morning, I saw that at least 23% of the searches we track are returning video results. In fact, at this moment in time, it appears that Google is returning videos more often than local packs in this snapshot of our data set: This prevalence is playing a part in why many local SEOs are now recommending that local businesses include some form of video along with every new page they publish. I’d recommend taking that strategy one step further: create two videos for every new page or piece you publish. Why? Take a look at this YouTube result for the multi-location brand Patagonia: As you can see, the top video is one that’s been published by the actual company, but the new-ish Shorts section tells a different story. The brand has complete control over the messaging in their own videos, but what narrative is being built by the Shorts (videos of 60 seconds-or-less) lineup? Random customers (or non-customers) appear to be questioning the company’s prices, creating an atmosphere of controversy by hinting at revealing unknown information, and claiming that the business hates zippers. Is any of this accurate, relevant? Who knows. It doesn’t come from the brand. Meanwhile, two of the results have nothing to do with the business and are, instead, featuring Argentina. If all of this is beginning to sound familiar, it’s because local businesses and their marketers have encountered this phenomenon before, in the form of Google Business Profile Q&A. When you leave it entirely up to the public to tell your brand story, you may end up with this: What’s happening here is that a platform exists on which a business can create content, but that platform is being ignored by the business. Customers think the business should have content there to help them out, but where neglect is present, leads are being lost to unhelpful, random information from the public that is not designed to convert. This is one of the best examples I know of user generated content (UGC) gone wrong. I’m a firm believer in the concept that the customers of customer-centric businesses tell the best brand stories. In fact, as we saw in Moz’s review survey, only 11% of people trust what brands say about themselves more than what customers say about them. I’m a huge fan of UGC and its powers of persuasion, but I also believe that brands should take control wherever they can. So, this summer, as you’re uploading new product and service pages, refreshing your about page, updating your mission statement, or creating any new content around what your business is and does in your community, experiment with creating both: A long-form video of whatever length that summarizes the content of the page and is uploaded to your YouTube channelA video short that highlights the most important/sharable aspect of the content and is uploaded to the shorts section of your YouTube channel These shorts can also become the basis of a TikTok feed for your business, if you want to go that way, or can be ideal for sharing on your other existing social channels. And don’t forget that you can upload videos to the image section of your Google Business Profiles! Note that there is debated about the actual length of these. Google’s guidelines say 30 seconds, but videos of over a minute have been spotted. Read this Twitter thread for more conversation on this topic: 4. Speaking of Google Business Profiles… Here are three tasks to enrich your profiles over the summer that will hopefully increase customer actions surrounding your listing: Add three new seasonal photos each month this summer. Many local SEOs believe dripping information to Google is a smart strategy for proving freshness. Even if your business doesn’t experience major seasonal changes, use your creativity to showcase your business in the summer sunshine.Write one new Google Update (formerly known as Google Posts) per week in June, July, and August. Sterling Sky found that Offer-type updates get the most clicks, so focus on your summer specials and discounts, create interest by mentioning that these are time-limited offers, and don’t forget to include a strong call-to-action of what you most want the customer to do after reading your Update.Check your hours! Many businesses have longer hours in summer, but even if yours don’t change, check your GBP (and other listings) for accuracy. Summer brings visitors to nearly every town. These folks don’t already know when you’re open or closed as locals might. You can keep everyone a happy camper by double-checking that your store hours are listed correctly so that no one is inconvenienced. This will also protect your brand from avoidable negative reviews. If you discover troubling inconsistencies in your hours across the local search ecosystem, consider signing up for Moz Local so that we can quickly distribute accurate information for your business to all the major local business listing platforms around the web. 5. Speaking of visitors to your town… Motor associations and travel agents say that road trips will remain the top vacation choice for Americans this summer. Some day, I’d like to do a survey of how many reviews people write per each vacation they take. I know I’ve always personally enjoyed reliving my trips after returning home and taking a few minutes to leave reviews for local businesses that helped me out. But until I can poll the public on that, what I can tell you is that TripAdvisor found that travelers are 77% more likely to book a space in your RV park or a cabin at your lodge if you respond to the reviews you’ve already received. 77%! I can also tell you that 96% of the summer visitors to your town will be reading local business reviews because that’s the percentage of the public that reads reviews in general. And they won’t just be looking at what wanderers like me say about your business. More than 90% will be moderately or extremely influenced by how your business is responding to reviews. If you know you’ve got a backlog of neglected reviews gathering dust in your most visible local business listings, pretend you’re in summer school (sorry, not fun!) and have the homework of writing a response to every review you’ve received in the past year. Tackle a batch every week until you’re caught up. Owner responses publish almost instantly, so you could immediately start benefiting from seasonal visitors seeing you responding to complaints and being there to solve problems. And if you keep up the good work as the year progresses, you’ll have the added benefit of being 100% responsive before the busy holiday season at year’s end. 6. Communication is everything…and texting is easy! If you’re on the fence about whether this is the year your local business should invest in texting with customers, consider these stats compiled by my friend Aaron Weiche of LeadFerno: 78% of customers want to text with your businessTexting is super fast - 90% of people open texts within three minutes of receiving them65% of your potential customers will have more positive feelings about your business if you offer text messaging as a mode of communications There is so much information you could be communicating to customers this summer about your product availability, seasonal amenities, safety protocols, and satisfaction guarantees. You’ll find thousands of articles on the web about relationship-building being the core of good marketing, and the mass adoption of cell phones puts the easiest possible mode of communication right in all of our pockets or hands. In fact, 88% of survey respondents say texting is the main reason they use cell phones, and multiple surveys indicate that it’s become customers’ preferred means of conversing with businesses. This summer would be a great time to make life easier for your customers and your business by opening your text lines for fast and effective communication. Making local business sun tea Most of the tasks we’ve focused on in today’s column can be implemented relatively speedily for near-immediate benefits to your business. But nearly all of them have an added bonus: local business improvements can also brew slowly, like sun tea. You pop some tea bags and water in a jar and leave them to steep on the patio, and the longer they develop, the richer the taste of the brew. It adds up over time if you’re regularly refining your inventory for changed demand and using features like Google updates to offer specials on your deals. It amounts to something if you’re regularly responding to reviews, building a video library, and being responsive to customers via convenient texting. These efforts don’t vanish like summer lightning. They gently build habits, content, and connections that should stand your local business in good stead in all seasons. Little efforts add up and even small improvements in your business operations can mean a lot to your customers. Cheers to your business and community this summer. Hope it’s a good one! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "6 Local SEO Tasks for Summer Success"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "6 Local SEO Tasks for Summer Success"
    },
    {
      "level": "H1",
      "text": "1. Get on the Search Labs waiting list"
    },
    {
      "level": "H1",
      "text": "2. Study the weather and serve the people"
    },
    {
      "level": "H1",
      "text": "3. Put on your pro-active shorts"
    },
    {
      "level": "H1",
      "text": "4. Speaking of Google Business Profiles…"
    },
    {
      "level": "H1",
      "text": "5. Speaking of visitors to your town…"
    },
    {
      "level": "H1",
      "text": "6. Communication is everything…and texting is easy!"
    },
    {
      "level": "H1",
      "text": "Making local business sun tea"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}