{
  "url": "https://moz.com/blog/local-seo-crafting-industry",
  "slug": "local-seo-crafting-industry",
  "title": "6 Local Search Marketing DIY Tips for the Crafting Industry - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The $44 billion crafting industry is ready for a marketing revamp. If you market a local business within this niche, Miriam Ellis has 6 pro tips for you to prepare for an even more fruitful 2020.",
  "content": "6 Local Search Marketing DIY Tips for the Crafting Industry Local SEO By: Miriam Ellis December 16, 2019 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis December 16, 2019 6 Local Search Marketing DIY Tips for the Crafting Industry Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Think crafting is kids’ stuff? Think again. The owners of quilting, yarn, bead, fabric, woodworking, art supply, stationers, edible arts, and related shops know that: The crafting industry generated $44 billion in 2016 in the US alone.63% of American households engage in at least one crafting project annually, while more than one in four participate in 5+ per year.The top three craft store chains in the country (Michaels, JOANN, Hobby Lobby) operate nearly 3,000 locations, just among themselves.There are an estimated 3,200 US storefronts devoted to quilting alone. Thousands more vend everything from the stuff of ancient arts (knitting, with a 1,000-year history) to the trendy and new (unicorn slime, which, yes, is really a thing). Our local search marketing industry has devoted abundant time to advising major local business categories over the past couple of decades, but crafting is one substantial retail niche we may have overlooked. I’d like to rectify this today. I feel personally inspired by craft store owners. Over the years, I’ve learned to sew, quilt, embroider, crochet, knit, and bead, and before I became a local search marketer, I was a working fine artist. I even drafted a sewing pattern once that was featured in a crafting magazine. Through my own exploration of arts and crafts, I’ve come to know so many independent business owners in this industry, and have marketed several of them. These are gutsy people who take risks, work extremely hard for their living, and often zestfully embrace any education they can access about marketing. Today, I’m offering my six best marketing tips for craft retailers for a more successful and profitable 2020. First, a quick definition of local search marketing Your store is your location. Your market is made up of all of your customers’ locations. Anything you do to promote your location to the market you serve is considered local search marketing. Your market could be your neighborhood, your city, or a larger local region. Local search marketing can include both offline efforts, like hanging eye-catching signage or getting mentioned in local print news, and online efforts, like having a website, building listings on local business listing platforms, and managing customer reviews. Whatever you do to increase local awareness about your location, interact online with customers, bring them through your front door, serve them in-store, and follow up with them afterwards in an ongoing relationship counts. You’re already doing some of this, and in the words of Martha Stewart, “It’s a good thing.” But with a little more attention and intention, these six tips can craft even greater success for your business: 1. Take a page from my Google scrapbook To engage in local search marketing is to engage with Google. Since they first started mapping out communities and businesses in 2004, the search engine giant has come to dominate the online local scene. There are other important online platforms, but to be in front of the maximum number of potential customers and to compete for rankings in Google’s local search results, your crafting business needs to: Read the Guidelines for representing your business on Google and follow them to the letter. This set of rules tells you what you can and can’t do in the Google My Business product. Listing your business incorrectly or violating the guidelines in any way can result in listing suspension and other negative outcomes.Create your free Google My Business listing once you’ve read the guidelines. Here’s Moz’s cheat sheet to all of the different fields and features you can fill out in your listing. Fill out as many fields as you possibly can and then Google will take you through the steps of verifying your listing.Reckon with Google’s power. As our scrapbook says, Google owns your Google My Business listing, but you can take a lot of control over some of its contents. Even once you’ve verified your listing, it’s still open to suggested edits from the public, questions, reviews, user-uploaded photos and other activities. Main takeaway: your GMB listing is not a one-and-done project. It’s an interactive platform that you will be monitoring and managing from here on out. 2. Weave a strong web presence Your Google My Business listing will likely be the biggest driver of traffic to your craft store, but you’ll want to cast your online net beyond this. Once you feel confident about the completeness and ongoing management of your GMB listing, there are 4 other strands of Internet activity for you to take firm hold of: Your website At bare minimum, your website should feature: Your complete and accurate name, address, phone number, email, and fax numberClear written driving directions to your place of business from all points of entryA good text description of everything you sell and offerAn up-to-date list of all upcoming classes and eventsSome high-quality photos of your storefront and merchandise A more sophisticated website can also feature: Articles and blog postsFull inventory, including e-commerce shoppingCustomer reviews and testimonialsOnline classes, webinars and video tutorialsCustomer-generated content, including photos, forums, etc. The investment you make in your website should be based on how much you need to do to create a web presence that surpasses your local competitors. Depending on where your store is located, you may need only a modest site, or may need to go further to rank highly in Google’s search engine results and win the maximum number of customers. Your other local listings Beyond Google, your business listings on other online platforms like Yelp, Facebook, Bing, Apple Maps, Factual, Foursquare, and Infogroup can ensure that customers are encountering your business across a wide variety of sites and apps. Listings in these local business information indexes are sometimes referred to as “structured citations” and you have two main choices for building and maintaining them: You can manually build a listing on each important platform and check back on it regularly to manage your reviews and other content on it, as well as to ensure that the basic contact info hasn’t been changed by the platform or the public in any way.You can invest in local listings management software like Moz Local, which automates creation of these listings and gives you a simple dashboard that helps you respond to reviews, post new content, and be alerted to any emerging inaccuracies across key listing platforms, all in one place. This option can be a major time saver and deliver welcome peace of mind. Structured citation management is critical to any local business for two key reasons. Firstly, it can be a source of valuable consumer discovery and new customers for your shop. Secondly, it ensures you aren’t losing customers to frustrating misinformation. One recent survey found that 22% of customers ended up at the wrong location of a business because online information about it was incorrect, and that 80% of them lost trust in the company when encountering such misinformation. Brick-and-mortar stores can’t afford to inconvenience or lose a single customer, and that’s why managing all your listings for accuracy is worth the investment of time/money. Your unstructured citations As we’ve just covered, a formal listing on a local business platform is called a “structured citation.” Unstructured citations, by contrast, are mentions of your business on any type of website: local online news, industry publications, a crafter’s blog, and lists of local attractions all count. Anywhere your business can get mentioned on a relevant online publication can help customers discover you. And if trusted, authoritative websites link to yours when they mention your business, those links can directly improve your search engine rankings. If you’re serving a market with little local competition, you may not need to invest a ton of time in seeking out unstructured citation opportunities. But if a nearby competitor is outranking you and you need to get ahead, earning high-quality mentions and links can be the best recipe for surpassing them. All of the following can be excellent sources of unstructured citations: Sponsoring or participating in local events, organizations, teams, and causesHosting newsworthy happenings that get written up by local journalistsHolding contests and challenges that earn public mentionJoining local business organizationsCross promoting with related local businessesGetting featured/interviewed by online crafting magazines, fora, blogs, and videos Read The Guide to Building Linked Unstructured Citations for Local SEO for more information. Your social media presence YouTube, Instagram, Pinterest, Facebook, Twitter, crafting forums...choices abound! How much time and where you invest in social media should be determined by two things: What your local competition is doingWhere your potential customers spend social time If your shop is literally the only game in town, you may not need to win at social to win business, but if you have multiple competitors, strategic social media investments can set you apart as the most helpful, most popular local option. In your social efforts, emphasize sharing, showing and telling — not just selling. If you keep this basic principle in mind, the DIY revolution is at your fingertips, waiting to be engaged. One thing I’ve learned about crafters is that they will travel. Quilting retreats, knitting tours, and major craft expos prove this. If you or a staff member happen to create one of the most-viewed videos on YouTube for the three-needle bind off or crafting felt succulents, it could inspire travelers to put your shop on their bucket list. One of my favorite knitters in the world films the English/Swedish language Kammebornia podcast which is so idyllic, it would certainly inspire me to visit the island of Gotland if I were ever anywhere nearby. Think what you can do via social media to make your shop an aspirational destination for even non-local customers. 3. Abandon fear of ripping out mistakes (and negative reviews) As the old adage goes, “Good knitters are good rippers.” When you drop a stitch in an important project, you have to know how to see it, patiently rip out stitches back to it, and correct the mistake as skillfully as you can. This exact same technique applies to managing the reviews customers leave you online. When your business “drops the ball” for a customer and disappoints them, you can often go back and correct the error. Reviews = your business’ reputation. It’s as simple (and maybe scary) as that. Consider these statistics about the power of local business reviews: 87% of consumers read local business reviews (BrightLocal)27% of people who look for local information are actually seeking reviews about a particular store. (Streetfight Mag) 30% of consumers say seeing business owners’ responses to reviews are key to them judging the company. (BrightLocal)73.8 percent of customers are either likely or extremely likely to continue doing business with a brand that resolves their complaints. (GatherUp) To be competitive, your craft store must earn reviews. Many business owners feel apprehensive about negative reviews, but the good news is: You can “rip out” some negative reviews simply by responding well to them. The owner response function actually makes reviews conversational, and a customer you’ve made things right with can edit their initial review to a more positive one. Most consumers expect a business to receive some negative reviews. Multiple surveys find that a perfect 5 star rating can look suspicious to shoppers.If you continuously monitor reviews, either manually or via convenient software like Moz Local that alerts you to incoming reviews, there is little to fear, because customers are more forgiving than you might have thought. For a complete tutorial, read How to Get a Customer to Edit Their Negative Review. And be sure you are always doing what’s necessary to earn positive reviews by delivering excellent customer service, keeping your online listings accurate, and proactively asking customers to review you on Google and other eligible platforms. 4. Craft what online can’t — 5 senses engagement Consider these three telling statistics: Over half of consumers prefer to shop in-store to interact with products. (Local Search Association)80% of U.S. disposable income is spent within 20 miles of home (Access Development)By 2021, mobile devices alone will influence $1.4 trillion in local sales. (Forrester) There may be no retailer left in America who hasn’t felt the Amazon effect, but as a craft shop owner, you have an amazing advantage so many other industries lack. Crafters want to touch textiles and fibers before buying, to hold fabrics up to their faces, to see true colors, and handle highly tactile merchandise like beads and wood. When it comes to fulfilling the five senses, online shopping is miles behind what you can provide face-to-face. And it’s not just customers’ desire to interact with products that sets you apart — it’s their desire to interact with experts. As pattern designer Amy Barickman of Indygo Junction perfectly sums it up: “To survive and thrive, brick-and-mortar stores must now provide experiences that cannot be replicated online.” The expertise of your staff, the classes you hold, and tie-in services you offer, the sensory appeal of your storefront, the time you take to build relationships with customers all contribute to creating valued interactions which the Internet just can’t replace. This advantage ties in deeply with the quality of your staff hiring and training practices. One respected survey found that 57% of customer complaints stem from employee behavior and poor service. Specifically in the crafting industry, staff who are expert with the materials being sold are worth their weight in gold. Be prepared to assist both seasoned crafters and the new generations of customers who are just now embracing the creative industries. Play to your strengths. In every way that you market your business, emphasize hands-on experiences to draw people off their computers and into your store. In every ad you run, blog post you write, phone call you answer, listing you build, invite people to come in to engage all five senses at your place of business. Soft lighting and music, a tea kiosk, fragrant fresh flowers, some comfy chairs, and plenty of tactile merchandise are all within your reach, making shopping a pleasure which customers will want to enjoy again and again. 5. Learn to read your competitors’ patterns Need to know: there are no #1 rankings on Google. Google customizes the search engine results they show to each person, based on where that person is physically located at the time they look something up on their phone or computer. You can walk or drive around your city, performing the identical search, and watch the rankings change in the: Local Packs Maps Organic results If you’re doing business in an area with few competitors, you may only need to be aware of one or two other companies. But when competition is more dense and diverse, or you operate multiple locations, the need for competitive analysis can grow exponentially. And for each potential customer, the set of businesses you’re competing with changes, based on that customer’s location. How can you visualize and strategize for this? You have two options: If competition is quite low, you can manually find your true local competitors with this tutorial. It includes a free spreadsheet for helping you figure out which businesses are ranking for your most desired searches for the customers nearest you. This is a basic, doable approach for very small businesses.If your environment is competitive or you are marketing a large, enterprise craft store brand, you can automate analysis with software. Local Market Analytics from Moz, for example, is designed to do all the work of finding true competitors for you. This groundbreaking product multi-samples searchers’ locations and helps you analyze your strongest and weakest markets. Currently, Local Market Analytics focuses on organic results, and it will soon include data on local pack results, too. Once you’ve completed this first task, you have one more step ahead if you find that some of your competitors are outranking you. You’ll want to stack up your metrics against theirs to analyze why they are surpassing you. Good news: we’ve got another tutorial and free spreadsheet for this project! What emerges from the work is a pattern of strengths and weaknesses that signal why Google is ranking some businesses ahead of others. Knowing who your competitors are and gathering metrics about why they may be outranking you is what empowers you to create a winning local search marketing strategy. Whether you find you need more reviews, a stronger website, or some other improvement, you’ll be working from data instead of making random guesses about how to grow your business. 6. Open your grab bag Every craft store and craft fair has its grab bags, and who can resist them? I’d like to close out this article by spilling a trove of marketing goodies into your hands. Sort through them and see if there’s a fresh idea in here that could really work for your business to take it to the next level. Be more! This year, Michaels has partnered with UPS at 1,100 locations in a convenience experiment. You run a craft store, but could it be more? Is there something lacking in your local market that your shop could double as? A meeting house, a lending library, an adult classroom, a tea shop, a Wi-Fi spot, a holiday boutique, a place for live music?Tie in! Your quilt shop can support apparel sewers with a few extra solids, textiles, and some fun patterns. Your yarn shop can find a nook for needle arts. Your woodshop could offer wooden needles for knitting and crochet, wooden hoops for embroidery, wood buttons, stamps, and a variety of wood boxes for crafters. You may sell everything needed for beading jewelry, but do you have the necessary supplies to bead clothing? Crafters are hungry for local resources for every kind of project, especially in rural areas, suburbs, and other communities where there are few businesses.Teach! There are so many arts and crafts that are incredibly challenging to learn without being shown, face-to-face. Not everyone is lucky enough to have a grandparent or parent to demo exactly how you do a long tail cast on or master the dovetail joint. If you want to sell merchandise, show how to use it. Look at JOANN, which just unveiled its new concept store in Columbus, Ohio, centered on a “Creators Studio”. One independent fabric shop near me devotes half its floorspace to classes for children — the next generation of customers!Email! Don’t make the mistake of thinking email is old school. Statistics say that 47% of marketers point to email marketing as delivering the highest ROI and 69% of consumers prefer to receive local business communications via email. If you’re one of the 50% of small business owners who hasn’t yet taken the leap of creating an email newsletter, do it!Survey! Don’t guess what to stock or how to do business. Directly ask your customers via email, social media, and in-store surveys what they really want. I’ve seen businesses abandon scented products because they found they were deterring migraine-prone shoppers. I’ve seen others implement special ordering services to source hard-to-access items in-store instead of letting consumer drift away to the online world. Giving the customer what they want is the absolute key to your store’s success.Go green! Whether it’s powering your shop with solar, supporting upcycling crafts, or stocking organic and sustainable inventory, embrace and promote every green practice you can engage in. Numerous studies cite the younger generations as being particularly defined by responsible consumption. Demonstrate solidarity with their aspirations in the way you operate and market. Doers, makers, creators, crafters, artisans, artists… your business exists to support their drive to embellish personal and public life. When you need to grow your business, you’ll be drawing from the same source of inspiration that all creative people do: the ability to imagine, to envision a plan, to color outside the lines, to gather the materials you need to make something great. Local search marketing is a template for ensuring that your business is ready to serve every crafter at every stage of their journey, from the first spark of an idea, to discovery of local resources, to transaction, and beyond. I hope you’ll take the template I’ve sketched out for you today and make it your own for a truly rewarding 2020. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "6 Local Search Marketing DIY Tips for the Crafting Industry"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "6 Local Search Marketing DIY Tips for the Crafting Industry"
    },
    {
      "level": "H2",
      "text": "First, a quick definition of local search marketing"
    },
    {
      "level": "H2",
      "text": "1. Take a page from my Google scrapbook"
    },
    {
      "level": "H2",
      "text": "2. Weave a strong web presence"
    },
    {
      "level": "H3",
      "text": "Your website"
    },
    {
      "level": "H3",
      "text": "Your other local listings"
    },
    {
      "level": "H3",
      "text": "Your unstructured citations"
    },
    {
      "level": "H3",
      "text": "Your social media presence"
    },
    {
      "level": "H2",
      "text": "3. Abandon fear of ripping out mistakes (and negative reviews)"
    },
    {
      "level": "H2",
      "text": "4. Craft what online can’t — 5 senses engagement"
    },
    {
      "level": "H2",
      "text": "5. Learn to read your competitors’ patterns"
    },
    {
      "level": "H3",
      "text": "Local Packs"
    },
    {
      "level": "H3",
      "text": "Maps"
    },
    {
      "level": "H3",
      "text": "Organic results"
    },
    {
      "level": "H2",
      "text": "6. Open your grab bag"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}