{
  "url": "https://moz.com/blog/local-business-shelfies",
  "slug": "local-business-shelfies",
  "title": "Shelfies: Why and Where Local Businesses Should Publish Them - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If you own or market a local brand, your camera has never been a greater business asset. Early smartphones may have inspired the selfie, but in a commercial context, it’s the “shelfie” that’s coming to the fore as a signal to both customers and search engines of what to expect on your premises.",
  "content": "Shelfies: Why and Where Local Businesses Should Publish Them Local SEO By: Miriam Ellis March 1, 2023 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis March 1, 2023 Shelfies: Why and Where Local Businesses Should Publish Them Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. If you own or market a local brand, your camera has never been a greater business asset. Early smartphones may have inspired the selfie, and it’s a fantastic idea to photograph the owner and staff of a local business to prove both its authenticity and approachability, but in a commercial context, it’s the “shelfie” that’s I see coming to the fore as a signal to both customers and search engines of what to expect on your premises. For the past few years, I’ve strongly encouraged local businesses to photograph their most popular goods and services and add these pictures to their Google Business Profiles, but shelfies are different – instead of snapping a single product, take photos of your shelves and displays to give a sense of the abundance and character of what you vend. One look at this on a local business listing, and any customer would immediately know that this is a great nearby place to head for socks: Or that this independent grocery store has a deli counter with prepared salads: Or that this may be a hardware store, but it looks like it has a great selection of kitchen wares: Why publish local business shelfies? Potential customers may not bother to read all your local business listing categories, your business descriptions, your posts, but if they see a great image of what they’re looking for, the connection is instantaneous (in fact, 400% faster than textual learning). And it’s not just people who are learning from your shelfies…it’s Google, too! Local SEO, Mike Blumenthal mentioned this in a Duct Tape Marketing interview: “I was listening to a Google webinar for Product Experts… and they really liked what they called shelfies: pictures of the products in your business, on the shelf where Google and the consumer could get a really solid idea of what the place looked like and the range of products you were offering… They’ve created a term for it and they're clearly focused on it. And I think it's the kind of photograph you want.” Google has gotten so good at parsing images that they are now able to match them to perceived query intent. We already know that Google differentiates between images of single products. For example, here’s a search for “engagement rings san francisco”, and do note the images in the local pack: But when I change my query to “diamond necklaces san francisco”, look at how the photo for the business in the top spot changes. It’s the same company, but a totally different image chosen to match my query: I have yet to find a live example of Google behaving this way inside the 3-pack for shelfie-type queries, but what we do know from Google’ Cloud Vision API is that they are quite capable of distinguishing between multiple objects in a single image: Given Mike Blumenthal’s report from the Product Experts webinar and Google’s ever-increasing ability to parse images, I would highly recommend that you do a photo shoot this spring of your most popular shelves of inventory, because I predict that Google will presently treat shelfies the same way that they are already handling single-object images. Additionally, proofs that your premises are well-stocked make simple good sense in 2023, as supply chain shortages continue. Where to publish your local business shelfies Here are five places to promote your high-quality shelf pics: Google Business Profile: Two to three times per month, upload a new shelfie to your main photos set on your listings, as it’s felt a steady drip is more impactful than a flood. You can also upload shelfies to the Products section of your listing via the New Merchant Experience, representing product lines rather than single products with these photos. Finally, use shelfies in your Google Updates (formerly Google Posts) to advertise the breadth, depth, and availability of desirable inventory. Apple Maps: Moz Local customers should know that you can add up to 100 photos to your dashboard and we’ll distribute your images to Apple Maps. The company’s launch of Apple Business Connect shows that they are getting serious about local, and so should you. ABC also has a new feature called Showcases, which is like Google Updates, and which would also be a good place to microblog about your shelfies. Again, a slow drip is likely the best approach to gradually proving the active status of your listings.Your other structured citations: Shelfies belong on any local business listings that supports photos. Add them manually, or let Moz Local do the distribution for you.Your website: Be sure your location landing pages incorporate some shelfies to give potential customers an instant idea of what they’ll find at your different premises.Your social media profiles: These would be the best places to post up-to-the minute shelfies of hard-to-find items in short supply, holiday-related offers, and new product lines you’re introducing to the community. Image credit: VGM8383 When I was young, I remember responding with excitement to the nicely-designed holiday displays at different stores. It was a small thrill to see the valentines in the window of the local stationers, the witch’s kettle of candy corn at the grocer’s in fall, or shiny paper crackers imported all the way from the UK for Christmas. Shelves taught me things about my neighbors — the special Manischewitz matzos and Kedem grape juice at Passover and the red envelopes and paper lanterns at Lunar New Year helped me appreciate the diversity and celebratory nature of my community. In Spain, the beautiful arrangement of products has become such an artform that people regularly photograph and even paint the marketplaces there. So there’s a small goal you can certainly meet in the months ahead: creating displays that you’re proud to photograph and publicize, and maybe if they’re inspiring enough, customers will opt in, too, and add their own shelfies to your local business listings, and their reviews and social posts about your business. Some things in local search marketing are fun, and it’s nice when they’re no big hassle to do well! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Shelfies: Why and Where Local Businesses Should Publish Them"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Shelfies: Why and Where Local Businesses Should Publish Them"
    },
    {
      "level": "H2",
      "text": "Why publish local business shelfies?"
    },
    {
      "level": "H2",
      "text": "Where to publish your local business shelfies"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}