{
  "url": "https://moz.com/blog/local-seo-1-2-punch",
  "slug": "local-seo-1-2-punch",
  "title": "Location Data + Reviews: The 1–2 Punch of Local SEO (Updated for 2020) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Consistent NAPs get your business found — positive reviews get it chosen. Communicate this to your local SEO clients using owner responses, authenticity and honesty, rapid responses at a good pace, and more.",
  "content": "Location Data + Reviews: The 1–2 Punch of Local SEO (Updated for 2020) Local SEO | Reputation Management By: Miriam Ellis November 11, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis November 11, 2020 Location Data + Reviews: The 1–2 Punch of Local SEO (Updated for 2020) Local SEO | Reputation Management The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Get found. Get chosen. It’s the local SEO two-step at the heart of every campaign. It’s the 1-2 punch combo that hinges on a balance of visible, accurate contact data, and a volunteer salesforce of consumer reviewers who are supporting your rise to local prominence. But here’s the thing: while managed location data and reviews may be of equal and complementary power, they shouldn’t require an equal share of your time. Automation of basic business data distribution is the key to freeing you up to focus on the elements of listings that require human ingenuity — namely, reviews and other listings-based content like posts and Q&A. It’s my hope that sharing this article with your team or your boss will help you get the financial allocations you need for automated listings management, plus generous resources for creative reputation management. Location data + reviews = the big picture When Google lists a business, it gives good space to the business name, and a varying degree of space to the address and phone number. But look at the real estate occupied by the various aspects associated with reputation: If Google cares this much about ratings, review text, responses, and emerging elements like place topics and attributes, any local brand you’re marketing should see these factors as a priority. In this article, I’ll strive to codify your actionable perspective on managing both location data and the many aspects of reviews. Ratings: The most powerful local filter of them all In the local SEO industry, we talk a lot about Google’s filters, like the Possum filter that’s supposed to strain local businesses through a sort of sieve so that a greater diversity of mapped results is shown to the searcher. But searchers have an even more powerful filter than this — the human-driven filter of ratings that helps people intuitively sort local brands by perceived quality. Whether they’re stars or circles, the majority of rating icons send a 1–5 point signal to consumers that can be instantly understood. This symbol system has been around since at least the 1820s; it’s deeply ingrained in all our brains as a judgement of value. This useful, rapid form of shorthand lets a searcher needing to do something like grab a quick taco see that the food truck with five Yelp stars is likely a better bet than the one with only two. Meanwhile, searchers with more complex needs can comb through the ratings of many listings at leisure, carefully weighing one option against another for major purchases. In Google’s local results, ratings are the most powerful human-created filter that influences the major goal of being chosen. But before a local brand can be chosen on the basis of its high ratings, it has to rank well enough to be found. The good news is that, over the past three years, expert local SEOs have become increasingly convinced of the impact of Google ratings on Google local pack rankings. In 2017, when I wrote the original version of this post, contributors to the Local Search Ranking Factors survey placed Google star ratings down at #24 in terms of local rankings influence. In 2020, this metric has jumped up to spot #8 — a leap of 16 spots in just three years. In the interim, Google has been experimenting with different ratings-related displays. In 2017, they were testing the application of a “highly rated” snippet on hotel rankings in the local packs. Today, their complex hotel results let the user opt to see only 4+ star results. Meanwhile, local SEOs have noticed patterns over the years like searches with the format of “best X in city” (e.g. best burrito in Dallas) appearing to default to local results made up of businesses that have earned a minimum average of four stars. Doubtless, observations like these have strengthened experts’ convictions that Google cares a lot about ratings and allows them to influence rank. Heading into 2021, any local brand with goals of being found and chosen must view low ratings as an impediment to reaching full growth potential. Consumer sentiment: The local business story your customers are writing for you Here’s a randomly chosen Google 3-pack result when searching just for “tacos” in a small city in the San Francisco Bay Area: We’ve just covered the topic of ratings, and you can look at a result like this to get that instant gut feeling about the 4-star-rated eateries vs. the 2-star place. Now, let’s open the book on business #3 and see precisely what kind of brand story its consumers are writing, as you would in conducting a professional review audit for a local business, excerpting dominant sentiment: It’s easy to ding fast food chains. Their business model isn’t commonly associated with fine dining or the kind of high wages that tend to promote employee excellence. In some ways, I think of them as extreme examples. Yet, they serve as good teaching models for how even the most modest-quality offerings create certain expectations in the minds of consumers, and when those basic expectations aren’t met, it’s enough of a story for consumers to share in the form of reviews. This particular restaurant location has an obvious problem with slow service, orders being filled incorrectly, and employees who have been denied the training they need to represent the brand in a knowledgeable, friendly, or accessible manner. If you audited a different business, its pain points might surround outdated fixtures or low standards of cleanliness. Whatever the case, when the incoming consumer turns to the review world, their eyes scan the story as it scrolls down their screen. Repeat mentions of a particular negative issue can create enough of a theme to turn the potential customer away. One survey says only up to 11% of consumers will do business with a brand that’s wound up with a 2-star rating based on poor reviews. Who can afford to let the other 91% of consumers go elsewhere? The central goal of being chosen hinges on recognizing that your reviewer base is a massive, unpaid salesforce that tells your brand story. Survey after survey consistently finds that people trust reviews — in fact, they may trust them more than any claim your brand can make about itself. Going into 2021, the writing is on the wall that Google cares a great deal about themes surfacing in your reviews. The ongoing development and display of place topics and attributes signifies Google’s increasing interest in parsing sentiment, and doubtless, using such data to determine relevance. Fully embracing review management and the total local customer service ecosystem is key to giving customers a positive tale to tell, enabling the business you’re marketing to be trusted and chosen for the maximum number of transactions. Velocity/recency/count: Just enough of a timely good thing to be competitive This is one of the easiest aspects of review management to convey. You can sum it up in one sentence: don’t get too many reviews at once on any given platform but do get enough reviews on an ongoing basis to avoid looking like you’ve gone out of business. For a little more background on the first part of that statement, watch Mary Bowling describing in this LocalU video how she audited a law firm that went from zero to thirty 5-star reviews within a single month. Sudden gluts of reviews like this not only look odd to alert customers, but they can trip review platform filters, resulting in removal. Remember, reviews are a business lifetime effort, not a race. Get a few this month, a few next month, and a few the month after that. Keep going. The second half of the review timing paradigm relates to not running out of steam in your acquisition campaigns. Multiple surveys indicate that the largest percentage of review readers consider content from the past month to be most relevant. Despite this, Google’s index is filled with local brands that haven’t been reviewed in over a year, leaving searchers to wonder if a place is still in business, or if it’s so unimpressive that no one is bothering to review it. While I’d argue that review recency may be more important in review-oriented industries (like restaurants) vs. those that aren’t quite as actively reviewed (like septic system servicing), the idea here is similar to that of velocity, in that you want to keep things going. Don’t run a big review acquisition campaign in January and then forget about outreach for the rest of the year. A moderate, steady pace of acquisition is ideal. And finally, a local SEO FAQ comes from business owners who want to know how many reviews they need to earn. There’s no magic number, but the rule of thumb is that you need to earn more reviews than the top competitor you are trying to outrank for each of your search terms. This varies from keyword phrase, to keyword phrase, from city to city, from vertical to vertical. The best approach is steady growth of reviews to surpass whatever number the top competitor has earned. Authenticity: Honesty is the only honest policy For me, this is one of the most prickly and interesting aspects of the review world. Three opposing forces meet on this playing field: business ethics, business education, and the temptations engendered by the obvious limitations of review platforms to police themselves. I often recall a basic review audit I did for a family-owned restaurant belonging to a friend of a friend. Within minutes, I realized that the family had been reviewing their own restaurant on Yelp (a glaring violation of Yelp’s policy). I felt sorry to see this, but being acquainted with the people involved (and knowing them to be quite nice!), I highly doubted they had done this out of some dark impulse to deceive the public. Rather, my guess was that they may have thought they were “getting the ball rolling” for their new business, hoping to inspire real reviews. My gut feeling was that they simply lacked the necessary education to understand that they were being dishonest with their community and how this could lead to them being publicly shamed by Yelp, or even subjected to a lawsuit, if caught. In such a scenario, there’s definitely an opportunity for the marketer to offer the necessary education to describe the risks involved in tying a brand to misleading practices, highlighting how vital it is to build trust within the local community. Fake positive reviews aren’t building anything real on which a company can stake its future. Ethical business owners will catch on when you explain this in honest terms and can then begin marketing themselves in smarter ways. But then there's the other side. Mike Blumenthal’s reporting on this has set a high bar in the industry, with coverage of developments like the largest review spam network he’d ever encountered. There's simply no way to confuse organized, global review spam with a busy small business making a wrong, novice move. Real temptation resides in this scenario, because, as Blumenthal states: “Review spam at this scale, unencumbered by any Google enforcement, calls into question every review that Google has. Fake business listings are bad, but businesses with 20, or 50, or 150 fake reviews are worse. They deceive the searcher and the buying public and they stain every real review, every honest business, and Google.” When a platform like Google makes it easy to “get away with” deception, companies lacking ethics will take advantage of the opportunity. Beyond reporting review spam, one of the best things we can do as marketers is to offer ethical clients the education that helps them make honest choices. We can simply pose the question: Is it better to fake your business’ success or to actually achieve success? Local brands that choose to take the high road must avoid: Any form of review incentives or spamReview gating that filters consumers so that only happy ones leave reviews Violations of the review guidelines specific to each review platform Owner responses: creatively turning reviews into two-way conversations Over the years, I’ve devoted abundant space in my column here at Moz to the fascinating topic of owner responses. I’ve highlighted the five types of Google My Business reviews and how to respond to them, I’ve diagrammed a real-world example of how a terrible owner response can make a bad situation even worse, and I’ve studied basic reputation management for better customer service and how to get unhappy customers to edit their negative reviews. My key learnings from nearly two decades of examining reviews and responses are these: Review responses are a critical form of customer service that can’t be ignored any more than business staff should ignore in-person customers asking for face-to-face help. Many reviewers expect responses.The number of local business listings in every industry with zero owner responses on them is totally shocking.Negative reviews, when fairly given, are a priceless form of free quality control for the brand. Customers directly tell the brand which problems need to be fixed to make them happy.Many reviewers think of their reviews as living documents, and update them to reflect subsequent experiences.Many reviewers are more than happy to give brands a second chance when a problem is resolved.Positive reviews are conversations starters warmly inviting a response that further engages the customer and can convince them that the brand deserves repeat business. Local brands and agencies can use software to automate updating a phone number or hours of operation. Software like Moz Local can be of real help in alerting you to new, incoming reviews across multiple platforms, or surfacing the top sentiment themes within your review corpus. Tools free up resources to manage what can’t be automated: human creativity. It takes serious creative resources to spend time with review sentiment and respond to customers in a way that makes a brand stand out as responsive and worthy. It takes time to fully utilize the opportunities owner responses represent to impact goals all the way from the top to the bottom of the sales funnel. I’ve never forgotten a piece Florian Huebner wrote for StreetFight documenting the neglected reviews of a major fast food chain and its subsequent increase in location closures and decrease in profits. No one was taking the time to sit down with the reviews, listen, fix problems customers were citing, or offer proofs of caring resolution via owner responses. And all too often, when brands large and small do respond to reviews, they take a corporate-speak stance equivalent to “whistling past the graveyard” when addressing complaints. To keep the customer and to signal to the public that the brand deserves to be chosen, creative resources must be allocated to providing gutsy, honest owner responses. It’s easy to spot the difference: The response in yellow signals that the brand simply isn’t invested in customer retention. By contrast, the response in blue is a sample of what it takes to have a real conversation with a real person on the other side of the review text, in hopes of transforming one bad initial experience into a second chance, and hopefully, a lifetime of loyalty. NAP and reviews: The 1–2 punch combo every local business must practice Right now, there’s an employee at a local business or a staffer at an agency who is looking at the review corpus of a brand that’s struggling for rankings and profits. The set of reviews contains mixed sentiment, and no one is responding to either positive or negative customer experiences. Maybe this is an issue that’s been brought up from time to time in company meetings, but it’s never made it to priority status. Decision-makers have felt that time and budget are better spent elsewhere. Meanwhile, customers are quietly trickling away for lack of attention, leads are being missed, structural issues are being ignored… If the employee or staffer I’m describing is you, my best advice is to make 2021 the year you make your strongest case for automating listing distribution and management with software so that creative resources can be dedicated to full reputation management. Local SEO experts, your customers and clients, and Google, itself, are all indicating that location data + reviews are highly impactful and here to stay. In fact, history proves that this combination is deeply embedded in our entire approach to local commerce. When traveling salesman Duncan Hines first published his 1935 review guide Adventures in Good Eating, he was developing what we think of today as local SEO. Here is my color-coded version of his review of the business that would one day become KFC. It should look strangely familiar to anyone who has ever tackled local business listings management: No phone number on this “citation,” of course, but telephones were quite a luxury in 1935. Barring that element, this simple and historic review has the core earmarks of a modern local business listing. It has location data and review data; it’s the 1–2 punch combo every local business still needs to get right today. Without the NAP, the business can’t be found. Without the sentiment, the business gives little reason to be chosen. From Duncan Hines to the digital age, there may be nothing new under the sun in marketing, but striking the right pose between listings and reputation management may be new news to your CEO, your teammates, or clients. So go for it — communicate this stuff, and good luck at your next big meeting! Check out the new Moz Local plans that let you take care of location data distribution in seconds so that the balance of your focus can be on creatively caring for the customer. New Moz Local Plans Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Location Data + Reviews: The 1–2 Punch of Local SEO (Updated for 2020)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Location Data + Reviews: The 1–2 Punch of Local SEO (Updated for 2020)"
    },
    {
      "level": "H2",
      "text": "Location data + reviews = the big picture"
    },
    {
      "level": "H2",
      "text": "Ratings: The most powerful local filter of them all"
    },
    {
      "level": "H2",
      "text": "Consumer sentiment: The local business story your customers are writing for you"
    },
    {
      "level": "H2",
      "text": "Velocity/recency/count: Just enough of a timely good thing to be competitive"
    },
    {
      "level": "H2",
      "text": "Authenticity: Honesty is the only honest policy"
    },
    {
      "level": "H2",
      "text": "Owner responses: creatively turning reviews into two-way conversations"
    },
    {
      "level": "H2",
      "text": "NAP and reviews: The 1–2 punch combo every local business must practice"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}