{
  "url": "https://moz.com/blog/local-seo-career",
  "slug": "local-seo-career",
  "title": "Why I'd Recommend Local SEO as a Promising Career for Millennials - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There's an up-and-coming generation that embodies the perfect ideals for a career in local SEO. For all the young people wondering how to marry their passion for community with their life's work, Miriam Ellis explains why local search marketing may be the answer.",
  "content": "Why I'd Recommend Local SEO as a Promising Career for Millennials Local SEO | Marketing Industry | SEO Consulting By: Miriam Ellis July 13, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis July 13, 2016 Why I'd Recommend Local SEO as a Promising Career for Millennials Local SEO | Marketing Industry | SEO Consulting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The Palace of Fine Arts in San Francisco. Image courtesy of Mike Behnken on Flickr. The civics of local: Caring about your community From Golden Gate Park in San Francisco to Central Park in New York City, with all of the town greens, plazas, fountains, schools, and libraries in between, America’s lasting community resources stand as a testament to our civic-minded past. Town fathers, city boards, and citizens of former times dedicated themselves to enriching local life by creating public access to features that fostered identity, civic pride, and a higher standard of living. Modern cynics might look at today’s cityscapes and conclude that city planners have forgotten the need for accessible human resources. Sprawling housing developments without parks, whole districts without adequate shopping, good schools, libraries, or community centers would be evidence of this. And yet, 2016 points at a better future because, if nothing else, the ongoing election cycle has proven that the rising workforce — the millennial generation — cares tremendously about civics. In the phenomenal youth movement currently sweeping the nation, I see an inspiring, fresh commitment to improving life for all people and all communities. If you're one of those citizens rallying for a living wage, greater educational opportunities, and the revitalization of both inner city and rural life, then this article will explain why a career in local search marketing could spell out satisfying work that directly impacts life quality in communities across the country. In other words, your best ideals will go hand-in-hand with what you do for a living. Sound good? Let’s take a look! What is local search marketing, in a nutshell? Anything you do to promote the online visibility of local businesses, organizations, and resources = local search marketing. Local search engine optimization (SEO) basically seeks to create a mirror image of real-world communities on the web, making it easy for anyone to find the best available resources for everything nearest them. You can promote the visibility of local businesses, schools, parks, organizations, churches, or anything else that exists for the use of people in any given city or town. Local SEO seeks to reflect real-world communities. Image courtesy of DonaldMcTim on Flickr. The basic components of local Right now, the basic components of local search marketing include: Designing locally optimized websitesDeveloping locall -relevant text, image, and video contentBuilding local business listings on a variety of search engines and directoriesHelping clients earn and manage online reviewsHelping clients engage with their neighbors via social mediaEnsuring that all client holdings are mobile-friendlySeeking local publicity opportunities, whether via news, advertising, sponsorships, or other vehiclesDiscovering innovative methods of helping your clients stand out from the competition Here’s a broad overview of local SEO to jump-start your education. Ready for a deep dive? You can get a detailed picture of the major components of local search marketing from this Local SEO Checklist, and can take a gander at what industry experts cite as the most influential Local Search Ranking Factors you’ll be implementing for clients. Manual + automated solutions Local search marketing has been a viable career option for a little over a decade — ever since search engines like Google set out to replace the print Yellow Pages as the way people access local resources. In the early days, a majority of the work we did in local was manual — manual website development, manual local business listing creation, etc. Now, many tasks have been made easier via tools. Google: Making print phone books obsolete for over a decade. Image courtesy of Mike Goehler on Flickr. For example, you don’t have to build a website from scratch. You can learn to develop excellent Wordpress-based websites, choosing from mobile-friendly/responsive themes and using plugins that make it easy to incorporate basic local optimization components. You don’t have to build local business listings (a.k.a. \"citations\") one at a time anymore, either. You can use automated tools or sign up for manual submission services, freeing you up for more creative work. Intelligent tools now make it possible to analyze your social media opportunities and manage your review strategy. You’ll be entering the field at a time when tools have taken quite a bit of the grunt work out of this area of marketing, meaning your best asset may be your creativity, rather than your capacity to grind through things. Go solo or work for an agency Before you take a job or start serving clients, you’ll want to educate yourself as much as possible about this form of marketing. Your education will prevent you from going to work for an agency that doesn’t adhere to above-board practices, and it will also lessen your chances of making a costly mistake for your clients. Working from home can be quite cozy. Image courtesy of Tina Lawson on Flickr. You can set up your local SEO business in your living room, if need be, with nothing more than a laptop and a good Internet connection. Some people have no problem flying solo, beginning the work of making a name for themselves by their contributions to their own community and the local search marketing industry. The main benefit of this is autonomy; the main drawbacks are money worries until you get established. Others may prefer to seek employment at an agency with an existing local SEO department. Some companies will only hire you if you’ve got proven experience, but if an agency is open to interns, this can provide a great opportunity to learn on the job and understand what it means to be part of a team. The main benefits of this are experience and a regular paycheck; the main drawback is less direct control over the work you’d like to explore. Emotional requirements of the job Here’s a simple checklist that should help you determine whether you’ve got the right temperament for the job. You’ll need to: Be a self-disciplined worker (especially if you’re going solo) but also be open to the benefits of a more flexible schedule. Some of the best Internet marketing agencies aren’t rigid about 9–5 work days and allow for some work being done outside the office. Some modern businesses are experimenting with concepts like the 6-hour work day and other new ideas. On your own, you may find yourself working 5 hours a day — or 15! Flexibility is an asset in this field. Have good communication skills. You’ll be strategizing with team members and distilling complex topics down into easily understood terms for clients. You’ll be well-served by the ability to speak well and clearly with anyone you meet in a day’s work. Feel empathy. Local SEOs should be able to identify with their clients’ struggles, whether they are mom-and-pop shops in neglected communities or large brands floundering over their identity. You become a part of every business you serve and will have a share in both failures and triumphs. Practice awareness of your own experience with commerce. Approach every one of your own transactions from the viewpoint of both merchant and consumer and analyze faults and successes. No part of commerce is too small to be analyzed, and your findings will give you something to think about, write about, and put into practice for clients. Love a mystery. When a business is failing to rank, when an incoming client might be spamming search engines, when Google tweaks its algorithm, or outreach is falling on deaf ears, you will be the detective who gets to the root of the problems and defines the solutions. Like to travel + network. While it’s not necessary for local SEOs to serve clients in person, chances are good that you’ll want to travel to industry events, and hopefully one day contribute to them for the educational advancement and prestige of your business or agency. Word-of-mouth is regularly cited as one of the most effective vehicles for client acquisition, so the more people with whom you network in local, the better the health of your company. Be honest when it counts most. You can’t fear civil confrontation in this field. It's pretty much guaranteed that you're going to have to deliver bad news to confused clients and lay down the law to spammy ones. You’ll be required to be totally honest when what a client has been doing is harming their own business. That’s your job, and it’s only when you’ve called out and halted bad practices that you can begin to implement better ones. You’ll also need to honest with agency team members about your work, progress, and concerns. Commit to continuing education. There may be no other form of Internet marketing that has experienced more changes in the past decade than local. Guidelines and tactics change on a continual basis and, as a local SEO, it will be your job to keep up with all such developments. Your education must be viewed as ongoing as long as you’re in business. What does a job in local SEO pay? No promises on the emeralds and pearls! Image courtesy of Leigh49137 on Flickr. According to the 2015 BrightLocal industry survey, the average annual income for SEOs (pre-taxes) was $70,000 and the median income was between $50,000–$60,000. How these figures strike you will largely depend on the cost of living in your geography. These earnings may not be adequate if you live in San Francisco or NYC, but may be just fine if you make your home in Albuquerque or Atlanta. Note, too, that these are averages, and that there's room in this industry for innovators to work their way towards greater earnings. Remember, it was your generation that produced Mark Zuckerberg who founded Facebook when he was 20. In the local SEO industry, there have been success stories like David Mihm’s $3 million sale of his local business listing product, GetListed, which became the foundation of Moz Local. While not every worker in this discipline will \"make it big,\" no limit can be placed on your potential to succeed if you have the ability to discern opportunities that haven’t yet been explored to their limits. If you’ve been gifted with a great brain, it could be your company that invents the next app, software, or platform that lights up the local landscape. Recommended skill acquisitions Even as I’m writing this, local is out there changing and developing, so the best I can provide newcomers is a snapshot in time of the skills I’d recommend they acquire right now to be current + competitive: Master the guidelines for representing your business on Google As a local SEO, these are your rules for survival and contain the essential mindset you'll bring to almost every interaction you'll ever have with any client or team member. The guidelines are regularly revised, so check back periodically for edits that may totally change the game. Learn PPC Google, the biggest force in local, is steadily but surely moving towards more highly-monetized local search engine results. The local SEO of today and tomorrow will need to be able to advise clients about pay-per-click and other forms of advertising. Here’s a beginner’s guide to Google Adwords. We have a Pay-Per-Click category here on the Moz blog and you’ll enjoy this Phil Rozek article written about his 8 years of doing PPC for local businesses. Engineering/dev skills could set you apart You can stick to being a consultant if you prefer, but it can be a major asset if you know how to get in amongst the nuts and bolts of websites, applications, and widgets. In fact, your abilities as a developer could be a key to you moving from basic income to lucrative innovation. Learn offline local marketing Local SEO doesn’t exist in an online vacuum. It represent the real commercial and civic landscape we all inhabit. Understanding traditional forms of offline marketing (think print marketing, newspapers, billboards, radio, TV, etc.) will make you a much stronger force in the field. Most businesses will need to employ a combination of both on- and offline publicity, and you’ll need to be in-the-know about all of it. Learn a second language Having trouble breaking into the industry? Being bilingual could help. In the U.S., learning Spanish will help you serve the skyrocketing Hispanic business community. In Canada, learning French could be a real help to your agency. In Europe, pick the language of any neighboring country that has the infrastructure to benefit from local SEO and double your client base. In Australia, you might tackle Mandarin to serve business owners both at home and abroad. Despite working in something called \"local,\" ours is a global economy! Follow the leaders Finally, I’d recommend that you make a commitment to follow SEO leaders’ blogs and social profiles, as an essential part of your education and daily work. Local is an exceptionally generous area of marketing, with experts willingly sharing tons of useful information on a daily basis. We strive to offer some of the most comprehensive coverage and tutorials in the local SEO column here on the Moz Blog, and I would further recommend these high-quality resources: http://streetfightmag.com/http://blumenthals.com/blog/http://www.localvisibilitysystem.com/blog/http://www.localsearchforum.com/http://localu.org/blog/https://www.getfivestars.com/blog/http://screenwerk.com/http://www.thelsa.org/lsa/news-room.aspxhttp://imprezziomarketing.com/blog/https://whitespark.ca/blog/ That’s a short list, and you’ll likely find many more smart people to learn from and network with. The main thing is to set yourself a regular schedule of checking resources like these for the latest local developments. What a meaningful worklife feels like The average American works 1,700 hours a year. If you start working when you’re 16 and retire when you're 75, you’ll be spending over 100,000 hours of your life on the job. 100,000 hours. If you had a choice, chances are, you wouldn’t sign up to spend that much time doing anything that felt meaningless to you. If you had a choice, chances are you’d much rather get to put some of your personal hopes, ethics, and best self into those future hours ahead of you. In your spare time, you’ll be socializing with friends, maybe caring for a spouse and raising a family, maybe volunteering on the local school board, or in community projects, social, environmental, or political causes. What if time away from the things you love best could actually go towards improving the usefulness and accessibility of the cities you and others live in? Image courtesy of Tobias Berchtold on Flickr. And that’s why I’d recommend local SEO as a work option for young people. It truly can be meaningful when you help a senior center get found by your friend’s grandmother who never knew before that she could take a free class in sociology. Or when you help a family-owned restaurant make the front page of the local newspaper with their blue-ribbon organic tacos. Or when you help main street compete against the big-box stores, keeping your community unique. That’s what local search marketing can be, and it can make the difference between a job you couldn’t care less about, and one that is integrated with the interesting, meaningful life you want to build for yourself. When you're equipped with the skills to get businesses, organizations, and local stories heard, when you have the necessary education and have a say in picking the voices you want to amplify, you will never lack for opportunity to lend a powerful helping hand to the civic improvements you feel matter most. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why I'd Recommend Local SEO as a Promising Career for Millennials"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why I'd Recommend Local SEO as a Promising Career for Millennials"
    },
    {
      "level": "H2",
      "text": "The civics of local: Caring about your community"
    },
    {
      "level": "H2",
      "text": "What is local search marketing, in a nutshell?"
    },
    {
      "level": "H3",
      "text": "The basic components of local"
    },
    {
      "level": "H2",
      "text": "Manual + automated solutions"
    },
    {
      "level": "H2",
      "text": "Go solo or work for an agency"
    },
    {
      "level": "H2",
      "text": "Emotional requirements of the job"
    },
    {
      "level": "H2",
      "text": "What does a job in local SEO pay?"
    },
    {
      "level": "H2",
      "text": "Recommended skill acquisitions"
    },
    {
      "level": "H3",
      "text": "Master the guidelines for representing your business on Google"
    },
    {
      "level": "H3",
      "text": "Learn PPC"
    },
    {
      "level": "H3",
      "text": "Engineering/dev skills could set you apart"
    },
    {
      "level": "H3",
      "text": "Learn offline local marketing"
    },
    {
      "level": "H3",
      "text": "Learn a second language"
    },
    {
      "level": "H3",
      "text": "Follow the leaders"
    },
    {
      "level": "H2",
      "text": "What a meaningful worklife feels like"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}