{
  "url": "https://moz.com/blog/local-search-interview-13-questions-for-6-experts",
  "slug": "local-search-interview-13-questions-for-6-experts",
  "title": "Local Search Interview: 13 Questions For 6 Experts - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Local search has gotten extremely complex during the last couple of years. Too complex for an average small business to navigate and too fast paced and multifaceted for most Internet marketers. This is why I got the best and the brightest in local search to help us by answering these 13 questions.",
  "content": "Local Search Interview: 13 Questions For 6 Experts SEO Events By: Vedran Tomic December 20, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Vedran Tomic December 20, 2013 Local Search Interview: 13 Questions For 6 Experts SEO Events This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Local search has gotten extremely complex during the last couple of years. Too complex for an average small business to navigate and too fast paced and multifaceted for most Internet marketers. This is why I got the best and the brightest in local search to help us by answering these 13 questions. Introducing the Interviewees For a while now, I’ve wanted to do a big interview with the rock stars of the local search industry. It took a little longer than planned, but the result was well worth the wait: advice, tips and suggestions on how to survive the ever-increasing complexity of local search. Above all, I would like to thank them for answering these questions and for sharing their knowledge with us for years. Meet the local search rock stars (listed in alphabetical order by last name): Mike Blumenthal, the co-founder of Get5Stars and Blumenthals.com - @mblumenthal Mary Bowling, local search expert and LocalU faculty member- @MaryBowling Linda Buquet, the owner of Catalyst e-Marketing - @LindaBuquet Mike Ramsey, the President of Nifty Marketing - @MikeRamsey Andrew Shotland, proprietor of LocalSEOGuide.com - @localseoguide Nyagoslav Zhekov, the owner of NGSMarketing - @Nyagoslav 1. Measuring success in local search In SEO and Internet marketing, in general, there’s always a lot of talk about KPIs and rightfully so. Proximity of business to centroid of town/geo would be an important KPI (and a ranking factor). Are there any KPIs that are uniquely local that we could find useful? Andrew Shotland For me, the big KPIs in local are: Online Conversion (e.g. sale, phone call, driving directions request, email, registration, etc.) Offline Traffic/Conversion (e.g. how many customers did you send to the store?) Mike Blumenthal For me, KPIs in local are those things that lead most directly to a sale. In local search, I would tend to look at (in increasing importance): Web traffic and searches generated from local online sources and/or from within my local market. Goals specific to that traffic on my site, like how many requests for information or contact forms were filled in. The nature and frequency of incoming phone calls - how many were generated from which online and offline resource. Mary Bowling The main KPIs I'd use that are uniquely local are: the number of website visitors from in and around my location(s) and their behavior on the site; the numbers and sources of coupons and discount codes people call or show up with in a store; referral traffic from local directories, media, websites and blogs. Nyagoslav Zhekov I wouldn’t necessarily look at proximity to centroid as a KPI. It is more like a “fortunate coincidence”. However, Google significantly loosened their display radius, and now the proximity to centroid is not such a major ranking factor as it was before. Additionally, it is important to note that \"centroid\" doesn't necessarily mean \"geographical center of a city/town\", but rather the \"hot spot\" of where many businesses from a particular industry are found. Specifically regarding KPIs, above all are the number of conversions, and conversions could be phone calls, walk-ins, orders, etc., depending on the industry. For instance, for a restaurant, a major KPI would be how many people dined in (or took away) during any particular day/week/month. For for a plumber, the most important KPI would be how many people called for help. In this sense, KPIs in local search are not very different from those in general search (paid or organic). Linda Buquet KPI is tough to measure in local. Rank is easy to measure, but since the Google Local dashboard stats are not very helpful and often broken, it’s just tough to have measurable metrics for local. Mike Ramsey I think phone calls are fairly unique to local and are extremely hard to track due to NAP (name/address/phone) consistency requirements. Nobody has really solved this issue in a meaningful way for local organic traffic. We use Callrail.com which is a great call tracking solution, but I long for the day when we can track different directories with ease. Driving direction requests and check-ins would also make the list for me as uniquely local information. 2. Map rankings Let’s say you had a great listing and it suddenly doesn't rank in the “maps.” There are no pinned results and no obvious signs of foul play. What are the first few things you would check in situations like this? Andrew Shotland If it's a claimed G+ Local listing, the first thing I'd probably do is look at the business' Google Plus page to make sure nothing was out of whack. Then I would probably check the Google Places Dashboard and see if Google had sent a message about any actions they may have taken. I'd probably also run a quick citation scan to see if there's anything strange showing up on the various citation sites and I'd definitely check out the business' website to see if anything there had changed. Then I might read my blog to see if I had written anything about some new Google Local algo update :) Mike Blumenthal I would check for: Duplicate listings. Penalties - I would check if the listing complies with Google's Guidelines. Changing search rules - like Google changing the radii of the search. Changes at the business like business name, address or phone number. Mary Bowling First, I'd log in to my dashboard to see if there was a problem with my listing, such as a suspension. Then, I might check the chatter in the help forum and elsewhere to learn if this was a widespread issue or specific to my listing. I wouldn't panic because Google is always testing things and I would wait a few days to see if this was going to \"stick\" or not. If it did not recover, I'd try to figure out if Google might be seeing data inconsistency on a highly trusted site that it hadn't seen in the past. Nyagoslav Zhekov The most common reasons for sudden drops in rankings/traffic are: The category of the Google+ Local listing (especially the main one) has been modified. Usually this happens automatically, so you need to pay very close attention; Automatic or manual penalty due to link spamming (usually occurs only for specific keywords that have been aggressively targeted); Changes to the NAP of the Google+ Local listing. Again, these usually happen automatically, so it is extremely important to make sure you have a \"deep\" footprint in terms of citations to prevent duplicate listings or merges from occurring, as well as to make sure the business information is consistent everywhere on the web. Other than that, it is also possible that some competitors have been doing well and they've simply \"outranked\" you. Linda Buquet I check for duplicate listings. Is there inconsistent NAP on Place Page vs. site (for example, 800 number or tracking number on the site)? Is there a multi-location NAP on the site? If everything matches up correctly, next I look for violations. Keyword or GEO stuffed name on Place page? GEO stuffed categories? Fake location? Virtual office? City repeated in description and a myriad of other things that could trip a filter or cause a problem. I also look at location to see if they are out of the map radius. I’ve posted about this, but they can be in center of town but OUTSIDE the ranking centroid for that industry. (Related to what Mike brought up in the webinar.) Mike Ramsey Search for business name + zip code to see if the listing is still live in Google Maps. If it is still there, then I would look to see if the ranking search radius changed. If that’s the same, then I would log into the account and check to see if there is a flag on the listing of any type. If everything is clean, it could just be a ranking update and the business doesn't have everything they need so more work is required. 3. Authorship It’s obvious that Google has big plans for Authorship. How do you see Google Authorship influence local search visibility? What are some things businesses can do to position themselves for success in the future? Andrew Shotland Besides making sure you have rel=author set up so your Google+ profile pic appears next to your URLs in the SERPs, the best strategy is to actually be an \"author\", meaning start sharing interesting stuff either via your site or Google+ and start interacting with other G+'ers in your target markets. There are definitely ranking benefits you can get from being active on Google+ thanks to personalized search (people who circle you are more likely to see your stuff show up in the SERPs) but I truly think the big opportunity here is to create true engagement with potential customers, not necessarily rankings. Mike Blumenthal Google and others have documented how disruptive visual signals in search results are in searcher behavior. The days of the #1 search result being the most important are gone. Searchers tend to click on the graphically highlighted result even if well down the page. This is true whether the result is pinned or carries the author photo, with the photo carrying even greater influence in affecting searcher behavior. Thus a search result lower down the page with an author photo might get clicked on even more than a higher ranking local result with a pin. Clearly the impact of authorship on user behavior is palpable. Mary Bowling Authorship helps a business to position itself and its staff as experts in their niche and their locale. Blogging and interacting with others in a helpful, non-salesy way on social media helps to amplify that positioning. Nyagoslav Zhekov I believe authorship is more of a way for Google to gain more information about persons, and specifically about persons who are potentially influential, because they create content. Obviously, for Google to push this, they needed some hook, and the hook was that the author's photo started appearing next to the \"claimed\" content in the search results. And as it was to be expected, that increased click-through rates as a result. Thus, implementing rel=author and/or rel=publisher (note that there is difference between the two ) is, in a way, a win-win solution. Mike Ramsey I actually don’t see Authorship playing into local rankings as much as I see publisher eventually playing in. Author matters for articles, publisher matters for businesses. The key is making sure that your business Local+ page is connected to your site and that you are active and getting into your local audiences' circles. 4. Website-related ranking factors The influence of website-related ranking factors in Google Places is undeniable. What are some things we can do to maximize this influence beyond embracing structured data? Andrew Shotland Do all of the normal things you would do to rank your website for non-local queries: make sure your site is technically sound, make sure you have pages that target high value queries, make sure you get links, etc. Mike Blumenthal First let me disabuse the idea that structured data is a ranking factor. I use it, recommend and swear by it, but only because it guarantees that the machine that is Google can understand it every time. If Google doesn't know who you are (publisher), who wrote the article (author), where you are located (location schema), what content you have (xml sitemap) or what people are saying about you (review rich snippets), then they are not understanding the whole picture about your business. Google will attempt to understand those things and does a very good job without structured data, but, occasionally, they mess up. Using structured data is all about just making sure that Google can read your data correctly. General website best practices apply in local as much as they do in general search: Having a clear site structure with links that are easily spidered Having one page per product and per location so that Google can see what you do Having title tags, description tags and H1 content that clearly indicates what the page is about Making sure that your home page clearly reflects your brand and the most important products Search in general, and local search, in particular, is about brand. Google is very conscious about the importance of brand and is looking for signals that verify not just the brand, but the prominence of it. I focus on helping businesses be sure that they are the prominent brand in their geography for their specialty. Mary Bowling Three things: On-page optimization that supports the local business listing. Gaining good local links. Continually creating good, locally-focused and industry-focused content and promoting it. Nyagoslav Zhekov The aforementioned authorship, as well as implementing schema.org for local businesses, are two important aspects. The connection between the strength of the business domain and the increase in rankings of the Google+ Local page has been increasing over the years, so practically everything that you do in terms of regular website optimization could affect your Google listing(s), too. An interesting trick that could potentially increase the exposure of a business in the local search results is using a location-specific page as the landing page for the Google+ Local listing, while at the same time optimizing the homepage, too (or the other way round) - see answer 3 for a reference. Linda Buquet I believe the current blended algorithm is 80% – 90 % based on organic ranking factors. (Some disagree.) But what I find is that if you do traditional SEO extremely well and then add all the local hooks (a Linda’ism for a bunch of specific types of local signals), it can really make all the difference. There are a ton of different things that can cause a big boost, bit if I had to only pick one thing, it would be getting the homepage optimized for the exact right key phases. Not a scatter gun approach, but highly targeted to the most important exact key phrase(s). For example, if the most important keyword is “Dentist” and they are in Atlanta, the home page needs to be well optimized for both Atlanta Dentist and Dentist Atlanta without being overly repetitious and spammy. This is because we don’t know what search order the next consumer is going to use and we want our client to rank highly for both. Also optimizing for plurals when warranted can be an easy win for local. With some keywords such as city plumbers – plurals get more searches, yet have lower competition so are easier to rank for. Mike Ramsey Local links pointing to local content on unique local pages that are getting a local of local social shares. 5. Google Carousel Is Google Carousel something we should consider a sign of new things to come or is it something Google will eventually phase out? Andrew Shotland I don't think a prediction about the Carousel will be worth much. Google likes to change things all of the time. That said, the Carousel seems indicative of the move to a touch UI that is more tablet/mobile in nature. Mike Blumenthal From what I can gather, Google sees it as an important future direction. Predicting the future with Google is always a risky business given that they themselves change plans very quickly, but I see the carousel being an important development that will roll out more widely when Google feels that they have enough good signals to do so. Mary Bowling The carousel is very much in its infancy and it will evolve according to how we all interact with it. I believe it is an example of what we may expect to see in all types of Google search results in the future - an integration of the information Google has that it perceives to be most relevant as the \"answer\" to a query. Nyagoslav Zhekov It looks to me more like a test. It could stick, if Google finds out that users accept it better, or it could be taken down if the general response is not good. For now, apparently Google is rolling it out only for a number of specific industries and not across the board, most probably just where they believe it might make sense. Here is the current list of spotted keywords that trigger the local carousel. Linda Buquet I’m torn about this. My gut says the carousel's testing on the obvious local markets then based on the data, it will either keep like it is for only certain markets, roll it out to all local, or can it. Mike Ramsey New things to come, for sure. Carousel works in places where Google has a lot of information on local businesses like reviews and imagery. When that becomes standard across all categories, I wouldn't be surprised to see a similar look roll out to all business listings. That might take a long time, though. 6. Keyword Research There’s a lot written about it, yet a lot of people find it hard to conduct keyword research for local SEO. What are some common mistakes people make when doing keyword research in local markets? Andrew Shotland They spend too much time trying to squeeze words out of keyword tools and not enough time talking to customers and employees who generally know the kinds of things potential customers are looking for. They also worry too much about head or vanity keywords instead of focusing on mid and long-tail. Mike Blumenthal Worrying too much about keywords and not enough about communicating what they do really, really well in terms that searchers understand. Mary Bowling For most types of local businesses, it's the fat-head terms that will attract the most visitors to the site if you can rank for them. However, many people tend to overestimate the volume of searches we can expect within our own local areas for these terms. The new Google Keyword Planner Tool may help with this. People also tend to search first for local needs without a geo-modifier. If that does not produce useful results, they may then add a location term. If you are doing PPC, you need to target terms both ways - with and without a geographic term - regardless of what your keyword research tells you. Nyagoslav Zhekov It is, indeed, a hard task to localize keyword research, mostly because of lack of significant publicly available data. Google Trends (ex-Insights) is a good go-to place, but it has its specifics and limitations. There are two major mistakes that I see/hear most frequently: People perform general keyword research for an industry, expecting the searchers' behavior to be the same everywhere. In these cases, I always give the rather exaggerated, but eye-opening example of \"Pop vs. Soda\". It is not necessary that if a user is located in San Francisco (for example), he would necessarily look for \"plumber in San Francisco\". This is not the case. In fact, in a very big percentage of cases, users prefer not to specifically use location when searching, especially when they perform actions using mobile devices. Additionally, it is hard to predict if the searcher would use [city name], or [ZIP], or [neighborhood/street/locale name], etc. That is where PPC as a research tool might come in handy. Linda Buquet I did a really detailed post about using the new Google Keyword Planner for local. I did another one in recent past about using Google Trends for local. So one of the big issues is sometimes you need to do keyword research for that specific city or part of the country. For example, in LA “Personal Injury Attorney” is more popular, but in NYC “Personal Injury Lawyer” is. So for that very most important onsite keyword research, I mentioned in question 4, above, sometimes you need to do keyword research for that local area specifically. Mike Ramsey They don’t look at exact match information for Location + Keyword. They look at broad match and think there is a massive search market when that’s not always the case. On the other side, people don’t research the KEYWORD with location set to a specific city. A lot of localized organic listings and map listings are triggered when no location is added to the search phrase. 7. Google Places for Business Dashboard There was a lot of hype about the new Google Places for Business Dashboard. In your opinion, did it live up to its expectations? Andrew Shotland I had no expectations of it, so I suppose it did. The new dashboard is definitely much nicer than the old one. Pretty great that you can actually upload photos and videos instantly now. Mike Blumenthal Google is unlike most companies in that they religiously follow the release-early-and-iterate-often development process. This is true with the new Places for Business Dashboard, as well. The amazing thing about the release of the new interface was that it came about while they were also implementing the Knowledge Graph architecture, building new pipelines to the KG AND transitioning folks from the old with one set of rules to the new dashboard with a different set of rules. All the while presenting decent local results worldwide. An amazing undertaking, no matter how you view it. I am under non-disclosure and have some constraints on what I can say, but what you see in the Dashboard is just the first baby step. It is a platform that will easily support lots of future developments. Mary Bowling I didn't really have any expectations for it, but the integration of disparate Google products into one management interface is helpful to all of us. Nyagoslav Zhekov It is still a work in process and the transition hasn't been quite finished yet, but it is much better than the old dashboard and it also allows for much more flexibility on Google's side, in terms of adding or updating features. There are certain speculations that Google is looking into building up a freemium model around this dashboard, which would definitely not be illogical. Linda Buquet There are a lot of improvements in the new dashboard – even down to small details that can make a big difference like improved user messaging. Plus, there are important improvements that are not in the dashboard, per se, but are tied to that update as well. For instance, faster data update times, more visible phone support option and the fact that dual claimed listings will no longer be an option, which is something that was causing more problems than many folks realize. Overall, there was a ton of badly needed improvements and I’m happy with what I see so far. Mike Ramsey I like it. But I have hated how the roll out process has been - years instead of weeks. Also, it makes no sense to manage a listing from a Google+ social page and a Places for Business page. Talk about confusing. Give me one place to manage the listings that is the same user experience with the same rules. 8. New Google Maps interface The new Google Maps interface is now open to all. Do you see it as an indicator of an increase in importance of social connections and reviews? Andrew Shotland I look at it a different way. The new map interface moves the app away from being a pure navigational utility and further toward being a type of local recommendations service. The use of cards in the new Google Maps iOS app certainly doesn't look like a map to me. This is the kind of thing that should make local review sites nervous. Mike Blumenthal Absolutely. Google is on the hunt for new ways to surface and rank local content. The new Maps interface, while it is in many ways a test, is also a \"tell\". The intense personalization, the heavy use of social relationships and top reviewers demonstrates how Google thinks those things can and will influence visibility. I don't think it works very well yet, but it sure is a look at the future of rank. Mary Bowling I think those of us in the industry already know that Google is using some social signals (reviews are social signals) and will very likely include more of them in the algorithms as it can. The new Maps makes it more obvious to SMBs how much searchers (and Google) want to see reviews and ratings. If those SMBs are not making social connections, however, they may not realize how strongly that may be influencing others who are. Nyagoslav Zhekov These have always been factors Google (and others) have been trying to use. However, to use them, you need high volume, high quality, trustworthy data, which is difficult to be obtained and that is why Google has been pushing Plus so hard. The new Google Maps are just a logical next step towards incorporating the social layer into Maps. Linda Buquet “Increase in importance of social connections and reviews“ indicator of importance to Google? Yes, they're trying to increase the importance. Whether the new maps will impact user behavior in those respects, and make it important to us as consultants, I don’t really think so. I don’t think the average consumer is going to select lists based on their circles or top reviewers. I think the new Google Maps are going to affect other things for us, though. The lack of a ranked list is a biggie (unless the consumer knows to navigate to “top results”). I think it may create problems with some ranking tools for a while. There is no obvious visible link to the G+ Local page on the new info cards. In new maps, it’s harder to investigate and find dupes and the CID#s aren’t readily visible like before. So lots of things will change or be affected, but I just don’t see it pushing social that much. Mike Ramsey Yes. I have felt that Google would be including top reviews and circles search filters in more and more places across local listings and that is definitely happening. The real trip is when they add the functionality to the main search results. Then, literally, personalized search will completely destroy ranking results. Google+ reviews and profiles matter so much for businesses even if their audience is not there. The top reviewers program is largely Google employees for the time being, but eventually that will change and the businesses that are pioneers on the social end of Google will have a huge leg up when the populous arrives. I have actually heard of teens deleting Facebook pages (because their parents are there and that’s “not cool”) and getting more on board with Google+. 9. Customer Service Google has been investing more in customer service - which went hand in hand with increased human intervention. Do you see this trend continuing in the future? Andrew Shotland Absolutely. For years, Google's reputation for Google Places customer service has been notorious. I have heard SEOs say amazing things about the new phone support service. I imagine Google wants us to keep saying amazing things about them. Mike Blumenthal Local is a unique use case. Google sees the vast world of SMBs as their next big market to profit from. Once the local listings were moved to the new Knowledge Graph architecture and internal and external tools were built to allow the listing to be \"fixed\", it made sense for them to start trying to get that information right. Rather than random calls from a call center in India, they went the route of US-based customer service. From where I sit, it was a wise choice to both get the listings right AND to build some good will amongst their future customers. Mary Bowling I sure hope so, particularly as far as business listings are concerned. The way local business listings at Google are built is very complex and beyond the understanding of most SMBs (and a lot of Internet marketers, too). When they can't get the right information to appear in their listings, it causes a great deal of ill will towards Google. Talking to someone at Google who can and will assist them goes a long way towards healing that ill will and making the local results more accurate. Nyagoslav Zhekov It depends. If Google decides to get into the freemium model I mentioned above, they would definitely need more human customer support (similar to AdWords). However, I don't see them investing much further into support for free products such as Google+ Local. I think the current state of customer service is the best it has ever been. Linda Buquet I hope so. Support has gradually expanded and improved, so I see it continuing in a positive direction. Mike Ramsey Not sure. We owe a lot to Joel Headley at Google for really making massive improvements to Google Local Support. The hard thing is, Google doesn't get any ROI from support that is tangible and the demand is really high. So, as they continue to staff phone lines and emails and forums, are they going to eventually decide it's not worth the headache and cost? Possibly. 10. Google and Service Area Businesses Google’s relationship with SABs (service area businesses) has been rocky in the past. What advice can you offer to service area businesses today considering the fact that many of them have service areas that span across more than a few towns/cities? Andrew Shotland See http://searchengineland.com/how-to-rank-outside-of-your-physical-location-in-google-places-159043. Mike Blumenthal Google has many divisions, even within local. Some groups like the Places team have been internal advocates even when some teams like MapMaker didn't see how they fit into the mapping world (and that view makes some sense from their POV - it's not a mappable entity). SABs are also slightly off the mainstream, i.e., Google focuses on big data and, within that, the biggest problems first and they came at it from a mapping point of view. Thus, SABs were often the last to get a feature or a function. Also, a lot of spam is generated from that side of the house. And because Google often paints their algos with a very broad brush, a large number of real SABs got thrown out with the bath water. So my first piece of advice is to stay strictly within whatever Google's SAB guidelines are to avoid being one of those \"babies\". Secondly, recognize that the limits of mapping and ranking technology mean that they won't necessarily rank across more than one town. There is no rule saying that Google search is the only way to get customers and that Google should rank an SAB across multiple cities just because that's how they do business. Thus, they need to use Google Local for what it's good at and find other techniques to market outside of their principal area where Google Local works. That could be strong organic pages showing on Google in some cases, or it might be Angie's List or Yelp for those other areas. Mary Bowling It's no wonder that SABs and Google have had a rocky relationship. SABs in general (and some niches in particular) are notorious for trying to make it appear as though they have physical locations where they do not. Some of it is intentional deception, some of it is done due to a lack of clarity from Google on its expectations, some is done via aggressive marketing companies (either with or without the business' knowledge) and some is done due to ignorance, but there is no doubt that there has been an enormous amount of it. A business' proximity to the searcher's location matters in the algorithm and in real life. In my opinion, if it is important to a business - whether it's an SAB or one with a storefront, office or shop of some kind - to rank well for a particular town, then they should open a location within that town. This is the surest way to gain an equal footing with the businesses located there. In the past, the cost of being found for a town where you did not have an address was an expensive Yellow Pages ad. Now, the cost may be getting a real address. Nyagoslav Zhekov Google Places (and now +Local) has definitely not been the most suitable platform for service-area businesses. Google has been looking into ways to make space on Maps for SABs, but the attempts have mostly been unsuccessful. The reason is quite obvious - these businesses just don't fit into the core concept of what the current version (and all previous ones) of Google Maps is: discovering things based on Geo-location (and relevance, of course). I would suggest that the SABs that target areas outside their locale (this being their town/city area) put more effort into creating high quality location-relevant content on their websites and try to get (at least) good quality links from locally relevant websites. The first can very well help the second. Creating landing pages with \"unique content\" for each targeted location would obviously be a good start, as well as having a blog that features articles, videos, pictures related to those locations. Here are a few great resources with many ideas on how to create unique content for many targeted locations: The Nitty Gritty Of City Landing Pages For Local Businesses 16 Ways to Create Unique “Local” Content for Cities Where You Want to Rank How to Create Local Content for Multiple Cities Linda Buquet Well, regardless of the way Google has treated SABs, I think the ranking issues remain about the same. If you want to rank for competitive keywords outside the city you are located in, you pretty much need to focus on organic. Mike Ramsey Get locations close to city centers that are legit. It's probably worth the cost to have multiple offices if that is the only way you can be relevant in the search results you care about. 11. Multiple Locations Local search tends to get more complicated with a higher numbers of locations. What are some unique challenges big brands face in local search and how can one overcome them? Andrew Shotland In some ways, the biggest challenge with these businesses is less about SEO and more about internal coordination. I have yet to see a big multi-location company that didn't have issues with data management and the ability to get all of the players to coordinate effectively to focus on an SEO campaign. Mike Blumenthal I see two big fundamental issues with big brands and local. First and foremost is a lack of good NAP management. Keeping not just Google but the whole ecosystem updated with correct information and beginning the long process of deleting old data is a critical first step that not many multi-location businesses have confronted. Secondly, I see that many have not taken the time to understand and implement basic website architecture in a way that properly reflects their multi-location reality. Many have terrible store finders, for example, that are not easily scrapable or rankable. Mary Bowling I think the biggest challenge is that the wants and needs of the parent company are not always aligned with those of the local stores. When that happens, it's usually the local store that suffers. Generally speaking, big brands also tend to have cumbersome management styles, are slow to be convinced of the need for change and even slower to make those changes. Nyagoslav Zhekov There are a number of challenges brands face when managing enormous numbers of locations - from organizational to technological. They often don't have anyone in-house who is knowledgeable enough to deal with the local SEO for all these locations and the task is usually pushed to either some of the marketing executives, or a webmaster. And when these poor souls fail to deliver what is expected from them, the company's management tends to look for outsourcing to specialists, but they very often fail to appoint someone to be the contact point, or if they appoint someone, he has to report up 2-3 tiers until a particular decision (even if it is very elementary) is made. Thus, the processes normally go slower and this is crucial in SEO, especially if the target is as big as in the quoted cases. Another major problem is that a lot of the technology available to SMBs is not available for big brands, or is, but the pricing doesn't make sense. Thus, many compromises have to be made with quality. The most important thing national/international brands targeting locally need to realize is the great significance of this marketing channel. If they manage to do that, then everything else will go much smoother. From a technological point of view, they should try to leverage the not-very-great amount of tools tailored to their needs, such as bulk upload features (Google Local, Bing Local, Yahoo! Local for more than 1,000 locations, LocalEze, Express Update, Foursquare), for example. Additionally, companies with many locations often have awful onsite experience for users looking for specific location as the onsite search functionality is rather clunky. The websites of brands normally get a \"natural\" boost in organic search due to their size and trustworthiness, so they should focus first and foremost on getting their onsite SEO right. Mike Ramsey I would say the biggest challenge is centralized management. Most big brands allowed local stores to claim their own listings initially and now they have a massive mess and don’t know who owns what. Trying to bring that into a corporate managed account with a strategy in place is very difficult, as it doesn't account for responding to reviews on the local branch level, or keeping local specials, offers, and information populated across the listings. There is finally support on the social listings for multi-person management of accounts and I think this will eventually solve the issue, but for now, it's really rough. The other thing is simply data confusion at scale is almost impossible to fix. 12. Social Media Platforms How can local businesses use social media platforms to enhance their local search visibility (directly or indirectly)? Andrew Shotland This is still my fave local business social media technique: http://searchengineland.com/are-you-a-member-of-the-twitter-chamber-of-commerce-24914 Mike Blumenthal Social holds out a lot of promise for post-sale customer relations. But all too frequently I see local businesses jumping in it, without either having the fundamentals in place or having a plan as to how they will leverage it. The fundamentals for me include a rigorous and systematic gathering of client email addresses AND a review management plan that leverages both that email list AND their clients' proclivities for using social media. Mary Bowling They can enhance their local search visibility by: being helpful to all without be promotional. using them to provide better service to current customers. using them to promote specials and discounts. Nyagoslav Zhekov In terms of importance of social interactions for local businesses, reviews outrank everything else. There have been numerous researches showcasing the significance of reviews as a conversion factor. Additionally, due to the personalization of search results, native Google reviews affect rankings in Google's personalized search results (i.e. a business that was reviewed by a friend of yours might rank higher when you use relevant search queries). Reviews on properties other than Google are also speculated to be an important ranking factor that directly affects the search results. I would suggest you go through the Customer Reviews section on Phil Rozek's blog for more information and tactics related to reviews for local businesses. Mike Ramsey Social to me is not about rankings. It's about customer support and retention. The social platforms that bring search visibility are simply reviews. Businesses need to have a review process. It's more important than everything else. If you don’t have a way to gain feedback from your customers online, then you are missing the #1 best way to build your brand and attract customers. 13. Google organic search algorithms Recently, Google has dramatically refined their algorithms in “general organic search.” In your opinion, where do you see local search going in the future from the algorithmic standpoint? Are we still going to talk about proximity, location prominence and citations five years from now? Andrew Shotland In my view, the algorithm hasn't changed significantly over the past few years, so I don't expect it to change much in the next five. What I do expect to change is the context of the queries as we all move to all mobile, all the time and each of the major local search systems starts using all of the available behavioral factors to personalize results. But outside of the major categories where there's a lot of activity, (e.g. bars and restaurants) to mine social data and the like, the majority of local queries are quite boring and won't lend themselves to PRISM-like techniques for determining relevance. I used to tell people I was going to build a local search site that just helped people find tailors, because no one really cares about tailors and I could own the market in a month. I think the #1 ranked tailor in the SERPs today stands a good chance of being the #1 ranked tailor in The Minority Report - as long as he doesn't screw up his NAP. Mike Blumenthal Google never seems to throw a good algo away. The attributes may play less of a role and new variables may be included, but there is a tremendous investment in both their corporate knowledge and intellectual property. Thus many attributes of the current algo will be present in the future. Some things like proximity will become ever more important as we, as a society, transition to always-on mobile computing and businesses implement technologies like interior mapping and Blue Tooth LE that provide a much better idea of who has just crossed our geo fence. So, I see the next holy grail of local is ever-increasing granularity - knowing more precisely where someone is located, knowing more precisely what they are doing, what they are interested in and having very granular information (inventory, coupons, sales, events, loyalty) to provide them. The Internet of things will find its life and legs in the local search space. Mary Bowling Question 1 : We'll see more and more personalization, particularly as it applies to mobile devices. Question 2: Most definitely. Nyagoslav Zhekov Proximity is always going to be a factor, no matter what algorithmic changes occur. Citations are a powerful way for Google to understand the \"prominence\" of particular business and while I think some changes in how Google discovers and classifies citations might be made in future, I don't see them disappearing as a major ranking factor (and with this \"location prominence\"). In future, local search will most probably go towards more personalization as Google \"devours\" more data for every object (including humans) in the world. Such types of personalization might even make more sense in local search than in general search, so subsequently, it might have greater effect on local SEO. Recently, Google has been making some SERP-display-related changes and I speculate that this might be related to their legal issues with having their native properties prioritized in the organic search results (Google Places being one example). This might potentially diversify the importance of the available marketing channels for local businesses and they could stop relying too heavily on Google. Linda Buquet I think local, just like regular search, will just continue to get more complex. As spammers and scammers find ways to game the system, Google will continue to try to find more ways to determine which sites are most relevant to the query. Right now, there are so many ranking factors and different algos that it’s pretty hard to reverse engineer. I think that’s Google’s goal, in part. Keep finding fresh new signals and new ways to keep us all guessing. Mike Ramsey Yes. We will just be talking a lot more about customer sentiment, branding, reviews and tractable purchasing offline. I think those are ranking factors that will be added to the fold eventually. There is no better way of knowing if a business should rank than by Google understanding what's being said about the business in reviews and understanding what people are buying from them. If you made it this far and find this interview useful - please thank the interviewees and share this with your friends. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Local Search Interview: 13 Questions For 6 Experts"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Local Search Interview: 13 Questions For 6 Experts"
    },
    {
      "level": "H3",
      "text": "Introducing the Interviewees"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "1. Measuring success in local search"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "2. Map rankings"
    },
    {
      "level": "H2",
      "text": "3. Authorship"
    },
    {
      "level": "H2",
      "text": "4. Website-related ranking factors"
    },
    {
      "level": "H2",
      "text": "5. Google Carousel"
    },
    {
      "level": "H2",
      "text": "6. Keyword Research"
    },
    {
      "level": "H2",
      "text": "7. Google Places for Business Dashboard"
    },
    {
      "level": "H2",
      "text": "8. New Google Maps interface"
    },
    {
      "level": "H2",
      "text": "9. Customer Service"
    },
    {
      "level": "H2",
      "text": "10. Google and Service Area Businesses"
    },
    {
      "level": "H2",
      "text": "11. Multiple Locations"
    },
    {
      "level": "H2",
      "text": "12. Social Media Platforms"
    },
    {
      "level": "H2",
      "text": "13. Google organic search algorithms"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Vedran Tomic\n          \n            Vedran Tomic"
}