{
  "url": "https://moz.com/blog/local-landing-pages-guide",
  "slug": "local-landing-pages-guide",
  "title": "Local Landing Pages: A Guide To Great Implementation In Every Situation - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "With the right types of landing pages, you can dramatically increase your local visibility. These helpful guidelines and tips will help you ensure proper implementation for your specific business model.",
  "content": "Local Landing Pages: A Guide To Great Implementation In Every Situation Local SEO By: Miriam Ellis April 2, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis April 2, 2014 Local Landing Pages: A Guide To Great Implementation In Every Situation Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Editor's note: This post has been updated to reflect Google's re-branding of Google+Local pages as \"Google My Business listings\". Carry on! Do you keep seeing terms like \"city landing pages\" and \"service area pages\" mentioned on Local SEO blogs and find yourself wondering if this form of marketing is a good match for your business? The topic of local landing pages has been super-active in the Moz Q&A Forum recently, and I've written this post to honor all of these great questions we're getting. This guide defines different types of local landing pages and identifies four distinct business models united by the need to earn visibility for local-focused Internet searches. By reading this guide, you will not only become fluent in the subject of local landing pages, but will also be ready to implement the right types of pages for your unique business. Check your listing accuracy for free Single-location service area business This is the plumber working out of his house and traveling to clients in a 30 mile radius, the caretaker who sets out from her office each day to provide in-home services to elders, and the tow truck operator going out from a truck yard to rescue stranded drivers. If you travel from your home or office to serve customers, rather than them coming to you for services, your business is the definition of a single-location service area business (an SAB). You have a dedicated street address and a local phone number, but you don't expect your customers to come to you. To my recollection, this is the precise business model around which the term \"city landing page\" first came into common usage in the Local SEO industry, and this form of marketing has evolved, in part, in an effort to counteract some of Google's bias toward physical location. When Google created their local product, it was definitely more geared toward brick-and-mortar businesses than SABs, and it remains so to this day. Most SABs will be unable to obtain rankings in Google's local pack of results for any city other than the one in which they are physically located, and this leaves business owners wondering how they can accurately represent the fact that they serve in a variety of locations. The answer is to pursue organic rankings, rather than local ones, for these other service cities. Developing landing pages on the company website is one of the key techniques for achieving this desired visibility. How it works: Identify the key cities in which you serve, beyond your city of location. Create a unique page of content on your website for each of these cities. Link to these pages from a top level menu, perhaps under a heading such as \"Cities We Serve.\" If possible, earn social mentions and links for these pages. FAQ: Q: I serve a huge number of cities. Do I really have to create a page for each one? A: Without a unique page for each city, you're unlikely to rank organically for relevant queries. That being said, it's not typically reasonable to create 50 city landing pages all at once. Instead, start by identifying your very most important cities (maybe 5 or 10 of them). Develop well-planned, high-quality pages for each of them. You can then continue to build out new pages over time, or, consider the idea of developing an on-site blog to begin publishing ongoing content about your less-important service cities as well as your important ones. Q: I've put the same content with the city name swapped out on 20 different pages. Is this okay? A: No! You're putting your website at risk for a duplicate content filter. The absolute rule of developing local landing pages is that the content is unique on each one. If you can't find something unique to write about, don't create the page. Q: I serve my whole state. Could I just optimize for that? A: You could take that approach, if keyword research indicates that people search for what you offer by state. Typically, though, users either search for a service + a city, and even if they don't, Google will localize searchers' results based on the location of their device. Hence, if you want to show up for \"fence builders in Denver,\" you've got to have a page on your site that speaks to this need. If your website is simply optimized for \"Colorado,\" it isn't locally optimized and you can't expect Google to consider you as a relevant answer for queries containing or stemming from cities like Denver, Boulder, or Colorado Springs. Q: Can I build a Google My Business Listing for each of my service cities and earn rankings this way? A: Only if you have real, physical offices there. You are only eligible to build one Google My Business listing per physical location (with the exception of multi-partner practices and large campuses like hospitals). It's forbidden to build them for any city where you aren't physically located. Q: Can I use virtual offices to create a presence in my service cities? A: No. Google prohibits the use of P.O. Boxes and virtual offices. Unless you've got a physical, staffed location where someone is answering the telephone during stated business hours, you should not be using such addresses to appear like you're physically located in your service cities. This is not only against Google's rules, but it's misleading to your customers. If you can get a real office and staff it, great. Otherwise, don't do this. Q: What if I just put a list of my service cities on my homepage? A: This one's a bit complex. If you serve just a few locations, it's perfectly fine to mention these in a natural manner on your homepage, but you shouldn't count on this to be enough to earn rankings for your business unless you have no competition. It's much better to build a page for each city. Something you should definitely avoid doing is putting a big block of text anywhere on your website listing cities or zip codes. Google's webmaster guidelines cite this as a spammy practice. Q: How can I meet the challenge of creating unique content for each of my city landing pages? A: This is where your creativity counts most! Consider the following options for brainstorming and creating unique, terrific content: Showcase completed projects in each city, using text and photos. Publish customer testimonials from customers in each city, encoded in Schema review markup. Interview your service people who serve those cities, introducing them to your customers. Create and publish city-related videos on each page and offer a transcript. Offer city-specific specials in rotation from city to city. Consider creating infographics specific to each city. Share advice and news regarding laws, codes, weather, terrain or issues that are important to a specific community and relevant to your industry. Provide unique do-it-yourself tips for things customers can do on their own. Create opportunities for user-generated content through contests and promotions. Share details of your involvement in specific cities, such as events you participate in or organizations you sponsor. Think outside the box; come up with something not on this list that nobody else has thought of doing! Single location brick-and-mortar business This is the restaurant, dental office, or retail shop with just one physical location. In this case, the whole website is going to be optimized for the city in which the business exists and local landing pages are typically not going to be a good fit. That being said, there is a common question surrounding this business model that needs to be addressed; one that often arises when a business is located in a small town near larger cities. FAQ: Q: My clients come to me from surrounding cities. I want to rank for these other/bigger locales. Could I publish landing pages for each of these places from which clients come to me? A: It's understandable that if your business is located just outside of Dallas, Boston, or San Francisco and people come to you from these cities for services, you might want to achieve high rankings there. To my mind, this comes down to a question of relevance and usefulness. Would it be relevant or useful to create pages on your website stating, \"Customer Joe comes to us from Dallas?\" Probably not. Knowing a detail like this doesn't really help anybody, and if this is your only connection to a neighboring community, you probably shouldn't attempt to create local landing pages. However, if your business has more of a link than this to surrounding towns or cities, you might have something of value to write about. A legitimate connection might include, but not be limited to, the following hypothetical scenarios: A physician with privileges at a major city hospital A therapist who speaks at major city conferences An attorney who serves at courts in other cities A sporting goods store that sponsors sports teams in other cities An organization that hosts events in other cities You should be able to determine if your business has this type of link to a neighboring community that could generate interesting content. Will writing about these things be enough to make you #1 organically for cities in which you're not physically located? Likely not, but the effort could earn you some visibility. Whether the investment of time and money will be worthwhile depends on the findings of your industry research. If you can identify gaps you can fill in the SERPs or know you've got sluggish competitors, a good effort here could yield exciting results. Multi-location brick-and-mortar or service area business In this scenario, you have more than one office, either from which your staff travels to offer services or to which your customers come to do business. In both cases you will be creating local landing pages for each physical address. Provided that each location has a unique phone number and is staffed during stated open hours, you are allowed to create a Google My Business listing for each office, too. FAQ: Q: How should I optimize my website if I've got multiple locations? A: There are nuances to this situation which I'll do my best to address here. Your scenario might consist of being a local restaurant chain with five branches in a state or a multi-state franchise with 100 or more locations. If you've got a main headquarters and a just a handful of additional locations, you might consider optimizing the homepage and about page for the headquarters and putting the complete NAP of all locations in the footer and on the contact page of the site, in addition to building a local landing page for each office, optimized with its unique NAP in the opening copy. If you have a handful of locations, but they are all of equal value, I would suggest optimizing the homepage, about page, and service description pages for the brand rather than the physical location, and then putting the complete NAP of all locations in the footer and on the contact page, as well as the unique NAP on each respective local landing page. If you have a large number of locations (let's say 10 or more), I would suggest optimizing the homepage, about page, and service description pages for the brand, rather than locations. I would not put more than 10 NAPs in the footer. I'd leave that for the contact page and for the individual local landing pages. If it's reasonable, put navigational links to these local landing pages in a menu. If not, make them accessible via a clickable map, ZIP code search or similar feature. Include them all in an on-site sitemap. Remember that the content must be unique on all of these pages to avoid duplicate content penalties. Q: I'm having trouble brainstorming ideas for making these local landing pages unique. What can I write about? A: Consider the following ideas for inspiration: Showcase your work in each city, writing up great project descriptions. If different services, products or classes are available at different locations, describe these. Create city-specific coupons and contests. Develop infographics and videos, accompanied by text descriptions of their content. Offer advice that is specifically relevant to a given community. Offer excellent driving directions. Introduce the staff at specific locations; interview them if possible. Add Schema-encoded customer testimonials for each city. Q: I run an SAB with several physical offices that each serve their own radius. What kinds of landing pages should I be building? A: You'll build a unique landing page for each office, optimized with its unique NAP. You'll be linking from the Google My Business listing for each office to its respective page on the website. Additionally, you can then set about building up a set of city landing pages (with no NAP) for each of the cities in the service radius of each office. If this ends up looking like way too many pages, consider blogging to begin covering these service cities over time with descriptions of your completed products. National company desiring a local presence For national businesses, the increasing presence of local results for important keyword searches has often seemed like encroachment rather than a blessing. You may find that much of the search engine result real estate is now being taken up by local companies. In such a situation, it's natural to wonder if building out some type of local landing page would help you to gain back visibility that may have been lost. As I see it, these are the two options in this scenario: 1. If you have staffed, physical locations in some cities and make in-person contact with your customers, then you are eligible to create a local landing page and attached Google My Business listing for each physical office. You can take advantage of the techniques described above in this article. For cities you serve but where you're not physically located, you should determine whether it is reasonable to create unique content for each city, or if your customers' needs will be better served by something like an interactive map. 2. If you have no physical offices or in-person contact with customers, your business does not qualify for Google My Business listings, and the development of on-site local landing pages may just not make sense. For example, if you're a virtual services provider supporting all of the US, creating a page for every single city in the country probably isn't a reasonable approach to marketing. After all, if what you offer is the same for everybody, nationwide, what can you find to write about that would be different from page to page across thousands of pages? In such a scenario, it's likely better to offer excellent content about your services accompanied by a map of your service cities, rather than attempting to rank for every, individual city with the landing page technique. Likely, you will need to rely on PPC to geo-target your advertising and turn to social media to create a presence in important communities. For national businesses, building a strong brand is critical. Google tends to 'get' brands and if someone is searching for \"Whole Foods Market\" or \"McDonalds,\" Google is typically going to surface reasonably appropriate results for the searcher, even if the company isn't getting their optimization perfect. Fair or not, this is how I see local search working these days, and the smaller your company is, the harder you'll have to work to combine excellent Local SEO practices with efforts to get your brand name established in your target communities. In conclusion \"Does it make sense?\" is the question I'd suggest as a determining factor for the types of local landing pages you build. If you can build unique, helpful pages, then the effort will likely be worth it. If you're having to stretch to find a rationale for the development of these types of pages, chances are, they're not a good fit. Are your locations listed accurately online? Do you have inspiring suggestions for the types of content business owners can create to make their local landing pages especially neat or helpful? If so, please share your ideas with the community! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Local Landing Pages: A Guide To Great Implementation In Every Situation"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Local Landing Pages: A Guide To Great Implementation In Every Situation"
    },
    {
      "level": "H2",
      "text": "Single-location service area business"
    },
    {
      "level": "H3",
      "text": "FAQ:"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Single location brick-and-mortar business"
    },
    {
      "level": "H3",
      "text": "FAQ:"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Multi-location brick-and-mortar or service area business"
    },
    {
      "level": "H3",
      "text": "FAQ:"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "National company desiring a local presence"
    },
    {
      "level": "H2",
      "text": "In conclusion"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}