{
  "url": "https://moz.com/blog/local-product-kiosks",
  "slug": "local-product-kiosks",
  "title": "Have Your Agency’s Clients Considered a Local Product Kiosk? Google Has. - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There's a quiet opportunity in local SEO that could mean a conveniently unique competitive advantage for your clients: local product kiosks. Google has confirmed that these are eligible for listings apart from the main business page — could they be right for you?",
  "content": "Have Your Agency’s Clients Considered a Local Product Kiosk? Google Has. Local SEO By: Miriam Ellis November 4, 2019 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis November 4, 2019 Have Your Agency’s Clients Considered a Local Product Kiosk? Google Has. Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. File this under fresh ideas for stagnant clients. It’s 10:45 at night and I’m out of: TortillasAvocadosSalsa Maybe I just got off of work, like millions of other non-nine-to-fivers. Maybe I was running around with my family all day and didn’t get my errands done. Maybe I was feeling too sick to appear in a public grocery store wrapped in the ratty throw from my sofa. And now, most of the local shops are closed for the night and I’m sitting here, taco-less and sad. But what if it didn’t have to be that way? What if I could search Google and find a kiosk just a couple of blocks away that would vend me solutions, no matter what time of night or day? Something old is becoming new again, just like home delivery. And for your agency’s local business clients, the opportunity could become an amazing competitive advantage. What’s up with kiosks? Something old The automat was invented in Germany in the late 19th century and took off in the US in the decades following, with industry leader Horn & Hardart’s last New York location only closing in 1991. These famous kiosks fed thousands of Americans on a daily basis with on-demand servings of macaroni, fish cakes, baked beans, and chicory coffee. The demise of the automat is largely blamed on the rise of the fast food industry, with Burger Kings even opening doors at former automat locations. Something new A couple of weeks ago, I was watching an episode of my favorite local SEO news roundup in which Ignitor Digital’s Carrie Hill mentioned a meat vending kiosk. I was immediately intrigued and wanted to know more about this. What I learned sparked my imagination on behalf of local businesses which are always benefitted by at least considering fresh ideas, even if those ideas are actually just taking a page from history and editing it a bit. Something inspirational What I learned from my research is that the Applestone Meat Company is distinguishing itself from the competition by offering a 24/7 butcher shop via two vending installations in the state of New York. They also have a drive-up service window from 11am–6pm, but for the countless potential customers who are at work or elsewhere during so-called “normal business hours,” the meat kiosks are ever-ready to serve. CEO Joshua Applestone says he was inspired by the memory of Horn & Hardart and he must be one smart local business owner to have taken this bold plunge. The company has already earned some pretty awesome unstructured citations from the likes of Bloomberg with this product marketing strategy and they’re planning to open ten more kiosks in the near future. But Applestone isn’t alone. A kiosk can technically just be a fancy vending machine. Check out Chicago startup Farmer’s Fridge. They recently closed a $30 million Series C round led by one-time Google CEO Eric Schmidt’s Innovation Endeavors. Their 200+ midwestern units provide granola, Greek yogurt, pasta, wraps, beverages, and similar on-the-go fare, and they donate leftovers to local food pantries. Americans have long been accustomed to ATM machines. DVD and game rental stations are old news to us. We are nowhere near Japan, with its sixty-billion-dollar-a-year, national vending machine density of one machine per 23 citizens, and its automated sales of everything from ramen to socks to umbrellas. Geography and economics don’t point to the need to go to such a level in the US, but where convenience is truly absent, opportunity may reside. What might that look like? Use your imagination My corner of the world is famous for its sourdough bread. There are hundreds of regional bakeries competing with one another for the crustiest, lightest, most indulgent loaf. But, if you don’t make it to the local stores by early afternoon, your favorite brand is likely to have sold out. And if you’re working the 47-hour American work week, or gigging California night and day but don’t want to live on fast food, you’d likely be quite grateful to have your access to artisan baguettes restored. Just imagine every bread bakery around the SF Bay Area installing a kiosk outside its front door, and you can hear the satisfied after-hours crunching, can’t you? Applestone is selling unprepared meat, Farmer’s Fridge is selling prepared meals, and almost anything people nosh could be a candidate for a kiosk, but why should on-demand products be limited to food? I let my imagination meander and jotted down a quick list of things people might buy at various off-hours, if a machine existed outside the storefront: Books/magazinesWeather-appropriate basic apparel (sweatshirts, socks, t-shirts)First aid suppliesBaby care suppliesEmergency electronics (chargers, batteries, flashlights)Basic auto repair supplies (headlight bulbs, wipers, puncture kits)Personal care products (bathroom tissue, toiletries)Office supplies (printer ink, paper, envelopes, stamps)Household goods (lightbulbs, laundry soap, pantry basics)Pet suppliesTravel/camping/athletic suppliesBasic craft supplies, small games, gifts, etc. What if customers who do their morning bike ride at 5 AM knew they could stop by your client’s kiosk to fix a punctured tire? What if night workers knew they could pick up a box of light bulbs or bandages or cat food on their way to their shift? Think of the convenience — in some instances even life-saving help — that could be provided to travelers on the road at all hours, members of your community who are housing-insecure, or whole neighborhoods that lack access to basic goods? Not every local business has the right model for a kiosk, but once I started to think about it, I realized just how many of them could. I’m initially envisioning these machines being installed at the place of business, but, where the scenario is right, a company with the right type of inventory could certainly place additional kiosks in strategic locations around the communities they wish to serve. Kiosk Local SEO Clearly, kiosks can generate revenue, but what could they do for clients’ online presence? The guidelines for representing your business on Google already support the creation of local business listings for ATMs, video rental stations, and express mail dropboxes. But I went straight to Google with the Applewood example to ask if this emerging type of kiosk would be permitted to create listings. They were kind enough to reply: The link in the Twitter DM reply just pointed to the general guidelines, and I can find no reference to the term “Food Kiosk listing” in them. It’s the first time I’ve ever heard this terminology. But, clearly this representative is naming food kiosks as a “thing.” Google, it seems, is already quite aware of this business model. And the proof of their support is in the Maps pudding: My, my! Talk about having the ability to hyperlocalize your local search marketing to fit Google’s extreme emphasis on user-to-business proximity. Enough to make any local SEO agency see conversions and dollar signs for clients. Tip #1: Helpline phone numbers I’ve written about ATM SEO in the past for financial publications, and so I’ll add one important tip for creating eligible Google listings for kiosks: guidelines require that you have a helpline phone number for kiosk users. I would post this number both on the listings and on the units, themselves. Note that this will likely mean you have a shared phone number on multiple listings, which isn’t typically deemed ideal for local search marketing, but if kiosks become your model and you avoid any semblance of creating fake listings, Google can likely handle it. Tip #2: Unique local landing pages for your kiosks I can also see value in creating unique location landing pages on client websites for their kiosks, especially if they aren’t stationed at your physical location. These pages could give excellent driving and walking directions for each unit, explain how to use the machine, feature reviews and testimonials for that location, and perhaps highlight new inventory. Tip #3: Capitalize on your social media Social media will also be an excellent vehicle for letting particular neighborhoods know about client kiosks and engaging with communities to understand their sentiments. Seek abundant feedback about what is and isn’t working for customers and how inventory could better serve their needs. And, of course, be sure every client is monitoring reviews like a low-flying hawk. Is there an appetite for kiosks? Image credit: Ben Chun I’m a longtime observer of rural local SEO. I’ve learned that being intentional in noticing small things can lead to big ideas, and almost any novel concept is worth floating to clients. The tiny, free book lending kiosks sometimes officially branded “Little Free Libraries” are everywhere in my county, have become a non-profit initiative, and are driving Etsy sales of cute wooden contraptions. Moreover, my region is dotted with unstaffed farm stands that operate on the honor system, trusting neighbors to pay for what they take. I’d say our household purchases about half of our produce from them. Within recent recall, the milkman and the grocery delivery boy seemed as distant as the phonograph. Now, consumers are showing interest in having whole meal kits, entire wardrobes, and just about everything delivered. The point being: don’t discount anything that renders convenience; not the traveling salesman, not the automat. The decision to experiment with a kiosk isn’t a simple one. There will be financial aspects, like how to access a unit that works for the inventory being sold. There will be security questions, as most businesses probably won’t feel comfortable operating on the honor system. But if the question is whether there is an appetite for the right kiosk, selling the right goods, in the right place, I’ll close today with a look at these provocative, illuminating reviews from just one location of Farmer’s Fridge: Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Have Your Agency’s Clients Considered a Local Product Kiosk? Google Has."
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Have Your Agency’s Clients Considered a Local Product Kiosk? Google Has."
    },
    {
      "level": "H2",
      "text": "What’s up with kiosks?"
    },
    {
      "level": "H3",
      "text": "Something old"
    },
    {
      "level": "H3",
      "text": "Something new"
    },
    {
      "level": "H3",
      "text": "Something inspirational"
    },
    {
      "level": "H3",
      "text": "Use your imagination"
    },
    {
      "level": "H2",
      "text": "Kiosk Local SEO"
    },
    {
      "level": "H3",
      "text": "Tip #1: Helpline phone numbers"
    },
    {
      "level": "H3",
      "text": "Tip #2: Unique local landing pages for your kiosks"
    },
    {
      "level": "H3",
      "text": "Tip #3: Capitalize on your social media"
    },
    {
      "level": "H2",
      "text": "Is there an appetite for kiosks?"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}