{
  "url": "https://moz.com/blog/local-search-ranking-factors-2014",
  "slug": "local-search-ranking-factors-2014",
  "title": "Announcing the 2014 Local Search Ranking Factors Results - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Many of you have been tweeting, emailing, asking in conference Q&As, or just generally awaiting this year's Local Search Ranking Factors survey results. Here they are!",
  "content": "Announcing the 2014 Local Search Ranking Factors Results Local SEO | Marketing Industry By: David Mihm October 13, 2014 Table of Contents Copied! By: David Mihm October 13, 2014 Announcing the 2014 Local Search Ranking Factors Results Local SEO | Marketing Industry Editor's note: We're preserving this post for posterity. You'll always be able to find the most recent Local Search Ranking Factors survey here: https://moz.com/local-search-ranking-factors. Happy reading! Many of you have been tweeting, emailing, asking in conference Q&As, or just generally awaiting this year's Local Search Ranking Factors survey results. Here they are! Hard to believe, but this is the seventh year I've conducted this survey—local search has come a long way since the early days of the 10-pack way back in 2008! As always, a massive thanks to all of the expert panelists who in many cases gave up a weekend or a date night in order to fill out the survey. New this year As the complexity of the local search results has increased, I've tried to keep the survey as manageable as possible for the participants, and the presentation of results as actionable as possible for the community. So to that end, I've made a couple of tweaks this year. Combination of desktop and mobile results Very few participants last year perceived any noticeable difference between ranking criteria on desktop and mobile devices, so this year I simply asked that they rate localized organic results, and pack/carousel results, across both result types. Results limited to top 50 factors in each category Again, the goal here was to simplify some of the complexity and help readers focus on the factors that really matter. Let me know in the comments if you think this decision detracts significantly from the results, and I'll revisit it in 2015. Factors influenced by Pigeon If you were at Matt McGee's Pigeon session at SMX East a couple of weeks ago, you got an early look at these results in my presentation. The big winners were domain authority and proximity to searcher, while the big losers were proximity to centroid and having an address in the city of search. (For those who weren't at my presentation, the latter assessment may have to do with larger radii of relevant results for geomodified phrases). My own takeaways Overall, the algorithmic model that Mike Blumenthal developed (with help from some of the same contributors to this survey) way back in 2008 continues to stand up. Nonetheless, there were a few clear shifts this year that I'll highlight below: Behavioral signals—especially clickthrough rate from search results—seem to be increasing in importance. Darren Shaw in particular noted Rand's IMEC Labs research, saying \"I think factors like click through rate, driving directions, and \"pogo sticking\" are valuable quality signals that Google has cranked up the dial on.\" Domain authority seems to be on its way up—particularly since the Pigeon rollout here in the U.S. Indeed, even in clear instances of post-Pigeon spam, the poor results seem to relate to Google's inability to reliably separate \"brands\" from \"spam\" in Local. I expect Google to get better at this, and the importance of brand signals to remain high. Initially, I was surprised to see authority and consistency of citations rated so highly for localized organic results. But then I thought to myself, \"if Google is increasingly looking for brand signals, then why shouldn't citations help in the organic algorithm as well?\" And while the quantity of structured citations still rated highly for pack and carousel results, consistent citations from quality sources continue to carry the day across both major result types. Proximity to searcher saw one of the biggest moves in this year's survey. Google is getting better at detecting location at a more granular level—even on the desktop. The user is the new Centroid. For markets where Pigeon has not rolled out yet (i.e. everywhere besides the U.S.), I'd encourage business owners and marketers to start taking as many screenshots of their primary keywords as possible. With the benefit of knowing that Pigeon will eventually roll out in your countries, the ability to compare before-and-after results for the same keywords will yield great insight for you in discerning the direction of the algorithm. As with every year, though, it's the comments from the experts and community (that's you, below!) that I find most interesting to read. So I think at this point I'll sign off, crack open a GABF Gold-Medal-Winning Breakside IPA from Portland, and watch them roll in! 2014 Local Search Ranking Factors Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Announcing the 2014 Local Search Ranking Factors Results"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Announcing the 2014 Local Search Ranking Factors Results"
    },
    {
      "level": "H2",
      "text": "New this year"
    },
    {
      "level": "H4",
      "text": "Combination of desktop and mobile results"
    },
    {
      "level": "H4",
      "text": "Results limited to top 50 factors in each category"
    },
    {
      "level": "H4",
      "text": "Factors influenced by Pigeon"
    },
    {
      "level": "H2",
      "text": "My own takeaways"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "David Mihm\n          \n            David Mihm\n          \n            David Mihm"
}