{
  "url": "https://moz.com/blog/local-event-marketing",
  "slug": "local-event-marketing",
  "title": "Local Event Marketing: Earn Links, Build Citations, Get Reviews, Increase Foot Traffic, and Win at Local SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Event marketing can be incredibly beneficial to your business, but reaping those benefits requires careful planning and preparation. From meetups to conferences and more, this post walks you through everything you need to know (including the SEO!) to throw a truly effective event.",
  "content": "Local Event Marketing: Earn Links, Build Citations, Get Reviews, Increase Foot Traffic, and Win at Local SEO Link Building | Local SEO | SEO Events By: Casey Meraz August 28, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Casey Meraz August 28, 2014 Local Event Marketing: Earn Links, Build Citations, Get Reviews, Increase Foot Traffic, and Win at Local SEO Link Building | Local SEO | SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The recent Google Pigeon update that affected local search was just another example of why marketer's should never put all of their eggs in one basket. Online marketing has been rapidly evolving over the years and a major paradigm shift has happened which has caused marketers to stop building links and start thinking of how to earn them. In this blog post I am going to cover an actionable strategy that any business can use to build citations, earn links, get positive reviews, and increase foot traffic to your brick and mortar location via event marketing. One of my favorite hobbies is actually hosting and running events. Over the years I have run, marketed, or participated in everything from March of Dimes Volunteer Events, Adventure Sporting Events, all the way to marketing promotions for specialty retail stores. Hosting events is a great way to increase your offline visibility as well as earn a ton of links, possible news mentions, and build citations. The citations will help your local SEO campaigns by getting listed on locally relevant websites., the links will help your organic rankings increase through earning high quality links, and foot traffic and exposure to your place of business will be great for your business. Typically when people think of event marketing they get the false impression that only brick and mortar stores can participate in events. While it's true that this post is geared towards the local SEO benefits of hosting an event at your physical location , there are plenty of other benefits even if you don't have a Google My Business listing. Many people make the mistake of coming up with a good event idea in their head, posting it on their blog, and then sit back and hope the entire community will come and support it. That is a mistake. This takes a lot of thoughtful good work, but it can pay off tremendously. At the same time you need to decide up front how crazy you want get you're your event and it's marketing reach. If it's going to be a small event with just a few participants you won't need to do everything in this guide. Pick and choose what's right for your marketing goals and expectations. Remember that you're going to get as much out of this as you put into it. So don't take shortcuts and do this the right way. I think Kane Jamison said it best in his post about Link Building with Local Events: \"The overwhelming majority of the value from hosting events comes from the event itself, so don't get lost in the link building aspects of the strategy. You should be hosting events because that's the type of sh*t real businesses do.\" - Kane Jamison What are the tangible benefits of event marketing for local SEO? Benefit #1: You can easily build citations Getting your business Name, Address, and Phone Number (NAP) on a high quality locally relevant site can be a big deal as it shows the search engines your business is locally relevant. Many cities have town websites and community websites where they post local events. All you have to do is find these and submit to them. If the event is hosted at your location your NAP will be posted on a bunch of locally relevant sites. I will talk more about this later in the post. Benefit #2: You can easily build links Everyone is always talking about link earning which events will help you with. However this is also a legitimate way to build some links where appropriate. If you list your event on a website that posts information about local events you can link back to your event detail page. Benefit #3: News mentions and brand exposure OK now I can talk about link earning. If you follow my rule and are actually creating an event that people will want to go to or helps the community in some way, you can reach out to the local news and see if they're interested in covering the event. They may post it or in some cases they may send down a news crew to cover the event. When I see events that support causes I'm passionate about, I always promote them on my own channels and link to the web page where potential visitors can learn more. Benefit #4: Get foot traffic and sales If you're a brick and mortar location the foot traffic for you and the surrounding businesses can be a huge opportunity to increase your exposure and sales. Make sure you have a plan in place to deal with this accordingly. Benefit #5: Get Reviews If people are happy with you're your event they might just give you a positive review. We have personally found this to work really well after hosting a free Meetup training class. Remember though, some services like Yelp don't want you to ask for reviews so make sure to honor that as well. Benefit #6: Get Social The social benefits of events with any amount of users can be huge. Event attendees might take photos, use your event hashtag, check in, or just plain promote your event just because they like it. Selecting your type of event First we need to start off with an idea or a group of ideas for an event. While it's cool to get excited and pumped up with the idea you need to make sure that the event is put together with proper planning and execution. It must serve a purpose that will actually attract potential customers to your location or the area where you're presenting at. Grand openings: This is self explanatory. Hosting a grand opening for your business is always a great way to increase your visibility. You can do this even after you have been open for a couple of months. Themed seasonal parties: One of my clients has a Summer Kick Off Party outside of their brick and mortar store every year at the start of summer. They offer games, events, food, raffles, as well as offer a big sale to attract new customers. Classes: Educational Classes and Meetup's are a great way to get people to come to your location. By providing free education about your niche or craft you can attract plenty of attendees. We use meetup.com for our training classes. Special sale: Many companies have sales. Make it a bit more special by adding to it. You can provide raffles, free food, or something else to attract your customers. Think about major holidays for sales as well including Black Friday and Cyber Monday. Fundraiser: Partner with a cause you're passionate about and do a fundraiser on that day. More on this later New product promotion: If you have a new product to release you can schedule a promotional event around this. Fairs and other similar events: Even if you have a booth at another larger event like a county fair or business expo, you can appeal to your clients directly by hosting a sub event within the event. Typically having a freebie, special discount at a certain time, or other really attractive benefit you can make this work pretty easily. Event theme parties: If you work in the hospitality industry it gets a bit easier to host events. You can have themed parties for traditional events like a major sporting event or smaller events such as an Oscars viewing party at your establishment. Segment these event types to your customer base and what might work best. Raffles and giveaways: Sometimes I use this as a sub event within a bigger event to keep people more engaged and sticking around all day. Whether its one big prize or smaller prizes every hour, it's easy to get some people to stick around with the right raffle. Host a guest lecture: Having a prominent speaker cover a specific topic is a good way to get noticed for your event. Networking events: Don't have an idea yet? Networking can be key to any small businesses success. You can start a business networking or referral event at your office. Meet weekly, monthly, or whenever is feasible to you but built it up over time and host it at your location. Promote a community cause: Maybe your community has a lot of trash on the road that needs to be cleaned. If you believe in that cause you can sponsor and run the cause. It's easy to coordinate these types of events and promote it within the community. The meeting place can be at your establishment. Host a 5K: Work with your town and community and have the start/ ending of a 5K race or fundraiser start or end at your location. Major sporting events require a lot more preparation though so I suggest only doing this if you partner with an expert. Safety needs to be your top priority. You wouldn't want a news mention for something bad that was due to an oversight on your side of the event. Toy drives / food drives: If you don't have the time to plan and host a large event you can start with a food or toy drive. Just find an idea you'r passionate about and how you can serve the community. Making your establishment a promoted drop off point for your cause is a great way to give back. Host a Google hangout: Sure this is not an event that will help you with getting citations. However if your goal is getting more exposure, increasing your reputation, and getting links you can still use a lot of the information in this guide. Now that you have the idea, let's get ready to promote the event Preparation is essential to the success of your event. To have a successful event you will need adequate time to market your event to your audience. Schedule the event at least 30 days out if possible. Major events are typically scheduled a year in advance, for example I can already buy tickets for the 2015 MozCon. After you have done the basics such as decided on your event type, secured the venue, and scheduled the dates, it's time to start thinking about marketing the event and spreading the word. Here are a few tips to remember before we get started: Remember the local SEO benefits Remember if you want to take advantage of the Local SEO benefit of building citations, it's important to host the event at your business location. You will promote your Business Name, Address, and Phone Number as the event venue on many outside websites. Consider creating an event #hashtag While most major events have figured this out most smaller events forget this crucial step. If your event is social in anyway and people will be sharing photos, checking in, or inviting friends creating a proper Hashtag can help your event succeed further. Pro Tip: Add this #hashtag to all event marketing promotions online and offline (with signage and banners). People may use Twitter, Instagram, or Facebook and tag your event. Think about ticketing in advance Most of the event ideas above don't require ticket purchases or registrations. However if you want to do that I always suggest using a service like Eventbrite, Ticketbud, or Brown Paper Tickets. Ticketing can help keep the numbers in check for your event. Eventbrite for example will allow you to create free tickets or paid tickets. It's also a place you can put your NAP and get a link. Services like this also allow easy website integration for ticket purchases. Research what's easiest for YOU to use and provides the best customer experience for your need. Should you allow event sponsors? This is a question you should address up front. Sponsors can have a lot of benefits, especially if you sell tangible goods. If you're having a raffle for example they may send you free product to raffle off. Maybe they will just send you small branded widgets. People love free stuff. All you have to do is ask. Additionally they can help be powerhouse partners when it comes to marketing. Be sure to inform them anytime you run a promotion so they can help push it out to their audiences. On-page optimization for the event One decision you need to make is where the users can find all of the information about your event. Typically you will always want to do this on your website. Even if you use a third party ticketing service like Eventbrite, you can still embed that code onto your website to make the registrations happen there. Having a central point of information where users can find every detail is essential. Plus keeping it on our website will ensure all of the links and signals you build will linked back to your website. When we explore on-page optimization the main optimization I'm talking about is user experience. We want to make this easy for the user to find every detail they need in an easy to use format. Essential Details on your page Here are some of the most important basic details that you must include on your event page: Event name: Come up with a unique name for your event. This will help you stand out from everyone else out there. It should also be descriptive of the event. If you're hosting a Beer Festival it would be wise to mention that in the event name. Date and time: This needs to have prominent placement on your event page. Without these essential details it's going to be difficult to get people to show up on-time. Location (NAP!): This is where the Local SEO Benefit starts. Ensure that your company name, address, and phone number are listed as the location site. This information should match your Google Local My Business Listing. Add photos of the venue as well for easy identification. About the event: Include a short write up in a prominent location about what the event is about and it's purpose. You can go into more detail later but be concise on the first blurb of text. Schedule: Having a schedule of events is helpful for some events and their attendees. Photos and video: If you have hosted the event before be sure to include photos and videos if possible of the past events. Ticket status: If the tickets are limited include the ticket purchase cut off date, whether they can be purchased at the event, and how many are remaining. Contact information: Nothing is more frustrating for event attendees than not being able to find an answer and also not knowing who to contact to get the answer. When thinking about the user experience design and UI must also be a factor. You want to provide as much information as possible about the event so all questions are answered, however you will likely need to split these up into separate pages if your event is a bigger event. The more information you can provide in an easy to view manner, the more successful your event will be and the less questions you'll have to respond to. Successful event pages typically contain much more information, including: Driving directions: Having driving directions with an embedded Google Map is a great way to go. Also provide several other directions from major intersections to make it easy for people visiting from major metropolitan areas. Lodging and transportation information: If it's a multi-day event it's a good idea to list local hotels and airport transfer options. you can partner with hotels or transportation companies. Pro Tip: Partner with Hotels and transportation companies and you can get links and NAP listed on their website too! FAQ page(s): If you've hosted an event before you already have the perfect resource. Go back to every email you responded to answering a question from the last event and turn it into content for your FAQ page. In addition to this you can interview past event attendees and try to get their real feedback via a survey. Ask questions pertaining to the registration experience (if required) or how easy it was to find the proper information. Press pages: If the event is big enough, add a press page where the media can easily reach you with questions. Include benefits like free entry details on this page. Sponsors: If you have event sponsors such as manufacturers with bigger names be sure to include them prominently. Special requirements: Do you have to be above a certain age to attend this event? If so make sure to display this and any other essential details prominently. Technical on-page optimization Technical optimization for event marketing is easy because it's All About The User Experience. What do I mean by this? Let's consider the ways your visitor will find this event. They will either click on one of your links through your direct marketing campaigns or find your through search. I'm a big fan of Beer. In fact if you're in Denver and don't have a beer with me I will be very sad. But I digress. I did a quick search on Google for \"Beer Festival\" my intent is to find a beer festival to attend in the near future. If I want to increase my click through rates in search I should cater to these people. In the below example we see two examples. The first one is the Great American Beer Festival. Notice their concise yet very effective title tag that contains the event Name, Location, and Date. Now look at the bad example that hurts my eyes to look at. The Meta Description comes up in all Caps and the page title does not contain enough details. If your search behavior is like mine you might not even want to click on that result. So as far as on-site technical optimization goes I would limit it to this: Meta title: Include the event name, Location, and Dates Meta description: Think about your audience and include enough information that will cater to them and entice them to click through. Of course Google decides what to show here but doing this can help you get some clicks. URL: Consider whether or not this even is going to be a yearly event or not. Many events that repeat the event annually just create a single page on their website without the year in the URL. An example would be http://www.MyWebsite.com/my-event-name Since you will be promoting this event and page details across the web you may want to retain the link juice for next years event. You can do this through a 301 redirect or just keep your annual event page an evergreen page that just updates with the new information yearly. Good event pages vs. bad event pages Now, let's take a quick look at some examples of good and bad event pages. Example 1: Great American Beer Festival This is the about page on their site. Since there whole business model is event hosting and not a supplement to another business we will just be looking at the layout of their information. Assume for example that this was the event landing page for your event. Although it's a bit busy you will see that the Location, Date, Travel Information, Ticket Information, and FAQ are all readily visible above the fold. I think it's an effective way of presenting the information. Example 2: The Schlitt Law Firm Although I work with a lot of attorneys, this is not one of my clients; I found this doing a Google Search. This law firm was offering a Toy Drop Off at their law firm. They released this page in 2012. In my opinion this is not an effective page. This was written as more of a press release and doesn't really contain a lot of information above the fold. Plus it's kind of hard to read with so much text and not a lot of pictures. I think this would be more effective with the drop off location, a map, and other pertinent event details listed above the fold. Example 3: Steel City Ruby (simple yet effective) Don't get discouraged with the examples above. You can easily present the information in a simple way on your website. I found this example online and although I don't care for the colors I found it very simple and effective. This page has the business name at the top, the date information, ticket information, ages, venue details, and a blurb about who is going all above the fold. While it could use some visual improvements like a picture it's easy to get the basic details about the event from this page. How to market your event and get the word out (and get foot traffic, links, likes, citations, and mentions) Now that you have put in the important but necessary leg work it's essential that your market your event right. Like any marketing efforts outreach targeted to your segmented customers will be the most effective. If you have a CRM where you have been tracking customer information you can use this to help promote your event. Realistically each of these topics deserves their own article too but for simplicity I have broken it down to the main tactical subjects you can tackle. If you want to track these results more granular through Google Analytics be sure to implement UTM Tracking Codes everywhere you submit a URL. If you're using ticketing you can setup goals as well and track which sources contributed to the most ticket sales. Alternatively you can always see which sources are referring the most traffic. The goal using any of these methods below is to get them to your event page and convert if necessary Method #1: Start by posting your event everywhere you can Top Benefit: Foot Traffic to your event, Citations, and a Links One of the most effective things you can do is post your event in front of people searching for events. Plus you get the potential foot traffic, exposure, link and citation benefits as well. Below are 10 sites US based events can submit to right away regardless of your geographic location. Make sure to add your NAP and Link back to your event page. Craigslist Events: Craigslist has an events section where you can post details about your event. Eventbrite.com: As I mentioned above Eventbrite is good for ticketing, but it's also good to promote your event. It also feeds to a lot of different news sites so it acts as a strong distribution point as well. Facebook Events: You will want to promote your event socially as well. There are a lot of ways to do this but let's start by getting it added. Post this under the company's Facebook page and not your personal event page. Meetup.com: Meetup requires an annual subscription fee but it's a great way to get your event in front of a lot of people. You can also partner with an existing Meetup group for your event and have them promote it on their page. Seek out partners with similar interests in non competing niches and get in front of their audiences. You can also sponsor them :) Eventful.com: Eventful is another event posting website. You can add your venue to the Eventful database for all future events as well. Spingo.com: I have never used this site before but I found it doing a quick search so it's another option to post your site. EventsNearHere.com: Like Spingo, I have never used this, but it appears it has easy-to-use free event submission. Events.org: Another good site to submit your event to. Zvents.com: Another national directory for events that you can submit to. Find region and niche specific places to post your event When finding locations to post your event two I suggest breaking them into two categories. The first category will be websites that serve to residents in your community like local newspaper websites, event websites, etc. The second category is niche related sites that would post your event based on the topic. These can be easily found using Google. Simply try some search strings like these: Submit your event Add your event List Your Event If you're looking for locally relevant directories make sure to add the city and state name in the search. If you want more niche related sites add a keyword to the front of the search as well. Check out this example below where I found a site I can submit my Beer event too. This will help get your event in front of an audience that is ALREADY INTERESTED in what you're offering. Think of the foot traffic and social benefits you can get from this. To get a full list and more relevant event marketing details check out Kane Jamisons post here. He did an excellent job covering a lot of the different search strings you can try out to find these sites. You should spent a lot of time here curating your list of sites and saving them for future use. This is a goldmine that is typically untapped. Method #2: Talk to local news outlets Top Benefit: Foot Traffic to your event, Citations, and a Links You never know unless you ask right? If the event is big enough you can offer a VIP perk for journalists willing to cover the event. Pitch the idea to the local news outlets. Forbes has this article 13 Do's And Don'ts When Pitching To The Media. Although it's geared more towards non event pitches there are some good takeaways. Personally I have had success in the past reaching out to my local news stations to get video coverage and local newspapers to get written coverage. Don't limit yourself to just the major newspaper and consider the local community papers. In many cases you can get pre-event exposure and post event exposure. Maybe you could serve ads targeted to Journalists on LinkedIn on Facebook promoting the VIP area of your event as well that's open to journalists. Method #3: Send an email newsletter Top Benefit: Reach a wider audience and increase the number of attendees If you already have an email subscriber list you need to make sure that you invite them to your event. If your lists are already segmented by customer type I suggest drafting an email geared towards each of these segments to promote the event. Appeal to that target audience. If you don't have this list you could create an initial customer segment of \"Top Customers\" and send a special message to them with a coupon, etc. Make people feel special and ensure there is a reason for them to want to come to your event. Don't spam people that aren't signed up on your list already. Method #4: Create a marketing video Top Benefit: Citations, Free Links to your Event Page Create a short video to promote your event. Include pictures of your events and all of the pertinent event details that you included on your event page. You can then submit this to YouTube, Vimeo, Etc. where you can include your NAP and link to your event website in your description. If you mention it in audibly in the video then you can also use it in your transcription. While you're at it, Geo Tag the video in YouTube to your business location. Here are some of the benefits of this method: Add your NAP to your video description Add a link to your video description to your event page where people can learn more details Promote your video to your subscribers Segment an audience and serve them YouTube video ads with a small budget Method #5: Take advantage of your Yext featured message (if applicable) Top Benefit: More Attendees and Links to your Event Page If you use Yext and have an active Powerlistings subscription you can update your featured message in your account. This will allow you to promote the event on these local directories and include a URL to your event page. It can be a quick win especially if you already focus on barnacle SEO and have your directory listings ranking for your top keywords. Since this will display on your local citation profiles you might get some additional visibility. Method #6: Serve ads to similar event attendees and after the event Top Benefit: Get More Attendees, Get Reviews after the Event, Increase Social Exposure I owe credit for this one to my buddy Ben Wynkoop for figuring this one out. Remember how I mentioned that your event should have a Hashtag? Well, Ben wrote a blog post that featured 10 takeaways from Wil Reynolds' presentation at the SEM San Diego May event, where he spoke on the growing role of PR in SEO. That particular event used the hashtag #SEMSD. After the event was over he spent $18.42 serving ad's to everyone who tweeted (AKA Attended the event) showing a picture, the blog post title and link to the actual post. You can use this same method to your benefit. This is how. Find a list of similar events in your area that use an official hashtag Develop an Ad on a topic of interest to attendees. Use Twitter Ad's and target it to everyone who tagged the event by targeting the official event hashtag as an exact match keyword Spend little $$$$ and get a possible huge ROI Method #7: Consider SMS push notifications Top Benefit: Foot Traffic to your event Depending on your customer base and whether or not it's OK you can consider sending out SMS push notifications. Proceed with caution on this and make sure that your clients are OK with it. If so you can send out a blast to tell them about the event and then one more on the day of the event to remind them to stop by. Method #8: Partner with local organizations like your chamber of commerce Top Benefit: Foot Traffic to your event, Citation, and a Link Inform your local chamber of commerce about the event and other potential supporting organizations. They, like the event websites may be willing to post your information on their website and possibly send out an email newsletter to their member base as well. The more exposure the better. Method #9: Have your sponsors promote your event Top Benefit: Foot Traffic to your event, Citations, and a Links If you are allowing event sponsors for your event to offset costs or get raffle prizes, they will likely want to promote the event too. Ask for a blog post on their website, a banner ad, or social media mentions on their channels to get in front of their audiences. We will talk more about this in the social examples below. Now lets step up the social game Ideally you're already active on Social Media groups and forums that are relevant to your industry or niche. However if you're not, now is a good time to start. But first let's look at some Do's and Dont's. Things you should do Use Followerwonk to identify and follow the influencers. Reach out to them and build relationships. Only participate in groups that you are already active in. Somewhere where you are not just being self serving. Share it with your audiences on all of your platforms Answer questions that people ask. Respond to other question and comments. Be productive and pro-active. Offer to help people. Ask others to share it if they find it useful. Don't sound desperate though. Things you should not do Don't go join a bunch of relevant social groups and post the same message trying to shamelessly promote your event. This is spam. Don't Spam forums Don't just promote self serving messages selling your product or promoting your brand. Think long and hard about defining and segmenting your audience Many people make the mistake of taking the shotgun approach to marketing where they just try to get their message to everybody possible. They try to serve everyone instead of focusing on their niche (I call this the Walmart approach). Let's setup a hypothetical situation. Let's say you're a niche airsoft retail store and you're hosting a training event for people who want join an airsoft team. Would it make more sense to share this message about your event with a Cross Fit group or a smaller local airsoft group? Even though the airsoft group might have less members the message will be really targeted. It's likely that would get more interaction from this group of target customers. If you haven't already identified these types of groups it's important that you take the time to do the research. Once you have identified these groups you need to start participating them in a non self serving way. Think about the community and long term results. This will allow you to put together a plan that you can eventually also use to help promote your event. Once you're in, you will likely have brand advocates that will promote your events for you for free. Where can you find these groups? Google Plus Communities According to Google with communities you can \"Talk about the stuff you're into with people who love it too\". So how do you go about this? Visit Google Communities while logged into your Google account Search for communities using keywords relevant to your industry or where fans might hang out Review the number of members in the group, see how active they are, and decide whether or not to join. Some groups require admin approval before joining. Once you're a member introduce yourself and try to participate. Be helpful and don't troll. Answer peoples questions and provide your feedback to others. Be proactive and develop a strong reputation. Don't be afraid to post non self serving messages. Facebook Pages If your customers are on Facebook then it's going to be a good place for you to be. Since Facebook allows Hashtags it's important to tag all event related posts with your hashtag. By now you should have already created your Facebook Event Page through the company's Facebook page. Once this is done here are some things you can do to promote it. If you have a budget you can use the Boost Post option and target the Facebook Ad's to your direct target audience. If you're not familiar with Facebook Ad's read this. The targeting options are down right creepy but super useful when your audience is well defined. Include this link in any event submissions as well if your event is more social. Consider adding a widget on your website where people can see which of their friends are attending and easily share and join this. Twitter If you already have an active Twitter presence you can use it promote your event. Make sure that any event related tweets contain your event hashtag in them. When your event comes people may tweet using the hashtag about your event if it's posted publicly. To get more publicity always ask others to share it. Event tweets can range from a variety of topics and you should mix it up. You can use it for small announcements to introduce new event details, new speakers, new sponsors, or answer questions that you're getting a lot of. Instagram If you're not active on Instagram you may want to consider it. Simply posting a picture of something cool with your event Hashtag along with other relevant Hashtags is just another way to get in front of your audience. If you have the time and resources, don't miss out and invest some resources into this. During and after the event During the event you probably have enough to worry about. However don't be shy and during any public announcements make sure to remind people to Check In, Take Photos, Use the Hashtag and get the word out. Some review websites allow you to solicit them but others like Yelp are very clear on this policy. They say \"Don't Ask For Reviews\". If you're trying to get Yelp Reviews of your business from your event the best thing you can do is post public signs with Yelp's logo at your event. There are also some offline things you can do at the event that can help you increase your reach for future events. Make sure to sign people up for a mailing list if they're willing. If you can get there permission to email them you can create a list of event attendees and market directly to them. This will come in handy after the event as you can email them and ask them how they liked the event. At my company we host monthly Meetup events. Below is a real world example of how we can actively get reviews just by hosting an event. How can you get these reviews? It's simple, really. Do you remember the email addresses you collected? We are going to use these emails to find out how attendees liked the event. Many customers like giving feedback and they're just looking for an outlet to share their opinion. There is a way to allow everyone to give their feedback and guide them where you want them. For this I suggest you sign up for Get Five Stars from Mike Blumenthal. This service makes it easy to contact customers and attendees and guide them where you want them. For example, people that have a complaint can be guided to send their feedback directly to you (instead of venting online) and if they're happy it provides a place where they can leave a positive review on your Yelp, G+, etc.. You can also learn what you need to improve from the feedback you get from customers.In closing Obviously there were many specific topics I tried to cover in this post that I can elaborate greatly on. I hope to publish supplemental updates on more of the complex ideas here soon. In the mean time I hope this gets you started and provided enough creative energy for you to come up with a plan to market your ultimate event. If you found this useful please Follow Me @CaseyMeraz on Twitter or buy me a beer when you meet me in person :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Local Event Marketing: Earn Links, Build Citations, Get Reviews, Increase Foot Traffic, and Win at Local SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Local Event Marketing: Earn Links, Build Citations, Get Reviews, Increase Foot Traffic, and Win at Local SEO"
    },
    {
      "level": "H3",
      "text": "How to market your event and get the word out\r\n(and get foot traffic, links, likes, citations, and mentions)"
    },
    {
      "level": "H4",
      "text": "Method #1: Start by posting your event everywhere you can"
    },
    {
      "level": "H4",
      "text": "Method #2: Talk to local news outlets"
    },
    {
      "level": "H4",
      "text": "Method #3: Send an email newsletter"
    },
    {
      "level": "H4",
      "text": "Method #4: Create a marketing video"
    },
    {
      "level": "H4",
      "text": "Method #5: Take advantage of your Yext featured message (if applicable)"
    },
    {
      "level": "H4",
      "text": "Method #6: Serve ads to similar event attendees and after the event"
    },
    {
      "level": "H4",
      "text": "Method #7: Consider SMS push notifications"
    },
    {
      "level": "H4",
      "text": "Method #8: Partner with local organizations like your chamber of commerce"
    },
    {
      "level": "H4",
      "text": "Method #9: Have your sponsors promote your event"
    },
    {
      "level": "H3",
      "text": "Now lets step up the social game"
    },
    {
      "level": "H4",
      "text": "Things you should do"
    },
    {
      "level": "H4",
      "text": "Things you should not do"
    },
    {
      "level": "H4",
      "text": "Think long and hard about defining and segmenting your audience"
    },
    {
      "level": "H4",
      "text": "Where can you find these groups?"
    },
    {
      "level": "H3",
      "text": "During and after the event"
    },
    {
      "level": "H3",
      "text": "How can you get these reviews?"
    },
    {
      "level": "H3",
      "text": "In closing"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Casey Meraz\n          \n            Casey Meraz\n          \n            Casey Meraz"
}