{
  "url": "https://moz.com/blog/local-seo-cheat-sheet",
  "slug": "local-seo-cheat-sheet",
  "title": "Download the SEO's Local Search Cheat Sheet! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Whether you’ve just made a new hire at your agency, or your team simply wants to save time by having the most common local SEO resources, FAQs, and solutions all in one spot, the SEO’s Local Search Cheat Sheet is free to download and easy to print and share.",
  "content": "Download the SEO's Local Search Cheat Sheet! Moz Tools | Local SEO By: Miriam Ellis June 24, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis June 24, 2020 Download the SEO's Local Search Cheat Sheet! Moz Tools | Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. What a juggling feat your SEO agency pulls off every day! On your best days, you’re keeping: Team members and clientsAll the moving marketing parts ...in constant, useful motion. On your worst days, though, mistakes happen when: Communication breaks downStandard procedures aren’t understood company-widePeople feel rushed No local SEO agency or in-house SEO wants to waste time and resources on a scenario like building a GMB listing for a business model that’s ineligible, pushing out incorrect NAP because it wasn’t vetted by the right department, or having to contact a client multiple times because the onboarding process wasn’t thorough enough to get all the information needed in a single step. Maybe worse yet, giving the wrong advice to a client is embarrassing and undermines retention. Nobody’s perfect, and the best SEOs will drop a few balls here and there, but it helps build confidence to know you have the answers to marketing FAQs at your fingertips. Share a sheet — save time and hassle! Whether you’ve just made a new hire at your agency, or your team simply wants to save time by having the most common local SEO resources, FAQs, and solutions all in one spot, the SEO’s Local Search Cheat Sheet is free to download and easy to print and share. Maybe your agency is just starting to move into the local search marketing space, and this resource can be a supportive guide for the path ahead. Tack it up in your workspace, put it on the company fridge, or include it in your training process for incoming employees. It’s amazing how a visible reminder can jog your memory and prevent avoidable mistakes, plus make work faster and easier. Download the SEO's Local Search Cheat Sheet How your team will get value from this sheet I’ve been working in the local SEO space for more than fifteen years. My head sometimes feels like an overstuffed filing cabinet of marketing protocols. I can’t remember absolutely everything, and the amount of information you have to keep track of to market your local clients is pretty staggering. From Google’s guidelines and their continuous release of new features, to general best practices for listings, websites, and reviews, to managing client to-dos, SEOs have to bring great presence of mind to every team meeting and every client consultation. What I’ve done in this cheat sheet is create a basic aid that covers the practices and questions that land on my desk with the greatest frequency. Pin this up by your own desk as a handy reference covering: Client onboarding checklistGoogle My Business eligibility/ineligibility at a glanceTop Google support and reporting linksWebsite checklistReputation and review tipsRanking failure troubleshooting stepsKey local SEO concepts, explainedAnd more! By consolidating all of this information into a single resource, I hope you can reduce vital tasks being overlooked, mishandled, or even just taking longer than they should. Moz knows that organization is key to every agency’s success, and we hope you’ll distribute this cheat sheet widely to make local SEO work simpler and better for everyone on your team. Download the SEO's Local Search Cheat Sheet Love cheat sheets? Check out our updated Web Developer's SEO Cheat Sheet as well! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Download the SEO's Local Search Cheat Sheet!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Download the SEO's Local Search Cheat Sheet!"
    },
    {
      "level": "H2",
      "text": "Share a sheet — save time and hassle!"
    },
    {
      "level": "H2",
      "text": "How your team will get value from this sheet"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "Moz AI: Introducing Augmented Intelligence"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}