{
  "url": "https://moz.com/blog/local-listing-an-attempt-to-understand-rank-factors",
  "slug": "local-listing-an-attempt-to-understand-rank-factors",
  "title": "Local Listing: An Attempt to Understand Rank Factors - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Local listing rank has become a very large part of SEO over the past years and is becoming more so as Google improves their algorithm and displays the map 10 pack on more and more searches.  With few good resources on the web (http://www.davidmihm.com/local-search-ranking-factors.shtml is great but…",
  "content": "Local Listing: An Attempt to Understand Rank Factors Local SEO T By: Tim Sorweid October 8, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! T By: Tim Sorweid October 8, 2009 Local Listing: An Attempt to Understand Rank Factors Local SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Local listing rank has become a very large part of SEO over the past years and is becoming more so as Google improves their algorithm and displays the map 10 pack on more and more searches. With few good resources on the web (http://www.davidmihm.com/local-search-ranking-factors.shtml is great but starting to become out of date), I decided to take an indepth look into local searches for some of my clients as well as that for my business to see if I could put my finger on which facet of the local listing Google values the most in its algorithm. The factors that I looked at were items that the business owner can control in their listing such as location in the title of the listing (ie: San Diego SEO) product in the title of the listing (ie: San Diego SEO) location in the description of the the listing (ie: Online Advertising San Diego SEO and PPC Bid Management) product in the description of the the listing (ie: Online Advertising San Diego SEO and PPC Bid Management) Photos Videos And I also looked at factors that are out of the business owner's control which Google associates with your listing such as Reviews User content Web Sites (how google chooses these sites is a discussion continued below) Miles the business is located from the city center I selected two competitive markets, San Diego Acupuncture & San Diego SEO as well as one of my client's field which is not very competitive, San Diego Resume. First up, analysis on 'San Diego Acupuncture' Keywords entered into business listing First off this is a very competitive market, and you'll note that only one of the top 10 has 'San Diego' location in the title of their listing. There used to be a time when the title was pretty much the only major factor in the ranking of a local listing, but this time as recently passed as Google is improving their listing algorithm. This factor was being exploited and you'd see full sentences of keywords spamming the title of the listing, but obviously we knew this wouldn't last. Quantifiable Listing Facts The Google controlled aspects of the listing seem to be all over the board but, lets look at some general averages. avg # web sites for top 3: 9.666 avg # web sites for bottom 3: 11.333 avg # user content for top 3: 2 avg # user content for bottom 3: 1.333 avg # reviews for top 3: 5.333 avg # reviews for bottom 3: 1.333 avg distance for top 3: 2.7 avg distance for bottom 3: 2.9 So what's most important? There's a higher number of average reviews for the top 3 than the bottom, but the #1 listing for 'San Diego Acupuncture' has none! Distance from the city center seems pretty consistent and average # of user content items is pretty close, so what kind of information can you derive from this? Well lets keep moving onto the next case study and I'll tie it all in at the end. Here is the data analysis for 'San Diego SEO', my competition. (my site is #7 in this list) Keywords entered into business listing As expected, the user controlled aspects of the top 10 local listings are pretty well optimized across the board so the true differences must be in the Google controlled aspects, correct? Quantifiable Listing Facts avg # web sites for top 3: 5 avg # web sites for bottom 3: 2.6 avg user content for top 3: .666 avg user content for bottom 3: 0 avg # reviews for top 3: 2 avg # reviews for bottom 3: 1 avg distance for top 3: 1.633 avg distance for bottom 3 7.1 One thing sticks out here, but its an anomally. The #1 ranked listing doesn't have the most reviews, user content, or web pages associated with the account. To complete the confusion, the business owner has provided no pictures & video and some of his reviews are negative. In general the listings with the most sites associated with them find their way to the top, but thats not always the case. Let's look at one last case study and I'll bring it all home. Here is the data for 'San Diego Resume', a low competition market in this region. Keywords entered into business listing As you can see, these listings are not very well optimized by the business owners and in fact (not shown above), some of them aren't even resume services but are staffing agencies. Quantifiable Listing Facts avg # web sites for top 3: 6 avg # web sites for bottom 3: 1 avg user content for top 3: 1 avg user content for bottom 3: 0 avg # reviews for top 3: 1 avg # reviews for bottom 3:0 avg distance for top 3: 5.6 avg distance for bottom 3: 3.1 Ok, this most recent data at least provides me with some useful information on how google works in uncompetitive markets. You'll notice lumps of green for user content and web pages near the top of rankings. You'll also notice that location to city center isn't that large of an indicator for higher rank. Discussion and Conclusion So if you've made it this far, here's where you're hoping that I provide some brilliant insight of how to improve you and your clients' local listings. Well, the bad news is there is no clear winner for the most important category of a local listing, but I have learned quite abit about how local listings work and how Google's algorithm is changing and I will provide you with a list of tips that will help you improve your listings. There are other potential factors which are hard to quantify such as age of listing which I simply can't comment on and I have read things about Google placing higher rank on reviews that are created with Google Users who have detailed user profiles but in my practice have not noticed this to make a lick of difference. Tips to improve your listings Provide as much info to Google when you claim and fill out your local listing. Title is most important of the user controlled facets of the listing and must have your keywords in it, though its overall weight is declining. That said be care of spamming, Google will eventually streamline this further and you don't want to be on the outside looking in. No need to put your city in the title, Google is smart enough to know where your business is located with your provided address. keywords and location in your description will help but not much. And here's the most important thing you can do to improve your business listing. Submit your website info to as many local directories as possible (ie, yelp.com, kudzu.com, yellowpages.com, etc) The more sophisticated Google's local algorithm becomes the more value they place on content generated by the community and the less they value what the business owner tells them. The reason is simple: relying on business owners' info allows spam to creep into the results and its hard to spam across mutiple 3rd party sources of information. From these 3rd party sources, Google can derive reviews, images, videos, user content, webpages and more to help complete your local listing in their system. As in organic SEO, more is not always better. Some sites like bbb.org are valued higher by Google and being listed in their directories will go a long way to improve your rank. For uncompetitive markets, you may be able to get away with keywords in titles, descriptions, and a few made up reviews but that will simply not be enough when competiting against sites that can have a great presnce across the web in places like yelp. Of course, this makes optimizing your listing a time consuming process and one that is generally out of your control. Google takes a long time to associate external content to your listing (I've been waiting for months) and has been known to associate incorrect information to your business listing occasionally. Also I had 3 'web sites' recently disassociated with my business listing, though they were all valid and they have yet to return. Always remember that Google's listing algorithm is rapidly changing and what works one day may be worthless the next. If you have a listing that you know you've gotten to rank well due to spam I highly recommend taking a hard look in the mirror and making the decision to come clean because you will get busted and it won't be pretty when it happens. I hope this helps you guys as you try to help your clients as well as your own listing. If you read this far I'm impressed. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Local Listing: An Attempt to Understand Rank Factors"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Local Listing: An Attempt to Understand Rank Factors"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Tim Sorweid\n          \n            Tim Sorweid"
}