{
  "url": "https://moz.com/blog/local-search-marketing-industry-survey-2018",
  "slug": "local-search-marketing-industry-survey-2018",
  "title": "Take the 2018 Moz Local Search Marketing Industry Survey - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Have insights to share about your experience with local SEO? Share your industry knowledge and be entered for a chance to win a $100 Amazon gift card!",
  "content": "Take the 2018 Moz Local Search Marketing Industry Survey Local SEO | Marketing Industry By: Miriam Ellis August 6, 2018 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis August 6, 2018 Take the 2018 Moz Local Search Marketing Industry Survey Local SEO | Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Local search marketing is a dynamic and exciting discipline, but like many digital professions, it can be a bit isolating. You may find yourself running into questions that don't have a ready answer, things like... What sort of benchmarks should I be measuring my daily work by? Do my clients’ needs align with what my colleagues are seeing? Am I over/undervaluing the role of Google in my future work? Here’s a chance to find out what your peers are observing and doing on a day-to-day basis. The Moz Local Search Marketing Industry Survey will dive into job descriptions, industries served, most effective tactics, tool usage, and the non-stop growth of Google’s local features. We'll even touch on how folks may have been impacted by the recent August 1 algorithm update, if at all. In-house local SEOs, agency local SEOs, and other digital marketers are all welcome! All participants will be entered into a drawing for a $100 Amazon gift card. The winner will be notified on 8/27/18.Give just 5 minutes of your time and you’ll get insights and quotable statistics back when we publish the survey results. Be sure to participate by 8/24/2018. We sincerely appreciate your contributions!The 2018 Local Search Marketing Industry Survey is now closed. We look forward to sharing the results with you in the coming weeks — stay tuned! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Take the 2018 Moz Local Search Marketing Industry Survey"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Take the 2018 Moz Local Search Marketing Industry Survey"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}