{
  "url": "https://moz.com/blog/long-term-visitor-tracking",
  "slug": "long-term-visitor-tracking",
  "title": "Long Term Visitor Tracking - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "At nearly every SES conference, I hear it mentioned that analytics must track 60-90 days out in order to maintain a close watch on latent visits and conversions. In a meeting I had today with a large non-profit based website, the issue of latent tracking over the longer term came up... My question…",
  "content": "Long Term Visitor Tracking SEO Analytics By: Rand Fishkin May 2, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 2, 2006 Long Term Visitor Tracking SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. At nearly every SES conference, I hear it mentioned that analytics must track 60-90 days out in order to maintain a close watch on latent visits and conversions. In a meeting I had today with a large non-profit based website, the issue of latent tracking over the longer term came up... My question is - is it valuable to track via IP address over the long haul (100-300 days) or are the changing IPs of many ISPs making that data largely irrelevant? Does anyone here track over the very long term and what results have you seen? Are there significant percentages of visitors that do return for a conversion or action of any kind after 3-4 months? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Long Term Visitor Tracking"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Long Term Visitor Tracking"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}