{
  "url": "https://moz.com/blog/long-tail-keyword-research-for-the-broke-unpopular",
  "slug": "long-tail-keyword-research-for-the-broke-unpopular",
  "title": "Long Tail Keyword Research for the Broke & Unpopular - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Here are few of my favorite places to look for long tail keywords if your company is not getting the traffic, or is getting the dreaded (not provided) from Google.",
  "content": "Long Tail Keyword Research for the Broke & Unpopular Keyword Research By: chris kent October 9, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: chris kent October 9, 2012 Long Tail Keyword Research for the Broke & Unpopular Keyword Research This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. This is my first post in YouMoz, so be gentle. I figured it was time to start giving back to the community that I've gotten so much from. Long ago (at least in the SEO world that is) it was established that long tail keywords have less competition, and the people who are using them are further along in the buying process. Once the SEO community fully grasped and accepted this fact, article after article came out detailing how to find long tail keyword words. This was even accompanied by a few tools like hittail, which uses your real time analytics to find long tail keywords. The majority of strategies for finding involved looking at your analytics data and webmaster tools to find exactly which terms were bringing people to your site, starting AdWords campaign with largely broad match keywords and low bids, and there are even some excellent articles on YouMoz that talk about patterns in your long tail search terms. These are all great strategies, but they make some assumptions that may not hold up for your business, or your latest client. These strategies work with websites that have at least a little bit of budget to put into AdWords, or that are receiving traffic from Google. However, there is always that one client or business that is either brand new or in the pit of SEO doom, that has neither of those things. I have worked with more than one company in those situations, and as valuable as the long tail is, it means nothing to your company if you can't find them. Here are few of my favorite places to look if your company is not getting the traffic, or is getting the dreaded (not provided) from Google. Customer service e-mails/sales e-mails/ conversations - Unless your product is ridiculously simple, or you are incredibly talented at portraying important information about your product, you will probably get questions about it. These may come via email, phone, or in face-to-face conversations with customers or clients. If you're company is big enough to have a support staff, talk to them. See if they get any questions repeatedly. If you do not have a staff, look through e-mails with clients/see if you can get access to those e-mails if you are consulting. My rule of thumb is that if a phrase shows up more than twice from different customers, it's going on the list. Forums - Forums are great places to pick up long tail keywords. Look for threads regarding your product, your short tail keywords, or the problem your product solves. Once you have a few threads, begin looking through the posts on each thread. Unfortunately there are no tools I know out there to create phrase clouds (hint hint to all the would-be developers). Just like with the sales e-mails, look for repeat phrases in different posts. Typically with forums I like to see a little bit more repetition before I add it to the list. This is simply because sometimes people are just talking, not necessarily solving a problem or seeking help. I would say five or more repetitions makes it onto the list. Social Media - Places like twitter, LinkedIn, and Facebook are great for finding long tail keywords. Why? Because people express needs and thoughts publicly. It used to be really hard to see what someone is thinking. Now just check their last tweet. A few great places to look are your twitter followers, your Facebook followers, your competitors' Facebook followers, your competitors' twitter followers, popular hashtags, fan pages on Facebook, and groups that pertain to your target audience on LinkedIn. Statuses, tweets, and posts are ripe with long tail keywords. FAQs - FAQs are frequently asked, which means someone asked the questions enough times to get put up on a website. Again there is no tool that I am aware of to pull phrases out of web pages(cough cough opportunity cough cough), but use your discretion. Check competitors' websites, your own website, even check business that may not be in your industry, but may be related to your industry. These are more than just great place to find long tail keywords. Sites I've worked with have ranked and gotten valuable traffic just by having those keywords in text. There it is: long tail keyword research that doesn't require an AdWords account or a lot of traffic. Hopefully you can use these techniques to find valuable long tail keywords, and get some valuable traffic from them. Where do you look for long tail keywords? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Long Tail Keyword Research for the Broke & Unpopular"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Long Tail Keyword Research for the Broke & Unpopular"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "chris kent\n          \n            chris kent\n          \n            chris kent"
}