{
  "url": "https://moz.com/blog/long-tail-search-or-the-story-of-unintentional-seo-why-a-lot-of-content-is-good",
  "slug": "long-tail-search-or-the-story-of-unintentional-seo-why-a-lot-of-content-is-good",
  "title": "Long Tail Search, or The Story of Unintentional SEO - Why A Lot of Content Is Good - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Most of us know the basics of long tail searches.  I am reminded of this every month when I am checking the statistics on my web sites and I see the wide variety of referring search phrases.On some of my sites, these search phrases are very narrowly defined.  Good for me - my content is on target.…",
  "content": "Long Tail Search, or The Story of Unintentional SEO - Why A Lot of Content Is Good Content Marketing V By: Vinny Goldsmith October 1, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! V By: Vinny Goldsmith October 1, 2007 Long Tail Search, or The Story of Unintentional SEO - Why A Lot of Content Is Good Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Most of us know the basics of long tail searches. I am reminded of this every month when I am checking the statistics on my web sites and I see the wide variety of referring search phrases. On some of my sites, these search phrases are very narrowly defined. Good for me - my content is on target. But the more varied your content, the more varied the resulting search phrases. On one of my personal sites I write about anything and everything under the sun, whatever it might be. One day it could be a rant about the local school board, the next it could be a commentary on a recent graphic novel. I'm all over the place. It's MY site. No commercial intent whatsoever. Not even a block of Adsense. It is also a neglected site. I only post to it periodically. And, out of frustration, I abandoned a rather striking design and reverted to whatever standard ugly template ships with MovableType. However, this month I discovered that, completely inadvertently, one of my pages is ranking in the #1 or #2 position for what I would consider a fairly desirable commercial term (along the lines of: St. Louis jewelers). This is the result of a strange joining of words in my website that I didn't intend to mean what I believe the searchers are looking for. I probably won't do anything with this, but the opportunity is there. Whether I wanted to place ads on the page as it is or 301 it to something a little more commercial, there are definitely options available to me. None of this would have been possible if it weren't for just regular run-of-the-mill content. I wasn't writing for a search engine. I wasn't worried about keyword density - or even keywords at all. I was just writing about something in the news that reminded me of a Batman storyline. Combine that with some other phrases on my blog and I'm getting a huge amount of unintended traffic. I almost feel an obligation to the people the search engines are sending my way. If nothing else, I should at least list some alternate sites where they might find what they are looking for. I've had the same thing happen on other sites where all I did was post industry-related press releases. No editing on my part. Just press release after press release. Occasionally, once every 10 entries or so, I'd link to some relevant article in a newspaper. But other than that - I did nothing. (I wasn't doing anything nefarious - I was just seeding the site hoping to get it indexed and out of the sandbox for when I was ready for it.) Because of duplicate content issues and the like - I was sure this wouldn't result in anything. But I was wrong again. Search engines love content and they'll return it when a search is done for some klunky but relevant phrase. As a result, long tail searches outnumber narrower searches all day long. And my traffic has grown accordingly. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Long Tail Search, or The Story of Unintentional SEO - Why A Lot of Content Is Good"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Long Tail Search, or The Story of Unintentional SEO - Why A Lot of Content Is Good"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Vinny Goldsmith\n          \n            Vinny Goldsmith"
}