{
  "url": "https://moz.com/blog/long-term-link-value-content-marketing",
  "slug": "long-term-link-value-content-marketing",
  "title": "The Long-Term Link Acquisition Value of Content Marketing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The long tail of link building holds a wealth of value, but you might not know it unless you've done the analysis. Luckily for us, Fractl did — here are the results.",
  "content": "The Long-Term Link Acquisition Value of Content Marketing Content Marketing | Marketing Industry | Link Building By: Kristin Tynski August 29, 2018 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Kristin Tynski August 29, 2018 The Long-Term Link Acquisition Value of Content Marketing Content Marketing | Marketing Industry | Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Recently, new internal analysis of our work here at Fractl has yielded a fascinating finding: Content marketing that generates mainstream press is likely 2X as effective as originally thought. Additionally, the long-term ROI is potentially many times higher than previously reported. I’ll caveat that by saying this applies only to content that can generate mainstream press attention. At Fractl, this is our primary focus as a content marketing agency. Our team, our process, and our research are all structured around figuring out ways to maximize the newsworthiness and promotional success of the content we create on behalf of our clients. Though data-driven content marketing paired with digital PR is on the rise, there is still a general lack of understanding around the long-term value of any individual content execution. In this exploration, we sought to answer the question: What link value does a successful campaign drive over the long term? What we found was surprising and strongly reiterated our conviction that this style of data-driven content and digital PR yields some of the highest possible ROI for link building and SEO. To better understand this full value, we wanted to look at the long-term accumulation of the two types of links on which we report: Direct links from publishers to our client’s content on their domain Secondary links that link to the story the publisher wrote about our client’s content While direct links are most important, secondary links often provide significant additional pass-through authority and can often be reclaimed through additional outreach and converted into direct do-follow links (something we have a team dedicated to doing at Fractl). Below is a visualization of the way our content promotion process works: So how exactly do direct links and secondary links accumulate over time?To understand this, we did a full audit of four successful campaigns from 2015 and 2016 through today. Having a few years of aggregation gave us an initial benchmark for how links accumulate over time for general interest content that is relatively evergreen. We profiled four campaigns: Perceptions of Perfection Across Borders America’s Most P.C. and Prejudiced Places Reverse-Photoshopping Video Game Characters Water Bottle Germs Revealed The first view we looked at was direct links, or links pointing directly to the client blog posts hosting the content we’ve created on their behalf. There is a good deal of variability between campaigns, but we see a few interesting general trends that show up in all of the examples in the rest of this article: Both direct and secondary links will accumulate in a few predictable ways: A large initial spike with a smooth decline A buildup to a large spike with a smooth decline Multiple spikes of varying size Roughly 50% of the total volume of links that will be built will accumulate in the first 30 days. The other 50% will accumulate over the following two years and beyond. A small subset of direct links will generate their own large spikes of secondary links. We'll now take a look at some specific results. Let’s start by looking at direct links (pickups that link directly back to our client’s site or landing page). The typical result: A large initial spike with consistent accumulation over timeThis campaign, featuring artistic imaginings of what bodies in video games might look like with normal BMI/body sizes, shows the most typical pattern we witnessed, with a very large initial spike and a relatively smooth decline in link acquisition over the first month. After the first month, long-term new direct link acquisition continued for more than two years (and is still going today!). The less common result: Slow draw up to a major spikeIn this example, you can see that sometimes it takes a few days or even weeks to see the initial pickup spike and subsequent primary syndication. In the case of this campaign, we saw a slow buildup to the pinnacle at about a week from the first pickup (exclusive), with a gradual decline over the following two weeks. \"These initial stories were then used as fodder or inspiration for stories written months later by other publications.\"Zooming out to a month-over-month view, we can see resurgences in pickups happening at unpredictable intervals every few months or so. These spikes continued up until today with relative consistency. This happened as some of the stories written during the initial spike began to rank well in Google. These initial stories were then used as fodder or inspiration for stories written months later by other publications. For evergreen topics such as body image (as was the case in this campaign), you will also see writers and editors cycle in and out of writing about these topics as they trend in the public zeitgeist, leading to these unpredictable yet very welcomed resurgences in new links. Least common result: Multiple spikes in the first few weeksThe third pattern we observed was seen on a campaign we executed examining hate speech on Twitter. In this case, we saw multiple spikes during this early period, corresponding to syndications on other mainstream publications that then sparked their own downstream syndications and individual virality. Zooming out, we saw a similar result as the other examples, with multiple smaller spikes more within the first year and less frequently in the following two years. Each of these bumps is associated with the story resurfacing organically on new publications (usually a writer stumbling on coverage of the content during the initial phase of popularity). Long-term resurgencesFinally, in our fourth example that looked at germs on water bottles, we saw a fascinating phenomenon happen beyond the first month where there was a very significant secondary spike. This spike represents syndication across (all or most) of the iHeartRadio network. As this example demonstrates, it isn’t wholly unusual to see large-scale networks pick up content even a year or later that rival or even exceed the initial month’s result. Aggregate trends \"50% of the total links acquired happened in the first month, and the other 50% were acquired in the following two to three years.\"When we looked at direct links back to all four campaigns together, we saw the common progression of link acquisition over time. The chart below shows the distribution of new links acquired over two years. We saw a pretty classic long tail distribution here, where 50% of the total links acquired happened in the first month, and the other 50% were acquired in the following two to three years. \"If direct links are the cake, secondary links are the icing, and both accumulate substantially over time.\" Links generated directly to the blog posts/landing pages of the content we’ve created on our clients’ behalf are only really a part of the story. When a campaign garners mainstream press attention, the press stories can often go mildly viral, generating large numbers of syndications and links to these stories themselves. We track these secondary links and reach out to the writers of these stories to try and get link attributions to the primary source (our clients’ blog posts or landing pages where the story/study/content lives). These types of links also follow a similar pattern over time to direct links. Below are the publishing dates of these secondary links as they were found over time. Their over-time distribution follows the same pattern, with 50% of results being realized within the first month and the following 50% of the value coming over the next two to three years. The value in the long tailBy looking at multi-year direct and secondary links built to successful content marketing campaigns, it becomes apparent that the total number of links acquired during the first month is really only about half the story. For campaigns that garner initial mainstream pickups, there is often a multi-year long tail of links that are built organically without any additional or future promotions work beyond the first month. While this long-term value is not something we report on or charge our clients for explicitly, it is extremely important to understand as a part of a larger calculus when trying to decide if doing content marketing with the goal of press acquisition is right for your needs. Cost-per-link (a typical way to measure ROI of such campaigns) will halve if links built are measured over these longer periods — moving a project you perhaps considered a marginal success at one month to a major success at one year. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Long-Term Link Acquisition Value of Content Marketing"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Long-Term Link Acquisition Value of Content Marketing"
    },
    {
      "level": "H3",
      "text": "Content marketing that generates mainstream press is likely 2X as effective as originally thought. Additionally, the long-term ROI is potentially many times higher than previously reported."
    },
    {
      "level": "H2",
      "text": "So how exactly do direct links and secondary links accumulate over time?"
    },
    {
      "level": "H3",
      "text": "The typical result: A large initial spike with consistent accumulation over time"
    },
    {
      "level": "H3",
      "text": "The less common result: Slow draw up to a major spike"
    },
    {
      "level": "H3",
      "text": "\"These initial stories were then used as fodder or inspiration for stories written months later by other publications.\""
    },
    {
      "level": "H3",
      "text": "Least common result: Multiple spikes in the first few weeks"
    },
    {
      "level": "H3",
      "text": "Long-term resurgences"
    },
    {
      "level": "H2",
      "text": "Aggregate trends"
    },
    {
      "level": "H3",
      "text": "\"50% of the total links acquired happened in the first month, and the other 50% were acquired in the following two to three years.\""
    },
    {
      "level": "H3",
      "text": "\"If direct links are the cake, secondary links are the icing, and both accumulate substantially over time.\""
    },
    {
      "level": "H2",
      "text": "The value in the long tail"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kristin Tynski\n          \n            Kristin Tynski"
}