{
  "url": "https://moz.com/blog/long-click-and-the-quality-of-search-success",
  "slug": "long-click-and-the-quality-of-search-success",
  "title": "The Long Click and the Quality of Search Success - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A recent patent filing from Google offers hints about the long click, and in this post Bill Slawski helps decode the legalese.",
  "content": "The Long Click and the Quality of Search Success Technical SEO | Advanced SEO By: Bill Slawski May 21, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Bill Slawski May 21, 2015 The Long Click and the Quality of Search Success Technical SEO | Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. \"On the most basic level, Google could see how satisfied users were. To paraphrase Tolstoy, happy users were all the same. The best sign of their happiness was the \"Long Click\" — This occurred when someone went to a search result, ideally the top one, and did not return. That meant Google has successfully fulfilled the query.\" ~ Steven Levy. In the Plex: How Google Thinks, Works, and Shapes our Lives I often explore and read patents and papers from the search engines to try to get a sense of how they may approach different issues, and learn about the assumptions they make about search, searchers, and the Web. Lately, I've been keeping an eye open for papers and patents from the search engines where they talk about a metric known as the \"long click.\" A recently granted Google patent uses the metric of a \"Long Click\" as the center of a process Google may use to track results for queries that were selected by searchers for long visits in a set of search results. This concept isn't new. In 2011, I wrote about a Yahoo patent in How a Search Engine May Measure the Quality of Its Search Results, where they discussed a metric that they refer to as a \"target page success metric.\" It included \"dwell time\" upon a result as a sign of search success (Yes, search engines have goals, too). Another Google patent described assigning web pages \"reachability scores\" based upon the quality of pages linked to from those initially visited pages. In the post Does Google Use Reachability Scores in Ranking Resources? I described how a Google patent that might view a long click metric as a sign to see if visitors to that page are engaged by the links to content they find those links pointing to, including links to videos. Google tells us in that patent that it might consider a \"long click\" to have been made on a video if someone watches at least half the video or 30 seconds of it. The patent suggests that a high reachability score on a page may mean that page could be boosted in Google search results. But the patent I'm writing about today is focused primarily upon looking at and tracking a search success metric like a long click or long dwell time. Here's the abstract: Modifying ranking data based on document changes Invented by Henele I. Adams, and Hyung-Jin Kim Assigned to Google US Patent 9,002,867 Granted April 7, 2015 Filed: December 30, 2010 Abstract Methods, systems, and apparatus, including computer programs encoded on computer storage media for determining a weighted overall quality of result statistic for a document. One method includes receiving quality of result data for a query and a plurality of versions of a document, determining a weighted overall quality of result statistic for the document with respect to the query including weighting each version specific quality of result statistic and combining the weighted version-specific quality of result statistics, wherein each quality of result statistic is weighted by a weight determined from at least a difference between content of a reference version of the document and content of the version of the document corresponding to the version specific quality of result statistic, and storing the weighted overall quality of result statistic and data associating the query and the document with the weighted overall quality of result statistic. This patent tells us that search results may be be ranked in an order, according to scores assigned to the search results by a scoring function or process that would be based upon things such as: Where, and how often, query terms appear in the given document, How common the query terms are in the documents indexed by the search engine, or A query-independent measure of quality of the document itself. Last September, I wrote about how Google might identify a category associated with a query term base upon clicks, in the post Using Query User Data To Classify Queries. In a query for \"Lincoln.\" the results that appear in response might be about the former US President, the town of Lincoln, Nebraska, and the model of automobile. When someone searches for [Lincoln], Google returning all three of those responses as a top result could be said to be reasonable. The patent I wrote about in that post told us that Google might collect information about \"Lincoln\" as a search entity, and track which category of results people clicked upon most when they performed that search, to determine what categories of pages to show other searchers. Again, that's another \"search success\" based upon a past search history.There likely is some value in working to find ways to increase the amount of dwell time someone spends upon the pages of your site, if you are already having some success in crafting page titles and snippets that persuade people to click on your pages when they those appear in search results. These approaches can include such things as: Making visiting your page a positive experience in terms of things like site speed, readability, and scannability. Making visiting your page a positive experience in terms of things like the quality of the content published on your pages including spelling, grammar, writing style, interest, quality of images, and the links you share to other resources. Providing a positive experience by offering ideas worth sharing with others, and offering opportunities for commenting and interacting with others, and by being responsive to people who do leave comments. Here are some resources I found that discuss this long click metric in terms of \"dwell time\": Increasing Time-on-Page Through Aesthetics (Lessons Learned from PRWeb and BuildZoom - Two Large Content Sites) Dwell Time: The Most Important Metric You’re Not Measuring Four Branding Efforts that Can Increase User Dwell Time Your ability to create pages that can end up in a \"long click\" from someone who has come to your site in response to a query, is also a \"search success\" metric on the search engine's part, and you both succeed. Just be warned that as the most recent patent from Google on Long Clicks shows us, Google will be watching to make sure that the content of your page doesn't change too much, and that people are continuing to click upon it in search results, and spend a fair amount to time upon it.(Images for this post are from my Go Fish Digital Design Lead Devin Holmes @DevinGoFish. Thank you, Devin!) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Long Click and the Quality of Search Success"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Long Click and the Quality of Search Success"
    },
    {
      "level": "H3",
      "text": "Modifying ranking data based on document changes"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Bill Slawski\n          \n            Bill Slawski\n          \n            Bill Slawski"
}