{
  "url": "https://moz.com/blog/looking-to-bag-an-elephant-try-mozbait",
  "slug": "looking-to-bag-an-elephant-try-mozbait",
  "title": "Looking To Bag An Elephant? Try \"Mozbait\" - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "“I bagged the elephant!”, shrieks Bud Fox, the fledgling stockbroker from 1987’s “WallStreet”, after learning that he’s just landed financial mogul Gordon Gekko as his newest client.     So, how does Bud hook the top-dog in the highly competitive world of stock trading?  By raving about the value…",
  "content": "Looking To Bag An Elephant? Try \"Mozbait\" SEO Basics S By: SeanMaguire November 13, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! S By: SeanMaguire November 13, 2007 Looking To Bag An Elephant? Try \"Mozbait\" SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. “I bagged the elephant!”, shrieks Bud Fox, the fledgling stockbroker from 1987’s Wall Street, after learning that he’s just landed financial mogul Gordon Gekko as his newest client. So, how does Bud hook the top-dog in the highly competitive world of stock trading? By raving about the value of his company’s services? Throwing out a few killer stock tips? Dropping the names of existing reputable customers? The answer - none of the above. He does it through a combination of relentless persistence and delivering value. Bud wows Gekko with some information he got from his father – information that isn’t published in the newspapers. The information has, in a word, VALUE. The result? Bud quickly becomes Gekko's right-hand man. Wouldn’t you love to become your most prized target’s right hand (wo)man? We all know just how hard it can be to win new clients. It usually takes a “special something,” just to gain their attention. That’s where “Mozbait” comes in. It’s that special something that lures your target into taking the next step. Right about now you might be thinking, “Ok, I get it. But what is Mozbait and where can I get me some?” Glad you asked. Mozbait is the information that magically appears after we make an inquiry into one of the SEOmoz tools. It could be the results from a page strength query, indexed pages, strongest pages, term target report, etc. For you and me this information is very easy to obtain. For many companies constantly striving to find ways to improve their business, it can be magical and it can be considered as holding great VALUE. Remember – don’t ever underestimate that what may be a simple task for you as the expert, can seem like a monumental effort to someone that isn’t. At the very least, the fact that you’ve taken proactive steps to help someone is usually viewed in a positive light. Have you ever gone fly-fishing? There’s a great analogy in there about landing customers. You tie what seems like a nice tasty fly to your line and beautifully cast it in a precise path above your target. You allow the stream to gracefully deliver it to your awaiting fish, whereby the only action the fish need take is to open its mouth and gulp it down. Yet time and again, the fish waits there, seemingly uninterested. You’re thinking, “Perhaps it’s not hungry.” (Actually, you’re probably just cursing the fish under your breath). More often than not, however, you’re simply serving up the wrong fly or a fly that doesn’t have enough meat on the bone. Regardless of the reason, to this fish, your fly doesn’t hold enough VALUE to take action. Conversely, serve up the fly she’s looking for and - WHAM! It’s a beautiful thing. You’ve just delivered VALUE, and delivering value is directly proportionate to winning customers. So, without further ado, here are my “Five Steps To Using Mozbait To Make Your Next Big Catch.” Step 1 Do some research about the target company. Look through their website, make note of the business they are in, their products and services, leadership team and background, mission and values, etc. Find out the names of one or two of their competitors. Make a quick assessment about what might be of value to them, relative to the current state of their website. Step 2 Run the term extractor on a key page or two to gain some insight into the terms they’re targeting (if any), and whether or not they are targeting effectively. I’ll usually also run the page strength, keyword difficulty on a term or two, and wrap it up with a term target report for a highly relevant keyword or two. Refine your assessment. Step 3 Compile the information into a neatly formatted report. Step 4 Prepare a short list of specific recommendations based on the information you’ve compiled. This will serve as the basis for a proposal. Step 5 Contact the prospect to deliver a value focused message that goes something like this: Hi Joe, I recently read the article in the business journal about the success of Joe’s Paint and your future growth plans. After visiting joespaint.com, I was impressed with the layout, aesthetics, and content of your site. I hope you don’t mind, but since I’m an expert in website search engine optimization (SEO) and internet marketing, I took the liberty of running some analysis to see if your site is optimized to drive traffic and convert your visitors to customers. It looks like your webmaster has done a nice job with the site; however, there appear to be several areas that, if addressed, will have a significant positive impact on both volume of traffic to your site and conversion rates. I’ve compiled a concise ten page report that will give you specific, high impact insight into the current effectiveness of your website, with detailed steps you can take to improve it. I’d like to suggest we meet (it will take about thirty minutes) to review the report results. I’ll also explain in layman’s terms the top 5 steps I would recommend you take to turn joespaint.com into a valuable asset that constantly works to bring in new customers. While the steps I will recommend are a service I can provide, you’re in no way obligated to work with us, of course. We’ll simply review the material and leave it to you to decide on next steps. If you decide to do nothing or even perhaps try to accomplish our recommendations in-house, you can keep the report and consider it our way of thanking you for your time. I’ll contact you tomorrow to see if we can schedule a convenient time to meet. In the interim, if you’re interested in seeing what our customers have to say about the quality of our services, just click here. Kindest Regards, Now, you might be thinking, “That sounds like a cheesy letter,\" or \"Why should I do all of this in advance of contacting a company? Why not just make the phone call, or send the generic email and then, if they show interest, run the reports?” Exactly how you go about doing it really isn't the point. There are a million ways to skin and fry a trout. The point is to leverage the resources and information you have at your disposal to deliver value and win new customers. What I’ve personally found is that by going through the research and report effort (it usually takes me about 30 minutes in total), I’m much better prepared to deliver a compelling and actionable message to my target. Subsequently, my win ratio is much higher. Depending on the company, I’ll usually contact the VP or Director of Marketing or Sales, and in some cases the CEO. Sometimes this is done on the phone, other times through email. It just depends. What’s important is to adopt an approach that piques their interest and to keep testing different approaches (different flies) until you find the ones that work best – the ones that deliver value and compel your target to bite. Chances are, you’ll find that the right combination of Mozbait delivered in the right way will get them on the hook more often than not. Oh, just one other thing – if you’re looking for a good stock tip, don’t tell anyone I told you this, but – “Blue Horse Shoe Loves Anacot Steel.” Happy fishing! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Looking To Bag An Elephant?  Try \"Mozbait\""
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Looking To Bag An Elephant?  Try \"Mozbait\""
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "SeanMaguire\n          \n            SeanMaguire"
}