{
  "url": "https://moz.com/blog/lost-anonymous-google-reviews",
  "slug": "lost-anonymous-google-reviews",
  "title": "Q&A: Lost Your Anonymous Google Reviews? The Scoop on Removal and Moving Forward - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If you lost anonymous \"A Google User\" reviews since late May, you probably have a few questions about why they were removed. Miriam Ellis is here to share answers on how this affects your review strategy and local SEO as a whole.",
  "content": "Q&A: Lost Your Anonymous Google Reviews? The Scoop on Removal and Moving Forward Local SEO | Search Engines By: Miriam Ellis June 21, 2018 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis June 21, 2018 Q&A: Lost Your Anonymous Google Reviews? The Scoop on Removal and Moving Forward Local SEO | Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Did you recently notice a minor or major drop in your Google review count, and then realize that some of your actual reviews had gone missing, too? Read on to see if your experience of removal review was part of the action Google took in late May surrounding anonymous reviews.Q: What happened?A: As nearly as I can pinpoint it, Google began discounting reviews left by “A Google User” from total review counts around May 23, 2018. For a brief period, these anonymous reviews were still visible, but were then removed from display. I haven’t seen any official announcement about this, to date, and it remains unclear as to whether all reviews designated as being from “A Google User” have been removed, or whether some still remain. I haven’t been able to discover a single one since the update.Q: How do I know if I was affected by this action?A: If, prior to my estimated date, you had reviews that had been left by profiles marked “A Google User,” and these reviews are now gone, that’s the diagnostic of why your total review count has dropped. Q: The reviews I’ve lost weren’t from “A Google User” profiles. What happened?A: If you’ve lost reviews from non-anonymous profiles, it’s time to investigate other causes of removal. These could include:Having paid for or incentivized reviews, either directly or via an unethical marketerReviews stemming from a review station/kiosk at your businessGetting too many reviews at onceURLs, prohibited language, or other objectionable content in the body of reviewsReviewing yourself, or having employees (past or present) do soReviews were left on your same IP (as in the case of free on-site Wi-Fi)The use of review strategies/software that prohibit negative reviews or selectively solicit positive reviewsAny other violation of Google’s review guidelinesA Google bug, in which case, check the GMB forum for reports of similar review loss, and wait a few days to see if your reviews return; if not, you can take the time to post about your issue in the GMB forum, but chances are not good that removed reviews will be reinstatedQ: Is anonymous review removal a bug or a test?A: One month later, these reviews remain absent. This is not a bug, and seems unlikely to be a test. Q: Could my missing anonymous reviews come back?A: Never say “never” with Google. From their inception, Google review counts have been wonky, and have been afflicted by various bugs. There have been cases in which reviews have vanished and reappeared. But, in this case, I don’t believe these types of reviews will return. This is most likely an action on Google’s part with the intention of improving their review corpus, which is, unfortunately, plagued with spam.Q: What were the origins of “A Google User” reviews?A: Reviews designated by this language came from a variety of scenarios, but are chiefly fallout from Google’s rollout of Google+ and then its subsequent detachment from local. As Mike Blumenthal explains:As recently as 2016, Google required users to log in as G+ users to leave a review. When they transitioned away from + they allowed users several choices as to whether to delete their reviews or to create a name. Many users did not make that transition. For the users that chose not to give their name and make that transition Google identified them as ” A Google User”…. also certain devices like the old Blackberry’s could leave a review but not a name. Also users left + and may have changed profiles at Google abandoning their old profiles. Needless to say there were many ways that these reviews became from “A Google User.”Q: Is the removal of anonymous reviews a positive or negative thing? What’s Google trying to do here?A: Whether this action has worked out well or poorly for you likely depends on the quality of the reviews you’ve lost. In some cases, the loss may have suddenly put you behind competitors, in terms of review count or rating. In others, the loss of anonymous negative reviews may have just resulted in your star rating improving — which would be great news!As to Google’s intent with this action, my assumption is that it’s a step toward increasing transparency. Not their own transparency, but the accountability of the reviewing public. Google doesn’t really like to acknowledge it, but their review corpus is inundated with spam, some of it the product of global networks of bad actors who have made a business of leaving fake reviews. Personally, I welcome Google making any attempts to cope with this, but the removal of this specific type of anonymous review is definitely not an adequate solution to review spam when the livelihoods of real people are on the line. Q: Does this Google update mean my business is now safe from anonymous reviews?A: Unfortunately, no. While it does mean you’re unlikely to see reviews marked as being from “A Google User”, it does not in any way deter people from creating as many Google identities as they’d like to review your business. Consider:Google’s review product has yet to reach a level of sophistication which could automatically flag reviews left by “Rocky Balboa” or “Whatever Whatever” as, perhaps, somewhat lacking in legitimacy. Google’s product also doesn’t appear to suspect profiles created solely to leave one-time reviews, though this is a clear hallmark of many instances of spamGoogle won’t remove text-less negative star ratings, despite owner requestsGoogle hasn’t been historically swayed to remove reviews on the basis of the owner claiming no records show that a negative reviewer was ever a customerQ: Should Google’s removal of anonymous reviews alter my review strategy?A: No, not really. I empathize with the business owners expressing frustration over the loss of reviews they were proud of and had worked hard to earn. I see actions like this as important signals to all local businesses to remember that you don’t own your Google reviews, you don’t own your Google My Business listing/Knowledge Panel. Google owns those assets, and manages them in any way they deem best for Google. In the local SEO industry, we are increasingly seeing the transformation of businesses from the status of empowered “website owner” to the shakier “Google tenant,” with more and more consumer actions taking place within Google’s interface. The May removal of reviews should be one more nudge to your local brand to:Be sure you have an ongoing, guideline-compliant Google review acquisition campaign in place so that reviews that become filtered out can be replaced with fresh reviewsTake an active approach to monitoring your GMB reviews so that you become aware of changes quickly. Software like Moz Local can help with this, especially if you own or market large, multi-location enterprises. Even when no action can be taken in response to a new Google policy, awareness is always a competitive advantage. Diversify your presence on review platforms beyond GoogleCollect reviews and testimonials directly from your customers to be placed on your own website; don’t forget the Schema markup while you’re at itDiversify the ways in which you are cultivating positive consumer sentiment offline; word-of-mouth marketing, loyalty programs, and the development of real-world relationships with your customers is something you directly controlKeep collecting those email addresses and, following the laws of your country, cultivate non-Google-dependent lines of communication with your customersInvest heavily in hiring and training practices that empower staff to offer the finest possible experience to customers at the time of service — this is the very best way to ensure you are building a strong reputation both on and offlineQ: So, what should Google do next about review spam?A: A Google rep once famously stated,“The wiki nature of Google Maps expands upon Google’s steadfast commitment to open community.”I’d welcome your opinions as to how Google should deal with review spam, as I find this a very hard question to answer. It may well be a case of trying to lock the barn door after the horse has bolted, and Google’s wiki mentality applied to real-world businesses is one with which our industry has contended for years.You see, the trouble with Google’s local product is that it was never opt-in. Whether you list your business or not, it can end up in Google’s local business index, and that means you are open to reviews (positive, negative, and fallacious) on the most visible possible platform, like it or not. As I’m not seeing a way to walk this back, review spam should be Google’s problem to fix, and they are obliged to fix it if:They are committed to their own earnings, based on the trust the public feels in their review corpusThey are committed to user experience, implementing necessary technology and human intervention to protect consumers from fake reviewsThey want to stop treating the very businesses on whom their whole product is structured as unimportant in the scheme of things; companies going out of business due to review spam attacks really shouldn’t be viewed as acceptable collateral damageKnowing that Alphabet has an estimated operating income of $7 billion for 2018, I believe Google could fund these safeguards:Take a bold step and resource human review mediators. Make this a new department within the local department. Google sends out lots of emails to businesses now. Let them all include clear contact options for reaching the review mediation department if the business experiences spam reviews. Put the department behind a wizard that walks the business owner through guidelines to determine if a review is truly spam, and if this process signals a “yes,” open a ticket and fix the issue. Don’t depend on volunteers in the GMB forum. Invest money in paid staff to maintain the quality of Google’s own product.If Google is committed to the review flagging process (which is iffy, at best), offer every business owner clear guidelines for flagging reviews within their own GMB dashboard, and then communicate about what is happening to the flagged reviews.Improve algorithmic detection of suspicious signals, like profiles with one-off reviews, the sudden influx of negative reviews and text-less ratings, global reviews within a single profile, and companies or profiles with a history of guideline violations. Hold the first few reviews left by any profile in a “sandbox,” à la Yelp.Now it’s your turn! Let’s look at Google’s removal of “A Google User” reviews as a first step in the right direction. If you had Google’s ear, what would you suggest they do next to combat review spam? I’d really like to know. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Q&A: Lost Your Anonymous Google Reviews? The Scoop on Removal and Moving Forward"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Q&A: Lost Your Anonymous Google Reviews? The Scoop on Removal and Moving Forward"
    },
    {
      "level": "H3",
      "text": "Q: What happened?"
    },
    {
      "level": "H3",
      "text": "Q: How do I know if I was affected by this action?"
    },
    {
      "level": "H3",
      "text": "Q: The reviews I’ve lost weren’t from “A Google User” profiles. What happened?"
    },
    {
      "level": "H3",
      "text": "Q: Is anonymous review removal a bug or a test?"
    },
    {
      "level": "H3",
      "text": "Q: Could my missing anonymous reviews come back?"
    },
    {
      "level": "H3",
      "text": "Q: What were the origins of “A Google User” reviews?"
    },
    {
      "level": "H3",
      "text": "Q: Is the removal of anonymous reviews a positive or negative thing? What’s Google trying to do here?"
    },
    {
      "level": "H3",
      "text": "Q: Does this Google update mean my business is now safe from anonymous reviews?"
    },
    {
      "level": "H3",
      "text": "Q: Should Google’s removal of anonymous reviews alter my review strategy?"
    },
    {
      "level": "H3",
      "text": "Q: So, what should Google do next about review spam?"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}