{
  "url": "https://moz.com/blog/lost-in-translation-converting-analytics-data-into-seo-advice",
  "slug": "lost-in-translation-converting-analytics-data-into-seo-advice",
  "title": "Lost in Translation: Converting Analytics Data into SEO Advice - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I'm a science guy at heart, and one of my favorite things about SEO is getting to play with Analytics data and using it to solve problems that my clients (and I) have. With all of the data that Google Analytics provides us with, it can become easy to get lost in all of the different ways to…",
  "content": "Lost in Translation: Converting Analytics Data into SEO Advice SEO Analytics W By: Will August 9, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! W By: Will August 9, 2010 Lost in Translation: Converting Analytics Data into SEO Advice SEO Analytics This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I'm a science guy at heart, and one of my favorite things about SEO is getting to play with Analytics data and using it to solve problems that my clients (and I) have. With all of the data that Google Analytics provides us with, it can become easy to get lost in all of the different ways to display, slice, and dice our data. However, if armed with the right ways to manipulate and 'massage' your data, you can extract some vital information about your site's performance. Here are a few examples: Valuable Referring Sites I personally check my Analytics data every day, even if it is for 5 minutes. Obviously if you're managing a lot of sites, this won't be possible, but I think if you have the time its important to be able to address problems and take advantage of great opportunities as soon as they come up. One of the things that I make sure I do in my daily five-minute check-ups is to look at Referring Sites for Today and Yesterday, Compared to the Past (2 Days). This will show us a list of all referring sites in the order of most visits-by-referral in the past 2 days. The important thing to look at here is the percentage change. If the percentage is 100%, for example, that means that the referring site has posted a link to your site in the past 2 days, and has brought new visitors to your site. You can use this knowledge to try and feature this article to produce more traffic to it, especially if the referrer is a well-known news/blog outlet. If the percentage is a negative (see below), this could mean that the referral has gone down in traffic, or that perhaps (in some cases) the link posted no longer reaches the correct page. This is an example of somewhere that you should be doing some damage control to get that traffic back. Who Is My International Site Optimized For? This data is important for any SEO on a site meant for a user-base that speaks multiple languages. It is vital to know who is staying on your site and able to read the content as opposed to who comes on your site, sees that they can't consume your content, and leave (bounce). To look at this, set up your data point as Language Visitors by Bounce Rate. Keep your data segment pretty big, because its important to have a large sample size in order to get accurate results. You will see a list of languages, with the highest bounce rate first. If you see any languages that have a significant amount of visitors with an unusually high bounce rate (as compared to the other languages), you should look at your content in that language and see if there are any changes that you could possibly make to have that content optimized for those users. Check out Sam Crocker's Blog Post: International CRO - Choosing the Wrong Colors and Other Mishaps for ideas. Which Traffic Gives Me the Best Visits? This is a common question among a lot of SEO professionals. Why waste your time with certain low-quality segments of referrals when you can focus your time on generating visits that are of depth and quality? Although this is a simple data point, it is definitely important to any SEO, no matter the size of the site. What you want to look at is Visitor Depth in Advanced Segments (Search, Direct, and Referral Traffic). This will show you the percentage of visits from each of the three segments by the number of pageviews (see below). The reason this view is helpful is because it displays your most valuable segment based on traffic and quality. You can use these numbers to decide where you should be focusing your SEO/link-building efforts. Note that the data below is a very small sample size and used for display purposes only. Well, thanks for reading. Hopefully these simple tips can help you whether you're a beginner or a veteran. Let me know if you like them and I'll be sure to note more as I use them for future posts. Happy SEOing! Will (wmw71190) is an SEO Intern for a Technology Company in NJ and runs his own website/blog College Laptop. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Lost in Translation: Converting Analytics Data into SEO Advice"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Lost in Translation: Converting Analytics Data into SEO Advice"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Will\n          \n            Will"
}