{
  "url": "https://moz.com/blog/lost-in-the-ocean-of-ghost-writers",
  "slug": "lost-in-the-ocean-of-ghost-writers",
  "title": "Lost in the Ocean of Ghost Writers - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Hello, my name is Gabriel, like the angel, but not quite the same.\n\nI've been studying SEO trends for over 10 years now. I started learning back when I was a Quality Engineering Intern for EarthLink, Inc. Which basically means I stuck the 'ISP Service\" marketing CD into a Mac and PC and checked the…",
  "content": "Lost in the Ocean of Ghost Writers Content Marketing G By: Gabriel Dicristofaro May 12, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! G By: Gabriel Dicristofaro May 12, 2009 Lost in the Ocean of Ghost Writers Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Hello, my name is Gabriel, like the angel, but not quite the same. I've been studying SEO trends for over 10 years now. I started learning back when I was a Quality Engineering Intern for EarthLink, Inc. Which basically means I stuck the 'ISP Service\" marketing CD into a Mac and PC and checked the database integration for typos. Translation. I was bored out of my adventurous mind. So, I studied any and everything written about Google search engine algorithms I could find. Oh, and just for the record. The most common typo error I found was for the word \"Earthlink\". It has a capital 'L'. EarthLink. But, let's jump forward now, shall we? I run a small SEO consulting firm, (name omitted until I earn my SEOmoz stripes) out of Denver, Colorado. I have good clients and use the white hat techniques of yore with aplomb and grace, upgrading them with the current times. However, the one area I am lost in ... is finding quality ghost writers or SEO copywriters. Steps to Finding a Quality Ghost Writer I did what most people on the Internet do to find anything...I typed it into Google and saw what the fishing nets brought in. What did I find? 'Sponsored' links and sweet 'organic' links to the top ranked SEO copywriter sites of the nation. Well, herein lies my Moby Dick I can't catch. Just because someone fine tuned their website with search engine friendly code and they rank high doesn't mean their SERVICE ranks high. One particular, dare I call it an agency, had an excellent layout with reasonable pricing packages. I thought I had struck search engine gold. The business I'm in provided me with a winner. After I placed my order for 2 sample \"denver divorce lawyer\" articles, I was going to hit the Ferris wheel and then the tilt-a-whirl with a corn dog in hand! (I would have to eat the dog before the tilt-a-whirl, of course.) I sent my clearly written email through the form provided and waited with anticipation. Nine days later (past my client deadline to create 2 new webpages) I receive a simple yet, unapologetic email: Email Response Gabriel, I just dug your email out my spambox. Did you still need content? Joe Owner - www.weblink - no phone number My Email Response Joe Owner, Wow! That was some digging. Yes, It’s been a little longer, but we’re still wanting to order those 2 samples to test out the quality of the service. You can call me now if needed. (my complete info was included: phone number & email) Customer Service Who? I had replied and understood the plight of the spam email folder monster, Sarlacc (photo courtesy of wikipedia.org). It eats anything and everything at random. Important communications vanish without a trace... Lying near the Great Pit of Carkoon, it would digest lost emails for a thousand years. I felt I was generous in my response. Understanding and willing to let bygones be bygones. Yet I wondered? With such a lack of empathy for a client requesting service, would the next installment be any better? It was not. It has now been 17+ days and no further response was given. No article link showed up in my inbox, which would be unrealistic since I was never given a link to pay or make an SEO article order on. This was an \"organic\" SERP vendor, mind you. My Hero So, I did end up finding another vendor through the pay-per-click links. The site had boxes that linked to a Paypal account with the exact amount I would be paying for each article and the number of articles I was requesting. The pay-per-click vendor sent me a link to my 2 fresh, new SEO articles 5 days later. Thanks, Han. The quality of the writing was decent, with a nice keyword density ratio. Most importantly, my client didn't think I was a slackoff. In Conclusion In the end, I'm still researching good ghost writers for legal SEO copy and other copy, for that matter. I have 200+ webpages to fill with quality, readable, SEO-friendly content. My goal was, is and has been to find a handful of writers to spread the wealth to. I'd like to help stimulate the economy. I am still in search of my Luke Skywalker writer to come in and save the day with his/her lightsaber pen or touchpad keyboard. Perhaps the emergency message in R2-D2 got lost in the email spam folder, Sarlacc. Either way, it shows that 'organic' links don't always produce the best results. Pay-per-click advertisers are actually reaching out to service your needs. Perhaps I was too judgmental. Maybe someone doesn't have to be \"organic\" to be a quality service or product. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Lost in the Ocean of Ghost Writers"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Lost in the Ocean of Ghost Writers"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Gabriel Dicristofaro\n          \n            Gabriel Dicristofaro\n          \n            Gabriel Dicristofaro"
}