{
  "url": "https://moz.com/blog/lots-of-page-views-good-or-bad",
  "slug": "lots-of-page-views-good-or-bad",
  "title": "Lots of Page Views - Good or Bad? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "**Please note I have no affiliation with Inc Magazine or their website. I read the article while waiting to get a haircut at my local barber.\n\nI recently read an article in Inc Magazine titled \"Improving Your Sense of Site,\" which focused on ways in which your analytics can show you how to increase…",
  "content": "Lots of Page Views - Good or Bad? SEO Analytics By: Brendan Fullam November 12, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Brendan Fullam November 12, 2008 Lots of Page Views - Good or Bad? SEO Analytics This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. **Please note I have no affiliation with Inc Magazine or their website. I read the article while waiting to get a haircut at my local barber. I recently read an article in Inc Magazine titled \"Improving Your Sense of Site,\" which focused on ways in which your analytics can show you how to increase sales. It was a great article and worth the read (gave me some great ideas), but one thing stuck out and I thought was worth discussing. The website owners gave a reaction to the comments made regarding their analytics, and one of their reactions was: ...but disputes the suggestion that the high number of page views reflects customer confusion. \"My read is that our site is engaging,\" he says, citing an online contest that attracted close to 200 entrants. I have often wondered why people always feel that if someone is on your site longer then a few seconds they are not getting what they need. Sure, in some cases this is probably true, but is it really true for every website? What if I have a website that is for model boats, and has a lot of history about the different models, but also offers the boats for sale as well. I wouldn't think it to be odd if a visitor session lasted a few minutes, because this type of audience probably enjoys learning about the boats they are going to be building or collecting. Now if my website was sports apparel and the object was to get as many orders in one day as possible, then I would be a little worried if a visitor was spending a great deal of time on the site. I think the owners of the website from the article brought up a great point that it could have been from a contest that was run on the site. There are many factors that can lead to lengthened stay on a website, and I think when analyzing the analytics of any site we need to be careful not to rush to any assumptions. What do you think, is it more important to keep the visitor duration low, or better to focus on what your site offers and gauge the length of visit based on your site's culture? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Lots of Page Views - Good or Bad?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Lots of Page Views - Good or Bad?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Brendan Fullam\n          \n            Brendan Fullam"
}