{
  "url": "https://moz.com/blog/magazines-and-books-for-seo",
  "slug": "magazines-and-books-for-seo",
  "title": "SEO Books and Magazines - My Offline Reading List - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This week, I'd like to make suggestions for a 'reading list' to help SEOs, and others who work online, particularly with website strategies.\n\nBut this list isn't going to be blogs, post and online articles, oh no. These suggestions are entirely offline. We're going into dead tree mode with eleven…",
  "content": "Offline Reading List: Magazines and Books for SEOs Marketing Industry By: Rob Ousbey January 24, 2010 Table of Contents Copied! By: Rob Ousbey January 24, 2010 Offline Reading List: Magazines and Books for SEOs Marketing Industry This week, I'd like to make suggestions for a 'reading list' to help SEOs, and others who work online, particularly with website strategies. But this list isn't going to be blogs, post and online articles, oh no. These suggestions are entirely offline. We're going into dead tree mode with eleven books and two magazines. Some of these suggestions you may want to flick through, some you may want to read cover to cover. Others will be suitable for suggesting to other people within your organisation. There's no intention that everybody should read all these books (they're spread over many topics) and my list is far from exhaustive. I'll welcome your feedback and further recommendations in the comments. (NB: This post links to Amazon.com and Amazon.co.uk to help you find more about the books mentioned. I've used affiliate links, and any revenue generated will be donated to good causes through a general disaster/emergency fund.) Analytics and Data Web Analytics in an Hour a Day - Avinash Kaushik This book is regarded as required reading for anyone who needs to understand the concepts behind web analytics and how to properly assess and understand them. Beyond the very basics about collecting analytics data, the book focuses on how to truly understand how it applies to your website's goals, and using analytics to collect actionable insights that will improve your website. (Buy online from: Amazon US or Amazon UK.) Information Dashboard Design - Stephen Few This book isn't directly related to SEO or web strategy, but since reading it, I've already had two opportunities to use its advice on effectively presenting data. Even if you're comfortable creating tables, graphs and charts, the hugely practical and highly actionable advice about combining data into 'dashboards' is worth your time to acquire. Whether you work with sites that need to present data in a way that's appealing to users, or if you need to produce a dashboard of analytics and search data for use internally (perhaps gleaned from Avinash's book) then you'll be able to communicate the information more effectively after taking advice from here. (You'll also start spotting the terrible data presentation mistakes that others make, but I can't help you there unfortunately.) (Buy online from: Amazon US or Amazon UK.) Usability & Testing Don't Make Me Think and Rocket Surgery Made Easy - Steve Krug Krug's famous book about design and usability is one of those classic texts that offers the whole premise within the four words of the title, and then goes on to spend the book showing you how to build that premise into your design philosophy. Get a flavour of the author's style and keen understanding in the sample chapter, How we really use the web. Krug describes the first book as being about how to think about usability, whereas Rocket Surgery Made Easy is about how to do it - covering the process of improving web site usability though user testing. It's highly recommended that before you start designing test and recruiting users, you give this book a read; if you're not planning any user testing just yet, then read it anyway to remind you why you should. (Buy 'Don't Make Me Think' online from: Amazon US or Amazon UK.) (Buy 'Rocket Surgery Made Easy' online from: Amazon US or Amazon UK.) Always Be Testing: The Complete Guide to Google Website Optimizer - Bryan Eisenberg & John Quarto-von Tivadar Complementing Krug's books, this text focuses on using Google Website Optimizer to set up tests for Conversion Rate Optimisation. Beyond the simple technical aspects of how to run a test with the tool, it teaches how to use an understanding of the buying process and creating strong offering to make websites more powerful. One reviewer on Amazon was given a copy of the book at SES, and mentioned: \"In one recent test, we used the principles learned from the book such as persuasion architecture to setup a test in only an hour that increased lead generation on a high volume ecommerce site by 51%\" (Buy online from: Amazon US or Amazon UK.) Search Marketing Information Architecture for the World Wide Web - Louis Rosenfeld & Peter Morville How does a book originally written over a decade ago make it into this list? Because when O'Reilly publishes a book by these authors, on a topic so important to the way information is published online and understood / consumed by visitors, the text is going to stand the test of time. Like many of these suggestions, the book doesn't just float at a high level, but gets down to 'brass tacks' with detailed discussion about designing and implementing IA on websites, and dedicating a significant chapter to choosing whether and how to implement on-site search on a site. (Recommendation by Dr Pete.) (Buy online from: Amazon US or Amazon UK.) The Art of SEO - Eric Enge, Jessie Stricchiola, Rand Fishkin and Stephan Spencer Despite the incredible ongoing changes in the field of SEO, an 'all-star cast' (including SEOmoz's Rand Fishkin) has managed to put together this excellent reference book for search marketers. Before page 50, the authors have covered the basics of how search engines crawl & index the web and search ranking factors; it goes onto cover the technical aspects of SEO, keyword research, competitor analysis & benchmarking, linkbuilding, vertical search and monitoring results. Most appealing about this book is the understanding that the authors bring from their experience managing SEO campaigns in the real world - such as in the chapter dedicated to building SEO teams, and knowing when or how to appoint a search agency. The main reason I sound like I'm raving about the book is the same reason you should read it: flattery. Rand dedicated this book to you, the members of the SEO community. (Buy online from: Amazon US or Amazon UK.) Search Marketing Standard Recommended by RobBothan, Search Marketing Standard published a quarterly magazine for the search industry. They promise: \"Stop stressing out over the avalanche of marketing advice from online sources and let us filter the noise for you.\" Influence: The Psychology of Persuasion - Robert B. Cialdini This is a classic book, which chooses to pitch persuasion as a science, rather than an art. The author is a professor of psychology, so this is perhaps expected, but the rigour of explanation in the examples (many from Caldini's own observations) will help you develop new, more persuasive ways of influencing the visitors to your sites. (Buy online from: Amazon US or Amazon UK.) Management & Implementation Good to Great - Jim Collins I've never before come across a book that is essentially a write up of a research project; it's particularly special as the research conclusions are highly valuable, and can be actioned. The premise of the work was to: identify concepts which great companies had in common, but that were not implemented by any (or many) companies that were simply 'good.' You can read more about what these concepts turned out to be, and see how Rand tested their application within SEOmoz in his 2007 post, Asking the Tough Questions or a similar post by Will, from Distilled's perspective. (Buy online from: Amazon US or Amazon UK.) Getting Things Done - David Allen An outstanding book that proposes a workflow management system which would seem highly radical to many people with an established system, and terribly common sense to others. The book then leads you into a method for implementing the GTD setup. From my perspective, the most important message (but one that plays second fiddle to much of the book's other content) is that your mind is excellent at a certain type of work (creative thinking, problem solving, etc) and shouldn't be fettered with other tasks (remember to call that client tomorrow, try to come up with some blog post ideas etc) which can be devolved to a trusted system. You know when you put things by the door, so that you remember to take them with you when you next leave the house? This book provides a way of making sure that your whole life runs that way. (Buy online from: Amazon US or Amazon UK.) Agile Project Management with Scrum - Ken Schwaber Ken Schwaber is one of the authors of the 'Agile Manifesto' which outlined the principles behind the methodology known as 'agile software development'. His 'Scrum' process - described in detail in this book - uses a series of relatively fast iterations, typically month-long 'sprints' between releasing product improvements. For people who don't like structures and systems that may introduce additional bureaucracy as a barrier to work, the system may sound terrifying (particularly the formal daily meetings) but trust me: once implemented, Scrum reduces almost every barrier between finding out what needs to be done and actually doing it. Though designed for software development, the principles can be applied to any product or service that can benefit from incremental improvements (and with a bit of creativity, I think this could easily apply to the output of a great deal of organisations.) (Buy online from: Amazon US or Amazon UK.) Day to Day Wired Wired (at Wired.com and Wired.co.uk) is a monthly magazine, covering many facets of 'technology', from gadgets to online-strategy. Its blend of creativity and informity will help you keep on top of technological trends and can also spark ideas, inspire design themes and help as a seed for linkbait concepts. That their staff have coined terms such as 'crowdsourcing' and 'the long tail' gives an idea of the impact the magazine has had on the internet marketing industry; reading it every month is the only way to make sure that you're using their next bit of lingo, before it hits the big time. Send: The Essential Guide to Email for Office and Home - by David Shipley & Will Schwalbe Various people have written about how to manage email as part of your daily work life, but this book talks about the specifics of style and writing in the medium. It should help you create better understood, more expressive emails. Sam suggested this book; he said \"It was recommended by an e-mail marketer friend and it changed the way I write (and read) e-mails. (...) Really useful.\" (Buy online from: Amazon US or Amazon UK.) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Offline Reading List: Magazines and Books for SEOs"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Offline Reading List: Magazines and Books for SEOs"
    },
    {
      "level": "H2",
      "text": "Analytics and Data"
    },
    {
      "level": "H2",
      "text": "Usability & Testing"
    },
    {
      "level": "H2",
      "text": "Search Marketing"
    },
    {
      "level": "H2",
      "text": "Management & Implementation"
    },
    {
      "level": "H2",
      "text": "Day to Day"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rob Ousbey\n          \n            Rob Ousbey"
}