{
  "url": "https://moz.com/blog/make-your-millions-with-facebook-applications",
  "slug": "make-your-millions-with-facebook-applications",
  "title": "Make Your Millions with Facebook Applications - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Rand, how on earth do you expect me to complete any solid keyword research when you assign me a task that involves Facebook? Luckily, you asked me to review the most successful (and most useful, as they're not necessarily the same thing) Facebook applications. I'm one of those people who have shied…",
  "content": "Make Your Millions with Facebook Applications Social Media By: Jane Copland September 13, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jane Copland September 13, 2007 Make Your Millions with Facebook Applications Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. ... or not. Rand, how on earth do you expect me to complete any solid keyword research when you assign me a task that involves Facebook? Luckily, you asked me to review the most successful Facebook applications. I'm one of those people who have shied away from adding applications to my Facebook account because I remember when Facebook was like a rented apartment where you couldn't even move the furniture without incurring the rage of the landlord. I remember when they added photographs but forgot to make security measures to ensure that strangers couldn't view each other's pictures. That was really fun, in a creepy stalker type of way. I remember the days before status updates, SuperPoke and Ninja invitations. In case anyone is still unaware of Facebook's developers platform, the popular social networking service now allows anybody and everybody to create applications. Users install applications on their profiles that do anything from display their resumes to search Wikipedia. There's no limit on the number of applications users can add, and the good folks over at Mashable put Facebook to the test by installing over 200 of them. The interesting thing about Facebook apps is in the question of what makes a certain application viable, popular and successful. The simple variety isn't terribly tough to make and although the idea behind them is similar to that of creating widgets for MySpace and Bebo, there is generally a feeling of interaction involved in a lot of the applications. Most of the time, they're spread virally: when you add an application, it appears as though you have to invite your friends to add it as well. Obviously, people will also notice the applications their friends have added and adopt those that appeal to them. From what I can see, many of the companies who have leveraged Facebook applications in the best way have done so by treating Facebook as both a community separate from their external website and a gateway to that website itself. A great example of this is the Pandora application, which is currently gaining popularity within the Facebook community. Upon adding the application, every significant action a user can make will take them to Pandora's premier website. Users can chronicle their favourite artists and songs, and add albums to their posted items via Facebook, but in order to listen to full songs, they must visit Pandora.com. Pandora, who serve ads on their site and offer a premium subscription that provides advanced features, have a lot to gain from sending traffic from Facebook to their own domain. This application only has 4,700 7,000 users at present (the count went up by over 2,000 in twenty-four hours), but its in-depth exploration of all its artists obviously appeals to musically inclined users. An example of the depth of information available inside Pandora's music discovery application However, one the most popular applications that was developed by a company (and not an individual Facebook member) is iLike, from the website of the same name. It is the sixth most popular application, currently boasting 696,757 active daily users. The reasons for its mass-adoption and active user-base are obvious when one takes a look at its features. It is not simply an application that lets you show your allegiance to a sports team or the friends you consider to be most important to you. The application comes with games, upcoming concerts that appeal to your musical tastes and - yep, this is the really cool bit - free MP3 downloads. Although there are a large number of useless MySpace-esque applications (due to the ease with which one can create them, I imagine), there is virtually limitless opportunity for ingenuity and creativity here. Despite the fact that Pandora and iLike are both music applications, other businesses and individuals can learn from the tactics they've used to harness an audience. Some features that help an application become successful include: Allowing interaction or competition. iLike's music recognition game gives players a set amount of time to identify a song, keeping track of users' statistics like percentage of correct guesses and time taken to identify songs, as well as creating a competition between users and their friends who are also using the application. Suggesting similar applications. Along with an application that shows which cities you've traveled to (as is run successfuly by TripAdvisor), either incorporate or cross-promote similar applications that are about a related subject. While using TripAdvisor's application \"Cities I've Visited\", users are invited to try TravelPod's Traveler IQ Challenge. While cross-promotion is horribly annoying when a video application tries to have you add a box showing biblical quotes or pictures of cute puppies, people will not react nearly as negatively to being shown similar products to that which they're currently playing with. Incorporating outbound links. Like Pandora, you want people to naturally migrate from the Facebook application to your website. As is shown below, Pandora's growing user-base at Facebook has resulted in an increase in their premier website's traffic. As if you need to be told, the red line indicates when Pandora's Facebook application became popular. Adding iLike.com to the mix shows the difference in traffic when a service virtually forces users from the application to the premier website. iLike is many times more popular at Facebook than is Pandora, mainly due to the application's neat features, but those users have not converted into regular iLike.com visitors because of the application's lack of outbound links. Alexa problems aside, the above stats indicate that traffic to iLike's domain has actually gone down since Facebook opened its doors to developers in May. If iLike's 700,000 Facebook users visited the site every time they played with their Facebook applications, I believe this chart would look a lot different. This is not to say that iLike's premier goal should be sending users from Facebook to their domain, as there is nothing wrong (and plenty right) with promoting their brand and fostering their large community on Facebook. However, if I were in charge of the application development and marketing, I'd consider adding some more features that send users to iLike.com. That raises another important feature of applications: developers can add to and tweak their applications at any time. Being sensitive to current events. As previously mentioned, developers can cross-promote their applications. If you have an application that is your main focus, keep an eye out for events for which you could develop secondary applications. Below are two upcoming apps, separated by good old Pandora, that are popular because of the rugby world cup (go All Blacks!) and Rosh Hashanah, respectively. The Rugby World Cup Picks application was developed by Zemobo, a very new Web 2.0 site that bills itself as one that \"allows you to keep up with what you're friends are doing and what's going on near you.\" Unfortunately, it's not loading properly today, which is a shame since its Facebook application is undoubtedly more visible than its domain, It is working today (9/14) and it could attract a significant of traffic via the app. For a very new site, having an application become popular at Facebook is better publicity and exposure than any number of press releases or directory submissions. When you're considering and creating Facebook applications, keep in mind that, despite my post's title, these are not going to make you millions of dollars. They should be considered part of your social media marketing tactics, not the answer to all your social media problems. In some ways, these applications are little more than Facebook groups; they just take a lot more effort to create and give their creators more control over their layout. You will notice that a lot of popular applications are rather useless. Because it has been almost four months since the platform debuted, many \"easy-to-develop\" niches have already been filled - and saturated - such as the MySpacey Top Friends idea, the ability to \"poke\" friends in strange ways (hit, cuddle, marry, throw a sheep at...), and the development of new \"walls\", or comment boards, where friends can draw each other pictures and include different fonts. These were the first applications to spring up and as such, the market for new versions is not very profitable. Ideas for new applications will need to be unique and far more creative than those which are currently the most popular. Another interesting idea for leveraging this platform is to send your existing users from your site to your application, and then presenting them with other applications for other properties that you're interested in. For example, if SEOmoz developed an app - which we have no plans to do, so don't get too excited - we'd already have a huge collection of SEOmoz readers / Facebook users ready to add the application. Then, there would be nothing stopping us promoting another domain - Drivl, for example - by suggesting that the SEOmoz application users add Drivl's (imaginary) application as well. Our task would then be to drive traffic from the Drivl app to the domain itself. Rinse and repeat. Below is the page users see after adding the X-Me app; an invitation to add Fantasy Football as well. The message one receives upon adding the Friend Wheel application is a little more polite, simply listing the other applications that the developer has made: Armed with a good idea, a talented developer and the means to promote a new application (having a big list of real friends is a great advantage. Hooray for having been in college during Facebook's formative years...), this platform can offer some big benefits to an online business. I'll be interested to see what happens to the popularity of Pandora's application and if its Alexa data continues to mirror its Facebook success. One last idea: the rules that apply outside of Facebook in terms of brand strength don't seem to apply in the application realm. Yahoo, PayPal and a few other online heavy-weights have Facebook applications whose adoption and activity are nowhere near as impressive as those developed by individuals or relatively unknown companies. As has always been the case with Facebook, its separatism from the rest of the Web brings with it different rules and norms. To shamelessly promote our most recent Premium guide once more, Social Media Optimization Strategies has some more information about the developers' platform, and about leveraging Facebook in general. Also, check out this enormous screen shot that shows the top applications in four different categories: Recenty Popular, Most Activity, Most Active Users and Newest. Obviously being \"Newest\" is no measure of success, but it gives you an idea of the diversity of new applications and the rate at which they are being added. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Make Your Millions with Facebook Applications"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Make Your Millions with Facebook Applications"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jane Copland\n          \n            Jane Copland"
}