{
  "url": "https://moz.com/blog/making-a-site-link-friendly",
  "slug": "making-a-site-link-friendly",
  "title": "Making a Site Link Friendly - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "You have great content ideas and the motivation to create, but if your site isn't link-friendly, you might still be up the proverbial creek. Let me give a perfect example from one of my favorite bloggers - Andrew Goodman (from a blog entry called monetizing your site):\n...",
  "content": "Making a Site Link Friendly Design By: Rand Fishkin March 20, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 20, 2007 Making a Site Link Friendly Design The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. You have great content ideas and the motivation to create, but if your site isn't link-friendly, you might still be up the proverbial creek. Let me give a perfect example from one of my favorite bloggers - Andrew Goodman (from a blog entry called monetizing your site): I was about to link to this site because they had a relevant article to my next post. But their article was nearly unreadable because of all the monetization around it. Hey, it's nice to sell ads, but... So now they're officially in the usability hall of shame. And they're in the \"no link for you hall of shame\" to boot. Yes, folks, the quality of your design, the delivery method of your message and the user experience you provide all heavily impact the links you're able to earn. Let's look at some of the site attributes that can make or break a link: Achieving all of the positives on the list while dodging all the negatives is incredibly hard, but there are a few sources that do so with impressive results. Wikipedia is the first that comes to mind, but the BBC, the Pew Internet & American Life Project, the Discovery Channel and many of the top blogs fulfill a great number of these criteria. In addition to these, there are specific elements that you can use to \"encourage\" link creation, but I've got an early presentation tomorrow so we'll have to save that for Thursday morning content :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Making a Site Link Friendly"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Making a Site Link Friendly"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}