{
  "url": "https://moz.com/blog/managing-customer-care-its-easier-to-keep-a-client-than-find-a-new-one",
  "slug": "managing-customer-care-its-easier-to-keep-a-client-than-find-a-new-one",
  "title": "Managing Customer Care: Keeping a Client vs. Finding a New One - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "   Managing Customer Care:“It’s easier to keep a client than find a new one.”  Yeah, it’s an old cliché, but it’s a cliché because it’s true. The key to long-term site success is an expanding customer/client base – repeat buyers of your goods or services.  Keeping the customer satisfied, especially…",
  "content": "Managing Customer Care: Keeping a Client vs. Finding a New One Online Advertising By: Paul Lalley May 7, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Paul Lalley May 7, 2008 Managing Customer Care: Keeping a Client vs. Finding a New One Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. “It’s easier to keep a client than find a new one.” Yeah, it’s an old cliché, but it’s a cliché because it’s true. The key to long-term site success is an expanding customer/client base – repeat buyers of your goods or services. Keeping the customer satisfied, especially for web-based businesses, isn’t a walk in the park, but there are things you, as webmaster, can do to manage client care, keeping the customer satisfied and coming back for more. Maintain an accurate order tracking system. If you use a delivery service like FedEx or UPS, you’ll get tracking software with your account. But, if you’re trucking 37 ceramic figurines to the post office every day, you’ll need an order tracking system – preferably one that can identify “downstream” problems like “Hey, you’re going to run out of hula girl bobble heads next Thursday. Time to reorder.” Stay involved. You may be using a drop shipper to manage inventory storage, shipping, and handling, and it’s not always easy during the rush of the day to check tracking data – even if you’re shipping out of a spare room. Track all problem orders yourself. Provide updates to the buyer. Send an auto-responder as soon as the problem is identified with an opt out box to cancel the sale. You may lose that one, but your straightforwardness and ease of use will make a positive impression. Federal law requires that orders must be filled within 30 days, after which the buyer is no longer obligated to pay. Don’t ship without renewed buyer approval. Provide US-based customer support 24/7. In this global marketplace, someone is always buying, and someone always has a question. Also, empower telephone reps to accept returns with the customer’s receipts. This saves on call-backs and significantly lowers buyers’ stress levels. Use dynamic pages designed specifically for each visitor. Best example? Amazon. My home page is different from your home page based on our past buying histories. All of this data is stored in Amazon’s database, and when I log on, I’m bombarded with recommendations based on items purchased five years ago. But Amazon stills calls me by my first name. That’s nice. Last key point. Overdeliver. If prudent, drop a personalized email or even make a telephone call. People are really pleasant when the company CEO calls and promises satisfaction. The whole point of quality customer care is to create word of mouth (WOM) viral marketing. Treat your customers or clients right, and viral WOM will do the rest in growing that client base bigger and bigger. editor@webwordslinger Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Managing Customer Care: Keeping a Client vs. Finding a New One"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Managing Customer Care: Keeping a Client vs. Finding a New One"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Paul Lalley\n          \n            Paul Lalley\n          \n            Paul Lalley"
}