{
  "url": "https://moz.com/blog/manage-risk-by-including-an-indemnification-clause-in-your-seo-consulting-contracts",
  "slug": "manage-risk-by-including-an-indemnification-clause-in-your-seo-consulting-contracts",
  "title": "Manage Risk By Including an Indemnification Clause in Your SEO Consulting Contracts - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "May It Please the Mozzers,\n\nContinuing my mini-series on SEO contract clauses, today's Legal Monday focuses on indemnification clauses. These kinds of provisions are standard in many consulting contracts. They can be extremely valuable or extremely dangerous in your contract. Therefore it is very…",
  "content": "Manage Risk By Including an Indemnification Clause in Your SEO Consulting Contracts E-Commerce SEO By: Sarah Bird August 4, 2008 Table of Contents Copied! By: Sarah Bird August 4, 2008 Manage Risk By Including an Indemnification Clause in Your SEO Consulting Contracts E-Commerce SEO May It Please the Mozzers, Continuing my mini-series on SEO/M contract clauses, today's Legal Monday focuses on indemnification clauses. These kinds of provisions are standard in many consulting contracts. They can be extremely valuable or extremely dangerous in your contract. Therefore, it is very important to understand and use them intelligently. Even if you don't want to delve into indemnifications in your contracts, remember that larger, more sophisticated clients will commonly demand indemnifications. They are standard clauses. This is advanced material. Compared with disclaimers of warranties and opportunity-to-cure clauses, indemnifications are very complex. Indemnification clauses may not be sexy, but they are important. So fill up on some caffeine and read on. What is an indemnification clause? Generally, when you agree to indemnify a client, you must pay for any financial loss the client suffers, such as a settlement or a court award, either directly or through reimbursement. Similarly, if a client indemnifies you, it must pay for your financial losses as well. Indemnification provisions can vary widely. They can be very broad, or very narrow. They can be mutual, or exclusive. The answers to \"Who pays whom?\", \"when?\", and \"how much?\" depend entirely on the specific contract language. Whenever you see language such as \"indemnify, defend, and hold harmless,\" you are dealing with indemnifications. NOTE: If you're having a hard time imagining how indemnification clauses would be useful to an SEO/M, I invite you to scroll to the end of this post where I have dreamed up some example situations where indemnifications would be important to an SEO/M. Sample Indemnification Language Here is some sample indemnification language from one our a SEOmoz Agreements: 8. Indemnification 8.1. SEOmoz’s Indemnification. SEOmoz shall indemnify, defend and hold you harmless against any claims brought against you to the extent SEOmoz infringed any trademark, copyright or patent in the United States or misappropriated any trade secret of a third party. 8.2. Client’s Indemnification. Subject to the preceding paragraph, you agree to indemnify, defend and hold SEOmoz harmless against any claims brought against SEOmoz to the extent those claims are based upon allegations that you (a) infringed intellectual property rights or (b) breached your agreement (if any) with any customer purchasing or licensing your goods or services. 8.3. Conditions to Indemnification. The foregoing obligations are conditioned upon: (a) prompt written notice by the indemnified party to the indemnifying party of any claim, action or demand for which indemnity is claimed; (b) complete control of the defense and settlement thereof by the indemnifying party, provided that no settlement of an indemnified claim shall be made without the consent of the indemnified party, such consent not to be unreasonably withheld or delayed; and (c) reasonable cooperation by the indemnified party in the defense as the indemnifying party may request. The indemnified party shall have the right to participate in the defense against the indemnified claims with counsel of its choice at its own expense. 8.4. Definition of “Claims.” For purposes of Section 8, “Claims” means losses, actions, liabilities, damages, expenses and reasonable attorneys’ fees and court costs. This sample provision includes mutual indemnifications; both SEOmoz and the Client have some indemnification obligations. Specifically, SEOmoz promises to compensate the Client if someone brings a claim against the Client because SEOmoz violated intellectual property laws. The Client, on the other hand, promises to compensate SEOmoz if someone sues SEOmoz because of something the client did. In this way, both SEOmoz and the Client are accepting risk for their own conduct, but not for the other party. The sample provision above also creates certain rules about how the indemnification process will work. SEOmoz has to tell the Client that there is a problem right away. If SEOmoz doesn't give notice, then the Client doesn't have to compensate SEOmoz. The same thing goes for the Client. It has to tell us there is a problem before we're obligated to pay for anything. In addition to requiring written notice, the sample language above describes who is 'in charge' of legal strategy and identifies the kinds of financial losses that must be compensated. Things to Remember about Indemnification Clauses Every indemnification clause is different so read it carefully. Don't assume that it is \"standard\" or \"fair.\" Who is agreeing to pay who? Are you agreeing to pay the Client if there is a problem or is the Client agreeing to pay you? Don't go out of your way to offer indemnifications; They increase your potential risk. On the other hand, it is a reality that sophisticated clients are going to demand some form of indemnification. Further, if you ask a Client to indemnify you, it is appropriate to volunteer limited indemnification. It all depends on your bargaining power with the potential client. What kinds of losses will be covered? Will the client pay your Attorneys' fees? Court costs? Actual damages? Which party gets to control the legal strategy? Who is picking the attorney? Who gets to decide whether to settle the case? What kind of event triggers the obligation to indemnify? Breach of contract or negligence by the other party? Third-party claims? Is there a duty to defend? Does the contract require the Client to help you defend against a lawsuit, or does it merely require the Client to pay for your financial losses? There is a subtle but important distinction between the two things. If the client is required to compensate you for all financial losses, but not defend you, then you will have to shell out a lot of money to defend the lawsuit before the Client ever gives you a dime. Make sure the word \"defend\" is in the client's indemnification. Insurance. If you're going to have a long-term relationship with the Client and you're worried it may not have the resources to fulfill their indemnification obligations in the event of a problem, you should require the Client to have professional liability insurance. After all, there is no point in having an indemnification provision if there is no money there to back it up. Of course, a client may also require you to have insurance. In fact, most large, sophisticated clients will require you to have some form of professional liability insurance. Never agree to indemnify a client against its own conduct. Indemnifications allocate risk to the party who is best able to prevent the risk of loss. Don't trust a client who asks you to indemnify its conduct. If you can't control the situation, don't agree to be liable for it. Indemnification provisions are often complex, but they are a standard part of consulting agreements. They can be tremendously valuable when used well, but they can also be tremendously expensive if you're ever required to pay attorneys' fees, court costs, and court awards for the other party. Thus, it is important to understand exactly what you're agreeing to when you see the \"indemnify, defend, and hold harmless\" language. I hope that this helps you appreciate the complexity and importance of indemnification clauses. Please let me know if you have any general questions or concerns about indemnifications and how they operate. Best Regards, Sarah Appendix of Example Uses for Indemnification Clauses The following is an example of a situation where it would be very valuable to have your client agree to indemnify you. You agree to do some SEO consulting for a client. You inform the client of various keywords that the client should focus on and instruct the client to put those keywords on her site. Instead of taking the time to develop the content herself, the client scrapes a popular online magazine's content, thereby committing copyright and trademark infringement. The Magazine discovers the infringing material and wants to make an example of the site. The magazine discovers that you did the consulting and optimization of the site. The magazine sues you and the site. You're thinking: \"Why do I care if I've been sued?! I'll just prove I didn't do anything wrong and it will go away.\" Well... yes. sort of. You've still got to pay the big bucks to defend the lawsuit. If you had a robust indemnification clause in your client contract, then your client would have to pay for all of the legal fees to defend you from the false allegations. If you didn't have any indemnification clause, then you'd have to pay those yourself. Here's another example illustrating why you may want to seek indemnification from the client. You enter into an agreement to do SEO/M for a client. The client tells you that you that it provides certain goods at a certain price. Trusting the client, you create content for various sites and internet marketing campaigns re-stating what the client told you about her products. It turns out that the Client was misleading consumers about the quality and costs of her goods. Suddenly, angry consumers are suing you and the client for violations of the Consumer Protection Act, Misrepresentation, Breach of Contract and Fraud. If your contract with the Client included a robust indemnification provision, then the Client is obligated to pay for your attorney AND pay for any judgment that the consumers are successful in obtaining against you. The two previous examples demonstrated how an indemnification clause may help you allocate risk for the client's behavior back to the client. The next example shows how indemnifications can result in you paying a lot of money to the Client if your work creates a problem. You enter into an Agreement with the Client to perform SEO/M. You design and implement an SEO/M strategy that includes purchasing links and violates Google's guidelines. Google finds you out and kicks the Client's site out of the index. The Client loses a gazillion dollars in sales. The Client sues you for damages. If you agreed to indemnify the Client for any problems arising from your work, then you'll have to compensate the Client for its lost profits and any other damages it suffered as a result of your work. Here is a similar example, except this one shows how indemnifications also come into play when third parties are injured by your conduct: You enter into an agreement with a Client to perform SEO/M. You design and implement an SEO/M strategy that includes using a competitor's trademark in meta-tags. The competitor discovers the issue and sues your client for trademark infringement. If you agreed to indemnify the Client for any problems arising form your work, then you'll have pay for the Client's attorneys' fees to defend the lawsuit filed by the competitor. You'll also have to pay any judgment won against your client. As you can see, indemnifications are important and can have serious positive or negative consequences. They are great if you know how to understand them and when to use them. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Manage Risk By Including an Indemnification Clause in Your SEO Consulting Contracts"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Manage Risk By Including an Indemnification Clause in Your SEO Consulting Contracts"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Common Mistakes E-commerce Websites Make Using JavaScript"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sarah Bird\n          \n            Sarah Bird\n          \n            Sarah Bird"
}