{
  "url": "https://moz.com/blog/map-maker-shutdown-google-nap-change-alerts",
  "slug": "map-maker-shutdown-google-nap-change-alerts",
  "title": "Moz Local Brightens Map Maker Shutdown Blues with Google NAP Change Alerts - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The shutdown of Google MapMaker allows for small businesses to be hit with negative SEO and never know. Miriam Ellis describes the danger and how you can safeguard your local SEO efforts.",
  "content": "Moz Local Brightens Map Maker Shutdown Blues with Google NAP Change Alerts Local SEO By: Miriam Ellis January 23, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis January 23, 2017 Moz Local Brightens Map Maker Shutdown Blues with Google NAP Change Alerts Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. “Why, there’s a change in the weather, there’s a change in the seaSo from now on, there’ll be a change in me.”Ethel Waters - There’ll Be Some Changes Made Change happens fast! Recently, I came across a local retail store that was violating Google’s naming guidelines on the company’s Google My Business listing. As a tiny experiment, I used a Google account I had never used before for any Maps tasks, recommending that Google correct the name. It took 48 hours for my suggestion to be implemented and for me to receive a thank-you email from Google. Just like that. I like this particular business and didn’t want them to get in trouble with Google, but you can’t count on all your neighbors (or their marketers) to have the same civic-minded motivations. Negative SEO in the form of nefarious local listing edits to your name, address, and phone number (NAP) is a genuine threat to traffic, leads, and sales, requiring due vigilance. Google makes changes and we adapt. Google plays Pomp and Circumstance for its announced “graduation” of Google Map Maker to Google Maps and respected Local SEOs like Joy Hawkins and Phil Rozek take a minute to sing the blues and then look around for solutions to the changes. Your competitors can edit your listings without leaving a paper trailHigh on the local SEO industry’s list of concerns surrounding the March shutdown of Google Map Maker is that it cements trackless negative editing. Map Maker formerly allowed us to connect the negative edit history of Google My Business listings to a specific Google user. This info might help us realize that our data’s assailant was a competitor, a disgruntled past employee, or a non-customer, enabling us to report the edits as obvious violations. Google’s sunsetting of Map Maker means all third-party edits (both positive and negative) will now go through Maps’ suggest an edit feature, leaving no traces behind them. So, this most recent change is certainly a problem, and unfortunately, not one I can offer to solve for you today — but I can solve the bigger issue underlying this whole negative SEO scenario: I can help you make sure no one ever edits your Google My Business listings without you knowing about it right away. Moz Local will alert you if anyone edits your Google My Business NAPUnless you operate a famous brand with an active following ready to instantly alert you via social media if your listing data has changed, you’re more or less on your own when it comes to monitoring your GMB listings. Whether you’re an overworked small business owner or the marketer of a franchise with 300 locations, it can be a tiresome challenge trying to police your listing data on a continuous basis. Of this task, Hawkins says, “...unless the business wants to check their information daily, there is currently no way that they will know about changes.” Making time for these manual checks, particularly if you’re short on resources or long on total number of listings you have to manage, is enough to give anyone the blues. Fortunately, Moz Local customers can whistle a happier tune, knowing that should unscrupulous persons edit their GMB name, address or phone number, an email alert like this will swiftly appear in their inbox: This convenient alert system, already at work for all Moz Local customers, not only removes needless worry and the obligation of tiresome vigilance, it could very well prevent significant damage to your traffic and revenue. Just how negative can competitive edits be?Imagine a family-owned carpet cleaning company in a competitive market with one very unethical competitor who successfully swaps his phone number for the victim’s. Call volume suddenly tanks and the carpet cleaner begins to entertain a variety of stressful hypotheses for the cause. Is this drop something seasonal? Is he just too small to maintain profit in a crowded market? Are past customers unhappy with his service? Has a new enterprise come to town, edging him out with better pricing? Days, weeks, or months of reduced call volumes could go by before the anxious owner connects the drop to his Google My Business listing having been maliciously edited. It can be hard for any small business to absorb a single day’s lost business, let alone weeks of it! Doubt this would happen? I might have, too, until I went through the famous florist listing hijacking of ‘08 (the same year Google released Map Maker, coincidentally), resulting in tears, revenue loss, and staff layoffs at devastated businesses. We’ve seen phone numbers edited en masse to direct to call centers. We’ve seen thuggish demands for a piece of the action while listings were held hostage. We’ve seen lawsuits and sentencing. So, yes, this form of negative SEO is a very real problem, and the truth is that dyed-in-the-wool spammers are already well aware of the trackless edits they can make via Google Maps. And in some ways, the shutdown of Map Maker may only further encourage them to continue their sneaky work… but not undetected. While Moz Local can’t individually identify these spammers for you the way Map Maker has for the past eight years, it does take the major scare out of malicious edits by ensuring you’re alerted to them right away and can act to rectify them. It’s my sincere hope that knowing this provides welcome peace of mind for our customers who work so hard to achieve visibility in Google’s product. It’s a new year and we’re all gearing up to meet and master whatever changes Local SEO will bring our way in 2017. Not familiar with Moz Local? Get to know us this Q1 via our free Check Listing tool. Want to learn more about Local SEO firsthand? Join the experts — grab your tickets to MozCon Local, February 27th & 28th in Seattle! Register now! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Moz Local Brightens Map Maker Shutdown Blues with Google NAP Change Alerts"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Moz Local Brightens Map Maker Shutdown Blues with Google NAP Change Alerts"
    },
    {
      "level": "H2",
      "text": "Your competitors can edit your listings without leaving a paper trail"
    },
    {
      "level": "H2",
      "text": "Moz Local will alert you if anyone edits your Google My Business NAP"
    },
    {
      "level": "H2",
      "text": "Just how negative can competitive edits be?"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}