{
  "url": "https://moz.com/blog/mapping-the-overlap-of-serp-feature-suggestions",
  "slug": "mapping-the-overlap-of-serp-feature-suggestions",
  "title": "Mapping the Overlap of SERP Feature Suggestions - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We explored the search suggestions packed into SERP features to see how much overlap might exist as a result of Google's endless topical organization.",
  "content": "Mapping the Overlap of SERP Feature Suggestions Search Engines | Advanced SEO | Competitive Research By: Roger MozBot January 24, 2019 Table of Contents Copied! By: Roger MozBot January 24, 2019 Mapping the Overlap of SERP Feature Suggestions Search Engines | Advanced SEO | Competitive Research This article was originally published on the STAT blog on September 13, 2018. From carousel snippets to related searches to “People also ask” boxes and “People also search for” boxes, the Google SERP is jam-packed with features that not only aid in keyword list creation but can help you better understand the topics your unique search landscape is structured around. In fact, the increase of topics and entities as a way of navigating and indexing the web was one of the biggest developments in search in 2018. This is why we took 40,977 SERPS and stripped out every term or phrase from the aforementioned features — a small, first step toward making sense of Google’s organizational skills. We wanted to see how much overlap might exist across these different SERP features. Does Google give us a lot of new keywords to work with or just suggest the same stuff over and over again? Do we need to pay attention to each SERP feature when building out our SEO strategy or can we overlook a few? We dug into a bunch of data in STAT to find out. A little bit on topics and entities and SERP featuresIn September 2018, Google announced a new layer to its knowledge graph: “The Topic Layer is built by analyzing all the content that exists on the web for a given topic and develops hundreds and thousands of subtopics. For these subtopics, we can identify the most relevant articles and videos—the ones that have shown themselves to be evergreen and continually useful, as well as fresh content on the topic. We then look at patterns to understand how these subtopics relate to each other, so we can more intelligently surface the type of content you might want to explore next.” But, even before Google came out with its Topic Layer, Cindy Krum, CEO & Founder of MobileMoxie, was all about what she called “entities” as mobile-first indexing was (finally) rolling out. See if you can spot the similarities: “Entities can be described by keywords, but can also be described by pictures, sounds, smells, feelings and concepts; (Think about the sound of a train station – it brings up a somewhat universal concept for anyone who might hear it, without needing a keyword.) A unified index that is based on entity concepts, eliminates the need for Google to sort through the immense morass of changing languages and keywords in all the languages in the world; instead, they can align their index based on these unifying concepts (entities), and then stem out from there in different languages as necessary.” Bringing it back to SEO-specifics, Cindy explains that both domains (traditionally associated with indexing) and the brands that operate them can be considered entities. “Indexing based on entities is what will allow Google to group all of a brand’s international websites as one entity, and switch in the appropriate one for the searcher, based on their individual country and language.” So, what does any of this have to do with our SERP features of choice? Well, all of the suggested terms packed into them are the direct result of Google’s endless topic analysing and organizing. We might not be privy to every entity Google scrapes but we can certainly take cues from how they choose to express the final product on the SERP. How we made the magic happenIn order to map the overlap in our particular query space, we took the highly scientific word-bag approach. Operating on a SERP-by-SERP level of analysis, we scooped each feature’s suggestions into its own bag, filtered out any stop words, and then compared one bag’s suggestions to another, looking for a match and tallying as we went. So, for example, we’d examine all the PAA questions on one SERP against all the related searches on the same SERP. Each PAA suggestion got its own bag, as did each related search, and we removed the search term itself from all of the bags. If any remaining words in the two bags matched, we counted it as an overlap, divided it by the total number of possible overlaps, and got the total entity overlap between these features. Phew! In the end, after combing through 40,977 SERPs, we made roughly forty-million word bag comparisons. No sweat. What we foundUltimately, there’s not a lot of overlap happening with our four features. A measly average of 4 percent of the search suggestions saw any duplication in terms. This tells us that Google’s putting a lot of care and consideration into what each SERP feature’s up to and we’d be wise to keep an eye on all of them, even it means weeding out a few duplicate suggestions now and then. Here’s how things turned out when we looked at specific pairings: Carousel snippetsCarousel snippets hold the answers to many different questions thanks to the “IQ-bubbles” that run along the bottom of them. When you click a bubble, JavaScript takes over and replaces the initial “parent” snippet with one that answers a brand new query. This query is a combination of your original search term and the text in the IQ-bubble. For this bit of research, we took the bubble text and left the rest. It turns out that carousel snippet IQ-bubbles had the least amount of overlap with the other three SERP features. This is likely because the bubbles, while topically related to the original query, typically contain subcategories that live within the high-level category introduced by the search term. Take the above snippet for example. The query [savings account rates] produces a SERP with organic results and other features that provide general info on the subject of savings accounts. The bubbles, however, name different banks that have savings accounts, making them highly distinct keyword suggestions. Other reasons to consider these terms when list-building and content strategizing: Google keeps this snippet right at the top of the SERP and doesn’t require clicking of any kind in order to surface the bubbles, which means they’re one of the first things Google makes sure a searcher sees. The \"People also ask\" boxThe “People also ask” box typically contains four questions (before it gets infinite) related to the searcher’s initial query, which then expand to reveal answers that Google has pulled from other websites and links that guide users to a SERP of the PAA question. Not only are PAA questions excellent long-tail additions to your keyword set, they’re also a great resource for content inspiration. So we stripped them out and dumped them into our word bags to analyse. PAA questions ended up returning the second highest level of duplication, though most of that was tied to terms we pulled from the “People also search for” box — the two had a 10.41 percent overlap. This makes sense as both ostensibly offer up other terms that people either ask or search for. It could also be a result of the longer length of both suggestions, which can create more opportunity for matching. Related searchesNo less than eight related searches sit at the very bottom of each SERP and, when clicked, become the search query of a new SERP. These help to refine or expand on the original query. We were surprised to see how little duplication related searches had with the other SERP features — they were oddly unique. We say “oddly unique” because these terms are usually shorter and more iterative of the original query, tending to stay on topic and, as a result, we expected them to show up more in the other features (the carousel snippet perhaps being the only exception). The \"People also search for\" boxIn order to surface a “People also search for” box, you need to do a little pogo-sticking. It’ll materialize after clicking an organic search result and then navigating back to the SERP. Mobile PASFs typically have eight topically-related terms that open up a new SERP, while desktop PASFs usually have six. Out of all our comparisons, PASF boxes had the most amount of overlap, particularly with PAAs (which we noted above) and related searches. Given that PASF terms are attached, both physically and topically, to the organic result and not the search query, we actually didn’t expect them to share this much. One possible explanation would be the sheer volume of them. With an average of 8.77 boxes per SERP and six or eight terms per box, this would lead to both a lot of duplication within the box itself and an overall saturation of the topic field. But, when we think about what PAAs and related searches attempt to do, PASFs do seem like a mix of both. Putting it all togetherWith not a lot of term overlap happening, it’s a good idea to keep all of these features top of mind. Google may be running out of unique-sounding names for them, but they’re not running out of unique suggestions to stuff into them. Even if understanding the topic hierarchies that rule your query space is a little outside of your day-to-day concerns, if people click on search suggestions rather than — or even in addition to — organic results, then it stands to reason that you should at least be trying to rank for these terms as well as the base query. If you’re super pressed for time or don’t have the resources required to wade through each SERP feature’s suggestions and had to pick just one, you could run with the PASF box (though we’d still recommend you throw in any IQ-bubbles that show up) as it returns the highest duplication. Conversely, since STAT’s got super easy PAA and related searches reports, you could quickly cover about as much ground with those two. Want take those reports (and more) for a test drive? Say hello and request a demo! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Mapping the Overlap of SERP Feature Suggestions"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Mapping the Overlap of SERP Feature Suggestions"
    },
    {
      "level": "H2",
      "text": "A little bit on topics and entities and SERP features"
    },
    {
      "level": "H2",
      "text": "How we made the magic happen"
    },
    {
      "level": "H2",
      "text": "What we found"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Carousel snippets"
    },
    {
      "level": "H3",
      "text": "The \"People also ask\" box"
    },
    {
      "level": "H3",
      "text": "Related searches"
    },
    {
      "level": "H3",
      "text": "The \"People also search for\" box"
    },
    {
      "level": "H2",
      "text": "Putting it all together"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Roger MozBot\n          \n            Roger MozBot\n          \n            Roger MozBot"
}