{
  "url": "https://moz.com/blog/march-2024-google-updates",
  "slug": "march-2024-google-updates",
  "title": "March Core Update & Spam Updates: Four Major Trends - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Explore the aftermath of Google's March Core Update and Spam Updates and uncover four major trends shaping the search landscape.",
  "content": "March Core Update & Spam Updates: Four Major Trends Search Engines | Marketing Industry | Algorithm Updates By: Lily Ray Edited By: Emilie Martin May 20, 2024 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Lily Ray Edited By: Emilie Martin May 20, 2024 March Core Update & Spam Updates: Four Major Trends Search Engines | Marketing Industry | Algorithm Updates The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. One of the most significant updates in Google’s history, the March Core Update, officially concluded on April 19, 2024, 45 days after its formal rollout. Google aimed to reduce low-quality, unhelpful content and certain types of spam, plus make updates to various systems as part of the dual March Core and March Spam updates. Additionally, Google indicated that the rollout of a new type of spam policy violation, “site reputation abuse,” launched after May 5, 2024. These multi-part updates were long anticipated by many in the SEO and marketing communities for a variety of reasons: Many site owners facing significant traffic declines after the notorious September 2023 Helpful Content Update, plus other recent Google algorithm updates, were hopeful that the March Core Update would result in some reversals and increased traffic.There were a growing number of reports of spam, hacked content, and low-quality information infiltrating Google’s results, particularly tied to the proliferation of AI-generated content.In response to various complaints and feedback about the quality of its search results and opportunities to improve, Google indicated on multiple occasions that big changes were coming to address these problems. In-person tickets are 95% sold out; grab yours now while you can! Save $300 with our Night Owl tickets, ending on May 24. So, now that the March Core Update has formally concluded, what have we learned? Below are four major observations and outcomes of this 45-day update, some of which were trends that started brewing before the update started but were solidified during its rollout: Reddit is a major winner of SEO traffic and visibility One of the most significant outcomes of the March Core Update, and the months leading up to it, was the rapid SEO visibility growth of Reddit in particular. This huge increase began in the fall of 2023 and was closely tied to Google’s announcement of its “Hidden Gems” update, aimed at increasing the visibility of forum and discussion content in the search results. For many types of queries and categories — including health, financial, commercial, product review, adult, AI, celebrities, and other topics — Reddit has seen an enormous surge in organic traffic. Google also often shows multiple sitelinks for Reddit, so one organic result could link to up to 8 URLs within Reddit: Google and Reddit also recently announced a partnership in which Google will pay Reddit $60 million annually for direct access to its API for training purposes. As part of this partnership, Google will “facilitate more content-forward displays of Reddit information,” which likely means more ‘Discussions and Forums’ SERP features appearing in search, although this was not confirmed by Google. Research by Tom Capper matches this assumption, as he found that Reddit results in discussions and forums SERP features increased from 0.1% to 1.3% year-over-year. Image source However, Google has stated that \"Our agreement with Reddit absolutely did not include ranking its content higher on Search.\" Regardless of the reason for the massive increases in organic visibility and traffic, the outcome is the same: Reddit has become a major SEO competitor to nearly every site on the internet. According to Moz, Reddit’s biggest organic competitors are YouTube, Instagram, and Facebook, with 34.2 million ranking keywords. But Reddit’s surge in rankings across all types of content means many more sites are now competing with Reddit for visibility in search. The charts below show how Reddit’s visibility compares to that of some prominent websites in different categories (Forbes, New York Times, ESPN, and Home Depot) in terms of shared keywords and overall Visibility Index score (according to Sistrix). In each case, Reddit places at the top of overall SEO visibility and/or the greatest amount of shared keywords with these four different companies. Additionally, many sites that have lost substantial traffic and visibility with recent updates, including the March Core Update, fell into some of the same categories where Reddit experienced significant traffic growth, such as entertainment and gaming content (/r/movies, /r/anime, /r/switch) and product reviews (/r/buyitforlife). Drop in visibility for news and affiliate websites While Reddit surged in new SEO visibility and traffic, another major category of sites saw a significant decline: thousands of informational sites — including many popular news and media websites — that monetize through display ads and affiliate links. These sites include news and publisher websites, product reviews, travel or recipe blogs, lyrics websites, entertainment and gaming news, rumors and reviews, and other types of informational content. It’s important to note that correlation is not causation: the ads and the affiliate links are not the singular cause of SEO issues — but there appears to be a significant correlation between informational sites whose monetization strategy relies on display ads and/or affiliate links, and traffic drops stemming from the March Core Update. This pattern is consistent with a more significant trend affecting these types of sites over the past few years, but the impact has ramped up in recent months. The letter “A” in the below chart represents the start of the March Core Update when these six popular news websites saw a gradual decline in visibility. But looking back over the past nine months, this drop is part of a larger trend. The September 2023 Helpful Content Update also appears to have disproportionately impacted informational websites monetizing with affiliate links and ads. The below chart shows the total aggregated SEO visibility changes — in terms of Sistrix Visibility Index numbers — resulting from the March Core Update. As you can see, the category labeled “News & Media” was the greatest overall loser, with a combined loss of -461 visibility points for all 151 domains in that category. While it’s important to note that Sistrix does not count visibility from Google Top Stories, Google Discover, and/or Google News in its Visibility Index, these drops are relative to where the sites positioned at the start of the March Core Update, representing an enormous loss in visibility among news and informational sites within the organic links on Google’s first page. Using the tool Builtwith, which identifies whether sites are using ads, the below chart cross-references the categories of winners and losers from the March Core Update with the percentage of sites in those categories using ads. Absolute winners and losers represent the total visibility change gained or added, and percentage winners and losers represent the average percentage change between the start and end of the March Core Update. “Absolute losers,” the category with the greatest overall losses in visibility, had a 79% rate of sites labeled as using ads, according to BuiltWith, followed by 75% for percentage losers. On the flip side, the biggest category winners fell into two major categories: “Ecommerce and Shopping,” largely driven by the growth of Amazon (+531 visibility points) and eBay (+51 points), along with “Computers, Electronics and Technology,” which contains Instagram (+208 points), Reddit (+155 points), Facebook (+84 points), and Twitter (+78 points). Greatest absolute winners of the March Core Update Google claims a 45% reduction in unhelpful content At the start of the March Core and Spam updates, Google claimed it intended to reduce unhelpful content in search by 40%. After the conclusion of the March Core Update on April 19 (which Google announced seven days after the fact), Google then clarified that it had actually reduced unhelpful content by 45%. One of the main drivers of this drop in unhelpful content likely stemmed from the “pure spam” manual actions issued to thousands of sites during the March Spam Update, which began rolling out on March 5 and concluded on March 20. Soon after the conclusion of the March Spam update, lists of affected sites and analyses began circulating within the SEO industry, such as this Originality.ai article that provided a deep dive into the role of AI content in affected websites. According to this study, many affected websites used generative AI to mass-auto-generated content — which is precisely what Google aimed to target with its new policy related to “scaled content abuse.” While sites were able to get away with publishing AI-generated content with little editing or oversight for over a year, often with great SEO success, the March Spam Update gave a clear signal about how Google intends to treat this type of content and websites misusing AI to generate low-quality content at scale. The penalized sites were often using generative AI to create content answering popular questions, such as the net worth of popular celebrities, high-volume queries about popular hairstyles or fashion trends, or rumors and news about popular games. The ads were usually filled with aggressive advertising and showed no indication of real human authors or involvement. Many of the sites also showed a publishing velocity that would be difficult to accomplish for most smaller blogs using actual human writers — such as tens or hundreds of new articles daily — which could have been one of many flags Google used to identify scaled content abuse. No relief for Helpful Content Update sites (yet) Another source of the 45% drop in unhelpful content on Google likely stemmed from the massive declines in traffic and visibility stemming from websites affected by Google’s September Helpful Content Update. One of the most surprising outcomes of the March Core Update is that there are still no known traffic recoveries among sites affected by the September Helpful Content Update. In fact, most of the affected sites only saw further traffic and visibility declines. Google made some changes to the Helpful Content Update during the March Core Update and created a new FAQ page answering common questions about these changes. While Google previously had a dedicated ranking system to determine “Helpful Content” and apply a negative classifier to domains showing too much “unhelpful content,” the March Core Update consolidated this system into Google’s core ranking systems. Google now “uses a variety of signals and systems” to identify the helpfulness of a website. Many site owners believed — and hoped — that this change to Google’s ranking systems would produce some recoveries from the websites that lost a significant amount of website traffic — often over 80%, since the start of the September Helpful Content Update. Unfortunately for those sites, the March Core Update often exacerbated the effect of the September update. The below chart shows six websites affected by the Helpful Content Update — which saw an enormous decline starting around September 17, 2023 (labeled as letter B in the chart) and further dropping with the March Core Update (letter E). While Google has not provided a specific timeframe for these sites to expect any type of traffic recovery, they have recently indicated that recovery is possible with the right amount of effort and time. According to John Mueller: “It's just that some kinds of changes take a long time to build up, and that applies to all kinds of systems & updates in Google & in any other larger computer system. Saying that this is specific to the helpful content system, or to core updates would be wrong & misleading. There is, however, the additional aspect of the \"core update\" being about how our systems assess content overall, how we consider it to be helpful, reliable, relevant to users' queries. This does not map back to a single change that you can make on a website, so - in my experience - it's not something that a website can just tweak overnight and be done with it. It can require deep analysis to understand how to make a website relevant in a modern world, and significant work to implement those changes -- assuming that it's something that aligns with what the website even wants.” This guidance is somewhat promising for the many site owners hoping for any glimmer of hope after losing the majority of their SEO traffic in recent months, but for many sites, the revenue losses stemming from this 8-month drop in traffic have made it hard to sustain the business, leading to many shared complaints from site owners across X, LinkedIn, Google’s forums and comments on SEO publications. Continuous changes after formal end to core update Algorithmic volatility continues in the weeks after the update formally concluded. The last portion of the algorithm update — the “site reputation abuse” component, began on May 5 and continues rolling out algorithmically to this day. This component came with significant manual actions being sent to major sites deemed as abusing their sites’ reputation for SEO opportunities. However, beyond these manual actions, Google’s algorithms continued to show unusual volatility in recent days, with a high MozCast weather report of 108 degrees on May 11. Perhaps Google continues to tweak and refine the outcomes of these updates to ensure they are achieving the quality results they aimed for. However, for the site owners affected by these huge swings over the course of months, many are ready for the volatility to finally stabilize. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "March Core Update & Spam Updates: Four Major Trends"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "March Core Update & Spam Updates: Four Major Trends"
    },
    {
      "level": "H2",
      "text": "Reddit is a major winner of SEO traffic and visibility"
    },
    {
      "level": "H2",
      "text": "Drop in visibility for news and affiliate websites"
    },
    {
      "level": "H2",
      "text": "Google claims a 45% reduction in unhelpful content"
    },
    {
      "level": "H2",
      "text": "No relief for Helpful Content Update sites (yet)"
    },
    {
      "level": "H2",
      "text": "Continuous changes after formal end to core update"
    },
    {
      "level": "H2",
      "text": "Learn from the best in the industry."
    },
    {
      "level": "H2",
      "text": "Learn from the best in the industry."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    }
  ],
  "author": "Lily Ray\n          \n            Lily Ray\n          \n            Lily Ray"
}