{
  "url": "https://moz.com/blog/marketing-lessons-from-accidentally-enraging-an-island-citystate",
  "slug": "marketing-lessons-from-accidentally-enraging-an-island-citystate",
  "title": "11 Marketing Survival Lessons Learned from Accidentally Enraging an Island City-State - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "600,000 unique visitors flooded in to read the post and half of them were not happy with me. This post outlines the 11 most important marketing lessons I learned from accidentally enraging a good portion of the island of Singapore.",
  "content": "11 Marketing Survival Lessons Learned from Accidentally Enraging an Island City-State Blogging By: Danny Dover December 4, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Danny Dover December 4, 2013 11 Marketing Survival Lessons Learned from Accidentally Enraging an Island City-State Blogging The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. My initial response to the massive traffic increase was not exactly professional. \"HOLY FREAKING CRAP BALLS!\", I blurted out. I searched the room for a fellow nerd to share my e-thusiasm with, but only found a room full of strangers eating sandwiches. Over the course of the next few days, the post received more than 600,000 unique visitors. If you segment the traffic to only include visits from Singapore, the number of unique visitors is equivalent to 10% of the entire population of the country (although admittedly this metric is a bit inflated due to people reading the post on multiple devices.) Some context I support myself financially as a storytelling consultant. On a day-to-day level this means I work on marketing strategy, creative writing, and web development. Admittedly it is a weird mix, but I enjoy the lifestyle. I am currently living in Vietnam, but recently spent two months living in Singapore. Like I do with all of my travels, I penned a blog post about my experience living in Singapore and hit publish. You can read the entire post here, but the quick summary is: Singapore has accomplished a lot in a short amount of time. I am deeply concerned that the societal and cultural costs of these accomplishments are harming the populace (I cited concerning data points related to stress). I have limited time and resources, and will not be returning to Singapore. My blog is fairly well read, so I was surprised that this post started out as one of my least-read posts. After a few days the post was, for most intents and purposes, just another link in the archive. Last Wednesday, I grabbed my normal Vietnamese breakfast (a local sandwich called a Bánh mì and a coconut milk-based smoothie) and went into my co-working office to start on my to-do list for the day. I have been trying to convert bad online habits into good ones, so when I found myself craving a peek at Facebook, I clicked on my Google Analytics shortcut instead. It opened up my real-time report, and I practically dropped my meal. Marketing lessons learned The next few days were the craziest marketing adventure that I have ever had. The following are the key lessons I learned from this experience: 1. Honesty is power I think the key reason that this post resonated with people was that it was uncommonly honest. (This is a trait I picked up from Rand when I worked at Moz. It isn't a marketing trait, it is a life trait.) This post was published on my personal blog where I don't have any ads or up-sells. I write posts there solely because I enjoy writing. In this case, I thought I had some interesting insights about Singapore and wanted to share my honest thoughts. The power in this was that when people read it, they too wanted to share my thoughts (along with their own!) with their online friends. 2. Be conscious of the clickstream In the post I cited some suicide statistics that were quite alarming. As the thousands of comments about the post came in (mostly via Facebook), I continually received the criticism that my data was incorrect. I triple-checked my sources (they checked out) and tried to reply to as many of the false claims of bad data as possible. It wasn't until two days later that I realized that people Googling the statistics were taken straight to a Wikipedia article that listed outdated data. After I updated the Wikipedia article to include the most recent data, the data criticism comments immediately stopped. I could have saved myself a giant headache if I had just viewed the situation from the readers' perspective and found the misinformation on Wikipedia earlier. 3. Be a first-responder As the comments came in, I was alerted (rudely and repeatedly) that I had erroneously cited a date as 2011 rather than 2001. My first thought was just to subtly update the number but was worried this might start a backlash. For this reason, I called Jessica Dover. Jessica has worked on social media strategy for many of the world's most well known celebrities and has solved more social media problems than I have followers. (Disclaimer: She also happens to be my sister, but I honestly think that has hindered her more than helped her :-p. Her success is hard-earned and her own.) Without hesitation, she told me exactly what to do. Publicly thank the readers for all of their feedback. Acknowledge that you are listening to them. Acknowledge the error and then actually fix it. This strategy worked wonders. I fixed my mistake and the amount of comments on the blog post quadrupled (after the audience was reassured that I was listening and responding). Huge win! If you don't have your own social media mentor like Jessica, Moz's Q&A can be a great source of information. 4. Patch the holes in your net At the onset, I was receiving a lot of traffic but none of it was converting (my conversion events were email captures and social follows). When I couldn't fix this myself, I called another member of my marketing SWAT team, Joe Chura. Joe runs an agency called Launch Digital Marketing. I think they are the most underrated team in the industry. In no time, they had a plan. Following their advice I installed two WordPress plugins: MailChimp for WordPress Lite: There are lots of plugins that add MailChimp to a WordPress site but this is the only one that I know of that adds an opt-out check box below your comment reply box. If your readers are already entering their e-mail address in order to leave a comment, they might as well be asked if they want to sign up for your newsletter. For the text box, I used the text \"I want to be kept up-to-date on Life Listed and receive free resources!\" Flare: This is my favorite social media sharing plugin (there are countless other options). This version is technically no longer under active development (they are building a new version to replace it), so I had disabled it on my site. Launch convinced me to re-add it. After I added these plugins, it doubled the size of my mailing list and started what eventually became a viral spread of the blog post on Twitter. These were huge wins. (Hat tip to Dan Andrews for being at the forefront of that Twitter storm.) Again, if you don't have your own marketing SWAT team, Moz's Q&A can be a great resource. 5. If you have to think about server optimization, it is too late Throughout the entire process my server never went down. I credit this to two things: First, props to WPengine (my host) for being seamless. They handled the spike without any hiccups or annoying interruptions. I will likely have to pay an overage fee but that is a MUCH better option than having a site outage. Second, I credit preparation. I have long been using a tool called http://gtmetrix.com/ to diagnose speed problems on my site. (Hat tip to Jon over at Raven for introducing this tool to me). I love this tool because it combines the Google Page Speed tool and Yahoo's YSlow into one convenient and easy to understand interface. Luckily, I had implemented all of the recommended fixes well before this traffic spike. I am kind of a speed optimization nerd. :-p 6. Take comfort in the negativity slope When I first posted the blog post, no one cared. When it started to gain some traction, I was immediately told how stupid it and I were. As it gained momentum the amount of naysayers increased. It wasn't until the post reached full velocity that the supporters started to outnumber the naysayers. This has been a trend that I have observed with all of my successful content. I now take comfort in knowing that it is going to get worse until it suddenly gets better. Negativity online is a slope, and luckily it does have a peak. 7. Facebook's walled garden is much worse than it was before Facebook once offered a tool called Facebook Insights for Domains. This tool allowed you to get valuable information on any traffic that was referred to your verified domain from Facebook. Unfortunately, Facebook has killed it off. When my post went viral on Facebook, I had no visibility other than that the traffic was coming from Facebook and Facebook mobile. I had no idea what pages or groups the applicable conversations were happening on, and thus had no way to respond to conversations happening behind the wall. This was a huge frustration throughout the whole process. 8. A rising tide… When people came to my website to read the Singapore post, many of them checked out my other posts as well (this is to be expected). In response to this, I published a post that I thought would also be applicable to the new readers. Due to the increased visibility, this post (on useful money philosophies) subsequently went mildly viral. This in turn drove even more conversions. 9. Be aware of parallel universes Stories exist in parallel universes: What the storyteller experiences The story the storyteller shares The story as the audience members understand it These are all very different stories! Many of the comments, compliments and criticism that I received about the Singapore post had absolutely nothing to do with the words written in my article. For many, it was their personal experiences, not my blog post, that drove their responses. At first, this was a major frustration point for me. It wasn't until I mapped out the perspectives in the above list that I calmed down and started to appreciate the storytelling experience. 10. Listen first, then wait, then react When the responses came in, I was vastly outnumbered (it was literally 500,000 to 1)! The only way I was able to deal with that amount of volume was to listen, learn from an expert (see lesson 3), collect data, process that data, and then react. I let the first several dozen comments come in before I started to respond. I think this was critical in me being able to follow and supplement the large-scale discussion. 11. Titles are 60% of the battle The click-worthiness of the blog post title was a major contributing factor to its success. (Second only to its honesty). Admittedly it was an attention-grabbing title but at the same time it was true. I actually will never be returning to Singapore. I didn't perform any keyword research or A/B tests when picking the blog post title. Instead, I just picked something that I figured I would want to click. The best titles are always that simple. When I look back on this marketing adventure, I feel thankful. The world, not just Singapore, is in an amazing state of change right now. I am glad that my little voice was able to contribute a little bit to the global discussion. If you would like to hear about other marketing adventures, feel free to connect with me on Google+. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "11 Marketing Survival Lessons Learned from Accidentally Enraging an Island City-State"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "11 Marketing Survival Lessons Learned from Accidentally Enraging an Island City-State"
    },
    {
      "level": "H2",
      "text": "Some context"
    },
    {
      "level": "H2",
      "text": "Marketing lessons learned"
    },
    {
      "level": "H3",
      "text": "1. Honesty is power"
    },
    {
      "level": "H3",
      "text": "2. Be conscious of the clickstream"
    },
    {
      "level": "H3",
      "text": "3. Be a first-responder"
    },
    {
      "level": "H3",
      "text": "4. Patch the holes in your net"
    },
    {
      "level": "H3",
      "text": "5. If you have to think about server optimization, it is too late"
    },
    {
      "level": "H3",
      "text": "6. Take comfort in the negativity slope"
    },
    {
      "level": "H3",
      "text": "7. Facebook's walled garden is much worse than it was before"
    },
    {
      "level": "H3",
      "text": "8. A rising tide…"
    },
    {
      "level": "H3",
      "text": "9. Be aware of parallel universes"
    },
    {
      "level": "H3",
      "text": "10. Listen first, then wait, then react"
    },
    {
      "level": "H3",
      "text": "11. Titles are 60% of the battle"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Danny Dover\n          \n            Danny Dover\n          \n            Danny Dover"
}