{
  "url": "https://moz.com/blog/marketing-conferences",
  "slug": "marketing-conferences",
  "title": "The Case For & Against Attending Marketing Conferences - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "How do you measure the ROI of attending a marketing conference? It's less about the numbers and more about the results. Rand explains the rationale behind why he believes conferences are worth the investment and shares his own personal list of favorites.",
  "content": "The Case For & Against Attending Marketing Conferences SEO Events | Marketing Industry By: Rand Fishkin June 22, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin June 22, 2017 The Case For & Against Attending Marketing Conferences SEO Events | Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I just finished reading Jan Schaumann's short post on Why Companies Should Pay for Their Employees to Attend Conferences. I liked it. I generally agree with it. But I have more to add. First off, I think it's reasonable for managers and company leaders to be wary of conferences and events. It is absolutely true that if your employees attend them, there will be costs associated, and it's logical for businesses to seek a return on investment. What do you sacrifice when sending a team member to an event? Let's start by attempting to tally up the costs: Lost productivity – Usually on the order of 1 to 4 days depending on the length of the event, travel distance, tiredness from travel, whether the team member does some work at the event or makes up with evenings/weekends, etc. Given marketing salaries ranging from $40K–$100K, this could be as little as $150 (~1 day's cost at the lower end) to $1,900 (a week's cost on the high end). Cost of tickets – In the web marketing world, the range of events is fairly standard, between ~$1,000 and $2,000, with discounts of 20–50% off those prices for early registration (or with speaker codes). Some examples: CTAConf in Vancouver is $999 ($849 if you're an Unbounce customer) Content Marketing World in Cleveland is $1,195 (early rate) or $1,395 later Pubcon Las Vegas in $1,099 (early rate), not sure what it goes up to HubSpot's INBOUND is $1,299 (or $1,899 for a VIP pass) SMX East is $1,795 (or $2,595 for all access) SearchLove London is $890 (or $1,208 for VIP) MozCon in Seattle is $1,549 (or $1,049 for Moz subscribers) Cost of travel and lodging – Often between $1,000–$3,000/person depending on location, length, and flight+hotel costs. Potential loss of employee through recruitment or networking – It's a thorny one, but it has to be addressed. I know many employers who fear sending their staff to events because they worry that the great networking opportunities will yield a higher-paying or more exciting offer in the future. Let's say that for every 30 employees you send (or every 30 events you send an employee to), you'll lose one to an opportunity that otherwise wouldn't have had them considering a departure. I think that's way too high (not because marketers don't leave their jobs but because they almost always leave for reasons other than an opportunity that came through a conference), but we'll use it anyway. On the low end, that might cost you $10K (if you've lost a relatively junior person who can be replaced fairly quickly) and on the high end, might be as much as $100K (if you lose a senior person and have a long period without rehiring + training). We'll divide that cost by 30 using our formula of one lost employee per thirty events. Total: $4,630–$10,230 That's no small barrier. For many small businesses or agencies, it's a month or two of their marketing expenses or the salary for an employee. There needs to be significant return on those dollars to make it worthwhile. Thankfully, in all of my experiences over hundreds of marketing events the last 12 years, there is. What do you gain by sending a team member to an event? Nearly all the benefits of events come from three sources: the growth (in skills, relationships, exposure to ideas, etc) of the attendee(s), applicable tactics & strategies (including all the indirect ones that come from serendipitous touch points), and the extension of your organization's brand and network. In the personal growth department, we see benefits like: New skills, often gained through exposure at events and then followed up on through individual research and effort. It's absolutely true that few attendees will learn enough at a 30-minute talk to excel at some new tactic. But what they will learn is that tactic's existence, and a way to potentially invest in it. Unique ideas, undiscoverable through solo work or in existing team structures. I've experienced this benefit myself many times, and I've seen it on Moz's team countless times. The courage, commitment, inspiration, or simply the catalyst for experimentation or investment. Sometimes it's not even something new, or something you've never talked about as a team. You might even be frustrated to find that your coworker comes back from an event, puts their head down for a week, and shows you a brilliant new process or meaningful result that you've been trying to convince them to do for months. Months! The will to do new things strikes whenever and however it strikes. Events often deliver that strike. I've sat next to engineers whom I've tried to convince for years to make something happen in our tools, but when they see a presenter at MozCon show off another tool that does it or bemoan the manual process currently required, they suddenly set their minds to it and deliver. That inspiration and motivation are priceless. New relationships that unlock additional skill growth, amplification opportunities, business development or partnership possibilities, references, testimonials, social networking, peer validation, and all the other myriad advancements that accompany human connections. Upgrading the ability to learn, to process data and stories and turn them into useful takeaways. Alongside that, upgraded abilities to interact with others, form connections, learn from people, and form or strengthen bonds with colleagues. We learn, even in adulthood, through observation and imitation, and events bring people together in ways that are more memorable, more imprinted, and more likely to resonate and be copied than our day-to-day office interactions. A gentleman at SearchLove London 2016 gives me an excellent (though slightly blurry) thumbs up In the applicable tactics & strategies, we get benefits like: New tools or processes that can speed up work, or make the impossible possible. Resources for advancing skills and information on a topic that's important to one's job or to a project in particular. Actionable ideas to make an existing task, process, or result easier to achieve or more likely to produce improved results. Bigger-picture concepts that spur an examination of existing direction and can improve broad, strategic approaches. People & organizations who can help with all above, formally or informally, paid as consultants, or just happy to answer a couple questions over email or Twitter. Purna Virji at SMX Munich 2017 In the extension of organizational brand/network, we get benefits like: Brand exposure to people you meet and interact with at conferences. Since we know the world of sales & marketing is multi-touch, this can have a big impact, especially if either your customers or your amplification targets include anyone in your professional field. Contacts at other companies that can help you reach people or organizations (this benefit has grown massively thanks to the proliferation of professional social networks like those on LinkedIn and Twitter) Potential media contacts, including the more traditional (journalists, news publications) and the emerging (bloggers, online publishers, powerful social amplifiers, etc) A direct introduction point to speakers and organizers (e.g. if anyone emails me saying \"I saw you speak at XYZ and wanted to follow up about...\" the likelihood of an invested reply goes way up vs. purely online outreach) But I said above that these three included \"nearly all\" the benefits, didn't I? :-) Daisy Quaker at MozCon Ignite It's true. There are more intangible forms of value events provide. I think one of the biggest is the trust gained between a manager and their team or an employer and their employees. When organizations offer an events budget, especially when they offer it with relative freedom for the team member to choose how and where to spend it, a clear message is sent. The organization believes in its people. It trusts its people. It is willing to sacrifice short-term work for the long-term good of its people. The organization accepts that someone might be recruited away through the network they gain at an event, but is willing to make the trade-off for a more trusting, more valuable team. As the meme goes: CFO: What if we invest in our people and they leave?CEO: What if we don’t and they stay? Total: $A Lot? How do you measure the returns? The challenge comes in because these are hard things for which to calculate ROI. In fact, any number I throw out for any of these above will absolutely be wrong for your particular situation and organization. The only true way to estimate value is through hindsight, and that means having faith that the future will look like the past (or rigorous, statistically sound models with large sample sizes, validated through years of controlled comparison... which only a handful of the world's biggest and richest companies do). It's easy to see stories like \"The biggest deals I've ever done, mostly (80%) came from meeting people at conferences\" and \"I've had the opportunity to open the door of conversations previously thought locked\" and \"When I send people on my team I almost always find they come back more inspired, rejuvenated, and full of fire\" and dismiss them as outliers or invent reasons why the same won't apply to you. It's also easy explain away past successes gained through events as not necessarily requiring the in-person component. I see this happen a lot. I'm embarrassed to say I've seen it at Moz. Remember last summer, when we did layoffs? One of the benefits cut was the conference and events budget for team members. While I think that was the right decision, I'm also hopeful & pushing for that to be one of the first benefits we reinstate now that we're profitable again. Lexi Mills at Turing Festival in Edinburgh Over the years of my event participation, first as an attendee, and later as a speaker, I can measure my personal and Moz's professional benefits, and come up with some ballpark range. It's harder to do with my team members because I can't observe every benefit, but I can certainly see every cost in line-item format. Human beings are pretty awful in situations like these. We bias to loss aversion over potential gain. We rationalize why others benefit when we don't. We don't know what we're missing so we use logic to convince ourselves it's ROI negative to justify our decision. It's the same principle that often makes hard-to-measure marketing channels the best ROI ones. Some broader discussions around marketing event issues Before writing this post, I asked on Twitter about the pros and cons of marketing conferences that folks felt were less often covered. A number of the responses were insightful and worthy of discussion follow-ups, so I wanted to include them here, with some thoughts. If you're a conference organizer, you know how tough a conversation this is. Want to bring in outside food vendors (which are much more affordable and interesting than what venues themselves usually offer)? 90% of venues have restrictions against it. Want to get great food for attendees? That same 90% are going to charge you on the order of hundreds of dollars per attendee. MozCon's food costs are literally 25%+ of our entire budget, and considering we usually break even or lose a little money, that's huge. If you're a media company and you run events for profit, or you're a smaller business that can't afford to have your events be a money-losing endeavor, you're between a rock and a hard place. At places like MozCon and CTAConf, the food is pretty killer, but the flip side is there's no margin at all. Many conferences simply can't afford to swing that. Totally agree with Ross — interesting one, and pros/cons to each. At smaller shows, I love the more intimate connections, but I'm also well aware that for most speakers, it's a tough proposition to ask for a new presentation or to bring their best stuff. It's also hard to get many big-name speakers. And, as Ross points out, the networking can be deeper, but with a smaller group. If you're hoping to meet someone from company X or run into colleagues from the past, small size may inhibit. For years prior to MozCon, I'd only ever been to events with a couple keynotes and then panels of 3–6 people in breakout sessions the rest of the day. I naively thought we'd invented some brilliant new system with the all-keynote-style conference (it had obviously been around for decades; I just wasn't exposed to it). It also became clear over time that many other marketing conferences had the same idea and today, it's an even split between those that do all-keynotes vs. those with a hybrid of breakouts, panels, and keynotes. Personally, my preference is still all-keynote. I agree with Greg that, on occasion, a speaker won't do a great job, and sitting through those 20–40 minutes can be frustrating. But I can count on a single hand the number of panel sessions I've ever found value in, and I strongly dislike being forced to choose between sessions and not sharing the same experience with other attendees. Even when the session I've chosen is a good one, I have FOMO (\"what if that other session around the corner is even better?!\") and that drives my quality of experience down. This, though, is personal preference. If you like panels, breakouts, and multi-track options, stick to SMX, Content Marketing World, INBOUND, and others like them. If you're like me and prefer all keynotes, single track, go for CTAConf, Searchlove, Inbounder, MozCon, and their ilk. I agree this is a real problem. Being a conference organizer, I get to see a lot of the feedback and requests, and I think that's where the issue stems from. For example, a few years back, Brittan Bright, who now does sales at Google in New York, gave a brilliant talk about the soft skills of selling and client relations. It scored OK in the lineup, but a lot of the feedback overall that year was from people who wanted more \"tactical tips\" and \"technical tricks\" and less \"soft skills\" content. Every conference has to deal with this demand and supply issue. You might respond (as my friend Wil Reynolds often does) with \"who cares what people say they want?! Give them what they don't know they need!\" That's how conferences go broke, my friends. :-) Every year, we try to include at least a few sessions that focus on these softer skills (in numerous ways), and every year, there's pushback from folks who wish we'd just show them how to get more easy links, or present some new tool they haven't heard of before. It's a tough give and take, but I'm empathetic to both sides on this issue. Actionable tactics matter, and they make for big, immediate wins. Soft skills are important, too, but there's a significant portion of the audience who'll get frustrated seeing talks on these topics. Hrm... I think I agree more with Freja than with Herman, but it's entirely a personal preference. If you know yourself well enough to know that you'll benefit more (or less) by attending with others from your team, make the call. This is one reason I love the idea of businesses offering the freedom of choice on how to use their event budget. There were a number of these conflicting points-of-view in reply to my tweet, and I think they indicate the challenge for attendees and organizers. Opinions vary about what makes for a great conference, a great speaker or session, or the best way to get value from them. Which marketing conferences do I recommend? I get this question a lot (which is fair, I go to *a lot* of events). It really depends what you like, so I'll try to break down my recommendations in that format. Big, industry-wide events with many thousands of attendees, big name keynotes, famous musical acts, and hundreds of breakout session options: INBOUND by Hubspot (Boston, MA 9/25–9/28) is a clear choice here. If you craft your experience well, you can get an immense amount of value. Content Marketing World (Cleveland, OH 9/5–9/8) is always a good show, and they've recently focused on getting more gender-diverse. Dreamforce by Salesforce (San Francisco, CA 11/6–11/9) has a similar feel to INBOUND in size and format, though it's generally more classic sales & marketing focused, and has less programming that overlaps with our/my world of SEO, social media, content marketing, etc. Web Summit (Lisbon, Portugal 11/6–11/9) is even broader, focusing on technology, startups, entrepreneurship, and sales+marketing. If you're looking to break out of the marketing bubble and get a chance to see some \"where are we going\" and \"what's driving innovation\" content, this is a good one. SMX Munich (Munich, Germany 3/20–3/21 2018) is one of the best produced and best attended shows in Europe. This event consistently delivers great presentations. Because of its location on the calendar, it's also where many speakers debut their theses and tactics each year, and since it's in Germany (or, more probably because it's run by the amazing Sandra & Matthew Finlay), everything is executed to perfection. Mid-tier events with 1,000–1,500 attendee: MozCon by Moz (Seattle, WA 7/17–7/19) I'm obviously biased, but I also get to see the survey data from attendees. The ratings of \"excellent\" or \"outstanding\" and the high number of people who buy tickets for the following year within a few days of leaving give me confidence that this is still one of the best events in the web marketing world. CTAConf by Unbounce (Vancouver, BC 6/25–6/27) Oli Gardner, who's become an exceptional speaker himself, works directly with every presenter (all invitation-only, like MozCon) to make sure the decks are top notch. In addition, the setting in Vancouver, the food trucks, the staging, the networking, and the kindness of Canada are all wonderful. Inbounder (Valencia, Spain 5/2018) This event only happens every other year, but if 2016 was anything to judge by, it's one of Europe's best. Certainly, you won't find a more incredible city or a better location. The conference hall is inside a spaceship that's landed on a grassy park surrounding an ancient walled city. Even Seattle's glacier-ringed beauty can't top that. ConversionXL Live (Austin, TX 3/28–3/30) Peep Laja and crew put on a terrific event with a lovely venue and clear attention paid to the actionable, tactical value of takeaways. I came back from the few sessions I attended with all sorts of suggestions for the Moz team to try (if only webdev resources weren't so difficult to wrangle). SMX Advanced (Seattle, WA TBD 2018) I haven't been in a couple years, but many search marketers rave about this show's location, production quality, panels, and speakers. It's one of the few places that still attracts the big-name representatives from Google & Bing, so if you want to hear directly from the horse's mouth a few seconds before it's broadcast and analyzed a million ways on Twitter, this is the spot. Outside The Inbounder Conference in Valencia, Spain Smaller, local, & niche events with a few hundred attendees and a more intimate setting: SearchLove (San Diego, Boston, & London 10/16–10/17) It's somewhat extraordinary that this event remains small, like a hidden secret in the web marketing world. The quality of content and presentations are on par with MozCon (as are the ratings, and I know from other events how rare those are), but the settings are more intimate with only 2-300 participants in San Diego & Boston, and a larger, but still convivial crowd of 4-600 in London. I personally learn more at Searchlove than any other show. Engage (formerly Searchfest) The SEMPDX crew has always had a unique, wonderful event, and Portland, OR is one of my favorite cities to visit. MNSearch (Minneapolis 6/23) One of the exciting up-and-coming local events in our space. The MNSearch folks have brought together great speakers in fun venues at a surprisingly affordable price, and with some killer after-hours events, too. I've been twice and was very impressed both times. This list is by no means exhaustive, and I'm certain there are many other events that give great value. I can only speak from my own experiences, which are going to carry the bias of what I've seen and what I like. Help us better understand the value of conferences to you Two years ago, I ran a survey about marketing conferences and received, analyzed, then published the results. I'd like to repeat that again, and see what's changed. Please contribute and tell us what matters to you: Take the survey here I look forward to the discussion in the comments. If the Twitter thread was any indication, there's a lot of passion and interest around this topic, one that I share. And of course, if you'd like to chat in person about this and see how we're doing things at Moz, I hope you'll consider MozCon in just a few weeks in Seattle. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Case For & Against Attending Marketing Conferences"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Case For & Against Attending Marketing Conferences"
    },
    {
      "level": "H2",
      "text": "What do you sacrifice when sending a team member to an event?"
    },
    {
      "level": "H2",
      "text": "What do you gain by sending a team member to an event?"
    },
    {
      "level": "H2",
      "text": "How do you measure the returns?"
    },
    {
      "level": "H2",
      "text": "Some broader discussions around marketing event issues"
    },
    {
      "level": "H2",
      "text": "Which marketing conferences do I recommend?"
    },
    {
      "level": "H2",
      "text": "Help us better understand the value of conferences to you"
    },
    {
      "level": "H4",
      "text": "Take the survey here"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}