{
  "url": "https://moz.com/blog/marketing-jobs-shift-paradigms-with-internet-marketing-gaining-ground",
  "slug": "marketing-jobs-shift-paradigms-with-internet-marketing-gaining-ground",
  "title": "Marketing Jobs Shift Paradigms, with Internet Marketing Gaining Ground - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Marketing jobs are changing their required skill sets. Traditionally, direct marketing and sales jobs, except marketing management jobs, relied more upon skills with the spoken word rather than the written, but marketing jobs online have a reverse requirement. Consequently, it's a good job market…",
  "content": "Marketing Jobs Shift Paradigms, with Internet Marketing Gaining Ground Online Advertising M By: MarketingGenius June 15, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! M By: MarketingGenius June 15, 2007 Marketing Jobs Shift Paradigms, with Internet Marketing Gaining Ground Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Marketing jobs are changing their required skill sets. Traditionally, direct marketing and sales jobs, except marketing management jobs, relied more upon skills with the spoken word rather than the written, but marketing jobs online have a reverse requirement. Consequently, it's a good job market today for college graduates, but not as easy for those with only high school degrees. Marketers must point customers to the product A marketing executive focuses on helping the customer discover his or her product's benefits and differentiates it from competitors' products to make a sale. Ever since the information boom ratcheted up due to Internet content, most customers search the Internet for products. They perceive the benefits of a chosen product from information available on the Internet. They even find the addresses of offline product outlets from the Internet. And then they make their purchase, whether offline or online. So marketing jobs that valued interpersonal skills are getting rarer. Interpersonal skills are now seen more as part of a managerial skill set required to manage human resources rather than an essential part of the marketing executive's arsenal. Marketers must understand search engines Search engine optimization of content and marketing to search engines is now the in-thing in the world of marketing. Rather than engaging in situations where exposure to product information is decidedly passive, interactive advertising in the internet appeals more to the consumer, for he/she can actively participate in the communication process. A research study by comScore Networks released on March 21, 2006 showed that while only 25% searchers on the Internet bought an item related with their searches, a major 63% of the purchasers made their purchase offline after gaining the information from the Internet. Today, the consumer purchasing a product in a market is mostly doing so without being personally influenced by a marketing or sales representative. Marketers must ask why their customers prefer web searches Marketing meant for a specific geographical market has been destabilized because sites with lots of hits are frequently global, and sites aimed at locals often have too low a profile to survive. When the customer does a web search, the local product without much advertising will be buried beneath hundreds or thousands of websites offering the competitor's product. The mass of information on the internet currently allows consumers to make observations that are more dispassionate and objective, rather than receiving solely what the marketer wants them to know. Coupled with the loss of personal connection with the consumer, brands also face the threat of adverse publicity on the Internet, which marketers cannot control. The net result is that the Internet forces companies to re-engineer themselves around Internet marketing. Marketers are losing their traditional roles The principal importance of the marketing executive in the field was centered on \"front-office, customer-facing\" activities. With the advent of Internet marketing this role is becoming obsolete. Take, for example, the role of a standard medical sales representative. The medical sales representative's job is to canvass doctors and other medical workers who generate sales and either prescribe the medicines or place bulk orders. Now doctors can find all the information they require on the Internet at their leisure, without wasting valuable work time with the medical sales representative. Understandably, more and more doctors now avoid meeting them. The situation's reflection on marketing jobs can be seen from a news brief on May 22—\"AstraZeneca to shed 300 marketing jobs, following February's announcement of 700 manufacturing job cuts.\" It is clear that the company is re-engineering itself. And as Chris Brinsmead, AstraZeneca UK company president said, \"We have recently re-aligned our primary care sales organization .... We have also introduced new ways of working that will better support the needs of our customers.\" We can make a safe guess that quite a few of those \"new ways of working\" revolve around Internet marketing. Marketers must exploit the Internet A veritable array of new marketing techniques and tools has appeared on the internet. Such new techniques include viral marketing, guerrilla marketing, permission marketing, affiliate marketing, blogging, and virtual community marketing like that in Second Life. So, within marketing, there's a skill-set shift underway. Marketing jobs for those who excel in written language skills are expanding, while direct marketing jobs relying mostly on spoken language skills for those below the managerial level have started to suffer from atrophy. http://www.marketingcrossing.com/article/index.php?id=220056 Latest Marketing Jobs Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Marketing Jobs Shift Paradigms, with Internet Marketing Gaining Ground"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Marketing Jobs Shift Paradigms, with Internet Marketing Gaining Ground"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "MarketingGenius\n          \n            MarketingGenius"
}