{
  "url": "https://moz.com/blog/markup-for-emails",
  "slug": "markup-for-emails",
  "title": "An Introduction to Schema.org Markup for Emails - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If you are a Gmail user, you have likely seen call-to-action buttons popping up in the subject lines of your emails. in this post, we're going to look at how Schema.org email markup works.",
  "content": "An Introduction to Schema.org Markup for Emails Email Marketing By: Kristi Hines April 29, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Kristi Hines April 29, 2015 An Introduction to Schema.org Markup for Emails Email Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. If you are a Gmail user, you have likely received some emails that stand out from the rest with a call to action button within the subject line. If you've booked a flight recently, your airline may have sent you an email that includes an interactive way to view your travel plans. Similarly, Google Inbox app users might have seen emails that look like this. These calls to action are courtesy of Schema.org markup for email. Just like Schema.org markup for web pages helps web pages stand out in search results, Schema.org markup for emails helps certain emails stand out from the rest in your inbox. The goal of email markup is to allow people to take action on emails as quickly and simply as possible. For marketers, there are both pros and cons of this feature. In this post, we're going to look at the email markup options currently available, who can use it, and if it's worth it. Should you use email markup?Email markup is currently available for Gmail email recipients only. The number of Gmail users was over 350 million in 2012. To determine whether you should use it, you shouldn't go off a three-year-old statistic, but rather a survey of your own email list or customer database. Most email service providers (like GetResponse, shown in the example below) allow you to search your subscriber list for specific criteria. Search yours for emails containing Gmail to determine the number of Gmail addresses your emails reach. Of course, this isn't the whole picture. There are likely more people that use Gmail for business with their own domains. So although their emails do not say Gmail, they open their emails in the Gmail web browser or app. Another consideration for using email markup is tracking. If you rely heavily on the ability to track email opens and clicks to trigger autoresponders and other marketing automation actions, you may not want to give your subscribers the option to bypass opening your email and clicking on your link. Once you've determined the approximate number of Gmail users you reach and whether you need the ability to track email actions, your next job is to see if you qualify to use email markup. Register for email markup with GoogleBefore you can use email markup, you must register with Google. Google will check to make sure you meet email sender quality guidelines, bulk sender guidelines, and action / schema quality guidelines. Here are some of the key guidelines you need to know. Emails must be authenticated via DKIM or SPF. The domain of your from email must match the signed-by or mailed-by header. You must send a minimum of a hundred emails per day to Gmail users for a few weeks before applying. Google will want to see that you have a very, very low rate of spam complaints from Gmail recipients. Bulk email guidelines include using the same IP address to send bulk mail, using the same from email address, only adding subscribers to your list that have opted in (preferably with a double opt-in or confirmation), and allowing list members to unsubscribe easily. These guidelines will not only help you get approved for use of email markup, but will also help your emails get delivered to more Gmail users without being marked as spam. Action / schema guidelines boil down to making sure you use the appropriate action markup when possible. When an action markup is not available, or the process is more complex than can be handled inside Gmail, a go-to action should be used. Go-to actions should link directly to a page where the email recipient can complete the action as labeled on the call to action button. An introduction to email markup actionsActions created by email markup allow email recipients to interact with your business, product, or service within Gmail. There are currently four types of actions to choose from using email markup. One-click actionsOne-click actions are those where a task can be completed with one click within Gmail or Inbox. For example, when someone signs up for an email list, they need to confirm their subscription. One-click actions are broken into two categories: confirm actions and save actions. The above example is a confirm action. Save actions can include adding an item to a queue or saving a coupon. Both confirm and save actions can only be interacted with once. RSVP actionsRSVP actions allow email recipients to confirm whether they will attend an event using an invite from Google Calendar. Your email will include the event card you usually see in emails from meeting invites. Having people confirm their attendance to your event will help ensure that they don't forget by getting it on their calendar. Review actionsReview actions allow email recipients to add a star and comment review for your business, products, and services right from the subject line of their email in Gmail. You can see an end-to-end example of the scripting necessary to create a review action for a restaurant to get reviews from a Gmail user's inbox to the Datastore using Python. Go-to actionsActions that do not fall under the above types are considered go-to actions. These are used when you need to take an email recipient to your website to complete an action that is too complex to be handled within the recipient's Gmail or Inbox app. All of the following are examples of go-to actions that take email recipients to do things on another website. The call to action on these can be customized, so you are not limited to just viewing orders, tracking packages, and opening discussions. You can tailor them for specific uses, such as resetting a password, reviewing questionable transactions on your credit cards, and updating payment information. An introduction to email markup HighlightsAnother use for email markup is Highlights. Highlights summarize key information from specific types of email for users of the Inbox app. For example, Highlights are used for these order confirmations to show the products ordered. Another example is this flight reservation using Highlights to show the round-trip flights purchased. Specifically, there are six Highlights that businesses can use. They are as follows: Flight reservations - Includes options for displaying basic flight confirmation information, boarding pass, check-in, update a flight, cancel a flight, and additional options. This Highlight is also supported in Google Now. Orders - Includes options for displaying basic order information, view order action, and order with billing details. Parcel deliveries - Includes options for displaying basic parcel delivery information and detailed shipping information. Hotel reservations - Includes options for displaying basic hotel reservation information, updating a reservation, and canceling a reservation. This Highlight is also supported in Google Now. Restaurant reservations - Includes options for displaying basic restaurant reservation information, updating a reservation, and canceling a reservation. This Highlight is also supported in Google Now. Event reservation - Includes options for basic event reminders without a ticket, event with ticket & no reserved seating, sports or music event with ticket, event with ticket & reserved seating, multiple tickets, updating an event, and canceling an event. This Highlight is also supported in Google Now. Note that while Highlights are a great feature, they only work for Gmail Inbox users. If Google continues to push Gmail users to using Inbox, this user base will grow exponentially. Test email markup before sendingWhile you are waiting to be registered with Google, or prior to sending out emails with Schema.org markup, you should run some initial tests to ensure that your markup is correct. You can start by copying and pasting your code into the Email Markup Tester to check for basic errors. You can also add email markup to emails you send from and to yourself on Gmail. It's important to test as one of the action / schema guidelines is a low failure rate and fast response for action handling. You can learn how to send test emails to yourself in this tutorial using script.google.com. The tutorial gives you some simple code you can copy and paste as directed. When you save and run the project as directed, you will immediately get the following result: You can then begin to experiment with the code for the email markup you want to use. Run your script again and again to produce new emails. Any approved business can use the go-to actions to link the subject line of their email to any portion of their website. As you continue to experiment, think of new ways to engage your audience with email markup. Final questions to answerHere are some final questions you need to answer before you invest in email markup are the following. Will you get more of your desired results by adding Schema.org actions to your emails? For example, if you use the review action, will you actually get more reviews for your business? How much time will it take to revise your emails if / when Google standardizes email markup with Schema.org? It might pay to wait until email markup has been standardized and make the time and coding investment all at once. Will email actions be supported by other email platforms in the future? Schema.org is a collaboration between Google, Bing, Microsoft, Yandex, and Yahoo. So while not guaranteed, it can be assumed that all of the major email platforms on the web could embrace email markup in the future. If, after answering these questions, you can see a real need for email markup, then find out if you meet the guidelines set by Google to use it and register. If your business uses email markup, be sure to share your experiences and results in the comments! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "An Introduction to Schema.org Markup for Emails"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "An Introduction to Schema.org Markup for Emails"
    },
    {
      "level": "H2",
      "text": "Should you use email markup?"
    },
    {
      "level": "H2",
      "text": "Register for email markup with Google"
    },
    {
      "level": "H2",
      "text": "An introduction to email markup actions"
    },
    {
      "level": "H3",
      "text": "One-click actions"
    },
    {
      "level": "H3",
      "text": "RSVP actions"
    },
    {
      "level": "H3",
      "text": "Review actions"
    },
    {
      "level": "H3",
      "text": "Go-to actions"
    },
    {
      "level": "H2",
      "text": "An introduction to email markup Highlights"
    },
    {
      "level": "H2",
      "text": "Test email markup before sending"
    },
    {
      "level": "H2",
      "text": "Final questions to answer"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Create an Email List and Use It for SEO"
    },
    {
      "level": "H3",
      "text": "12 Actionable Steps to Drive Newsletter Growth with SEO Content"
    },
    {
      "level": "H3",
      "text": "Lean into Email in 2022: An Interview with iContact’s Hank Hoffmeier"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kristi Hines\n          \n            Kristi Hines\n          \n            Kristi Hines"
}