{
  "url": "https://moz.com/blog/marketing-channels-integration-local-synergies",
  "slug": "marketing-channels-integration-local-synergies",
  "title": "Marketing Channels: Integration = Local Synergies - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "   Marketing Channels:Integration = Local Synergies  Most SEO professionals have worked with small, brick-and-mortar businesses seeking to drive local traffic to the office or store front. So, the client site is optimized for local search, launched and, often, fails to live up to minimum…",
  "content": "Marketing Channels: Integration = Local Synergies Online Advertising By: Paul Lalley May 6, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Paul Lalley May 6, 2008 Marketing Channels: Integration = Local Synergies Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Most SEO professionals have worked with small, brick-and-mortar businesses seeking to drive local traffic to the office or store front. So, the client site is optimized for local search, launched and, often, fails to live up to minimum expectations. The local purveyor of goods or services in Topeka isn’t looking for business in Mozambique. The business owner wants clients or customers from the Topeka metropolitan area. Integration of marketing channels delivers local traffic. Marketing Channels How many ways can prospects reach your client’s business? Chances are, the local CPA advertises in the Yellow Pages, and maybe runs some small adverts in the local newspaper during tax season. The CPA also has a four-color brochure that she hands out to clients, and of course, an embossed business card. In fact, this may be the extent of the small business owner’s business promotion. Disjointed and utterly lacking in focus. However, integrate that CPA’s web site into other marketing collaterals to produce market channel synergies. And conversely, integrate the web site into existing, albeit, happenstance marketing to improve the effectiveness of traditional marketing instruments. The Website Is The Nexus Pewinternet.org recently posted some eye-opening stats: 78% of web users agree that shopping online is convenient 68% state that buying online saves time 13% of high-end buyers ($100K +) comparison shop online 44% of lower-income buyers are uncomfortable with the level of data security 81% of survey respondents conduct product- and services-related research online 66% of web users purchase online These numbers demonstrate that web buying has deep penetration across all demographics – 68%. However, 81% use the web to conduct product research and comparison shop before running off to the big box store to make the actual purchase. By integrating marketing channels, the small business owner uses his web site as the nexus of all promotional activities through integration of marketing channels. Here are some examples: The local business owner displays the site’s URL on all paper associated with the business: stationery, business cards, brochures, invoices – plaster that URL all over print materials. This enables a prospect to learn more about a business using the web site as a source of information and a call to action. Print advertising in local media should prominently display the business URL with a call to action, to “Learn more at www.clientcompanyname.com.” The print ad – even a small classified – can pique prospect interest. The site should provide the information and access to close the sale. If the business employs local advertising through the regional cable provider (as little as $5 a spot when bought in quantity), the URL should appear as a text burn throughout the 30-second promo. If the business employs radio advertising, mention the business’ URL a couple of times during the spot. Again, pique interest; make the sale on site. Add a toll-free number above the fold on the business’ web site. This creates one of the most powerful synergies. Check the stats again. There’s a lot of comparison shopping and research taking place. That big ol’ toll-free number is mighty tempting – especially for those prospects reluctant to give personal information online. Use mapping software to provide a map to the business’ physical outlet. Buyers check prices and features online, print out the map, and make the purchase locally. Individually, a single marketing channel may not deliver anticipated results. However, when all marketing channels are integrated, they each play off the others creating marketing synergies. In this case, 1 + 1 = 3. editor@webwordslinger.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Marketing Channels: Integration = Local Synergies"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Marketing Channels: Integration = Local Synergies"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Paul Lalley\n          \n            Paul Lalley\n          \n            Paul Lalley"
}