{
  "url": "https://moz.com/blog/marshall-simmonds-on-the-opening-of-the-nytimes-archived-content-and-seo-for-major-media-sites",
  "slug": "marshall-simmonds-on-the-opening-of-the-nytimes-archived-content-and-seo-for-major-media-sites",
  "title": "Marshall Simmonds on the Opening of the NYTimes' Archived Content and SEO for Major Media Sites - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Last week, the New York Times opened up their 13 million document archive and dropped their Times Select program (which allowed access in exchange for a fee). This move was covered extensively in the blogosphere and even influenced other giants in the online publishi...",
  "content": "Marshall Simmonds on the Opening of the NYTimes' Archived Content and SEO for Major Media Sites Public Relations By: Rand Fishkin September 24, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 24, 2007 Marshall Simmonds on the Opening of the NYTimes' Archived Content and SEO for Major Media Sites Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Last week, the New York Times opened up their 13 million document archive and dropped their Times Select program (which allowed access in exchange for a fee). This move was covered extensively in the blogosphere and even influenced other giants in the online publishing world (like Murdoch on the WSJ) to question their own content strategies. The Times' decision wasn't made by any single person, but certainly a driving force behind the questioning of the paid content strategy is Marshall Simmonds, chief search strategist for the New York Times and About.com, and the CEO & Co-Founder of Define Search Strategies. I interviewed Marshall about his role in the TimesSelect move, his company and his strategies for large media sites. Marshall Simmonds (right) with SEOmoz's Si Fishkin (left) in Xiamen, China For those who may not be familiar, can you give us the back story of your entry to the search marketing world. How did you get into search and SEO, and how did you get involved with About.com and the New York Times? I got into search in 1997 with a marketing company in Bend, Oregon where I started my own search department focusing on SEO. At the time I was also moderating and maintaining the I-Search digest. The community all of us built was very strong and active - it was through I-Search I learned of the About.com opportunity. After working on several big name clients I took a job with About.com in 1999 in what, I believe was the first In-House role created specifically for SEO. My responsibilities were (and still are) to educate the nearly 650 Guides and staff, in addition to setting search strategy. In 2001, About was acquired by Primedia (a large publishing house of niche publications) and 250 additional properties were added to my workload. It was at that point I realized the centralized approach to enterprise level search marketing only goes so far and I adopted a method of pushing as much search information as possible to project managers and anyone who would listen. This process of creating network evangelists allowed me to focus on high level strategy and at the same time leveraged the intrinsic knowledge of each property. Outside of your work with NYTimes & About, can you tell us about your company, Define Search Strategies - what kind of clients do you work with? What are the primary services you're providing? Who else is involved on the DSS team? Define Search Strategies is a division of the New York Times. We provide high level consulting with companies interested in bringing search engine optimization, audience acquisition, and retention activities in-house rather than outsourcing. This could mean training an entire company on the best practices of SEO, social media, interactive marketing, and establishing a search team or educating an in-house expert to take over the day-to-day SEO functions. Define has worked with a fairly large number of publishing clients, due to our familiarity with the space. One big advantage to this much exposure to the publishing space is we’re able to very quickly determine strategies for publishers that are not only effective in increasing online traffic, but work within the limitations of the client’s business model. Once you marry the editorial process with sound search marketing fundamentals, you can create an ongoing procedure that’s truly sustainable. You've been a driving force for how many large media organizations have built up their search strategies, but it hasn't been a path devoid of resistance. Can you tell us about some of the hurdles you consistently get from working with the web properties of large media firms? What are the toughest biases or habits to overcome? Ultimately, conveying the practice of writing for both users and the engines is our biggest obstacle. With publishing, the challenge is educating editors, marketers, business development staff, and senior management that the same process that sells magazines and newspapers on the newsstands also works for search. That is to say, the importance of writing a compelling and relevant message is the key to online success. What attracts the eye when you’re walking down the street isn't the same language you should use online, but the skills and talents to create that message are. Search puts an increased demand on publishers to understand their readers at a much more intimate level if they really want to reach that audience and encourage a high level of engagement. This is where the NYT search team must be diligent as we're dealing with more than 150 years of entrenched journalistic and editorial processes. Publishers are becoming comfortable with how the creative process can be adapted for online. This ship doesn't turn easily, but as you saw this week by ending TimesSelect, the New York Times took a huge step in its commitment to users around the world and I give the company a lot of credit for making a tough decision that only strengthens its long-term strategy as a publisher, and improves the opportunity to further develop a broad audience and increase revenue. In your work, you're often serving as a go-between for the engines and the companies you help; what are some of the challenges of that position? Do you frequently find that your clients' goals differ from those of the engines? Actually, the goals of both our clients and the search engines seem more aligned than perhaps ever. More often than not, what’s good for the client is good for the engines, from a content perspective. Where it gets tricky is aligning what we can do and what the engines need. Best intentions on both sides won’t always make up for business objectives, difficult content management systems, convoluted URL structures, marketing efforts that end up cannibalizing search traffic, and all manner of execution mishaps. In general, the more people that participate in the process of content creation on a site, the easier it is to trip yourself up in the engines. The engines are more transparent about the mechanics of how they operate than they’ve ever been. For obvious reasons, they can’t go the whole nine yards, and in some cases there is less information available now, especially where backlinks are concerned. But we’ve come a long way from the days where Google was only communicating to webmasters via an anonymous message board identity. Of course, the new search giant shrouded in mystery is Baidu. You're a pioneer of the \"Xth-page-view free\" model, wherein the first few page views after a visit from the search engines shows the content pages without an ad overlay or subscription message (but subsequent page views will). Can you tell us about the genesis of that concept and the evolution of the idea? How do sites like the NYTimes (where up to 5? page views are free) compare with sites like Forbes that instantly show an ad interstitial to search visitors? Quite simply, it’s about valuing users. If you do, don't annoy them with registration walls and interstitial ads when coming from search. That was one of my first agenda items when joining the NYT - to ensure a positive user and search experience from the time a visitor clicks on a search result to their final page view. We orchestrated the push-back of the registration wall to the sixth click and eventually I'd like to remove it completely. As you mentioned, the NYTimes dropped its TimesSelect program for paid content. Do you view this as a positive thing from a search traffic perspective? Is it something you're excited to see? And, what's your opinion of Bill Tancer (of Hitwise)'s perspective, particularly this - \"Opening up NY Times Select may or may not help the NY Times attract a larger audience online. What looks more certain is that it would put popular columnists back at the fingertips of the wealthy young readers that could help boost advertising revenues.\" This is one of the biggest and most positive changes the NYT has made online to date. It shows a dedication to users and a decision that will no doubt cause other publishers to rethink their strategy. Make no mistake, opening up millions of entry points into one of the richest archives in the world will only have a positive effect for everyone involved. Looking for information on the Battle at Camrgo in 1851? or Thomas Friedman's recent column? It is now open to the entire world. That can only help from a search visibility standpoint. As many people have correctly pointed out, TimesSelect was certainly not productive from a link building standpoint. But in fairness, it can be difficult to communicate what the long-term value of being part of the conversation and getting these links will ultimately be. Our SEO efforts at NYTimes.com had barely begun when TimesSelect was launched. Now, we have 2 full years of data that can reasonably predict the upside of our search optimization strategy. With the Times Select switch - what are the metrics you used to forecast and predict that the move would produce positive results? How would you suggest other organizations analyze their own decisions to make decisions about opening up content archives? It's about search referral volume, first and foremost. From there, you can go deeper and track how users convert and behave to project growth. Using page views isn't the most reliable measuring stick as search referral traffic has a tendency to be transient. Those users typically won't consume as much of your site as someone coming in through the home page or a category page. How would you suggest other organizations analyze their own decisions to make decisions about opening up content archives? When content is in a walled garden you're trading off long term search equity. Ultimately the questions to ask are what are the 2 year/5 year traffic and revenue objectives? As well what can be done today to establish a strong foundation and momentum towards maximizing the network's potential? As social media and the blogosphere have taken off, I'd guess that the pressure to push so-called \"old media\" websites into this new generation of interactivity would increase. Have you felt that in your position? Are you someone who likes the model of participatory and social media and would you (or do you) recommend it to your clients? Do you see value there? The NYT has moved gracefully into blogs within our network. Some of our more premier content can be found in DealBook by Andrew Ross or David Pogue's tech column. I've always enjoyed and promoted the need to engage the audience. With the comments section we've done just that, pulled down the traditional wall between journalists and the readers. Sometimes the responses are the best part of an article. We’ve found that a one-size-fits-all strategy for dipping your feet in the social media world is not the best strategy. Some communities seem to be natural fits on many of the social media networks, while a large number have virtually no visibility or traction at all. Of course, that presents its own opportunity, perhaps a bigger one. From your perspective, where are the biggest gains to be found on large, content-based, advertising-focused websites? Anything specific that you've seen across the board? In the case of established publishers, it’s in the archives. Making deep content easily accessible to users and search engines is a really sound strategy. It can be easier said than done, depending on how your content is generated and stored. Sometimes, the best quality content isn’t easily found, either on a site or in the search engine results. That’s typically due to accessibility issues. We've seen many large sites struggle with passing link juice down through their site architecture to get pages indexed and ranking. What strategies can you share to help large site owners get their hundreds of thousands (or millions) of pages into the engines? Internal link structure is definitely an ongoing effort that you should monitor. I don't think every site needs to use nofollow to sculpt PageRank, as Matt Cutts recently signed off on as a legit technique for webmasters. It's definitely worthwhile to periodically review your site architecture and internal link structure, to see where some of your weak pages might be hiding. Halfdeck wrote a great article about third level push that's worth taking the time to digest. It is essential to test, measure and monitor your SEO strategy constantly to maximize every entry point and promotion opportunity. In many situations conventional wisdom doesn't always play out. Every site is unique, the challenge is determining what combination of factors lead to optimal results for both usability and search engines. Talking about the search industry broadly for a moment - what's your take on the state of search marketing as a profession and of the people involved in search? Where do you see the direction of this industry going - are we on the right track or way off course? What would you like to see happen to make search marketing a better place to work? The state of search marketing continues to get stronger every year. If you can put a basic level of professional acumen behind your process you'll be successful in this industry. I still hear a couple times a month about bad experiences with so-called SEO experts. Inevitably, articles will come out that question the value of search engine optimization and label it as a black art - but as we say day after day it's simply making the most of your content. SEO shouldn’t dictate every decision made on your site, but it must be taken into consideration. We’ve seen too many companies set themselves back years in the search engines. Building a solid foundation of SEO into any online venture should be mandatory at this point. Social media is still in an infancy stage so to speak as it goes through a transition to the enterprise level. At Define we do a very good job of taking a message and educating a company on the public relations approach to reaching out to the many social networks. It’s not easy. Whoever described it as the ‘new link building’ is right, assuming they meant it was just as much of a pain. For the SEO industry in general, there is a dire need for consultants and agencies to truly realize the value of the information given to clients. Not only does the education pay off for a company years after the work is complete, but it can be monetized so heavily it makes me cringe when I hear what some highly skilled professionals and agencies charge. Too often our industry is brutally under-valuing and exploiting the customized expertise it delivers. Truly good SEO services take a vast array of factors and SEO experience into account for each new client challenge. It’s hard work that can last months, but there’s often no marketing effort for a company that will generate as much revenue and growth over the long haul. I know many SEO firms and consultants that are worth every penny and probably quite a few more. At the end of the day I'd love to see the SEO space finally place the same value on its services that our clients know they’ll receive for years to come as our strategies continue to pay off. The online world has stood up and taken notice of SEO, in a big way. SEOmoz has a big premium subscriber base, and you guys are referenced by the likes of Dave Winer. More and more folks are blazing trails as in-house specialists. We know quite a few and these people are invaluable to the companies they are working for. There are a bunch of SEO blogs that are fantastic. On a more personal note - despite having one of the best known names in the industry, you've remained relatively quiet in the online search community - blogs, forums, Facebook Your browser may not support display of this image.Is that an active choice to limit participation, or do you secretly wish you could blog, Sphinn and Twitter all day but lack the time? I read as much as I can, and between that and the hundreds of contacts I make a week, I try to leave enough time for a life. J Not everyone can be as prolific as you! We just have too much that needs our attention. Last question - tell us about one of your most exciting or interesting projects in the last year - what's something that's really surprised or amazed you in the trenches of search marketing? The awareness I mentioned above has manifested itself in companies being much more willing to set strategies that will capture search opportunities. This was of course, reflected in the decision to lift the wall on TimesSelect. People seem to get it now, how search plays a role in that kind of decision Those in traditional marketing, editorial and IT roles seem to be much more informed about SEO. It makes the job of implementing strategy much easier. There’s still skepticism, but most people we work with understand now that there are fundamentals that must be put in place to really drive search traffic. Thanks a ton, Marshall. Your insight is priceless. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Marshall Simmonds on the Opening of the NYTimes' Archived Content and SEO for Major Media Sites"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Marshall Simmonds on the Opening of the NYTimes' Archived Content and SEO for Major Media Sites"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}