{
  "url": "https://moz.com/blog/martin-luther-king-jr-day-in-the-us",
  "slug": "martin-luther-king-jr-day-in-the-us",
  "title": "Martin Luther King Jr. Day in the US - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Dr. King is, to me, one of the greatest heroes of the modern era. Every year I find myself wishing I could do more to honor his memory and this year, there's a few sites on the web that are doing a great job:\n\nReme...",
  "content": "Martin Luther King Jr. Day in the US Moz News By: Rand Fishkin January 16, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 16, 2006 Martin Luther King Jr. Day in the US Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Dr. King is, to me, one of the greatest heroes of the modern era. Every year I find myself wishing I could do more to honor his memory and this year, there's a few sites on the web that are doing a great job: Remember Segregation - It's hard to imagine that only ten years before I was born, people in the United States were restricted from equality by state laws. This site does a beautiful job of helping us remember what those times were like._ I Have a Dream Speech - Both the text and an audio version are available here. If you haven't had a listen in a while, today's a perfect day for it._ Photo Essay from 2001 - A well made tribute from Time magazine_ Seattle Times' MLK Page - A great deal of information about Dr. King is available here, including articles from guest columnists, perspectives from his contemporaries and more. In my opinion, this is one of the most worthy holidays we have in the US. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Martin Luther King Jr. Day in the US"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Martin Luther King Jr. Day in the US"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}