{
  "url": "https://moz.com/blog/mastering-serving-the-user-as-centroid",
  "slug": "mastering-serving-the-user-as-centroid",
  "title": "Local Centroids are Now Individual Users: How Can We Optimize for Their Searches? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The concept of the centroid has evolved quite a bit from its early days and now centers around individual users. In this post, local SEO expert Miriam Ellis shows you how you can best target those users-as-centroids.",
  "content": "Local Centroids are Now Individual Users: How Can We Optimize for Their Searches? Local SEO By: Miriam Ellis March 2, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis March 2, 2015 Local Centroids are Now Individual Users: How Can We Optimize for Their Searches? Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. \"Google is getting better at detecting location at a more granular level—even on the desktop. The user is the new centroid.\" - David Mihm The history of the centroid The above quote succinctly summarizes the current state of affairs for local business owners and their customers. The concept of a centroid— a central point of relevance—is almost as old as local search. In 2008, people like Mike Blumenthal and Google Maps Manager Carter Maslan were sharing statistics like this: \"...research indicates that up to 80% of the variation in rank can be explained by distance from the centroid on certain searches.\" At that time, businesses located near town hall or a similar central hub appeared to be experiencing a ranking advantage. Fast forward to 2013, and Mike weighed in again with an updated definition of \"industry centroids\", \"If you read their (Google’s) patents, they actually deal with the center of the industries … as defining the center of the search. So if all the lawyers are on the corner of Main and State, that typically defines the center of the search, rather than the center of the city… it isn’t even the centroid of the city that matters. It matters that you are near where the other people in your industry are.\" In other words, Google's perception of a centralized location for auto dealerships could be completely different than that for medical practices, and that neither might be located anywhere near the city center. While the concepts of city and industry centroids may still play a part in some searches, local search results in 2015 clearly indicate Google's shift toward deeming the physical location of the desktop or mobile user a powerful factor in determining relevance. The relationship between where your customer is when he performs a search and where your business is physically located has never been more important. Moreover, in this new, user-centric environment, Google has moved beyond simply detecting cities to detecting neighborhoods and even streets. What this means for local business owners is that your hyperlocal information has become a powerful component of your business data. This post will teach you how to better serve your most local customers.Seeing the centroid in action If you do business in a small town with few competitors, ranking for your product/service + city terms is likely to cover most of your bases. The user-as-centroid phenomenon is most applicable in mid-to-large sized towns and cities with reasonable competition. I'll be using two districts in San Francisco—Bernal Heights and North Beach—in these illustrations and we'll be going on a hunt for pizza. On a desktop, searching for \"pizza north beach san francisco\" or setting my location to this neighborhood and city while searching for the product, Google will show me something like this: Performing this same search, but with \"bernal heights\" substituted, Google shows me pizzerias in a completely different part of the city: And, when I move over to my mobile device, Google narrows the initial results down to just three enviable players in each district. These simple illustrations demonstrate Google's increasing sensitivity to serving me nearby businesses offering what I want. The physical address of your business is the most important factor in serving the user as centroid. This isn’t something you can control, but there are things you can do to market your business as being highly relevant to your hyperlocal geography.Specialized content for the user-centroid We'll break this down into four common business models to help get you thinking about planning content that serves your most local customers.1. Single-location business Make the shift toward viewing your business not just as \"Tony's Pizza in San Francisco\", but as \"Tony's Pizza in North Beach, San Francisco\". Consider: Improving core pages of your website or creating new pages to include references to the proud part you play in the neighborhood scene. Talk about the history of your area and where you fit into that. Interview locals and ask them to share their memories about the neighborhood and what they like about living there. Showcase your participation in local events. Plan an event, contest or special for customers in your district. Take pictures, label them with hyperlocal terms, post them on your site and share them socially. Blog about local happenings that are relevant to you and your customers, such as a street market where you buy the tomatoes that top your pizzas or a local award you've won. Depending on your industry, there will be opportunities for hyperlocal content specific to your business. For example, a restaurant can make sure its menu is in crawlable text and can name some favorite dishes after the neighborhood—The Bernal Heights Special. Meanwhile, a spa in North Beach can create a hyperlocal name for a service—The North Beach Organic Spa Package. Not only does this show district pride, but customers may mention these products and services by name in their reviews, reinforcing your local connection. 2. Multi-location business within a single city All that applies to the single location applies to you, too, but you've got to find a way to scale building out content for each neighborhood. If your resources are strong, build a local landing page for each of your locations, including basic optimization for the neighborhood name. Meanwhile, create blog categories for each neighborhood and rotate your efforts on a week by week basis. First week, blog about neighborhood A, next week, find something interesting to write about concerning neighborhood B. Over time, you'll have developed a nice body of content proving your involvement in each district. If you're short on resources, you'll still want to build out a basic landing page for each of your stores in your city and make the very best effort you can to showcase your neighborhood pride on these pages. 3. Multiple businesses, multiple cities Again, scaling this is going to be key and how much you can do will depend upon your resources. The minimum requirement will be a landing page on the site for each physical location, with basic optimization for your neighborhood terms. Beyond this, you'll be making a decision about how much hyperlocal content you can add to the site/blog for each district, or whether time can be utilized more effectively via off-site social outreach. If you've got lots of neighborhoods to cover in lots of different cities, designating a social representative for each store and giving him the keys to your profiles (after a training session in company policies) may make the most sense. 4. Service area businesses (SABs) Very often, service area businesses are left out in the cold with various local developments, but in my own limited testing, Google is applying at least some hyperlocal care to these business models. I can search for a neighborhood plumber, just as I would a pizza: To be painstakingly honest, plumbers are going to have to be pretty ingenious to come up with a ton of engaging industry/neighborhood content and may be confined mainly to creating some decent service area landing pages that share a bit about their work in various neighborhoods. Other business models, like contractors, home staging firms and caterers should find it quite easy to talk about district architecture, curb appeal and events on a hyperlocal front. While your SAB is still unlikely to beat out a competitor with a physical location in a given neighborhood, you still have a chance to associate your business with that area of your town with well-planned content. Need creative inspiration for the writing projects ahead? Don't miss this awesome wildcard search tip Mary Bowling shared at LocalUp. Add an underscore or asterisk to your search terms and just look at the good stuff Google will suggest to you: Does Tony's patio make his business one of Bernal Heights' dog-friendly restaurants or does his rooftop view make his restaurant the most picturesque lunch spot in the district? If so, he's got two new topics to write about, either on his basic landing pages or his blog. Hop over to Whitespark’s favorite takeaways from Mike Ramsey’s LocalUp presentation, too.Citations and reviews with the user centroid in mind Here are the basics about citations, broken into the same four business models:1. Single-location business You get just one citation on each platform, unless you have multiple departments or practitioners. That means one Google+ Local page, one Yelp profile, one Best of the Web listing. etc. You do not get one citation for your city and another for your neighborhood. Very simple. 2. Multi-location business within a single city As with the single location business, you are entitled to just one set of citations per physical location. That means one Google+ Local listing for your North Beach pizza place and another for your restaurant in Bernal Heights. A regular FAQ here in the Moz Q&A Forum relates to how Google will differentiate between two businesses located in the same city. Here are some tips: Google no longer supports the use of modifiers in the business name field, so you can no longer be Tony's Pizza - Bernal Heights, unless your restaurant is actually named this. You can only be Tony's Pizza. Facebook's policies are different than Google's. To my understanding, Facebook won't permit you to build more than one Facebook Place for the identical brand name. Thus, to comply with their guidelines, you must differentiate by using those neighborhood names or other modifiers. Given that this same rule applies to all of your competitors, this should not be seen as a danger to your NAP consistency, because apparently, no multi-location business creating Facebook Places will have 100% consistent NAP. The playing field is, then, even. The correct place to differentiate your businesses on all other platforms is in the address field. Google will understand that one of your branches is on A St. and the other is on B St. and will choose which one they feel is most relevant to the user. Google is not a fan of call centers. Unless it's absolutely impossible to do so, use a unique local phone number for each physical location to prevent mix-ups on Google's part, and use this number consistently across all web-based mentions of the business. Though you can't put your neighborhood name in the title, you can definitely include it in the business description field most citation platforms provide. Link your citations to their respective local landing pages on your website, not to your homepage. 3. Multiple businesses, multiple cities Everything in business model #2 applies to you as well. You are allowed one set of citations for each of your physical locations, and while you can't modify your Google+ Local business name, you can mention your neighborhood in the description. Promote each location equally in all you do and then rely on Google to separate your locations for various users based on your addresses and phone numbers. 4. SABs You are exactly like business model #1 when it comes to citations, with the exception of needing to abide by Google's rules about hiding your address if you don't serve customers at your place of business. Don't build out additional citations for neighborhoods you serve, other cities you serve or various service offerings. Just create one citation set. You should be fine mentioning some neighborhoods in your citation descriptions, but don't go overboard on this. When it comes to review management, you'll be managing unique sets of reviews for each of your physical locations. One method for preventing business owner burnout is to manage each location in rotation. One week, tend to owner responses for Business A. Do Business B the following week. In week three, ask for some reviews for Business A and do the same for B in week four. Vary the tasks and take your time unless faced with a sudden reputation crisis. You can take some additional steps to \"hyperlocalize\" your review profiles: Write about your neighborhood in the business description on your profile. You can't compel random customers to mention your neighborhood, but you can certainly do so from time to time when your write responses. \"We've just installed the first soda fountain Bernal Heights has seen since 1959. Come have a cool drink on us this summer.\" Offer a neighborhood special to people who bring in a piece of mail with their address on it. Prepare a little handout for all-comers, highlighting a couple of review profiles where you'd love to hear how they liked the Bernal Heights special. Or, gather email addresses if possible and follow up via email shortly after the time of service. If your business model is one that permits you to name your goods or service packages, don’t forget the tip mentioned earlier about thinking hyperlocal when brainstorming names. Pretty cool if you can get your customers talking about how your \"North Beach Artichoke Pizza\" is the best pie in town!Investigate your social-hyperlocal opportunties I still consider website-based content publication to be more than half the battle in ranking locally, but sometimes, real-time social outreach can accomplish things static articles or scheduled blog posts can’t. The amount of effort you invest in social outreach should be based on your resources and an assessment of how naturally your industry lends itself to socialization. Fire insurance salesmen are going to find it harder to light up their neighborhood community than yoga studios will. Consider your options:Check out this intro to social-local platforms here on Moz.Get inspired by this up-to-date article from StreetFight Mag, How Small Businesses Can Nail Social Marketing.Use Followerwonk to discover your nearest neighbors on Twitter. Remember that you are investigating each opportunity to see how it stacks up not just to promoting your location in your city, but in your neighborhood.Who are the people in your neighborhood? Remember that Sesame Street jingle? It hails from a time when urban dwellers strongly identified with a certain district of hometown. People were \"from the neighborhood.\" If my grandfather was a Mission District fella, maybe yours was from Chinatown. Now, we’re shifting in fascinating directions. Even as we've settled into telecommuting to jobs in distant states or countries, Amazon is offering one hour home delivery to our neighbors in Manhattan. Doctors are making house calls again! Any day now, I’m expecting a milkman to start making his rounds around here. Commerce has stretched to span the globe and now it's zooming in to meet the needs of the family next door. If the big guys are setting their sights on near-instant services within your community, take note. You live in that community. You talk, face-to-face, with your neighbors every day and know the flavor of the local scene better than any remote competitor can right now. Now is the time to reinvigorate that old neighborhood pride in the way you’re visualizing your business, marketing it and personally communicating to customers that you’re right there for them. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Local Centroids are Now Individual Users: How Can We Optimize for Their Searches?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Local Centroids are Now Individual Users: How Can We Optimize for Their Searches?"
    },
    {
      "level": "H2",
      "text": "The history of the centroid"
    },
    {
      "level": "H2",
      "text": "Seeing the centroid in action"
    },
    {
      "level": "H2",
      "text": "Specialized content for the user-centroid"
    },
    {
      "level": "H3",
      "text": "1. Single-location business"
    },
    {
      "level": "H3",
      "text": "2. Multi-location business within a single city"
    },
    {
      "level": "H3",
      "text": "3. Multiple businesses, multiple cities"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": "4. Service area businesses (SABs)"
    },
    {
      "level": "H2",
      "text": "Citations and reviews with the user centroid in mind"
    },
    {
      "level": "H3",
      "text": "1. Single-location business"
    },
    {
      "level": "H3",
      "text": "2. Multi-location business within a single city"
    },
    {
      "level": "H3",
      "text": "3.  Multiple businesses, multiple cities"
    },
    {
      "level": "H3",
      "text": "4. SABs"
    },
    {
      "level": "H2",
      "text": "Investigate your social-hyperlocal opportunties"
    },
    {
      "level": "H2",
      "text": "Who are the people in your neighborhood?"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}