{
  "url": "https://moz.com/blog/matt-cutts-translated-8-seo-tips-i-heard-him-tell-eric-enge",
  "slug": "matt-cutts-translated-8-seo-tips-i-heard-him-tell-eric-enge",
  "title": "Matt Cutts Translated: 8 SEO Tips I Heard Him Tell Eric Enge - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In the last big Matt Cutts interview, Eric Enge managed to get Matt Cutts to say PageRank Sculpting (or siloing for you Bruce Clay fans) was okay to do on your site and that noindex pages still have PageRank attributed to them.Well . . . Eric Enge did another ...",
  "content": "Matt Cutts Translated: 8 SEO Tips I Heard Him Tell Eric Enge Online Advertising B By: Brent Payne June 17, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! B By: Brent Payne June 17, 2008 Matt Cutts Translated: 8 SEO Tips I Heard Him Tell Eric Enge Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In the last big Matt Cutts interview, Eric Enge managed to get Matt Cutts to say PageRank Sculpting (or siloing, for you Bruce Clay fans) was okay to do on your site and that noindex pages still have PageRank attributed to them. Well . . . Eric Enge did another interview with Matt Cutts this month that he posted moments ago. As usual, Eric managed to get Matt Cutts to tell us some juicy info and he did it all so nonchalantly. ;-) Take these, for example: 1. Matt Cutts: Whenever you pay money to a social media consultant to try to show up on Digg, you are not paying for links. You are funding some creativity; you are sponsoring your page for some creativity. It’s not like you held a gun to anyone and said “Okay, you have to link to me.” The people who link to the site are linking because it’s something compelling instead. So, there is still some editorial choice there. Take-away: Google’s algorithm likes Digg and will like Digg for the foreseeable future. Googlebot sees Digg as a clean source of link authority. Hire social media marketers, people! 2. Eric Enge: … Let’s imagine the link [in widgetbait] isn’t hidden, but it’s still off topic. Matt Cutts: Right, off topic. We want those links just like with regular linkbait; we wanted people to be informed of what they are linking to and we want the links to be editorial. And, if we feel like somebody got tricked into making a link, like they signed up for some service and they didn’t even realize that a link was going to be piggybacking along on this. that’s not as good, and it’s not as much of an editorial vote for that link as we’d like. You can also look at things like what is the link target: does the link go back to wherever you got the widget from or does it go to some completely different third party? This is related to whether it’s off topic or not. Take-away: When making widgets, put the location of the widget on the same domain as the site you are pointing the anchor text towards. If they both have the same domain then it will be worth more LinkJuice to Googlebot. 3. Eric Enge: Yeah. But, you wouldn’t necessarily know that [referring to whether you knew if a link was paid or not within widgetbait]. You would know that it was a different party; that’s pretty easy to detect. Matt Cutts: Different party, yeah. Different party, often off topic; and then you could also look at the anchor text of the link itself. So, if it’s just the name of the site, that’s a little different than if it's keyword stuffed or spamming anchor text. And then, a couple of last things is how many links are in the widget, as there are a whole ton of buried links in the widget that are more of the degree nature. One of the things that’s also interesting is how informed the publisher was whenever they put this widget on their site. Because, we have seen widgets where there was essentially no disclosure; maybe buried down in some end user license agreement. Take-away: When creating widgetbait, put the widget on your site (Note: Matt has now told us to do this twice in one interview). Secondly, use the name of the site versus using the targeted anchor text. Moreover, only have two links in widgetbait: one to the widget and one possibly somewhere else on the same domain as the widget. I’d theorize that linking to the place to get the widget should be “targeted keyphrase + widget” to create some domain strength for the targeted phrase but not throwing a spam filter. Then put on the landing page of the widget download page a title tag and H1 tag that has that same keyphrase in it somewhere. Lastly, have a Terms & Conditions on the widget landing page that discloses in bold text that the widget will create a link back to the widget page and the target page, and by choosing to download the widget you are casting an editorial vote that you feel the widget is worthy of having such links. BTW, I honestly don’t think that most widgetbait would be harmed by having such disclosure because people aren’t reading the Ts and Cs that closely, anyway. But Googlebot sure does and obviously so does the Matt Cutts. So . . . just do it and give Google fewer excuses to justify the minimizing the authority and relevance of widgetbait. 4. Matt Cutts: That’s certainly something you could do [ask webmasters linking to you to change their anchor text to something more useful]. The main thing is you want people to be informed. Organic anchor text often has all that natural distribution that you want, anyway. So, if you can get it organically, then you usually don’t have to go back and try to negotiate with people about changing this anchor text. Take-away: Googlebot looks at the distribution of anchor text to a page versus URLs to a page. I’d think this would be a over/under average scenario with similar sites or pages either by topic, geography, or other factors. Thus, don’t get too many links pointing to your domain/page with specific anchor text. Change it up a bit. Have some with anchor text “blue widgets,” some with “widgets,” some with “blue,” and some with “domain.com/page.” Create some noise to make sure you don’t ‘over-optimize’ a site/page. 5. Matt Cutts: [When discussing widgetbait anchor text] I wouldn’t try to so aggressively get specific anchor text that it looks bad. Take-away: Umm, well he said it again. Twice in one post: not to get too aggressive with anchor text optimization. Gee, maybe we should listen to him, huh? 6. Matt Cutts: [When discussing reciprocal linking] So, what we mean when we say \"avoid excessive reciprocal links\" is if your portfolio has a very large fraction of links where you’re getting them by sending automated emails saying, ”Did you know that exchanging links can help your rankings in search engines?” We tell people to avoid excessive swapping; and the nice thing is that people have a pretty good idea of what excessive is. Take-away: Reciprocal linking is okay, people. Just keep it as a low percentage of your overall links. I’d even recommend not getting too exact on the anchor text (see above) and letting the linker choose what they want to use for anchor text (so it appears more natural). If you are going to use a code snippet that someone can copy and paste, change it up from day to day or week to week. It’d be pretty easy to have a dynamic page setup so today it says one thing and next week (or tomorrow, depending on traffic levels) it says something else, or if you are sending out emails to vary the code snippet sent in the email blast. NOTE: I do not promote the need for reciprocal links and, other than affiliate programs, I’ve never used them in any online marketing campaigns I’ve run. 7. Matt Cutts: [Regarding whether to link out or not from a page] Exactly. And, if the user is happy, they are more likely to come back or bookmark your site or tell their friends about it. And so, if you try to hoard those users, they often somehow subconsciously sense it, and they are less likely to come back or tell their friends about it. Take-Away: (This one is a bit more sketchy.) Matt seems to think that people bookmark pages that point to other pages instead of the final landing page. If this were the case, though, then people’s bookmarks would be filled with Google search results pages rather than the landing pages themselves. Personally, if I find a site that has okay information but links to a really good site with great information, I only bookmark the site with the really good information. Whether we agree with Matt’s view on this or not, it does tell us that Matt Cutts thinks it’s a good quality factor if a site has outbound links on a page. The big question though is whether we should nofollow those suckers and does Googlebot agree with Matt Cutts on his strange thought process of links on a site? Furthermore, if Googlebot does think like Matt, does Googlebot still see it as a good quality page if the outbounds are nofollowed? Wikipedia seems to be an example that it does. Or is Googlebot looking at other factors? Hmmm, an unanswered piece of the puzzle. Imagine that, from Google...an unanswered question? Never. ;-) 8. Matt Cutts: [Regarding the notion of offering a discount to users/affiliates that link to the destination site] The bottom line is we always have to be mindful of how people can abuse things. And if we started to see something get really abused, then we can look into it. We haven’t seen a ton of people trying to do malicious things with that. Take-Away: If we as marketers don’t abuse this then Google isn’t going to go chase after it. Think about this, people. In the end Google cares about the user experience on their site. If the search results don’t get spammed to death by this method, then they aren’t going to waste their resources to plug the hole. So, yes, we can use this as a marketing tactic without penalty, but as soon as someone gets carried away with it or if starts to mess up the Google search results too much...poof!!! Gone!! I give it 60 days until this is no longer useful. ;-) j/k Personally I feel that Eric Enge is the best interviewer in the SEO industry when it comes to getting Matt Cutts to give us some useful information. I told him this personally at SMX Advanced 2008, but I’ll say it again here publicly. Keep up the good work, Eric! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Matt Cutts Translated: 8 SEO Tips I Heard Him Tell Eric Enge"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Matt Cutts Translated: 8 SEO Tips I Heard Him Tell Eric Enge"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Brent Payne\n          \n            Brent Payne"
}