{
  "url": "https://moz.com/blog/matt-cutts-calls-out-link-network",
  "slug": "matt-cutts-calls-out-link-network",
  "title": "Matt Cutts Calls out Link Network - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In a cruel, unambiguous and brutally honest fashion, Matt Cutts ripped apart a link network today. I'm feeling really bad for them. Here's what Matt said:\n\nMy favorite overall moment was when a totally legit company (micromatic.com) stood up and asked fo...",
  "content": "Matt Cutts Calls out Link Network Search Engines By: Rand Fishkin December 9, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 9, 2005 Matt Cutts Calls out Link Network Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In a cruel, unambiguous and brutally honest fashion, Matt Cutts ripped apart a link network today. I'm feeling really bad for them. Here's what Matt said: My favorite overall moment was when a totally legit company (micromatic.com) stood up and asked for advice. Overall, their site was great: good architecture and very crawlable. They had lots of really good backlinks, including industry-specific links. But I could also tell that they’d been buying some backlinks. And they were buying backlinks from the exact same place as one of the earlier sites! At the point when in a minute of typing, I can say: you guys are both trying to buy backlinks, and I can tell that you’re buying them from the same network, and here’s an example page from ketv.com where both of you are even on the same page, and it’s not doing you any good at all: that just made my day. When Matt noted KETV.com, he's calling out a link network that runs on a lot of TV, Radio and Newspaper sites throughout the US. In fact, I've bought on this network for some of our clients, and while I'm dissapointed to learn that Google is devaluing those links, it may shock some folks to learn that you actually get click-throughs on those ads (although the highest numbers I've seen are around 40 unique visitors in a week from one in particular). I suspect that a few things will result from this: The company will build a new network The old network will get cheaper or possibly dissapear MSN & Yahoo! read Matt's blog... they'll probably do likewise The link network's owner will drink a lot tonight When we were getting featured in Wired, one of my biggest fears was Google looking through the links to 2 of our 5 full-time clients (who were to be mentioned in the article - Shoe-Store and Avatar Financial). I wasn't worried so much about our devaluation (as my research had showed they devalued those links sometime in the mid-late summer) as I was about them pulling the value from the entire network.... I guess that's not a big concern anymore. I can actually empathize with both sides on this issue. Matt (and Google) need to show the SEO world that link networks can't succeed forever or their credibility will drop. The link network company, on the other hand, was providing an excellent service and doing a great job of it. I hope that they can rebound from this and continue to provide webmasters with valuable links through other methods. I suspect they've already got links in place that aren't being discounted. The question for the long term is \"how do you keep links relevant over the long term, even if the SEs discover they're paid content?\" The obvious answer is to serve links that pay for themselves in visitor traffic and if the search engines don't count them - who cares? Good luck, anonymous link network guys. Please drop me a line if I can help. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Matt Cutts Calls out Link Network"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Matt Cutts Calls out Link Network"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}