{
  "url": "https://moz.com/blog/matt-baileys-new-firm-sitelogic",
  "slug": "matt-baileys-new-firm-sitelogic",
  "title": "Matt Bailey's New Firm - SiteLogic - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I'm pleased to be able to break the news that Matt Bailey, formerly of the Karcher Group, has opened his own SEO & web marketing consultation firm - SiteLogic. Why is he going directly to the Recommend List? Because Matt is one of the smartest, fastest moving people in the industry. Matt's the type…",
  "content": "Matt Bailey's New Firm - SiteLogic Public Relations By: Rand Fishkin March 23, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 23, 2006 Matt Bailey's New Firm - SiteLogic Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I'm pleased to be able to break the news that Matt Bailey, formerly of the Karcher Group, has opened his own SEO & web marketing consultation firm - SiteLogic. Why is he going directly to the Recommend List? Because Matt is one of the smartest, fastest moving people in the industry. Matt's the type of guy who knows everything that's taken place in the world of search and how to apply that information to achieve success. Along with a nice looking site, Matt has joined the ranks of the blogosphere with his own forray. Hopefully we'll see lots of cool content popping up in the near future. Congrats, Matt and best of luck to you - building a business is hard, but the support of friends and fans will, hopefully, make it easier. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Matt Bailey's New Firm - SiteLogic"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Matt Bailey's New Firm - SiteLogic"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}