{
  "url": "https://moz.com/blog/maximizing-conversions-by-offering-multiple-conversion-options",
  "slug": "maximizing-conversions-by-offering-multiple-conversion-options",
  "title": "Maximizing Conversions By Offering Multiple Conversion Options - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The Unconvertibles\n\nThere's a tactic that I've recently seen used in a few very different industries; I wanted to share this with you, as it's something definitely worth considering for your site and your business.",
  "content": "Maximizing Conversions By Offering Multiple Conversion Options Conversion Rate Optimization (CRO) By: Rob Ousbey June 6, 2010 Table of Contents Copied! By: Rob Ousbey June 6, 2010 Maximizing Conversions By Offering Multiple Conversion Options Conversion Rate Optimization (CRO) When you're told that certain visitors can never be converted, you need a new type of conversion - and need to make sure those visitors get the opportunity to convert without it looking like a 'second best' option. There's a tactic that I've recently seen used in a few very different industries; I wanted to share this with you, as it's something definitely worth considering for your site and your business. For you busy people, here's the abridged version: Have multiple actions that could be defined as a successful conversion. Put these options on the table, and let the user choose how to convert. If you have data about which actions different audience segments prefer, point them to the action where they're most likely to convert. I'll try to keep this post brief: this will save you time that you can then spend on better things - like implementing the ideas. We'll start with some more typical conversion processes, and I'll give examples of online and offline implementations of each - and finish with three ways that sites could implement these theories properly. Traditional Conversion Structure For example: A potential customer walks past a maket stall holder, he shouts \"Five apples for a pound\", and the customer either buys apples, or doesn't. The site shown below sells cardboard boxes with a hole in the top (serving a very particular purpose) - but if you don't buy the box, there's nothing else to do. The 'Don't Go Yet' Model For example: You go to a store to buy a suit. The tailor shows you the 'best suit in the store' - but you don't buy it, so he shows you 'something very special' - but you don't buy it, so he shows you 'something that will be perfect for you' etc. You visit SlapChop.com, but Vince's advice to 'stop having boring tuna, stop having a boring life' doesn't convince you. On closing the page, you can practically hear him protest \"BUT WAIT, THERE'S MORE\" - in the form of a popup offering you a $5 discount if you don't leave. The Right Way: Pick a Conversion Action Example 1: Handling the decisions offline Tableau Software (a client) sells data visualization software and has recently launched a free tool - Tableau Public - for publicity and links; it can be used by individuals to create visualizations, share them online, embed them in blogs posts (as Will did here), etc. Potential Tableau customers submit contact forms or emails; the sales team then reviews these leads, before replying to them and selling the product. The sales team know that leads from some organizations (based on the size, type or location) almost never convert - so they don't spend much time on those 'lost causes'. However, the new free tool has given Tableau an opportunity to give these leads to the SEO team instead - someone can then get in touch and say \"You asked about our enterprise software, but did you know we have a similar tool available for free? You can download it here and get going straight away.\" This can even be followed up with an email two weeks later, along the lines of \"How are you getting on with Tableau Public? If it's been useful, and you'd like to say thank you, we'd love if you're able to embed a viz on your website to share with others. We really enjoy seeing what our users have created, and we really appreciate any opportunity to tell more people about the tool.\" Suddenly, some very basic 'segmentation' can help save time for the sales team, and build links to the website. This is possible because the company has more than one action they define as 'success' - and can aim directly at getting the visitor to take the most appropriate action, rather than trying their luck with the high value actions first, and then negotiating down to a different conversion. Example 2: Presenting the options in parallel, let the user self-identify Imagine a site which lets visitors donate to one or more charities. These sites often have a small call to action to 'share' the website/charitable cause - but I'd suggest defining this sharing as a successful conversion, and presenting it as an alternative to giving money. Could this inadvertently reduce the number of donations received? I suspect not, and anticipate that a page would see more traffic and more donations if the two options were presented as shown below. Example 3: Optimise dynamically to promote the best converting option This example uses a site that offers PPC Tools, and PPC management services. They might have read this post so far, and now have a landing page that clearly offers their two services in this way: But why stop there? Collect some data about which visitors prefer which service, relative conversion rates, etc, and then edit the page content to reflect the type of visitor that's just arrived. Take a look at this: Example 4: A Real Case Study The excellent Conversion Rate Experts have posted a case study on their website for Voices.com which uses some of these techniques to segment their users into two separate conversion funnels. While not directly related to some of the things in this post it demonstrates how multiple different conversion options can work very effectively: In Conclusion There are already some businesses using these techniques, and some websites that are set up to benefit from the ideas, but there are also a lot of places where this isn't the case. If you're not being upfront about the steps you'd like visitors to take, or hiding your 'offers' to them, then there's potential for you to make changes that will lead to happier and more productive customers. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Maximizing Conversions By Offering Multiple Conversion Options"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Maximizing Conversions By Offering Multiple Conversion Options"
    },
    {
      "level": "H2",
      "text": "Traditional Conversion Structure"
    },
    {
      "level": "H2",
      "text": "The 'Don't Go Yet' Model"
    },
    {
      "level": "H2",
      "text": "The Right Way: Pick a Conversion Action"
    },
    {
      "level": "H3",
      "text": "Example 1: Handling the decisions offline"
    },
    {
      "level": "H3",
      "text": "Example 2: Presenting the options in parallel, let the user self-identify"
    },
    {
      "level": "H3",
      "text": "Example 3: Optimise dynamically to promote the best converting option"
    },
    {
      "level": "H3",
      "text": "Example 4: A Real Case Study"
    },
    {
      "level": "H2",
      "text": "In Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Ensure Your Organic Traffic Actually Drives Revenue — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How Our Website Conversion Strategy Increased Business Inquiries by 37%"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rob Ousbey\n          \n            Rob Ousbey"
}