{
  "url": "https://moz.com/blog/maximizing-the-likelihood-of-getting-dugg-3495",
  "slug": "maximizing-the-likelihood-of-getting-dugg-3495",
  "title": "Maximizing the Likelihood of Getting Dugg - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There has been plenty of discussion about the stories that become popular on Digg.  However, these posts don't actually help the submitter that much. Do 'Microsoft' stories hit the front page frequently because there are a lot of stories submitted about Microsoft or because Diggers love Microsoft?I…",
  "content": "Maximizing the Likelihood of Getting Dugg Social Media D By: David Naffziger January 31, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! D By: David Naffziger January 31, 2008 Maximizing the Likelihood of Getting Dugg Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. There has been plenty of discussion about the stories that become popular on Digg. However, these posts don't actually help the submitter that much. Do 'Microsoft' stories hit the front page frequently because there are a lot of stories submitted about Microsoft or because Diggers love Microsoft? I think it is much more useful to look at the statistics behind what does and doesn't get promoted. The most important metric is one I've termed 'Promote Rate': the percentage of stories with a given characteristic that get promoted to the front page. I wrote an analysis a little over 6 months ago that looked at some of the key characteristics and felt it was time to update and expand on my initial analysis (a few friends were submitting some content to Digg and I wanted to offer them the best advice). Time of Day and Day of Week Mid-week (Tuesday and Wednesday) have historically been the most active days on Digg. Most stories are submitted and promoted on these two days. However, Sunday and Monday are the best day of week to submit a story: In addition, Sunday afternoon to evening is by far the best time of the week to submit a story. A story is twice as likely to be promoted during this period than the worst time (early am on a weekday). Category The most popular categories are not necessarily the categories that are best to submit to. The two graphs below show the difference between the top categories by stories promoted and the categories with the highest promote rates. I'd like to repeat the analysis with terms in the headline, but I'll need to save that for another post. Notes: This analysis was conducted on data over the last three months: 10/27/07 to 1/26/08. The data for this analysis was retrieved using the Digg API. There are a few holes due to API-related errors, but I believe 98% of the stories submitted are represented here (about 770K submissions). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Maximizing the Likelihood of Getting Dugg"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Maximizing the Likelihood of Getting Dugg"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "David Naffziger\n          \n            David Naffziger"
}