{
  "url": "https://moz.com/blog/measuring-eat",
  "slug": "measuring-eat",
  "title": "Measuring E-A-T? — Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The level of trust users have in your brand’s expertise is an important component when vying for that #1 spot, but Google has been ambiguous about what E-A-T actually is, and how it plays into your SERP rankings. In today’s episode of Whiteboard Friday, Lily Ray discusses the ways in which you can…",
  "content": "Measuring E-A-T? — Whiteboard Friday Whiteboard Friday | Advanced SEO | Branding By: Lily Ray October 21, 2022 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Lily Ray October 21, 2022 Measuring E-A-T? — Whiteboard Friday Whiteboard Friday | Advanced SEO | Branding The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The level of trust users have in your brand’s expertise is an important component when vying for that #1 spot, but Google has been ambiguous about what E-A-T (expertise-authoritativeness-trustworthiness) actually is, and how it plays into your SERP rankings. In today’s episode of Whiteboard Friday, Lily Ray discusses the ways in which you can prove that all important “E” – expertise. Click on the whiteboard image above to open a high resolution version in a new tab! NOTE: In December 2022 Google updated E-A-T to include an additional E for Experience. This Whiteboard Friday video is still valuable for learning about E-A-T and how to incorporate it into your content and SEO strategy. Read more on from Lily Ray on E-E-A-T. Video Transcription Hi, there. My name is Lily Ray, and today we're going to be talking about E-A-T — expertise, authoritativeness, and trustworthiness. We're particularly going to be focusing on the E component, expertise. What is E-A-T? So just to take a step back, E-A-T stands for expertise, authoritativeness, and trustworthiness. It comes directly from Google's Quality Rater Guidelines, which is a document that they use to train human search quality evaluators that they use to conduct tests thousands of times every year to basically benchmark and see how well Google is doing in terms of meeting the expectations of its users. Throughout this document, Google uses E-A-T pretty much synonymously with good content quality, but they're looking for the raters to describe how well the content creators and the sites are meeting the expectations of users in terms of demonstrating good expertise, authority, and trust. Google also has a document that's related to learning SEO. So if you go on Google Search Central, they have documentation related to how you can learn SEO, and they explicitly say that you should be providing content that has a lot of great expertise. In Google's documentation about core updates, they have an article that's called \"What Webmasters Should Know About Core Updates.\" They share this article every time a new core update is rolled out, several times per year, and they explicitly say that you should get to know the Search Quality Rater Guidelines and particularly you should get to know E-A-T. Google also owns YouTube, and YouTube has its own documentation about particularly how it elevates high-quality information in the video results. There's one section that's dedicated to how it combats misinformation on YouTube, and in that section, they talk a lot about the importance of authoritativeness in YouTube rankings. Google, also, in its documents about Google News and Google Discover, they talk about the importance of E-A-T. So if you're a brand that wants to rank in Google News or Google Discover, Google extensively describes the importance of demonstrating good E-A-T throughout your content. Product reviews updates The product reviews updates are a new series of updates that Google started to roll out in the past year. In these updates, sites that do product reviews or companies that do reviews of different products, Google is saying that in order to rank really well for this type of content, they're expecting to see expert-level content, and basically experts and enthusiasts who know the products really well are the ones that are going to rank a little bit better than people that are just maybe reviewing products that they haven't actually tried or spent time with. Can you measure E-A-T? So a lot of people in the SEO industry are curious how do we measure E-A-T because Google tends to be pretty ambiguous about what E-A-T actually is, how it's measured. So it's not a direct ranking factor. It's really important to understand that, unlike something like page speed or Core Web Vitals, which is very measurable, there's no E-A-T score. There's no way to know, on a scale of 1 to 100, how good is my E-A-T. The only factors that Google has explicitly confirmed as ranking factors that contribute to E-A-T are PageRank and links. That being said, there's a lot of ways that E-A-T plays into the algorithms indirectly and a lot of things that Google has said that we can piece together to understand the role that E-A-T plays in the algorithms. Google's expertise patents So, for example, there's a variety of different patents that I've been researching with the patent expert, Bill Slawski, rest in peace, late patent expert Bill Slawski. Basically, there's a variety of different patents that describe the role that authoritativeness might play in the search results. So, for example, starting way back in 2007, Google registered for a patent that allows it to understand who the author is of a given piece of content and to rank that content according to the authoritativeness of that author. More recently, there's a patent called website representation vectors, which Google applied for in 2018, and this patent allows Google to understand how authoritative a piece of content is or how authoritative a brand is and to rank that content accordingly. They also have a couple of different patents to identify who authors and experts are either by their writing style or by their tone of voice or their accent. So Google is doing a lot of work to really kind of get an understanding of who everybody is and to understand the areas where they're credible or where they demonstrate expertise. The results of this is what Google has been doing across a lot of different products and throughout the course of many years in the SEO space, which is really trying to get an understanding of who the authors are, why they can be trusted, why they're credible. There's a lot of different examples, for example dating back to Author Rank and Agent Rank, which was something around 2007. It's been a very big project for Google. Later, they had rel=author. They've had a lot of different manifestations of how they're basically identifying different authors in the search results and ranking content according to their authoritativeness. But what this boils down to is the role of experts in SEO. I believe that this is where Google is really going. They're trying to get an understanding of who the authors are, why they can be trusted, what are the areas where they specialize, and what is the subject matter where they demonstrate true expertise. I believe that with the product reviews updates, which are relatively new updates by Google, this is an update where they're algorithmically trying to understand who is a true subject matter expert, who has actually done the work of putting together the research because they've actually spent a lot of time reviewing the products. I believe that they're taking this type of approach to a lot of the different algorithms that they're using where they're trying to understand who's an expert that's actually done the research, they've spent time in the field, they've done a lot of this work. They're not just SEO people or content marketers who are doing keyword research and reverse engineering what's already ranking and kind of saying the same thing as everybody else. In fact, there's another patent that Google has, which basically enables them to identify, when they have a bunch of pieces of content that talk about the same thing, if there's one piece of content that has something new, they're able to basically elevate the rankings of that piece of content because it's introducing something new to the conversation. What Google is doing with entities So with all these patents and the ability to identify individual experts, we have to remember what Google is doing on a larger scale with entities. So particularly with something like Google's Knowledge Graph, which allows them to understand 500 billion facts about 5 billion entities online, this is a way that Google can basically say, \"This is a person, place, or thing. We know all these different information about them, and we know how they're connected to other entities.\" So this is a visualization of what that might look like. There's a variety of different tools that are available online to visualize how these entities are understood, all the different attributes that might relate to these entities. So in this example, we have Joe Smith, and perhaps we know that Joe Smith has a certain hometown. He has a certain age. This is his career. This is the name of his wife. These are the awards that he's won. This is the skills that he has. Google is able to start building out that profile for that entity, and that could play into, potentially, the way that Joe Smith ranks for different content that he's found in or perhaps how he's displayed in Google Knowledge Graph or Google Scholar. I personally believe that Google is connecting the dots between all these different Google products and evaluating E-A-T across all these different products when they're looking for somebody to rank on YouTube or somebody to rank on Google, depending on the query itself, depending on how much E-A-T is required for that query. So if it's something where what we call your money or your life, it's very much related to health, it's related to finances, security, E-A-T is going to be much more important for those queries, and they're going to do this evaluation to say, \"We know that we have all these different authors that we can choose from and different brands that we can choose from. We have this understanding of E-A-T on the entity level.\" Incorporate experts into your SEO strategy That's going to play a role in who they choose to rank for certain queries. So how can we factor this into our SEO strategy? Well, I think it's very important to focus on incorporating experts into your content strategy. So what my team and I do, for example, is we might work with a bona fide expert in a different area, bring that person into the conversation in terms of creating content. There are also many examples where the expert themselves actually creates the content or starts a blog. I've seen, in my research, many, many examples of experts who are providing first-hand information about their area of expertise. In many cases, they're not necessarily linking out to other sites when they're citing their sources in terms of how they're putting together information. They're actually breaking the news. They're providing the information. They're talking about what it's like to work in their respective fields. So they offer first-hand experience, and I strongly believe that Google is algorithmically trying to identify where that first-hand experience exists. They're providing original research, which is something that Google has been elevating algorithmically. Google has actually said in the past couple of years that they're going to elevate the rankings of content that provides original research above the other people that are maybe linking back to that original research or citing it. There's nothing wrong with citing that research. It's just that Google is going to now kind of reward the source that's breaking the news. There's also, in the case of top stories for news sites, Google can apply a label that says \"Highly cited,\" if it's the piece of news that all the other news sites are linking to. In the case of experts, other people are often linking to them. So while it's definitely a best practice in SEO to link out to other sites and to cite your sources and to link to all the places that are helping you provide information, in the case of using expert-driven content, many people are linking to the expert. So you don't necessarily need to link out that much if you're the expert writing the content, because you're just sharing what you know about the area where you actually demonstrate expertise. In the case of the experts that are doing very well with SEO, you can look at the link profile, and you can notice they're the ones breaking the information, and other sites are referencing them with links. They're also very focused on their niche. So one thing that Google is doing a lot of is that they are basically evaluating E-A-T on the website level, on the domain level. This is something that my team and I notice in our research. You can basically take something like a website's categories, a website's tags, a website's breadcrumbs. You can collect all that information, cross-reference it with the performance of how the site is doing for SEO with using Google Search Console or Google Analytics or another analytics tool, and you can start to visualize the different categories and subcategories and topics where a site tends to demonstrate a lot of expertise, where it tends to drive a lot of traffic. You might notice that there are other areas or other topics or breadcrumbs or subcategories where your site is unable to rank. This is especially true for your money or your life sites. There are often cases where you're able to maybe perform well on topics related to like fitness and nutrition but maybe not as much when you talk about medical conditions or health conditions. Also, with expert sites, it's really important to include author bios. So you want to talk about who that expert is. You should include their name in the content. If you have somebody else writing the content, try to incorporate the expert into that content strategy. So you can say, \"This article was written by Sarah, but the expert reviewer was Joe Smith, and he came in to basically review the content.\" So that's a nice way to incorporate experts into your content strategy, and you can basically, with any of the clients that you work with or your company that you work with, work with the people who are actually the bona fide experts at your company and see if you can incorporate them into your content strategy even if it's just to say, \"Can you please review this content and make sure it makes sense, make sure it's factually accurate? Can we include your name on it?\" In some cases, they might be skeptical to say, \"Why do you want to include my name in your content? Why is the marketing team involving me in this process?\" One thing that I've found very effective is to talk to them and say, \"This is actually a personal branding strategy for you. If we put your name behind this, if we build this really nice profile for you on the website, you're probably going to have a really nice listing on Google that ranks for your name.\" That often gets their attention, and that's something that they want to participate in. So that's kind of in line with what we call like a brand SERP. You can have the expert Google their own name, and you can say, \"Are you satisfied with the way that it looks on Google?\" We can influence that. If you really go deep into this strategy, you can ultimately help them get included in Google's Knowledge Graph, which is definitely something people love to show off. When you Google your name, you get all this great information directly on Google about the expert. I believe that, tying it all together, when you have experts who Google understands who they are, Google understands all these attributes about them, and how much they can be trusted in a certain area, I believe that that process is something that Google is more and more incorporating into its evaluation in who gets to rank for certain keywords. Conclusion So tying it all together, I think expertise is becoming increasingly important. E-A-T is extremely important, especially for your money or your life websites. It's not going anywhere. It's something that Google references throughout much of its documentation. So think about not taking shortcuts when it comes to demonstrating E-A-T but really kind of doing an overhaul of your content strategy to make sure that real experts are collaborating with you in the content process. So I hope you enjoyed the talk. My name is Lily Ray, and my Twitter handle is @lilyraynyc. So feel free to get in touch with me and enjoy the rest of your day. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Measuring E-A-T? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Measuring E-A-T? — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "What is E-A-T?"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Product reviews updates"
    },
    {
      "level": "H2",
      "text": "Can you measure E-A-T?"
    },
    {
      "level": "H2",
      "text": "Google's expertise patents"
    },
    {
      "level": "H2",
      "text": "What Google is doing with entities"
    },
    {
      "level": "H2",
      "text": "Incorporate experts into your SEO strategy"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    }
  ],
  "author": "Lily Ray\n          \n            Lily Ray\n          \n            Lily Ray"
}