{
  "url": "https://moz.com/blog/measuring-website-engagement",
  "slug": "measuring-website-engagement",
  "title": "5 Ways to Measure and 3 Tips to Improve Website Engagement - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "5 Ways to Measure and 3 Tips to Improve Website Engagement SEO Analytics | Whiteboard Friday By: Dana DiTomaso July 9, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Dana DiTomaso July 9, 2021 5 Ways to Measure and 3 Tips to Improve Website Engagement SEO Analytics | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Today is the last day to purchase MozCon Virtual 2021 tickets! As a sneak preview of the amazing content you can expect to see, please enjoy this very special Whiteboard Friday episode from MozCon speaker Dana DiTomaso, where she walks you through the ways you can measure and improve your website engagement in order to determine whether or not you actually need to redo your website. And don't forget to grab your ticket to see Dana's presentation, Build for Search: Modern Web Dev That Puts SEO First, along with our other amazing speakers on July 12-14: Secure Your Seat at MozCon Virtual Click on the whiteboard image above to open a larger version in a new tab! Video Transcription Howdy, Moz fans. My name is Dana DiTomaso. I'm President and partner at Kick Point, and we're a digital marketing agency headquartered in Edmonton, Alberta, Canada. I'm going to be talking to you today about a question that I think many people have, which is how do you actually measure website engagement. I think it's something a lot of people struggle with because you might be approaching a period with your website where you're thinking: Is time to redo the website? Is the website actually meeting our goals? But you may not have a lot of the things set up in order to measure engagement in a way that helps you answer those questions. A lot of times you might just be shooting in the dark and saying, \"I think this is what's happening.\" But is it truly what's happening? You may think you need to add an expensive tool, some sort of screen measurements or something like that in order to get what you need. But there's a lot you can do with basic setup in Google Tag Manager and Google Analytics to measure website engagement. So that's what I'm going to talk to you about today. So over here I have different ways to measure, and then here behind me I have different ways to improve. Ways to measure website engagement So we're going to start with the stuff we're going to measure, and then we're going to move on to the things we're going to improve. 1. Scroll depth So first off, think about scroll depth. This is one of the basic metrics that I think people think about but they don't really do a lot with. So one of the things that if you're using Google Analytics 4, there's a built-in scroll depth metric, which you might already be using, but that only measures 90% scroll and that might be too far for a lot of people. What I would recommend is, if you're not using GA4 yet or if you're still using just Universal, even if you are using 4, make sure you're also measuring at least 25%, 50%, 75%, and 100%. You can also measure 90%. You can also measure 10%. I've seen lots of different ways. You can measure 1%. It seems a little much, but you can do that too. What you're looking for there is the idea of setting individual triggers for each of these scroll depths, because what you want to know is when that 25%, 50%, 75%, and 100% is hit, but you don't just want to save them as events in Google Analytics, because there isn't a lot you can do with that in terms of math. What you want to do is you want to set each scroll depth as a custom metric. If you aren't familiar with custom metrics, in Google Analytics there are dimensions and there are metrics. So a dimension is something like the city that people were from or the page that they were visiting. A metric is the number of page views or users that happened. So, in this case, it's the number of times that somebody viewed a page versus the number of times that people went 25% of the way down the page or 50% or 75%. When you save those as custom metrics, then you can do some math to figure out what the average scroll depth is, for example, and that's a really nice way to figure out if people are actually looking at your stuff or if they are interested, or maybe there's a really interesting CTA that's driving them away, but then they're not seeing something even cooler further down, or maybe the page looks like it ends, so they're not going any further. There are lots of interesting things you can figure out from that. 2. Was an important CTA viewed? The next thing is: Was an important CTA actually viewed? So I think this is a metric that not a lot of people really think about. You sprinkle CTAs all over your site, but you don't know if anyone is actually looking at them. A page view tells you nothing, because a page view is just I opened up the page and I might have done it accidentally. Maybe I hit back right away. It's still a page view. I could have the tab open in my browser forever. Maybe I don't want to get rid of it yet. That's a page view too. It doesn't mean they actually saw anything useful or did anything with that information. So one of the things you can do in Google Tag Manager is you can create something called an element visibility trigger. An element visibility trigger is basically what it sounds like. Was the element visible? So let's say, for example, you want to record each call to action, and each call to action is in a specific div called CTA, for example. So in Google Tag Manager, you would set up an element visibility trigger, and you would say every time the CTA is visible I want you to record an event, and then you would know how many times people actually saw that CTA. Another example we've done for this is sometimes clients will have forms that are only open if you click a button, and so then we would record how many times people actually clicked that button to open the form, because your conversion rate, if you're just looking at page views, isn't really accurate. It's not actually seeing the form itself. So that way you're getting a much better sense of how many people are actually viewing the form and how many people are actually filling out the form, and that can also help you make some good user behavior decisions with regards to your website. 3. Form engagement Now, moving on to form engagement, some other stuff that I think you should be measuring is people, how they engage with forms, because, let's be honest, that required thing, it sucks. I know a lot of people are like, \"Well, not all the fields are required. Look at this huge form that we have, but only 6 fields of the 18 are required.\" That's still not a great experience. We've had forms for a long time now. Not a lot of people still know that the little star means required. They think they have to fill everything out. It seems intimidating. They walk away. I think it's pretty well-accepted knowledge by now, but I also think a lot of people are like, \"Oh, but we have to have this big form for reasons.\" So what you want to know is how people are engaging with that form. Again, in Google Tag Manager, there is a piece of JavaScript you can run that will record when people enter a form field and then did they fill it out or did they skip it, as in they just clicked into it and they clicked out of it. So I'm going to link in the transcript for this to a JavaScript recipe, made by the company Bounteous, that you can put into Google Tag Manager to record this information. I find it really useful, particularly when you're in that situation where you're saying to a client or your team, \"I think we have too many fields in this form.\" They're like, \"No, everybody uses them.\" You're like, \"Do they?\" Now you'll know through this engagement trigger. 4. Google Translate usage Something else that I like to check too is Google Translate usage, because again maybe your site is just in English, but you maybe are wondering, \"Is it worth translating our site into Spanish or French?\" There are more languages than English in the world. So one of the things you can check is if people are using Google Translate to view your website. Again, in the transcript, I will link to a recipe for Google Tag Manager to actually check if people are using Google Translate to view your site, which is really interesting and frankly pretty eye-opening for clients a lot of the time. So I recommend using that as well. 5. Accessibility tool use Then accessibility tool use. Accessibility is a conversation that I think every company should be having with regards to their website, because people use assistive devices to manage their website usage and how they're actually engaging with websites. Not a lot of websites really make accessible experiences unfortunately. So one of the tools that we use is called Monsido Page Assist. If you go to our website at kickpoint.ca, you'll see this little widget down in the corner, and then if you click that, then we record that, yes, somebody actually engaged with this. Then we can see what percentage of people on our site are using that widget in order to make their experience better, and then we know maybe we need to improve something or maybe this is just them changing the fonts or whatever it might be. So that's another really good thing that you might want to measure when you take a look at your website. Ways to improve website engagement So I've given you some ideas of stuff you can measure. Now, how are ways that you can improve just generally with this data or overall in terms of your website? So this is this section over here, the ways to improve section. 1. Tie metrics to your revenue and conversion goals So the first thing obviously, and I always talk about this in every talk, is you really need to make sure to tie these metrics to your revenue goals. I think that is just one of the biggest mistakes that people make, when reporting in Analytics or really anything, is you're not tying it to anything. You're measuring for the sake of measuring, but you're not saying what the impact of this is. So, for example, visitors who see this call to action are 90% more likely to convert than people who don't. Being able to measure that and being able to say that stat with confidence, maybe not that stat specifically, but a stat, when thing A happens, we make more money, that is how you get changes done, and that's one of the best ways to communicate this. So if you can take any of this measurement stuff and communicate it in a way that really gets it across to whoever is the decision-maker, if it isn't you, that if you make this change, you're going to make more money, hit your goals, get to your revenue goals faster, that is a really easy way to make sure that this stuff happens. 2. Record the full referrer path Next thing, one of the things that I think, and again I'll link in the transcript to this — it's a lot of JavaScript and stuff, so I don't necessarily want to write JavaScript out on my whiteboard here — is recording the full referrer path. Now you might know that in Google Analytics there is a dimension called referrer path, but it isn't necessarily useful. The full referrer path is something that's available in the browser a lot of the time, but it isn't something that is captured by default in Google Analytics. By capturing that full referrer path, you can get a little bit more information about exactly where people are coming from. I find that that is also really helpful information because it can help you sort of segment out a little bit better and say it isn't just people from say Reddit who are coming to the site. It's people coming from Reddit from this specific subreddit, and those are the people buying our stuff. That is additional information that you didn't necessarily have available to you. So that, I call it the \"complete referrer,\" is a nice custom dimension to add into your Google Analytics implementation to just get that little bit more information to help you make better decisions and figure out ways to improve. 3. Use a ?subscriber=yes parameter Then the third thing, this is like a personal pet peeve of mine. If I'm already on your newsletter, don't show me a giant pop-up asking me to sign up for your newsletter when I click a link in your newsletter to get to your website. People think, \"Well, I don't know how to do this.\" So here's how you do it. You can add a parameter to your URLs. It's like ?subscriber=yes, for example. Then when you deliver that popover CTA, don't deliver it if that parameter exists in the URL that the person is viewing. That means they're already on the list. You can show them something saying, \"Thank you for being a subscriber.\" It might be a little bit creepy, because people may not know how you know that they're a subscriber. But that's one of the ways that you can just generally improve things for your user experience. So only show the CTA to the people who could conceivably convert, because otherwise you're just wasting bandwidth. I'm already on your mailing list. Stop trying to sell me. You already sold me. So I would really recommend adding this parameter. You can think about it for others CTAs as well. So, for example, if someone comes to the website via a link in an invoice or a receipt, like they bought something, then don't try to sell them the thing that they just bought. There are lots of things you can do with Google Tag Manager and reading different parameter outputs in URLs and then making decisions based on what's shown or not shown based on what's in those URLs. That's again an easy way to improve things without necessarily having to measure a lot of engagement. It's just using the tools that you already have access to in order to make the user experience better for the people coming to your website. Conclusion So hopefully some of this measurement stuff, the ways to measure and the ways to improve, will help you build a better website experience. Maybe you still do need a new website. Maybe the website you have is difficult to manage and it's really expensive, or it's a big old flaming pile of trash. Who knows what could be wrong with it? But don't throw it out just yet. If you're not sure, measure some stuff first and then make a call whether or not it's time to do your website. Thank you. Video transcription by Speechpad.com Tweet your questions and comments about website engagement using #MozBlog! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "5 Ways to Measure and 3 Tips to Improve Website Engagement"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "5 Ways to Measure and 3 Tips to Improve Website Engagement"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Ways to measure website engagement"
    },
    {
      "level": "H3",
      "text": "1. Scroll depth"
    },
    {
      "level": "H3",
      "text": "2. Was an important CTA viewed?"
    },
    {
      "level": "H3",
      "text": "3. Form engagement"
    },
    {
      "level": "H3",
      "text": "4. Google Translate usage"
    },
    {
      "level": "H3",
      "text": "5. Accessibility tool use"
    },
    {
      "level": "H2",
      "text": "Ways to improve website engagement"
    },
    {
      "level": "H3",
      "text": "1. Tie metrics to your revenue and conversion goals"
    },
    {
      "level": "H3",
      "text": "2. Record the full referrer path"
    },
    {
      "level": "H3",
      "text": "3. Use a ?subscriber=yes parameter"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H3",
      "text": "Tweet your questions and comments about website engagement using #MozBlog!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dana DiTomaso\n          \n            Dana DiTomaso\n          \n            Dana DiTomaso"
}