{
  "url": "https://moz.com/blog/media-content-web-search",
  "slug": "media-content-web-search",
  "title": "Media Content & Web Search - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As Google, Yahoo! & the major engines dive into rich media and alternative data sources (news, video, images, etc.), it's important for SEOs to keep on top of the changes and how best to optimize for them. Image searches are already a great source of traffic for sites t...",
  "content": "Media Content & Web Search Mobile SEO By: Rand Fishkin February 2, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 2, 2005 Media Content & Web Search Mobile SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As Google, Yahoo! & the major engines dive into rich media and alternative data sources (news, video, images, etc.), it's important for SEOs to keep on top of the changes and how best to optimize for them. Image searches are already a great source of traffic for sites that offer them and hosting your own image content on your site can bring in extra traffic, particularly if you're serving the types of pages & images that image searchers are seeking. Currently, there aren't any web tools for seeing the number or kinds of image searches that are being done, but common sense can help, just as it did before Overture & Wordtracker existed. Think about the content you serve and imagine related search terms that would yield images - think along the lines of searchers seeking images for: School projects, reports or presentations Diagrams for use on their own websites or in papers Artistic photography for use in creative media or to Photoshop Images of famous/notable persons/places/things Photos of a region or specific landmark If your site can serve these, make sure to link your images to a page on the subject and provide alt tags. Also, serving the same image on multiple pages (if appropriate) can lend additional credit in image searches. Don't forget, too, that Google offers image search by size, and often ranks by size as well, so if you have high-res copies, offering them somewhere on your site can be helpful. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Media Content & Web Search"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Media Content & Web Search"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too"
    },
    {
      "level": "H3",
      "text": "Internal Linking for Mobile-First & Mobile-Only Indexing"
    },
    {
      "level": "H3",
      "text": "All About Fraggles (Fragment + Handle)"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}