{
  "url": "https://moz.com/blog/meet-the-new-moz-local",
  "slug": "meet-the-new-moz-local",
  "title": "The New Moz Local: Make Local Your Advantage! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Today we’re excited to share our latest updates to Moz Local. This release has something useful for everyone in local SEO — read on to see what's new!",
  "content": "The New Moz Local: Make Local Your Advantage! Local SEO | Moz News By: Dudley Carr November 17, 2016 Table of Contents Copied! By: Dudley Carr November 17, 2016 The New Moz Local: Make Local Your Advantage! Local SEO | Moz News Today we’re excited to share our latest updates to Moz Local. Moz Local is unique in that it serves a large number of small business, enterprise, and agency customers. Today’s release has something for all of our customers, and we believe it’s an important step to providing the best value to everyone, independent of their size and shape. What are we announcing today? We’re announcing an exciting set of new functionality and integrations for local marketers to help them be more productive and more effective, and a collection of new product packages. All of this is designed to help you — local businesses, enterprises and agencies — make Local your advantage. Try the new Moz Local today! Google My Business Sync Google My Business (GMB) is Google’s tool used by businesses to manage their online presence across Google, including Search and Maps. Now Moz Local automatically associates your GMB listing(s) with your Moz Local listings, enabling you to push updates to, and continuously sync any changes with GMB. Ensuring that your data is accurate on Google is essential to appearing and ranking higher in local pack search results. With this major new feature life just got easier — you no longer have to manage in both Moz Local and Google My Business. You can now manage all your local data from a single dashboard without ever going into GMB again. Connecting your Google My Business account to Moz Local is a snap. Your Google My Business listings are automatically associated with your Moz Local listings and any changes in either Moz Local or Google My Business automatically sync between the two systems. New listing services Continuing our focus on automating distribution to the services in the local search ecosystem that most impact local search results, we’ve added active management of listings on 5 new services. Hotfrog: One of the most prominent directories for years, Hotfrog is a mainstay of the Local Search Ecosystem and we're proud to add them to our direct network. Apple Maps: Our new partnership with NavAds now gives us direct control over 4 other data sources — the first being Apple Maps. Now you have direct control over your listing information on the second-most popular navigation platform out there. Here: Next we have Here, which powers the mapping platform for Facebook as well as many other navigation networks worldwide. TomTom: One of the most popular GPS systems for cars in the country makes TomTom another vital addition. Navmii: Rounding out our complete mapping coverage is a Navmii, another growing mapping and navigation platform. Listing Alerts The best approach to local marketing is one that’s proactive. One of the most frequent complaints from businesses everywhere, regardless of size, is that Google can sometimes change your business information without warning. Though active location data management can help mitigate this, elements like \"store hours\" can still change, which can be detrimental to your business. Listing Alerts returns your control, notifying you immediately in our new Activity feed whenever your listing information is changed. This means you can proactively correct the problem, preventing potential complaints from customers, your organization, or your client if you’re an agency. This feature is especially powerful for enterprises and agencies who manage listings at scale. Listing Alerts in our new Activity Feed help you prevent potential customer complaints by bringing listing issues to your attention, helping you proactively correct any problems Improved reviews Consumer reviews are becoming more important to local search ranking. In this update we’ve added Google reviews to our list of the most popular review sites that you can monitor from your Moz Local dashboard, also including Citysearch, Foursquare, Superpages, YP, and Yelp. Now you can get Google reviews from Google My Business and reply directly to them from your dashboard. And for other review sites, our workflow provides direct links to the specific reviews on those platforms for fast action. Additionally, review notifications ensure that you never miss a review by showing you when you’ve received new ones. Now you can get Google reviews right in your Moz Local dashboard — along with reviews from CitySearch, Foursquare, Superpages, YP, and Yelp. Now you can respond to Google reviews directly from your Moz Local dashboard. And for other review sites, our workflow provides direct links to the specific reviews on those platforms for fast action. What are the new product packages? Our core principle is providing the industry’s most effective local marketing solution with great overall value. As local marketing continues to rapidly evolve, customer needs are expanding. To continue delivering on our core principle it became apparent that we needed to restructure our packages to offer greater and more targeted business value to local businesses, enterprises and agencies. Starting today, Moz Local will be available in 3 different product packages: Moz Local Essential Moz Local Essential is our new entry-level solution, designed to enable local businesses with one or dozens of locations to easily capitalize on best practices and the latest trends in local SEO. This package offers our industry-leading Active Location Data Management, including Google My Business Sync. In addition, Reputation Monitoring and Management is integral in this package since reviews are becoming more important in local search ranking. At $99/location per year, it’s packed with functionality — while remaining priced less than 50% of the leading competition. Moz Local Professional For Enterprise brands and agencies that need an enterprise-class solution to manage their location data at scale (hundreds to thousands of business locations), Moz Local Professional includes everything in the Essential package — PLUS: New Listing Alerts that notify you immediately in the new Activity feed whenever your listing information is changed Local SEO Analytics that enable marketers to analyze results and make informed decisions that improve local marketing performance Our Success Assurance Program*, with an assigned Customer Success Manager to oversee your account, perform a listing health audit and competitive ranking analysis to establish your baseline, assist with FastStart onboarding, and provide local SEO insights to help you achieve your search performance goals. (* Minimum 100 listings) Moz Local Professional is available at $179/location per year. Moz Local Premium For Enterprise brands and agencies that have a higher level of business need or unique integration requirements, Moz Local Premium includes everything in the Professional package — PLUS: All of the advantages that Moz Local has to offer made available via Moz Local API With a minimum of 100 listings, the full suite of organic SEO tools from Moz so that no part of your SEO strategy remains unmanaged. With Moz Pro, Keyword Explorer, Open Site Explorer and more, you can make sure the rest of your site is performing well to complement your local listings. Moz Local Premium is available at $249/location per year. Learn more Learn about all of the features in our new product packages by checking our new features page. See the new Moz Local in action by registering for one of our free webinars. Local is the new front door Local search is exploding: According to Google, there are now more searches on mobile than on desktop, and 30% of all mobile searches are related to location. 76% of people who search on their smartphones for something nearby visit a business within a day, and 28% of those searches for something nearby result in a purchase. To borrow a phrase: Local has become the new front door. With this level of consumer behavior and these new product offerings, there’s never been a better time to give Moz Local a try. We look forward to helping you make Local your advantage! More coming soon! Today’s just the beginning for the new Moz Local. As the global leader in SEO software, we’re continuing to invest in advancing local marketing with the industry’s most effective location data management solution. By the end of January — and a bunch more pizzas and, okay, some salads from now — we’ll be delivering another update with additional new functionality, including our new Customer-Actions metric, more enhancements to Google My Business Sync, and additional distribution enhancements. We might even have some exciting news to share along the way… Questions about our new features, product packages or pricing? Leave a comment or contact us at help@moz.com. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The New Moz Local: Make Local Your Advantage!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The New Moz Local: Make Local Your Advantage!"
    },
    {
      "level": "H2",
      "text": "What are we announcing today?"
    },
    {
      "level": "H3",
      "text": "Google My Business Sync"
    },
    {
      "level": "H3",
      "text": "New listing services"
    },
    {
      "level": "H3",
      "text": "Listing Alerts"
    },
    {
      "level": "H3",
      "text": "Improved reviews"
    },
    {
      "level": "H2",
      "text": "What are the new product packages?"
    },
    {
      "level": "H3",
      "text": "Moz Local Essential"
    },
    {
      "level": "H3",
      "text": "Moz Local Professional"
    },
    {
      "level": "H3",
      "text": "Moz Local Premium"
    },
    {
      "level": "H3",
      "text": "Learn more"
    },
    {
      "level": "H2",
      "text": "Local is the new front door"
    },
    {
      "level": "H2",
      "text": "More coming soon!"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dudley Carr\n          \n            Dudley Carr\n          \n            Dudley Carr"
}