{
  "url": "https://moz.com/blog/meet-mozzers-at-smx-west-2012",
  "slug": "meet-mozzers-at-smx-west-2012",
  "title": "Meet Mozzers at #SMX West 2012 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Conferences are always a great way to get out and meet the SEOmoz community. Luckily we have SMX West coming up next week and quite a few Mozzers will be attending, speaking, live blogging and tweeting. We want to get a chance to meet as many of you as possible so I forced everyone to decide on a…",
  "content": "Meet Mozzers at #SMX West 2012 SEO Events By: Jennifer Sable Lopez February 22, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jennifer Sable Lopez February 22, 2012 Meet Mozzers at #SMX West 2012 SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Conferences are always a great way to get out and meet the SEOmoz community. Luckily we have SMX West coming up next week and quite a few Mozzers will be attending, speaking, live blogging and tweeting. We want to get a chance to meet as many of you as possible so I forced everyone to decide on a schedule so you’ll know where to find us! Before I get into talking about where we’ll be, it’s probably best to first introduce the Mozzers so you know who to look for. Keri Morgret - @KeriMorgret You all learned a bit about Keri a few weeks ago when we spilled the beans about the Community Team. In addition to all her great community work, she's also a freelance marketer and helps clients with both SEO and PPC. You will find her speaking on Wednesday at 3:30 pm on the Beyond the Google Adwords Tool: Advanced Keyword Research Tactics panel. She'll be talking about negative keywords and some ingenius ways to make sure you're not spending money on unnecessary keyword targeting. You'll also find her live blogging for http://www.seroundtable.com/. Catch her live blogging schedule below. Michael King - @iPullRank As an Associate for SEOmoz, Mike focuses on answering questions in Q&A and writing for the blog (you may have seen his epic post yesterday). He's also done a Whiteboard Friday (or two) and is a great contributor to the SEOmoz Community. In his regular life, Mike's the SEO Manager at Publicis Modem in NYC. You'll find him all over SMX West this year! He'll be speaking on two panels: What Search Data Reveals About Customer Needs & Desires – And How To Use It, and he'll be on the Link Building Clinic. Two panels you'll surely not want to miss! One thing you may already know abut Mike is that he loves to get to know people, so if you see him walking by, say hi! I promise, he doesn't bite. Everett Sizemore - @balibones Another grand Associate, Everett helps out by answering Q&A and now and then I twist his arm to write for the blog. He's the Director of SEO Strategy at seOverflow.com and will be speaking on the panel Driving Ecommerce & Retail Sales Through Search, Thursday at 1pm. If you saw his post about building deep links into e-commerce sites, then you know a bit how his mind works. If you're working on an e-commerce or even just a really large site, I'd highly recommend not just going to this panel but also seeking Everett out in person. He's a ridiculous wealth of knowledge and we shouldn't let him keep all that inside. :) Charlene Inoncillo - @charcillo As our Marketing Admin, Charlene pretty much knows everything going on at all times on the marketing team. She’s new to the industry, so reach out and say hello! (ok, not literally). She'll be attending all of the SMX Bootcamp sessions on the first day and in general learning all about search marketing. Be sure to stop her to say hello and show her how amazing this industry is! Justin Vanning - @JustinVanning Justin does Paid Search Marketing for Moz so you’ll probably see him spending much of his time in the PPC & Retargeting sessions. He'll be looking for ways to help out the SEOmoz Marketing team in addition to meeting our community. Want to know more about our retargeting efforts, or how we do Facebook advertising? Justin's your man. Give him a holler and ask him about his Twitter strategy. ;) Jen Sable Lopez - @jennita *waves hello* If you haven't met me yet, I'm the Community Manager here at SEOmoz. I’ll be live-tweeting the heck out of SMX so be sure to watch out for my tweets from @jennita. I'm hitting up a lot of the SEO and social media panels. I love to sit in the front row and make faces at the speakers, so beware! If you're not able to make to SMX follow my tweet stream and I'll attempt to keep you up-to-date. If you're at the conference, please say hello! I love meeting our community members and really try to make it my goal to meet as many of you as possible. Now that you know who you should be looking for, let’s see where all you can find us! Remember some of us are speaking, others are live blogging (or tweeting) and some of us are just attending. Also, we reserve the right to change our minds and attend different sessions as necessary. :D Monday, February 27 – 6:00pm to 7:30pm SMX Meet & Greet Most of us will be attending the networking event on Monday night, so find us and say hello! We’re also planning on going for drinks after so let us know if you’d like to join us. :) Tuesday, February 28 9:00am-10:15am SMX Boot Camp: Keyword Research & Copywriting For Search Success - Charlene Getting Personal, Part 1: How Google & Bing Personalize With Social Connections – Jen (live tweet) + Keri (live blog) Maximizing Paid Search Campaigns With Google’s AdWords Extensions - Justin 10:45am-12pm SMX Boot Camp: Link Building Fundamentals - Charlene Getting Personal, Part 2: How Google & Bing Personalize With Search History & Geography - Jen (live tweet) 1:30pm-2:45pm SMX Boot Camp: Paid Search Fundamentals - Charlene Solving Problems & Seeing Success In Google Places – Jen (live tweet) Power Tools For The Paid Search Pro - Justin 3:30pm-4:45pm SMX Boot Camp: Search Engine Friendly Web Design - Charlene Don’t Panic! A Hitchhiker’s Guide To Surviving SEO Changes – Jen (live tweet) + Keri (live blog) Retargeting & Remarketing: The New Behavioral Ads - Justin Wednesday, February 29 10:45am-12pm SEO For Google+ & Google Search – Charlene + Jen (live tweet) Search Ads: Taking Your Ads From Good To Great! – Justin Real Answers For Technical SEO Problems – Mike (Q&A Moderating) 1:30pm-2:45pm Building Buzz On Twitter: Getting Followed & Retweeted – Charlene + Jen (live tweet) Best Practices For Paid Search Testing – Case Study Panel – Justin Schema.org, Rel=Author & Meta Tagging Best Practices – Keri (live blog) 3:30pm-4:45pm Building Buzz On Facebook: Getting Liked & Shared – Charlene + Jen (live tweet) Beyond The Google AdWords Tool: Advanced Keyword Research Tactics – Justin, Keri (speaking) 5:00pm-6:15pm Creative Facebook Ad Tactics - all of us will be there! 9pm-11pm: SMX After Dark @ Motif Thursday, March 1 9am-10:15am The \"New\" Killer Content - Charlene Justifying The Investment: Analytics For Social Media - Jen (live tweet) Maximizing Enterprise PPC ROI - Justin 10:45am-12pm Enterprise SEO – Challenges & Solutions - Charlene What Search Data Reveals About Customer Needs & Desires – And How To Use It – Jen (live tweet) + Justin + Keri (live blog) + Mike (speaking) 1pm-2:15pm Driving Ecommerce & Retail Sales Through Search – Everett (speaking) Link Building Clinic – Mike (speaking) Say Hello! I'm serious here. If I find out that you were at SMX and didn't say hello, I'm going to be sad. Just think if you find us, you may even get a lovely picture with some of us... like this: See you at SMX! PS. If you haven't bought your ticket yet, use the code smx10seomoz to get a discount when you register for SMX. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Meet Mozzers at #SMX West 2012"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Meet Mozzers at #SMX West 2012"
    },
    {
      "level": "H2",
      "text": "Keri Morgret - @KeriMorgret"
    },
    {
      "level": "H2",
      "text": "Michael King - @iPullRank"
    },
    {
      "level": "H2",
      "text": "Everett Sizemore - @balibones"
    },
    {
      "level": "H2",
      "text": "Charlene Inoncillo - @charcillo"
    },
    {
      "level": "H2",
      "text": "Justin Vanning - @JustinVanning"
    },
    {
      "level": "H2",
      "text": "Jen Sable Lopez - @jennita"
    },
    {
      "level": "H2",
      "text": "Monday, February 27 – 6:00pm to 7:30pm"
    },
    {
      "level": "H2",
      "text": "Tuesday, February 28"
    },
    {
      "level": "H2",
      "text": "Wednesday, February 29"
    },
    {
      "level": "H2",
      "text": "Thursday, March 1"
    },
    {
      "level": "H2",
      "text": "Say Hello!"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez"
}