{
  "url": "https://moz.com/blog/meetup-at-the-search-church",
  "slug": "meetup-at-the-search-church",
  "title": "Meetup at the Search Church in Philadelphia - We Want YOU to Speak - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Hey party people! We are really excited to announce that the Mozzers are headed to Philadelphia. That's right! On May 10th we're having a meetup at the infamous SEER Search Church. You'll get a chance to see both Rand Fishkin and Wil Reynolds speak (for free even) and network with other l...",
  "content": "Meetup at the Search Church in Philadelphia - We Want YOU to Speak SEO Events By: Jennifer Sable Lopez April 3, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jennifer Sable Lopez April 3, 2012 Meetup at the Search Church in Philadelphia - We Want YOU to Speak SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Update 4/17/2012 - Speakers announced! Wil Reynolds Topic: Rapid fire link building strategies Annie Cushing Topic: Web Scraping for Code-ophobes Eppie Vojt Topic: The Linkbuilder's Guide to Scraping Everything Ian Howells Topic: Using the Location Report in GA for Content Creation Rachael Gerson Topic: Developing KPIs - Top Goals & Pitfalls for SEO Projects Purna Virji Topic: Good Karma Link Building Chris Countey Topic: Everything You Need to Know about Google Authorship in 8 Minutes Joanna Lord Topic: Retargeting 2.0 Rand Fishkin Topic: Manifesto of Content Strategy A HUGE thanks to all the people who pitched some really incredible topics! This really goes to show there are some outstanding marketers in Philly. We look forward to seeing you all there. :) - Jen Hey party people! We are really excited to announce that the Mozzers are headed to Philadelphia. That's right! On May 10th we're having a meetup at the infamous SEER Search Church. You'll get a chance to see both Rand Fishkin and Wil Reynolds speak (for free even) and network with other local marketers. If you've ever attended one of our meetups or our MozCation events in the past, you know that we're all about actionable content, great networking and loads of fun (you know the F in TAGFEE). This, my friends, is the Search Church. Who: You, local search marketers & Mozzers (Whee!) What: FREE SEOmoz Meeup in Philly When: May 10 from 4-8pm Eastern Where: Search Church at SEER Interactive - 1028 N 3rd St Philadelphia, PA 19123 Why: Why wouldn't you? This time however, we're changing things up a bit. We're not convinced that Rand and Wil are the only ones who know their stuff. :) In fact, rumor is that Philly has a ton of amazing marketers. So we want to hear from you, yes YOU. Speak at the Meetup Yes, you totally read that right. We're opening up the stage to local marketers! Each presentation will be no more than 8 minutes and must be full of action and win. This is your chance to show your stuff to your local community. Have an amazing link building tactic, or want to show off that tool you built? Then we want you to submit your pitch to speak. Seriously. Do it right here (by April 11th): Loading... Deadlines & Calendar You have until April 11th to get your speaker submissions in. That gives you one week to get on the ball. You can see the full schedule below. Other Details A few things to note: You don't have to be an SEOmoz member to speak or attend You do obviously need to be present at the event to speak :) Please only register if you're able to attend. We do have a limited number of spots and we want ensure everyone who wants to attend, can. GET READY FOR A NIGHT FULL OF WIN Watch this video to see the amazing \"Search Church\": Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Meetup at the Search Church in Philadelphia - We Want YOU to Speak"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Meetup at the Search Church in Philadelphia - We Want YOU to Speak"
    },
    {
      "level": "H2",
      "text": "Update 4/17/2012 - Speakers announced!"
    },
    {
      "level": "H2",
      "text": "Speak at the Meetup"
    },
    {
      "level": "H2",
      "text": "Deadlines & Calendar"
    },
    {
      "level": "H2",
      "text": "Other Details"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez"
}