{
  "url": "https://moz.com/blog/meet-your-community-building-team",
  "slug": "meet-your-community-building-team",
  "title": "Meet Your Community-Building Team - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When you build a community around your company, you're building your brand and your business. In order to make that happen, you've got to have the right team in place. It's time to think differently about roles.",
  "content": "Meet Your Community-Building Team Community Management By: Mackenzie Fogelson June 11, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Mackenzie Fogelson June 11, 2013 Meet Your Community-Building Team Community Management The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Building a community around your brand isn't just about the strength of your social media presence. It’s not about how you manage your social media outlets or whether you’re on Facebook, Google+, or Twitter. It’s not about how many blog posts you write or how often you use video or email marketing. It’s about building a company. A thriving community — one that brings visibility, targeted traffic, trust, credibility, conversions, customers, and ultimately revenue — is built upon a solid business that is investing tirelessly in its products, its services, and improving the experience it provides for its customers. If you want to build your business and a community around your brand, you've got to provide value. You’ve got to create the right content. You've got to effectively integrate SEO. And, most importantly, you've got to have the right team. And I’m not just talking about your marketing team. Time to drop the silos If you want your team to be successful at building your community and your business, you’ve got to think differently. And you’ve got to drop the silos. Your team's specific jobs and designations are important to the day-to-day running of your company's business (otherwise I wouldn't have bothered writing this post). But there is one big overarching truth for each and every person associated with the company: In the broad scope, it doesn't matter what your job title is, what department you’re in, or what your job description is. Your role is to do whatever it takes to make the company thrive. Everyone who works in your company is on the same team: the team that wants to accomplish the stuff that matters and will make your business a success. So who’s gonna do the work? As we’ve worked with companies (in many different industries and all with unique challenges) to build their communities and their businesses, we’ve been asked to help them understand the roles that are involved and also provide guidance as to best structure their team. In our experience, what follows are some of the roles that are necessary to have on your community- and business-building team. But before we get into that, please note: I’m not suggesting that you hire one person for each of these roles. Depending on the size (and the goals) of your company you may have many people doing many things. This is simply a rundown based on our experience with both small and large companies who have embarked on this community-building extravaganza. My intention is to provide some general guidance that you can then apply to your unique situation. There’s a whole bunch of stuff that surrounds building your community and your business that goes way beyond defining roles and team infrastructure like earning buy-in, defining goals, developing strategy, execution and testing, and evaluating and adjusting. You can get more information about all that good stuff in my SearchLove slide deck. Today, I’m going to focus specifically on the roles of the team. Now, back to our regularly scheduled program. Allow me to introduce you to your community building team: Project management Who’s responsible Someone to keep the entire team on schedule and on task. Even if you’re working with an external team (agency or other partners) who will take the lead on this role, you need to have someone inside your company who is responsible for being the internal project manager. What’s required Although this person may not be the one doing the daily nitty-gritty client work, they will interface with all of your internal and external teams on an ongoing basis to ensure that whatever needs to get done actually gets done, and that everyone is working toward the same goals and off of the same creative strategy. Ideally, when bringing in an outside agency, you want to work together to clearly define the expectations for this role, how it relates to communication, and who specifically is being held responsible for getting stuff done. Community management Who’s responsible Someone who can represent your brand on social media, as well as monitor and manage the rest of your team's social media activity. Depending on your goals, your community manager will most likely assume two identities: one as your brand (your logo is their face): And one for their own individual presence under your brand: What’s required Because this role is so demanding, I would highly recommend (especially for you smaller companies out there) that it’s not filled by your CEO or someone who cannot commit their attention on a daily basis. And, please, for the love of Dr. Pete, don’t assign this role to an intern. Community management is a lot of hard work (I repeat: A LOT). Especially if you already have a thriving community, managing it requires a great deal of attention, engagement, and consistency on a daily basis. Your community manager is on a podium every day representing your brand, so be sure to choose the person for this role very wisely. In addition to the normal stuff like sharing value (and not just your own), your community manager will be responsible for communicating what’s going on with your company, like events and products or service stuff. They will take the lead on engaging and answering questions that may arise (with customer or product support). Even more important is facilitating social monitoring and listening (which is imperative) and probably (depending on size) handling some reputation management. If that’s not enough, there will always be opportunities (things that they observe that could contribute to the growth of your business, or simply to building relationships) that arise in their interaction in and among the community that will require further investigation. That’s a lot of load to carry so your community manager needs to be one amazing (and capable) person. Hands down, you’ll want to have an excellent communicator in this position as they are the social face of your company. If you’re working with an agency to assist with community management, you can share the load, but be sure to work together as a team to develop a plan for how management will work. Be present and involved with strategy, execution, engagement, and ensure whatever is being done is what’s best for your company and is working toward the goals that have been set. Strategy, creativity, analysis, and direction Who’s responsible Someone (or a few someones) who will develop and facilitate the direction of your web marketing and community building efforts. If you’re working with an agency, you can certainly lean on them to lead this piece with your direct involvement. What’s required The most important part of this role is to ensure that all teams (both internal and external) are working together to align all efforts with the goals that have been set for your whole business (not just for SEO, social, and content). Remember all of those departments I talked about above that are part of your whole team? This is where they can play a role and contribute to strategy and direction (and certainly creativity). It’s important that this role has worked with all of your teams to break those goals down into measurable KPIs that inform the creative campaigns that will accomplish these objectives. Of course, your efforts don’t mean much if you’re not measuring and analyzing what’s working and what’s not. The person (or people) who are in the strategy/creativity/analysis/direction role need to provide strategic guidance based on actual data so that you can have confidence that you’re moving in the right direction. Many of our clients also work with additional partnering agencies that drive offline or PR efforts (more on this below). If that’s the case for you, make sure that all teams and partners are on the same page, working toward the same goals and being extra careful to maintain the consistency and integrity of the brand. Design Who’s responsible Someone who can create any graphic assets that you need (and make you look really, really good). This can be an internal designer or your partnering agency. If you’re working with an external team, again, ensure that you’re maintaining the consistency and integrity of the brand. What’s required Your designer is going to be responsible for designing and styling things like blog posts and infographics, social media assets, email marketing templates, banners and headers, and probably even landing pages. The deal with the design role is just like every other role on this team. Don’t silo. Your designer is more of a production person who would probably rather be doing the work than dictating strategy, but they still have creative ideas and valuable feedback that would be worth hearing in the initial planning stages. Don’t be lame. Make them a part of the entire process. Content Who’s responsible Someone who can write a variety of content like their life depended on it, because as you know, content is not just blog posts. We’ll just call this genius the content strategist. What’s required Your content strategist needs to be able to adapt to the context that’s necessitating the content. And above all, the content they develop needs to be driven by the overarching goals and strategy set forth for the business. You want a content strategist who can be creative and, well, strategic. It’s important that this person is thoughtful not only about audience but also about how to balance creativity and conversion. Outreach is going to be a big part of your content strategist’s job, both pre- and post-launch (more on this below). The person who’s creating your content needs to think about who’s going to care about that content before they even write it (Paddy Moogan’s rule. If you haven’t, you should read his book). They also need to be connecting with the SEO in the early planning stages in order to determine how this piece of content will be optimized, as well as determining if it’s been done before (and, in that case, how it can be done different/better). If you don’t have the resources in-house to develop the content you need, you can outsource this role to an agency. And yes, they can assist you in creating strong, quality content that effectively represents your brand, but this takes a lot of work and collaboration; you need to be present and a part of the process. You will want that agency to understand your business, so let them ask a lot of questions. If you’re too busy to answer their questions in an email, grant them a phone interview or allow them to sit in front of the CEO (or whoever else they need information from who may not be readily available) so they can extract exactly what they need to produce stellar content on your behalf. Then, of course, provide your input and revisions once you’ve seen a draft. Like any member of your team, your content strategist can’t work in a silo. Content plays an enormous role in accomplishing the goals you have set for your business, so make your content strategist a part of the entire process from the very beginning (starting with goals and strategy development) so that they fully understand the bigger picture of why this content needs to exist. After the content they've created has been released into the world, be sure to provide them with access to the data so that they can determine how well it performed and what could be done differently the next time around. SEO Who’s responsible Someone who loves research, analysis, keywords, and probably Google so that they can properly and effectively manage and lead the optimization of all the stuff. Ideally, you also want this person to have more than a passing knowledge of strategy. What’s required The most important thing to note with the SEO role (I've said it before, and I'll say it again) is that no man is an island. You need an advanced SEO who will contribute as one of the most powerful players on your team. Like all the other roles on your community building team, the SEO needs to be involved right from the beginning. If you have the right SEO on your team, their ginormous analytical brain will be contributing to strategy. Not just SEO strategy, but the strategy you’re using to drive your whole business. They can be relied upon to provide some left-brain steadiness to your presumably right-brained creatives. And don’t forget content, outreach, creativity, and direction, too. The best thing about your SEO is that they can provide you with the information you need to make data driven decisions about your business, but they can’t do that if they’re sitting in the corner building links all day long. Whoever ends up playing this role for you, give them the credit they deserve and know they’re capable of a whole lot more than keywords. Email marketing (and other stuff, too) Who’s responsible Someone who can design, develop, and coordinate email marketing campaigns to deliver the value your team is creating in relationship to your strategy (in other words, someone who will know how to effectively use email marketing to build relationships and grow your business). What’s required Email marketing is a great way to build community with the people who want to be a part of it as well as those who already are. Your existing customers are your best brand advocates, so you’ll want to make sure that you’ve got email marketing covered somewhere among the members of your team. And — wait for it — don’t silo this role either. Because email marketing can be used to accomplish many goals, this role requires big-picture thinking right from the beginning, so don’t leave this person out. Certainly there will be other tools that you’ll need your team to use besides email marketing (I’m sure Phil Nottingham is wondering when the heck I’m going to talk about video). Whatever vehicles you’ll be using to execute your strategy, make sure you’ve designated someone on your team to fully embrace this responsibility so it can be used to build your community and reach the goals you’ve set for your business. Reading and learning Who’s responsible Several people who are continually reading and learning about your industry, looking for the good stuff to send along to your community and any innovative or creative ideas that might just grow your business. This role is up to everyone who’s on your team. But that’s not to say that everyone on your team needs to be on social media. You can involve everyone in the company in the knowledge seeking and soaking portion, and then select specific people (like your community manager and others who want to work with social media) to be the face of your brand and share that information on your social media outlets. What’s required A whole lot of reading, learning, and sharing. Internally at Mack Web we use a Google Spreadsheet that allows everyone on the team to contribute to the knowledge that is shared with our community. This not only builds the strength of our team, but also provides our community with a lot of variety. We each focus on a specific subject about which we’re passionate (content, operations, design, business, marketing, etc.) so that we’re not all reading the same stuff. Each day we put at least one post into the queue for our community manager to use. I don’t have to tell you that reading and learning is imperative to the success of your business and the development of your team. It’s also integral to the growth of your community. When you’re sharing other people’s useful content, you’re providing your followers with something of value and also opening the door to a relationship with the people generating the content. If you’re working with an agency, they can help you identify what you can read and share (as well as who you can follow) in order to build your community. Ideally, your agency partners should be reading all of these things, too, and bringing opportunities to your attention. If you’ve got everyone on your entire team contributing with knowledge, your company will be unstoppable. Reading and learning is probably the most important of all the roles, and can dramatically accelerate the growth of your business and your community. Outreach Who’s responsible Several people who are developing relationships and helping to keep those people and the rest of your community involved in what you’re doing, so that they can partake in it and benefit from it. Call it link building or relationship building, outreach is something that your entire team can do. What’s required Outreach is so much more than getting a link, and it needs to be done all the time, not just online or via email, (and not just when you want to ask someone for a favor). Everyone can do parts of outreach. Sales can work the in-person and the online relationships. Marketing can do its part to determine where the team is going to earn links with the amazing creative content they're developing. The best people on your team for outreach are the ones that love combining the digital world with the face-to-face, because that’s where the magic happens. Because the role of outreach really falls on everyone, find the people who are passionate about people, and teach them authentic ways to make it part of their natural routine at work and throughout each day. Website stuff Who’s responsible Someone who is committed to executing changes on the website. Like everyone on your team, make sure whoever is responsible for this role understands the goals of the company and is part of strategy execution so that they’re able to prioritize. There are always a lot of shiny things (new plugins, new applications, other fancy new doodads) that come in the form of tiny little emergencies. Involving your webmaster with goals and creative strategy will keep things running smoothly. What’s required Website work could be anything from revamping the navigation and implementing user experience changes to integrating a blog and executing on-page SEO. If you’re working with an agency to lead your community building and web marketing efforts, they will most likely provide your internal team or another partnering agency with all of the instructions for what needs to be implemented. Offline stuff Who’s responsible The people who are handling all of the offline stuff like print collateral, events, and maybe PR. What's required Offline stuff often affects the online stuff. Things like events, conferences, and product launches. It’s imperative that internal and external teams work together (and with the direction of the project manager) in order to ensure that everyone is effectively leveraging all efforts and working toward the same goals. Now go on, you — go build your team I’m sure there’s a role I’ve missed, perhaps one imperative to the specific goals of your business. This is just a start. It may be what what works for a little while until your business undergoes a change. At that point, you’ll need to reassess and reconfigure the roles of your team into what works for you. The biggest thing I can leave you with is this: Think differently about your team and the roles everyone plays. Expand your understanding of what each and every person and department can contribute to your digital marketing. There’s a lot more involved in building your community than managing your social media. By now you know that’s because it’s not just a community you’re building. It’s your business. If you want all of the benefits that a thriving community brings, focus on building the best company you can possibly build. Move beyond marketing initiatives and focus on your vision. Understand your customers better, and learn what they need to make their lives better. Let the passion and drive for what you do transform your company and your community, and put the right team in place to do it. Looking forward to your thoughts below. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Meet Your Community-Building Team"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Meet Your Community-Building Team"
    },
    {
      "level": "H3",
      "text": "Time to drop the silos"
    },
    {
      "level": "H3",
      "text": "So who’s gonna do the work?"
    },
    {
      "level": "H3",
      "text": "Project management"
    },
    {
      "level": "H4",
      "text": "Who’s responsible"
    },
    {
      "level": "H4",
      "text": "What’s required"
    },
    {
      "level": "H3",
      "text": "Community management"
    },
    {
      "level": "H4",
      "text": "Who’s responsible"
    },
    {
      "level": "H4",
      "text": "What’s required"
    },
    {
      "level": "H3",
      "text": "Strategy, creativity, analysis, and direction"
    },
    {
      "level": "H4",
      "text": "Who’s responsible"
    },
    {
      "level": "H4",
      "text": "What’s required"
    },
    {
      "level": "H3",
      "text": "Design"
    },
    {
      "level": "H4",
      "text": "Who’s responsible"
    },
    {
      "level": "H4",
      "text": "What’s required"
    },
    {
      "level": "H3",
      "text": "Content"
    },
    {
      "level": "H4",
      "text": "Who’s responsible"
    },
    {
      "level": "H4",
      "text": "What’s required"
    },
    {
      "level": "H3",
      "text": "SEO"
    },
    {
      "level": "H4",
      "text": "Who’s responsible"
    },
    {
      "level": "H4",
      "text": "What’s required"
    },
    {
      "level": "H3",
      "text": "Email marketing  (and other stuff, too)"
    },
    {
      "level": "H4",
      "text": "Who’s responsible"
    },
    {
      "level": "H4",
      "text": "What’s required"
    },
    {
      "level": "H3",
      "text": "Reading and learning"
    },
    {
      "level": "H4",
      "text": "Who’s responsible"
    },
    {
      "level": "H4",
      "text": "What’s required"
    },
    {
      "level": "H3",
      "text": "Outreach"
    },
    {
      "level": "H4",
      "text": "Who’s responsible"
    },
    {
      "level": "H4",
      "text": "What’s required"
    },
    {
      "level": "H3",
      "text": "Website stuff"
    },
    {
      "level": "H4",
      "text": "Who’s responsible"
    },
    {
      "level": "H4",
      "text": "What’s required"
    },
    {
      "level": "H3",
      "text": "Offline stuff"
    },
    {
      "level": "H4",
      "text": "Who’s responsible"
    },
    {
      "level": "H4",
      "text": "What's required"
    },
    {
      "level": "H3",
      "text": "Now go on, you — go build your team"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Leave the Best Possible Negative Review for a Local Business"
    },
    {
      "level": "H3",
      "text": "Claddagh: How Local Businesses Inspire Love, Loyalty, and Friendship"
    },
    {
      "level": "H3",
      "text": "Building Better Customer Experiences - Best of Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Mackenzie Fogelson\n          \n            Mackenzie Fogelson\n          \n            Mackenzie Fogelson"
}