{
  "url": "https://moz.com/blog/mega-serp-a-visual-guide-to-google",
  "slug": "mega-serp-a-visual-guide-to-google",
  "title": "Mega-SERP: A Visual Guide to Google - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Have you ever wondered what a Google result would look like if they put all of the SERP features on one page? Wonder no more. I present to you Mega-SERP, sponsored by my obsession with tacos.",
  "content": "Mega-SERP: A Visual Guide to Google Search Engines By: Dr. Peter J. Meyers October 10, 2013 Table of Contents Copied! By: Dr. Peter J. Meyers October 10, 2013 Mega-SERP: A Visual Guide to Google Search Engines The days of 10 blue links are over, and Google's search result pages seem to be evolving on a daily basis. We often see new SERP features in isolation, so I had an idea—what if I put all of them (or, at least, all of the big ones), on one mega-SERP? The following is a visual guide to the state of Google in 2013. A few disclaimers This is not a real Google SERP, although it is constructed from real results. Many of these features do not occur together in the wild. For example, you can have top+side or top+bottom AdWords blocks, but not all three. Statistics (after the image) were taken from 10,000 queries over the week of September 22, 2013 (daily average, as measured by the MozCast Project). These queries represent a variety of lengths and volumes, but do tend to skew commercial. This post is not an endorsement of any taco-related product or service, but I do love me some tacos. Without further ado, I give you Mega-SERP (click on the image for a full-sized version): Let's dive into these 24 distinct features, which I've grouped into five color-coded buckets: \"Local,\" \"Advertising,\" \"Knowledge Graph,\" \"Vertical,\" and \"General.\" Each feature includes, where available, the prevalence of that feature across MozCast's 10K query set. The first percentage is by unique queries, and the second (in parentheses) is by query volume. Up first are the local features. Local SERP features (A) Local Carousel – 1.0% (0.3%) There are two types of carousels—local and knowledge graph—but only one on any give SERP. I've chosen to show a local carousel, since they seem to impact more competitive queries and are reshaping the local SEO landscape. (G) Local Knowledge Panel – 6.3% (3.4%) Some organic results are blended with a local listing and map pin, and clicking on them pulls up a Knowledge Graph panel (previously called an \"authoritative one-box\"). These results don't always appear in the #1 position, but they seem to be more common on higher authority sites. (J) Local \"Pack\" Results – 7.3% (8.4%) Blended packs are the most familiar local results, and mix Google Maps data with organic listing that have local relevance..he 7-pack accounting for 81% of the local packs in our data set. Packs range from two to seven local results, and we've seen them in any position from #1 to #9, but they tend to be more common in the top half of the SERP. (M) Local \"Near\" Results – 5.1% (4.1%) The \"near\" box is a pure local pack, pulling data directly from Google Maps. These packs max out at three results. Near boxes are usually called out with a header in the form of \"[Query] near [Location]\". (Y) Google Map + Pins – 11.3% (10.1%) Results with \"pinned\" listings (such as local packs) almost always trigger a map, although the location, size, and even presence of the map has started to vary quite a bit. Except for traffic maps, all maps we've seen appear in the right-hand column. Advertising and paid results Advertising includes both the traditional AdWords blocks and the newer, paid inclusion results. Keep in mind that the presence of advertising is highly variable and depends on factors like competition, time of day, seasonality, etc. The numbers below should only be taken as rough estimates. (C) AdWords Ads (Top) – 72.2% (72.8%) The top-left AdWords block (above organic results) is easily the most common, and it ranges from one to three results. Ad formats are becoming much richer, as you can see from the Mega-SERP example, which includes both photos and site-links. (D) Shopping Results (Left) – 18.2%* (19.0%) Paid shopping results usually appear as a horizontal block of product images and links, but Google is testing variations. Shopping results can appear in either the left or right column, and are typically at the top. Our system currently only tracks total shopping results, and doesn't separate the data for left vs. right. (R) AdWords Ads (Bottom) – 16.5% (14.9%) The bottom AdWords block is very similar to the top block, and can contain up to three results. (T) Shopping Results (Right) Most shopping results on the right look the same as results on the left, but there are some noticeable exceptions, such as paid product placement for a single product. Those variations are still the minority of cases, but expect Google to experiment a lot in the near future. (W) AdWords Ads (Right) – 42.4% (41.6%) The right-hand column block of ads has the highest count, and can contain up to eight AdWords ads. These ads typically have very few enhancements or added features. AdWords ads always seem to start at the top and then either flow into the right column or bottom section (never both, at least in our data). Knowledge Graph features Many people call the informational box in the right-hand column the \"knowledge graph,\" but the knowledge graph is a complex combination of data sources and algorithms that is starting to manifest across the SERP. Following are a few common entities that seem to be connected to the knowledge graph. (B) List Carousel Google recently (September 27th) launched a new form of white-backgrounded carousel (Mega-SERP query was \"taco songs\"), which currently seems to appear for certain music-related searches. Clicking on any song takes you to a new SERP and a prominent YouTube box at the top of the page. (E) Answer Box – 1.4% (1.3%) There are many, many shapes and sizes of answer boxes (see my post exploring 101 answer boxes), but they almost always appear as a gray-outlined box at the top of the left-hand column. Some of this data comes directly from third-party sources, but much of it seems to be tied to the knowledge graph. (U) Knowledge Graph (Info) – 26.2%* (32.6%) This is what most people think of when they hear \"knowledge graph\"—a block of information about a subject, in this case nutritional information. Informational knowledge graph boxes have many variants. Our data tracks all knowledge graph entities (except answer boxes) under one number, so the 26.5% represents the entire world of knowledge graph boxes. (V) Knowledge Graph (Brand) While technically still a knowledge graph box, brand boxes seem to be connected to Google+, allowing you to follow a brands G+ page and recent activity. (X) Disambiguation Box The disambiguation box occurs when Google thinks that a searcher's intent is ambiguous and wants to provide options. In the Mega-SERP example, a search for \"taco shell\" brought up options for tortilla or Taco Bell. Clicking on one of these links triggers a new search. Vertical search results So-called \"vertical\" results used to be very cleanly separated in Google and not counted as organic listings, but that line is beginning to blur. For example, many video results now seem to be integrated directly as organic (as in the Mega-SERP example). I'm treating the new \"In-depth articles\" as a vertical result, because of its close relationship to news results. (F) Image Mega-block The mega-block of images is rare, and seems to only occur at the top in 7-result SERPs. The Mega-SERP example comes from the search \"pictures of tacos\", and these images almost always appear for searches starting with \"pictures of…\", \"photos of…\", etc. (I) Video Results – 18.5% (22.0%) Currently, video results are integrated into organic results, with the exception that they show a thumbnail of the video and sometimes a publication date. Video results can appear at any position in the SERP. (N) Image Results – 24.6% (27.5%) Image results are still a \"true\" vertical and are tied directly to Google Image search. Standard image results appear as a horizontal block of images in the left-hand column, and their position varies. These results link directly to Google Images. (O) News Results – 19.6% (29.8%) News results are another true vertical, and also occur as a distinct block in the left-hand column. The news block can have up to three links, and the first link is often enhanced with a thumbnail image. (Q) In-depth Articles – 5.2% (9.9%) Launched in August of 2013, \"In-depth articles\" are one of the biggest new features of the year. The in-depth block is a fairly large set of three articles (which can all have thumbnails, currently). Google seems to reserve this block for content that is evergreen and literally \"in-depth,\" and most of these links come from major publications like The New York Times. Unlike news results, these links may be months or even years old and are not updated regularly. Miscellaneous features Finally, we have the SERP features that just don't belong to any one group. Sorry, miscellaneous features—we still love you. (H) Site-links (6-pack) – 19.4% (19.9%) The #1 organic listing may be rewarded with expanded site-links—anywhere from one to six, depending on the site. There is a perfect correlation, at least in our data, between site-links and 7-result SERPs (i.e. if a result has site-links, it's a 7-result SERP). Google is experimenting with 10-packs of site-links, but only for domain queries (currently), like \"tacobell.com\". (K) Authorship Mark-up – 21.9% (20.9%) If Google can connect a resource to a Google+ entity, that result may get authorship mark-up, which adds a thumbnail of the author, his/her name, and some basic G+ stats. Also, there's apparently such a thing as \"taco journalism.\" (L) Review Mark-up – 24.0% (24.6%) Products, recipes, and other appropriate entities may show review data, including stars. In the Mega-SERP example, the recipe listing is also showing a thumbnail image. (P) Social Results Social results have evolved a lot in the past year or so, and the current incarnation looks a lot like authorship mark-up, but there's one big difference—these results are 100% personalized. My friend Dan is only showing up here because we're in each other's G+ circles. (S) Related Searches This aspect of the SERP has almost become so ubiquitous that I hesitate to even call it a feature. The vast majority of searches (sorry, we don't have exact numbers on this one) have links at the bottom to related topics. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Mega-SERP: A Visual Guide to Google"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Mega-SERP: A Visual Guide to Google"
    },
    {
      "level": "H2",
      "text": "A few disclaimers"
    },
    {
      "level": "H2",
      "text": "Local SERP features"
    },
    {
      "level": "H4",
      "text": "(A) Local Carousel – 1.0% (0.3%)"
    },
    {
      "level": "H4",
      "text": "(G) Local Knowledge Panel – 6.3% (3.4%)"
    },
    {
      "level": "H4",
      "text": "(J) Local \"Pack\" Results – 7.3% (8.4%)"
    },
    {
      "level": "H4",
      "text": "(M) Local \"Near\" Results – 5.1% (4.1%)"
    },
    {
      "level": "H4",
      "text": "(Y) Google Map + Pins – 11.3% (10.1%)"
    },
    {
      "level": "H2",
      "text": "Advertising and paid results"
    },
    {
      "level": "H4",
      "text": "(C) AdWords Ads (Top) – 72.2% (72.8%)"
    },
    {
      "level": "H4",
      "text": "(D) Shopping Results (Left) – 18.2%*  (19.0%)"
    },
    {
      "level": "H4",
      "text": "(R) AdWords Ads (Bottom) – 16.5% (14.9%)"
    },
    {
      "level": "H4",
      "text": "(T) Shopping Results (Right)"
    },
    {
      "level": "H4",
      "text": "(W) AdWords Ads (Right) – 42.4% (41.6%)"
    },
    {
      "level": "H2",
      "text": "Knowledge Graph features"
    },
    {
      "level": "H4",
      "text": "(B) List Carousel"
    },
    {
      "level": "H4",
      "text": "(E) Answer Box – 1.4% (1.3%)"
    },
    {
      "level": "H4",
      "text": "(U) Knowledge Graph (Info) – 26.2%* (32.6%)"
    },
    {
      "level": "H4",
      "text": "(V) Knowledge Graph (Brand)"
    },
    {
      "level": "H4",
      "text": "(X) Disambiguation Box"
    },
    {
      "level": "H2",
      "text": "Vertical search results"
    },
    {
      "level": "H4",
      "text": "(F) Image Mega-block"
    },
    {
      "level": "H4",
      "text": "(I) Video Results – 18.5% (22.0%)"
    },
    {
      "level": "H4",
      "text": "(N) Image Results – 24.6% (27.5%)"
    },
    {
      "level": "H4",
      "text": "(O) News Results – 19.6% (29.8%)"
    },
    {
      "level": "H4",
      "text": "(Q) In-depth Articles – 5.2% (9.9%)"
    },
    {
      "level": "H2",
      "text": "Miscellaneous features"
    },
    {
      "level": "H4",
      "text": "(H) Site-links (6-pack) – 19.4% (19.9%)"
    },
    {
      "level": "H4",
      "text": "(K) Authorship Mark-up – 21.9% (20.9%)"
    },
    {
      "level": "H4",
      "text": "(L) Review Mark-up – 24.0% (24.6%)"
    },
    {
      "level": "H4",
      "text": "(P) Social Results"
    },
    {
      "level": "H4",
      "text": "(S) Related Searches"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}