{
  "url": "https://moz.com/blog/membership-only-sites",
  "slug": "membership-only-sites",
  "title": "Membership Only Sites - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Hmm, I'm not sure what category this goes in but here goes... this is my first blog post, so be gentle.\n\nThis entry was very much prompted by a recent Q&A dealing with member only sites.  You know the ones - limited content to titillate potential subscribers and the rest is locked up behind…",
  "content": "Membership Only Sites Mobile SEO M By: Mike Gove February 13, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! M By: Mike Gove February 13, 2009 Membership Only Sites Mobile SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Hmm, I'm not sure what category this goes in but here goes... this is my first blog post, so be gentle. This entry was very much prompted by a recent Q&A dealing with member only sites. You know the ones - limited content to titillate potential subscribers and the rest is locked up behind pay-walls. And before I go further, let me give you some context to my views. I run a B2B set of sites that, for 10 years, have been charging individuals and companies for access to content (we think we're the second such site ever to charge). We started this during the last .COM meltdown and have not looked back. It is with a wry smile that we continue to read about the demise of pay for material. Even during this downturn, our subscriber stats are rather healthy. And our properties are popular, stable PR6/7 sites with 10,000 pages and excellent industry penetration. Now, the issue with sites like ours has always been that of getting search engines to index premium content while preventing users from seeing the wonderful material until they cough up some dough. And this issue is only growing as advertising revenues become harder to develop and sites with genuinely valuable content reach for the lock-down option (again). Google (>80% of our SE traffic so others of little interest .. sorry) has had programmes that promote free-view on first click, etc., but we felt this was just leading to free access via the back door to anyone with a modicum of common sense. So .. what do you do? Now, if we take the recent Q&A as fact, the solution is to maximise the indexability of the free material and give up on the valuable locked content. Sadly, this is an entirlyl idealistic view of the SE world. We tried this and... nope, does not work very well. By definition, the free material is only a taster - it will often hold few of the valuable keywords or company names Google so loves, especially if your material is written by non-SEO staff (we employ journalists for all our content). At many an SEO bash, I would collar the poor Google rep and ear-bash them about the plight of sites like ours. Each time they would nod sagely and admit it was a problem but fail to give a solution - only platitudes about recognising the issue. The alternative is to recognise the inherent value of this hidden content to both SEs and users and thus find a way to expose it without giving the material away. And the only method is to pretend that Google is indeed a registered user on the site via IP recognition. Technically, is this cloaking? Probably. But as we also give away free trials to anyone who provides base details, I argue we are only treating Google as a valued customer. When confronted with this solution, Google engineering staff have admitted privately that many sites do this and, given we do not scam users into different content once registered, they turn a blind eye. Google knows this dark-material is probably more valuable than much available for free, and they know it is in their interest to allow it to continue. Readers here (but probably not Mozzers) will be surprised how many pay-to-view sites employ just this method with great success. It gives Google valuable material to chew on and allows searchers to see that there is indeed material they might like to read but it is valuable enough to require payment. To those who say Google really does not know what we do, I would just say that all our news is indexed on a 30 minute basis by Google News - their manual review of the sites meant we just had the tag \"Sub\" added to each item. So, for all those that own subscriber sites, I would strongly advise you to evaluate treating Google as a valued member and ensure there is technically a method for readers to see the same material for no cost on a trial basis. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Membership Only Sites"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Membership Only Sites"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too"
    },
    {
      "level": "H3",
      "text": "Internal Linking for Mobile-First & Mobile-Only Indexing"
    },
    {
      "level": "H3",
      "text": "All About Fraggles (Fragment + Handle)"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Mike Gove\n          \n            Mike Gove"
}