{
  "url": "https://moz.com/blog/mentors-they-dont-grow-on-trees-anymore",
  "slug": "mentors-they-dont-grow-on-trees-anymore",
  "title": "Mentors - they don't grow on trees anymore... - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The most common question I receive after I've written any of my posts is:\n\nHow can I get started and learn what you know?\n\nAnd that's a difficult question to answer. Not because I don't think it's possible, but because there is so much that you can do in the SEO field.\nLet's take black hat out of…",
  "content": "Mentors - they don't grow on trees anymore... Moz News G By: GeoffreyF67 September 2, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! G By: GeoffreyF67 September 2, 2006 Mentors - they don't grow on trees anymore... Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The most common question I receive after I've written any of my posts is: How can I get started and learn what you know? And that's a difficult question to answer. Not because I don't think it's possible, but because there is so much that you can do in the SEO field. Let's take black hat out of the discussion for a moment, because what I think people are really asking is: How can I make money on the Internet?.. Because my sites don't seem to be making me anything. Again, that's not an easy answer. I can certainly fire off a response to that that says something like:Find a topic you like, a nice, start writing quality content about it and people will find you and link to you and eventually you can monetize that site and make some money.That's all well and good, but what people usually need is some type of mentor. They need to be able to ask questions at any time and get answers. Typically, however, mentors are quite difficult to find for one of several reasons: Inability to follow instructions. There are quite a few folks who will ask questions, learn the answers,and then do absolutely nothing. Why? I dunno - that will be debated for ages I suppose :) Time, or rather, the lack of it. Usually, a mentor that is worth having is going to be quite busy. They simply don't have the time to coach a lot of people. Just like you, they want to make money. A mentor will sometimes do it out of the goodness of their heart, but more often than not they'd like to be compensated in some way for their time. Don't know who to ask. It's very difficult to find someone who not only would be willing to mentor you, but also be competent enough to actually teach you something. It's quite easy to say on a forum, \"I made $30,000 last month in Adsense\", but of those people who have said that, how many can you trust to be telling the truth? So, usually my conversation with the people who e-mail me has involved answering the questions that they have, and since they don't know what to ask next and I'm not giving them a footprint to follow, they give up pretty quickly. To those folks I apologize. It's never been my intent to bar anyone from finding out information. I believe it was Randfish who pointed out a while back that we all wear hats of many colors. On some of the forums I frequent, this isn't the case. Take, for example, the syndk8 where you'll find lots of black hat information but usually nothing that's white hat. On the other hand, there is a different forum that I've been watching for the past year that has taken a different approach. Initially, they started as a site that would teach you everything you needed to know about scraping and using various programs to do it. They also gave away keyword lists every month. Well, times change and so has this forum. In fact, I find it ironic that the \"new\" stuff they are teaching are a lot of white hat techniques and building less spammy content. When you can couple the white hat techniques with the black hat techniques is when you can come up with some truly powerful combinations. I think it's fair to say that most of us are looking for ways to improve our websites and their ranking. That's why we spend so much time doing what we do. I sincerely hope that all of you who are looking for a mentor take a look at that forum so that you can get the tools, techniques, tips, etc. to succeed. Oh, and for what it's worth, it's not the ONLY place that you can get the information, but it's one place that definitely has a growing amount of information and is also the only one that I publicly endorse. One other thing before I close...There are a few people I'd like to mention that have helped me grow in the past few years in one way or another. Here's your chance for the spotlight (in no particular order): Randfish - your long thought out posts and analyses make my brain hurt, but I usually get more out of them than I think you put in them! Earl Grey - You're a tosser, but I enjoy your debates on various subjects. I never quite know when you're selling me a long yarn or telling me the truth. I am a better person for it either way because it makes me stretch further. Dazzlindonna - Thanks for all your kind comments on SEOChat when I hung around there. I'm still amazed you put up with me. Kerry Cianos - My best friend for like 16 and counting years. It's time to rewrite our scraper and start doing some Markov chains! I'll even let you use .NET 3.0 :) l3vi - Our nightly discussions, brainstorming, marketing, etc. have continually pushed me to work harder. You might be making more than me, but I'm still planning on catching up! If I forgot to mention you, rest assured your help was still appreciated - it's just that those few brain cells were wiped from my memory during the chemotherapy!G-Man P.S. Who has been a mentor to you and helped you in a significant way? Edit: Removed affiliate link :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Mentors - they don't grow on trees anymore..."
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Mentors - they don't grow on trees anymore..."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "GeoffreyF67\n          \n            GeoffreyF67"
}