{
  "url": "https://moz.com/blog/mentally-check-out-with-the-ses-san-jose-comic-strip",
  "slug": "mentally-check-out-with-the-ses-san-jose-comic-strip",
  "title": "Mentally Check Out with the SES San Jose Comic Strip - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Now that I've got about a week's worth of antibiotics pumping through my system (only one more week to go!), I was able to focus my valuable SEO skills on creating a litany of stupid speech bubbles and images of Dave Naylor saying \"fookin.\" I think I may be underpaid.\n\nAnyway, thanks for being…",
  "content": "Mentally Check Out with the SES San Jose Comic Strip SEO Events By: Rebecca Kelley September 7, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley September 7, 2007 Mentally Check Out with the SES San Jose Comic Strip SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Now that I've got about a week's worth of antibiotics pumping through my system (only one more week to go!), I was able to focus my valuable SEO skills on creating a litany of stupid speech bubbles and images of Dave Naylor saying \"fookin.\" I think I may be underpaid. Anyway, thanks for being patient while my body became a culture of snot and goo. Here's the SES San Jose 2007 Comic Strip for your viewing enjoyment. Some photo credits go to Rhea Drysdale, Michael McDonald, Becky Ryan (happy birthday, Becky!), Tamar Weinberg, Lee Odden, and David Brown, who put up this amusing flip book of sorts after someone got a little shutterbug-happy. Enjoy! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Mentally Check Out with the SES San Jose Comic Strip"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Mentally Check Out with the SES San Jose Comic Strip"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}