{
  "url": "https://moz.com/blog/metrics-that-the-ceo-needs-to-know",
  "slug": "metrics-that-the-ceo-needs-to-know",
  "title": "Metrics That the CEO Needs to Know - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It's hard to get anyones attention when you are talking about analytics and data. Often I'll go in to a meeting with a really exciting analytics report. When I start speaking about the data CEO will say something like......”Anyyyyyway, moving right along.”And then i’ll say...... “But don’t you want…",
  "content": "Metrics That the CEO Needs to Know SEO Analytics S By: Stuart McIlreavy June 27, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! S By: Stuart McIlreavy June 27, 2008 Metrics That the CEO Needs to Know SEO Analytics This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. It's hard to get anyone's attention when you are talking about analytics and data. Often I'll go in to a meeting with a really exciting analytics report. When I start speaking about the data the CEO will say something like, ”Anyyyyyway, moving right along.” And then I’ll say, “But don’t you want to hear me talking about the data?” Then the CEO says something like “Errrrrr.....maybe next time.” It’s not that CEOs don’t like data. The problem is that the average CEO has to manage data overload. They’ve got data coming at them from every department and every staff member. CEOs have learnt the great skill of selective data absorption, and if you present them with information they don’t think is immediately useful, they will more than likely reject it. So over time i’ve learnt some of the data that the CEO needs to know, wants to know, likes to know. 1. Advertising performance. The CEO loves this data. Because they more than likely have a plethora of people trying to get them to spend on any number of advertising initiatives, the power of the data (especially comparative data between different campaigns) you as an SEO can provide will be impressive. Tell the CEO which campaigns were more effective by way of conversion rates, visitor numbers, page views, and time on site. They love this stuff because it helps them in making decisions about where to spend their adverting dollars next. 2. Organic growth. If the CEO is spending on SEO, they are going to want to know if there was any growth in organic traffic. If there isn’t, they are going to want to know why. Practice your excuses beforehand. Seasonality only works the first year around. 3. Where are the conversions coming from? CEOs need to know this because it tells them so much about the bottom line. If all their inquiries and sales are coming from a particular key phrase or a particular segment of their business, let them know. The data will help them make decisions about which aspects of the business (and website) are buoyant and which aspects may need a little more work. Even though it's nice to try and impress and sometimes bamboozle the boardroom with your knowledge of the data, try to tone it down. First teach them about the metrics that matter and then give them updates from time to time so the CEO has the right info to make the best decisions for the business. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Metrics That the CEO Needs to Know"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Metrics That the CEO Needs to Know"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Stuart McIlreavy\n          \n            Stuart McIlreavy"
}