{
  "url": "https://moz.com/blog/mike-grehan-on-those-in-the-sandbox",
  "slug": "mike-grehan-on-those-in-the-sandbox",
  "title": "Mike Grehan on Those in the Sandbox - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "NOTE: This post has been edited. It was originally written in haste and without foresight. My apologies to Mike, who has earned better than to be criticized publicly in such manner.\nMike Grehan, who stands without doubt among the people I admire most in the industry, has a ...",
  "content": "Mike Grehan on Those in the Sandbox SEO Events By: Rand Fishkin January 9, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 9, 2006 Mike Grehan on Those in the Sandbox SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. NOTE: This post has been edited. It was originally written in haste and without foresight. My apologies to Mike, who has earned better than to be criticized publicly in such manner. Mike Grehan, who stands without doubt among the people I admire most in the industry, has a new column up today at Clickz on his recent sandbox post at SEW. This comes on the heel of his blog post on the same subject, which also irked me. Mike, I know you work with a lot of big firms who launch new websites that NEVER get boxed, but the rest of us have other goals, other aspirations and other clients and your appraisal of our situation is, frankly, insulting - shockingly so since I know you personally and know that in person, you're the kind of guy who buys everyone a round of high-priced cocktails, not the kind of guy who rags on other people's business models. My feeling is that I should give Mike the benefit of the doubt - it may just have been a tough few weeks and Mike's certainly earned it. Let me take a quick trip through Mike's points and see what he's trying to get at: I don't usually bother much with search engine forums. I don't have the time. And so frequently it's the same old issues being regurgitated over and over again, as \"newbies\" enter our emerging community.One thing I find, which is remarkably noticeable in these forums, is the lack of content relating to actual marketing. It's as if all the contributors believe the only way to rank at a search engine depends on some technical issues which need to be addressed. It's like, we'll do the SEO and then we'll have a look at your marketing! This suggests to me that Mike doesn't spend a lot of time on the major SEO forums. There are excellent, active discussions every day on important aspects of site creation, marketing and non-technical issues (see here, here, here, here, here - that's just what I found today in 5 minutes). Mike may have all of this knowledge already, but I don't see why he has to criticize the communities where it's shared. Maybe he's just being dramatic, though, and doesn't actually mean to make such overarching statements (making forum members mad is, after all, a good linkbait tactic). I thought I'd address some of the points, for the final time (I wish!!!) over at my own pad. I really don't want to get into any further debate in a forum thread where you only seem to have a valid contribution if you're wearing marketing blinkers.The gist of most of this whole badly conceived analogy of a sandbox is that new sites get ignored for a period of time by Google.Wrong! Wrong! Wrong!Sorry guys.But if you work with no hopers from the start you'll get nowhere fast. You can call it the sandbox if you want. But I'll tell it like it is.Awareness campaigns for new brands/sites, using niche marketing into verticals, especially for b2b sites works a treat. If you are a genuine marketer, there are dozens of methods of promoting a web site other than just sitting on your ass in the so called sandbox, waiting around for Google to do YOUR job. I have to take issue with the idea that forum posters, particularly at SEW, don't get respect if they address marketing rather than technical SEO issues. My feeling is that Mike himself gets an extraordinary amount of respect. I'm one of the folks who's read through his posts in particular because I like what he has to say so much. In addition, the implication that everyone who has a sandboxed site or who posts at SEW or other forums asking how to help escape is not only incompetent, but lazy is far-fetched. After hanging out with Mike on multiple occassions, I can tell you that he's not normally that type of guy. It could be that something struck him particularly harshly. Let's move on to the ClickZ column... The mere thought of some pimply SEO geek sitting with a proper marketing organization trying to explain to the marketing VP what a sandbox is, is almost laughable, if it weren't so serious. There are dozens of reasons companies fail offline. And, believe me, the same applies online. OK. So my acne hasn't cleared up quite yet - and it's possible that a line like this came across as particularly personal (although I doubt that was Mike's intention). But why is explaining the sandbox any more or less difficult or humorous than explaining Google-bombing or blog-spamming or why certain text placement can get your site banned? I've explained the sandbox feature to several folks recently who run VC firms and they caught on very quickly - unless the site you're launching and promoting has serious \"buzz\" surrounding it, you should expect to rank poorly at Google for a solid time period (6-12 months after launch). The \"Rome wasn't built in a day\" analogy works very well. The funny thing is, Mike is trying, in a very roundabout way, to make this same point, albeit with a much harsher tone. He believes that folks should expect the sandbox unless they are delivering a site/product/service that folks are clamoring for before Google spiders the site (or at the same time) - a reasonable concept, but not a great reason to downplay its existence or pretend that everyone can afford to release sites that will have the necessary \"buzz\". When trying to penetrate a new market place, or increase market share in an existing market place, classically trained marketers use a variation of strategies. They can \"push\" the product into the market place. They can \"pull\" the product into the market place. Or they can do the ultimate combo of \"push and pull\". It's more commonly known as marketing muscle. And if you take on a client new to a market sector and don't perform a marketing audit to discover just how much muscle the competitors have, and by that I mean cross channel, then you do your client a disservice. If your client has developed a new cola and is now going up against Coke and Pepsi, will pure SEO help him up the charts at Google? Or will he need marketing parity in order to compete? The latter, obviously. I like Mike's use of the Push vs. Pull marketing analogy, but I don't see why SEOs shouldn't use the search results to help \"push\" their campaigns and those of their clients, even if it does take 9 months to escape the box. Trust me on this, though, Mike. No one who's stuck in the sandbox (that I'm working with) is \"sitting on their ass.\" UPDATE: For those who might think I'm giving an unfairly negative view of Mike and his work, just read through the rest of the entries on his blog. He's a delightful person - a great guy to spend time with and someone who really appreciates what life has to offer him. My only quibble is with his view on the sandbox, small time SEOs and the various forums. In other respects, we're like peas in a pod. :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Mike Grehan on Those in the Sandbox"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Mike Grehan on Those in the Sandbox"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}