{
  "url": "https://moz.com/blog/mike-blumenthal-on-the-local-search-market-strategies-for-local-seo",
  "slug": "mike-blumenthal-on-the-local-search-market-strategies-for-local-seo",
  "title": "Mike Blumenthal on the Local Search Market & Strategies for Local SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In August of 2007, I heard from several sources that Mike Blumenthal of the Understanding Google Maps & Yahoo! Local blog was a rising star in the field of local search. I shot him an email and I've been hoping to get an interview with him ever since. Thankfully, he's finally acquiesced -…",
  "content": "Mike Blumenthal on the Local Search Market & Strategies for Local SEO Mobile SEO By: Rand Fishkin February 17, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 17, 2008 Mike Blumenthal on the Local Search Market & Strategies for Local SEO Mobile SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In August of 2007, I heard from several sources that Mike Blumenthal of the Understanding Google Maps & Yahoo! Local blog was a rising star in the field of local search. I shot him an email and I've been hoping to get an interview with him ever since. Thankfully, he's finally acquiesced - enjoy! Can you give readers who may be unfamiliar with your background a brief look at who you are, what you do, and what brought you into the local search space? In my previous work as a small business owner covering a small fragmented market of 250,000 inhabitants, it took 7 Yellow Page directories to achieve market coverage. Our family business had 8 major product divisions and 40 broad areas that we sold into. Most needed their own marketing and promotion. It was very difficult and expensive to run ads in all of the books, in all of our product areas. It became apparent after we entered the web design business in 1995 that the internet would ultimately play a role in local marketing. In 2001, we sold off all of our retail businesses and focused solely on web development for regional businesses. We learned some SEM and became fluent in the very long local tail of local search, i.e., Service + Location organic searches. In 2004 I experienced Google Local, threw away my 7 YP directories that I used for sales, installed a computer to analog phone dialer, and have not looked back. It had a very practical and day to day appeal for me. I started exploring the ins and outs of the logic and ranking and taking notes shortly thereafter. In fall of 2006 when I realized that nobody in the search marketing industry was taking the hands on approach to local search marketing that I was looking for, I started writing about what I thought I knew. The logic, illogic, politics, and social context of local became compelling. With each level of understanding that I achieved there seemed to be another layer beneath that was more complicated and interesting. And it always seemed that I had one more burning question that I just had to answer. Currently in the local space, I have been consulting and offering market research advice and tools to national & international companies interested in learning more about Maps & Local. I provide guidance as a courtesy to my local web design clients and on occasion have taken on a small business client in another city if they have a particularly vexing problem or unusual situation. There have been estimates that nearly 40% of all search queries have some sort of local intent - to what degree do you think that's an accurate estimate? And, do you believe that for all of those local intent queries, some geographic elements are being used by the search engines at this time? In the future? This research is from my local guru, Greg Sterling. I have not looked at the methodology or the numbers and can't speak directly to their accuracy, but the source is impeccable and the logic is valid. It provides a useful lens for understanding local. In the end it doesn't really matter if it is 10%, 40%, 60%, or more. If you are in one of the industries that needs local and can benefit from it, then you need it and you probably need professional help to navigate the maze that is local. If you need it and you don't have a strong presence, it can be a disaster as seen in the case widely reported last December of the florist that was affected by a competitor gaining the Authoritative OneBox. Local search is an aggregation of a million niches which will come to local as the ROI becomes more obvious to each of them. As the granularity of local data increases and functional mobile technology proliferates, more and more business sectors will be impacted and will benefit from participating in local. You mentioned in recent blog posts some challenging problems for local search - can you detail what you believe to be the biggest challenges facing the engines when it comes to returning accurate local results? Hmm...the technical glitches are legion, there being issues with categorization, mapspam, coupons (dang, this is a link fest!), but ultimately the biggest challenge facing the engines is one of integrity, transparency, and trust. The main stake holders, the searchers, and the bricks and mortar businesses deserve a system that is clean of spam, transparent, easy to use, and offers meaningful feedback. The old system of the Yellow Pages was fast (from the owners views), convenient, and expensive. Replacing that with a system that is seemingly slow, inconvenient, free but requiring a rocket scientist, is not a trade off that most SMB's want. The issues that Google is confronting are technically complicated but are resolvable. If they lose the stake holder's trust, that may be gone forever. I think that Google has the best chance to solve the many issues in local but only if they accept their new responsibilities. Do you believe that search engines will continue to dominate local search, or will other verticals like Yelp, Citysearch, etc. be able to pull significant share from general web search engines? From where I stand the battle is taking place on two fronts: The desktop and in the mobile environment. On the desktop, Google's market share creates a situation where they can control the visibility and success of Maps. They have demonstrated a clear ability to take Maps market share at will. Each tick on the chart below that I have noted was due to some specific Google action. (used with permission of Hitwise) While there is always room for creative and well run local niche engines, that space is getting smaller. When you are in the room with an elephant there may only be room in the corners. In the mobile environment the search engines' dominance is far from clear. They are up against very well capitalized and aggressive competition and the rules are not as easily defined by a single company. There is a saying out west that only fools and easterners predict the weather....the same could probably be said of the future in the local search world. But being from the East never slowed me down. I am also booking a ringside seat (sports metaphors are everywhere, eh?), as it will be an incredible match to watch. What are some of the most exciting technological leaps you've seen in the local space? Anything that's got you wishing for more? I follow the space pretty closely and its rate of change has always amazed me. The one area that I think is underreported and maybe underappreciated for its potential impact is the personal mapping space (Google My Maps, CommunityWalk) and the coming boon of user generated map content in the geotagged photo arena. Folks seem to really like projecting themselves into cyberspace and the trend of geotagging photos will feed into that and people's love of the snapshot. Google is moving aggressively in this area and all mapping based search, and it appears to me that this technology will provide a primary interface and data source for the mobile web. Compare Google Maps & Yahoo! Local Search for us - which do you personally like better, who do you think is doing a better job and what are the big differentiators right now? I personally find Google more interesting to follow as their technology is more complicated and obtuse, offering a more stimulating intellectual challenge. But in the end, which one I like more or which is doing a better job will not matter too much. Technology comes in second place to market share. The big differentiator is that Google's market share is growing and Yahoo's is declining. Can you give SEOs your top 5-10 tips on optimizing for Google Maps and Google's local search results? You mean besides getting an address in the center of town and changing your business name? :) I think the article 10 Likely Ranking Factors of Google's Local Search Algorithm that I wrote last year is still basically a sound view of the issues. Can you give us those tips for Yahoo! Local Search as well? You mean besides getting an address in the center of town and changing your business name? How does advertising for local differ from normal web search advertising? Any specific recommendations for those buying ads in the local space? I am not a PPC click expert so I will let others who are more qualified answer that question. Can you share some of your favorite sites/forums/blogs/etc on local search and search in general? I read Screenwerk, LocalMobileSearch, and the Google Earth Blog every day. I also enjoy Chris Silver Smith & Bill Slawski, as they provide critical technical insights to local. Some of my best information comes from readers and folks who email or call me. I can't thank them enough for working together to explore the many issues involved in local. Many thanks, Mike - the links that you've shared alone are immensely valuable and we appreciate your effort. As always, if you have specific questions or comments for Mike or on the topic, you can leave them in the post and hopefully, he'll be able to stop by to provide answers. p.s. For those interested in more, don't miss Mike's blog and another interview with him from just last week (he's a hot commodity lately). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Mike Blumenthal on the Local Search Market & Strategies for Local SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Mike Blumenthal on the Local Search Market & Strategies for Local SEO"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too"
    },
    {
      "level": "H3",
      "text": "Internal Linking for Mobile-First & Mobile-Only Indexing"
    },
    {
      "level": "H3",
      "text": "All About Fraggles (Fragment + Handle)"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}