{
  "url": "https://moz.com/blog/mining-reddit-for-content-ideas",
  "slug": "mining-reddit-for-content-ideas",
  "title": "Mining Reddit for Content Ideas in 5 Steps - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For marketers, Reddit is more than a tool to while away your lunch break. It's a huge, thriving forum with subreddits devoted to almost any topic you can imagine — and exciting new content ideas lurk within threads, just waiting to be discovered.",
  "content": "Mining Reddit for Content Ideas in 5 Steps Content Marketing | Whiteboard Friday By: Daniel Russell January 17, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Daniel Russell January 17, 2020 Mining Reddit for Content Ideas in 5 Steps Content Marketing | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. For marketers, Reddit is more than a tool to while away your lunch break. It's a huge, thriving forum with subreddits devoted to almost any topic you can imagine — and exciting new content ideas lurk within threads, just waiting to be discovered. In this edition of Whiteboard Friday, Daniel Russell takes you through five simple steps to mine Reddit for content ideas bolstered by your target audience's interest. Video Transcription Howdy, Moz fans. Welcome to another edition of Whiteboard Friday. My name is Daniel Russell. I'm from an agency called Go Fish Digital. Today we're going to be talking about mining Reddit for content ideas. Reddit, you've probably heard of it, but in case you haven't, it's one of the largest websites on the internet. It gets billions of views and clicks per year. People go there because it is a great source of content. It's really entertaining. But it also means that it's a great source of content for us as marketers. So today what we're going to be talking about is two main groups here. We're going to first be talking about the features of Reddit, the different things that you can use on Reddit to find good content ideas. Then we're going to be talking about five steps that you can take and apply today to start finding ideas for your company, for your clients and start getting that successful content. Features of Reddit So first, Reddit as a breakdown here. Subreddits First, a big feature of Reddit is called subreddits. They're essentially smaller forums within Reddit, a smaller forum within a forum dedicated to a particular topic. So there might be a forum dedicated to movies and discussing movies. There's a forum dedicated to food and talking about different types of food, posting pictures of food, posting recipes. There is a forum for just about everything under the sun. If you can think of it, it's probably got a forum on Reddit. This is really valuable to us as marketers because it means that people are taking their interests and then putting it out there for us to see. So if we are trying to do work for a sports company or if we're trying to do work for our company that's dentistry or something like that, there is a subreddit dedicated to that topic, and we can go and find people that are interested in that, that are probably within our target markets. Upvoting and downvoting There's upvoting and downvoting. Essentially what this is, is people post a piece of content to Reddit, and then other users decide if they like it or not. They upvote it or they downvote it. The stuff that is upvoted is usually the good stuff. People that are paying really close attention to Reddit are always upvoting and downvoting things. Then the things that get the most upvotes start rising to the top so that other people can see it. It's super valuable to us again because this helps verify ideas for us. This helps us see what's working and what's not. Before we even put pen to paper, before we even start designing everything, we can see what has been the most upvoted. The most upvoted stuff leads to the next big feature, which is rankings. The stuff that gets voted the most ends up ranking on the top of Reddit and becomes more visible. It becomes easier for us to find as marketers, and luckily we can take a look at those rankings and see if any of that matches the content we're trying to create. Comments There's the comments section. Essentially what this is, is for every post there's a section dedicated to that post for comments, where people can comment on the post. They can comment on comments. It's almost like a focus group. It's like a focus group without actually being there in person. You can see what people like, what people don't like about the content, how they felt about it. Maybe they even have some content ideas of their own that they're sharing in there. It's an incredibly valuable place to be. We can take these different features and start digging in to find content ideas using these down here. Reddit search & filters Search bar The search bar is a Reddit feature that works fairly well. It will probably yield mediocre results most of the time. But you can drill down a little further with that search bar using search parameters. These parameters are things like searching by author, searching by website. Search parameters There are a lot of different searches that you can use. There's a full list of them on Reddit. But this essentially allows you to take that mediocre search bar and make it a little bit more powerful. If you want to look for sports content, you can look specifically at content posted from ESPN.com and see what has been the most upvoted there. Restrict results to subreddit You can restrict your results to a particular subreddit. So if you're trying to look for content around chicken dishes, you're doing work for a restaurant and you're trying to find what's been the most upvoted content around chicken, you don't want people calling each other chickens. So what you can do is restrict your search to a subreddit so that you actually get chicken the food rather than posts talking about that guy is a chicken. Filter results You can filter results. This essentially means that you can take all the results that you get from your search and then you can recategorize it based off of how many upvotes it's gotten, how recently it was posted, how many comments it has. Filter subreddits Then you can also filter subreddits themselves. So you can take subreddits, all the content that's been posted there, and you can look at what's been the most upvoted content for that subreddit. What has been the most controversial content from that subreddit? What's been the most upvoted? What's been the most downvoted? These features make it a really user-friendly place in terms of finding really entertaining stuff. That's why Reddit is often like a black hole of productivity. You can get lost down it and stay there for hours. That works in our benefit as marketers. That means that we can go through, take these different features, apply them to our own marketing needs, and find those really good content ideas. 5 steps to finding content ideas on Reddit So for some examples here. There's a set of key steps that you can use. I'm going to use some real-world examples, so some true-blue things that we've done for clients so that you can see how this actually works in real life. 1. Do a general search for your topic The first step is to do a general search for your topic. So real-world example, we have a client that is in the transportation space. They work with shuttles, with limos, and with taxis. We wanted to create some content around limos. So the way we started in these key steps is we did a general search for limos. Our search yielded some interesting things. We saw that a lot of people were posting pictures of stretch limos, of just wild limo interiors. But then we also saw a lot of people talking about presidential limos, the limos that the president rides in that have the bulletproof glass and everything. So we started noticing that, hey, there's some good content here about limos. It kind of helped frame our brainstorming and our content mining. 2. Find a subreddit that fits The next step is to find a subreddit that fits that particular topic. Now there is a subreddit dedicated to limos. It's not the most active. There wasn't a ton of content there. So what we ended up doing was looking at more broad subreddits. We looked at like the cars subreddit. There was a subreddit dedicated to guides and to breakdowns of different machines. So there were a lot of breakdowns, like cutaways of the presidential limos. So again, that was coming up. What we saw in the general search was coming up in our subreddit specific search. We were seeing presidential limos again. 3. Look at subreddit content from the past month Step 3, look at that sub's particular content from the past month. The subreddit, for example, that we were looking at was one dedicated to automobiles, as I had mentioned earlier. We looked at the top content from that past month, and we saw there was this really cool GIF that essentially took the Chevy logo back from like the '30s and slowly morphed it over the years into the Chevy logo that we saw today. We thought that was pretty cool. We started wondering if maybe we could apply that same kind of idea to our presidential limo finding that we were seeing earlier. 4. Identify trends, patterns, and sticky ideas Number 4 was to identify trends, patterns, and sticky ideas. Sticky ideas, it just means if you come across something and it just kind of sticks in your head, like it just kind of stays there, likely that will happen for your audience as well. So if you come across anything that you find really interesting, that keeps sticking in your head or keeps popping up on Reddit, it keeps getting lots of upvotes, identify that idea because it's going to be valuable. So for us, we started identifying ideas like morphing GIFs, the Chevy logo morphing over time. We started identifying ideas like presidential limos. People really like talking about it. 5. Polish, improve, and up-level the ideas you've found That led us to use Step Number 5, which is to take those ideas that we were finding, polish them, improve them, one up it, take it to the next level, and then create some content around that and promote it. So what we did was we took those two ideas, we took presidential limos and the whole morphing GIF idea over time, and we combined them. We found images of all of the presidential limos since like the '50s. Then we took each of those presidential limos and we created a morphing GIF out of them, so that you started with the old presidential limos, which really weren't really secure. They were convertibles. They were normal cars. Then that slowly morphed up to the massive tanks that we have today. It was a huge success. It was just a GIF. But that idea had been validated because we were looking at what was the most upvoted, what was the most downvoted, what was ranked, what wasn't ranked, and we saw some ideas that we could take, one up, and polish. So we created this morphing presidential limo, and it did really well. It got coverage in a lot of major news networks. ABC News picked it up. CBS talked about it. It even got posted to Reddit later and performed really well on Reddit. It was all because we were able to take these features, mine down, drill down, find those good content ideas, and then polish it and make it our own. I'm really interested to hear if you've tried this before. Maybe you've seen some really good ideas that you'd like to try out on Reddit. Do you have like a favorite search function that you use on Reddit? Do you like to filter by the past year? Do you like a particular subreddit? Let me know down in the comments. Good luck mining ideas. I know it will work for you. Have a great day. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Mining Reddit for Content Ideas in 5 Steps"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Mining Reddit for Content Ideas in 5 Steps"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Features of Reddit"
    },
    {
      "level": "H3",
      "text": "Subreddits"
    },
    {
      "level": "H3",
      "text": "Upvoting and downvoting"
    },
    {
      "level": "H3",
      "text": "Comments"
    },
    {
      "level": "H2",
      "text": "Reddit search & filters"
    },
    {
      "level": "H3",
      "text": "Search bar"
    },
    {
      "level": "H3",
      "text": "Search parameters"
    },
    {
      "level": "H3",
      "text": "Restrict results to subreddit"
    },
    {
      "level": "H3",
      "text": "Filter results"
    },
    {
      "level": "H3",
      "text": "Filter subreddits"
    },
    {
      "level": "H2",
      "text": "5 steps to finding content ideas on Reddit"
    },
    {
      "level": "H3",
      "text": "1. Do a general search for your topic"
    },
    {
      "level": "H3",
      "text": "2. Find a subreddit that fits"
    },
    {
      "level": "H3",
      "text": "3. Look at subreddit content from the past month"
    },
    {
      "level": "H3",
      "text": "4. Identify trends, patterns, and sticky ideas"
    },
    {
      "level": "H3",
      "text": "5. Polish, improve, and up-level the ideas you've found"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Daniel Russell\n          \n            Daniel Russell"
}