{
  "url": "https://moz.com/blog/mining-for-content-ideas-next-level",
  "slug": "mining-for-content-ideas-next-level",
  "title": "Mining for Content Ideas - Next Level - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As marketers, creating content is a critical component of our job. But sometimes it can be challenging to come up with new ideas or ways to iterate on old ones. To help, let’s dig into different ways to use the Moz tools to supplement content strategies.",
  "content": "Mining for Content Ideas - Next Level Content Marketing | Moz Tools By: Meghan Pahinui April 24, 2023 Table of Contents Copied! By: Meghan Pahinui April 24, 2023 Mining for Content Ideas - Next Level Content Marketing | Moz Tools Not to state the obvious, but as marketers, part of our job is to create content. Whether it’s in the form of blog posts, landing pages, social media posts, emails, newsletters, and so on - there’s no way to get around it. It is a critical component of our job. And sometimes, it can be challenging to come up with new ideas or ways to iterate on old ones. With the world consuming content at lightning speed, it is becoming even more difficult to keep up with the expectation of turning out fresh content. We’ve recently published some excellent pieces on the Moz Blog all about content distribution and strategy, including the Whiteboard Fridays “How to Maximize Content” and “A Content Engine that Drives Revenue” (both from Ross Simmonds). And, as I’m sure I don’t have to tell you, content ideation and inspiration can come from anywhere. But what if I told you that you can also use the Moz tools to mine for content ideas? Let’s dig into different ways to use the Moz tools to supplement our content strategies. Find gaps in your existing content When supplementing or modifying your content strategy, a good place to start is by examining your existing content and finding the gaps. This can help identify new content ideas and areas where your content strategy may be missing key opportunities to thrive. The Keyword Gap tool in Moz Pro allows you to enter your site and up to 3 competitors to identify Keywords to Improve and Top Competing Content. Pro tip: Not sure who your online competitors are? Or just want to confirm and scope out who they may be? Check out the True Competitor tool to find out. The Keywords to Improve section is instrumental when identifying gaps in your existing content strategy. After entering the sites you’d like to compare, the tool will list keywords for which you and your competitors rank. You can then use the filter option to see only specific segments of keywords. For example, we may want to see only keywords where we’re ranking on the second page to identify opportunities for content improvements. We will even show you the Traffic Lift for those keywords, which is the amount of traffic we estimate you can gain by overtaking your competitor in the SERP. Another great use case for this tool is to identify new content ideas. Let’s say we’re working on building out the “best of” section of our foodie blog; we can filter to see keywords that include “Best,” as seen in the screenshot below. We can then identify keywords for which we’re not ranking, but our competitors are and work to build content around them. In this case, we’re not ranking for “Best Pizza in Los Angeles,” so we may want to see about creating a blog post about this topic. Spotting these content gaps can strengthen your content strategy. It can not only help spark ideas for new content but also help identify places where your content can be improved or refreshed for better performance. Identify what type of content is performing One of the best places to get ideas for content is to see what kind of content is already out there and performing. Top Competing Content in Keyword Gap can provide insight into what is performing well by listing content your competitors rank for with the Content URL and Top Ranking Keywords. In this example, we can see that one of the competitors I’ve entered ranks well for keywords related to choosing a mattress size and, perhaps more importantly, that the content ranking is from their blog. We can now look at the blog posts themselves to get an idea of what format has been successful for them and what information they are including. We can ask ourselves: Is this a topic we can cover on our site? Do we already cover this, but it’s not ranking as well? Is there a way we can improve the content or add a different perspective, format, or content type to the space? The possibilities are endless! Spot tangential content ideas Sticking with Top Competing Content in Keyword Gap, let's see if we can spot some ideas for tangential content. As Amanda Milligan discusses in her Whiteboard Friday episode, content ideas which aren’t directly related to your product can often lead to positive outcomes like links, social shares, and brand awareness. These peripherally related topics can supplement your content strategy and help create a well-rounded library of assets. Sticking with our mattress company example, let’s say we are looking for content ideas to help build out our newly launched blog. We may know that there is value in creating pieces around mattress-related topics like deciding on a mattress size or determining what firmness would be best, but what tangential content ideas can we identify in our research? The example above shows that our competitors are ranking for content related to topics like weighted blankets and sleep hygiene. These could be great opportunities for me to create new content not directly related to mattresses but still related to the sleep industry. Uncover hidden gems Just like content creation, keyword research is a fundamental part of SEO and marketing strategies. And as you’re out there digging into things like search volume, difficulty, and SERP analysis, you may be able to uncover some hidden gems to inform your content strategy as well. Hopping over to Keyword Explorer, we can mine for content ideas in the Keyword Suggestions section of the tool. Keyword Suggestions will provide a list of keywords related to the seed keyword entered, sorted by Relevancy to the original term. You can also apply filters for the source type, grouping preferences, and volume to further define your results. Let’s start by looking at the option to filter titled Display keyword suggestions that. This filter defaults to Include a mix of sources, but an option in the drop-down could be the ace up your sleeve when it comes to content ideation - the filter option called are questions. By selecting are questions, we can see a list of the types of questions searchers ask in relation to our initial keyword. In this example, consider that we work for a real estate agency and are researching content related to buying a house. Filtering our keyword suggestions by are questions will provide us with specific content ideas related to what people ask when buying a home. This can offer a gold mine of content ideas to flesh out a real estate blog or website to help clients find the information they seek. We can even take this research one step further by grouping our keyword suggestions by lexical similarity. Just a reminder here that lexical similarity refers to how closely related or similar the keywords in the group are. Low lexical similarity will result in fewer groups with more keywords since the tool will group keywords that are less similar. Grouping keywords can help us identify additional keywords we may want to target and broad-match keywords that may be worth including in our content. Be mindful of over-optimizing, though! We want to avoid keyword stuffing and cannibalization since they may negatively impact rankings. That being said, consider the below example of how grouping keywords has helped to identify a few content gems. Using our previous example of “buying a house” as the seed keyword, we’ve grouped our keywords by low lexical similarity. Within the “What to consider when buying a house” group, there are two long-tail keywords which may be great inspiration for a new piece of content for our real estate agency - “what to look for when buying a house checklist” and “what to know when buying a house for the first time.” We can now take that information and create a dedicated resource or a blog post that includes a checklist for what to consider when buying a home for the first time and what the buying process looks like. Imagine the inspiration you can get from digging into these suggestions even further! Scope out the competition So far, we’ve identified content opportunities, uncovered new ideas, and found gaps in our existing strategy. But what about our competition? What are they doing? We touched on this a bit using the Keyword Gap tool but let’s dig in further. When modifying your content strategy, it’s important to understand what your competitors are doing and what their audience is engaging with. Although you won’t have access to their traffic data (unless they give you access to it, which is highly unlikely), there is a way you can get an idea of what content may be driving traffic to their site. Or, at the very least, what content is of high value. This is through link analysis. Moz offers quite a few ways to do this, but I’m going to highlight a feature which can help get us started with this research. Top Pages in Link Explorer will return a list of the pages on a site with the most backlinks. This can provide insight into the types of content people find valuable on a site - pages with more links are more valuable. This is partly because backlinks are a ranking factor. Additionally, all those links provide benefits like traffic, brand exposure, and more. After inputting a competitor into Top Pages, we can get an idea of which pages on their site provide the most value. In the screenshot above, we can see that this particular competitor has a lot of “best of” articles which gain a lot of links. We can now explore these pages and see if there is an opportunity to create or modify content on our own site to meet similar demands. Pro tip: Once you’ve created your content, you can use Link Intersect to find domains and pages linking to your competitors and not to you. This can offer a great way to supplement a link building strategy! Discover opportunities for elevation Just like creating new content, refreshing your existing URLs is essential to any content strategy. Elevating your existing content is like polishing your jewelry - it helps keep it in tip-top shape, extends the piece's life, and keeps it relevant to your “collection.” There are many ways to identify and update content in your existing library, but here are two ways to get started (and find new content opportunities in the process). First, let’s investigate featured snippet opportunities. Once we’ve created a Campaign in Moz Pro and are tracking keywords over time, we will have access to the SERP Features section. This part of the tool tracks SERP features included in the search results for your tracked keywords, including featured snippets. Exploring which of our tracked keywords have featured snippets in the SERP can help us identify opportunities for content refresh and new pieces of content. When looking for opportunities for a content refresh, we can seek out keywords where we are ranking on the first page of the SERP but are not included in the featured snippet. In this case, the tool will provide insight into what page is included in the featured snippet and our current rank. This can make it easier to spot high-value pages with a chance of moving into that coveted top spot of the SERP. Alternatively, looking at which of our tracked keywords include a featured snippet but where we are not ranking on the first page (or at all) can help to identify possible opportunities for creating new, high-value content. We’ll just want to be sure to optimize for the featured snippet right from the start. Pro tip: Export a CSV of the SERP Features data in your Campaign to sort and filter outside the app. If a SERP feature is marked Included in the CSV, it means your site is included in that particular feature. If it’s marked true it means the SERP feature is present for that keyword, but your tracked site isn’t included. Next, we’ll pop over to the Page Optimization section of our Campaign. Although the primary purpose of this feature is to illustrate how well-optimized a page is for a particular keyword, there is a hidden gem that can help identify refresh opportunities, new content ideas, and tangential topics. The Content Suggestions tab will list keywords and topics often used on the top-ranking pages for the keyword we’re optimizing for. In the above example, we’re optimizing for the keyword “best pillow.” Looking at the content suggestions, it may be a good idea to format this content as a list (like “11 best pillows”) or to include information about what types of sleepers would benefit from each pillow listed (like “side sleepers”). These content suggestions can also help us to find ideas for other pieces of content, tangentially related. Find the sweet spot of innovation If there’s one thing we can take away from this exploration of content ideation with Moz Pro, it’s that there are infinite ways to do it. This post only covers a handful of them; the reality is that the world (of content creation) is your oyster! The key is to find which features, tools, and processes fit best with your strategy and make them work for you. How do you use the tools to investigate new ideas? I’d love to hear about it! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Mining for Content Ideas - Next Level"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Mining for Content Ideas - Next Level"
    },
    {
      "level": "H2",
      "text": "Find gaps in your existing content"
    },
    {
      "level": "H3",
      "text": "Identify what type of content is performing"
    },
    {
      "level": "H2",
      "text": "Spot tangential content ideas"
    },
    {
      "level": "H2",
      "text": "Uncover hidden gems"
    },
    {
      "level": "H2",
      "text": "Scope out the competition"
    },
    {
      "level": "H2",
      "text": "Discover opportunities for elevation"
    },
    {
      "level": "H2",
      "text": "Find the sweet spot of innovation"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    }
  ],
  "author": "Meghan Pahinui\n          \n            Meghan Pahinui\n          \n            Meghan Pahinui"
}