{
  "url": "https://moz.com/blog/mission-imposserpble-3-we-need-to-think-beyond-the-top-10",
  "slug": "mission-imposserpble-3-we-need-to-think-beyond-the-top-10",
  "title": "Long Tail CTR Study: The Forgotten Traffic Beyond Top 10 Rankings - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If your business is still obsessing over a top 10 position in Google, the brand is missing out on some excellent opportunities. Our latest study reveals web prospects are looking well beyond the first page of returned results.",
  "content": "Long Tail CTR Study: The Forgotten Traffic Beyond Top 10 Rankings SEO Basics | Conversion Rate Optimization (CRO) By: Gary Moyle December 3, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Gary Moyle December 3, 2014 Long Tail CTR Study: The Forgotten Traffic Beyond Top 10 Rankings SEO Basics | Conversion Rate Optimization (CRO) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Search behavior is fundamentally changing, as users become more savvy and increasingly familiar with search technology. Google’s results have also changed significantly over the last decade, going from a simple page of 10 blue links to a much richer layout, including videos, images, shopping ads and the innovative Knowledge Graph. We also know there are an increasing amount of touchpoints in a customer journey involving different channels and devices. Google’s Zero Moment of Truth theory (ZMOT), which describes a revolution in the way consumers search for information online, supports this idea and predicts that we can expect the number of times natural search is involved on the path to a conversion to get higher and higher. Understanding how people interact with Google and other search engines will always be important. Organic click curves show how many clicks you might expect from search engine results and are one way of evaluating the impact of our campaigns, forecasting performance and exploring changing search behavior. Using search query data from Google UK for a wide range of leading brands based on millions of impressions and clicks, we can gain insights into the how CTR in natural search has evolved beyond those shown in previous studies by Catalyst, Slingshot and AOL.Our methodology The NetBooster study is based entirely on UK top search query data and has been refined by day in order to give us the most accurate sample size possible. This helped us reduce anomalies in the data in order to achieve the most reliable click curve possible, allowing us to extend it way beyond the traditional top 10 results. We developed a method to extract data day by day to greatly increase the volume of keywords and to help improve the accuracy of the average ranking position. It ensured that the average was taken across the shortest timescale possible, reducing rounding errors. The NetBooster study included:65,446,308 (65 million) clicks 311,278,379 (311 million) impressions 1,253,130 (1.2 million) unique search queries 54 unique brands 11 household brands (sites with a total of 1M+ branded keyword impressions) Data covers several verticals including retail, travel and financial We also looked at organic CTR for mobile, video and image results to better understand how people are discovering content in natural search across multiple devices and channels. We’ll explore some of the most important elements in this article.How does our study compare against others? Let’s start by looking at the top 10 results. In the graph below we have normalized the results in order to compare our curve, like-for-like, with previous studies from Catalyst and Slingshot. Straight away we can see that there is higher participation beyond the top four positions when compared to other studies. We can also see much higher CTR for positions lower on the pages, which highlights how searchers are becoming more comfortable with mining search results. A new click curve to rule them all Our first click curve is the most useful, as it provides the click through rates for generic non-brand search queries across positions 1 to 30. Initially, we can see a significant amount of traffic going to the top three results with position No. 1 receiving 19% of total traffic, 15% at position No. 2 and 11.45% at position No. 3. The interesting thing to note, however, is our curve shows a relatively high CTR for positions typically below the fold. Positions 6-10 all received a higher CTR than shown in previous studies. It also demonstrates that searchers are frequently exploring pages two and three. When we look beyond the top 10, we can see that CTR is also higher than anticipated, with positions 11-20 accounting for 17% of total traffic. Positions 21-30 also show higher than anticipated results, with over 5% of total traffic coming from page three. This gives us a better understanding of the potential uplift in visits when improving rankings from positions 11-30. This highlights that searchers are frequently going beyond the top 10 to find the exact result they want. The prominence of paid advertising, shopping ads, Knowledge Graph and the OneBox may also be pushing users below the fold more often as users attempt to find better qualified results. It may also indicate growing dissatisfaction with Google results, although this is a little harder to quantify. Of course, it’s important we don’t just rely on one single click curve. Not all searches are equal. What about the influence of brand, mobile and long-tail searches?Brand bias has a significant influence on CTR One thing we particularly wanted to explore was how the size of your brand influences the curve. To explore this, we banded each of the domains in our study into small, medium and large categories based on the sum of brand query impressions across the entire duration of the study. When we look at how brand bias is influencing CTR for non-branded search queries, we can see that better known brands get a sizable increase in CTR. More importantly, small- to medium-size brands are actually losing out to results from these better-known brands and experience a much lower CTR in comparison. What is clear is keyphrase strategy will be important for smaller brands in order to gain traction in natural search. Identifying and targeting valuable search queries that aren’t already dominated by major brands will minimize the cannibalization of CTR and ensure higher traffic levels as a result.How does mobile CTR reflect changing search behavior? Mobile search has become a huge part of our daily lives, and our clients are seeing a substantial shift in natural search traffic from desktop to mobile devices. According to Google, 30% of all searches made in 2013 were on a mobile device; they also predict mobile searches will constitute over 50% of all searches in 2014. Understanding CTR from mobile devices will be vital as the mobile search revolution continues. It was interesting to see that the click curve remained very similar to our desktop curve. Despite the lack of screen real estate, searchers are clearly motivated to scroll below the fold and beyond the top 10. NetBooster CTR curves for top 30 organic positions Position Desktop CTR Mobile CTR Large Brand Medium Brand Small Brand 1 19.35% 20.28% 20.84% 13.32% 8.59% 2 15.09% 16.59% 16.25% 9.77% 8.92% 3 11.45% 13.36% 12.61% 7.64% 7.17% 4 8.68% 10.70% 9.91% 5.50% 6.19% 5 7.21% 7.97% 8.08% 4.69% 5.37% 6 5.85% 6.38% 6.55% 4.07% 4.17% 7 4.63% 4.85% 5.20% 3.33% 3.70% 8 3.93% 3.90% 4.40% 2.96% 3.22% 9 3.35% 3.15% 3.76% 2.62% 3.05% 10 2.82% 2.59% 3.13% 2.25% 2.82% 11 3.06% 3.18% 3.59% 2.72% 1.94% 12 2.36% 3.62% 2.93% 1.96% 1.31% 13 2.16% 4.13% 2.78% 1.96% 1.26% 14 1.87% 3.37% 2.52% 1.68% 0.92% 15 1.79% 3.26% 2.43% 1.51% 1.04% 16 1.52% 2.68% 2.02% 1.26% 0.89% 17 1.30% 2.79% 1.67% 1.20% 0.71% 18 1.26% 2.13% 1.59% 1.16% 0.86% 19 1.16% 1.80% 1.43% 1.12% 0.82% 20 1.05% 1.51% 1.36% 0.86% 0.73% 21 0.86% 2.04% 1.15% 0.74% 0.70% 22 0.75% 2.25% 1.02% 0.68% 0.46% 23 0.68% 2.13% 0.91% 0.62% 0.42% 24 0.63% 1.84% 0.81% 0.63% 0.45% 25 0.56% 2.05% 0.71% 0.61% 0.35% 26 0.51% 1.85% 0.59% 0.63% 0.34% 27 0.49% 1.08% 0.74% 0.42% 0.24% 28 0.45% 1.55% 0.58% 0.49% 0.24% 29 0.44% 1.07% 0.51% 0.53% 0.28% 30 0.36% 1.21% 0.47% 0.38% 0.26% Creating your own click curve This study will give you a set of benchmarks for both non-branded and branded click-through rates with which you can confidently compare to your own click curve data. Using this data as a comparison will let you understand whether the appearance of your content is working for or against you. We have made things a little easier for you by creating an Excel spreadsheet: simply drop your own top search query data in and it’ll automatically create a click curve for your website. Simply visit the NetBooster website and download our tool to start making your own click curve.In conclusion It’s been both a fascinating and rewarding study, and we can clearly see a change in search habits. Whatever the reasons for this evolving search behavior, we need to start thinking beyond the top 10, as pages two and three are likely to get more traffic in future. We also need to maximize the traffic created from existing rankings and not just think about position. Most importantly, we can see practical applications of this data for anyone looking to understand and maximize their content’s performance in natural search. Having the ability to quickly and easily create your own click curve and compare this against a set of benchmarks means you can now understand whether you have an optimal CTR.What could be the next steps? There is, however, plenty of scope for improvement. We are looking forward to continuing our investigation, tracking the evolution of search behavior. If you’d like to explore this subject further, here are a few ideas:Segment search queries by intent (How does CTR vary depending on whether a search query is commercial or informational?) Understand CTR by industry or niche Monitor the effect of new Knowledge Graph formats on CTR across both desktop and mobile search Conduct an annual analysis of search behavior (Are people’s search habits changing? Are they clicking on more results? Are they mining further into Google’s results?) Ultimately, click curves like this will change as the underlying search behavior continues to evolve. We are now seeing a massive shift in the underlying search technology, with Google in particular heavily investing in entity- based search (i.e., the Knowledge Graph). We can expect other search engines, such as Bing, Yandex and Baidu to follow suit and use a similar approach. The rise of smartphone adoption and constant connectivity also means natural search is becoming more focused on mobile devices. Voice-activated search is also a game-changer, as people start to converse with search engines in a more natural way. This has huge implications for how we monitor search activity. What is clear is no other industry is changing as rapidly as search. Understanding how we all interact with new forms of search results will be a crucial part of measuring and creating success. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Long Tail CTR Study: The Forgotten Traffic Beyond Top 10 Rankings"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Long Tail CTR Study: The Forgotten Traffic Beyond Top 10 Rankings"
    },
    {
      "level": "H2",
      "text": "Our methodology"
    },
    {
      "level": "H2",
      "text": "How does our study compare against others?"
    },
    {
      "level": "H2",
      "text": "A new click curve to rule them all"
    },
    {
      "level": "H2",
      "text": "Brand bias has a significant influence on CTR"
    },
    {
      "level": "H2",
      "text": "How does mobile CTR reflect changing search behavior?"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "NetBooster CTR curves for top 30 organic positions"
    },
    {
      "level": "H2",
      "text": "Creating your own click curve"
    },
    {
      "level": "H2",
      "text": "In conclusion"
    },
    {
      "level": "H2",
      "text": "What could be the next steps?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Gary Moyle\n          \n            Gary Moyle\n          \n            Gary Moyle"
}