{
  "url": "https://moz.com/blog/mobile-conversion-rates-from-drab-to-fab",
  "slug": "mobile-conversion-rates-from-drab-to-fab",
  "title": "Mobile Conversion Rates: From Drab to Fab - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Mobile e-commerce isn't quite there yet, but you can help your conversions.",
  "content": "Mobile Conversion Rates: From Drab to Fab Mobile SEO By: Shannon Bauman August 27, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Shannon Bauman August 27, 2012 Mobile Conversion Rates: From Drab to Fab Mobile SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Is mobile e-commerce here in all its glory, or are we just at the beginning? If you follow news of sites like Gilt and Fab, you’d come away with the impression that sites are currently pulling in a large percentage of their revenue from mobile shoppers, and seeing very high conversion rates. I wanted to dig into real data to see what it said about the broader market. I looked at data from a sample of Spring Metrics' customers who ranged from very small to medium-sized, and it showed an interesting story. In the second half of this post, I’ll discuss a few ways to improve the mobile experience. In the data below, I show aggregate numbers as well as breaking the data into different annual revenue ranges: micro sites ($1k-$50k annual revenue), mini sites ($50k-$250k annual revenue), small sites ($250k - $1mm annual revenue), and medium sites ($1mm - $10mm annual revenue). Note, this data was collected June 17th through July 17th, so it’s free of major season spikes. Conversion Rates In analyzing the data, I realized most sites are not seeing great conversion rates from mobile devices. The analyzed sites converted users into buyers at roughly half the rate on mobile device as compared to those who used desktop devices. The results were even more dramatic for micro sites ($1k-$50k annual revenue). The micro sites had a much more difficult time converting mobile users into buyers. This is perhaps not surprising as smaller sites have fewer resources with which to build a mobile-friendly site. Revenue Per Conversion How much are mobile customers spending compared to desktop customers? At an aggregate level, the numbers were closer than I expected—about a 20% difference between mobile and desktop. But again, among micro sites, we see much greater contrast, with mobile users spending about half as much as desktop users. Total Site Revenue from Desktop vs Mobile Finally, I wanted to break down the revenue splits between mobile and desktop users. At an aggregate level, we see an average of about 8 percent of a site's total revenue coming from mobile and 92 percent from desktop. Again we see micro sites doing much worse than this, averaging around 2.7 percent of revenue from mobile. How to improve your mobile experience While it’s interesting and exciting to see Gilt and Fab doing such great business on mobile, it appears the bulk of sites are still in the first stage of building their mobile conversion rates. Of course, this raises the question: What can you do to make your site’s mobile experience better? Let’s look at what Fab and Gilt are doing and what can be learned from it. 1. Build a mobile experience Those who have smartphones know browsing on a phone is a much different experience than browsing on a computer. Your site should address these differences. On phones, people want to look at big, beautiful pictures as opposed to an array of tiny text links. They also don’t want to type or use your onsite search, and they don’t want to fill out complicated forms. Both Gilt and Fab have iPhone apps, which are a nice solution. But apps aren’t the only option. You can design a mobile version of your site that leverages the advantages of the mobile form factor. Notice the giant product images on Fab, the large easy-to-press buttons, and the simplicity of the pages. You typically won’t see more than a dozen words on any single page. In contrast, in the second example, you see a small product image, a wall of text, and an even more intimidating wall of form fields required to make a purchase. Are your fingers cramping up at the mere sight of that? Mine are. 2. Find the right call to action Both Gilt and Fab are built around flash sales that encourage buyers to purchase right on the spot. This plays perfectly into the habits of a mobile shopper. If they’re on the bus or train, killing time, they see a flash sale and buy right then and there. Perhaps your site doesn’t fit the flash sale model. What can you do to leverage the emerging mobile revolution? Well, perhaps a purchase isn’t the right line of attack for you.Perhaps you simply want users to \"like\" you on Facebook, providing you a communication channel for future marketing. Other calls to action you might consider are incentivizing a tweet, allowing visitors to email themselves a link for later review, or simply collecting your visitor’s email address for later outreach. Conclusion While some sites like Fab and Gilt are doing a fantastic job with their mobile shopping experience, the vast majority of sites have a long way to go. Sites can make great strides with a few straightforward improvements: 1) making sure their design is fun and clean for mobile users and 2) thinking through what the most appropriate call to action. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Mobile Conversion Rates: From Drab to Fab"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Mobile Conversion Rates: From Drab to Fab"
    },
    {
      "level": "H3",
      "text": "Conversion Rates"
    },
    {
      "level": "H3",
      "text": "How to improve your mobile experience"
    },
    {
      "level": "H3",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too"
    },
    {
      "level": "H3",
      "text": "Internal Linking for Mobile-First & Mobile-Only Indexing"
    },
    {
      "level": "H3",
      "text": "All About Fraggles (Fragment + Handle)"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Shannon Bauman\n          \n            Shannon Bauman"
}