{
  "url": "https://moz.com/blog/mobile-search-ranking-factors",
  "slug": "mobile-search-ranking-factors",
  "title": "Mobile Search Ranking Factors (Clue - One Normal SEO Factor is Missing) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We have been doing some research into how to rank in Google mobile web search. Google is the dominant player in mobile search in the US (source: Nielsen Mobile) - our test site hasn't yet been indexed in the other search engines so I'll have to report back later on how it does there:",
  "content": "Mobile Search Ranking Factors (Clue - One Normal SEO Factor is Missing) On-page SEO By: Will Critchlow December 3, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Will Critchlow December 3, 2008 Mobile Search Ranking Factors (Clue - One Normal SEO Factor is Missing) On-page SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. We have been doing some research into how to rank in Google mobile web search. Google is the dominant player in mobile search in the US (source: Nielsen Mobile) - our test site hasn't yet been indexed in the other search engines so I'll have to report back later on how it does there: Many of you will be familiar with the ranking factors report that SEOmoz put together last year. I found it very useful to see others' views even though I contributed to it. I am looking forward to the update (perhaps next year?) when I expect we will see more people expressing views on usage data being incorporated into the algorithm along with the impact of reviews on local search, etc. I have been interested in mobile search for a long time. Before starting Distilled, I worked in management consultancy for Internet and mobile companies and the mobile stuff has stuck with me as a continuing interest. I now personally carry out an average of a few mobile searches a day and I know that the total search volume has been exploding. Driven by the iPhone and similar devices finally finding critical mass with normal users, we are finally seeing a true channel emerging for many businesses where there used to be only marketing hype. I'm not declaring 2008 or 2009 the 'year of the mobile web', nor am I going to get into a discussion here about mobile web vs. mobile interpretations of the main web because I think there is more value to be had in thinking about the value of the channel. Whatever you believe about mobile web, it appears to be here to stay and is growing quickly - Nielsen recently released data on growth of the UK mobile internet market (source: Nielsen mobile) - the y-axis is \"unique audience in millions\": Note that if you look at the number of mobile devices in the world and the number of searches performed per user who is using the mobile web, as more mobile users turn to the mobile web, we will eventually see mobile searches outstrip PC-based searches... If you have carried out mobile searches (using, for example, Google's mobile site - if you use a PC to search there, you'll also need to click 'mobile' in the search results) you will know that the results often look nothing like the main search results. This is for the two good reasons that: When you are mobile you are looking for a different kind of resource Many mobile devices cannot cope with the same breadth of content as desktops and laptops It really struck home when, pre-iPhone, I searched for [train times] from my old Nokia (using the trusty Opera mobile browser). With my clumsy query I was hoping to find a mobile-friendly version of either the TFL or National Rail sites (neither gets a link because they are the most annoying sites in the world - if you live in London / the UK you will have experienced them). Instead, I found train-times.mobi which isn't actually a real site - it is basically just a holding page (it's worth noting that the mobile [train times] SERPS appear a bit cleaner when I look again now). This got me thinking - I thought that 'train times' would be one of the more competitive searches from a mobile, so how was this site ranking? I dug in a little more and it wasn't propped up with a bunch of exact anchor-text links or anything else like that. I was actually quite surprised it had gotten itself indexed. So I started to wonder what factors were influencing the mobile search rankings. There are two main reasons that led me to hypothesise that PageRank might not be a particularly powerful factor in the mobile ranking factors (I later found a similar post from Patrick at blogstorm - and I've added his reason as a third): People browsing on their mobile are less likely to follow links around the web (they browse less in general) and hence the link graph is less effective as a model for searcher behaviour Mobile users don't link to mobile content so the link graph isn't created by people in the same context as the people browsing the link graph (exacerbating the issue with the regular web of the linkerati being only a subset of users - but in the mobile case, people who can link are those at their PCs and therefore an entirely distinct group from browsers - and when they are at their PCs, why would they link to mobile-specific sites?) Patrick's reason: Time and location are so much more important for mobile searches and links tell you nothing about relevance relative to either of these factors At the moment, the mobile web is relatively young and there is not a huge amount of competition compared with the regular web, so it seems plausible that you could rank for even reasonably competitive phrases without many links if other factors are relatively more powerful. We started out by researching the sites ranking for a range of competitive mobile keyphrases (including maps, take away, taxi, train times, restaurant, poker) and formed some ideas on how we should build our test site. Following this, we built a small mobile site in a competitive niche following best development practices but without building links to it. It has two or three nofollow links which resulted in it being indexed in Google mobile search but which shouldn't be passing any ranking benefit. Once indexed, it quickly ranked for our target phrases and has gradually improved to the extent that we are thinking about building it out further (hence why I'm not disclosing it here yet). Based on the success of this, we have put together our current recipe for mobile rankings (I have no doubt that the algorithms will get more sophisticated as the mobile web matures). We haven't done extensive testing to determine which of these factors is the most important, but this methodology works and all the steps are useful for mobile users, so it seems reasonable to include them all. How to build a site that does well in mobile search Small, lightweight and fast-loading site (< 20kb / page) XHTML Mobile 1.0 Doctype UTF-8 character encoding JPEG / GIF images Content including \"mobile\" On-site keyphrase optimisation as usual (with a focus on short titles, and small amounts of body copy) Regular technical SEO principles It is worth comparing this list with Google's mobile website advice. Note, however, that keyphrases in the domain name are not required (which I thought could be the sole reason for the 'train times' example above) - we got a site ranking for competitive London-oriented phrases with a domain that included no London-based keywords. We also haven't yet added a mobile sitemap. Seriously? What about links? You will also have noticed something missing from that list: links. I can't say that there is no link-based element of mobile ranking at the moment (and certainly can't say that there isn't going to be an increased element of it in the future). But right now, partly because of the relative lack of competition and partly because as I explained above, the link graph makes less sense for mobile sites and users, links are not needed for (at least some) mobile rankings. I expect a new spate of mobile sites now. Knock yourselves out ;) Mobile tools In the course of this research and some other work we have been doing, it has become abundantly clear that there is a lack of tools to help mobile marketers at the moment. There are some useful tools for the technical side of things - we find the .mobi emulator useful for testing, etc. - but the marketing side of things is very under-serviced. One area that I am particularly surprised not to have seen yet is keyword research. Traditional keyword research tools don't shed much light on how people carry out mobile searches. There are a variety of factors that lead people to search differently when mobile, including (but probably not limited to): A need for different kinds of products / services when mobile A corresponding lack of some tasks being carried out when mobile (ever bought groceries on your phone? Know anyone who has?) Constraints of the device - leading, I would imagine, to shorter searches, more mis-spellings, etc., even when searching for the same thing Different refinement / re-searching behaviour resulting from time constraints and device constraints Desire for results local to current location Plausible effects in either direction on branded search - on one hand, people don't have access to all their bookmarks, might not want to type .co.uk, etc. - but on the other hand, performing a search requires two page loads to get to the end location and that can be slow on some devices For all these reasons, and also to satisfy my general marketing curiosity, I would like better information on mobile searching habits. I think it is pretty strange that you can buy mobile search ads but currently have no data on volumes ahead of time. When you think about finding out how people search, you realise that there are two kinds of people who have this data: the search engines ISPs Now, the search engines haven't always been particularly keen to release keyword data. AOL recently released data on the top 5 mobile searches, which is quite sweet, but not particularly helpful. Mobile search is still in its infancy - and I suspect that the data is sparse for the smaller search engines, and they might be a little embarrassed to release their data (do Microsoft and Yahoo! admit that \"google\" is still their most popular search term these days?). I have spoken to representatives at all the major engines and none of them have any road map that they would tell me about for releasing proper keyword data. In the world of the regular internet, there are so many ISPs that sampling is needed, and the data is often poor (or needing a lot of correction / effort to make it usable). In the mobile world there are far fewer ISPs - in the UK, for example, if you had access to O2's data (segmented by iPhone / non-iPhone) you would have over 20% of the market. Any of the mobile operators could do a decent job of extrapolating their data to the marketplace. Of course, there is the additional benefit that they could gather segmented data across search engines, and they have huge amounts of demographic data to go alongside the keywords. So, if anyone from a mobile operator is reading, let me know who I need to bug to put together a co-branded tool that uses your data and our knowledge / skills! We're also finding that regular analytics data doesn't cut it - many mobile devices don't execute javascript. Although you can fall back on log file data, there are reasons we all love the ease of use of Google Analytics, etc. If anyone has a good solution to this problem, let me know! Also - if anyone from the Google Webmaster Central team happens to be listening, we are seeing data for search impressions, but no search traffic (which we know isn't true from our log data). Behaviour away from search This morning I went to a presentation by Ciaran Norris about social media marketing (given to an interesting audience of people who mainly hadn't seen will it blend) where he reminded me about the great social media planning tool from Forrester that they call Groundswell. As he showed off the data, I was thinking (probably because I was writing this post in his presentation, sorry Ciaran) that it would be great if you could segment according to mobile use as well as geographic area - e.g., 18-24 year old females in the UK on their mobile - how does that change the proportion who are \"joiners\" vs. \"Creators\" vs. \"Critics,\" for example. Further reading and a funny data point Brand Republic have a story about Yahoo! striking a deal with Virgin Mobile (I'm tempted to go all el reg on that and put exclamation marks all over the place) which claims that this gives Yahoo! an 80% market share in UK mobile search: The deal takes Yahoo!'s market share of the UK mobile search audience to 80% and follows similar deals with Orange, O2, 3 and T-Mobile. To which I say, in the UK vernacular, bollocks. It appears to be an extrapolation from the fact that they have \"deals\" with 4 of the 5 UK mobile operators (= 80% - see what they did there?). This is despite the fact that I have an iPhone with O2 and the default search when I got it was Google (great \"deal\" there, Yahoo!). I don't have accurate UK mobile search market share data - has anyone else seen any? - but I'd put money on Yahoo! not having an 80% market share. If you liked my thoughts on mobile search, you can read more of my mobile musings on the Distilled blog: The differences between mobile and cell terminology between the UK and US influence how we think about the mobile web How to choose a URL for your mobile website Why Google could be the next Google And a bonus link to great websites for tiny browsers. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Mobile Search Ranking Factors (Clue - One Normal SEO Factor is Missing)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Mobile Search Ranking Factors (Clue - One Normal SEO Factor is Missing)"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Will Critchlow\n          \n            Will Critchlow\n          \n            Will Critchlow"
}