{
  "url": "https://moz.com/blog/mobile-serps-usability",
  "slug": "mobile-serps-usability",
  "title": "Mobile SERPS & Usability - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "So here is the deal: Traditional websites frequently rank in mobile search results – especially if you are searching from a SmartPhone. What you may not realize is that the converse is also true – mobile pages can rank well in traditional search. This is quite an interesting phenomenon, and…",
  "content": "Mobile SERPS & Usability Marketing Psychology By: Cindy Krum August 31, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Cindy Krum August 31, 2010 Mobile SERPS & Usability Marketing Psychology The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. So here is the deal: Traditional websites frequently rank in mobile search results – especially if you are searching from a SmartPhone. What you may not realize is that the converse is also true – mobile pages can rank well in traditional search. This is quite an interesting phenomenon, and something that we need to address strategically. All One Index Soon? Why does this happen?Well, Google has said that they really don’t want to index two versions of the web – one mobile and one traditional. Even though they do have different mobile-specific bots, they want those their bots all to feed into one index. Hmmmm….Is it just an interesting coincidence that they just launched the multi-format site mapping in Google, where you can combine all the different types of sitemaps that we previously had to submit separately? Possibly. At least it that could indicate a shift away from multiple indexes.Did anyone notice that this shift happened pretty soon after Caffeine, as did the re-launch of Google Images, and some significant changes in Google Places?Hmmmm…..It seems that Google might be moving away from having multiple indexes that must be queried for different types of content - like mobile, local, images, news, etc. to a 'one index' solution that has different types of ‘indexing attributes’ instead. That would actually do lots of things that Caffeine has done, like speed up searches (only need to query one index), and allow them to algorithmically prioritize things by freshness more effectively…. Different Indexes for Smart Phones and Feature Phones But I have gone astray – We were talking about 'mobile'. We can’t know for sure if there are different mobile indexes. There definitely was a separate mobile index in the beginning of Google's ‘mobile’ search– you could always tell because the results were SO bad! Even in the past two years, I have seen mobile search results that were way off base – For example, the top result for a search on ‘subway sandwiches’ was a Gawker article for a long time; then Subway.com, and then m.subway.com. I just checked, and they have somewhat sorted that one out on smart phone searches, but it you still get weird results for feature phone search (shown below)! About 18 months ago Google changed the location of their mobile engine from m.Google.com to Google.com/m, and it did seem that the ‘/m’ feature phone search results were a bit better than they had been, but who knows! As I have mentioned, there are different mobile search engine crawlers that are evaluating your website as if it was being rendered on a mobile phone. These mobile bots actually have both generic and specific user agent strings that will spoof actual phone handset models in order to understand how the website would render and function on the different phones. While they don’t do a great job, Google actually does try to only provide you with mobile search results that will actually work well on your particular handset – What that means is that there are slight variations on search results from phone to phone. There are some simple ways to check what I am now describing as ‘mobile indexing attributes.’ I always start mobile rankings research by doing a normal search from my traditional computer. We know more about the traditional algorithm, so that sets my baseline for comparison. From there, I will do the same search from Google.com/m to see the differences. In most cases, the websites that are included in the traditional search results will be included in the SmartPhone search results – but sometimes in a slightly different order. You don’t have to have tons of different phones to get a sense for what is going on in mobile search. There are a couple quick tips and tricks to help you do this all from the web. The first thing to know, is that you can do searches from your computer directly from Google.com/m. The results you get will be generic ‘SmartPhone’ search results. From that page, you can move on to see the results for the same query on feature phones by simply scrolling to the bottom of the page and changing the drop-down that says ‘web’ to say ‘mobile,’ and hit ‘search.’ The next set of results will be the generic FeaturePhone results. Search operators like 'site:' and 'link:' work in these versions of Google, and will return different results than they would in traditional search - a good indication to me that they are still using separate indexes. Mobile-Friendly Signals for the Search Engines The best way to indicate to the search engines that your page is mobile-ready, (beyond including the ‘no-transform’ tag, which will be discussed more in another post called What is Mobile Search Engine Transcoding? which should be live next week), is to provide the search engines pages that will work well on mobile phones. Handheld stylesheets can be included on any page on your site. If you don’t have mobile-specific pages, you can use these stylesheets to tell mobile browsers how you would like your existing pages to look when they are displayed on a mobile phone. These are especially good if you would like to change the order that your content appear in when it is displayed on a mobile phone. They should also be used to prevent the need for left-to right scrolling when your site is displayed on a mobile phone. If you have mobile specific pages, you should set up user-agent detection on your site to ensure that, regardless of which pages rank (mobile or traditional) that users are presented with the appropriate version of the page, based on the device that they are using to access the page. If they are on a mobile phone, they should automatically be sent to the mobile version of a page – even if it is the traditional page that actually ranked in search engines. Conversely, if they are on a traditional computer, and happen to click on a mobile version of a page, they should be automatically be sent to the version of the page that is meant for traditional-computer viewing. Last, include a page-to-page link in the upper left hand corner of each page that allows people to move between the mobile and traditional versions of the pages, if they can’t find what they are looking for, or need to over-ride the user-agent detection and redirection. The upper left-hand corner is the ideal location for this link, because it is always the first thing that people will be able to see, even if there is a mobile rendering problem with the site. If something is wrong with the way the page looks on someone’s phone, you don’t want to make them search all over for the button to fix it! You should still crate the handheld stylesheet for your mobile-specific pages and traditional pages as well, just in case something goes wrong. They are a good signal to the search engines that the pages should be ranked in mobile search results. Mobile Usability Options: Mobile/Traditional Hybrid Pages Only: One set of pages that has two or more style sheets – One for traditional web rendering, usually called ‘screen,’ and one (or more) for mobile web rendering, usually called ‘handheld.’ An important note is that the iPhone will automatically pull the ‘screen’ stylesheet, unless you give other instructions. Since looking at a traditional website on an iPhone is really not a great user experience, I recommend creating a specific stylesheet that can be pulled by the iPhone. You can get very granular with this, and create separate style sheets for all different kinds of phones. You would then simply have them called in based on the screen size of the device that they target._Traditional Pages for Computer and Mobile Pages for all Phones: Two sets of pages – one to be shown on traditional computers and one to be shown on mobile phones. The file structure of the mobile pages should be an exact replica of the traditional pages, with the addition of the ‘.m' or '/m'. User-agent detection and redirection should deliver feature phone users and smart phone users to the mobile pages automatically if they click on a link to a traditional page.Always include links between the mobile site and the traditional site in the upper left hand corner of the page. Both sets of pages should have a handheld stylesheet to control mobile rendering - This is in case the user-agent detection and redirection fails, or if the user clicks the link to see the traditional site from their mobile phone. _Mobile/Traditional Hybrid Pages for Traditional and SmartPhone, Mobile Specific Pages for Feature Phones: Two sets of pages; one set of pages that are the mobile/traditional hybrid pages that use separate external stylesheets to be rendered on traditional computer screens and smart phones. The second set of pages are mobile specific pages, hosted on an ‘m.’ or a ‘/m’. The file structure should be an exact replica of the traditional file structure, with the addition of the ‘m’ or ‘/m’. User-agent detection and redirection delivers feature phone users here automatically if they click on a link to a traditional page while they are on a feature phone.Always include links between the mobile site and the traditional site in the upper left hand corner of the page. Both sets of pages should have a handheld stylesheet to control mobile rendering - This is in case the user-agent detection and redirection fails, or if the user clicks the link to see the traditional site from their mobile phone._Traditional Pages for Computers, Graphical Mobile Pages for Smart Phones, Text Mobile Pages for Feature Phones: Three sets of pages. Traditional pages for traditional computers, touch-optimized pages for smart phones with touch screens, and mobile-optimized pages for feature phones and smart phones without touch screens. User-agent detection and redirection delivers users with touch screens to the touch-screen pages if they click on a link while they are on a touch-screen phone. User-agent detection and redirection delivers users on feature phones and smart phones that don’t have a touch-screen to the mobile-optimized pages if they click on a link while they are on one of those types of phones. In this scenario, you will need two mobile-specific subdomains or subdirectories. I recommend using ‘touch.’ or /’touch’ for the touch-screen pages, and ‘m.’ or /m’ for the mobile-optimized pages.Always include links between the mobile site and the traditional site in the upper left hand corner of the page. All sets of pages should have a handheld stylesheet to control mobile rendering - This is in case the user-agent detection and redirection fails, or if the user clicks the link to see the traditional site from their mobile phone. User-agent detection and redirection should also be in-place to automatically deliver people on traditional computers who click on either version of the mobile pages to the traditional version of the page instead. It can also be used to send FeaturePhone or SmartPhone users to the version of the site that is best suited for their phone. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Mobile SERPS & Usability"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Mobile SERPS & Usability"
    },
    {
      "level": "H2",
      "text": "All One Index Soon?"
    },
    {
      "level": "H2",
      "text": "Different Indexes for Smart Phones and Feature Phones"
    },
    {
      "level": "H2",
      "text": "Mobile-Friendly Signals for the Search Engines"
    },
    {
      "level": "H2",
      "text": "Mobile Usability Options:"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Turn Marketing Into Meaningful Relationships — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Catering to User Behavior Shifts During Times of Economic Turbulence — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Close More Sales With Emotion-Driven SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Cindy Krum\n          \n            Cindy Krum\n          \n            Cindy Krum"
}