{
  "url": "https://moz.com/blog/mobile-seo-process",
  "slug": "mobile-seo-process",
  "title": "Mobilize Your SEO: Making the Most Out of the Mobile Search Opportunity - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "How's your mobile SEO? In today's post, Aleyda Solis offers a supplement to her Mozinar and answers your questions on the mobile SEO process.",
  "content": "Mobilize Your SEO: Making the Most Out of the Mobile Search Opportunity Mobile SEO By: Aleyda Solis February 20, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Aleyda Solis February 20, 2013 Mobilize Your SEO: Making the Most Out of the Mobile Search Opportunity Mobile SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Last week, I had the opportunity to give a Mozinar on the different steps and activities involved in a Mobile SEO process, from the initial research, analysis, and decision making, to the development, optimization, and measurement. I outlined the following phases: The Mozinar covers the different phases of the Mobile SEO process, along with the different aspects and criteria to consider to make the best decision according to your own online characteristics and capacity, from a business, audience, content, and technical perspective. If you didn't attend, you can watch the recorded Mozinar or take a look at the slides below. Audience Q&A As a supplement to the Mozinar, I tried to answer as many audience questions as possible. Enjoy! 1. Does ranking well on desktop SEO translate or help with ranking well on mobile SEO? Yes, if the desktop site also takes the most important aspects that you need to prioritize in mobile search into consideration. For example, a site that's already featuring a responsive web design approach, not necessarily because of mobile reasons and without an \"active\" mobile SEO process. Nonetheless, you might also have a situation where a highly authoritative desktop site doesn't feature the specific keywords that are used by its mobile search audience. For example, the site might end up not ranking so well and losing the opportunity to maximize its mobile search presence, traffic, and conversions. 2. How does one optimize mobile search keywords with multiple locations on a mobile site? You will need to enable an internal mobile site architecture that specifically targets these type of keywords, with internal pages that would be the ones to be optimized to rank for them. 3. Do you still need link building for a parallel mobile site? For a parallel mobile site approach, Google specifies the following when describing the importance of rel=alternate/canonical attributes: \"When you use different URLs to serve the same content in different formats, the annotation tells Google's algorithms that those two URLs have equivalent content and should be treated as one entity instead of two entities. If they are treated separately, both desktop and mobile URLs are shown in desktop search results, and their positions may be lower than they would otherwise be.\" This means that you won't \"need\" to build links additionally to the specific mobile URLs since they will be considered as one entity along their desktop versions. Nonetheless, since you might also have mobile URLs that don't refer to desktop ones, you might also want to \"promote\" them to earn popularity by their own. 4. Can a mobile emulator be used to see HTTP redirects? You can use a web sniffer using the desired user agent to verify HTTP redirects. 5. Why you shouldn't block CSS and JS in a Responsive Web Design Approach? Google needs to crawl pages assets (CSS, Javascript, images) as specified here to be able to identify that a site is using responsive web design approach. 6. If I've implemented redirects to keep mobile users out of my desktop-ready site, but then I offer mobile users a link to view my full site, how can I keep them from being redirected back to the mobile version? You need to use cookies when you link to the alternative URL version. For example, link to your desktop version from a mobile URL by adding a cookie informing that the desktop is the preferred version for that user. 7. Common practices with responsive web design involve hiding page elements or changing them depending on screen resolution using CSS/JS. What is the prevailing consensus on doing that with respect to SEO? As Google explains here, they're able to detect if a responsive web design approach is followed by a site and the reason behind hiding some elements from users. Responsive web design is, in fact, Google's recommended configuration for smartphone-optimized websites. 8. How does Google feel about serving different content based on user agent? As long as you correctly detect user agents and serve the same content to both devices and Googlebot (for example, the same content to both mobile users and Googlebot mobile), it shouldn't be a problem as it's specified by Google here and here. The issue comes when you don't correctly detect and might end up doing cloaking, showing different content to users and search bots. 9. Is there a character limit to mobile titles? The limit before titles are truncated in mobile search results are around 45 characters. Nonetheless, it's best to verify directly how your own specific website titles are shown, as described from slides 50 to 53 in the presentation. 10. Is it necessary to use \"m\" subdomain for a mobile site? What are advantages of using \"m\"? Is not \"necessary,\" but from my experience, it is the \"cleanest\" approach from a URL structure perspective. It keeps it short, user-friendly, and easier to refer to desktop URLs versions, and you can easily track the specific mobile site activity by filtering the subdomain traffic. This can be trickier with an /m/ subdirectory, besides the fact that you're adding an unnecessary extra level of depth to the URL. 11. How do you incorporate your app into your SEO mobile strategy? When someone arrives to your landing page, should you pop up to use app instead? It's not recommended to implement \"App Interstitials\" as John Mueller explains here, since you might likely also be blocking Googlebot. A relevant and also non-intrusive approach is to \"suggest\" users to download or open their app, as Airbnb and Yelp do: 12. What is the best tool to use for using mobile searches on desktop for reviewing and testing? For Firefox, I recommend the User Agent Switcher add-on, and the Ultimate User Agent Switcher extension for Chrome. 13. If your mobile site use a separate URL versions do you need to have a separate Google Analytics tracking code installed on the mobile version? You can still using your present Google Analytics code but configure it to show the full hostname (as described in slides 159 and 160) and create a specific profile for the Mobile subdomain to follow-up more easily. The Question Guide to My Mobile SEO Presentation As a guide to the presentation, I've outlined a list of all the audience questions I received, organized by topic. Hopefully this allows you to get the most out of the Mozinar possible, and answers your questions about the mobile SEO process! A Mobile Search Industry Overview Why is mobile search Important? Slides 2-3 How Google targets mobile search? Slides 4-5 Why is mobile optimization needed? Slides 6-8 Which are the Google recommendations to develop mobile optimized websites? Slides 9-10 Why you need mobile SEO recommendations? Slide 11 Mobile Research and Analysis What's your current mobile traffic and conversions volume and trend? Slides 20-22 What's the volume and trend of your mobile traffic and conversions compared to your mobile organic, desktop, and desktop organic traffic and conversions? Slide 23 Which mobile devices are used by your visitors? Slides 24-25 What's the volume and trend of the mobile devices used by your mobile visitors compared to your mobile organic, desktop, and desktop organic visitors? Slide 26 Which are the keywords and pages used by your organic mobile visitors? Slides 27-28 How do your mobile keywords and pages perform compared to those used by your organic desktop visitors? Slide 29 How is your site displayed in mobile devices? Slides 31-34 Which are the queries and pages giving mobile search visibility to your present site? Slides 36-39 How do your mobile search queries and pages perform compared to your desktop ones? Slide 40 Is Google having issues to crawl your site for mobile? Slides 41-42 How does Googlebot mobile fetch your pages? Slides 43-44 How does Googlebot mobile crawls your site? Slides 45-49 How are your pages shown in mobile and tablet search results? Slides 50-52 How do your pages titles, descriptions, URLs, and competitors in mobile and tablet search results, compared to your pages in desktop search results? Slide 53 What are the authority and links of your mobile ranking pages? Slides 54-56 How are your domain and page authority and links compared to your mobile ranking competitors? Slides 57-61 Which are volumes and trends of the keywords used by your organic mobile search audience? Slides 65-68 What's the mobile organic search volume potential of the keywords used by your present mobile visitors? Slide 69 What's the mobile organic search volume potential for your site? Slides 71-74 Develop your Mobile Web Which are the different mobile architecture alternatives? Slide 78 Which is the most suitable mobile architecture in your situation? Slides 79-80 General Mobile SEO Recommendations How can you optimize your mobile website speed? Slides 83-85 Why is speed important for your mobile site? Slide 86 Which are the Google recommendations for mobile speed optimization? Slides 87-88 How should you optimize your mobile content? Slides 89-90 Which are the structural elements of your Mobile site you need to optimize? Slides 91-93 Which elements should I validate in the mobile search results? Slide 94 How can you increase your mobile search visibility with rich snippets? Slides 95-96 How can you increase your mobile search visibility if you're a local business? Slides 97-98 Which aspects you need to take into consideration to optimize your mobile Interface? Slides 99-100 Mobile SEO with Responsive Web Design What's responsive web design? Slides 103-105 How to verify if a site is responsive? Slide 106 How Google recommends responsive web design for smartphone optimized sites? Slide 108 Which are the recommendations that Google gives for responsive web design? Slides 109-110 Which are the responsive web design pros and cons towards mobile SEO? Slide 111 In which situation responsive web design is recommended for your mobile site? Slide 112 How can you more easily implement responsive web design? Slides 113-116 Which elements you should not block so Google can identify a web is responsive? Slide 118 How Google recommends to use Javascript for responsive web design? Slides 119-120 Why is speed and visualization additionally important for responsive mobile sites? Slides 121-122 Which websites are using responsive web design for a mobile approach? Slides 123-124 Mobile SEO with Dynamic Serving What's dynamic serving? Slides 127-129 How to verify if a site is dynamically serving its content? Slides 129-130 Which are the dynamic serving pros and cons towards mobile SEO? Slide 131 In which situation responsive dynamic serving is recommended for your mobile site? Slide 132 How should you do user agent detection for dynamic serving? Slides 133-134 How do you avoid doing cloaking in a dynamic serving environment? Slides 135-136 Which websites are using dynamic serving for a mobile approach? Slides 137-138 Mobile SEO with Parallel Mobile Sites What's a parallel mobile site? Slides 141-143 How to verify if a site is effectively implementing a parallel mobile approach? Slides 144-146 Which are the parallel mobile sites pros and cons towards mobile SEO? Slide 147 In which situation parallel mobile sites are recommended? Slide 148 How should you structure the URLs of your parallel mobile site? Slides 149-151 How do you implement redirects in a parallel mobile site? Slides 152-153 Which annotations should you include to refer a parallel mobile pages to their desktop version and vice versa? Slides 154-155 Which annotations should you include in your desktop sitemap to refer to its parallel mobile version? Slides 156-157 How do you allow your users to browse between the mobile and desktop versions? Slide 158 How do you effectively track the analytics activity of your parallel mobile site? Slides 159-160 Which websites are using a parallel mobile site? Slides 161-162 Measure and Evolve Your Mobile SEO Process How can you reclaim your lost iOS 6 Safari search traffic mobile ? Slides 165-166 Which metrics should you follow up from your mobile SEO traffic? Slide 167 How to identify if your mobile SEO process is successful? Slide 168 When is the time to go for a mobile app? Slides 169-174 If you're interested in following up with more mobile SEO news, you can also follow MobileMoxie in Twitter, read Bryson Meunier's Mobile column in Search Engine Land, and join the Google+ Mobile SEO community. Is there any other mobile SEO related question that's not addressed here? Let me know in the comments! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Mobilize Your SEO: Making the Most Out of the Mobile Search Opportunity"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Mobilize Your SEO: Making the Most Out of the Mobile Search Opportunity"
    },
    {
      "level": "H2",
      "text": "Audience Q&A"
    },
    {
      "level": "H2",
      "text": "The Question Guide to My Mobile SEO Presentation"
    },
    {
      "level": "H2",
      "text": "A Mobile Search Industry Overview"
    },
    {
      "level": "H2",
      "text": "Mobile Research and Analysis"
    },
    {
      "level": "H2",
      "text": "Develop your Mobile Web"
    },
    {
      "level": "H2",
      "text": "General Mobile SEO Recommendations"
    },
    {
      "level": "H2",
      "text": "Mobile SEO with Responsive Web Design"
    },
    {
      "level": "H2",
      "text": "Mobile SEO with Dynamic Serving"
    },
    {
      "level": "H2",
      "text": "Mobile SEO with Parallel Mobile Sites"
    },
    {
      "level": "H2",
      "text": "Measure and Evolve Your Mobile SEO Process"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too"
    },
    {
      "level": "H3",
      "text": "Internal Linking for Mobile-First & Mobile-Only Indexing"
    },
    {
      "level": "H3",
      "text": "All About Fraggles (Fragment + Handle)"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Aleyda Solis\n          \n            Aleyda Solis\n          \n            Aleyda Solis"
}