{
  "url": "https://moz.com/blog/mobile-strategy-for-small-businesses",
  "slug": "mobile-strategy-for-small-businesses",
  "title": "Mobile Strategy for Small Businesses - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For a small business on a tight budget, a mobile strategy may seem like a costly extra. This post covers why SMEs should care about mobile, and what they can do about it (even on a small-business budget). This is a tactics- and resource-heavy post, designed to provide tools to begin working right…",
  "content": "Mobile Strategy for Small Businesses Local SEO By: Bridget Randolph October 7, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Bridget Randolph October 7, 2013 Mobile Strategy for Small Businesses Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Editor's note: Due to the age of this post, referenced statistics may not reflect current data. In the interim, Google's promise of a mobile-first index has only increased the necessity of a mobile strategy for businesses of all sizes. Happy reading! Note: This post is based on a presentation I recently gave at BrightonSEO. In writing up the blog post, I've expanded on some of the points and included more statistics. If you're interested in viewing the presentation slides, I've embedded the deck at the end of the post. ------- Mobile is huge. I don't think any of us would dispute this, but in case you're not convinced, here's a fun fact: In 2012, the global Internet usage from mobile devices was 12x the amount of data that was used for the entire internet in the year 2000. A few more stats: 25% of UK consumers have made a purchase using their mobile device 69% of tablet owners make a purchase on their device every month 77% of smartphone users have researched a product or service on their phone, with about half then purchasing the item in-store and mobile accounts for 31% of site traffic on average in the UK I think everyone can agree that businesses need to be mobile-friendly. The problem The problem is that people are doing it wrong. Even big brands are making very basic mistakes. For example: Forbes inflicts an interstitial pop-up ad every time someone visits its site (although to be fair, they do this to desktop users as well, so they're just doing it wrong all around). The New York Times has a mobile site, but fails to automatically redirect its mobile visitors, forcing you to opt in: Starbucks took the trouble to design a beautiful responsive website, with lovely big call-to-action buttons: But when viewed on a smartphone, the CTA disappears below endless reviews (which on the desktop version are collapsed on load): Worse still, some companies haven't bothered to do anything. Including Apple. In fact, only 70% of the top 20 UK retailers even have a mobile-friendly website. And when it seems that even the biggest brands are struggling, how can a small business compete? Small businesses, unsurprisingly, are even less likely to have a mobile-friendly web presence. Only 60% of small businesses even have a website, and of those that do, only half (so roughly 30% of all small businesses) are mobile-friendly. Why so few? Well, I believe there are two reasons: 1) They don't see the value. But it's easy enough to show the value of mobile marketing and a mobile-friendly web presence. You only have to look at the stats I mentioned earlier, and many, many more which have similar messages. For instance, that 84% of small businesses saw an increase in new business due to mobile marketing efforts. So the second reason seems more likely: 2) They do see the value, but they don't know where to start. That's where I come in. In this post, I will cover the three main phases of getting started with mobile: Creating a mobile-friendly website (or making your existing site mobile-friendly) Search and discovery: making it easy for mobile users to find you Reaching your customers where they are so they don't even need to be actively looking Let's get started. Phase 1: mobile-friendly website Your website is the most basic element of your online presence. It's where your customers primarily interact with you. And so it's crucial to make it accessible to all your visitors, not just desktop users. Quick Stat: 61% of mobile users who land on a non-mobile-friendly site will leave and go to a competitor's site. There are three main approaches you can take to creating a mobile-friendly website. Responsive design: keeps a single URL, and all the content/HTML, and simply uses different CSS to rearrange elements on a page to fit different screen sizes. Dynamic serving (also known asadaptive design or RESS): keeps a single URL, but serves different content (HTML) based on the visitor's user agent. Separate mobile site (e.g.m.domain.comor www.domain.com/m): a completely separate site, with different URLs. None of these approaches is always the best, and your decision should be based on three things: your goals, your technical capabilities, and your users' needs. If you want more guidance on how to choose an approach, you can use the flowchart I created with Kristina Kledzik for Distilled's best practice guide Building Your Mobile-Friendly Website, or check out Aleyda Solis's post on State of Search, and also her resources page. Each business is different, and you need to carefully consider your options when making this decision. However, for a small business with a small website (and a small budget), I'd usually recommend using a responsive template with a CMS like WordPress. This doesn't have to break the bank; you can get all of these themes for under $100: Designfolio (from PressCoders): free, or $79 with support licence Standard: $49 or $99 with support licence Responsive (from CyberChimps): free For more options, check out these premium WordPress theme providers: Elegant Themes: ~$40/year with full support. WooThemes: free-$70. And if you don't want to use WordPress, check out: SquareSpace: from $8/month(for the most basic service). Wix: around $10/month. If this still sounds too expensive, then start saving now; it is easily worth this cost. In the meantime, if you do nothing else, make sure you have a Facebook and Google+ page (editor's note: now called a \"Google My Business listing\") for your business, because they're mobile-friendly already. There's one final point to remember: A mobile-friendly website is NOT a strategy. It's just a starting point. It means you're ready for... Phase 2: search and discovery At this stage, you've got a mobile-friendly website, and you want to make sure that people find it. There are three areas/tactics to focus on for this phase: Mobile SEO Local search Social media Mobile SEO If you have a responsive design, mobile SEO is easy; you don't have to do anything extra. That's because the HTML stays the same regardless of what type of device is used. If you're using dynamic serving, you don't need to do too much; just make sure you've set a Vary HTTP - User Agent header. This will indicate to Google that you serve different content based on a visitor's user agent. If you have a separate mobile site with different URLs to your desktop site, it's a bit more involved (you're basically doing SEO for another site, as well as indicating to Google that it'sa mobile version and not just duplicate content). I wrote another post here on Moz all about how to optimize a separate mobile site. Local search Once you've optimized your mobile site, it's time to think about other types of search results. If your business has a physical location and/or a location-based service area (for example, a plumber who goes to customers' houses would have a 'service area' which only covers a certain geographical radius), you should be thinking about local search. Local search is valuable for desktop results, and even more important on a small mobile device because of the very limited screen real estate. You can see highlighted in this screenshot how far below the fold the first non-local result appears: There are several factors for local search rankings, and I don't have space to delve in too deeply here, but the rapid-fire overview is: On-page optimization for location (using location-based keywords in your on-page content) Local business directory listings: Google+ Local (editor's note: now called a \"Google My Business listing\") is the big one here, but there are several others, including Yahoo! Local, Bing Local, Yelp, Merchant Circle, Angie’s List, Judy’s Book, and Kudzu Note: Google+ Local isn't the same as Google+ (yet!): You should have a Google+ Local page and a Google+ profile page which you can then merge Local link-building: seeking links from local sites (e.g. local news sites, local government sites, local blogs, etc.) \"NAP\" citations: like links for local SEO. NAP simply refers to anywhere on the web where your business is mentioned with its Name, Address, and Phone Number. The key with these is consistency; this signals that they all refer to the same business. Protip: use Whitespark's Local Citation Finder tool (from $20/month) images: of your storefront/store interior and your products. By including these images in your Google+ Local profile, they can show up in the Google Maps search results. Structured data: Schema.org: /Place and /LocalBusiness hCard markup KML file for GoogleMaps Social profiles: Google+ Facebook Reviews and recommendations: the most important here are Yelp and Google+ Local. Others include TripAdvisor, Yahoo! Local, Foursquare, and Zagat for restaurants For a great local SEO resource, check out David Mihm's report on Local Search Ranking Factors 2013. He provides a lot more detail about the factors that go into local rankings. I also wrote a post over on the Distilled blog about optimizing for mobile-local search. Does it work? Case Study: Coffee Corner, a coffee shop in Headcorn, UK, worked with agency Target Local to implement a responsive site and local search optimization. Gareth Brown, the agency's founder, said, We managed to get them to the top of page 1 within 6 weeks, which took their search traffic from 100 to just under 300 visitors per month. ...They're also seeing visitors coming from their Yelp profile. Now, 300 visitors/month may not sound like a lot...but effectively, their monthly traffic tripled. That's a pretty good result! Social media Now, I've mentioned social media already, as a temporary stopgap for a mobile website and as a factor for local search. But it's also a marketing channel in its own right. And while it's not an exclusively mobile platform, 80% of people who access Facebook daily do so on a mobile device. Twitter has a similar percentage of daily mobile users. So social media is a great way for mobile users to find and interact with you, if you do it right. First, remember: It's about conversation, not broadcast. A small business doing this really well on Twitter is The Dolphin Pub. Second, use the \"dinner party test:\" If you wouldn't say it to someone you met at a dinner party, don't say it on social media. Finally, if you're worried about not knowing what to say, you can make a content plan and an editorial calendar for your social accounts, just like you do for blogging (and you can promote your blog posts via social media!). Now, all of those tips are just as useful for social media users on desktop as for those on mobile, so here's a mobile-specific tip: Make sure that the content you share via social media is mobile-friendly. If four out of five people access it on a mobile device and it doesn't show up properly, or crashes their browser, they probably won't share it. Make it look amazing for mobile visitors! So, now you've got a mobile-friendly website, and you've made it easy for mobile users to find you. Now what? Now the fun part. Phase 3: reaching your customers where they are In this phase, you can reach out to your customers where they are, instead of waiting for them to come to you. I'm going to look now at a few ways you can bypass the search process altogether: Apps Exclusive mobile content Email marketing Apps Do you need an app? ...probably not. But: if your business model relies on frequent return visits, it may be worth investing in one. This is because an app sits on the home screen of a mobile device, and therefore enables the user to access it directly without using search engines or needing to type in a URL. There are 2 types of app: Native app (iOS, Android, etc) Web app (HTML5 - effectively a website skinned to look like an app and be accessible from the home screen) As you can see, there are pros and cons to each. Generally speaking, a native app provides a more tailored, faster experience but is more expensive both to develop and to maintain. A web app is cheaper and easier to maintain, but also less customized to the individual operating system and usually has little or no support available via app stores. An app is not for everyone, and it's also worth noting here that the Apple app store currently has around 775,000 apps listed. So even with app store support, it's hard to get noticed unless it's a really good product. But if you think this is something that could work for your business model, here are some fairly inexpensive tools and services to help you build an app: Bizness Apps: from $59/month (native apps) ViziApps: starts from £29/month (web app) or £99/month for (native app) AppMakr: free native Android app (with ads), or for $9/month native iPhone and Android apps (no ads). Premium option: $99 one-time fee for white-label version. RedFoundry: contact for a quote Apps can also come in handy for producing content, Exclusive mobile content This one's a bit tricky to describe, because really it could be anything. Be creative with it! Let's imagine a coffee shop that has a loyalty program with a stamp card: buy nine coffees, get the 10th free. They could create a loyalty app, offering people virtual \"stamps\" on their mobiles, instead of needing to cart around a paper loyalty card. Then, when people with the loyalty app were nearby, the coffee shop could use geotargeting to send push notifications with a special offer: \"We noticed you're nearby! Come in for a coffee and get an extra stamp.\" They could also provide exclusive offers more generally to their mobile visitors; for example, \"thanks for using our app! To say thank you, here's a code for 20% off your next coffee.\" A great real-world example of good exclusive mobile content is Chase Bank, which allows mobile users to take a photo of a check with their smartphone and deposit it into their account electronically. What's great about this example is that it uses mobile device-specific functionality—in this case, the camera on a smartphone. If you're not sure you need an app, there's also an easy hack for providing exclusive content to mobile customers: Use check-in and coupon services like Foursquare, Facebook, and Groupon. Using the example of our coffee shop again: If they wanted to go this route instead of creating an app, they could incentivize checking in with special discounts and offers. \"Check in at our coffee shop on Foursquare, and next time we see you we'll give you 10% off your order!\" The added benefit of this approach is that it gives your business online visibility and social proof, as opposed to an app, which is effectively a \"walled garden.\" Bonus tip: This one's not strictly \"mobile-only,\" but social media competitions are another great way to reach a mobile audience since (as we've seen) the majority of regular social network users access these networks via mobile devices. Email marketing This one's pretty basic. If you do email marketing, make sure you're using mobile-friendly email templates. 79% of smartphone owners use their smartphone for reading email. This is a higher percentage than those who use their phone to make phone calls. Stop and think about that for a minute. Your emails need to be mobile-friendly. Here are a couple of fairly inexpensive email providers with mobile-friendly templates: MailChimp: from ~$10/month Campaign Monitor: from $10/month or $5/campaign If you don't want to use their full service, sign up anyway. You can use them to build your email and then export the HTML to your preferred provider (of course, if that provider already has mobile-friendly templates, so much the better!). Finally, a bonus tip: provide in-store wifi and you can collect customer data such as email addresses, or (quick!) survey answers. This isn't as intimidating to set up as it sounds. MyPlaceConnect in the UK (mostly) and LessNetworks in the US are two providers that I've come across who offer this service to small businesses. Wrap up Now, whether or not you decide to do ALL these things, there are a few important things to remember: Mobile is HUGE, and you need a mobile strategy. So start with a mobile-friendly website, and build up from there. It's easier than you think! Here's the slide deck from the BrightonSEO presentation: Do you own or work with a small business? Got any mobile tips, tactics, or resources to add to the list? I'd love to hear your thoughts in the comments! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Mobile Strategy for Small Businesses"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Mobile Strategy for Small Businesses"
    },
    {
      "level": "H2",
      "text": "The problem"
    },
    {
      "level": "H3",
      "text": "Why so few?"
    },
    {
      "level": "H2",
      "text": "Phase 1: mobile-friendly website"
    },
    {
      "level": "H2",
      "text": "Phase 2: search and discovery"
    },
    {
      "level": "H3",
      "text": "Mobile SEO"
    },
    {
      "level": "H3",
      "text": "Local search"
    },
    {
      "level": "H3",
      "text": "Social media"
    },
    {
      "level": "H2",
      "text": "Phase 3: reaching your customers where they are"
    },
    {
      "level": "H3",
      "text": "Apps"
    },
    {
      "level": "H3",
      "text": "Exclusive mobile content"
    },
    {
      "level": "H3",
      "text": "Email marketing"
    },
    {
      "level": "H2",
      "text": "Wrap up"
    },
    {
      "level": "H4",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Bridget Randolph\n          \n            Bridget Randolph\n          \n            Bridget Randolph"
}