{
  "url": "https://moz.com/blog/monday-morning-seo-quarterback",
  "slug": "monday-morning-seo-quarterback",
  "title": "Monday Morning SEO Quarterback - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There's a lot in the SEO blogosphere worthy of reading today, and although I'm not usually one to post a roundup, it feels appropriate so, without further ado:\nAaron's going crazy, posting like a madman this morning/afternoon on topics from political blog link-baiting to ...",
  "content": "Monday Morning SEO Quarterback Public Relations By: Rand Fishkin December 19, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 19, 2005 Monday Morning SEO Quarterback Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. There's a lot in the SEO blogosphere worthy of reading today, and although I'm not usually one to post a roundup, it feels appropriate so, without further ado: Aaron's going crazy, posting like a madman this morning/afternoon on topics from political blog link-baiting to bad landing pages for SEOmoz's advertisers to the value of attending conferences. Threadwatch is posting about the possible impending death of the view bids tool at Overture - say it ain't so! They're also covering the invasion of Wikipedia content in the Google SERPs and speculating if this forebodes what's to come with the AOL deal. Jim's ripping apart Google's webmaster guidelines (in style). Donna's looking into the crystal ball for 2006 and her predictions are fantastic. Rob Sullivan is at Search Engine Journal, looking into Google's application of quality guidelines and wondering if it will cross the border between paid and organic results. Lots of good stuff for what should be such a slow week. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Monday Morning SEO Quarterback"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Monday Morning SEO Quarterback"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}