{
  "url": "https://moz.com/blog/moneyball-and-the-search-marketer",
  "slug": "moneyball-and-the-search-marketer",
  "title": "Moneyball and the Search Marketer - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In his book “Moneyball,” Michael Lewis explains the working of Billy Beane, general manager of the Oakland As and his role as an asset manager.  Unlike the NFL, in which teams share television revenue and stick to overall salary caps, major league baseball allows teams to fend for themselves.  As a…",
  "content": "Moneyball and the Search Marketer SEO Analytics D By: Dan Crean December 19, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! D By: Dan Crean December 19, 2008 Moneyball and the Search Marketer SEO Analytics This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. In his book “Moneyball,” Michael Lewis explains the working of Billy Beane, general manager of the Oakland As and his role as an asset manager. Unlike the NFL, in which teams share television revenue and stick to overall salary caps, major league baseball allows teams to fend for themselves. As a result the big market teams (e.g., the New York Yankees) have more money to acquire top players and assemble a winning team. Managers of teams with smaller budgets, like Beane, have to be smarter in selecting lower paid players. Lewis admires Beane’s use of hard numbers in evaluating players and identifying underpaid ones. Baseball has always been a statistic-rich sport, but in recent decades enthusiasts have developed statistics to a new level. Led by the founder of “sabermetrics” Bill James, these number crunchers decided traditional metrics of batting average, home runs, and runs batted in were not effective measures of a player’s value. These guys preferred more esoteric stats like slugging percentage and on-base percentage, and they even made up their own statistics. Soon the number crunchers were disputing the conventional baseball wisdom. Some players were overvalued by conventional wisdom and metrics, while others were undervalued. Billy Beane was a baseball insider who took the sabermetricians’ findings to heart and used them. Beane made decisions more by statistics than by how a player looked or what a scout thought about him. He was able to find good players who cost less than recognized under conventional wisdom. And it worked. Beane was able to compete with a substantially lower budget than other teams. Buying advertising on the web is like buying baseball players. Competitors may bid up prices to unreasonable levels. Why? Because these competitors think certain keywords are worth paying for, just like the old style baseball wisdom held that certain stars were worth paying the big bucks for. That’s why when you’re buying advertising; you need to be like Billy Beane. You don’t just buy words at high prices because you have some vague feeling they might be worth it. You need to look at the numbers. That’s why it is critical that everyone who is serious about advertising on the internet use a tracking system. You must track your clicks and you must calculate the cost per sale/conversion/action by source and by source and keyword. Just guessing isn’t good enough in a competitive environment. Advertisers should see themselves as asset managers, not just buyers of a service. The advertiser needs to continually ask: what is undervalued, where are the bargains? What is overvalued? What is fairly valued? How can I rearrange my budget to get the most out of it? It’s easy to implement a tracking system today so pretty much every serious website has one, but you have to identify and use the right metrics for your business and website. You need to apply some energy and thinking and take the results of your tracking system and actually do something with them. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Moneyball and the Search Marketer"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Moneyball and the Search Marketer"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dan Crean\n          \n            Dan Crean"
}