{
  "url": "https://moz.com/blog/more-seomoz-stats-than-you-can-shake-a-stick-at",
  "slug": "more-seomoz-stats-than-you-can-shake-a-stick-at",
  "title": "More SEOmoz Stats than You Can Shake a Stick At - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I've had more than a few people tell me they really missed our old advertising page, not because we sold any ads, but because our monthly traffic, search and referral stats were always there and relatively frequently updated. As consolation (and since I always did intend to keep SEOmoz's stats as…",
  "content": "More SEOmoz Stats than You Can Shake a Stick At SEO Analytics By: Rand Fishkin May 3, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 3, 2007 More SEOmoz Stats than You Can Shake a Stick At SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I've had more than a few people tell me they really missed our old advertising page, not because we sold any ads, but because our monthly traffic, search and referral stats were always there and relatively frequently updated. As consolation (and since I always did intend to keep SEOmoz's stats as public as possible), here's an exhaustive roundup of important analytics data (from Indextools) for the first 4 months of the year (old 2006 stats to compare are here): Daily Unique Visitors: January - 165,568 February - 268,444 March - 237,496 April - 230,909 Referring Domains: Referring Search Phrases: Search Engine Referrers: Most Popular Pages: Page Strength Tool Keyword Difficulty Tool Home Page Blog IP 2 Location Tool Web 2.0 Awards 15 CSS Properties You Never Use (But Perhaps Should) Google Search Engine Ranking Factors Put Your Best Foot Forward: 19 Gorgeous Website Footers SEO Tools Feedburner Stats: Overall, I'm pretty unimpressed and unhappy with our stats. We haven't grown at nearly the rate we did last year during the same time period, and while SEOmoz remains somewhat popular in the world of search marketing, our referring domain stats shows me we've yet to break out of that market at all. From a search perspective, the encouraging stat is that our switch over to static, semantic URLs in late February resulted in a 15% bump in the amount of search traffic we receive. Sadly, we've done no keyword research, nor made any concerted effort to focus on driving search visitors to the site. If we were our own client, I'd say we ranked somewhere between barely acceptable and getting by. I think that if we can improve the conversion rates of our premium content, we'll be able to take some more time away from client projects to focus on SEO for SEOmoz.org, which is something I've been wanting to do for years. On the external stats frontier, things aren't particularly positive, either. Google reports that we have ~350,000 unique external links (that number was much larger two weeks ago, oddly) while Yahoo! reports 466,466 (fairly steady from January when we had . We've steadily moved down Technorati's most popular blog list from a high of 103 (in February) to 137 today (with 21,393 links from 4,221 blogs). The latest PageRank update saw us stay at a PR7, but that's now spread to our blog page and several others, which is encouraging. The best news by far has certainly been the success of YOUmoz - it's not only got a few hundred RSS subscribers, it's also pulling in search traffic and links (and real readers and commenters). I've been very happy with the quality, and while I wish there was more high level writing submitted that we could promote to the blog, I really can't complain - it's one of the most active communities of its kind in the search world, and all the more impressive because it's in such a small niche. Perhaps I'll be cheered up a bit if we can win a Blogger's Choice Awards. We're nominated in three categories: Best Corporate Blog Best Blog Design Best Marketing Blog If you're feeling generous, perhaps you could hop over there and give us a vote in one (or all) of those categories. Of course, only do so if you really believe we deserve it. there's lots of other nominees in each category, so vote with your gut - I think, for example, that Brian Clark should win \"the Blogitizer\" - for \"best writing on a blog\". p.s. The Blogger's Choice makes you jump through WAY WAY too many hoops to sign up and vote - it's actually almost ridiculous. No wonder they're getting so few votes on most blogs... terrible execution people, just awful. p.p.s. Jason Calcanis - you're welcome, Michael :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "More SEOmoz Stats than You Can Shake a Stick At"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "More SEOmoz Stats than You Can Shake a Stick At"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}