{
  "url": "https://moz.com/blog/most-important-link-penalty-removal-tool-your-mindset",
  "slug": "most-important-link-penalty-removal-tool-your-mindset",
  "title": "The Most Important Link Penalty Removal Tool: Your Mindset - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "What's the most important part of recovering from a Google link penalty? It's in your mindset and approach. Grab your cleaver, and learn how to get your mindset to work for you.",
  "content": "The Most Important Link Penalty Removal Tool: Your Mindset Link Building By: Eric Enge March 5, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Eric Enge March 5, 2015 The Most Important Link Penalty Removal Tool: Your Mindset Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Let's face it. Getting slapped by a manual link penalty, or by the Penguin algorithm, really stinks. Once this has happened to you, your business is in a world of hurt. Worse still is the fact that you can't get clear information from Google on which of your links are the bad ones. In today's post, I am going to focus on the number one reason why people fail to get out from under these types of problems, and how to improve your chances of success. The mindset Success begins, continues, and ends with the right mindset. A large percentage of people I see who go through a link cleanup process are not aggressive enough about cleaning up their links. They worry about preserving some of that hard-won link juice they obtained over the years. You have to start by understanding what a link cleanup process looks like, and just how long it can take. Some of the people I have spoken with have gone through a process like this one: In this fictitious timeline example, we see someone who spends four months working on trying to recover, and at the end of it all, they have not been successful. A lot of time and money have been spent, and they have nothing to show for it. Then, the people at Google get frustrated and send them a message that basically tells them they are not getting it. At this point, they have no idea when they will be able to recover. The result is that the complete process might end up taking six months or more. In contrast, imagine someone who is far more aggressive in removing and disavowing links. They are so aggressive that 20 percent of the links they cut out are actually ones that Google has not currently judged as being bad. They also start on March 9, and by April 30, the penalty has been lifted on their site. Now they can begin rebuilding their business, five or months sooner than the person who does not take as aggressive an approach. Yes, they cut out some links that Google was not currently penalizing, but this is a small price to pay for getting your penalty cleared five months sooner. In addition, using our mindset-based approach, the 20 percent of links we cut out were probably not links that were helping much anyway, and that Google might also take action on them in the future. Now that you understand the approach, it's time to make the commitment. You have to make the decision that you are going to do whatever it takes to get this done, and that getting it done means cutting hard and deep, because that's what will get you through it the fastest. Once you've got your head on straight about what it will take and have summoned the courage to go through with it, then and only then, you're ready to do the work. Now let's look at what that work entails. Obtaining link data We use four sources of data for links: Google Webmaster Tools Open Site Explorer Majestic SEO ahrefs You will want to pull in data from all four of these sources, get them into one list, and then dedupe them to create a master list. Focus only on followed links as well, as nofollowed links are not an issue. The overall process is shown here: One other simplification is also possible at this stage. Once you have obtained a list of the followed links, there is another thing you can do to dramatically simplify your life. You don't need to look at every single link. You do need to look at a small sampling of links from every domain that links to you. Chances are that this is a significantly smaller quantity of links to look at than all links. If a domain has 12 links to you, and you look at three of them, and any of those are bad, you will need to disavow the entire domain anyway. I take the time to emphasize this because I've seen people with more than 1 million inbound links from 10,000 linking domains. Evaluating 1 million individual links could take a lifetime. Looking at 10,000 domains is not small, but it's 100 times smaller than 1 million. But here is where the mindset comes in. Do examine every domain. This may be a grinding and brutal process, but there is no shortcut available here. What you don't look at will hurt you. The sooner you start on the entire list, the sooner you will get the job done. How to evaluate links Now that you have a list, you can get to work. This is a key part where having the right mindset is critical. The first part of the process is really quite simple. You need to eliminate each and every one of these types of links: Article directory links Links in forum comments, or their related profiles Links in blog comments, or their related profiles Links from countries where you don't operate/sell your products Links from link sharing schemes such as Link Wheels Any links you know were paid for Here is an example of a foreign language link that looks somewhat out of place: For the most part, you should also remove any links you have from web directories. Sure, if you have a link from DMOZ, Business.com, or BestofTheWeb.com, and the most important one or two directories dedicated to your market space, you can probably keep those. For a decade I have offered people a rule for these types of directories, which is \"no more than seven links from directories.\" Even the good ones carry little to no value, and the bad ones can definitely hurt you. So there is absolutely no win to be had running around getting links from a bunch of directories, and there is no win in trying to keep them during a link cleanup process. Note that I am NOT talking about local business directories such as Yelp, CityPages, YellowPages, SuperPages, etc. Those are a different class of directory that you don't need to worry about. But general purpose web directories are, generally speaking, a poison. Rich anchor text Rich anchor text has been the downfall of many a publisher. Here is one of my favorite examples ever of rich anchor text: The author wanted the link to say \"buy cars,\" but was too lazy to fit the two words into the same sentence! Of course, you may have many guest posts that you have written that are not nearly as obvious as this one. One great way to deal with that is to take your list of links that you built and sort them by URL and look at the overall mix of anchor text. You know it's a problem if it looks anything like this: The problem with the distribution in the above image is that the percentage of links that are non \"rich\" in nature is way too small. In the real world, most people don't conveniently link to you using one of your key money phrases. Some do, but it's normally a small percentage. Other types of bad links There is no way for me to cover every type of bad link in this post, but here are other types of links, or link scenarios, to be concerned about: If a large percentage of your links are coming from over on the right rail of sites, or in the footers of sites If there are sites that give you a site-wide link, or a very large number of links from one domain Links that come from sites whose IP address is identical in the A block, B block, and C block (read more about what these are here) Links from crappy sites The definition of a crappy site may seem subjective, but if a site has not been updated in a while, or its information is of poor quality, or it just seems to have no one who cares about it, you can probably consider it a crappy site. Remember our discussion on mindset. Your objective is to be harsh in cleaning up your links. In fact, the most important principle in evaluating links is this: If you can argue that it's a good link, it's NOT. You don't have to argue for good quality links. To put it another way, if they are not obviously good, then out they go! Quick case study anecdote: I know of someone who really took a major knife to their backlinks. They removed and/or disavowed every link they had that was below a Moz Domain Authority of 70. They did not even try to justify or keep any links with lower DA than that. It worked like a champ. The penalty was lifted. If you are willing to try a hyper-aggressive approach like this one, you can avoid all the work evaluating links I just outlined above. Just get the Domain Authority data for all the links pointing to your site and bring out the hatchet. No doubt that they ended up cutting out a large number of links that were perfectly fine, but their approach was way faster than doing the complete domain by domain analysis. Requesting link removals Why is it that we request link removals? Can't we just build a disavow file and submit that to Google? In my experience, for manual link penalties, the answer to this question is no, you can't. (Note: if you have been hit by Penguin, and not a manual link penalty, you may not need to request link removals.) Yes, disavowing a link is supposed to tell Google that you don't want to receive any PageRank, or benefit, from it. However, there is a human element at play here. Google likes to see that you put some effort into cleaning up the bad links that you have gotten that led to your penalty. The more bad links you have, the more important this becomes. This does make the process a lot more expensive to get through, but if you approach this with the \"whatever it takes\" mindset, you dive into the requesting link removal process and go ahead and get it done. I usually have people go through three rounds of requests asking people to remove links. This can be a very annoying process for those receiving your request, so you need to be aware of that. Don't start your email with a line like \"Your site is causing mine to be penalized ...\", as that's just plain offensive. I'd be honest, and tell them \"Hey, we've been hit by a penalty, and as part of our effort to recover we are trying to get many of the links we have gotten to our site removed. We don't know which sites are causing the problem, but we'd appreciate your help ...\" Note that some people will come back to you and ask for money to remove the link. Just ignore them, and put their domains in your disavow file. Once you are done with the overall removal requests, and had whatever success you have had, take the rest of the domains and disavow them. There is a complete guide to creating a disavow file here. The one incremental tip I would add is that you should nearly always disavow entire domains, not just the individual links you see. This is important because even with the four tools we used to get information on as many links as we could, we still only have a subset of the total links. For example, the tools may have only seen one link from a domain, but in fact you have five. If you disavow only the one link, you still have four problem links, and that will torpedo your reconsideration request. Disavowing the domain is a better-safe-than-sorry step you should take almost every time. As I illustrated at the beginning of this post, adding extra cleanup/reconsideration request loops is very expensive for your business. The overall process When all is said and done, the process looks something like this: If you run this process efficiently, and you don't try to cut corners, you might be able to get out from your penalty in a single pass through the process. If so, congratulations! What about tools? There are some fairly well-known tools that are designed to help you with the link cleanup process. These include Link Detox and Remove'em. In addition, at STC we have developed our own internal tool that we use with our clients. These tools can be useful in flagging some of your links, but they are not comprehensive—they will help identify some really obvious offenders, but the great majority of links you need to deal with and remove/disavow are not identified. Plan on investing substantial manual time and effort to do the heavy lifting of a comprehensive review of all your links. Remember the \"mindset.\" Summary As I write this post, I have this sense of being heartless because I outline an approach that is often grueling to execute. But consider it tough love. Recovering from link penalties is indeed brutal. In my experience, the winners are the ones who come with meat cleaver in hand, don't try to cut corners, and take on the full task from the very start, no matter how extensive an effort it may be. Does this type of process succeed? You bet. Here is an example of a traffic chart from a successful recovery: Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Most Important Link Penalty Removal Tool: Your Mindset"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Most Important Link Penalty Removal Tool: Your Mindset"
    },
    {
      "level": "H3",
      "text": "The mindset"
    },
    {
      "level": "H3",
      "text": "Obtaining link data"
    },
    {
      "level": "H3",
      "text": "How to evaluate links"
    },
    {
      "level": "H3",
      "text": "Rich anchor text"
    },
    {
      "level": "H3",
      "text": "Other types of bad links"
    },
    {
      "level": "H3",
      "text": "Requesting link removals"
    },
    {
      "level": "H3",
      "text": "The overall process"
    },
    {
      "level": "H3",
      "text": "What about tools?"
    },
    {
      "level": "H3",
      "text": "Summary"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Eric Enge\n          \n            Eric Enge"
}