{
  "url": "https://moz.com/blog/moz-content-q2-feature-updates",
  "slug": "moz-content-q2-feature-updates",
  "title": "Check It Out: Moz Content’s Q2 Feature Updates (Tons of New Stuff!) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Now that Q2 is nearing an end, we're sharing all the fancy updates we've made to Moz Content. If you haven't used it for content ideation and evaluation yet, now's the time to explore the new features and check it out!",
  "content": "Check It Out: Moz Content’s Q2 Feature Updates (Tons of New Stuff!) Content Marketing | Moz Tools | Moz News By: Tyler Murray June 13, 2016 Table of Contents Copied! By: Tyler Murray June 13, 2016 Check It Out: Moz Content’s Q2 Feature Updates (Tons of New Stuff!) Content Marketing | Moz Tools | Moz News Moz Content will be retired on November 21, 2016. After much deliberation, we arrived at the difficult decision to shift away from content marketing software back to our core of SEO. For more information, head here. It’s been a busy quarter for the Moz Content team, and we’re excited to share the results of our hard work! During the first few months after launch, we focused most of our energy on improving the Content Audit workflow with a few stability- and speed-related updates sprinkled in. This quarter we’ve had the opportunity to explore exciting ideas that create unique insights for you, our awesome users! These are the first (but definitely not the last) round of innovative additions for the year. I want to see these updates in action! One of the more challenging aspects of building and executing on a content strategy is the ideation phase. The proverbial question of “what should I write next?” is a constant theme in our customer and industry feedback. That’s why we've focused a majority of our efforts on taking the pain out of content ideation. With that, here are the goods from Q2: Tracked Audit redesign Fully interactive historical data Last quarter we received a fair amount of feedback referencing confusion with the timeframe selection in Tracked Audits. We also weren't happy with the level of interaction users had with the visualizations. With that feedback, we overhauled the entire experience to allow you the ability to drill down into specific time segments. This becomes powerful when comparing performance of a site over, say, the previous quarter or month. You also now have the flexibility to toggle visibility of the data you care about. Don’t care about Pinterest shares of your content? Great — go ahead and toggle that off with a single click in the graph legend. Related topics Important topics that exist in my content domain Ideation can be a huge challenge when consistently working to produce relevant and timely content for your audience. The new related topics feature in Content Search shows you topics your competitors are writing about that you may have missed or ignored. When ideating, this can provide a set of unique, relevant, and potentially high-performing topics to seed new ideas. Here’s how it works Each article has topics we’ve extracted from the page content. When you perform a Content Search, we run an aggregation over said extracted topics that takes into account publication date and Reach score to generate a list of the most relevant Related Topics for your query. Example: Our team loves pizza, so we’re often interested in the latest pizza news. Performing a search for “pizza” articles in the last month produces what we believed to be an erroneous related keyword seen below (mount kilimanjaro). Mount Kilimanjaro?! All it took was one click to realize that no, this was no mistake: Pizza Hut delivered a pizza to the top of Mt. Kilimanjaro. The team has to know about this! And that, my friends, is why you should all be using the Related Topics feature. Content performance scale Performance relative to similar content When you’re comparing content performance against the competition, it’s not always as simple as looking at one brand or website versus your own. It’s often the case that you’re competing for viewership with many websites that bleed in and out of your primary industry or vertical. That’s why we’ve introduced a new comparison tool in our search results. We now show you how a piece of content performs relative to similar results in our search index. This helps tease out interesting answers to questions, like \"Is a goal of 25 shares on Facebook a good number for this piece of content?\" Or similarly, \"What’s realistic engagement on LinkedIn for content about this topic?\" Oh, and how about those Roger emoticons?! We even use them in our Slack channels! (High-five to Derric Wise for these!) Digest emails A weekly snapshot of performance With an active Tracked Audit, we crawl your site and discover, measure, and track your content on a weekly basis. Our recently released digest emails take this a step further by providing an indication of when we've completed your weekly audit, in addition to some unique highlights (or, in some cases, lowlights) from the past week. We’ve just enabled weekly digests for all existing Tracked Audits and digests are turned on by default going forward. It’s easy to update your email settings on the Dashboard by selecting the cog icon at the top of an audit tile, or by adjusting your account-level settings at moz.com/email. Faster searches, more results (Seriously, a lot faster!) We know there’s no time to waste when producing awesome content for your audience! That’s why we’ve worked hard to leverage the power of ElasticSearch, an extremely powerful storage utility, which allows us to index and serve many millions of documents in a matter of milliseconds. When we started storing all of this data, we weren’t entirely sure how we'd be using it in the future. As the index grew, we were forced to cap the number of results for a query at around 13k documents due to network limitations. These latest updates to our index now allow access to millions of results and begin to open up interesting new questions. Ready to check out the new-and-improved Moz Content? We hope you’re as excited about these new features as we are. As always, feel free to leave questions, concerns, or ideas in the comments below! We love feedback, and we love incorporating it into the product even more. Huge ups to the team: Greg Burton, Ben Robbins, Chris Whitten, Jay Leary, David O’Hara, and David Him. PS: We’ll all be at a MozCon booth this year, so feel free to drop by and say hello! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Check It Out: Moz Content’s Q2 Feature Updates (Tons of New Stuff!)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Check It Out: Moz Content’s Q2 Feature Updates (Tons of New Stuff!)"
    },
    {
      "level": "H2",
      "text": "Tracked Audit redesign"
    },
    {
      "level": "H3",
      "text": "Fully interactive historical data"
    },
    {
      "level": "H2",
      "text": "Related topics"
    },
    {
      "level": "H3",
      "text": "Important topics that exist in my content domain"
    },
    {
      "level": "H3",
      "text": "Here’s how it works"
    },
    {
      "level": "H2",
      "text": "Content performance scale"
    },
    {
      "level": "H3",
      "text": "Performance relative to similar content"
    },
    {
      "level": "H2",
      "text": "Digest emails"
    },
    {
      "level": "H3",
      "text": "A weekly snapshot of performance"
    },
    {
      "level": "H2",
      "text": "Faster searches, more results (Seriously, a lot faster!)"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Tyler Murray\n          \n            Tyler Murray"
}