{
  "url": "https://moz.com/blog/moz-2015-annual-report",
  "slug": "moz-2015-annual-report",
  "title": "The 2015 Moz Annual Report: All the Facts and Then Some - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It was a huge year for Moz! We worked hard to make our tools the best they can be, continue our TAGFEE legacy, and develop fancy new things for you to use toward the ever-important goal of better marketing. Review 2015 with us, reminisce about all that we went through together, and stand with us as…",
  "content": "The 2015 Moz Annual Report: All the Facts and Then Some Moz News By: Sarah Bird February 11, 2016 Table of Contents Copied! By: Sarah Bird February 11, 2016 The 2015 Moz Annual Report: All the Facts and Then Some Moz News Longstanding insomnia sufferers, rejoice! My Moz 2015 Annual Report is here. Check out 2012, 2013, and 2014 if you’re a glutton for punishment. So much happens in a year — fantastic and terrible things — distilling it into one blog post is my annual albatross. Here’s me agonizing over what to write. It’s not always good to be king.Alright. Enough wallowing in self pity.Here’s how I’m organizing this post so you can jump around to whatever strikes your fancy: Part 1: tl;dr 2015 was a strengthening year! Part 2: Two 2015 strategic shifts Part 3: Two invisible achievements Part 4: The tough stuff Part 5: Inside Moz HQ Part 6: Performance (metrics vomit) Part 7: The Series C and looking ahead [Part 1]tl;dr: 2015 was a strengthening year! 2015 was a strengthening year. We grew customers, revenue, and product offerings. We also began some major tech investments that will continue to pay off in the years ahead. With all the product launches comes increased opportunity in 2016, and also increased complexity. In the year ahead, you’ll see Moz delivering much more personalized onboarding, re-working the brand to accommodate our product families, changing up our customer acquisition flow, and investing in technologies and practices to speed up product development. [Part 2]Two 2015 major strategic shiftsFirst, instead of a one-size-fits-all product, we’re offering many crafted customer experiences. The most visible strategic change is the move away from cramming every feature into one product; instead, we’re offering products designed to help specific kinds of customers with their particular needs. Our community and customers are diverse. The solutions we offer should be too.We started 2015 with Moz Pro, Moz Local and our API business. We’re ending the year with two new products under out belt, Moz Content and Followerwonk. Pro will continue to evolve in 2016 to focus on professional SEOs. Moz Local just launched a major upgrade to its offering, making it the most useful way to manage your local SEO. Content marketers will love Moz Content’s new features. And social fanatics will enjoy analyzing their followers and fans with Followerwonk.Why did we back away from all-in-one? Well. We discovered that adding more features into a product isn’t always better. Sometimes it’s just more. We heard from customers that they valued certain parts of the product that solved their problem, but weren’t interested in the others. More simply, we built one product that many different kinds of customers could get a little benefit from. Instead, we want to build many products that customers get a lot out of. Even more simply, we won’t give each of our customers identical plates of food with lots of small bites, only 30% of which each enjoys. We’re giving everyone a big plate of their favorite food. Yum.Second, people sometimes really want to talk to other people. And that’s good. We’ve also relaxed our religious fervor about keeping humans out of the sales and onboarding process. We prided ourselves for years on dogmatically proclaiming that only bad products need human intervention. “The product should sell itself and be obvious to use,” we insisted. We [I] clung to this belief in the face of overwhelming feedback from our customers that they would love to have more interaction with Mozzers. I’m finally ready to let go of my belief that wanting to speak with a human is a failure in the system. We should give our customers what they want. Guess what? They sometimes want sales people, and personal onboarding and training. We will not resort to barfy tactics like high pressure sales, harassment, and limit self-service. But maybe, just maybe, the world isn’t so black and white as humans=bad, computers=good. Expect more opportunities to engage with real, live, bona-fide Mozzers as part of your product experience, should you need us. [Part 3]Two invisible accomplishmentsNot all of our big 2015 accomplishments are transparent to customers or the community. They're important nonetheless. The fance-pantsiest new engineering platform We knew that to out-innovate our competitors and make marketing easier for our customers in this dynamic environment, we needed a step-function improvement in our ability to experiment and innovate. We were inspired by compelling new development platforms built and tested at places like Google, Hubspot, and Twitter. They simplified the software development process without compromising security or performance. RogerOS is our new engineering platform. It’s based on the Mesos kernel with a marathon wrapper. Moz Content was built 100% on it, so the two innovations incubated and launched together last year. More Moz services are starting to move to it.In the spirit of generosity, we open sourced a big chunk of our work and look forward to contributing more in the future. We’ve still got a lot of work to do to make the platform more robust and we’ll continue these efforts in 2016. The platform is poised to deliver the step function increase in innovation. Because a bigger, more complex Moz shouldn’t mean slower. Kissing bad architecture goodbye Technical debt is the worst. Ugh. It’s demotivating for the team and siphons cycles away from innovation. It’s hard on customers because feature delivery stalls when you're keeping a fragile system from imploding. Our Moz Pro product was hobbled with some serious tech debt. The team spent months trying to keep it up. Customers were disappointed and the team was tired. We needed a plan to fix it that didn’t involve a highly risky 18-month rebuild.Luckily, one of our engineers had an epiphany, and a bunch of other engineers worked very hard to turn that epiphany into a workable plan that delivered feature improvements (not just parity!) while retiring painful tech debt in seven months. That’s way, way better than the dreaded 18 month slog. We have massively transformed the backend architecture for Moz Analytics. This frees up cycles for innovation and unlocks a bunch of latent potential in the data. It feels like we were running a race in a cast and crutches, and now finally our leg is free! We’re throwing those crutches to the sideline and sprinting. Here we come! [Part 4] The tough stuff Have you noticed how many year-in-review posts skip the tough stuff? I don’t want to do that. After all, a lot of this year’s tough stuff become next year’s strategic initiative. The marketing software space is getting crowded. It’s no secret that companies need to transform their marketing to match the new ways people discover, engage, and buy.The spigot of investor cash has been flowing fast and free into marketing tech for last couple years. We’re definitely seeing more competition in the market.To our competitors: We Salute You! You keep good pressure on us to innovate and deliver a great experience for good value. Moz is ahead in some areas and lagging in others. We’ve struggled to keep our link data reliable and we have to play catch up on the size and quality of our index. We’ve been very weak on keyword research, and will be remedying that in 2016. Our customer acquisition flow and brand is also way more complicated than it was a mere two months ago. We’ll be investing heavily in optimizing and improving this experience so it’s easier to find what you’re looking for. These challenges are non-trivial, and yet invigorating. We’ve got the best people on the planet at Moz and we’ve been making forward-thinking tech investments. It’s game on in 2016. [Part 5] Inside Moz HQ Amidst all of the shifts and changes, some things remain constant. TAGFEE remains our aspiration and our compass. As an organization, as people, we often have great integrity with our values. We also have moments of failure. But what makes Moz special is not the absence of flaws, or the TAGFEE page on the website; it’s the genuine commitment to those values. The pursuit is relentless. I don’t know anyone who is perfect. The people I admire most are those that strive for excellence when they fail; they pick themselves up and keep trying. They never give up the commitment to their values. Mozzers are like that. We’ve got 192 Mozzers now, up from last year’s number of 149. This year, we’ve done a lot of good work on teaching Mozzers learning about productive conflict, feedback, and inclusion in tech. We’re not done, but we’ve made an earnest start. Our gender diversity numbers are still terrible, but at least we’re headed in the right direction. Overall, we’re 40% women, up from 37% last year. We’re up to 27% in engineering. 54% of non-engineering roles are women. A lot of the work we’re doing to make the tech industry more inclusive doesn’t benefit Moz directly, but we’re still happy to do it. For example, we partner with lots of programs to bring middle and high school girls on tours of Moz HQ and encourage them to consider careers in STEM — maybe even start their own business someday. Several Moz engineers volunteer at coding schools, like ADA Academy, mentoring and welcoming underrepresented people to tech careers. We’re also partnering with Year Up to give underserved young adults meaningful careers. Our charity match program continues to be one of my most proud parts of Moz. Last year we donated over $110k to charities that Mozzers are passionate about. We match every Mozzer donation 150%. Our paid, PAID vacation program continues to be a high point for all Mozzers. Last year, Moz spent over $400k on airfare, hotels, tours, food, boats, and life-changing, memory-making experiences for Mozzers. That’s money well spent on lives well lived. Lastly, we reached a milestone so wonderful, I’m having a hard time expressing how it makes me feel. Two Mozzers, who didn’t know each other when they started working here, fell in love and are getting married. We made a whole family!!! [Part 6] Performance (metrics vomit!)2015 was a strong improvement over 2014 revenue growth rate. We finished the year at about ~$38 million in revenue. That’s a growth rate of 21.6%, compared to the 5.7% the year prior. Moz Pro still drives the majority of revenue, and Moz Local has demonstrated impressive growth. Product gross profit margin fared well this year at 76%. That’s basically holding steady from last year. If you throw non-product in there, overall gross profit margin is 73%. Total Cost of Revenue (COR) went up a little bit from last year. Most of the cost driven by increases in the amounts we pay to our data aggregator partners for Moz Local. We expect this to grow even more in 2016 as Local becomes a bigger share of our product mix. Total operating expenses came to $36.4 million dollars in 2015 (excluding CORs). The basic shape of that spend has remained pretty constant. The vast, vast majority of our company spend is people. No major shifts in spending trends from 2014 to 2015 other than increased 3rd Party Data. As planned, our EBITDA loss increased from last year to -$3.1 million. Cash burn was slightly above our 10% of revenue plan, but we were pretty darn close at 11%. Adam shared a detailed reflection of changes and upgrades to Moz Pro in 2015. I encourage you to check it out. Those changes are attracting a slightly different customer. The number of new Moz Pro customers we’re acquiring is much lower than in previous years, but our average revenue per user is increasing. We’re also keeping customers longer. Obviously, we’d love to add tons of new Pro customers *and* increase Average Revenue Per User (ARPU). We’ll be putting energy into that in 2016. Moz Local locations more than doubled in 2015. And we’re very excited to see how customers are enjoying the big Moz Local Insights release we released this week. It’s only been 24 hours, but initial response is very good. Organic traffic grew in 2015 by 16.7%. We hit just shy of 16 million organic visits. You can read a bunch about the community we host here on Moz.com from this post. Our external communities continued to grow. We did, however, decide to stop investing in the LinkedIn group in 2015 in favor of Instagram. [Part 7] The Series C and looking ahead I wrote last week about closing our Series C. (BTW, did you notice the public markets for SaaS companies nose-dived soon after? Phew! If you’re reading this, we love you Foundry!) We made big investments and placed some big bets in 2015. It’s so exciting to see them start to bear fruit. In the next 12 months, you should see (1) more feature releases, (2) more personal interaction with the Moz team when buying and using our products, and (3) increased clarity on our brand and customer acquisition flows. Thanks for sharing your feedback, sticking with us, and rooting for us. We’ll keep trying to make great stuff that helps you do your job better, and bring a smile to your day!Okay. And that’s a wrap on your 2015 Annual Report. Peace out. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The 2015 Moz Annual Report: All the Facts and Then Some"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The 2015 Moz Annual Report: All the Facts and Then Some"
    },
    {
      "level": "H2",
      "text": "[Part 1]"
    },
    {
      "level": "H3",
      "text": "tl;dr: 2015 was a strengthening year!"
    },
    {
      "level": "H2",
      "text": "[Part 2]"
    },
    {
      "level": "H3",
      "text": "Two 2015 major strategic shifts"
    },
    {
      "level": "H2",
      "text": "[Part 3]"
    },
    {
      "level": "H3",
      "text": "Two invisible accomplishments"
    },
    {
      "level": "H3",
      "text": "The fance-pantsiest new engineering platform"
    },
    {
      "level": "H3",
      "text": "Kissing bad architecture goodbye"
    },
    {
      "level": "H2",
      "text": "[Part 4]"
    },
    {
      "level": "H3",
      "text": "The tough stuff"
    },
    {
      "level": "H2",
      "text": "[Part 5]"
    },
    {
      "level": "H3",
      "text": "Inside Moz HQ"
    },
    {
      "level": "H2",
      "text": "[Part 6]"
    },
    {
      "level": "H3",
      "text": "Performance (metrics vomit!)"
    },
    {
      "level": "H2",
      "text": "[Part 7]"
    },
    {
      "level": "H3",
      "text": "The Series C and looking ahead"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sarah Bird\n          \n            Sarah Bird\n          \n            Sarah Bird"
}