{
  "url": "https://moz.com/blog/moz-content-launches-new-tiers-ga-integration",
  "slug": "moz-content-launches-new-tiers-ga-integration",
  "title": "Moz Content Launches New Tiers and Google Analytics Integration - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We've got some cool new features in Moz Content to share with you! Your content analysis will be more in-depth than ever before with Google Analytics integration, and if you're an agency or a larger site, we've got expanded tier levels to accommodate your needs.",
  "content": "Moz Content Launches New Tiers and Google Analytics Integration Content Marketing | Moz News By: Jay Leary February 2, 2016 Table of Contents Copied! By: Jay Leary February 2, 2016 Moz Content Launches New Tiers and Google Analytics Integration Content Marketing | Moz News When we launched Moz Content at the end of November, we limited the subscription to a single tier. At the time we wanted to get the product out in the wild and highlight the importance of content auditing, competitive research, and data-driven content strategy. To all of those early adopters who signed up as Strategists over the last few months, a big thanks. Since then, we’ve made a long list of improvements to both Audit performance/stability and the size of our Content Search index. Along with those updates we also added two new subscriptions for larger sites and agencies handling multiple clients: Teams and Agencies. The new tiers not only increase page and Audit limits, but also enable Google Analytics integration with Tracked Audits. More data for Tracked AuditsFor those that aren’t familiar, Tracked Audits let you trend and monitor the performance of your site’s content over time. On the backend, Moz Content re-audits your site every week in order to discover new pages and update site metrics. This allows you to compare, say, the average shares per article across your entire site from week-to-week or month-to-month. To date, Moz Content Audits have focused on links and shares. We did that intentionally, since a major goal for the product was to enable the analysis of any site on the web, including competitors. We also wanted to give agencies the freedom to prospect or audit clients without painful integrations or code snippets. That said (and I’m guessing you’ll agree), figuring out your content ROI usually requires a deeper look at site performance. With Moz Content, we stopped short of a full, conversion-focused analysis suite with custom tracking code and the like. Instead we’re focused on a product that delivers content analysis and insights to our entire community of online marketers — not just the select few that can afford it. Besides, there are plenty of big-ticket tools out there filling the niche, great products like Newscred, Kapost, SimpleReach, and Idio. So while we’re not jumping into the “enterprise” ring (just yet), we did want to give data-driven marketers a leg up in their analysis. The good news: if you’re a Teams or Agencies subscriber, you now have the added option of integrating Google Analytics with Tracked Audits. It’s easy to get started, and if you’re a Moz Pro subscriber you’re probably familiar with the authentication flow. Just go to any Tracked Audit you have GA data for, scroll down to the middle of the report, and click “Connect Google Analytics”: Once you’ve connected a profile, Moz Content immediately pulls in key metrics for each URL in the Inventory: You’ll probably notice we’re only displaying page views in the inventory. While we didn’t have the real estate to include all of the metrics we’re collecting in the interface, we’ve added them to the CSV export: Once you dump the data to Excel you’ll see the following metrics for the Organic and Paid segments, as well as a rollup of all referrers: Unique Page Views All Page Views Time on Page Bounce Rate Page Value After we’ve collected multiple audits, Moz Content also starts trending aggregated metrics so you can get a sense of performance over time: We’re hoping this added reporting gets you a step closer to that all-important ROI analysis. Some of you will already have a sense of how much a page view is worth, or the impact of a unique page view on a specific conversion. And for the Google Analytics pros out there, properly configuring Page Value will give you a direct indicator of a page’s effectiveness. This is just the beginning, and we’d love to hear about other ways we could make the GA data more useful. Please reach out and let us know what you think by clicking the round, blue Help button in the lower-right corner of the Moz Content app. More to come!We’re pushing out code every day to improve the app experience and build on the current features. We’re also growing our Content Search index with new sources of popular, trending content. If you haven’t tried it for a while, we encourage you to take a second look. Head over to http://moz.com/content and start a search or enter a domain to preview an Audit (be sure to sign into your community account to access both the Dashboard and increased limits). On the feature front, we’re pushing to integrate Twitter data into both the Audit and Content Search. As I’m sure you’ve noticed, this has been missing in our reporting to date. While we won’t have exact share counts for individual articles (see Twitter’s decision to deprecate the share count endpoint), we’re confident we can provide related information that’ll be useful for your Twitter analysis. As we develop this and other features, we’re always on the lookout for feedback from our community. As always, feel free to reach out to our Help team with any issues or feedback about the product. And if you’ve used Moz Content and are interested in beta testing the latest, shoot us an email at mozcontent+testing@moz.com and we’ll add you to the list. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Moz Content Launches New Tiers and Google Analytics Integration"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Moz Content Launches New Tiers and Google Analytics Integration"
    },
    {
      "level": "H2",
      "text": "More data for Tracked Audits"
    },
    {
      "level": "H2",
      "text": "More to come!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jay Leary\n          \n            Jay Leary"
}