{
  "url": "https://moz.com/blog/moz-local-new-gmb-insights-support",
  "slug": "moz-local-new-gmb-insights-support",
  "title": "Track your prospects' behavior on Google with Moz Local - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "With Moz Local's new GMB insights support, you can learn how customers search for your business on Google and the actions they take once they find it; easily visualize and filter results by region, a specific client, or a specific campaign; and measure conversion rates for your local marketing…",
  "content": "Track Your Prospects' Behavior on Google with Moz Local's New GMB Insights Support Local SEO | Moz Tools By: Dudley Carr February 1, 2017 Table of Contents Copied! By: Dudley Carr February 1, 2017 Track Your Prospects' Behavior on Google with Moz Local's New GMB Insights Support Local SEO | Moz Tools The big news in the Local Search community three weeks ago was Google’s announcement of the availability of the Google My Business (GMB) Insights data via the GMB API. Today, we’re excited to announce support for GMB Insights data in Moz Local! Learn how customers are searching for your business on Google and the actions they are taking once they find it Easily visualize and filter results by region, a specific client, or a specific campaign — on the fly Measure conversion rates for your local marketing campaigns See it in action! Now available: Google My Business Insights Starting today, customers using Moz Local Professional or Moz Local Premium have the ability to work with GMB Insights data. The information in Google My Business Insights helps you understand how prospects are searching for your business on Google, and the actions they are taking once they find it. For example, having found your business in a local search, are they taking the next step — clicking or tapping to request driving directions, calling your location, or visiting your website? Understanding consumer behavior through insights like these can help you optimize your business listings to drive peak performance in consumer local searches. This is important because it now enables you to measure actual conversion rates, and in turn measure the success of your local marketing campaigns. As the SEO leader, we’ve given Moz Local the powerful ability to instantaneously aggregate metrics for a set of locations, and present that in a way that’s intuitive to users. For brands and agencies that need to dive into their metrics across many locations, Moz Local’s performance and flexibility unlock tremendous business value in the data. Let’s say you want to see how many click-to-calls occurred to your stores within a specific region, or click-for-directions to all of your stores occurred within a specific campaign. Moz Local lets you easily answer questions like this, filtering down to a region, a specific client, or a specific campaign on the fly, and see totals for any of these breakdowns. Getting answers to questions like these are among the highest priorities that most brands — and agencies on their behalf — have in their local marketing. The big story this allows a brand marketer to tell goes something like this: “After launching our local campaign, we increased Click-to-Calls on Google by 25%.\" For an agency, it’s similar: “After signing on with us, requests for driving directions to all of your locations increased by 20%.” We commend the GMB and GMB API teams for the pace of improvements and getting at the heart of a real customer pain point. It’s very exciting to see Google invest time and effort in an area of growing importance to enterprises, local businesses, and agencies large and small. Visualizing GMB Insights So what does this look like in Moz Local? Well, beginning today, here’s what you can expect to see for Professional and Premium listings: Get started now Moz Local now provides these Google My Business insights: Google Searches – The number of times your business listing was shown when searching for it directly (by name) Google Categorical Searches – The number of times the listing was shown as a result of a categorical search (for example, restaurant) Google Map Views – The number of times your listing was viewed on Google Maps Google Search Views – The number of times your listing was viewed on Google Search (in organic or local pack SERPs) Google Customer Actions, which include: Click-to-Website – The number of times the website was clicked or tapped on your listing Click-to-Call – The number of times the phone number was clicked or tapped on your listing Click-to-Driving Directions – The number of times driving directions were requested for the listing It’s easy! Getting at this new data is simple: As soon as you have Moz Local sync your locations with Google My Business, it will start fetching metrics from Google My Business. That’s it! Our next data destination: Yelp We’re excited to see the insights that our customers will be able to distill from the metrics gathered from Google My Business in Moz Local. However, our path toward data nirvana doesn’t end here. Once our Yelp integration is complete and available, as soon as customers manage their Yelp locations via Moz Local, we’ll also be able to share similar metrics from Yelp alongside the Google My Business metrics. For many customers, this will be the first time they'll be able to see these two incredibly critical data sources side-by-side for their locations. We’re working closely with our friends at Yelp to complete the Moz Local-Yelp integration, so stay tuned. Get started today! Google My Business Insights data is now available to customers using our Professional and Premium packages. For the growing number of companies and agencies currently evaluating Moz Local, please ask your Moz representative for a demo. And, of course, let us know what you think! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Track Your Prospects' Behavior on Google with Moz Local's New GMB Insights Support"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Track Your Prospects' Behavior on Google with Moz Local's New GMB Insights Support"
    },
    {
      "level": "H2",
      "text": "Now available: Google My Business Insights"
    },
    {
      "level": "H2",
      "text": "Visualizing GMB Insights"
    },
    {
      "level": "H2",
      "text": "It’s easy!"
    },
    {
      "level": "H2",
      "text": "Our next data destination: Yelp"
    },
    {
      "level": "H2",
      "text": "Get started today!"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dudley Carr\n          \n            Dudley Carr\n          \n            Dudley Carr"
}