{
  "url": "https://moz.com/blog/moz-local-summer-updates",
  "slug": "moz-local-summer-updates",
  "title": "Moz Local Summer Updates - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Our engineering team has been hard at work on a number of behind-the-scenes improvements since the launch of Moz Local in March, but today marks our first major feature release--streamlined submission for individual listings and a killer duplicate-closure upgrade.",
  "content": "Moz Local Summer Updates Local SEO | Moz Tools | Moz News By: David Mihm September 2, 2014 Table of Contents Copied! By: David Mihm September 2, 2014 Moz Local Summer Updates Local SEO | Moz Tools | Moz News Editor's note: For the best overview of current Moz Local dashboard capabilities, please see: https://moz.com/help/guides/local/local-dashboard. Hard to believe, but it’s been five months since we released Moz Local into the wild! As I’m sure has been the case for many of you, our summer has just flown by. While our engineering team has been hard at work on a number of behind-the-scenes improvements since Day One, today marks our first major feature release since launch--and it actually includes three features. A TL;DR is at the bottom of this post for those strapped for time :) Single-location distribution and editing The most common request we’ve heard since our initial launch back in March is for a simplified web interface to submit your listings, as opposed to the CSV file designed for agencies and brands with hundreds or thousands of locations. We realize for some of the formatting constraints required by our system are a bit onerous for those users not already managing their data in bulk at Google My Business. So with the help of Moz’s tremendous UX team, we’re releasing a dramatically simplified one-page entry form that should dramatically reduce the time involved with submitting listings for the first time, or tweaking listings you’ve already submitted. The submission form is broken into sections to allow casual users to focus on the most important attributes of their listings, but still gives advanced users the ability to add rich data fields like hours of operation, social media URLs, brands carried, and store code. For those of you who do have a batch of locations you’d like to upload all at once, you’ll still be able to do so using our CSV template. But you should find the validation of those listings a little smoother. All in all, we’re hoping that this makes the onboarding process much less cumbersome and much more efficient! My favorite parts of this new feature: Pre-filled baseline information from what we’re able to find across the local search ecosystem, saving you hours of time if you’ve got multiple locations. A snazzy category selection interface on par with Google My Business. A killer Hours-of-Operation selector that’s the best I’ve seen (though I am a little biased!) Enhanced duplicate listing detection and closure Back in my consulting days, one of the biggest headaches was always searching for and “nuking” erroneous or out-of-date listings for my clients. I’m sure that’s the case for many of you as well, and for various reasons, not the least of which is the associated boost to the strength of directories, the Pigeon update has only made this task more important. How this feature works: Just as before, you’ll see the Duplicates section highlighted in the sidebar of your dashboard if we’re able to find duplicates for any of the listings in your account. But clicking that menu item gives you an entirely different experience. You’ll now see a call-to-action to add alternates of various NAP attributes, like business name, ZIP code, and phone number. Adding these alternates tells us to search all possible NAP combinations that use these alternate data points on every site we query. We automatically show you close-match listings to the NAP you submitted in the same or similar ZIP codes. But now if a business has moved, lost a practitioner, or changed its phone number, this feature will find those broader-match listings as well. And now you’ll be able to request removal of these duplicates (on the sites in our network) right in the dashboard. My favorite parts of this new feature: Gives you the ability to cast a much wider net than our automatic duplicate detection. Gives you the ability to ignore close-match listings that aren’t actually duplicates. Allows you to close listings directly from the dashboard rather than going to partner sites. Our status as a Factual Trusted Data Contributor Factual--one of the four primary U.S. data aggregators--launched a new initiative a couple of weeks ago called the Trusted Data Contributor program, and we're excited to be a part of it. The TDC program is a significant indication of Factual's commitment to an index of accurate and complete location information for businesses of all sizes. We've been working behind the scenes with Factual over the past several weeks to adjust how we send them location data. Our inclusion in this program means that Moz Local customers can expect their listings to go live on Factual with a much higher level of fidelity, although it may take a little longer than it did previously for updated listings to appear in Factual's index. A number of you have contacted our Help Team about your Factual listings during this transition, and we appreciate your patience. As part of this update, a significant number of pending listings will go live on Factual in approximately two weeks. Read the official announcement and learn more about the program here. Upcoming price increase As we’ve learned a bit more about the operating costs of Moz Local over the past five months, and as part of the release of these additional features, we’ve decided to institute a price increase to $84 per location per year. This price remains true to our mission of providing a product that ensures accurate, consistent information across the web at a price point affordable for small business owners, agencies, and large brands alike. The added revenue from this price increase will allow us fund the development of future Moz Local products. The price increase will go into effect on October 1, 2014 -- but any listings purchased prior to that date will be grandfathered in at our $49 rate. So if you’ve been on the fence about distributing your locations through Moz Local, or have been too overwhelmed by the CSV input, now is definitely the cheapest and most efficient opportunity to submit your locations. TL;DR We’re releasing: Simplified web interface for listing submission and editing Expanded duplicate listing detection and streamlined closure Slightly slower, but more reliable listing updates on Factual Price increase to $84 per location per year starting October 1 We’re excited about the reception the product has received so far, and especially grateful for all the feedback and feature requests from our users and the broader Moz community. Please continue to let us know what you think we should focus on next by emailing us to suggesting features! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Moz Local Summer Updates"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Moz Local Summer Updates"
    },
    {
      "level": "H3",
      "text": "Single-location distribution and editing"
    },
    {
      "level": "H3",
      "text": "Enhanced duplicate listing detection and closure"
    },
    {
      "level": "H3",
      "text": "Our status as a Factual Trusted Data Contributor"
    },
    {
      "level": "H3",
      "text": "Upcoming price increase"
    },
    {
      "level": "H3",
      "text": "TL;DR"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "David Mihm\n          \n            David Mihm\n          \n            David Mihm"
}