{
  "url": "https://moz.com/blog/moz-ranking-factors-preview",
  "slug": "moz-ranking-factors-preview",
  "title": "Moz Ranking Factors Preview - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "How do commercial and informational queries differ? Does one type of SERP show more or fewer results that are mobile-friendly or using HTTPS? Find those answers in this examination of more than 345,000 search results.",
  "content": "Moz Ranking Factors Preview Search Engines By: Eric Enge August 10, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Eric Enge August 10, 2015 Moz Ranking Factors Preview Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. How do the SERPs for commercial queries vary from the treatment of informational queries? Moz is about to publish its new Search Engine Ranking Factors, and was kind enough to provide me with access to their raw ranking data. Today I am going to share some of what I found.In addition, I am going to compare it against raw ranking data pulled by my company, Stone Temple Consulting (STC). What makes this so interesting is that the Moz data is based on commercial queries across 165,177 pages and the STC data is based on informational queries over 182,340 pages (for a total of 347,517 result pages). Let's dive in!Mobile-friendlinessGoogle rolled out their Mobile-Friendly Update on April 21 to much fanfare. We published our study results on how big that impact was here, and in that test, we tracked a set of 15,235 SERPs both before and after the SERPs.The following chart shows the percentage of the top 10 results in the SERPs that are mobile friendly for the Moz (commercial) queries, and the STC informational queries before and after the mobile update:Clearly, the commercial queries are returning a much larger percentage of mobile friendly results than the informational queries. Much of this may be due to it being more important to people running E-commerce sites to have a mobile-friendly site.What this suggests to us is that publishers of E-commerce sites have been faster to adopt mobile friendliness than publishers of informational sites. That makes sense. Of course, our friends at Google know this is more important for commercial queries, too.Your actionable takeawayRegardless of query type, you can see that more than 60% of the results meet Google's current definition for mobile friendliness. For commercial queries, it's nearly 3/4 of them. Obviously, if you are not currently mobile friendly, then solve that, but that's not the whole story.Over time, I believe that what is considered mobile friendly is going to change. The mobile world will become much more than just viewing your current desktop site with a smaller screen and a crappier keyboard. What are some more things you can expect in the long term?Different Site Architectures for Desktop and Mobile: I am of the opinion that the entire work flow may be different for many mobile sites.Voice navigation: We will stop seeing the keyboard as the primary navigation option for a mobile site.Continuing Rise of Apps: The prior two points may be a large factor in driving this.My third point is an item that is already in progress, and the first two are really not for most people at this time. However, I put them out there to stimulate some thinking that much more is going to happen in this space than meets the eye. In the short term, what can you do?My suggestion is that you start looking at the mobile version of your site as more than a different rendering of your desktop site. What are the different use cases between mobile and desktop? Consider running two surveys of your users, one of desktop users and one of smartphone users, and ask them what they are looking for, and what they would like to see. My bet is that you will quickly see that the use cases are different in material ways.In the near term, you can leverage this information to make your mobile site optimization work better for users, probably without re-architecting it entirely. In the longer term, collecting this type of data will prepare you for considering more radical design differences between your desktop and mobile sites.HTTP vs. HTTPSAnother one of the newer ranking factors is whether or not a site uses HTTPS. Just this past July 22, Google's Gary Illyes clarified again that this is a minor ranking signal that acts like a tiebreaker in cases where the ranking for two competing pages are \"more or less equal.\"How has that played out in the SERPs? Let's take a look:As with the mobile-friendliness, we once again see the commercial queries placing significantly more emphasis on this factor than the informational queries. Yet, the penetration levels are clearly far lower than they are for mobile friendliness. So should I care about this then?Yes, it matters. Here are three reasons why:At SMX Advanced, Google's Gary Illyes indicated at SMX Advanced that they plan to increase the strength of HTTPS as a ranking factor over time.Google's Chrome is making moves toward warning users visiting unsecure web sites.Mozilla has also laid plans to follow suit.Yes, I know there is much debate about whether or not you need to have HTTPS if all you are doing is running a content site. But a lot of big players out there are taking a simple stance: that it's time for the plain text web to come to an end.The big thing that HTTPS helps prevent is Man in the Middle Attacks. Do read the linked article if you don't know what that is. Basically though, when you communicate with a non-secure web site, it's pretty trivial for someone to intercept the communication and monitor or alter the information flow between you and the sending web site.The most trivial form of this can occur any time you connect to a third party Wifi connection. People can inject ads you don't want, or simply monitor everything you do and build a profile about you. Is that what you want?Let me offer a simple example: Have you ever connected to Wifi in a hotel? What's the first thing that happens? You try to go to a website, but instead you get a login screen asking for your room number and last name to sign in - and most times they charge you some fee.That's the concept - you tried to go to a web site, and instead got served different content (the Wifi login screen). The hotel can do this at any time. Even after you login and pay their fee, they can intercept your communication with other web sites and modify the content. A simple application for this it to inject ads. They can also monitor and keep a record of every site you visit. They can do this because they are in the middle.In an HTTPS world, they will still be able to intercept the initial connection, but once you are connected, they will no longer be able to see inside the content going back and forth between you and the https websites you choose to access.Your actionable takeawayEventually, the plain text web will come to an end. As this movement grows, more and more publishers will make the switch to HTTPS, and Google will dial up the strength of this signal as a ranking factor. If you have not made the switch, then get it into your longer term plans.SummaryBoth mobile-friendliness and HTTPS support appear to matter more to commercial sites today. I tend to think that this is more a result of more e-commerce site publishers and informational site publishers have made the conversions, rather than it being the impact of the related Google algorithms. Regardless of that, the importance of both of these factors will grow, and it would be wise to aggressively prepare for the future. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Moz Ranking Factors Preview"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Moz Ranking Factors Preview"
    },
    {
      "level": "H2",
      "text": "Mobile-friendliness"
    },
    {
      "level": "H3",
      "text": "Your actionable takeaway"
    },
    {
      "level": "H2",
      "text": "HTTP vs. HTTPS"
    },
    {
      "level": "H3",
      "text": "Your actionable takeaway"
    },
    {
      "level": "H2",
      "text": "Summary"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Eric Enge\n          \n            Eric Enge"
}