{
  "url": "https://moz.com/blog/moz-analytics-custom-reports",
  "slug": "moz-analytics-custom-reports",
  "title": "New and Improved Custom Reports Added to Moz Analytics - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We're excited to announce that our #1 most requested feature is here! You can now build custom reports from your campaigns in Moz Analytics, emailing them to yourself and anyone else you choose. Check out how it works, and take a sneak peek at what else we're working on at the Mozplex.",
  "content": "New and Improved Custom Reports Added to Moz Analytics Moz Tools M By: Miranda Rensch November 7, 2013 Table of Contents Copied! M By: Miranda Rensch November 7, 2013 New and Improved Custom Reports Added to Moz Analytics Moz Tools Hello everyone! Miranda here. I'm a Product Manager at Moz and I'm excited to announce that we've added custom, automated reporting to Moz Analytics. This is something that already existed in PRO (the predecessor to Moz Analytics), but the new version has some cool upgrades I'd like to point out, so here goes a quick walk-through. Walk-through of the new custom reports With the new version of custom reports, you can select (almost) any visualization or data list from within Moz Analytics to be included in a custom PDF and emailed regularly. To access the new reports, just go into any campaign and click \"Custom Reports\" in the top right and then click \"Create / Schedule Report\" to get started. Next, you'll begin filling in the details of your report. You can give it a name and a description to appear at the top of the PDF: In the \"Add Modules\" step you use a left navigation similar to the normal Moz Analytics experience so you can quickly navigate to your favorite data / visualizations and click the + sign to select them. In the next step you'll be able to organize them and add notes. In the \"Design Report\" step, you can re-order your modules, add notes, and if you have access to branded reports, add your brand logo to be printed on the PDF. In the next step you can preview your report. Click \"Generate PDF Report\" to view and save as an actual PDF. Finally, you can schedule the report to be emailed regularly to you and any others that you specify. You can now also customize the text of the email that gets sent out! When you've finished setting up your report, you can see all active reports on the main Custom Reports page. From there you can see the next scheduled send date and edit your reports. Other new stuff in Moz Analytics While we're at it, we'd like to mention a few other improvements in Moz Analytics: Crawl diagnostics updates We made some improvements to the design to make it easier to find the issues exposed by our custom crawler. You can now see a breakdown of your top High, Medium, and Low priority issues at the bottom of the Crawl Diagnostics overview page. You will also see the issue counts included in the issue drop-down. We've also made sure that all of the crawl data is included in the .csv export. We are still working on making views of duplicate pages and titles visible outside of the .csv. Keyword opportunities improvement With this smaller update, we added a button to the keyword opportunities report in the rankings section, allowing you to quickly add an attractive keyword to your list for rank tracking. Fresh Web Explorer alerts In case you missed it, we also recently released a big update to Fresh Web Explorer that lets you create and save custom alerts. Use it to get prompt alerts when someone publishes content mentioning your brand, your competitors, or even discover interesting link and outreach opportunities. Cyrus even wrote a whole blog post about it. What's next for Moz Analytics? Here are some of the projects that are currently in-progress and up next for Moz Analytics. This is just the top of our list, but we'd love to know what you think! Please let us know in the comments. Monthly timeframes: We are still working on adding monthly timeframe options into custom reports and the rest of the Moz Analytics app. We hope to have that in by the end of the year. Also, we are aware that there are some issues currently with monthly custom reports in PRO causing them to be delayed. We hope to build these monthly reports into the new version of custom reports in a more scalable way and we apologize for the issue in PRO. Lots of bug / UX fixes: We're working on continually responding to feedback and bugs in the new application. We've gotten to many, but not all of them. Thank you for your patience! Contextual help: We're working on ways to bring help guides and videos directly into the app so that when you need help you can find it quick. Add individual keyword history to Custom Reports: There are a couple of modules that can't be added to custom reports yet—Analyze a Keyword (individual keyword history), Grade a Page, and Analyze Page Issues. We hope to make those available in the next few months as well. Per-page PDF downloads: We are currently working on allowing PDF downloads of any page in the app. We hope to have that done in the next month or so. Customized timeframe options: We're in the process of researching our ability to provide more customized timeframe options. It's a bit complicated due to the variety of data we include in our app, but we're looking at our options. Multi-user accounts: We're working on supporting multiple users per account. You tell us! If you have any other feedback or ideas for how this software could be better and save you more time, please let us know! That's all! If you have any questions or comments, chances are other people will too, so why not ask it on the Moz Q&A forum! Looking forward to hearing your feedback. If you'd like to volunteer a half-hour to give more in-depth feedback about this section or reporting in general, please email miranda@moz.com. Happy reporting! Miranda Rensch Product Manager @ Moz Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "New and Improved Custom Reports Added to Moz Analytics"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "New and Improved Custom Reports Added to Moz Analytics"
    },
    {
      "level": "H2",
      "text": "Walk-through of the new custom reports"
    },
    {
      "level": "H2",
      "text": "Other new stuff in Moz Analytics"
    },
    {
      "level": "H3",
      "text": "Crawl diagnostics updates"
    },
    {
      "level": "H3",
      "text": "Keyword opportunities improvement"
    },
    {
      "level": "H3",
      "text": "Fresh Web Explorer alerts"
    },
    {
      "level": "H2",
      "text": "What's next for Moz Analytics?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "Moz AI: Introducing Augmented Intelligence"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miranda Rensch\n          \n            Miranda Rensch"
}