{
  "url": "https://moz.com/blog/moz-and-icontact",
  "slug": "moz-and-icontact",
  "title": "Moz Acquired by iContact Marketing Corp - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We're thrilled to announce our acquisition by iContact Marketing Corp! Check out Sarah and Michael's chat discussing the details, and please celebrate with us as we chart the future of Moz together.",
  "content": "Moz Acquired by iContact Marketing Corp Moz News | Marketing Industry By: Sarah Bird June 4, 2021 Table of Contents Copied! By: Sarah Bird June 4, 2021 Moz Acquired by iContact Marketing Corp Moz News | Marketing Industry Exciting news, Moz fans! We are thrilled to announce that Moz has been acquired by iContact Marketing Corp! Our readers know how critical SEO work is when it comes to the success of marketing strategies, and as an industry leader, Moz was the natural choice for iContact's expansion into the SEO space. If you’re not familiar with them, iContact and its sibling brands — Campaigner, SMTP, and Kickbox — together operate as a subsidiary of J2 Global (NASDAQ: JCOM). They help small and mid-sized businesses reach and retain loyal customers with advanced email marketing automation tools. As part of the iContact family, Moz will be even better equipped to assist our subscribers with all of their SEO and digital marketing needs. I sat down with Michael Pepe, President of iContact Marketing Corp, to talk more about the acquisition. Check it out below to learn what this means for Moz! Video Transcription Sarah: Hi, everyone. I'm Sarah Bird. I'm the CEO of Moz, and I've got some exciting, very exciting, very significant news to share with you all and I have invited Michael Pepe here to share with me. Michael, will you introduce yourself? Michael: I sure will. Thank you very much, Sarah. So I'm Michael Pepe, and I serve as the President of iContact Marketing. And we do have some very exciting news to share today because Moz has been acquired by iContact. Sarah: Wow, that feels so good to say. Michael: Me too, publicly. Sarah: At last. It's time. At last. I love it. Why don't you share a little bit about iContact? Michael: Sure, sure. So iContact is an iconic brand in email marketing, and along with its sister brands, Campaigner, SMTP, Communicator, and Kickbox, all of those brands really focus on the email marketing needs of small to midsize customers. And it's a big business. Last year we delivered 68 billion emails. Sarah: Woo, nice work. Michael: Big. Big. So . . . Sarah: Wow, that's impressive. Michael: . . . I'm sure there's no one on the call who's not heard of Moz. But for the handful who may not have . . . Sarah: Yeah. Michael: . . . tell us about Moz, Sarah. Sarah: Yeah, Moz is an SEO company through and through, from our earliest days, you know, 15 years ago when we started understanding and teaching about SEO through the blog and then really thought through how much more people we could help if we got more data behind our suggestions and then transitioned to being a software company. And so from the core has been this desire to help people understand and master a really complex, a complex marketing practice that is so vital and data driven. So some of our data stats, you know, we have over 40.7 trillion links, and we have over 1.2 million websites tracked, and we have over 500 million keyword suggestions. And all of that is to help people make better, smarter SEO decisions, whether you are at a small company or you're at a big company, whether you're a beginner in your SEO journey or whether you've been doing this for a very, very long time. And I love that we have that in common, Michael. iContact and Moz, they all want to help as many people as possible, and we're very focused on two core marketing strategies that are just as vital for organizations today as they've ever been. Michael: Absolutely. And, you know, what I think sets Moz apart is the fact that you do focus on the size, quality, and accuracy of your data, but to be able to translate that data into insights to help marketers of all levels of sophistication, companies of all sizes, I think that's truly remarkable and sets Moz apart. And, Sarah, you know we've been talking for some time. This is not a new idea that we came up with last week. Sarah: Right. Michael: And, you know, we've just added, you know, a long list of reasons of why our two companies belong together. And maybe just it would help to share a few of those ideas on the call. Sarah: Yeah, I bet people are real curious. Yeah, what's the why? Give us the why, Michael. Michael: Focus on the same customers and serving small to midsize customers. If we ask our customers, which we do routinely, what the number one tool that they need, beyond email, it's undoubtedly SEO. So there's a great pairing of SEO and email marketing. And I would say that I think really importantly Moz is a value-driven company. And particularly in this day and age, you know, we live in a complex ecosystem that involves our customers, our colleagues, our partners. And to be able to think about supporting all of their needs and having all of those components thrive I think has really been an agenda on Moz's part and one that we believe in wholeheartedly ourselves, you know, to really think about values, integrity, and principle to drive ourselves forward. And so I think that we not only share values, but we have a shared future together. Sarah: Yes. Oh, Michael, you said it so well. I can't say it better myself, so I will only add to that, that, you know, Moz is going to thrive in this new family, and I know that for certain because I know that you guys genuinely understand the value of SEO and are excited to share that with your broader customers. And really, we know that email is critical and will remain critical. It's not going anywhere. It's just getting better. And we have the shared values. So what more do we need, right? I think that together we can and will accomplish great things for all of our customers. So excited to make it to this moment with you and to start running towards that future together. So thank you so much. Michael: Thank you. The future is bright. Sarah: It is. All right, everyone, thank you and watch our blog. Stay tuned. More to come. Michael: Bye. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Moz Acquired by iContact Marketing Corp"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Moz Acquired by iContact Marketing Corp"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sarah Bird\n          \n            Sarah Bird\n          \n            Sarah Bird"
}