{
  "url": "https://moz.com/blog/moz-year-in-review-2017",
  "slug": "moz-year-in-review-2017",
  "title": "The Moz Year in Review 2017 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The Moz 2017 annual report is here for your reading pleasure! Check out all the transparent details of our previous year in business, from our newest launches to financial numbers to how much we spent on matching charitable donations and beyond.",
  "content": "The Moz Year in Review 2017 Moz News By: Sarah Bird March 12, 2018 Table of Contents Copied! By: Sarah Bird March 12, 2018 The Moz Year in Review 2017 Moz News Yay! We’ve traversed another year around the sun. And I’m back with another Moz year-in-review post that promises to be as boring as its predecessors. Reading it feels like being locked in your tin can space capsule through lightyears of empty space. If you’re a little odd and like this kind of thing, do please continue. Before we begin our odyssey, I invite you to check out previous reports: 2016, 2015, 2014, 2013, 2012. Transparency is a Moz core value. Putting detailed financial and customer data on the blog is one of the ways we live our values. We’re a little weird like that. Okay spacepeople: take your protein pills and put your helmets on. Launch to your favorite parts: Part 1: TL;DRCommencing countdown, engines on Part 2: SO MANY winsNow it's time to leave the capsule if you dare Part 3: Customer metricsYou've really made the grade Part 4: Financial performanceAnd the stars look very different today Part 5: Inside Moz HQThe papers want to know whose shirts you wear Part 6: Into the futureI think my spaceship knows which way to go Part 1: TL;DR Commencing countdown, engines onWhat a year! 2017 was a time of doing new things differently — new teams, new goals, and new ways of operating. I’m so proud of Mozzers; they can do anything. If I’m sent to a far-off space colony, I want them with me. In spite of (and because of!) all this change, we grew revenue and became significantly EBITDA and cash flow positive. Nice! We have a nice economic engine primed and ready to make some more big investments in 2018. Stay tuned. These positive results were not from one single thing. Rather, iterative product and operations improvements helped improve both our top and bottom line. Plus, we made a bunch of longer-term investments that don’t show up yet in the 2017 report but will bear fruit in 2018 and beyond. Part 2: Ch-ch-ch... Changes! Now it's time to leave the capsule if you dareHere’s a little more detail on some of the changes I talked about. We launched Keywords By Site, relaunched our crawler (a major technical undertaking), sunsetted two products (content and Followerwonk), built a bunch of new developer tools and standardized on some dev frameworks, and improved our local data distribution network. Check out Adam Feldstein’s post for a lot more detail on our 2017 major product accomplishments! We’ve got another exciting launch on the way, too. We’ve invested a ton of blood, sweat, and tears into it during 2017 and can’t wait to share it with everyone. All of these changes support our 2016 strategy of “more wood behind fewer arrows.” We choose to focus our energy on being the best place to learn and do SEO. Our mission is to simplify SEO for everyone through software, education, and community. For those of you worried about Followerwonk, it’s going to be okay. Better than okay. Our beloved “Work Dad” Marc Mims is now the proud father of Followerwonk! Marc’s dedication to the success of Followerwonk has never wavered over the many, many years he’s been building and maintaining it. We already miss his compassion, humor, and bike stories around the Mozplex. We wish him and Followerwonk the best! We bought that product because we loved it then; we love it even now. Sadly, though, it never quite fit with our mission as well as we'd hoped. We created new programs to help people get the SEO help that’s right for them. We completely rebuilt our SEO Learning Center with fresh educational content. There’s a brand-new SEO podcast, MozPod, for you to check out. We also began experimenting with and are now expanding SEO training workshops delivered by experts we trust and admire. I’m so excited about this because it’s a new way for Moz to have impact; it’s personal, live, interactive, and immediate in a way that most of our SEO education work can’t be. We won’t stop doing free, scalable education. It’s core to our beliefs. But it is fun to deliver custom, live training sessions in the mix too. Many of our accomplishments are behind the scenes, and will deliver long-term positive impact. Our investments in retiring tech debt, improving monitoring, investing in our development platforms, and nurturing our engineering culture have resulted in the most stable and performant software in Moz history. Our hard work and ingenuity is paying off in resilient and performant software. We’ve also rebuilt most of our customer stack: new Salesforce implementation, HubSpot launch, new internal data warehouse, new CMS (Craft), Segment.io, and more! Phew! That’s a lot! In Q1 2018, we started with Terminus for Account-Based Marketing, and partnered with third-party data vendors, like Full Contact, to supplement our data warehouse. These big changes are going to set us up really well for the years ahead. And we’ve got more internal tools launching soon! We are on a roll with internal improvements and momentum. Part 3: Customer metrics You've really made the gradeWe could ship and launch until our circuits go dead, but at the end of the day all our work is in service of meeting your needs. We know you can hear us! You’re following us now more than ever before. Part 4: Financial performance And the stars look very different todayCheck out the infographic view of our data barf. I’m proud of what we accomplished in 2017, especially considering the incredible amount of change in strategy and team structure. More revenue while spending less = magic! Also, the economic strength we’ve built will allow us to place some nice-sized bets this year. Boom! We made $47.4 million in GAAP revenue in 2017, an increase of 11% from 2016. We brought our over all expenses way down in 2017. Cost of Revenue increased slightly to $11.8 million. We reduced operating expenses aggressively. Curious on what we spend on, and trends? Check out this breakdown of our major expenses (OpEx and Cost of Revenue) as a percentage of annual revenue: We generated cash, positive EBITDA, and for the first time in recent Moz history, we were positive net income. That’s quite a turnaround from 2016, in which we closed the year negative EBITDA of $5.7 million! We flipped EBITDA! We have adopted a cash-flow-neutral-to-positive operating philosophy right now to be ready for some future investments. We may decide to go cash flow negative again to fund further growth. Part 5: Inside Moz HQThe papers want to know whose shirts you wearSo, who is behind the wheel here? We ended 2017 with roughly the same number of Mozzers as we began. It was a conscious choice to remain approximately headcount neutral in 2017; we only opened up new positions after ensuring rigorous conversations took place around the business need for the role. This discipline is hard to live under, but we like the results. We’re working smarter, and getting more rigorous in our decision-making. Let me be clear: WE ARE HIRING! These are just 5 of our currently open positions: DevOps Engineer Sr. Platform Software Engineer Backend Engineer - C++ Fullstack Engineer - JavaScript/Node Chief Marketing Officer See more at our Careers page! Here’s where we need YOU: Moz is committed to bringing more women into tech. There is a dire lack of diversity in the technology industry. This past year we added 6% more women to the company overall and 9% to engineering specifically. We must and will do better. We need more women in engineering and leadership roles here. Check out those jobs above and join the team! Moz partners with some fantastic organizations focused on getting more women into the tech pipeline. Ada Academy, Year Up, Ignite Worldwide, and Techbridge all encourage women and girls to pursue STEM careers early in their lives. Our newest partner, Unloop, enables people who have been in prison to develop skills and succeed in careers in tech. It is our responsibility to ensure that all people have opportunity and access to participate in STEM fields. Generosity comes in many forms. One way in which we support the generosity of Mozzers is to match charitable donations to 501c3 organizations by 150%. We also donated our space 35 times to various organizations in the community requesting to use the Mozplex as a venue for their meetups. Check our our event brochure and take a 360 tour of the Mozplex! Mozzers also donate a ton of time to causes they are passionate about. We also offer a very discounted price for nonprofits that we’re happy many folks take advantage of. We’re passionate about communities and helping folks.Moz partnered with Halo Partners to provide professional coaching to all employees. 54 Mozzers received coaching. 27 Mozzers used this benefit for the first time! I’m a huge believer in coaching and training. Beginner’s mind is how we grow and become the best versions of ourselves. Through it all, we made sure to have some fun. Moz offers a Paid Paid Vacation benefit, reimbursing employees $3k per year in vacation costs. Yes, that’s right. You get your regular pay, plus another $3k a year to spend on your trip! It’s bonkers! Mozzers visited 6 of the 7 continents last year! We also had 7 Mozling babies last year. Luv those babies. Part 6: Into the futureI think my spaceship knows which way to go2017 was a strengthening year for Moz. We went through a lot of change and made some important investments. Mozzers are dynamic, helpful, smart, and hardworking. They have a service orientation and build for the long term. The investments we made in 2017 will bear fruit in the years ahead. And we’re poised to make some ambitious moves in the coming months. While I’m proud of what we’ve accomplished, I believe we have higher mountains still to climb. We have had triumphs and tribulations, heartbreaks and happy dances. These many years later, the SEO industry is healthy, growing, and dynamic. Many organizations are still struggling with basic web presence, let alone thoughtful SEO strategy. Moz is still teensy-tiny compared to the opportunity. I believe the opportunity for SEO expertise is vast. I want to close on a note of gratitude. First, a bunch of folks helped pull together the metrics for our 2017 report, and I am deeply grateful for their help. This post is kind of a bear! Thank you Jess, Felicia, Christian, Kevin, Susan, Michael, Jeremy, and anyone else who pulled data and helped get this post off the ground! Second, thank you to this community. It’s because of you that we are here. This community would be nothing if it wasn’t for your care, attention, and feedback. We will continue to work hard to make your work lives more enjoyable and successful. We want to be your favorite resource for doing great SEO. If we’re not there yet, trust that we will keep working to be. Thank you for the opportunity to serve. Gratitude also to David Bowie for inspiring this post and so much more. We miss you. <3 Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Moz Year in Review 2017"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Moz Year in Review 2017"
    },
    {
      "level": "H2",
      "text": "Part 1: TL;DR"
    },
    {
      "level": "H3",
      "text": "Commencing countdown, engines on"
    },
    {
      "level": "H2",
      "text": "Part 2: Ch-ch-ch... Changes!"
    },
    {
      "level": "H3",
      "text": "Now it's time to leave the capsule if you dare"
    },
    {
      "level": "H2",
      "text": "Part 3: Customer metrics"
    },
    {
      "level": "H3",
      "text": "You've really made the grade"
    },
    {
      "level": "H2",
      "text": "Part 4: Financial performance"
    },
    {
      "level": "H3",
      "text": "And the stars look very different today"
    },
    {
      "level": "H2",
      "text": "Part 5: Inside Moz HQ"
    },
    {
      "level": "H3",
      "text": "The papers want to know whose shirts you wear"
    },
    {
      "level": "H2",
      "text": "Part 6: Into the future"
    },
    {
      "level": "H3",
      "text": "I think my spaceship knows which way to go"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sarah Bird\n          \n            Sarah Bird\n          \n            Sarah Bird"
}