{
  "url": "https://moz.com/blog/moz-movember",
  "slug": "moz-movember",
  "title": "Moz #Movember Kick-Off - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The Moz team is joining the #Movember movement and are growing mustaches to raise awareness for men's health issues. Help us by donating!",
  "content": "Moz #Movember Kick-Off Moz News J By: Justin Vanning November 1, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! J By: Justin Vanning November 1, 2012 Moz #Movember Kick-Off Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Hey Mozzers! This year marks the first year that the Moz staff (of all genders) have banded together to form an official Movember team. What's Movember? Well, Movember is a fundraising effort that started in 2004 to help raise money for men’s health issues. Since then, it has spread to over a hundred countries around the world and has almost one million participants. In 2011, 854,000 Mo-Bros and Mo-Sistas joined the cause to help raise over $126 million to help “change the face of men’s health.” These funds go toward finding cures for men’s health issues such as prostate and testicular cancer. Now that we're almost at 100 employees here at Moz, we thought we could pull together a decent sized team this year. As of today, we have over 30 team members and will work to raise as much money as we can during the month of November. Our famously bearded CEO, Rand Fishkin, has agreed to join the team and is already sporting his new clean-shaven look! Rand in his Halloween costume yesterday How Do I Donate? While growing a mustache for 30 days is probably something many Mozzers would do without any motivation, the main reason we’re doing this is to raise money for charity. We’re also a pretty competitive bunch here at Moz so we want to see how much money we can raise and would love your support. Plus, here’s the best part... now that Moz has a new benefit perk of 150% charity matching, we’ll be able to more than double our final tally with money from Roger! Each Mozzer who is participating has an individual profile page that you can donate to (below). The money each Mozzer raises will go towards our overall team goal. You can also donate directly to the Team MozStaches page here: http://us.movember.com/team/547105 Show Me The Team Here’s a list of each Mozzer who is participating and a link to their profile pages: Patrick Roby Lisa Wildwood Rand Fishkin Joel Day Renea Nielsen Miranda Rensch David Weiser Andrew Mohler Andrew Dumont Aaron Wheeler Matt Peters Douglas Vojir Casey Henry Nick Sayers Jamie Steven Kurtis Bohrnstedt Justin Vanning Chris Auty Stephen Wood Derric Wise Dan Lecocq Abe Schmidt Koos Klevin David Kosciuk Leah Candelaria-Tyler Chiaryn Miranda John Fearnside Devin Ellis Phil Smith Kenny Martin Ethel Evans Richard Nelson Can I Participate Also? Of course! We’d love to see members of the Moz Community also participate in Movember. Think your company can raise more money than us? We welcome any and all friendly competition! Send us your pics of your fine mustaches as well, and we’ll see how they compare to the Mozstaches. Will You Be Documenting This? Why yes we will. We plan on taking photos every day (and posting them to Facebook) to document the mustaches as they grow from infant stage to something Ron Burgundy would be proud of. Also, Roger was pretty darn excited about this chance to raise money for his human counterparts and decided to join in the fun. Keep on the lookout for photos as his robotic stache takes shape. Thanks again for all your support and helping us raise money for charity! #Movember Love During Mozcation Portsmouth, NH! Portsmouth Foursquare is hosting checkin-for-charity at Mozcation to benefit Movember! To participate, check-in on foursquare at The Music Hall during the event and for every person that checks in (up to a swarm badge - 50 people), a donation will be made to the Movember Foundation. If you are interested in sponsoring please let Porstmouth Foursquare know by filling in their form at http://bit.ly/pledge4checkins. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Moz #Movember Kick-Off"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Moz #Movember Kick-Off"
    },
    {
      "level": "H2",
      "text": "What's Movember?"
    },
    {
      "level": "H2",
      "text": "How Do I Donate?"
    },
    {
      "level": "H2",
      "text": "Show Me The Team"
    },
    {
      "level": "H2",
      "text": "Can I Participate Also?"
    },
    {
      "level": "H2",
      "text": "Will You Be Documenting This?"
    },
    {
      "level": "H3",
      "text": "#Movember Love During Mozcation Portsmouth, NH!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Justin Vanning\n          \n            Justin Vanning"
}