{
  "url": "https://moz.com/blog/moz-top-10-best-of-2014",
  "slug": "moz-top-10-best-of-2014",
  "title": "The Best of the Best: Celebrating the Top 10 of the Moz Top 10 for 2014 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We've curated the very best digital marketing content from 2014. Find out who tops this year-end edition of the Moz Top 10 and how you can be a part of the fun.",
  "content": "The Best of the Best: Celebrating the Top 10 of the Moz Top 10 for 2014 Content Marketing | SEO Basics By: Isla McKetta December 31, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Isla McKetta December 31, 2014 The Best of the Best: Celebrating the Top 10 of the Moz Top 10 for 2014 Content Marketing | SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Oh no, another year-end roundup! But before you click away, let me sell you a little on why this is the roundup you actually want to read. You see, to compile the Moz Top 10 over the last year, we probably read 50 or more articles EACH WEEK, that's around 100 articles for every issue. We then spent innumerable hours curating and culling until we could share with you the very best of those articles in the bi-weekly Top 10. So this is not just another listicle. This article is in fact the distillation of the very best content from all over the interwebs for the past year that has anything to do with digital marketing. Basically, we read 2,600 (or so) articles so you don't have to. What does \"best\" mean? There's no formula for what makes an article Top-10 worthy. We look for the best content of each two week period and then try and winnow and fit it until each newsletter contains just the right balance of digital marketing tips, tricks, analysis, and inspiration. We work to reach beyond SEO and find articles that will help people who specialize in content, social, design, UX, and more broaden their skill set and understand the work their marketing compatriots engage in. The mix and style changes as the author of this newsletter changes. I'm biased toward content marketing, Cyrus loves SEO. Trevor's a sucker for a journalistic slant. But whoever is writing the latest edition is trying to find that perfect balance so you come away from the newsletter having found at least one article that teaches you something new, changes the way you think about marketing, or makes your job a little easier. We look for articles by authors new and old that are well written, well illustrated, and comprehensive. Sometimes we publish something because it's a really good resource or because it says the thing that needs to be said. Some pieces make the Top 10 because they are heart-achingly eloquent. And sometimes we include a little something fun, playful, or easy on the eyes (but still educational) at the end to finish your day off right. Then news breaks (ahem, Google) and we reconfigure it all. The Top 10 of the Top 10 For the Top 10 of the Moz Top 10, we could have gone with the most newsworthy content—articles that claim some tactic is dead or some era is over, but Search Engine Land already did that, so I wanted to take a different approach. Instead, I chose the articles from 2014 that endure. Below you'll find articles that continue to inspire, how-tos and guides so comprehensive they deserve a revisit, and, yes, even a few tips and tricks that you should really get to. Without further ado, here are the best of the best… 1. Life is a Game. This is Your Strategy Guide If you can master life, all that marketing stuff is a cake walk. Level up in your day-to-day with this thoughtful, comprehensive, and gorgeous guide from Oliver Emberton. 2. Announcing the All-New Beginner's Guide to Link Building Paddy Moogan knows a thing or two about link building, and here he's teamed up with some folks at Moz to turn all of that information into an easy-to-follow yet comprehensive guide. I had no part in this project, so I can safely tell you I <3 the Zelda references. 3. No Words Wasted: A Guide to Creating Focused Content From getting customer interviews right to nailing content promotion, this massive guide from Distilled covers everything you need to know about content strategy. I learn something new (or rediscover something I should never have forgotten) every time I read it. 4. Micro Data & Schema.org Rich Snippets: Everything You Need to Know If you don't know what micro data are and you haven't figured out what to do with Schema.org, your content marketing is missing a crucial element for SERP success. BuiltVisible to the rescue with this amazing and easy-to-follow guide. 5. The Beginner's Guide to Conversion Rate Optimization If you suspect there's a blockage in your sales funnel, it's time to think about CRO. This guide from Qualaroo will tell you everything you need to know to start pinpointing (and fixing) your barriers to conversion. 6. 2014 Industry Survey Results A survey so big we can only do it once every two years. Peek at salaries, tools, and trends to compare where the digital marketing industry was at the beginning of 2014 to where you are now for a peek at what the future may hold. 7. UX Crash Course: User Psychology Composed of 31 lessons, this online \"course\" will help you understand user motivation and how you can use psychology to massively improve your user experience. 8. A Geek's Guide to Gaming The Algorithms Sometimes looking at information from a slightly different angle makes it easier to digest. In this delightful piece, Ian Lurie teaches us when it's okay to game the algorithms at the same time as he's spelling out, in plain language, what each algorithm update was really about. 9. The Ultimate List of IFTTT Recipes for Marketers Favorite part of this amazingly detailed post from SEER? The fact that it starts from a user's perspective. So whether you want to \"stalk your competitors' stocks\" or \"keep track of industry meetups,\" there's an answer (in the form of an IFTTT recipe) here for you. 10. The Rich Snippets Algorithm So much changed in the realm of rich snippets last year. AJ Kohn delves into the relationship between those rich snippets and knowledge graph results. It's a heady post that just might offer some interesting insight into the future of SERPs. Sign up for the Moz Top 10 Like what you see? Want us to read all the articles while you peruse a summary of the most important things you need to know? Sign up for the Moz Top 10 After you click that big red button, you'll be taken to the Moz Top 10 page and asked to enter your email and hit \"subscribe.\" At that moment we'll put you on the list for the very next edition, currently scheduled for January 13. Submit to the Moz Top 10 And if you're someone who's writing Top-10-worthy content and we just haven't found you yet, we want to read what you've got. So please send us your suggestions. Each edition of the Moz Top 10 only covers content from the most recent two-week period, so send that link while the content is still fresh. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Best of the Best: Celebrating the Top 10 of the Moz Top 10 for 2014"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Best of the Best: Celebrating the Top 10 of the Moz Top 10 for 2014"
    },
    {
      "level": "H2",
      "text": "What does \"best\" mean?"
    },
    {
      "level": "H2",
      "text": "The Top 10 of the Top 10"
    },
    {
      "level": "H3",
      "text": "1. Life is a Game. This is Your Strategy Guide"
    },
    {
      "level": "H3",
      "text": "2. Announcing the All-New Beginner's Guide to Link Building"
    },
    {
      "level": "H3",
      "text": "3. No Words Wasted: A Guide to Creating Focused Content"
    },
    {
      "level": "H3",
      "text": "4. Micro Data & Schema.org Rich Snippets: Everything You Need to Know"
    },
    {
      "level": "H3",
      "text": "5. The Beginner's Guide to Conversion Rate Optimization"
    },
    {
      "level": "H3",
      "text": "6. 2014 Industry Survey Results"
    },
    {
      "level": "H3",
      "text": "7. UX Crash Course: User Psychology"
    },
    {
      "level": "H3",
      "text": "8. A Geek's Guide to Gaming The Algorithms"
    },
    {
      "level": "H3",
      "text": "9. The Ultimate List of IFTTT Recipes for Marketers"
    },
    {
      "level": "H3",
      "text": "10. The Rich Snippets Algorithm"
    },
    {
      "level": "H2",
      "text": "Sign up for the Moz Top 10"
    },
    {
      "level": "H2",
      "text": "Submit to the Moz Top 10"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Isla McKetta\n          \n            Isla McKetta\n          \n            Isla McKetta"
}