{
  "url": "https://moz.com/blog/moz-academy-training-workshops",
  "slug": "moz-academy-training-workshops",
  "title": "Supercharge Your Online Marketing Skills: New Training and Workshops from Moz Academy! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Learning SEO will never be the same with Moz Academy's new paid trainings and workshops. Check out the deets on our brand-new educational program here!",
  "content": "Supercharge Your Online Marketing Skills: New Training and Workshops from Moz Academy! Moz News By: Rachel Goodman Moore June 1, 2016 Table of Contents Copied! By: Rachel Goodman Moore June 1, 2016 Supercharge Your Online Marketing Skills: New Training and Workshops from Moz Academy! Moz News [Estimated read time: 8 minutes] Do you suffer from average ROI and low-to-moderate page optimization scores? Do you feel like your SEO has lost its spark? Have you sensed there’s something “missing” from your digital marketing strategy? If this sounds like you or someone you know, then have I got some good news for you: Announcing Moz’s new and improved workshops and training! Whoa! Let's check it out! If you’ve been looking for a way to improve your marketing strategy and get better results for you or your clients, then Moz’s new training and workshops could be the solution for you. Great! Wait... what? Chris Pratt Great question, reader and Chris. Training and workshop sessions are comprehensive, in-depth, interactive classes designed to help you unleash your inner marketing super power. Every class comes coupled with activities like conducting a full website audit, competitive research exercises, keyword brainstorms, and more. Sound like fun? You bet it does. Almost as much fun as these guys are having: Training AND workshops? What’s the difference? Glad you asked. Here’s the run-down on what workshops and training are all about: Workshops are small group classes lead by a member of the Moz Academy team. They’re open to both Moz subscribers and non-subscribers alike (though it helps to have a Moz subscription or trial), and cover best practices and real-world applications for topics like website audits, keyword research, content marketing, and more. Not just a one-sided webinar, these sessions are meant to be interactive and participants have numerous opportunities to ask questions and dig deeper. What’s more: every student who attends a workshop will leave with a custom worksheet, audit, or other interactive tool. Access to worksheets and other in-class activities are included in the price of each workshop. Custom training is just that: fully customized one-on-one or small group training sessions for organizations who want specialized, focused attention from Moz trainers. Custom training curricula can be designed around whatever SEO and traffic generation topics YOU want to learn about, and individual training sessions are customized to your unique business and industry. Prefer to learn in person, in a real classroom setting? Ask if we can come to you! The best part of both training AND workshops? You’ll leave each session with not only more know-how, but also an actionable plan for how you can improve your strategy moving forward. Paid training?! From Moz?! One of the other things that separates these workshops and trainings from other web-based content Moz has provided in the past: they’re paid. We feel these trainings offer a unique experience for attendees that’s worth the investment, but this is, admittedly, a different route for us. To that end, I wanted to provide some transparency as to why we’ve chosen to offer paid training. The first (and biggest) reason why we decided to go the paid training route? Customers asked for it. Here are a few examples: “Does Moz offer Professional Services?” “We are seeking your support and consultancy on what needs to be done on our website in order to rank higher. If that will cost extra, we will pay. Please advise.” “How much [would it cost] for me to ask you a lot of questions for an hour? I know you guys are the best...would like to do it on the phone...a conference call would be best.” Despite requests like these, we’d always shied away from offering paid education because of the vast number of free resources we already offer. With educational materials like the Moz Blog, Whiteboard Fridays, our Beginner's Guides, and beyond, we weren’t sure a paid option would be valuable or useful for users like you. But as comprehensive as Moz’s free resources may be, they all share two things in common: 1.) They’re self-guided learning tools and 2.) many are one-size-fits-all. Let’s dive into each one of those a bit deeper: An alternative to self-guided learning While self-guided learning is great for some, it’s not a one-size-fits-all solution for all learning styles. Depending on how you learn best, self-serve resources to organize, peruse, and internalize at your own pace can either be the greatest thing since sliced bread or the greatest hurdle to actually learning something new. To ensure we have a great option for everyone who wants to learn how to get more traffic, we created comprehensive paid trainings that combine an engaging experience with a hands-on activity to help attendees apply the topic at hand to solve a real life pain-point for their organizations. From a learning modality perspective, this means we’re able to provide resources for all types of learners — even those who learn best from actually doing an activity at hand. When one-size-fits-all education isn’t enough Best practices are just that — the best practice to employ for most organizations in most scenarios. But many organizations have their own nuances and specific business cases — and for those folks, one-size-fits-all education and strategy shop talk isn’t always going to address the underlying issue or provide the best solution. And sometimes, you may feel like this user: ...I know I have, more times than I can count. To provide a solution for those who feel like one-size-fits-all education isn’t enough for their organization, our custom training option allows us to tailor a unique education program to your specific needs, use cases, and business. At the end of the day, we believe the live interaction with our trainers and hands-on activities in each session make workshops a whole new ballgame when it comes to education from Moz. We also believe that the depth of instruction and take-home collateral they provide is more than worth the investment — training packages are custom-priced, and workshops are $79-per-seat early-bird pricing and $99-per-seat regular pricing. Who are Moz training and workshops for? Come one, come all! Anyone looking to refine their marketing strategy — specifically as it relates to SEO and getting found online — will find a session with their name on it. While most of our current workshop content is focused towards users with advanced beginner-to-intermediate skill levels, we’ll soon be diving deep and creating content for all levels of expertise. Since our training sessions are fully custom, they can be tailored to match you and your team’s skill level. Some other folks who might get the most bang for their buck from Moz Academy: Marketers looking to refine their skills and dive deeper Agencies interested in providing more in-depth audits and insight to clients Organizations looking to expand their capabilities Companies who’ve brought on new employees who need training Intern-training program creators Marketers who have seen stagnant or lackluster results and want to supercharge their strategies This isn’t an exhaustive list by any means — and it isn’t meant to be. Why? Because these classes weren’t designed to fill a specific use case: rather, we created them with a specific persona in mind. That persona is someone who wants to constantly push themselves to dive deeper, learn more, and do better marketing. Why Moz Academy? All GIFs aside, we’re incredibly excited to share these courses with you because we think they’re going to help marketers from all walks of life supercharge their skills and take their strategies to the next level. Instead of only skimming the surface about big-picture best practices and theoretic applications, group workshop and custom training attendees have a chance to dig deep into the details of SEO and inbound marketing strategy and really get their hands dirty. Here’s what a couple recent workshop attendees have had to say: “...the Keyword Planning Worksheet — holy moly that thing is awesome. I'll definitely be using that over and over again.” “Presenter was very knowledgable and this could easily have filled many more hours. Great overview to get started with audits using Moz but also third party tools.” “The technical insights into robots.txt were super helpful — really, the entire workshop was really well done!” “The presenter did a phenomenal job — everything was super clear, engaging, and easy to apply.” Learn more about what we cover in each of these sessions or see what’s coming up over at the Moz workshops and training home. Current topics offered We currently offer workshops covering four topics: Performing website audits Keyword research strategy Content marketing Gaining the competitive edge Looking for something a little more tailored to your organization’s specific needs and interests? Our custom training curricula have covered topics like: Link building Video marketing Identifying your target audience Growing your keyword footprint Local search optimization “That’s great, but what about a class on _____?” A class on what, you say? Let us know in comments section of this post what sessions you’d like to see! While we currently offer our four flagship workshops, we’re ultimately building the program to encompass a course on everything that goes into a comprehensive traffic generation strategy from start to finish. If you’re looking for instruction about a particular topic sooner rather than later, drop us a line and let us know a little bit more about what you’re looking for, by when, and for whom — we’d be happy to help provide some custom training if it makes sense for you. What’s happening to the free videos currently available on Moz Academy? Nothing, for now. We plan on keeping the free video trainings available for a few more months, but will begin phasing them out later this year. We’ll make sure to provide plenty of advance warning before we do so, though. Where are we going from here? Ultimately, we’ll be offering several “tracks” of content that will serve as home to lessons a wide variety of SEO topics (some mentioned above) and at all skill levels. We’d also like to expand just how interactive our courses are (Codeacademy and Treehouse are great inspirations), as well as make it easier for current and future session attendees to connect with each other. We have quite a few other tricks up our sleeves, but you’ll just have to keep an eye on the program to see what we’re up to next! Interested in learning more about Moz workshops or custom training packages? There’s no time like the present! Get started: Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Supercharge Your Online Marketing Skills: New Training and Workshops from Moz Academy!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Supercharge Your Online Marketing Skills: New Training and Workshops from Moz Academy!"
    },
    {
      "level": "H2",
      "text": "Great! Wait... what?"
    },
    {
      "level": "H3",
      "text": "Training AND workshops? What’s the difference?"
    },
    {
      "level": "H2",
      "text": "Paid training?! From Moz?!"
    },
    {
      "level": "H3",
      "text": "An alternative to self-guided learning"
    },
    {
      "level": "H3",
      "text": "When one-size-fits-all education isn’t enough"
    },
    {
      "level": "H2",
      "text": "Who are Moz training and workshops for?"
    },
    {
      "level": "H2",
      "text": "Why Moz Academy?"
    },
    {
      "level": "H3",
      "text": "Current topics offered"
    },
    {
      "level": "H3",
      "text": "“That’s great, but what about a class on _____?”"
    },
    {
      "level": "H3",
      "text": "What’s happening to the free videos currently available on Moz Academy?"
    },
    {
      "level": "H3",
      "text": "Where are we going from here?"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rachel Goodman Moore\n          \n            Rachel Goodman Moore\n          \n            Rachel Goodman Moore"
}