{
  "url": "https://moz.com/blog/moz-and-stat",
  "slug": "moz-and-stat",
  "title": "Moz Acquires STAT Search Analytics: We're Better Together! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We're thrilled to announce our new partnership with STAT Search Analytics! Check out Sarah & Rob's fireside chat and please celebrate with us as we chart the future of SERP analytics together.",
  "content": "Moz Acquires STAT Search Analytics: We're Better Together! Moz News By: Sarah Bird October 10, 2018 Table of Contents Copied! By: Sarah Bird October 10, 2018 Moz Acquires STAT Search Analytics: We're Better Together! Moz News We couldn't be more thrilled to announce that Moz has acquired STAT Search Analytics! It’s not hard to figure out why, right? We both share a vision around creating search solutions that will change the industry. We're both passionate about investing in our customers’ success. Together we provide a massive breadth of high-quality, actionable data and insights for marketers. Combining Moz’s SEO research tools and local search expertise with STAT’s daily localized rankings and SERP analytics, we have the most robust organic search solution in the industry. I recently sat down with my friend Rob Bucci, our new VP of Research & Development and most recently the CEO of STAT, to talk about how this came to be and what to expect next. Check it out: You can also read Rob's thoughts on everything here over on the STAT blog!With our powers combined...Over the past few months, Moz’s data has gotten some serious upgrades. Notably, with the launch of our new link index in April, the data that feeds our tools is now 35x larger and 30x fresher than it was before. In August we doubled our keyword corpus and expanded our data for the UK, Canada, and Australia, positioning us to lead the market in keyword research and link building tools. Throughout 2018, we’ve made significant improvements to Moz Local’s UI with a brand-new dashboard, making sure our business listing accuracy tool is as usable as it is useful. Driving the blood, sweat, and tears behind these upgrades is a simple purpose: to provide our customers with the best SEO tools money can buy. STAT is intimately acquainted with this level of customer obsession. Their team has created the best enterprise-level SERP analysis software on the market. More than just rank tracking, STAT’s data is a treasure trove of consumer research, competitive intel, and the deep search analytics that enable SEOs to level up their game. Moz + STAT together provide a breadth and depth of data that hasn’t existed before in our industry. Organic search shifts from tactics to strategy when you have this level of insight at your disposal, and we can’t wait to reveal what industry-changing products we’ll build together. Our shared values and visionAside from the technology powerhouse this partnership will build, we also couldn’t have found a better culture fit than STAT. With values like selflessness, ambition, and empathy, STAT embodies TAGFEE. Moz and STAT are elated to be coming together as a single company dedicated to developing the best organic search solutions for our customers while also fostering an awesome culture for our employees. Innovation awaits!To Moz and STAT customers: the future is bright. Expect more updates, more innovation, and more high-quality data at your disposal than ever before. As we grow together, you’ll grow with us. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Moz Acquires STAT Search Analytics: We're Better Together!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Moz Acquires STAT Search Analytics: We're Better Together!"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H2",
      "text": "With our powers combined..."
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Our shared values and vision"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Innovation awaits!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sarah Bird\n          \n            Sarah Bird\n          \n            Sarah Bird"
}