{
  "url": "https://moz.com/blog/mozcon-2024-video-bundle",
  "slug": "mozcon-2024-video-bundle",
  "title": "MozCon 2024 Videos Have Arrived! Plus Free Bonus Content - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Unlock the latest SEO insights with MozCon 2024 video bundles, now available for purchase! Plus, enjoy free access to MozCon 2023 videos. Don’t miss out on industry-leading strategies and expert sessions!",
  "content": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!) SEO Events | Moz News By: Melissa Rae Brown July 24, 2024 Table of Contents Copied! By: Melissa Rae Brown July 24, 2024 The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!) SEO Events | Moz News MozCon 2024 was an exciting leap into the future of SEO and digital marketing, once again hosted at the stunning Summit building at the Seattle Convention Center. Nearly 1,000 SEO enthusiasts—both in person and online—gathered for two action-packed days of expert talks, tactical tips, and fun networking with fellow industry pros. The digital marketing landscape is evolving faster than ever, and our 20 speakers delivered cutting-edge insights on leveraging new technologies to stay ahead of the game. On top of that, Rand Fishkin teamed up with Dr. Pete Meyers for a lively fireside chat, addressing the recent Google leak documents and sharing thoughts about the future of the search industry. Couldn't make it to Seattle this year to catch the magic in person? No worries - we're excited to announce that the MozCon 2024 video bundle is now available! Purchase the MozCon 2024 video bundle now! For just $349, you can access all the presentations and speaker decks, featuring 20 talks, a fireside chat, and over 10 hours of content. Watch them as many times as you like! Host a viewing party with your team and plunge into the best digital marketing strategies, data, tools, and resources for the upcoming year. If you'd like a taste of what to expect, check out Garrett Sussman’s illuminating talk: SEO Mind Games: Decode Searcher Bias for Content Success Discover the untapped power of searcher bias in the evolving world of SEO! Garrett examines searchers' psyches, revealing how confirmation bias influences content strategy. From queries like \"Is coffee good for you?\" to the subtleties of conversational search, he considers how biases shape our interactions with Google's AI Overviews. Garrett uncovers a variety of biases affecting the search experience, and offers a cohesive and strategic framework for content creation! Watch the MozCon 2023 videos for free in the Moz SEO Learn Center! Drive Execution & Growth: SEO Audits in 2023 ... and Beyond Aleyda Solis Aleyda demonstrates how comprehensive audits can enhance SEO execution and growth, presenting seven key actions to integrate into your process. She stresses radical audit prioritization, quick wins, quality frameworks, and forecasting while advocating for clear communication of trade-offs and leveraging AI to overcome bureaucratic hurdles. Build Better Backlinks for Local Brands Amanda Jordan Amanda provides valuable insights into building effective backlinks for local brands, underlining the importance of categorizing links by local and topical relevance. She shares practical strategies for analyzing competitors' link profiles and identifying quality local link opportunities, emphasizing that even a single good local link can boost your rankings. Back to the Future: What Marketing History Can Tell Us About the Future Andi Jarvis Andi kicks off the second day of MozCon by reminding us that people - not robots - are at the heart of marketing. He encourages SEOs to engage directly with customers for content ideas and showcases how the classic FAB (Features, Advantages, Benefits) strategy, when reversed, can enhance your efforts! Beyond the Written Word: Future-Proofing Your Content Strategy by Leveraging Multimedia Formats Azeem Ahmad Azeem makes his MozCon debut with a compelling talk on evolving content strategies to stay ahead of the competition. He discusses the shift from basic metrics to advanced data analysis and stresses the crucial importance of understanding what users want and how they want it. Azeem shares actionable tips for creating engaging audio and video content, such as current events commentary and software demos. From Fear to Forward Motion: Navigating the Future of Analytics with Confidence Brie Anderson Brie takes the stage to demystify GA4! She reiterates that while the transition can be challenging, it's a necessary step forward. She outlines key GA4 components: Data Streams, Events, Conversions, and Audiences, illustrating their roles in effective data tracking and reporting. Brie encourages marketers that while GA4's learning curve may be steep, we're all in this together! Own Search: Work Outside of the Google Box Carrie Rose Carrie shares her approach to dominating SERPs across various platforms, not just Google. By leveraging PR, influencer marketing, and SEO-driven strategies, her team increased traffic and conversions for clients. Carrie reminds the audience of the importance of engaging with audiences on platforms like TikTok and Instagram, where users seek real-life experiences and quick answers. Why SEOs Need to Start Playing Offense Instead of Defense Chris Long Chris returns to MozCon with strategies for adopting an offensive SEO approach, underscoring proactive over reactive tactics. He recommends identifying new content opportunities, optimizing key pages, and prioritizing technical SEO issues. Chris also underscores the importance of data-driven initiatives, stakeholder buy-in, and embracing AI to enhance SEO workflows. Views on Views of Video SEO Crystal Carter Crystal’s MozCon talk this year is all about unlocking the potential of video SEO, revealing that video SERPs offer a 20% untapped opportunity for keywords. With video now making up 45% more of SERP space year-over-year, Crystal explains how to harness this trend by optimizing video content, leveraging YouTube’s dominant platform, and ensuring your video webpages meet SEO best practices! Search Data at Scale Daniel Waisberg Daniel offers MozCon attendees the unique opportunity to hear straight from the Google source! Daniel showcases how to leverage Google Search Console’s bulk export features to manage and analyze data at scale. He details the tool’s capabilities, including daily bulk exports segmented by country and device, and provides tips for efficient data analysis! Lower Your Shields: The Borg Are Here Dr. Pete Meyers Our very own Dr. Pete explores how AI is transforming search, highlighting new opportunities for SEOs rather than replacing traditional queries. He discusses AI's limitations with YMYL searches - specifically its tendency to produce inaccurate information - while also showcasing its unique ability to inspire creativity and generate innovative ideas. Check out Dr. Pete's vision on leveraging AI for SEO success! Hiring the Perfect Agency: How to Avoid Getting Burned Duane Brown Duane's MozCon talk accentuates the importance of hiring the right agency to drive business growth. He shares ideas for identifying specific marketing needs, from paid ads to funnel optimization, and introduced the DTC Brand Index to benchmark competitors. Discover Duane's strategies for making informed hiring decisions and tracking success to optimize your campaigns. SEO Co-Conspirators: Navigating Complex Systems Jackie Chu Jackie shares strategies for scaling organic traffic and successfully securing support for SEO projects. She accentuates the importance of aligning with key stakeholders like legal teams for accessibility, business owners for revenue impact, and engineering teams to address technical issues. Jackie demonstrates how to effectively prioritize and advance your SEO initiatives by framing projects in terms of broader business goals! Rethink Your Industry Pages - They’re Not What You Think Jason Dodge Jason urges marketers to rethink industry pages by focusing on customer pain points rather than industry terms. He points out the disconnect between internal sales strategies and actual customer needs, encouraging the use of long-tail keywords and customer language to optimize pages. Learn how Jason's customer-first approach can make your industry pages more relevant and effective! Mind the Gap: Bridging Generational Differences in SEO Jes Scholz Jes walks through the evolution of Google from a search engine to an online ecosystem, emphasizing the importance of establishing your brand as a recognized entity. She shares actionable steps to enhance your brand’s presence in the Knowledge Graph, including defining a brand entity bio, using schema markup, and increasing touchpoints with Google. Headless SEO: I’m Sorry, But This Is Happening Lidia Infante Lidia takes the stage to explain headless SEO, focusing on how it differs from traditional SEO. Headless CMS, which separates content from presentation, offers advantages like content reuse and internationalization but lacks built-in SEO plugins. Don't miss her checklist for turning headless CMS into a powerful SEO asset! Google’s Just Not That Into You: Intent Switches During Core Updates Lily Ray Lily kicks off MozCon 2023 dissecting the impact of Google's core updates and how they affect rankings. Sharing her journey from the 2012 Penguin update to her current expertise, she outlines key areas to address for recovery, including changes in user behavior, world events, and shifts in search relevancy. Lily emphasizes the importance of understanding various search intents and creating relevant content to adapt to inevitable intent shifts. How to Use Brand SEO to Future-Proof Your Online Visibility Miracle Inameti Miracle discusses the importance of brand SEO in an era of changing search algorithms and rising advertising costs. She shares actionable tips to optimize knowledge panels, dominate brand SERPs, and infuse brand personality into content strategies. She also stresses the need for cross-team collaboration and building trust through reviews and UX. Discover Miracle's strategies to enhance your brand's online visibility! Down the Mountain Noah Learner Noah’s talk outlines a four-step career growth framework: Go Wide by building a versatile skillset, Go Deep by finding your passion and connecting with mentors, Go Big by creating and sharing content, and Give Back by mentoring others and sharing your experiences. This approach helps you grow professionally and contribute meaningfully to others’ success. The Evolution of Content & the Future of Our Industry Ross Simmonds Ross wraps up day one of MozCon by challenging the notion that AI-written content can’t drive results. Instead, he details how AI can augment your skills, enhance content creation, and streamline your SEO efforts. Ross shares practical ways to integrate AI, from researching and creating content to optimizing and distributing it. His key message? Use AI as a tool to electrify your strategy, not replace it. ​​Entities Are the Past: Search Is Going Multidimensional Tom Anthony Tom explains the shift from entity-based to context-driven search, surfacing the evolving role of keywords and the impact of latent spaces and GPT models. He discusses how modern search habits and explicit context are shaping the next era of search and offers predictions and tips for optimizing content! The SERP is Dead, Long Live the SERP Tom Capper Tom Capper discusses the evolution of SEO and its ongoing relevance despite several \"deaths\" of SEO, from Google Ads to zero-click searches. He explains that Google's Search Generative Experience (SGE) is not performing as expected and often overlaps with or replicates existing features. He makes recommendations for future SEO success, including Google Business Profiles, Google Shopping, and maintaining a human-centered approach to content! The Great Reset Wil Reynolds Wil closes out MozCon 2023 by highlighting the current SEO transformation and the importance of recognizing and pivoting at key inflection points. He discusses the challenges of content saturation and the need for deeper customer insights, recommending tools like Seer Interactive's ‘Supernova and Looker Dashboards to track trends. Discover Wil's approach to leveraging AI technologies and data analysis! The MozCon 2024 video bundle is just a click away… Craving more cutting-edge aha moments and actionable takeaways? Dive into the MozCon 2024 video bundle for just $349 and unlock: 21 sessions from top digital marketing expertsInstant access on your computer, tablet, or mobile deviceDownloadable slide decks for every presentation Purchase the MozCon 2024 video bundle now! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H2",
      "text": "SEO Mind Games: Decode Searcher Bias for Content Success"
    },
    {
      "level": "H2",
      "text": "Watch the MozCon 2023 videos for free in the Moz SEO Learn Center!"
    },
    {
      "level": "H3",
      "text": "Drive Execution & Growth: SEO Audits in 2023 ... and Beyond"
    },
    {
      "level": "H3",
      "text": "Build Better Backlinks for Local Brands"
    },
    {
      "level": "H3",
      "text": "Back to the Future: What Marketing History Can Tell Us About the Future"
    },
    {
      "level": "H3",
      "text": "Beyond the Written Word: Future-Proofing Your Content Strategy by Leveraging Multimedia Formats"
    },
    {
      "level": "H3",
      "text": "From Fear to Forward Motion: Navigating the Future of Analytics with Confidence"
    },
    {
      "level": "H3",
      "text": "Own Search: Work Outside of the Google Box"
    },
    {
      "level": "H3",
      "text": "Why SEOs Need to Start Playing Offense Instead of Defense"
    },
    {
      "level": "H3",
      "text": "Views on Views of Video SEO"
    },
    {
      "level": "H3",
      "text": "Search Data at Scale"
    },
    {
      "level": "H3",
      "text": "Lower Your Shields: The Borg Are Here"
    },
    {
      "level": "H3",
      "text": "Hiring the Perfect Agency: How to Avoid Getting Burned"
    },
    {
      "level": "H3",
      "text": "SEO Co-Conspirators: Navigating Complex Systems"
    },
    {
      "level": "H3",
      "text": "Rethink Your Industry Pages - They’re Not What You Think"
    },
    {
      "level": "H3",
      "text": "Mind the Gap: Bridging Generational Differences in SEO"
    },
    {
      "level": "H3",
      "text": "Headless SEO: I’m Sorry, But This Is Happening"
    },
    {
      "level": "H3",
      "text": "Google’s Just Not That Into You: Intent Switches During Core Updates"
    },
    {
      "level": "H3",
      "text": "How to Use Brand SEO to Future-Proof Your Online Visibility"
    },
    {
      "level": "H3",
      "text": "Down the Mountain"
    },
    {
      "level": "H3",
      "text": "The Evolution of Content & the Future of Our Industry"
    },
    {
      "level": "H3",
      "text": "​​Entities Are the Past: Search Is Going Multidimensional"
    },
    {
      "level": "H3",
      "text": "The SERP is Dead, Long Live the SERP"
    },
    {
      "level": "H3",
      "text": "The Great Reset"
    },
    {
      "level": "H2",
      "text": "The MozCon 2024 video bundle is just a click away…"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H3",
      "text": "How to Prepare for an SEO Conference, Including MozCon"
    }
  ],
  "author": "Melissa Rae Brown\n          \n            Melissa Rae Brown\n          \n            Melissa Rae Brown"
}