{
  "url": "https://moz.com/blog/mozcon-local-business-takeaways",
  "slug": "mozcon-local-business-takeaways",
  "title": "5 Local Business Marketing Takeaways from MozCon Virtual 2021 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Miriam shares her insights from some of the most relevant and exciting presentations at MozCon Virtual 2021 — learnings you can put to work for the local businesses you’re promoting.",
  "content": "5 Local Business Marketing Takeaways from MozCon Virtual 2021 Local SEO | SEO Events By: Miriam Ellis August 9, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis August 9, 2021 5 Local Business Marketing Takeaways from MozCon Virtual 2021 Local SEO | SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. What a treat to experience three days of deep learning at MozCon Virtual 2021 with some of the world’s most respected digital marketing professionals. While only one of the sessions was specifically focused on local business strategy, it’s my local SEO bias to see everything through that lens. I took pages of notes of tips that I know will have tremendous applicability for local business owners and their marketing partners. The MozCon 2021 video bundle is now on sale for anyone who couldn’t make it to the conference, and today I’d like to give you a taste of what you stand to learn from some of the most relevant and exciting presentations, which you can put to work for the local businesses you’re promoting. Get the MozCon Virtual 2021 Video Bundle! 1. Studies begin to surface Google Posts strategies Google Posts have existed for about five years, but it’s only recently that we’ve started to see studies done that identify winning tactics utilizing them. Joy Hawkins was our one strictly-local expert at MozCon 2021, and she used her speaker spot to set out a smörgåsbord of Google Posts tips for viewers based on her agency’s testing. Here were some of my favorites: Offer and COVID-type Posts received the most clicks in 2020, and posts featuring specials are clear winners.Don’t use stock photography, but do use text in your images to increase engagement.Have fun with emojis in your posts — they increase clicks! These are just a few of the takeaways you’ll derive from Joy’s session, with the overall understanding that, while posts don’t appear to have a direct impact on local pack rank, they can influence local justifications for 60 days at a clip, and, of course, boost traffic to your website! 2. Local customers need information, even amid disruption I picked up a running theme in the outstanding presentations by Shannon McGuirk, Cyrus Shepard, and Ross Simmonds: the COVID-19 pandemic has definitely not decreased the public’s need for information from the Internet. Each speaker approaches this phenomenon from a different angle: Shannon’s company lost 50% of its revenue in the first couple weeks of the pandemic and had to transition from long-term content planning to a more reactive style of marketing that is able to move quickly with the times. Just like virtual businesses, local ones are encountering a scenario in which it’s harder to plan promotional activities, especially when there are fewer available local journalists to outreach to. Shannon’s presentation offers up, in extremely transparent detail, how her company has learned to survive amid disruption.Cyrus explains how the patents Google is investing in surrounding user behavior set goals for businesses to be the first click, the long click, and the last click for searchers. With the right content, your local business should be the resource the public chooses first from Google’s results, stays on longest, and then doesn’t need to navigate away from because their needs have been met. As Cyrus explains, “User satisfaction is the #1 ranking factor!”Ross explains why you need to think of your brand as a media company, and predict what will be important to your community so that you can invest in relevant content. This is a guiding principle in Moz’s Essential Local SEO Strategy Guide in which we urge local business owners to see themselves as publishers. 3. Sorry, but your local business website has content decay It may feel a bit like you’re sitting in a dentist’s chair hearing this, but thankfully, Kameron Jenkins from Shopify has a remedy for this scenario, in which traffic to your website’s older pages and posts naturally deteriorates over time. If your local business relies on content publishing to generate traffic and revenue, content decay is a big problem (and a continuous one) because your articles are always getting older. The solution to this is to have an ongoing content refresh strategy in which you identify and update aging articles to keep them relevant. But the larger your content library is, the harder it can be to accomplish this task. In fact, Kameron found that 25% or less of content marketers’ time is spent on content refreshes. The good news is that a combination of free tools can make it much easier for you to start reversing decay. To wit: The free “landing pages” report in Google Analytics lets you set a date range to see which of your content assets are losing traffic over time.Google Search Console is also free and lets you see which assets are losing search positions over time. Back in Google Analytics, the Goal Conversion Rate and Completions columns show you which of your assets have the highest conversion rates, helping you prioritize refreshing older assets that have the potential to deliver the most conversions if you update them. If you purchase the MozCon 2021 video bundle, you’ll see all the screenshots in Kameron’s tutorial, and she will walk you through considering how to refresh a page to give it a new competitive advantage with original research, fresh quotes from experts, improved internal links and more! Any local business that has seriously embraced publishing as core to their online marketing strategy should see meaningful benefits from learning to refresh decaying content instead of letting it sit unmanaged. 4. A touch of expertise can make a ton of difference in a local context Many speakers at MozCon consult with large enterprise clients and are always having to look hard for tactics that can set brands apart in ultra-competitive markets. The great news for local businesses and their agencies is that our markets are, by nature, limited to local geography, meaning that nifty tactics can provide enormous wins for us within a set city or region! Check out Joyce Collardé’s side-by-side comparison of a client on the left using video schema markup vs. a brand on the right without schema. Imagine how your local business can command more screen space, with just a touch of technical know-how: She also has a ton of great tips for B2B models, many of which are, of course, local! Meanwhile, Lily Ray’s phenomenal presentation is a must-watch for any local business in an industry that has a direct impact on people’s lives and finances (think doctors, dentists, financial advisors, etc.). Lily demonstrates the massive changes that have taken place in organic search engine results since Google’s 2018 “Medic” update, favoring brands that meet Google’s criteria for expertise, authoritativeness, and trustworthiness (E-A-T). If your business is in a your-money-or-your-life (YMYL) category, learning to bake E-A-T into your content and marketing strategies can give you a significant lift in your local market. Rob Ousbey mentions a favorite tool of mine for finding local linktations: Link Intersect. Then he turns this idea on its head with a new Moz alpha experiment called Topical Link Finder to help you find topically-relevant link opportunities for keywords your competitors are ranking for. Moz Pro and Moz community members are invited to play with this tool, and I think it could be a great advantage for local businesses seeking industry links. While you’re at it, check out the alpha of the On-page Keyword Grouper to help you determine when to break up a topic into multiple pages instead of putting it all on a single URL. Finally, Casie Gillette’s reference to Recordit that lets you custom create GIFs immediately brought to mind Darren Shaw’s recent discovery that you can use these instead of static images on Google My Business Products if you save them as a JPEG instead of a GIF. Don’t go overboard, but subtle animation could really help your local business’ products stand out! 5. Buck local trends and dare to be different Multiple MozCon 2021 speakers warned against running a business on assumptions. There are always news trends in marketing and shiny new things in the way of tech and strategy, but what actually matters is what works for your customers. For example: Casie Gillette, mentioned above, made a great point in reminding us that there’s a widespread narrative that “print is dead”. Tell that to Yankee Candles, whose print catalogues played a key role in their 122.9 million sales in 2020. It wasn’t long ago that almost everyone assumed the milkman was a thing of the past. Not so! Takeaway: don’t just latch onto fads. You may read that your local business needs to invest hours a week on social media marketing, but if your own customers are telling you that what they really want is home delivery, or better-trained staff, or a cleaner store...put your money there and give it to them! Moz’s own Dr. Peter J. Meyers reminds us that our brick-and-mortar competitors may not be the same as our competitors in the organic SERPs. You’ve got to study the results that come up for the searches that matter to your specific customers to see whether you’re right about who is actually competing with you there for important phrases. Wil Reynolds advises bringing a small ego to the SEO process, and a willingness to be wrong and question everything. He urges brands to make marketing decisions on the basis of data, summing it up deftly: The less you understand your customer, the more you spend to acquire them. It’s my take that local business owners have an advantage over their virtual counterparts, because you live where your customers do and may even have been absorbing the culture of your town or city your whole life. In the local context, tech is there to make talk easier, and your highest-level takeaways from the MozCon 2021 video bundle will be a new level of confidence and expertise to make you a more thoughtful, equipped communicator. Your online-only colleagues have to take these skills into a vast arena, competing with everyone in the world to be heard. But for you, marketing a local business, an educational investment in yourself and your team can give you an extraordinary boost along the worthy journey of becoming a local household name. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "5 Local Business Marketing Takeaways from MozCon Virtual 2021"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "5 Local Business Marketing Takeaways from MozCon Virtual 2021"
    },
    {
      "level": "H2",
      "text": "1. Studies begin to surface Google Posts strategies"
    },
    {
      "level": "H2",
      "text": "2. Local customers need information, even amid disruption"
    },
    {
      "level": "H2",
      "text": "3. Sorry, but your local business website has content decay"
    },
    {
      "level": "H2",
      "text": "4. A touch of expertise can make a ton of difference in a local context"
    },
    {
      "level": "H2",
      "text": "5. Buck local trends and dare to be different"
    },
    {
      "level": "H2",
      "text": "The MozCon 2021 Video Bundle is here!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}