{
  "url": "https://moz.com/blog/mozcation-2012-nominate-your-city",
  "slug": "mozcation-2012-nominate-your-city",
  "title": "#MozCation 2012 - Nominate Your City For an SEOmoz Meetup! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Hello again friends! It's been a while since our last MozCation conversation. I'm sure you thought we'd forgotten about it, but not to worry, it's time again for another round of MozCation meetups!",
  "content": "#MozCation 2012 - Nominate Your City For an SEOmoz Meetup! Moz News By: Jennifer Sable Lopez July 12, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jennifer Sable Lopez July 12, 2012 #MozCation 2012 - Nominate Your City For an SEOmoz Meetup! Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Hello again friends! It's been a while since our last MozCation conversation. I'm sure you thought we'd forgotten about it, but not to worry, it's time again for another round of MozCation meetups! Last year when we introduced MozCation, we never imagined we'd end up traveling all around the world to meet fellow mozzers. We had an amazing time meeting the community and learning about inbound marketing and getting to know some new cities and countries. We've been planning some fun new projects and have been a bit heads down so far this year. But we're finally ready to get our MozCation on! But what exactly is a MozCation you ask? It's a meetup in your city with several MozStaff and a few hundred (or 20) of your local marketers. The events are free and we usually have 3-4 speakers including some local experts. There will be drinks, food, networking and lots to learn! But before we can make it happen, you need to tell us why we should pick your city. Take a peek at the nominations from last year to get an idea of what we're looking for. But here's the thing, obviously you know your city better than we do. So we're asking you to put together some piece of content to tell us why we should plan a meetup in your town. We want you to get creative here. Nominating your city is easy. Just follow the steps below: 1. Create some amazing content to tell us why your city is awesome Tell us why your city (town, area, whatever) is perfect for a meetup of online marketers. It doesn't matter if it's a big city or a small town, if you're in the United States or Timbuktu. What types of content can you come up with? Get creative, but here are some examples: A video: Show us the sights, get your friends together a do a quick jig, tell the camera why your town is the best. [As an example, watch this great video by Clearlink from last year.] A blog post: Make the case using your brilliant writing skills. Do you have an amazing fountain in your town, is there a great brew pub, do you and your friends meet and talk SEO every single day? [See this great example from Experts Exchange.] A website: Show off your city by creating a whole website. Think we're crazy?? All four winning cities last year created websites: Salt Lake City, Sao Paulo, Lima, Barcelona (site isn't working). A song: Are you musically gifted? Write a song and tell how why we should come to your town. A photo: Is there one perfect shot that explains your city? Can you take a picture of the 30 people who would come? Take it, and link to it! [Or maybe lots of photos to show us why your city rules, as Location3 did last year.] A drawing: Perhaps you're more inclined to draw it out. Show us why the Mozzers should invade your area. You can go in on it with several people in your area to try to combine your efforts even. We're open to going pretty much anywhere and who knows, you may even meet some new people! An image that Mark Barrera used to promote Dallas last year. 2. Complete the nomination form with a link to your content: 3. Send a tweet to share your nomination with the world! Once the content is created, use the form on the MozCation page to create a nominating tweet. Add the link to your content, the location you'd like us to come to, hit submit, then send the tweet it creates. Bam! You're done. :) And be sure to get friends in your town to tweet (or re-tweet) your link for further consideration! Deadline for nomination is July 26th for both of our 2012 events! We'll have two meetups this year, and we'll be choosing both locations from this round of submissions. You better get moving though, you have only two weeks to get your content created and your nomination in. So what are you waiting for?? Time is ticking away! We Pick The City Once the nominations are closed, we'll go through all the entries and pick the two most compelling entries. Remember we're open to going to smaller cities, just give us a good reason why we should! Getting retweets on your submission can help, but it's not a necessity. We're making the final call, so if the best content comes from an entry with 2 tweets, it's all good. What is an SEOmoz Meetup Anyway? Each time we plan a meetup it's slightly different based on the city we'll be in, event location, etc. But normally it runs 2-3 hours, we like to get 2-4 industry leaders to speak to the group, and there's always plenty of food and drinks to go around. We think these are ideal situations to meet with and give back to the community. Most times we'll give away some kind of swag and we'll always have a discount to try out our PRO membership. Questions, Questions and More Questions I know, you have lots of questions right? Check out the official MozCation page for a lot more information and details about the events. But don't think too much about it. :) Create some compelling content telling us why your city is the perfect place for an SEOmoz Meetup, and we'll figure out the rest! We look forward to the nominations and we'll be retweeting some of the best ones we see come through. Now it's time to get crackin' folks and create something awesome. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "#MozCation 2012 - Nominate Your City For an SEOmoz Meetup!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "#MozCation 2012 - Nominate Your City For an SEOmoz Meetup!"
    },
    {
      "level": "H2",
      "text": "1. Create some amazing content to tell us why your city is awesome"
    },
    {
      "level": "H2",
      "text": "2. Complete the nomination form with a link to your content:"
    },
    {
      "level": "H2",
      "text": "3. Send a tweet to share your nomination with the world!"
    },
    {
      "level": "H2",
      "text": "Deadline for nomination is July 26th for both of our 2012 events!"
    },
    {
      "level": "H2",
      "text": "We Pick The City"
    },
    {
      "level": "H2",
      "text": "What is an SEOmoz Meetup Anyway?"
    },
    {
      "level": "H2",
      "text": "Questions, Questions and More Questions"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez"
}