{
  "url": "https://moz.com/blog/mozcon-speaker-interview-carrie-gouldin",
  "slug": "mozcon-speaker-interview-carrie-gouldin",
  "title": "#MozCon Speaker Interview: Carrie Gouldin - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Recently, we got the chance to talk to Carrie Gouldin about her dynamic web community manager job at ThinkGeek, social metrics, and how a well-coordinated social media response helped ThinkGeek turn around an internet meltdown.",
  "content": "#MozCon Speaker Interview: Carrie Gouldin SEO Events By: Lindsay Wassell July 8, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Lindsay Wassell July 8, 2013 #MozCon Speaker Interview: Carrie Gouldin SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As Web Community Manager @ThinkGeek, Carrie Gouldin built the company’s social media presence from the ground up and now engages hundreds of thousands of followers through multiple social platforms. We’re excited that she is bringing her valuable insights about social media to MozCon! In her talk, “Using Metrics to Build Social Media Engagement,” she’ll share practical advice about how to track links, read metrics, and keep your followers hungry for more. Recently, we got the chance to talk to her about her dynamic job, social metrics, and how a well-coordinated social media response helped ThinkGeek turn around an internet meltdown. Tell us about the presentation you have planned for MozCon. I'm going to talk about how the right content at the right time and the right metrics tracked with the right tools drives ThinkGeek's social program. I'll show examples of the kind of stuff that gets us thousands of retweets and a 25-50% Talking About This rate on Facebook, some of our behind-the-scenes data on traffic and revenue, and tips and tests you can try right away. You’re currently the web community manager at ThinkGeek. Could you tell us a bit about how you got into that role? I started at ThinkGeek almost five years ago. At that time, ThinkGeek had a very strong brand and passionate fans, but we weren't really available to our customers out there on social networks. I came in at the right time — before Oprah joined Twitter, even — and was able to start building a community organically and trying new things without the burden of so-called \"best practices.\" It also wasn't my only role (and still isn't; I also head up our email program), so I was able to justify my existence beyond Faceyspaces and Twitlogs to those who were on the fence about the value of social networks for internet retailers. What do you think are the top three qualities of an effective web community manager? First and foremost, 100% dedication to the brand, values, and public persona of the company they represent. If they're going to manufacture the Kool-Aid, they have to drink it first. This is why I feel social media should always be kept in-house. Second, the ability to communicate clearly, interestingly, and like a real human being — which is to say with humor, compassion, and enthusiasm. That includes strong (and concise!) writing skills, some Photoshop mojo, experience with HTML and web publishing, and unflagging attention to detail. And lastly, a thick skin and knowing when to take a break. Being at the beck and call of the internet is not easy. Which social metric do you think is widely undervalued? Engagement is undervalued, and the metric depends on the network. What good is a jillion followers if none of them clicks your links or retweets or shares your content? On the other hand, revenue and traffic are valued but traditionally achieved through paid placements like boosted Facebook posts or sponsored tweets, while we treat our social streams like network television with great content surrounding our commercials, which does work for us. We haven't seen boosted posts pay off for us on Facebook, but remarketing ads (not under the purview of our \"community\" team) can be successful. Give us an example of one important test that any business on Facebook should do in the process of building social media engagement. On Facebook, try the same content two ways at the same time of day, one day apart. It's hard to do A/B tests given the nature of the tools we have--that is, in most cases, everyone sees the same thing at the same time--so you have to be creative. I'd suggest an image + text post on Facebook on the same subject versus the same text without an image. Which does better on shares? Clicks? Comments? Reach? Revenue? Facebook targets different kind of content to different users based on their past engagement history, so you might see very different results. A couple months ago, ThinkGeek was caught in the crossfire between FOX and sellers on Etsy, but ThinkGeek came out of it looking great. Can you share a bit about how social media helped manage ThinkGeek’s reputation in this incident, and any insights you gained from the experience? For those playing along at home, the issue was over a licensed knit hat from Joss Whedon's short-lived space western Firefly, owned by FOX. The show ranks up there with Doctor Who, Star Wars, and Star Trek in terms of the geek lexicon, and the hat in question became a symbol of both rebelling against the man (because of the character who wore it) and helping others out (with charitable donations from the purchase of hand-made knit hat replicas on sites like Etsy). So when an unnamed source (a.k.a. the man) went after many unlicensed Etsy sellers (the rebels with hearts of gold) with cease and desist orders, the internet exploded. Our licensed version of the hat (made by another company that is not us) is visible out there in the geekiverse so we got a lot of questions and accusations about our role in the matter via email, Twitter, Facebook, Google+, our blog, our Jayne hat product page comments, the phone — every possible method of contact. First, there was a collective \"WHAT JUST HAPPENED?\" at ThinkGeek HQ, and we told customers we didn't know what was going on (which was true) but we'd find out. After some triage behind the scenes, we learned it was FOX — generally unloved by fans because FOX is the reason the show was cancelled in the first place — that had contacted Etsy. As quickly as we could, we published a blog post explaining our side of things. Neither we nor the licensors who make the hat had any role in it, but then the story changed to \"Well, if you didn't sell it, this wouldn't happen.\" That may or may not be true. FOX would have likely tried to protect their intellectual property regardless, but there we were still selling the hat. So, after much consternation about how to turn our problem into a solution befitting the charitable roots of the hat, we published another post the following day announcing our donation of the proceeds to Can't Stop the Serenity, a Browncoat charity that supports Equality Now: Then Nathan Fillion, who starred in Firefly, very kindly tweeted about the steps we'd taken: Which was very much appreciated by us (because we're fans so OMG <3 NATHAN)... but crashed our blog, and spawned the hashtag #Fillioned. All in all, a good ending to two long days. What did we do that made this work out? We were honest, acted quickly, and responded in the manner that honored and respected the spirit of the hat and the fandom surrounding it. Pretty simple, but in practice it takes serious coordination to pull a response like that together. What is your geekiest hobby? MY JOB. Seriously. Curating a collection of 100+ fan-made cosplay outfits for a stuffed monkey who meets geek celebrities like Adam Savage, Wil Wheaton, and the voice of GLaDOS should count for something. What is a quote that has stuck with you, and why? \"Brevity is the soul of wit\" from Shakespeare's Hamlet. Comes in handy for Twitter-zen. If you had to be trapped in a TV show for a month, which would you choose? I should say Game of Thrones to stay on message but that's just about the very last universe I'd want to find myself trapped in. My top pick would be Downton Abbey so I could I hang with the Dowager Countess. It was great to speak with you, Carrie! Get geeky updates by following @ThinkGeek on Twitter, and learn test-driven social media tips by checking out Carrie’s presentation at MozCon! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "#MozCon Speaker Interview: Carrie Gouldin"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "#MozCon Speaker Interview: Carrie Gouldin"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Lindsay Wassell\n          \n            Lindsay Wassell\n          \n            Lindsay Wassell"
}