{
  "url": "https://moz.com/blog/mozcon-final-agenda-2019",
  "slug": "mozcon-final-agenda-2019",
  "title": "The 2019 MozCon Final Agenda Has Arrived! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The final agenda for MozCon 2019 is locked in and ready to go! Check out who's speaking, what topics you can expect, and dream about all the delish snacks you'll nosh on during the breaks.",
  "content": "The 2019 MozCon Final Agenda Has Arrived! Advanced SEO | Moz News | SEO Events By: Cheryl Draper June 6, 2019 Table of Contents Copied! By: Cheryl Draper June 6, 2019 The 2019 MozCon Final Agenda Has Arrived! Advanced SEO | Moz News | SEO Events If you can believe it, we’re only about a month away from MozCon 2019! July 15th can’t come soon enough, am I right?! In March, we announced the initial agenda and in May we announced our community speakers. Today, we’re excited to bring you our final agenda — a fully loaded list of all the knowledge you can expect to gain from this year's conference. Haven't snagged your ticket yet? Don't worry — we still have some left!: I'm going to MozCon! With the schedule set and the speakers hard at work polishing their presentations, here’s a look at the three action-packed days we have planned for you. Monday, July 15th 7:30am–9:00am Breakfast & registration 9:00am–9:20am Welcome to MozCon 2019! Sarah Bird, CEO of Moz Our vivacious CEO will be kicking things off early on the first day of MozCon with a warm welcome, laying out all the pertinent details of the conference, and getting us in the right mindset for three days of learning. 9:20am–10:00am Web Search 2019: The Essential Data Marketers Need Rand Fishkin, Sparktoro It's been a rough couple years in search. Google's domination and need for additional growth has turned the search giant into a competitor for more and more publishers, and plateaued the longstanding trend of Google's growing referral traffic. But in the midst of this turmoil, opportunities have emerged, too. In this presentation, Rand will look not only at how Google (and Amazon, YouTube, Instagram, and others) have leveraged their monopoly power in concerning ways, but also how to find opportunities for traffic, branding, and marketing success. 10:00am–10:30am Human > Machine > Human: Understanding Human-Readable Quality Signals and Their Machine-Readable Equivalents Ruth Burr Reedy, UpBuild The push and pull of making decisions for searchers versus search engines is an ever-present SEO conundrum. How do you tackle industry changes through the lens of whether something is good for humans or for machines? Ruth will take us through human-readable quality signals and their machine-readable equivalents and how to make SEO decisions accordingly, as well as how to communicate change to clients and bosses. 10:35am–11:15am Morning break 11:15am–11:45am Improved Reporting & Analytics Within Google Tools Dana DiTomaso, Kick Point Covering the intersections between some of our favorite free tools — Google Data Studio, Google Analytics, and Google Tag Manager — Dana will be deep-diving into how to improve your reporting and analytics, even providing downloadable Data Studio templates along the way. 11:45am–12:15pm Local SERP Analytics: The Challenges and Opportunities Rob Bucci, Moz We all know that SERPs are becoming increasingly local. Google is more and more looking to satisfy local intent queries for searchers. There's a treasure-trove of data in local SERPs that SEOs can use to outrank their competitors. In this session, Rob will talk about the challenges that come with trying to do SERP analytics at a local level and the opportunities that await those who can overcome those challenges. 12:20pm–1:50pm Lunch 1:50pm–2:20pm Keywords Aren't Enough: How to Uncover Content Ideas Worth Chasing Ross Simmonds, Foundation Marketing Many marketers focus solely on keyword research when crafting their content, but it just isn't enough if you want to gain a competitive edge. Ross will share a framework for uncovering content ideas leveraged from forums, communities, niche sites, good old-fashioned SERP analysis, tools and techniques to help along the way, and exclusive research surrounding the data that backs this up. 2:20pm–2:50pm How to Supercharge Link Building with a Digital PR Newsroom Shannon McGuirk, Aira Digital Everyone who’s ever tried their hand at link building knows how much effort it demands. If only there was a way to keep a steady stream of quality links coming in the door for clients, right? In this talk, Shannon will share how to set up a \"digital PR newsroom\" in-house or agency-side that supports and grows your link building efforts. Get your note-taking hand ready, because she’s going to outline her process and provide a replicable tutorial for how to make it happen. 2:55pm–3:35pm Afternoon break 3:35pm–4:05pm From Zero to Local Ranking Hero Darren Shaw, Whitespark From zero web presence to ranking hyper-locally, Darren will take us along on the 8-month-long journey of a business growing its digital footprint and analyzing what worked (and didn’t) along the way. How well will they rank from a GMB listing alone? What about when citations were added, and later indexed? Did having a keyword in the business name help or harm, and what changes when they earn a few good links? Buckle up for this wild ride as we discover exactly what impact different strategies have on local rankings. 4:05pm–4:45pm Esse Quam Videri: When Faking It Is Harder than Making It Russ Jones, Moz Covering a breadth of SEO topics, Russ will show us how the correct use of available tools makes it easier to actually be the best in your market rather than try to cut corners and fake it. If you're a fan of hacks and shortcuts, come prepared to have your mind changed. 7:00–10:00 pm Monday Night Welcome Party Join us for a backyard tiki bar party at beautiful Block 41 in Belltown. Meet with fellow marketers over drinks, music, and catching sun on the patio. We look forward to bringing our community together to inaugurate MozCon on this special night. See you there! Tuesday, July 16th 8:30am–9:30am Breakfast 9:30am–10:00am Building a Discoverability Powerhouse: Lessons from Merging an Organic, Paid, & Content Practice Heather Physioc, VMLY&R Search is a channel that can’t live in a silo. In order to be its most effective, search teams have to collaborate successfully across paid, organic, content and more. Get tips for integrating and collaborating from the hard knocks and learnings of merging an organic, paid and performance content team into one Discoverability group. Find out how we went from three teams of individual experts to one integrated Discoverability powerhouse, and learn from our mistakes and wins as you apply the principles in your own company. 10:00am–10:30am Brand Is King: How to Rule in the New Era of Local Search Mary Bowling, Ignitor Digital Get ready for a healthy dose of all things local with this talk! Mary will deep-dive into how the Google Local algorithm has matured in 2019 and how marketers need to mature with it; how the major elements of the algo (relevance, prominence, and proximity) influence local rankings and how they affect each other; how local results are query-dependent; how to feed business info into the Knowledge Graph; and how brand is now \"king\" in local search. 10:35am–11:15am Morning break 11:15am–11:45am Making Memories: Creating Content People Remember Casie Gillette, KoMarketing We know that only 20% of people remember what they read, but 80% remember what they saw. How do you create something people actually remember? You have to think beyond words and consider factors like images, colors, movement, location, and more. In this talk, Casie will dissect what brands are currently doing to capture attention and how everyone, regardless of budget or resources, can create the kind of content their audience will actually remember. 11:45am–12:25pm 20 Years in Search & I Don't Trust My Gut or Google Wil Reynolds, Seer Interactive What would your reaction be if you were told that one of Wil's clients got more conversions from zero-volume search terms than search terms with 1000+ searches per month? It's true. Wil found this out in seconds, leading him to really look at his whole client strategy through a new lens. It also made him question company-wide strategies. How prevalent is this across all clients? Don't they all deserve to get these insights? It required him to dig into the long tail, deep. To use big data and see PPC data as insights, not just marketing.What would your reaction be if you were told that Google's \"bad click\" business could be generating as much annually as Starbucks or McDonalds? Wil will be making the case for big data, agencies, and why building systems that looking at every single search term you get matched to is the future of search marketing. 12:30pm–2:00pm Lunch 2:00pm–2:15pm Super-Practical Tips for Improving Your Site's E-A-T Marie Haynes, Marie Haynes Consulting Inc. Google has admitted that they measure the concept of \"Expertise, Authoritativeness, and Trustworthiness\" in their algorithms. If your site is categorized under YMYL (Your Money or Your Life), you absolutely must have good E-A-T in order to rank well. In this talk, you'll learn how Google measures E-A-T and what changes you can make both on site and off in order to outrank your competitors. Using real-life examples, Marie will answer what E-A-T is and how Google measures it, what changes you can make on your site to improve how E-A-T is displayed, and what you can do off-site to improve E-A-T. 2:15pm–2:30pm Fixing the Indexability Challenge: A Data-Based Framework Areej AbuAli, Verve Search How do you turn an unwieldy 2.5 million-URL website into a manageable and indexable site of just 20,000 pages? Areej will share the methodology and takeaways used to restructure a job aggregator site which, like many large websites, had huge problems with indexability and the rules used to direct robot crawl. This talk will tackle tough crawling and indexing issues, diving into the case study with flow charts to explain the full approach and how to implement it. 2:30pm–2:45pm What Voice Means for Search Marketers: Top Findings from the 2019 Report Christi Olson, Microsoft How can search marketers take advantage of the strengths and weaknesses of today's voice assistants? Diving into three scenarios for informational, navigational, and transactional queries, Christi will share how to use language semantics for better content creation and paid targeting, how to optimize existing content to be voice-friendly (including the new voice schema markup!), and what to expect from future algorithm updates as they adapt to assistants that read responses aloud, no screen required. Highlighting takeaways around voice commerce from the report, this talk will ultimately provide a breakdown on how search marketers can begin to adapt their shopping experience for v-commerce. 2:50pm–3:30pm Afternoon break 3:30pm–4:00pm Redefining Technical SEO Paul Shapiro, Catalyst It’s time to throw the traditional definition of technical SEO out the window. Why? Because technical SEO is much, much bigger than just crawling, indexing, and rendering. Technical SEO is applicable to all areas of SEO, including content development and other creative functions. In this session, you’ll learn how to integrate technical SEO into all aspects of your SEO program. 4:00pm–4:40pm How Many Words Is a Question Worth? Dr. Peter J. Meyers, Moz Traditional keyword research is poorly suited to Google's quest for answers. One question might represent thousands of keyword variants, so how do we find the best questions, craft content around them, and evaluate success? Dr. Pete dives into three case studies to answer these questions. Wednesday, July 17th 8:30am–9:30am Breakfast 9:30am–10:10am Fraggles, Mobile-First Indexing, & the SERP of the Future Cindy Krum, Mobile Moxie Before you ask: no, this isn’t Fraggle Rock, MozCon edition! Cindy will cover the myriad ways mobile-first indexing is changing the SERPs, including progressive web apps, entity-first indexing, and how \"fraggles\" are indexed in the Knowledge Graph and what it all means for the future of mobile SERPs. 10:10am–10:40am Killer CRO and UX Wins Using an SEO Crawler Luke Carthy, Excel Networking CRO, UX, and an SEO crawler? You read that right! Luke will share actionable tips on how to identify revenue wins and impactful low-hanging fruit to increase conversions and improve UX with the help of a site crawler typically used for SEO, as well as a generous helping of data points from case studies and real-world examples. 10:45am–11:25am Morning break 11:25am–11:55am Content, Rankings, and Lead Generation: A Breakdown of the 1% Content Strategy Andy Crestodina, Orbit Media How can you use data to find and update content for higher rankings and more traffic? Andy will take us through a four-point presentation that pulls together the most effective tactics around content into a single high-powered content strategy with even better results. 11:55am–12:25pm Running Your Own SEO Tests: Why It Matters & How to Do It Right Rob Ousbey, Distilled Google's algorithms have undergone significant changes in recent years. Traditional ranking signals don't hold the same sway they used to, and they're being usurped by factors like UX and brand that are becoming more important than ever before. What's an SEO to do? The answer lies in testing. Sharing original data and results from clients, Rob will highlight the necessity of testing, learning, and iterating your work, from traditional UX testing to weighing the impact of technical SEO changes, tweaking on-page elements, and changing up content on key pages. Actionable processes and real-world results abound in this thoughtful presentation on why you should be testing SEO changes, how and where to run them, and what kinds of tests you ought to consider for your circumstances. 12:30pm–2:00pm Lunch 2:00pm–2:15pm Dark Helmet's Guide to Local Domination with Google Posts and Q&A Greg Gifford, Wikimotive Google Posts and Questions & Answers are two incredibly powerful features of Google My Business, yet most people don't even know they exist. Greg will walk through Google Posts in detail, sharing how they work, how to use them, and tips for optimization based on testing with hundreds of clients. He'll also cover the Q&A section of GMB (a feature that lets anyone in the community speak for your business), share the results of a research project covering hundreds of clients, share some hilarious examples of Q&A run wild, and explain exactly how to use Q&A the right way to win more local business. 2:15pm–2:30pm How to Audit for Inclusive Content Emily Triplett Lentz, Help Scout Digital marketers have a responsibility to learn to spot the biases that frequently find their way into online copy, replacing them with alternatives that lead to stronger, clearer messaging and that cultivate wider, more loyal and enthusiastic audiences. Last year, Help Scout audited several years of content for unintentionally exclusionary language that associated physical disabilities or mental illness with negative-sounding terms, resulting in improved writing clarity and a stronger brand. You'll learn what inclusive content is, how it helps to engage a larger and more loyal audience, how to conduct an audit of potentially problematic language on a site, and how to optimize for inclusive, welcoming language. 2:30pm–2:45pm Get the Look: Improve the Shopper Experience with Image and Visual Search Optimization Joelle Irvine, Bookmark Content With voice, local, and rich results only rising in importance, how do image and visual search fit into the online shopping ecosystem? Using examples from Google Images, Google Lens, and Pinterest Lens, Joelle will show how image optimization can improve the overall customer experience and play a key role in discoverability, product evaluation, and purchase decisions for online shoppers. At the same time, accepting that image recognition technology is not yet perfect, she will also share actionable tactics to better optimize for visual search to help those shoppers find that perfect style they just can’t put into words. 2:50pm–3:30pm Afternoon break 3:30pm–4:00pm Factors that Affect the Local Algorithm that Don't Impact Organic Joy Hawkins, Sterling Sky Inc. Google’s local algorithm is a horse of a different color when compared with the organic algo most SEOs are familiar with. Joy will share results from a SterlingSky study on how proximity varies greatly when comparing local and organic results, how reviews impact ranking (complete with data points from testing), how spam is running wild (and how it negatively impacts real businesses), and more. 4:00pm–4:30pm Featured Snippets: Essentials to Know & How to Target Britney Muller, Moz By now, most SEOs are comfortable with the idea of featured snippets, but actually understanding and capturing them in the changing search landscape remains elusive. Britney will share some eye-opening data about the SERPs you know and love while equipping you with a bevy of new tricks for winning featured snippets into your toolbox. 7:00pm–10:00pm Wednesday Night Bash Bowling: check! Karaoke: check! Photo booth: check! Join us for one last hurrah as we take over the Garage. You won't want to miss this closing night bash — we'll have plenty of games, food, and fun as we mix and mingle, say \"see ya soon\" to friends new and old, and reminisce over our favorite lessons from the past 3 days. See you there? It’s not too late to sign up for MozCon 2019! We sell out every year, but we've still got tickets left for you to scoop up. Grab my MozCon ticket now! As much as we’d love to see you all there, we know that a trip to Seattle isn’t always feasible. If that’s the case for you, be on the lookout for the video bundle we’ll have available for purchase after the conference — get all the great insights from MozCon from the comfort of your home or office, and share them with your whole team! Have questions? Pop them in the comments or head on over to our MozCon resource center where you can view FAQs, learn about our speakers, and get travel information. Once you buy your ticket, be sure to request access to our MozCon Facebook Group for enhanced networking with your fellow attendees! Let the final countdown to MozCon 2019 begin! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The 2019 MozCon Final Agenda Has Arrived!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The 2019 MozCon Final Agenda Has Arrived!"
    },
    {
      "level": "H2",
      "text": "Monday, July 15th"
    },
    {
      "level": "H3",
      "text": "7:30am–9:00am"
    },
    {
      "level": "H3",
      "text": "Breakfast & registration"
    },
    {
      "level": "H3",
      "text": "9:00am–9:20am"
    },
    {
      "level": "H3",
      "text": "Welcome to MozCon 2019!"
    },
    {
      "level": "H4",
      "text": "Sarah Bird, CEO of Moz"
    },
    {
      "level": "H3",
      "text": "9:20am–10:00am"
    },
    {
      "level": "H3",
      "text": "Web Search 2019: The Essential Data Marketers Need"
    },
    {
      "level": "H4",
      "text": "Rand Fishkin, Sparktoro"
    },
    {
      "level": "H3",
      "text": "10:00am–10:30am"
    },
    {
      "level": "H3",
      "text": "Human > Machine > Human: Understanding Human-Readable Quality Signals and Their Machine-Readable Equivalents"
    },
    {
      "level": "H4",
      "text": "Ruth Burr Reedy, UpBuild"
    },
    {
      "level": "H3",
      "text": "10:35am–11:15am"
    },
    {
      "level": "H3",
      "text": "Morning break"
    },
    {
      "level": "H3",
      "text": "11:15am–11:45am"
    },
    {
      "level": "H3",
      "text": "Improved Reporting & Analytics Within Google Tools"
    },
    {
      "level": "H4",
      "text": "Dana DiTomaso, Kick Point"
    },
    {
      "level": "H3",
      "text": "11:45am–12:15pm"
    },
    {
      "level": "H3",
      "text": "Local SERP Analytics: The Challenges and Opportunities"
    },
    {
      "level": "H4",
      "text": "Rob Bucci, Moz"
    },
    {
      "level": "H3",
      "text": "12:20pm–1:50pm"
    },
    {
      "level": "H3",
      "text": "Lunch"
    },
    {
      "level": "H3",
      "text": "1:50pm–2:20pm"
    },
    {
      "level": "H3",
      "text": "Keywords Aren't Enough: How to Uncover Content Ideas Worth Chasing"
    },
    {
      "level": "H4",
      "text": "Ross Simmonds, Foundation Marketing"
    },
    {
      "level": "H3",
      "text": "2:20pm–2:50pm"
    },
    {
      "level": "H3",
      "text": "How to Supercharge Link Building with a Digital PR Newsroom"
    },
    {
      "level": "H4",
      "text": "Shannon McGuirk, Aira Digital"
    },
    {
      "level": "H3",
      "text": "2:55pm–3:35pm"
    },
    {
      "level": "H3",
      "text": "Afternoon break"
    },
    {
      "level": "H3",
      "text": "3:35pm–4:05pm"
    },
    {
      "level": "H3",
      "text": "From Zero to Local Ranking Hero"
    },
    {
      "level": "H4",
      "text": "Darren Shaw, Whitespark"
    },
    {
      "level": "H3",
      "text": "4:05pm–4:45pm"
    },
    {
      "level": "H3",
      "text": "Esse Quam Videri: When Faking It Is Harder than Making It"
    },
    {
      "level": "H4",
      "text": "Russ Jones, Moz"
    },
    {
      "level": "H3",
      "text": "7:00–10:00 pm"
    },
    {
      "level": "H3",
      "text": "Monday Night Welcome Party"
    },
    {
      "level": "H2",
      "text": "Tuesday, July 16th"
    },
    {
      "level": "H3",
      "text": "8:30am–9:30am"
    },
    {
      "level": "H3",
      "text": "Breakfast"
    },
    {
      "level": "H3",
      "text": "9:30am–10:00am"
    },
    {
      "level": "H3",
      "text": "Building a Discoverability Powerhouse: Lessons from Merging an Organic, Paid, & Content Practice"
    },
    {
      "level": "H4",
      "text": "Heather Physioc, VMLY&R"
    },
    {
      "level": "H3",
      "text": "10:00am–10:30am"
    },
    {
      "level": "H3",
      "text": "Brand Is King: How to Rule in the New Era of Local Search"
    },
    {
      "level": "H4",
      "text": "Mary Bowling, Ignitor Digital"
    },
    {
      "level": "H3",
      "text": "10:35am–11:15am"
    },
    {
      "level": "H3",
      "text": "Morning break"
    },
    {
      "level": "H3",
      "text": "11:15am–11:45am"
    },
    {
      "level": "H3",
      "text": "Making Memories: Creating Content People Remember"
    },
    {
      "level": "H4",
      "text": "Casie Gillette, KoMarketing"
    },
    {
      "level": "H3",
      "text": "11:45am–12:25pm"
    },
    {
      "level": "H3",
      "text": "20 Years in Search & I Don't Trust My Gut or Google"
    },
    {
      "level": "H4",
      "text": "Wil Reynolds, Seer Interactive"
    },
    {
      "level": "H3",
      "text": "12:30pm–2:00pm"
    },
    {
      "level": "H3",
      "text": "Lunch"
    },
    {
      "level": "H3",
      "text": "2:00pm–2:15pm"
    },
    {
      "level": "H3",
      "text": "Super-Practical Tips for Improving Your Site's E-A-T"
    },
    {
      "level": "H4",
      "text": "Marie Haynes, Marie Haynes Consulting Inc."
    },
    {
      "level": "H3",
      "text": "2:15pm–2:30pm"
    },
    {
      "level": "H3",
      "text": "Fixing the Indexability Challenge: A Data-Based Framework"
    },
    {
      "level": "H4",
      "text": "Areej AbuAli, Verve Search"
    },
    {
      "level": "H3",
      "text": "2:30pm–2:45pm"
    },
    {
      "level": "H3",
      "text": "What Voice Means for Search Marketers: Top Findings from the 2019 Report"
    },
    {
      "level": "H4",
      "text": "Christi Olson, Microsoft"
    },
    {
      "level": "H3",
      "text": "2:50pm–3:30pm"
    },
    {
      "level": "H3",
      "text": "Afternoon break"
    },
    {
      "level": "H3",
      "text": "3:30pm–4:00pm"
    },
    {
      "level": "H3",
      "text": "Redefining Technical SEO"
    },
    {
      "level": "H4",
      "text": "Paul Shapiro, Catalyst"
    },
    {
      "level": "H3",
      "text": "4:00pm–4:40pm"
    },
    {
      "level": "H3",
      "text": "How Many Words Is a Question Worth?"
    },
    {
      "level": "H4",
      "text": "Dr. Peter J. Meyers, Moz"
    },
    {
      "level": "H2",
      "text": "Wednesday, July 17th"
    },
    {
      "level": "H3",
      "text": "8:30am–9:30am"
    },
    {
      "level": "H3",
      "text": "Breakfast"
    },
    {
      "level": "H3",
      "text": "9:30am–10:10am"
    },
    {
      "level": "H3",
      "text": "Fraggles, Mobile-First Indexing, & the SERP of the Future"
    },
    {
      "level": "H4",
      "text": "Cindy Krum, Mobile Moxie"
    },
    {
      "level": "H3",
      "text": "10:10am–10:40am"
    },
    {
      "level": "H3",
      "text": "Killer CRO and UX Wins Using an SEO Crawler"
    },
    {
      "level": "H4",
      "text": "Luke Carthy, Excel Networking"
    },
    {
      "level": "H3",
      "text": "10:45am–11:25am"
    },
    {
      "level": "H3",
      "text": "Morning break"
    },
    {
      "level": "H3",
      "text": "11:25am–11:55am"
    },
    {
      "level": "H3",
      "text": "Content, Rankings, and Lead Generation: A Breakdown of the 1% Content Strategy"
    },
    {
      "level": "H4",
      "text": "Andy Crestodina, Orbit Media"
    },
    {
      "level": "H3",
      "text": "11:55am–12:25pm"
    },
    {
      "level": "H3",
      "text": "Running Your Own SEO Tests: Why It Matters & How to Do It Right"
    },
    {
      "level": "H4",
      "text": "Rob Ousbey, Distilled"
    },
    {
      "level": "H3",
      "text": "12:30pm–2:00pm"
    },
    {
      "level": "H3",
      "text": "Lunch"
    },
    {
      "level": "H3",
      "text": "2:00pm–2:15pm"
    },
    {
      "level": "H3",
      "text": "Dark Helmet's Guide to Local Domination with Google Posts and Q&A"
    },
    {
      "level": "H4",
      "text": "Greg Gifford, Wikimotive"
    },
    {
      "level": "H3",
      "text": "2:15pm–2:30pm"
    },
    {
      "level": "H3",
      "text": "How to Audit for Inclusive Content"
    },
    {
      "level": "H4",
      "text": "Emily Triplett Lentz, Help Scout"
    },
    {
      "level": "H3",
      "text": "2:30pm–2:45pm"
    },
    {
      "level": "H3",
      "text": "Get the Look: Improve the Shopper Experience with Image and Visual Search Optimization"
    },
    {
      "level": "H4",
      "text": "Joelle Irvine, Bookmark Content"
    },
    {
      "level": "H3",
      "text": "2:50pm–3:30pm"
    },
    {
      "level": "H3",
      "text": "Afternoon break"
    },
    {
      "level": "H3",
      "text": "3:30pm–4:00pm"
    },
    {
      "level": "H3",
      "text": "Factors that Affect the Local Algorithm that Don't Impact Organic"
    },
    {
      "level": "H4",
      "text": "Joy Hawkins, Sterling Sky Inc."
    },
    {
      "level": "H3",
      "text": "4:00pm–4:30pm"
    },
    {
      "level": "H3",
      "text": "Featured Snippets: Essentials to Know & How to Target"
    },
    {
      "level": "H4",
      "text": "Britney Muller, Moz"
    },
    {
      "level": "H3",
      "text": "7:00pm–10:00pm"
    },
    {
      "level": "H3",
      "text": "Wednesday Night Bash"
    },
    {
      "level": "H2",
      "text": "See you there?"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Cheryl Draper\n          \n            Cheryl Draper\n          \n            Cheryl Draper"
}