{
  "url": "https://moz.com/blog/mozcon-2020-video-bundle",
  "slug": "mozcon-2020-video-bundle",
  "title": "The MozCon Virtual Video Bundle Is Here (Plus, Our 2019 Videos are FREE!) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Not only is the MozCon Virtual 2020 video bundle here for everyone who missed the live conference — we're also releasing all of 2019's sessions for free in our SEO Learning Center! Read on for all the details on how to get access.",
  "content": "The MozCon Virtual Video Bundle Is Here (Plus, Our 2019 Videos are FREE!) SEO Events | Advanced SEO | Moz News By: Cheryl Draper August 13, 2020 Table of Contents Copied! By: Cheryl Draper August 13, 2020 The MozCon Virtual Video Bundle Is Here (Plus, Our 2019 Videos are FREE!) SEO Events | Advanced SEO | Moz News This year's MozCon was unlike any other. In the midst of a global pandemic, we pivoted from planning our traditional 1,600-plus in-person shindig to an online conference that ended up bigger and more well-attended than anything we'd done before. MozCon Virtual was a delightful journey into the unknown. Just a few of the practical lessons we learned: How to collect, assemble, and ship high-quality at-home filming kits to our speakers How to reimagine online networking (they weren't held over delicious entrees at lunch, but our Birds of a Feather virtual sessions were a big hit!)How to get the most out of an online conference while also caring for your needs and being aware of Zoom fatigue And while it may have felt a little different this year, with 21 industry experts covering topics all the way from easy-to-implement machine learning to effective content promotion to crafting a keyword strategy that accounts for a world in crisis, MozCon Virtual offered up the same caliber of high-quality content as any in-person event we've ever thrown. And we're happy to share that if you missed the conference live, the MozCon 2020 video bundle is now available for your viewing pleasure! Start watching now For $129, you'll gain access to every presentation and speaker deck to watch as many times as you'd like. Schedule a viewing party with your team and get everyone on board with the best digital marketing advice, data, tools, and resources for the coming year. If you'd like a taste of what this year's video bundle's got cooking, check out Rob Ousbey's talk from this year's event: A Novel Approach to Scraping Websites Throughout a decade in SEO consulting, Rob needed to extract data from websites on many an occasion. Often this was at scale from sites that didn't have an API or export feature, or on sites that required some kind of authentication. While this was primarily a way to collect & combine data from different SEO tools, the use-cases were endless.He found a technique that helped immensely, particularly when traditional tools couldn't do the job — but hadn't seen anyone using the same approach. In this very tactical session, Rob will walk through the steps he's used to extract data from all sorts of sites, from small fry to the giants, and give you the tools and knowledge to do the same. As a bonus, Rob's put together a list of handy resources on his website to support you as you pursue your own data collection dreams! Watch the MozCon 2019 videos for free in our SEO Learning Center! Now that our MozCon Virtual videos are out in the world, we've released all the content from MozCon 2019 for free in our SEO Learning Center. Twenty-six sessions full of actionable insights and digital marketing advice await you — read on to see what goodies you might have missed last year! Web Search 2019: The Essential Data Marketers Need Rand Fishkin It's been a rough couple years in search. Google's domination and need for additional growth has turned the search giant into a competitor for more and more publishers, and plateaued the longstanding trend of Google's growing referral traffic. But in the midst of this turmoil, opportunities have emerged, too. In this presentation, Rand will look not only at how Google (and Amazon, YouTube, Instagram, and others) have leveraged their monopoly power in concerning ways, but also how to find opportunities for traffic, branding, and marketing success. Human > Machine > Human: Understanding Human-Readable Quality Signals and Their Machine-Readable Equivalents Ruth Burr Reedy The push and pull of making decisions for searchers versus search engines is an ever-present SEO conundrum. How do you tackle industry changes through the lens of whether something is good for humans or for machines? Ruth will take us through human-readable quality signals and their machine-readable equivalents and how to make SEO decisions accordingly, as well as how to communicate change to clients and bosses. Improved Reporting & Analytics Within Google Tools Dana DiTomaso Covering the intersections between some of our favorite free tools — Google Data Studio, Google Analytics, and Google Tag Manager — Dana will be deep-diving into how to improve your reporting and analytics, even providing downloadable Data Studio templates along the way. Local SERP Analytics: The Challenges and Opportunities Rob Bucci We all know that SERPs are becoming increasingly local. Google is more and more looking to satisfy local intent queries for searchers. There's a treasure-trove of data in local SERPs that SEOs can use to outrank their competitors. In this session, Rob will talk about the challenges that come with trying to do SERP analytics at a local level and the opportunities that await those who can overcome those challenges. Keywords Aren't Enough: How to Uncover Content Ideas Worth Chasing Ross Simmonds Many marketers focus solely on keyword research when crafting their content, but it just isn't enough if you want to gain a competitive edge. Ross will share a framework for uncovering content ideas leveraged from forums, communities, niche sites, good old-fashioned SERP analysis, tools and techniques to help along the way, and exclusive research surrounding the data that backs this up. How to Supercharge Link Building with a Digital PR Newsroom Shannon McGuirk Everyone who’s ever tried their hand at link building knows how much effort it demands. If only there was a way to keep a steady stream of quality links coming in the door for clients, right? In this talk, Shannon will share how to set up a \"digital PR newsroom\" in-house or agency-side that supports and grows your link building efforts. Get your note-taking hand ready, because she’s going to outline her process and provide a replicable tutorial for how to make it happen. From Zero to Local Ranking Hero Darren Shaw From zero web presence to ranking hyper-locally, Darren will take us along on the 8-month-long journey of a business growing its digital footprint and analyzing what worked (and didn’t) along the way. How well will they rank from a GMB listing alone? What about when citations were added, and later indexed? Did having a keyword in the business name help or harm, and what changes when they earn a few good links? Buckle up for this wild ride as we discover exactly what impact different strategies have on local rankings. Esse Quam Videri: When Faking It Is Harder than Making It Russ Jones Covering a breadth of SEO topics, Russ will show us how the correct use of available tools makes it easier to actually be the best in your market rather than try to cut corners and fake it. If you're a fan of hacks and shortcuts, come prepared to have your mind changed. Building a Discoverability Powerhouse: Lessons from Merging an Organic, Paid, & Content Practice Heather Physioc Search is a channel that can’t live in a silo. In order to be its most effective, search teams have to collaborate successfully across paid, organic, content and more. Get tips for integrating and collaborating from the hard knocks and learnings of merging an organic, paid and performance content team into one Discoverability group. Find out how we went from three teams of individual experts to one integrated Discoverability powerhouse, and learn from our mistakes and wins as you apply the principles in your own company. Brand Is King: How to Rule in the New Era of Local Search Mary Bowling Get ready for a healthy dose of all things local with this talk! Mary will deep-dive into how the Google Local algorithm has matured in 2019 and how marketers need to mature with it; how the major elements of the algo (relevance, prominence, and proximity) influence local rankings and how they affect each other; how local results are query-dependent; how to feed business info into the Knowledge Graph; and how brand is now \"king\" in local search. Making Memories: Creating Content People Remember Casie Gillette We know that only 20% of people remember what they read, but 80% remember what they saw. How do you create something people actually remember? You have to think beyond words and consider factors like images, colors, movement, location, and more. In this talk, Casie will dissect what brands are currently doing to capture attention and how everyone, regardless of budget or resources, can create the kind of content their audience will actually remember. 20 Years in Search & I Don't Trust My Gut or Google Wil Reynolds What would your reaction be if you were told that one of Wil's clients got more conversions from zero-volume search terms than search terms with 1000+ searches per month? It's true. Wil found this out in seconds, leading him to really look at his whole client strategy through a new lens. It also made him question company-wide strategies. How prevalent is this across all clients? Don't they all deserve to get these insights? It required him to dig into the long tail, deep. To use big data and see PPC data as insights, not just marketing.What would your reaction be if you were told that Google's \"bad click\" business could be generating as much annually as Starbucks or McDonalds? Wil will be making the case for big data, agencies, and why building systems that looking at every single search term you get matched to is the future of search marketing. Super-Practical Tips for Improving Your Site's E-A-T Marie Haynes Google has admitted that they measure the concept of \"Expertise, Authoritativeness, and Trustworthiness\" in their algorithms. If your site is categorized under YMYL (Your Money or Your Life), you absolutely must have good E-A-T in order to rank well. In this talk, you'll learn how Google measures E-A-T and what changes you can make both on site and off in order to outrank your competitors. Using real-life examples, Marie will answer what E-A-T is and how Google measures it, what changes you can make on your site to improve how E-A-T is displayed, and what you can do off-site to improve E-A-T. Fixing the Indexability Challenge: A Data-Based Framework Areej AbuAli How do you turn an unwieldy 2.5 million-URL website into a manageable and indexable site of just 20,000 pages? Areej will share the methodology and takeaways used to restructure a job aggregator site which, like many large websites, had huge problems with indexability and the rules used to direct robot crawl. This talk will tackle tough crawling and indexing issues, diving into the case study with flow charts to explain the full approach and how to implement it. What Voice Means for Search Marketers: Top Findings from the 2019 Report Christi Olson How can search marketers take advantage of the strengths and weaknesses of today's voice assistants? Diving into three scenarios for informational, navigational, and transactional queries, Christi will share how to use language semantics for better content creation and paid targeting, how to optimize existing content to be voice-friendly (including the new voice schema markup!), and what to expect from future algorithm updates as they adapt to assistants that read responses aloud, no screen required. Highlighting takeaways around voice commerce from the report, this talk will ultimately provide a breakdown on how search marketers can begin to adapt their shopping experience for v-commerce. Redefining Technical SEO Paul Shapiro It’s time to throw the traditional definition of technical SEO out the window. Why? Because technical SEO is much, much bigger than just crawling, indexing, and rendering. Technical SEO is applicable to all areas of SEO, including content development and other creative functions. In this session, you’ll learn how to integrate technical SEO into all aspects of your SEO program. How Many Words Is a Question Worth? Dr. Peter J. Meyers Traditional keyword research is poorly suited to Google's quest for answers. One question might represent thousands of keyword variants, so how do we find the best questions, craft content around them, and evaluate success? Dr. Pete dives into three case studies to answer these questions. Fraggles, Mobile-First Indexing, & the SERP of the Future Cindy Krum Before you ask: no, this isn’t Fraggle Rock, MozCon edition! Cindy will cover the myriad ways mobile-first indexing is changing the SERPs, including progressive web apps, entity-first indexing, and how \"fraggles\" are indexed in the Knowledge Graph and what it all means for the future of mobile SERPs. Killer CRO and UX Wins Using an SEO Crawler Luke Carthy CRO, UX, and an SEO crawler? You read that right! Luke will share actionable tips on how to identify revenue wins and impactful low-hanging fruit to increase conversions and improve UX with the help of a site crawler typically used for SEO, as well as a generous helping of data points from case studies and real-world examples. Content, Rankings, and Lead Generation: A Breakdown of the 1% Content Strategy Andy Crestodina How can you use data to find and update content for higher rankings and more traffic? Andy will take us through a four-point presentation that pulls together the most effective tactics around content into a single high-powered content strategy with even better results. Running Your Own SEO Tests: Why It Matters & How to Do It Right Rob Ousbey Google's algorithms have undergone significant changes in recent years. Traditional ranking signals don't hold the same sway they used to, and they're being usurped by factors like UX and brand that are becoming more important than ever before. What's an SEO to do? The answer lies in testing. Sharing original data and results from clients, Rob will highlight the necessity of testing, learning, and iterating your work, from traditional UX testing to weighing the impact of technical SEO changes, tweaking on-page elements, and changing up content on key pages. Actionable processes and real-world results abound in this thoughtful presentation on why you should be testing SEO changes, how and where to run them, and what kinds of tests you ought to consider for your circumstances. Dark Helmet's Guide to Local Domination with Google Posts and Q&A Greg Gifford Google Posts and Questions & Answers are two incredibly powerful features of Google My Business, yet most people don't even know they exist. Greg will walk through Google Posts in detail, sharing how they work, how to use them, and tips for optimization based on testing with hundreds of clients. He'll also cover the Q&A section of GMB (a feature that lets anyone in the community speak for your business), share the results of a research project covering hundreds of clients, share some hilarious examples of Q&A run wild, and explain exactly how to use Q&A the right way to win more local business. How to Audit for Inclusive Content Emily Triplett Lentz Digital marketers have a responsibility to learn to spot the biases that frequently find their way into online copy, replacing them with alternatives that lead to stronger, clearer messaging and that cultivate wider, more loyal and enthusiastic audiences. Last year, Help Scout audited several years of content for unintentionally exclusionary language that associated physical disabilities or mental illness with negative-sounding terms, resulting in improved writing clarity and a stronger brand. You'll learn what inclusive content is, how it helps to engage a larger and more loyal audience, how to conduct an audit of potentially problematic language on a site, and how to optimize for inclusive, welcoming language. Get the Look: Improve the Shopper Experience with Image and Visual Search Optimization Joelle Irvine With voice, local, and rich results only rising in importance, how do image and visual search fit into the online shopping ecosystem? Using examples from Google Images, Google Lens, and Pinterest Lens, Joelle will show how image optimization can improve the overall customer experience and play a key role in discoverability, product evaluation, and purchase decisions for online shoppers. At the same time, accepting that image recognition technology is not yet perfect, she will also share actionable tactics to better optimize for visual search to help those shoppers find that perfect style they just can’t put into words. Factors that Affect the Local Algorithm that Don't Impact Organic Joy Hawkins Google’s local algorithm is a horse of a different color when compared with the organic algo most SEOs are familiar with. Joy will share results from a SterlingSky study on how proximity varies greatly when comparing local and organic results, how reviews impact ranking (complete with data points from testing), how spam is running wild (and how it negatively impacts real businesses), and more. Featured Snippets: Essentials to Know & How to Target Britney Muller By now, most SEOs are comfortable with the idea of featured snippets, but actually understanding and capturing them in the changing search landscape remains elusive. Britney will share some eye-opening data about the SERPs you know and love while equipping you with a bevy of new tricks for winning featured snippets into your toolbox. Ready for more? You'll uncover even more SEO goodness in the MozCon 2020 video bundle. At this year's special low price of $129, this is invaluable content you can access again and again throughout the year to inspire and ignite your SEO strategy: 21 full-length videos from some of the brightest minds in digital marketingInstant downloads and streaming to your computer, tablet, or mobile deviceDownloadable slide decks for presentations Get my MozCon 2020 video bundle Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The MozCon Virtual Video Bundle Is Here (Plus, Our 2019 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The MozCon Virtual Video Bundle Is Here (Plus, Our 2019 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "A Novel Approach to Scraping Websites"
    },
    {
      "level": "H2",
      "text": "Watch the MozCon 2019 videos for free in our SEO Learning Center!"
    },
    {
      "level": "H3",
      "text": "Web Search 2019: The Essential Data Marketers Need"
    },
    {
      "level": "H4",
      "text": "Rand Fishkin"
    },
    {
      "level": "H3",
      "text": "Human > Machine > Human: Understanding Human-Readable Quality Signals and Their Machine-Readable Equivalents"
    },
    {
      "level": "H4",
      "text": "Ruth Burr Reedy"
    },
    {
      "level": "H3",
      "text": "Improved Reporting & Analytics Within Google Tools"
    },
    {
      "level": "H4",
      "text": "Dana DiTomaso"
    },
    {
      "level": "H3",
      "text": "Local SERP Analytics: The Challenges and Opportunities"
    },
    {
      "level": "H4",
      "text": "Rob Bucci"
    },
    {
      "level": "H3",
      "text": "Keywords Aren't Enough: How to Uncover Content Ideas Worth Chasing"
    },
    {
      "level": "H4",
      "text": "Ross Simmonds"
    },
    {
      "level": "H3",
      "text": "How to Supercharge Link Building with a Digital PR Newsroom"
    },
    {
      "level": "H4",
      "text": "Shannon McGuirk"
    },
    {
      "level": "H3",
      "text": "From Zero to Local Ranking Hero"
    },
    {
      "level": "H4",
      "text": "Darren Shaw"
    },
    {
      "level": "H3",
      "text": "Esse Quam Videri: When Faking It Is Harder than Making It"
    },
    {
      "level": "H4",
      "text": "Russ Jones"
    },
    {
      "level": "H3",
      "text": "Building a Discoverability Powerhouse: Lessons from Merging an Organic, Paid, & Content Practice"
    },
    {
      "level": "H4",
      "text": "Heather Physioc"
    },
    {
      "level": "H3",
      "text": "Brand Is King: How to Rule in the New Era of Local Search"
    },
    {
      "level": "H4",
      "text": "Mary Bowling"
    },
    {
      "level": "H3",
      "text": "Making Memories: Creating Content People Remember"
    },
    {
      "level": "H4",
      "text": "Casie Gillette"
    },
    {
      "level": "H3",
      "text": "20 Years in Search & I Don't Trust My Gut or Google"
    },
    {
      "level": "H4",
      "text": "Wil Reynolds"
    },
    {
      "level": "H3",
      "text": "Super-Practical Tips for Improving Your Site's E-A-T"
    },
    {
      "level": "H4",
      "text": "Marie Haynes"
    },
    {
      "level": "H3",
      "text": "Fixing the Indexability Challenge: A Data-Based Framework"
    },
    {
      "level": "H4",
      "text": "Areej AbuAli"
    },
    {
      "level": "H3",
      "text": "What Voice Means for Search Marketers: Top Findings from the 2019 Report"
    },
    {
      "level": "H4",
      "text": "Christi Olson"
    },
    {
      "level": "H3",
      "text": "Redefining Technical SEO"
    },
    {
      "level": "H4",
      "text": "Paul Shapiro"
    },
    {
      "level": "H3",
      "text": "How Many Words Is a Question Worth?"
    },
    {
      "level": "H4",
      "text": "Dr. Peter J. Meyers"
    },
    {
      "level": "H3",
      "text": "Fraggles, Mobile-First Indexing, & the SERP of the Future"
    },
    {
      "level": "H4",
      "text": "Cindy Krum"
    },
    {
      "level": "H3",
      "text": "Killer CRO and UX Wins Using an SEO Crawler"
    },
    {
      "level": "H4",
      "text": "Luke Carthy"
    },
    {
      "level": "H3",
      "text": "Content, Rankings, and Lead Generation: A Breakdown of the 1% Content Strategy"
    },
    {
      "level": "H4",
      "text": "Andy Crestodina"
    },
    {
      "level": "H3",
      "text": "Running Your Own SEO Tests: Why It Matters & How to Do It Right"
    },
    {
      "level": "H4",
      "text": "Rob Ousbey"
    },
    {
      "level": "H3",
      "text": "Dark Helmet's Guide to Local Domination with Google Posts and Q&A"
    },
    {
      "level": "H4",
      "text": "Greg Gifford"
    },
    {
      "level": "H3",
      "text": "How to Audit for Inclusive Content"
    },
    {
      "level": "H4",
      "text": "Emily Triplett Lentz"
    },
    {
      "level": "H3",
      "text": "Get the Look: Improve the Shopper Experience with Image and Visual Search Optimization"
    },
    {
      "level": "H4",
      "text": "Joelle Irvine"
    },
    {
      "level": "H3",
      "text": "Factors that Affect the Local Algorithm that Don't Impact Organic"
    },
    {
      "level": "H4",
      "text": "Joy Hawkins"
    },
    {
      "level": "H3",
      "text": "Featured Snippets: Essentials to Know & How to Target"
    },
    {
      "level": "H4",
      "text": "Britney Muller"
    },
    {
      "level": "H2",
      "text": "Ready for more?"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Cheryl Draper\n          \n            Cheryl Draper\n          \n            Cheryl Draper"
}