{
  "url": "https://moz.com/blog/mozcon-speaker-interview-aleyda-solis",
  "slug": "mozcon-speaker-interview-aleyda-solis",
  "title": "#MozCon Speaker Interview: Aleyda Solis - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We’re excited to bring Aleyda Solis and her international perspective to MozCon, where she’ll lay out how to make the bold but lucrative move into the international market.",
  "content": "#MozCon Speaker Interview: Aleyda Solis SEO Events By: Lindsay Wassell June 17, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Lindsay Wassell June 17, 2013 #MozCon Speaker Interview: Aleyda Solis SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Today I’m pleased to bring you Aleyda Solis, Madrid-based International SEO at SEER Interactive, a Moz Associate, and State of Search blogger. We’re excited that she’s bringing her international perspective to MozCon, where she’ll lay out how to make the bold but lucrative move into the international market. You definitely don’t want to miss her talk, “International SEO and the Future of Your ROI,” if you’re interested in growing your online business.Tell us about the presentation you have planned for MozCon.It’s going to be an exciting adventure, guiding the audience to discover their international SEO potential and what could be the future of their ROI. It will be beyond the \"ccTLDs vs. subdirectories for country targeting\" type of session (although best practices with examples and tactics will be also shared). It’s meant to answer frequent questions I get from strategic, operations, and business perspectives, like: “How do I connect with international audiences and develop an attractive offer and assets when I don’t even speak the language or know anything about the country?” Or, “How can I develop original, localized content for all of these non-English websites if I don’t have enough resources?”If this is an issue for your business, then it’s highly likely that your international SEO strategy wasn't planned and established well enough from the beginning, allowing your investment to become cost-effective and scalable in foreign organic search markets. I started to cover international SEO from this perspective in a SEER post I wrote about establishing an international SEO strategy. Why would it be unwise for someone to miss your presentation?Because I will be giving away delicious Iberian ham that I will be bringing from Spain to selected audience members in my session! :D (I’m kidding!)I really wish I could do that, but unfortunately it is forbidden by US Customs. (Nonetheless, you might want to ask for a change in customs law to make it friendlier to Spanish gastronomy so I can do that in the future.)Seriously, though, it would be really unwise to skip my session because I will be sharing what could be the next step to grow your online business. You definitely don’t want to miss that.What types of businesses should be thinking about international SEO, and why?All businesses that might have an audience in other countries or that speaks other languages should be thinking about it. Sometimes people think that only huge businesses that already have a multinational physical presence should be thinking about an international web presence and search marketing activity. But this is far from true and is just myopic. For more, take a look at this Moz post I wrote about discovering your international online potential. Regarding international SEO, what is the most unexpected thing you've learned along the way?Maybe not unexpected, but unfortunately usually overlooked: The characteristics of audience behavior in each country.Beyond language differences, there are many cultural, economic and sociological factors that can affect the success of many aspects of your SEO process, like the level of response from a link-building campaign, for example. At the end, beyond search engines that serve as a bridge, SEO is about the people.You can have a better understanding of what I’m talking about in this post I published at State of Search about different aspects that drive an international SEO industry and audience research. What do you do at SEER Interactive?My activities at SEER are quite diverse: On one hand, I’m helping to grow the international SEO business, giving SEER more visibility by speaking at diverse events in Europe, identifying and validating leads, giving pre-sales support, and establishing and coordinating the best organization and processes for international SEO. On the other, I’m also developing and helping to implement international SEO processes for current clients.Tell us about the places you've lived.I’m from Nicaragua, a small, tropical country with a lot of volcanoes, lakes, and beaches on both the Pacific and Caribbean coasts in Central America. Nicaragua's natural landscape is breathtaking; here’s a photo of Momotombo Volcano (one of the 12 volcanoes on the Pacific coast of the country): Photo from Flickr (under Creative Commons): http://www.flickr.com/photos/garrettziegler/7355295166/I grew up, studied, and worked there until I left to study in Salamanca, Spain in 2006. It’s a beautiful student town full of history, with students from all over the world (a lot of people go there to learn Spanish). It’s also home to the University of Salamanca, the oldest university in Spain (where I went to study), which was founded in 1218. Its front building looks like this:Photo from Flickr (under Creative Commons): http://www.flickr.com/photos/paullew/3855579280/I ended up staying in Salamanca after finishing my studies, and got my first SEO job at an online marketing company. I lived in Salamanca for a bit more than 4 years — until I came to Madrid, the city where I live now. I came to Madrid after accepting an SEO manager position at a company here at the end of 2010. Madrid is an amazing place, since it has the great alternatives that big cities offer, and at the same time allows you to have a good quality of life. Here’s a view of Gran Via, one of the main streets in Madrid:Photo from Flickr (under Creative Commons): http://www.flickr.com/photos/nico_/6887000482/What is it about Madrid that keeps you there?Madrid (followed by Barcelona) is where most of the bigger types of business activity happen in Spain, from trade shows and professional networking events to a wide range of cultural activities. There’s also good weather (there’s always sun, although it might be a bit cold during winter) and great culinary offerings (delicious tapas everywhere!), so I’m happy here at the moment. Although, of course, I’m quite open to experiencing new places to live in the future. I love to travel and experience new cultures.Are you doing what you thought you’d be doing when you were growing up?I had the somewhat common “dreams” among children of being an astronaut (I really just wanted to go to space, it wasn't necessarily because I knew what an astronaut actually did). So that’s really a pending point in my life: going to space! I definitely need to start saving more for that.What is the last thing that you have seen/heard/experienced that has inspired you?I’ve recently had two experiences that have been inspiring in different ways.A couple of weeks ago, I had the chance to go to Israel to speak at KahenaCon and had the great opportunity to spend a Saturday walking around Jerusalem Old City. It was a truly inspiring experience, seeing places with such a rich historical and also religious background, like the Western Wall, the Holy Sepulchre and Dome of the Rock. Even if I’m not religious myself, it was a somewhat magical experience.Photo from Instagram: http://instagram.com/p/Zucpg1N8yT/ Another (and totally different) inspiring moment happened a week ago when I had the chance to try Google Glass. I felt like I was already living in the future, interacting with that small, translucent movie theater-like interface in my glasses with just my voice. Truly amazing.Photo from Instagram: http://instagram.com/p/Z8tuxJt8yd/What is the best piece of advice you’ve ever been given?To ask myself “What’s the worst that could happen?” when I’m making an important or scary decision. This question allows me to get my risk-averse considerations under control, and gives me a great opportunity to start assessing a new situation with more balanced criteria. By asking this, I’ve been able to go out of my comfort zone more frequently and live new experiences.Thank you, Aleyda! It was great to learn a bit about your background and how international SEO matters for all types of businesses, not just the big multinationals.If, like us, you just can't get enough of Alyeda, you can find her as @aleyda on Twitter (where she juggles Spanish and English).Still don't have your #MozCon ticket yet? Reserve your spot now! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "#MozCon Speaker Interview: Aleyda Solis"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "#MozCon Speaker Interview: Aleyda Solis"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Lindsay Wassell\n          \n            Lindsay Wassell\n          \n            Lindsay Wassell"
}