{
  "url": "https://moz.com/blog/mozcon-2015-answers-to-questions-on-back-to-the-future-with-local-search-presentation",
  "slug": "mozcon-2015-answers-to-questions-on-back-to-the-future-with-local-search-presentation",
  "title": "MozCon 2015: Q&A Regarding Back to the Future with Local Search - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If you're looking to stay ahead of the competition in Local SEO, start by striving to do the little things well and often.",
  "content": "MozCon 2015: Q&A Regarding Back to the Future with Local Search Local SEO By: Mary Bowling July 28, 2015 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Mary Bowling July 28, 2015 MozCon 2015: Q&A Regarding Back to the Future with Local Search Local SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. At MozCon, I was pleased to see a lively Twitter conversation develop around my presentation, \"Back to the Future with Local Search.\" Many people asked questions that I wasn’t able to answer right away. So when I arrived back home, I took the time to review them and answer as many as possible in this blog post. Hey Krista,Check out Moz and David Mihm's latest Local Search Ranking Factors Survey here: https://moz.com/local-search-ranking-factors.Hey Allie,In Local, it’s the calls/visits that really count, not necessarily visits to the site, so I wouldn’t discount those kinds of listings. Depending upon the niche and type of business, many users are not sophisticated and still harken back to the Yellow Pages as a trusted resource.Hi Joe, Here’s Yelp’s official response to your question: https://biz.yelp.com/support/common_questions. I tend to believe what they say here, although there are sometimes things you see that don't necessarily follow the rules.Hi Sean,Post content on your own site, or on sites with the potential to bring you more business. For most SMBs, Google+ is probably not one of those places. (There is no audience for most SMBs on Google+.)Hi there, Marketing Dyno Team. The main image at the top of this post is the one you're looking for. Also, here's a link to a larger version: Map to Local Search Success.Thanks for the question, Rand.Penguin massacres scared so many into nofollowing links. We shouldn’t worry if a local link is nofollowed, though. Best links = targeted referrals.Hi Krista,Chains (multi-local business) definitely face challenges. Distribute to all sites with the best potential for referrals. Advise local managers to get links from their local and hyperlocal sites. Hey Rand, The short answer is, \"It depends.\" You may already have a better link profile, and need to work on improving your name-area-place listing (NAP) consistency or on-site SEO to move up. Hi Jessica,It’s not a matter of failure; it's a different focus. Since you’re not a local business, work on organic, not Local. Hard work can allow you to rank organically, but you will not break into the local pack without a local address.Hi Luke, Make corporate and location operators aware of the implications of NAP inconsistency. Encourage use of the same NAP everywhere, and make sure anyone who distributes information for your business uses a master list of NAP data.Hey Andrew,SABs want to rank for any place they are willing to work/serve. When the Local algorithm doesn’t support that, more organic SEO work is needed.Hi Craig,When I discussed reviews in my MozCon talk, I was referring to both Google reviews and reviews elsewhere on the web. (I tend to consider comments published on business websites as testimonials.)Hey Forrest,Reviews, check-ins, and citations/links on both local and hyper-local sites; as well as mentions in local media all help with location prominence.Hello Virginia, You can flag Google reviews as inappropriate and make a case to have them removed. You can also respond to reviews on Google and use your responses to invite dialogue with the disgruntled reviewers. Your responses may become visible to those reading your reviews in the future.Hi Phillip,Yes, check-ins are signal location prominence and can help to establish trust in location information, too.Hey Adam,In setting up a Google My Business listing, use your home address and indicate that you want to display a service area rather than your street address. This will show your general location, but will not reveal an exact address.Hi Li,I recommend you do both. Start with data providers, and then go the local directories that are most likely to attract new customers to the business. Some of the local and hyper-local directories do not receive data from aggregators, so beware that you could end up with one-sided strategy.Hi Jarrod,If the Local algorithm doesn’t support your ranking in Local results for multiple cities, more organic SEO work is needed.Hi Brian,No, Google tries to reserve the local pack and pinned organic listings for local businesses with physical locations. If you operate in large metropolitan areas you can optimize pages for city names, but you will not rank in the local pack.Hi Jarod,Local sites, data providers, authoritative directories, local media mentions, and anything with good potential to refer customers to your website can provide you with a quality citation.--If you have any other questions about my MozCon presentation (or Local Search in general), feel free to ask them in the comments below. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "MozCon 2015: Q&A Regarding Back to the Future with Local Search"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "MozCon 2015: Q&A Regarding Back to the Future with Local Search"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Mary Bowling\n          \n            Mary Bowling"
}