{
  "url": "https://moz.com/blog/mozcon-speaker-interview-ross-simmonds",
  "slug": "mozcon-speaker-interview-ross-simmonds",
  "title": "MozCon Virtual 2021 Interview Series: Ross Simmonds - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We're absolutely thrilled to welcome Ross back to the MozCon stage, and we connected with him ahead of the show to discuss how he broke into the industry, his content philosophy, and what he’s looking forward to at MozCon 2021.",
  "content": "MozCon Virtual 2021 Interview Series: Ross Simmonds SEO Events | Marketing Industry | Content Marketing By: Hayley Bowyer May 19, 2021 Table of Contents Copied! By: Hayley Bowyer May 19, 2021 MozCon Virtual 2021 Interview Series: Ross Simmonds SEO Events | Marketing Industry | Content Marketing Whether you recognize his iconic tweets or have read one of his content exposés on some of the world’s most powerful brands, Ross Simmonds has certainly made a name for himself in the content world. Through his experience working with clients both large and small, Ross has discovered the perfect recipe for developing and distributing content that will drive real results, and he’s ready to share it with our MozCon audience! We're absolutely thrilled to welcome him back to the MozCon stage, and we connected with him ahead of the show to discuss how he broke into the industry, his content philosophy, and what he’s looking forward to at MozCon 2021. Secure your seat Question: You’ve been covering content creation and content marketing for quite some time, so could you tell us a bit about how you got your start? How did you set yourself apart? Ross: I got started in content marketing accidentally. It was a time when content marketing really wasn't a thing. I got started by creating content online about fantasy sports. My first blog was all about fantasy football. I would create content three times a week writing about which players I believed were going to perform the best, and people from all over the world started to read this content and connect with it while I was living in my parents' basement in the middle of Nova Scotia, Canada. This is when the light bulbs went off that the internet is going to be big and that this whole idea of creating content online can give you the opportunity to reach millions of people.As I started to grow that fantasy football blog, the traffic went up while my marks went down and I had to shift that fantasy football blog into a marketing blog so I could satisfy my mum's taste of wanting to make sure that I did good in school. She told me to start writing about marketing and so I did. RossSimmonds.com became my website where I created content for years, and that eventually started to get traction and engagement from people again, all over the world, and eventually I transitioned, again, that RossSimmonds.com business, which was just me as a freelancer, into Foundation Marketing, which is a content marketing agency that works with B2B brands across the globe on content strategy, content creation, and content distribution. I have consistently been putting out new content on a regular basis on my blog, Twitter, LinkedIn, Facebook, and etc., for many, many years and as such, people have started to take notice and have been able to see my way of thinking around content. Question: This year you’re discussing a new way of looking at content — seeing it as a long-term investment rather than a one-off creation. Why do you think this mindset is difficult for today's marketers to develop, and what's the best thing they can do to change their perspective? Ross: The #1 reason why content is often seen as a one-hit thing and a one-time thing is because we live in a time where instant gratification has never been more easily acquirable and offers a dopamine hit. As such, marketers love the idea of pressing publish on a piece of content and seeing tons of notifications that people are interacting with it, liking it, sharing it, etc., and that is a great feeling to have. But it is very temporary and what I'm talking about when it comes to content as an investment is taking a more long-term view, and recognizing that the assets and content that you create today can actually serve you consistently for years, if not decades to come from now, if you're able to optimize, improve, re-share, republish, and create things that actually have a life cycle that goes beyond today. Question: You frequently conduct case studies on businesses like Masterclass, Shopify, and Gong, who are implementing incredibly successful content marketing strategies. What do you think these businesses have in common that is driving their success? What advice would you give to other businesses looking to achieve similar success? Ross: Across the board, all of these companies have an internal commitment to understanding the value of content and its role in creating a competitive advantage. A lot of organizations don't view content as a force that can offer a competitive advantage long-term, but that is exactly what it offers you. If you create content for a significant amount of time that content is now going to be published and available to the public for years to come, and that content — if it's ranking in Google for high value keywords — is able to generate value for your business. Some landing pages that exist today that were published in 2007 are still generating hundreds of thousands of dollars every single month for some companies, and these businesses that view content as an investment and recognize the power, value, and scalability of content are the ones that win, because they recognize that it's a great way to differentiate, that it is a very scalable methodology for growth and driving traction and engagement, and that is what truly differentiates some of these best-in-class content brands versus everyone else in the industry. Question: At Foundation, you work with the full range of clients from startups to large Fortune 500 companies. How does your approach to content marketing change based on company size? Ross: We start by understanding the goals and objectives with every single client that we're looking to provide services for, and by understanding their individual goals, we're able to tailor our recommendations and the ways in which we work with them based on their goals and what they're looking to accomplish — but we don't stop there. We also dive deep into understanding what their existing resources are, how big their team is, the way that they internally communicate, the ways in which they're resourced in terms of their team structure, etc., and we use all of that to make a decision around how we can better serve them to accomplish that overarching goal. We also recognize that every single company is different. They have different people, different goals, different resource constraints, and different levels of funding, some are private, some are public, and etc. All of these things fit into the way in which we can serve our clients, and thus we navigate each instance differently and in a bespoke kind of nature where it's custom and tailored to them. Question: The way that consumers digest content is changing rapidly day by day. In your opinion, what has been the most dramatic change in content marketing in the last five years? What do you think is going to be the most important area for content marketers to focus on in the next five years? Ross: Five years ago, everyone was talking about how you need to create more content and publish more content because all the gurus were on stage screaming \"Content is king\". You fast forward to now, and guess what? Everyone has listened to that mantra and that idea but content has become very common. There's content everywhere you look. Right now, as somebody reads the words that are written on this screen or is listening to an audio version of it, they are consuming content. Content has become easy to create and content has become essentially the bar. You're supposed to create content. Now it's more difficult than ever to stand out amongst all the noise, all of the hundreds and thousands of blog posts being published every day, and the hundreds of thousands of influencers on LinkedIn, TikTok, Twitter, Snapchat, etc., and because it is so difficult to stand out amongst them, I believe that in the next five years, the increasing emphasis on creativity and solid distribution will never be higher. If you're in a boring industry, you still need to be creative and understand your audience's pain points and needs and give that to them in a form of content that they will want. That is consistent across the board, and I believe that there's going to be an increasing demand for creativity if you want your content to stand out in the months — if not years — to come. Question: What’s your favorite piece of content that you’ve ever created? How can people give it a read? Ross: A few months back, I wrote a piece called the The SEO Moat: Why SEO Can Be A Competitive Advantage, and it really speaks to the value that SEO brings to the market that often organizations are overlooking, even though it can truly play a massive role in helping an organization unlock millions of dollars in value for their organization. Question: Who in the MozCon lineup are you most excited to watch this year? Anything else you are looking forward to? Ross: I'm super excited to hear what Flavilla has to say this year. She always brings the heat and her perspective on the science of purchasing behavior is definitely going to be something I will be looking forward to hearing. A big thank you to Ross for his time! To learn more about Ross’s upcoming presentation, see details on our other speakers, and to purchase your ticket, make sure you click the link below! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "MozCon Virtual 2021 Interview Series: Ross Simmonds"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "MozCon Virtual 2021 Interview Series: Ross Simmonds"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Hayley Bowyer\n          \n            Hayley Bowyer"
}