{
  "url": "https://moz.com/blog/mozcon-2019-pj-howland",
  "slug": "mozcon-2019-pj-howland",
  "title": "MozCon 2019: Acceptance. Education. Donuts - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We could tell you what it's like to attend MozCon — but why not hear from someone who's actually been?",
  "content": "MozCon 2019: Acceptance. Education. Donuts SEO Events | Marketing Industry | Moz News By: PJ Howland May 8, 2019 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: PJ Howland May 8, 2019 MozCon 2019: Acceptance. Education. Donuts SEO Events | Marketing Industry | Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. We’re digital marketers; we make our living in a constantly changing (and consistently misunderstood) industry. It’s easy to feel like even those who are closest to us don’t really get what we do. Take me, for example, I once mentioned algorithms to my grandmother, and ever since then, she’s been absolutely (and adamantly) sure that I work with clocks. Did she think I said analog? But despite the dynamic nature of marketing, Moz has always been a solid rock at the center of the storm. It’s been here since the beginning, a place where all the marketing nerds and SEO geeks could hang our hats and feel understood. And MozCon feels like the culmination of that culture of acceptance. MozCon: Helping you build your best self As I’ve chatted with the good folks at Moz about this year’s MozCon, it’s clear to me that they pay attention to data. Why do I say that? Because they’re doubling down on making this year their most actionable year ever. As a past attendee, I can say that hearing that MozCon’s biggest focus is a dedication to actionable tactics gets me excited. The creative media surrounding MozCon have an under-the-sea theme going on. These nautical nods are setting us all up for the deep dive into digital marketing we’re sure to see this year. Since there’s a good chance that most of us marketers never made it to prom (just me? Okay then...), it’s kind of fun to get a second chance to experience oceanic decor in a congregate environment (What, you’ve never dreamed about being Marty McFly at his parent’s Enchantment Under the Sea dance? Was I the only one?) The point is that the upcoming MozCon is poised to do what it does so well: Offer a delightful mix of predictability and variety, presented in a way that’s designed to improve us without reforming us. New players will share the stage with established thought leaders and strategists. Innovation will go hand in hand with cherished tradition. After looking at the initial agenda, here are a few of the front runner speakers and sessions I’m excited for in particular. Casie Gillette — Thanks for the Memories: Creating Content People Remember Digital marketers like data, right? [Cue nodding heads and incoherent mumblings] While I certainly love data, I also struggle with data. Sometimes I rely on the data so much that I become hesitant to take risks. And if there’s one thing our industry as a whole can improve on, it’s taking more risk. Casie is taking to the stage with a mission to teach us how to make content memorable. With the promise that MozCon 2019 will be more tactical and strategic than ever before, I am earnestly giddy (feel free to picture that emotion however the mood takes you) to hear about what I can do to take a step back from the data, and instead put it on the line for something my audience will never forget. Shannon McGuirk: How to Supercharge Link Building with a Digital PR Newsroom Link-building, anyone? Yeah, it’s still a thing. After all, if you link-build it, they will come. Shannon promises to teach us how to set up a “digital PR room.” AKA, a link-earning machine! It sounds like she’s pulling back the entire curtain and will be showing us some concrete link-building tactics. I know how many hours go into earning a single link, so I am eagerly awaiting a process that scales. Ross Simmonds — Keyword's Aren't Enough: How to Uncover Content Ideas Worth Chasing Like many SEOs, I’m a firm believer in the power of valuable content. So when I hear about a session titled, “Keyword's Aren't Enough: How to Uncover Content Ideas Worth Chasing,” it’s eye-catching. Maybe more than eye-catching, it’s paradigm challenging. I love keywords, LOVE’em! Content marketing without keywords makes me a little uneasy. Let’s just say keywords are at the center of most of my strategy for content marketing decisions. I’m glad I have time to prepare my mind for what mad brilliance Ross will be sharing this year at MozCon. Heather Physioc — Mastering Branded Search Before I even jump into Heather’s digital game, let’s start with her taste in music. Her walk-on music was strong last year — real strong. . @HeatherPhysioc I don't know who chooses the walk-on music. But you win! Ready to listen to everything you have to say. #mozcon2018— PJ Howland (@askPJHowland) July 10, 2018 This year Heather is going to be chatting us up on branded search. At one glance I’m like, “Okay, color me intrigued…” Branded search seems so surface-level, but knowing Heather, it will be an engaging presentation replete with answers to (what I thought were) unanswerable questions about branded search. Heather has a background in working with enterprise brands, so for me, the opportunity to learn how to leverage big brand names for unique perspectives on what many may think is a pretty straightforward subject, is one I don’t dare pass up. Very excited for what’s sure to be a wild ride. Britney Muller — Topic TBD, but looking forward to it nonetheless I’ve never left a conference with more notes from a single session that I have from Britney’s MozCon address in 2017. I recall her sharing her trepidation about being the lead SEO for Moz. A quick project Britney took on was gutting some old and thin pages on Moz.com — about 70,000 community pages if my notes from the event are correct. But shortly, Moz.com saw a modest organic traffic bump. Britney is fearless as an SEO, and there’s something beyond the sheer value of case studies here. As SEOs, we too should be fearless in our work. I’m looking forward to Britney sharing data, insights, and her gutsy spirit with all of us. Moz with Benefits... Speakers and sessions are cool and all, but can I just say that all the little extras MozCon has to offer are amazing. Networking is something that every conference touts. And sure we all like networking, cause that’s what we have to say right? What’s the phrase? “If you’re not networking, you’re not working”? At MozCon, networking is not a chore; it’s easy and enjoyable. Even productive. From an agency perspective, it’s a cool place outside the office to connect with clients too. And how have I gotten this far and not mentioned the food at MozCon? The meals are excellent, but can I say a word about the snacks? Moz does not skimp when it comes to eats. Sure, I talked about some cool speakers and topics above, but you know what’s actually stolen my heart at MozCon? Top Pot donuts. I may be that guy that leaves a session 5 minutes early just to get a head start on these donuts. Does that mean I might miss out on valuable insights or strategies? Absolutely it does, and I don’t care. My goal has always been to get a couple of donuts down the hatch before I run into someone I know. That way, when they see me with a donut in each hand, they think that’s all I’ve had. “Just two donuts this time, PJ?” “Yeah, haha, just two…” Suckers. Donuts aside, Moz cares immensely about their community and has done everything possible to make this the best year yet. So come as you are, and leave as you were… only better. The Moz culture of acceptance and education stands to deliver a MozCon experience that will keep you going throughout the year. I can’t wait to take a deep dive into the sea of SEO with all of my fellow marketing geeks. And if you want to chat, I’ll be the guy hovering around the donut table. Well, what did I miss? For all the long-time MozCon attendees out there, what are you excited for? Which speakers and sessions are you looking forward to most? Do you have any favorite moments from years past? Where are you grabbing dinner in the city? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "MozCon 2019: Acceptance. Education. Donuts"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "MozCon 2019: Acceptance. Education. Donuts"
    },
    {
      "level": "H2",
      "text": "MozCon: Helping you build your best self"
    },
    {
      "level": "H3",
      "text": "Casie Gillette — Thanks for the Memories: Creating Content People Remember"
    },
    {
      "level": "H3",
      "text": "Shannon McGuirk: How to Supercharge Link Building with a Digital PR Newsroom"
    },
    {
      "level": "H3",
      "text": "Ross Simmonds — Keyword's Aren't Enough: How to Uncover Content Ideas Worth Chasing"
    },
    {
      "level": "H3",
      "text": "Heather Physioc — Mastering Branded Search"
    },
    {
      "level": "H3",
      "text": "Britney Muller — Topic TBD, but looking forward to it nonetheless"
    },
    {
      "level": "H2",
      "text": "Moz with Benefits..."
    },
    {
      "level": "H2",
      "text": "Well, what did I miss?"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "PJ Howland\n          \n            PJ Howland\n          \n            PJ Howland"
}