{
  "url": "https://moz.com/blog/mozcon-2013-agenda",
  "slug": "mozcon-2013-agenda",
  "title": "#MozCon 2013 Agenda - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The full MozCon agenda is here! Join us July 8th-10th for an out-of-this-world experience with three amazing days of inbound marketing brilliance.",
  "content": "#MozCon 2013 Agenda SEO Events By: Erica McGillivray May 13, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Erica McGillivray May 13, 2013 #MozCon 2013 Agenda SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Holy cannoli, it's MozCon 2013 Agenda time! July 8th-July 10th here in Seattle are going to be out-of-this-world. I know many of you have been asking for the complete MozCon schedule, and we've been working hard with all our 2013 speakers to find those perfect words to express how awesome MozCon's going to be. I'm thrilled for the variety of programming we'll have from local SEO and mobile content strategy to video and marketing analytics. There will be plenty of amazingess to fill your brain. You'll see that we have some MozCon favorites returning like Avinash Kaushik, Wil Reynolds, and Joanna Lord, and we've invited some great new folks like Kyle Rush, Karen McGrane, and Dana DiTomaso. Those are some insanely smart industry experts! You'll learn a ton of actionable info to take home and start implementing on your site(s) right after MozCon. And for those of you wanting to know about the party... This year we're raising the roof of the EMP Museum. That's right, we wanted to meet and greet our community while hiding from Daleks. We've listened to your needs, and the EMP's amazing space works for those who want to rock out to karaoke as well as those interested in quieter conversations with a new friend. Sing your heart out if you choose. If that hasn't got you purchasing your ticket yet... MozCon 2013 Agenda Monday 8:00am - 9:00am Breakfast 9:00 am - 9:30am Intro: The Year in SEO, Marketing, and Moz with Rand Fishkin 9:30am - 10:00am Really Targeted Outreach with Richard Baxter We’ve all sent guest post pitches and \"link building requests\" and begged for precious links any way and anywhere we can. But, that simply isn’t marketing. We have all the tools for a better way of finding our audience and determining what they love. Richard will show you a data-driven approach to marketing your brand to your target audience. No more guesswork, you’ll know exactly how to get the right eyeballs on your content. 10:00am - 10:30am International SEO and the Future of Your ROI with Aleyda Solis Take a bold step into the international market. Aleya will walk you through how to calculate the possible ROI of international sales, how to sell it to your boss or client, and the practical how-to's of international implementation on your site. 10:30am - 10:50am Break 10:50am - 11:50am Simplifying Complexity: Three Ideas For Higher ROI with Avinash Kaushik One of the awesome realities of our existence is that we have to deal with a lot of complexity. Often the natural response to that is to try and overpower that with even more complexity. In this session, we'll apply the Occam's Razor to three user cases and learn practical tips. 11:50am - 1:20pm Lunch 1:20pm - 1:50pm Wordless Wednesdays: How to Swaggerjack the Power of Visual Memes with Lena West Image-heavy, responsive websites are all the rage, but can be problematic for SEO, load times, and other inbound marketing concerns. But how does this balance out with the popularity of images-based memes like \"Wordless Wednesday\"? Lena will examine these visual memes and their impact on traffic, and she'll talk about how you can parlay the power of visual memes into serious search and traffic results. 1:50pm - 2:20pm Rapid Fire Link Building Tips for Your Content with Ross Hudgens You've built your content and made it King. Now what? Ross teaches you how to take your content and turn it into links for your site. Whether you're just hunting for backlinks or building up social shares, you'll find all the tips to get your community engaged and building those links for you. 2:20pm - 3:00pm Hot Off the Press: 2013 Ranking Factors with Matt Peters Moz's data scientist Dr. Matt walks you through the 2013 Ranking Factors. He'll be breaking down Google's cutting-edge ways of how they figure out if your pages are relevant beyond keywords. You'll walk away with an understanding of the data and the knowledge to craft a sound SEO strategy. 3:00pm - 3:30pm Strings to Things: Entities and SEO with Matthew Brown In the last year, Google and Bing have both indicated a shift to entity-based search results as part of their evolution. Google has unscored this point with rich snippets and Knowledge Graph, and Bing has now upped the ante on personal search results with Bing Snapshots. Find out how you can adopt strategies to stay ahead of the curve in the new world of semantic search results. 3:30pm - 3:50pm Break 3:50pm - 4:20pm The Mobile Content Mandate with Karen McGrane Do you think \"no one will ever want to do that on mobile\"? Chances are, someone already wants to. Karen will discuss why you need to deliver content wherever your customer wants to consume it — and the risks of ignoring mobile users. She'll also explain how to start your mobile content strategy, define what you want to publish, construct the relationship between your mobile and desktop site, and evolve your editorial workflow and content management tools. 4:20pm - 4:50pm Building a Better Business with Digital Marketing with Mackenzie Fogelson Extraordinary businesses and communities are built with a higher purpose than just making money. Mack will walk you through how you can achieve bigger objectives for your clients or for your own business. Using the power of digital marketing tools (along with passion and hard work), you'll learn how to shape and foster your company and the community around it. 4:50 - 5:20pm The 7 Heavenly Habits of Inspired Inbound Marketers with Dharmesh Shah Curious about how some of the world's best inbound marketers work? How do they come up with ideas for content? What's their policy on handling Twitter mentions? How much do they really spend on A/B testing? Dharmesh will walk you through these habits and more. Tuesday 8:00am - 9:00am Breakfast 9:00am - 9:30am Building a Winning Video Marketing Strategy with Phil Nottingham Phil's going to guide to you through the process of building a video content strategy from inception to launch. He'll explain the creative and technical tactics required to win the internet with video. By the end of this session, you'll know where to host your video, how to optimize it, what kind of content you should be creating, and how to get professional quality returns without spending a fortune. 9:30am - 9:45am The Next Generation of Mozscape with Phil Smith As we crawl the web, collecting data, our Mozscape has run into a few pitfalls as we've grown. Phil's been working on an incremental indexing for the next generation of Mozscape, and he'll give you insights on how this faster, fresher, and scalable index will be useful to you. 9:45am - 10:00am How to Moz Lingo: Cross-Team Communication When Crisis Hits with Carin Overturf Mozzy does not alway mean bright and shiny. Sometimes things go south, and it's these times when good communication across all teams, technical and not-so-technical, is critical. Carin brings the tactics she's learned about effective crisis management after surviving a few storms as a technical manager on the Mozscape team. 10:00am - 10:15am Empower Your Customers to Become Your Evangelists with Aaron Wheeler You have the power to turn customers into one of your strongest, most cost-effective marketing teams. By creating great experiences for customers during good times and bad, they'll share their successes and demonstrate the value you've given them to a broader audience, much to the delight of your marketing and customer service teams. 10:15am - 10:30am Engineer Your Life: Agile for Work and Play with Miranda Rensch Agile development, it's not just for software companies anymore. Miranda will show us how you can use an agile process to plan anything from side-projects, marketing launches, and personal improvement goals. You'll come away with templates and processes to try in your own team or at home! 10:30am - 10:50am Break 10:50am - 11:20am Let's Play for Keeps: Building Customer Loyalty with Joanna Lord We all know that customer loyalty is a key ingredient in building brands, hitting revenue goals, and cultivating a community. Joanna will walk you through how the landscape has changed, and she'll leave you with tools and tips on how to build customer loyalty that lasts. 11:20am - 11:50pm Ecommerce SEO: Cutting Edge Tactics That Scale with Adam Audette Fight Panda and other modern SEO realities by using the best on-page techniques and content strategies for your ecommerce site. Adam teaches you how to sustainably improve your click-through-rates as SERPs become noisier and properly prepare for G+ and Graph Search. Then he'll round things out be giving practical advice on how to build your ecommerce team and work flows. 11:50pm - 1:20pm Lunch 1:20pm - 1:50pm Building Your Business: Relationship and Other Critical \"Soft\" Skills with Brittan Bright Ever dealt with a difficult client or a boss who just didn't understand? Brittan teaches you essential relationship building skills and tips and tricks for making your business interactions smooth and easy. Whether you're always putting out fires or pitching new ideas, you won't want to miss this. 1:50pm - 2:20pm Win Through Optimization and Testing with Kyle Rush Kyle shares his knowledge from the front lines of the most intense web campaign to date: the 2012 US presidential election. His team won big for Obama with a data-driven approach. Kyle will explore tactics like how they increased donations by 49% and help you implement these wins for your site. 2:20pm - 2:50pm How Gender and Cultural Differences in Web Psychology Affect the Customer Experience with Nathalie Nahai Are you missing half your audience? Your site may be giving off the wrong psychology signals and causing potential customers to click away. Nathalie covers how gender and cultural differences impact your business and winning tactics to change the message and convert more customers. 2:50pm - 3:20pm Breaking Up with Your Keyword-Based KPIs with Annie Cushing Raise your hand if you hate (not provided)? Annie shows you how to raise your battle cry by finding your keyword data elsewhere. By changing your focus from (not provided) to what your landing pages can tell you, you'll be able to audit your site even better than before. 3:20pm - 3:40pm Break 3:40pm - 4:10pm End-to-End Local Optimization with David Mihm The paradox of Local Search has always been that it's one of SEO's most time-consuming areas, and yet, the businesses who stand to gain the most have the smallest budgets and limited internal resources. Whether you're an agency serving SMB clients or a large brand with hundreds of locations, scaling your efforts is critical. Learn how to increase the efficiency of your Local optimization process with these tips and tools from David. 4:10pm - 4:40pm Next Level Local Tactics: Making Your SEO Stand Out with Dana DiTomaso Competing against giant brands in the Local SEO space can be daunting, but Dana's here to turn your epic battle into an epic win. She'll show you how to put personality into your local search efforts so that local searchers want to know who you are. Dana's practical tactics and advice for thinking around the problem will crank your creativity up to 120%. 4:40pm - 5:10pm Cater to Your Audience via UX with Allison Urban User experience is critical to making your audience feel your site, services, or products are for them. Allison will use case studies to show why UX matters and how it conveys respect for your customers. Then she'll deliver tactics and advice she learned while working on MailChimp's redesign. 5:10pm - 5:40pm Living in the Future of User Behavior with Will Critchlow As the technology space constantly changes, users and their behavior adjust with the tide. But what should we do? Will takes a look at where the trends are going and gives you the tactics and tips to keep up and maybe get ahead of the game. 7:30pm - 11:00pm Party at the EMP Wednesday 08:00am - 9:00am Breakfast 9:00am - 9:40am Beyond 10 Blue Links: The Future of Ranking with Pete Meyers In the year since we launched MozCast, the face of Google has changed dramatically. We’ve seen the roll-out of 7-result SERPs, the rapid expansion of Knowledge Graph, mass-adoption of authorship, and dozens of new features, rich snippets, and widgets. Ranking is no longer just a number, and achieving it is a moving target. Find out how to think like a brand and carve out a place in the SERP of the future. 9:40am - 10:10am Using Metrics to Build Social Media Engagement with Carrie Gouldin Between Edgerank, noise, and upcoming networks, social metics are daunting. Carrie will show you what makes interesting content, how to track links, read metrics, and keep your followers hungry for more. By testing and trying new things, she's built up a 25-50% engagement rate for ThinkGeek's Facebook and you can too for your brand. 10:10am - 10:30am Break 10:30am - 11:00am The Search for Company Culture and Why It Matters with Sarah Bird Whether you realize it or not, your company has a culture. Is it helping you or holding you back? Learn how to identify your company culture, foster the culture you want, and avoid common pitfalls. Sarah will share what she's learned at Moz, and why what works for one company might not work for yours. 11:00am - 12:00pm Why the Internet Hates Us and Can #RCS Change That Perception? with Wil Reynolds Post-MozCon 2012, Wil has been focused on helping you get things done by using #RCS paired with facts and figures from his own company, his clients, and insights from 30 members of top US design agencies. He's also been reviewing the successes, the failures, and the steps his team put into place for change. Wil wants to get the word out that it's time to stop chasing all the shiny SEO shortcuts! 12:00pm - 1:30pm Lunch 1:30pm - 2:00pm Building Your Community From the Ground Up with Jen Lopez What if we had to start over and rebuild the Moz community from scratch? Jen walks us through the steps, from how to start building an audience all the way through to how she'd build her team. Learn actionable tactics and deep insights that you can apply to building your community, both internally and externally, for your business. 2:00pm - 3:20pm Community Speakers! This could be you! We're having four community speakers. Have you tossed your hat in the ring? Applications due Tuesday, May 14th at 5pm PDT. 3:20pm - 3:40pm Break 3:40pm - 4:40pm The Secret Ingredients of Better Marketing with Rand Fishkin Content bombards our online experience. Ads and salespeople interrupt us. But every now and then, marketing is truly remarkable and its message transforms from unwelcome to irresistible What makes it stand out? Why do some companies inspire us to take action and to share them? The ingredients have been hidden too long. It's time we discovered the what, why, and how behind crafting better marketing. 4:40pm - 5:10pm Ultimate Q&A Get your questions answered by our amazing speakers. Unlike the traditional give-it-up, Ultimate Q&A gives you the opportunity to pinpoint what amazing tips you'd like to know and gives you the actionable and inspirational information you crave. Wowzers, that's a lot of crazy amazing stuff. See you there! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "#MozCon 2013 Agenda"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "#MozCon 2013 Agenda"
    },
    {
      "level": "H2",
      "text": "MozCon 2013 Agenda"
    },
    {
      "level": "H3",
      "text": "Monday"
    },
    {
      "level": "H3",
      "text": "Tuesday"
    },
    {
      "level": "H3",
      "text": "Wednesday"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Erica McGillivray\n          \n            Erica McGillivray\n          \n            Erica McGillivray"
}