{
  "url": "https://moz.com/blog/mozcon-2018-initial-agenda",
  "slug": "mozcon-2018-initial-agenda",
  "title": "MozCon 2018: The Initial Agenda - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Wondering what's on the plate for this year's MozCon? Wait no more — the initial 2018 agenda is here! Check out which industry experts will be speaking, what topics we're covering, and snag your ticket before we sell out.",
  "content": "MozCon 2018: The Initial Agenda Moz News | SEO Events By: Trevor Klein March 29, 2018 Table of Contents Copied! By: Trevor Klein March 29, 2018 MozCon 2018: The Initial Agenda Moz News | SEO Events With just over three months until MozCon 2018, we're getting a great picture of what this year's show will be like, and we can't wait to share some of the details with you today. We've got 21 speakers lined up (and will be launching our Community Speaker process soon — stay tuned for more details on how to make your pitch!). You'll see some familiar faces, and some who'll be on the MozCon stage for the first time, with topics ranging from the evolution of searcher intent to the increasing importance of local SEO, and from navigating bureaucracy for buy-in to cutting the noise out of your reporting. Topic details and the final agenda are still in the works, but we're excited enough about the conversations we've had with speakers that we wanted to give you a sneak peek. We hope to see you in Seattle this July 9–11! If you still need your tickets, we've got you covered: Pick up your ticket to MozCon! The SpeakersHere's a look at who you'll see on stage this year, along with some of the topics we've already worked out: Jono AldersonMad Scientist, Yoast The Democratization of SEOJono will explore how much time and money we collectively burn by fixing the same kinds of basic, \"binary,\" well-defined things over and over again (e.g., meta tags, 404s, URLs, etc), when we could be teaching others throughout our organizations not to break them in the first place. As long as we \"own\" technical SEO, there's no reason (for example) for the average developer to learn it or care — so they keep making the same mistakes. We proclaim that others are doing things wrong, but by doing so we only reinforce the line between our skills and theirs. We need to start giving away bits of the SEO discipline, and technical SEO is probably the easiest thing for us to stop owning. In his talk, he'll push for more democratization, education, collaboration, and investment in open source projects so we can fix things once, rather than a million times. Stephanie BriggsPartner, Briggsby Search-Driven Content StrategyGoogle's improvements in understanding language and search intent have changed how and why content ranks. As a result, many SEOs are chasing rankings that Google has already decided are hopeless. Stephanie will cover how this should impact the way you write and optimize content for search, and will help you identify the right content opportunities. She'll teach you how to persuade organizations to invest in content, and will share examples of strategies and tactics she has used to grow content programs by millions of visits. Rob BucciCEO, STAT Search Analytics \"Near me\" or Far: How Google May Be Deciding Your Local Intent for YouIn August 2017, Google stated that local searches without the \"near me\" modifier had grown by 150% and that searchers were beginning to drop geo-modifiers — like zip code and neighborhood — from local queries altogether. But does Google still know what searchers are after? For example: the query [best breakfast places] suggests that quality takes top priority; [breakfast places near me] indicates that close proximity is essential; and [breakfast places in Seattle] seems to cast a city-wide net; while [breakfast places] is largely ambiguous. By comparing non-geo-modified keywords against those modified with the prepositional phrases \"near me\" and \"in [city name]\" and qualifiers like “best,” we hope to understand how Google interprets different levels of local intent and uncover patterns in the types of SERPs produced. With a better understanding of how local SERPs behave, SEOs can refine keyword lists, tailor content, and build targeted campaigns accordingly. Dana DiTomasoPresident and Partner, Kick Point Traffic vs. SignalWith an ever-increasing slate of options in tools like Google Tag Manager and Google Data Studio, marketers of all stripes are falling prey to the habit of \"I'll collect this data because maybe I'll need it eventually,\" when in reality it's creating a lot of noise for zero signal. We're still approaching our metrics from the organization's perspective, and not from the customer's perspective. Why, for example, are we not reporting on (or even thinking about, really) how quickly a customer can do what they need to do? Why are we still fixated on pageviews? In this talk, Dana will focus our attention on what really matters. Rand FishkinFounder, SparkToro, Moz, & Inbound.org A man who needs no introduction to MozCon, we're thrilled to announce that Rand will be back on stage this year after founding his new company, SparkToro. Topic development for his talk is in the works; check back for more information! Oli GardnerCo-Founder, Unbounce Content Marketing Is Broken and Only Your M.O.M. Can Save YouTraditional content marketing focuses on educational value at the expense of product value, which is a broken and outdated way of thinking. We all need to sell a product, and our visitors all need a product to improve their lives, but we're so afraid of being seen as salesy that somehow we got lost, and we forgot why our content even exists. We need our M.O.M.s! No, he isn't talking about your actual mother. He's talking about your Marketing Optimization Map — your guide to exploring the nuances of optimized content marketing through a product-focused lens. In this session you'll learn: Data and lessons learned from his biggest ever content marketing experiment, and how those lessons have changed his approach to content A context-to-content-to-conversion strategy for big content that converts Advanced methods for creating \"choose your own adventure\" navigational experiences to build event-based behavioral profiles of your visitors (using GTM and GA) Innovative ways to productize and market the technology you already have, with use cases your customers had never considered Casie GilletteSenior Director, Digital Marketing, KoMarketing The Problem with Content & Other Things We Don't Want to AdmitEveryone thinks they need content but they don't think about why they need it or what they actually need to create. As a result, we are overwhelmed with poor quality content and marketers are struggling to prove the value. In this session, we'll look at some of the key challenges facing marketers today and how a data-driven strategy can help us make better decisions. Emily GrossmanMobile Product Marketer & App Strategist What All Marketers Can Do about Site SpeedAt this point, we should all have some idea of how important site speed is to our performance in search. The recently announced \"speed update\" underscored that fact yet again. It isn't always easy for marketers to know where to start improving their site's speed, though, and a lot of folks mistakenly believe that site speed should only be a developer's problem. Emily will clear that up with an actionable tour of just how much impact our own work can have on getting our sites to load quickly enough for today's standards. Russ JonesPrincipal Search Scientist, Moz Lies, Damn Lies, and StatisticsRuss is our principal search scientist here at Moz. After a decade as CTO of an agency, he joined Moz to focus on what he's most interested in: research and development, primarily related to keyword and link data. He's responsible for many of our most forward-looking techniques. At MozCon this year, he's looking to focus on cutting through bad metrics with far better metrics, exploring the hidden assumptions and errors in things our industry regularly reports, showing us all how we can paint a more accurate picture of what's going on. Justine JordanVP Marketing, Litmus A veteran of the MozCon stage, Justine is obsessed with helping marketers create, test, and send better email. Named an Email Marketer Thought Leader of the Year, she is strangely passionate about email marketing, hates being called a spammer, and still gets nervous when pressing send. At MozCon this year, she's looking to cover the importance of engagement with emails in today's world of marketing. With the upcoming arrival of GDPR and the ease with which you can unsubscribe and report spam, it's more important than ever to treat people like people instead of just leads. Michael KingManaging Director, iPullRank You Don't Know SEOOr maybe, \"SEO you don't know you don't know.\" We've all heard people throw jargon around in an effort to sound smart when they clearly don't know what it means, and our industry of SEO is no exception. There are aspects of search that are acknowledged as important, but seldom actually understood. Mike will save us from awkward moments, taking complex topics like the esoteric components of information retrieval and log-file analysis, pairing them with a detailed understanding of technical implementation of common SEO recommendations, and transforming them into tools and insights we wish we'd never neglected. Cindy KrumCEO & Founder, MobileMoxie Mobile-First Indexing or a Whole New GoogleThe emergence of voice-search and Google Assistant is forcing Google to change its model in search, to favor their own entity understanding or the world, so that questions and queries can be answered in context. Many marketers are struggling to understand how their website and their job as an SEO or SEM will change, as searches focus more on entity-understanding, context and action-oriented interaction. This shift can either provide massive opportunities, or create massive threats to your company and your job — the main determining factor is how you choose to prepare for the change. Dr. Pete MeyersMarketing Scientist, MozDr. Peter J. Meyers (AKA \"Dr. Pete\") is a Marketing Scientist for Seattle-based Moz, where he works with the marketing and data science teams on product research and data-driven content. Guarding the thin line between marketing and data science — which is more like a hallway and pretty wide — he's the architect behind MozCast, the keeper of the Algo History, and watcher of all things Google. Britney MullerSenior SEO Scientist, MozBritney is Moz's senior SEO scientist. An explorer and investigator at heart, she won't stop digging until she gets to the bottom of some of the most interesting developments in the world of search. You can find her on Whiteboard Friday, and she's currently polishing a new (and dramatically improved!) version of our Beginner's Guide to SEO. At MozCon this year, she'll show you what she found at the bottom of the rabbit hole to save you the journey. Lisa MyersCEO, Verve Search None of Us Is as Smart as All of UsSuccess in SEO, or in any discipline, is frequently reliant on people’s ability to work together. Lisa Myers started Verve Search in 2009, and from the very beginning was convinced of the importance of building a diverse team, then developing and empowering them to find their own solutions. In this session she’ll share her experiences and offer actionable advice on how to attract, develop, and retain the right people in order to build a truly world-class team. Heather PhysiocDirector of Organic Search, VML Your Red-Tape Toolkit: How to Win Trust and Get Approval for Search WorkAre your search recommendations overlooked and misunderstood? Do you feel like you hit roadblocks at every turn? Are you worried that people don't understand the value of your work? Learn how to navigate corporate bureaucracy and cut through red tape to help clients and colleagues understand your search work — and actually get it implemented. From diagnosing client maturity to communicating where search fits into the big picture, these tools will equip you to overcome obstacles to doing your best work. Mike RamseyPresident, Nifty Marketing The Awkward State of LocalYou know it exists. You know what a citation is, and have a sense for the importance of accurate listings. But with personalization and localization playing an increasing role in every SERP, local can no longer be seen in its own silo — every search and social marketer should be honing their understanding. For that matter, it's also time for local search marketers to broaden the scope of their work. Wil ReynoldsFounder & Director of Digital Strategy, Seer Interactive Excel Is for Rookies: Why Every Search Marketer Needs to Get Strong in BI, ASAPThe analysts are coming for your job, not AI (at least not yet). Analysts stopped using Excel years ago; they use Tableau, Power BI, Looker! They see more data than you, and that is what is going to make them a threat to your job. They might not know search, but they know data. I'll document my obsession with Power BI and the insights I can glean in seconds which is helping every single client at Seer at the speed of light. Search marketers must run to this opportunity, as analysts miss out on the insights because more often than not they use these tools to report. We use them to find insights. Alexis SandersTechnical SEO Account Manager, Merkle Alexis works as a Technical SEO Account Manager at Merkle, ensuring the accuracy, feasibility, and scalability of the agency’s technical recommendations across all verticals. You've likely seen her on the Moz blog, Search Engine Land, OnCrawl, The Raven Blog, and TechnicalSEO.com. She's got a knack for getting the entire industry excited about the more technical aspects of SEO, and if you haven't already, you've got to check out the technical SEO challenge she created at https://TechnicalSEO.expert. Darren ShawFounder, Whitespark At the forefront of local SEO, Darren is obsessed with knowing all there is to know about local search. He organizes and publishes research initiatives such as the annual Local Search Ranking Factors survey and the Local Search Ecosystem. At MozCon this year, he'll unveil the newest findings from the Local Search Ranking Factors study, for which he's already noticing significant changes from the last release, letting SEOs of all stripes know how they need to adjust their approach. Grab your ticket today! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "MozCon 2018: The Initial Agenda"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "MozCon 2018: The Initial Agenda"
    },
    {
      "level": "H2",
      "text": "The Speakers"
    },
    {
      "level": "H3",
      "text": "Jono Alderson"
    },
    {
      "level": "H4",
      "text": "The Democratization of SEO"
    },
    {
      "level": "H3",
      "text": "Stephanie Briggs"
    },
    {
      "level": "H4",
      "text": "Search-Driven Content Strategy"
    },
    {
      "level": "H3",
      "text": "Rob Bucci"
    },
    {
      "level": "H4",
      "text": "\"Near me\" or Far: How Google May Be Deciding Your Local Intent for You"
    },
    {
      "level": "H3",
      "text": "Dana DiTomaso"
    },
    {
      "level": "H4",
      "text": "Traffic vs. Signal"
    },
    {
      "level": "H3",
      "text": "Rand Fishkin"
    },
    {
      "level": "H3",
      "text": "Oli Gardner"
    },
    {
      "level": "H4",
      "text": "Content Marketing Is Broken and Only Your M.O.M. Can Save You"
    },
    {
      "level": "H3",
      "text": "Casie Gillette"
    },
    {
      "level": "H4",
      "text": "The Problem with Content & Other Things We Don't Want to Admit"
    },
    {
      "level": "H3",
      "text": "Emily Grossman"
    },
    {
      "level": "H4",
      "text": "What All Marketers Can Do about Site Speed"
    },
    {
      "level": "H3",
      "text": "Russ Jones"
    },
    {
      "level": "H4",
      "text": "Lies, Damn Lies, and Statistics"
    },
    {
      "level": "H3",
      "text": "Justine Jordan"
    },
    {
      "level": "H3",
      "text": "Michael King"
    },
    {
      "level": "H4",
      "text": "You Don't Know SEO"
    },
    {
      "level": "H3",
      "text": "Cindy Krum"
    },
    {
      "level": "H4",
      "text": "Mobile-First Indexing or a Whole New Google"
    },
    {
      "level": "H3",
      "text": "Dr. Pete Meyers"
    },
    {
      "level": "H3",
      "text": "Britney Muller"
    },
    {
      "level": "H3",
      "text": "Lisa Myers"
    },
    {
      "level": "H4",
      "text": "None of Us Is as Smart as All of Us"
    },
    {
      "level": "H3",
      "text": "Heather Physioc"
    },
    {
      "level": "H4",
      "text": "Your Red-Tape Toolkit: How to Win Trust and Get Approval for Search Work"
    },
    {
      "level": "H3",
      "text": "Mike Ramsey"
    },
    {
      "level": "H4",
      "text": "The Awkward State of Local"
    },
    {
      "level": "H3",
      "text": "Wil Reynolds"
    },
    {
      "level": "H4",
      "text": "Excel Is for Rookies: Why Every Search Marketer Needs to Get Strong in BI, ASAP"
    },
    {
      "level": "H3",
      "text": "Alexis Sanders"
    },
    {
      "level": "H3",
      "text": "Darren Shaw"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Trevor Klein\n          \n            Trevor Klein\n          \n            Trevor Klein"
}