{
  "url": "https://moz.com/blog/mozcon-2024-initial-agenda",
  "slug": "mozcon-2024-initial-agenda",
  "title": "MozCon 2024: The Initial Agenda - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The moment you’ve been so eagerly awaiting has finally arrived. Today, we’re excited to share the lineup of talks hitting the MozCon 204 stage this June.",
  "content": "MozCon 2024: The Initial Agenda Moz News | SEO Events By: Cheryl Draper Edited By: Emilie Martin January 16, 2024 Table of Contents Copied! By: Cheryl Draper Edited By: Emilie Martin January 16, 2024 MozCon 2024: The Initial Agenda Moz News | SEO Events It’s hard to believe that the big event is just about four months out. We're excited to give you a preview of what you can expect to hear on stage this June, but first, we wanted to take a moment to introduce you to another four incredible speakers who are joining our 2024 lineup: Britney Muller Founder, DataSci 101 @BritneyMuller Britney merges AI with marketing, bringing her experience from Hugging Face and Moz to her current work at DataSci101.com, where she makes AI accessible for marketers. She also consults, leads AI workshops, and works on ML projects in her spare time. Garrett Sussman Demand Generation Manager, iPullRank @GarrettSussman | @iPullRankAgency Garrett leads demand gen at iPullRank and has worked in marketing for over fourteen years across several disciplines, including content marketing, demand gen, and SEO. He's interviewed every major SEO for the Rankable Podcast and hosts The SEO Weekly. Talia Wolf Founder & Chief Optimizer, GetUplift @TaliaGw Talia is the founder of Getuplift, the CRO agency high-growth brands like Mercedes, Bitly & Thinkific turn to when they want to optimize their customer journeys. Talia and her team use emotional targeting to generate more leads, sales & ROI for clients. Willow Mack SVP, Enterprise Solutions, Moz @willowmack | @Moz Willow holds dual roles as the SVP of People Operations for the Moz Group and the SVP of Enterprise Solutions within the SEO vertical. She has over 20 years of experience in tech, holding a wide variety of Leadership roles — from Fintech to SEO, the bootstrapped to the publicly traded — and brings with her a unique perspective on the impact of change in an ever-evolving landscape. What to expect From fresh faces joining us for the first time to some fan favorites making a return appearance, our speaker lineup this year is 🔥. Topics range from AI and future-proofing your strategies, tactics to build trust and engagement, leveraging content in new and meaningful ways, and way more — all with an emphasis on practitioners sharing tactical advice and real-world stories of how they’ve moved the needle (and how you can, too). Once again, you’ve got two incredible ways to join us for MozCon: a fully immersive in-person experience in Seattle or through our livestream-only passes, which will be broadcast live from the Seattle stage. Grab your MozCon ticket today and get ready for the Future of Digital Marketing! Register for MozCon The Speakers + Agenda Feast your eyes on the lineup of talks being presented this year: Amanda Jordan Director of Digital Strategy | RicketyRoo Create Local Dominance Through Your Digital Ecosystem Explore the power of local business authority with Amanda! In this presentation, you’ll gain insights into boosting your brand's visibility by leveraging local landmarks, events, and culture and uncover strategies for dominating SERPs with advanced SEO tactics. Learn to seamlessly integrate social and online strategies, and discover the keys to making your brand synonymous with your city for a relatable and impactful digital presence. You’ll leave MozCon armed with an actionable blueprint that will transform your local business game. Andy Crestodina Co-founder / CMO | Orbit Media Studios Trust and Quality in the New Era of Content Discovery After decades in digital, we enter a new era where AI has changed everything… or maybe not. Our audience hasn’t changed. Their needs haven’t changed. Their perception of quality hasn’t changed. In fact, the most important things haven’t changed at all. In this session, you’ll learn how AI can make us better at the classic challenges of how to: get discovered, connect through content, and stay top of mind with the people who matter most. We’ll use timely tools to rebuild timeless foundations. We’ll do better basics but with the most advanced techniques. Andy will share a set of frameworks, prompts, and techniques for better digital basics using the latest tools of today. And in the end, Andy will consider — in a brief glimpse — what might be the biggest change of all and how to grow your footprint in the new landscape. Azeem Ahmad Global Marketing Lead | Azeem Digital Multimedia Marvels - A Symphony of Audio and Visual Marketing Narratives In this talk, Azeem will dive into the successes of iconic marketing campaigns that stand the test of time, all with the aim of equipping you as marketers to use more audio and video in your organic marketing. From key historical moments to our modern digital landscape and with a view to the future, Azeem will explore the power of audio and visual narratives that have made lasting impressions in marketing. You'll walk away with actionable insights to enhance both short-term wins and long-term success in your marketing endeavors. Don't miss the chance to reshape your approach and create campaigns that resonate across time and trends. Bernard Huang Co-founder | Clearscope \"E\" for Engaging: Why The Future of SEO Content Needs To Be Engaging It's clear that Google cares about relevant, helpful content, but how does Google know what's actually meeting users’ needs? The answer is simple: engagement. More importantly, the conclusion of a search journey. In this talk, Bernard will dive into the different phases of how Google's algorithm works, starting from indexation, moving into the initial testing sandbox, and finally towards user engagement. Bethan Vincent Managing Partner | Open Velocity Beyond Clicks and Keywords: Dispelling Dystopian Futures Generative AI, monopolistic markets, and ongoing algorithm changes are all shaping the marketing landscape in increasingly unpredictable ways. Audiences also fragment as interactions spread across a vast channel surface area and move to proprietary platforms like Meta and X/Twitter. Throw in a healthy dose of economic uncertainty, and we have an environment where effective marketing is more complex than ever. The future of our industry sounds a bit apocalyptic, doesn’t it? But all hope is not lost. This talk will argue why (and how) even channel-specific marketers must start thinking beyond their domain and engaging with the full brand surface area. You’ll understand how to make effective decisions in fast-moving scenarios with multiple dependencies. To paraphrase Darwin: it is not the strongest of the species that survives, nor the most intelligent that survives. It is the one that is most adaptable to change. Britney Muller Founder | DataSci 101 Behind the AI Curtain: Insights into the Invisible Uncover the hidden facets of AI and its transformative impact on the marketing and SEO industry. Dive into practical insights and actionable techniques to future-proof your digital marketing strategies. This talk offers a unique peek into the hidden side of AI, empowering you to navigate and leverage its ever-evolving landscape. Chima Mmeje Senior Content Marketing Manager | Moz From Followers to Believers: Craft a Personal Brand That Commands Trust Plagued by imposter syndrome, self-doubt, or the gnawing worry that your voice will be lost in a sea of others? These are common barriers that can deter even the most talented individuals from building a personal brand. However, these challenges should not hold you back. Chima Mmeje conquers these fears head-on with a personal brand boasting a following of over 35k across social media, and features in leading publications like Entrepreneur and HubSpot. In this talk, Chima shares the blueprint for building a memorable brand, aligning your personal brand with an organization's voice & tone, and using your brand to attract organic leads. Whether you're a C-suite executive or a junior SEO looking to make your mark, you'll learn how to nurture a personal brand that works as a lead-generation machine. Crystal Carter Head of SEO Communications | Wix On the Hunt for Hidden Gems💎: Perspectives on UGC in the SERP Are you down with OPP — Other People's Perspectives? In this talk, we’ll explore the rise of Perspectives, user-generated content, and the return of forums in the SERP. With Google's emphasis on surfacing \"Hidden Gems,\" how can you maintain brand visibility and authenticity? Looking at live examples from around the web, you’ll discover how to leverage existing UGC channels, optimize your own, and make use of AI in your strategies. Dana DiTomaso Founder & Lead Instructor | Kick Point Playbook It’s Not Right, But It’s Okay: The Future of Analytics Welcome to our analytics future, where embracing imperfection is key. Our ability to capture data is rapidly changing — how can we navigate these changes, and what do they mean for our best-laid analytics plans? In this session, you'll discover strategies to make informed decisions in a landscape full of uncertainties. Through practical examples and techniques, learn how to make decisions based on imperfect data and leave with a clear understanding of how to adapt your mindset to a future where analytics perfection isn't just unrealistic; it's unnecessary. Garrett Sussman Demand Generation Manager | iPullRank SEO Mind Games: Decode Searcher Bias for Content Success Explore the untapped influence of searcher bias in the dynamic evolution of SEO. While the industry often dissects search engine bias, Garrett will delve into the psyche of searchers, unraveling the threads of confirmation bias and its profound impact on content strategy. From leading queries like \"Is coffee good for you?\" to the self-guided nuances of conversational search, he'll examine how biases shape our interactions with Google's Search Generative Experience and the search ecosystem at large. This presentation goes beyond the surface, hinting at various other biases that influence the search experience. By the end, Garrett will tie these insights into a cohesive framework, unveiling the strategic implications for content creation. Join him on this journey through the searcher's mind and gain actionable strategies to become the content your audience is searching for. Joy Hawkins Owner | Sterling Sky Inc. What We Learned From Clients that Canceled Last Year Join us for an action-packed session where Joy will reveal invaluable insights gained from setbacks and explore the lessons learned from clients that have canceled. Discover the actionable processes they’ve since implemented, patterns they’ve identified, and uncover which industries are scaling back their marketing spend. Through engaging stories and practical examples, Joy will delve into the world of local SEO, with universal takeaways for agencies and specific solutions tailored to the challenges of the local landscape. Joel Klettke President | Business Casual Copywriting Build a Story-Driven Marketing Machine Customer stories can be the most powerful, persuasive, and profitable content you create — but only if you know how to use them. In this no-nonsense session, you'll learn how to set a meaningful strategy, get the right customers on the record, and use stories to differentiate and drive revenue across the entire buyer's journey. Lily Ray Vice President, SEO Strategy & Research | Amsive Optimize the Forest, Not the Trees: Move Beyond SEO Checklists It can be tempting to approach SEO like checking a list of tactical items off a checklist. Our industry produces checklists for all kinds of SEO processes — all of which are helpful and come in great handy — but often lead to SEO practitioners losing site of the most important questions of them all: why am I doing this task, why does it matter to the client, and what impact will it have on overall performance? After 10+ years of overseeing agency SEO teams, Lily will share what she sees as a common tendency to miss the SEO forest for the trees and how to ensure your priorities are aligned with the outcomes your clients (or your boss) care about! Dr. Pete Meyers Marketing Scientist | Moz Brand or Bust: Can You Compete? Google's job is to model the world, and the world is built on brands. As Google Gemini evolves and the machine is trained on our collective knowledge, brands will only get stronger. The brand advantage may seem unfair, but brand-building isn't just for mega-brands. Learn how to tap into the power of brand and why it's essential for driving search traffic in 2024 and beyond. Ross Simmonds CEO & Founder | Foundation Marketing Survive the Chaos: Smaller Budgets, Bigger Goals, and the AI Advantage Shrinking budgets, growing AI. Smaller teams, bigger goals. Less space in the SERP, more chaos. The industry is going through a shift. In many ways, this is a reset in how marketing has always been done but — for the last decade — forgotten about. As buyer behavior and the market expectations change, teams, marketers, and leaders must all change with it. In this talk, Ross will share insight and tactics on how to navigate this new world on the back of data, as well as strategies that are grounded in traditional thinking, such as storytelling, and modern technologies, such as artificial intelligence. Talia Wolf Founder & Chief Optimizer, GetUplift The Power of Emotion: How To Create Content That (Actually) Converts All of the AI tools, automation, and other technologies in the world will never help you create high-converting content if you fail to leverage the one component that matters more than anything else in marketing: Emotion. During this session, Talia will show you how to leverage emotion-based marketing to drive meaningful ROI from your content with proven and tested tactics. You’ll discover how to get into your audience's heads (and hearts) so you can create content that drives conversions. Talia will guide you through the emotional marketing framework she uses to create high-converting pages (with case studies you can learn from). You’ll walk away with the tools to optimize your copy and design with emotion to drive more ROI from your content. Tom Capper Senior Search Scientist | Moz + STAT The Road to Hell Is Paved With Good Intents Each year, ranking for a keyword becomes increasingly labyrinthine. It's less obvious which SERPs make sense for your site, what type of content is best suited when it does, or whether any features or positions are really even in play. In his talk, Tom will show you how to tease apart all this complexity to find targeted opportunities in your space. Wil Reynolds Founder & VP of Innovation | Seer Interactive Connect the Uncommon Dots: Use “SEO” Skills to Stay Ahead & Lead Marketing in a Generative AI World With 25 years in search, I'll invite you to journey back to when new search engines emerged almost daily, each with unique features (Go “Google” Snap, iWon, Infoseek). It was the Wild Wild West… sound familiar? Generative AI, via LLMs, are great predictors of what words are likely to come next. So, in the future, your job will be to develop unpredictable ideas and approaches to solving customer problems. Search will be won on the margins. The little 1% atypical insights add up and have an impact, but how will you get those uncommon ideas? By doing what search people have always done: hypothesize and test, challenge best practices. Whether it's ChatGPT or Google doesn't matter — it's just another box customers are asking a question seeking an answer, and the search industry is better than most at testing and turning that information into value. It’s in your DNA, and this presentation will just remind you that you’re already prepared with the skills to navigate the disruptions ahead. I'll share my playbook, drawing on \"SEO thinking\" in this new world. You’ll learn how to staff for a world where people move away from search engines, how to time those bets on when your customers will be making the shift, how to prepare for shifting KPIs, and what you can do today to start to retrain your org from Search KPI's to Generative AI KPIs. Willow Mack SVP, Enterprise Solutions | Moz Welcome to MozCon + State of the Industry Willow will be kicking things off early on the first day with a warm welcome, laying out all the pertinent details of the conference and setting the stage for what’s to come over the two days of MozCon. Meet your MozCon 2024 Emcees We have three incredibly entertaining MozCon Emcees who will guide you through each day and keep the show rolling along: Cheryl Draper Senior Growth Marketing Manager | Moz Cyrus Shepard Co-founder | Zyppy Melissa Rae Brown Learning Team Manager | Moz We hope you’re as excited as we are for June 3 & 4 to hurry up and get here. And again, if you haven’t grabbed your ticket yet, we’ve got your back. There are still a few Extremely Early Bird tickets available. Need help making a case? We have a handy template to convince your boss! Register for MozCon Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "MozCon 2024: The Initial Agenda"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "MozCon 2024: The Initial Agenda"
    },
    {
      "level": "H3",
      "text": "Britney Muller"
    },
    {
      "level": "H3",
      "text": "Garrett Sussman"
    },
    {
      "level": "H3",
      "text": "Talia Wolf"
    },
    {
      "level": "H3",
      "text": "Willow Mack"
    },
    {
      "level": "H2",
      "text": "What to expect"
    },
    {
      "level": "H2",
      "text": "The Speakers + Agenda"
    },
    {
      "level": "H3",
      "text": "Amanda Jordan"
    },
    {
      "level": "H4",
      "text": "Create Local Dominance Through Your Digital Ecosystem"
    },
    {
      "level": "H3",
      "text": "Andy Crestodina"
    },
    {
      "level": "H4",
      "text": "Trust and Quality in the New Era of Content Discovery"
    },
    {
      "level": "H3",
      "text": "Azeem Ahmad"
    },
    {
      "level": "H4",
      "text": "Multimedia Marvels - A Symphony of Audio and Visual Marketing Narratives"
    },
    {
      "level": "H3",
      "text": "Bernard Huang"
    },
    {
      "level": "H4",
      "text": "\"E\" for Engaging: Why The Future of SEO Content Needs To Be Engaging"
    },
    {
      "level": "H3",
      "text": "Bethan Vincent"
    },
    {
      "level": "H4",
      "text": "Beyond Clicks and Keywords: Dispelling Dystopian Futures"
    },
    {
      "level": "H3",
      "text": "Britney Muller"
    },
    {
      "level": "H4",
      "text": "Behind the AI Curtain: Insights into the Invisible"
    },
    {
      "level": "H3",
      "text": "Chima Mmeje"
    },
    {
      "level": "H4",
      "text": "From Followers to Believers: Craft a Personal Brand That Commands Trust"
    },
    {
      "level": "H3",
      "text": "Crystal Carter"
    },
    {
      "level": "H4",
      "text": "On the Hunt for Hidden Gems💎: Perspectives on UGC in the SERP"
    },
    {
      "level": "H3",
      "text": "Dana DiTomaso"
    },
    {
      "level": "H4",
      "text": "It’s Not Right, But It’s Okay: The Future of Analytics"
    },
    {
      "level": "H3",
      "text": "Garrett Sussman"
    },
    {
      "level": "H4",
      "text": "SEO Mind Games: Decode Searcher Bias for Content Success"
    },
    {
      "level": "H3",
      "text": "Joy Hawkins"
    },
    {
      "level": "H4",
      "text": "What We Learned From Clients that Canceled Last Year"
    },
    {
      "level": "H3",
      "text": "Joel Klettke"
    },
    {
      "level": "H4",
      "text": "Build a Story-Driven Marketing Machine"
    },
    {
      "level": "H3",
      "text": "Lily Ray"
    },
    {
      "level": "H4",
      "text": "Optimize the Forest, Not the Trees: Move Beyond SEO Checklists"
    },
    {
      "level": "H3",
      "text": "Dr. Pete Meyers"
    },
    {
      "level": "H4",
      "text": "Brand or Bust: Can You Compete?"
    },
    {
      "level": "H3",
      "text": "Ross Simmonds"
    },
    {
      "level": "H4",
      "text": "Survive the Chaos: Smaller Budgets, Bigger Goals, and the AI Advantage"
    },
    {
      "level": "H3",
      "text": "Talia Wolf"
    },
    {
      "level": "H4",
      "text": "The Power of Emotion: How To Create Content That (Actually) Converts"
    },
    {
      "level": "H3",
      "text": "Tom Capper"
    },
    {
      "level": "H4",
      "text": "The Road to Hell Is Paved With Good Intents"
    },
    {
      "level": "H3",
      "text": "Wil Reynolds"
    },
    {
      "level": "H4",
      "text": "Connect the Uncommon Dots: Use “SEO” Skills to Stay Ahead & Lead Marketing in a Generative AI World"
    },
    {
      "level": "H3",
      "text": "Willow Mack"
    },
    {
      "level": "H4",
      "text": "Welcome to MozCon + State of the Industry"
    },
    {
      "level": "H2",
      "text": "Meet your MozCon 2024 Emcees"
    },
    {
      "level": "H3",
      "text": "Cheryl Draper"
    },
    {
      "level": "H3",
      "text": "Cyrus Shepard"
    },
    {
      "level": "H3",
      "text": "Melissa Rae Brown"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    }
  ],
  "author": "Cheryl Draper\n          \n            Cheryl Draper\n          \n            Cheryl Draper"
}