{
  "url": "https://moz.com/blog/mozcon-2023-local-seo-takeaways",
  "slug": "mozcon-2023-local-seo-takeaways",
  "title": "Top Local SEO Takeaways from MozCon 2023 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Miriam touches on all of the top local SEO takeaways from MozCon 2023, including tips on local link categorization, video SEO, and diverse takes on AI.",
  "content": "Top Local SEO Takeaways from MozCon 2023 Local SEO | SEO Events By: Miriam Ellis August 16, 2023 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis August 16, 2023 Top Local SEO Takeaways from MozCon 2023 Local SEO | SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Edited by Emilie Martin It’s my pleasure to bring you this annual re-cap of one of the industry’s best-loved events. While only one talk at MozCon 2023 was specifically local SEO-focused, there were tons of takeaways from multiple presentations that are highly relevant to our space of local SEOs and local business owners! Without further ado, let’s dive right in: Are you categorizing your links yet? I confess unashamedly that Amanda Jordan’s presentation on local link building was the talk I was looking forward to most this year, and it did not disappoint. As a local SEO or local business owner, you already know why analyzing and earning backlinks matters to your online visibility, but Amanda really upped the sophistication level of how we think about links, and she had a surprise in store for the audience, as well. Beware of any advice that leaves this topic at “you need to get links”, and instead, take a look at this slide in which Amanda shows the results of a study she did on the HVAC industry across the 50 most-populous US cities: You might predict that SA Service Experts, having earned 59 backlinks, would be running away with the number of search terms for which it's earning page 1 rankings, right? Yet look at One Hour Houston, with only one link less, but many more rankings. Then look down at Penguin Air, which has only earned 7 links but is barely behind the most-linked-to competitor in terms of its visibility. If links were a mere numbers game, this chart wouldn’t look this way, and Amanda wanted to figure out why the top and bottom businesses are so far apart in links earned, but not very far apart in visibility earned. Check out slide 2: What Amanda discovered is that it appears to be the category of links earned which is enabling businesses with few links to compete with those with many more. She proposed the categories: Local LinksTopical LinksCitationsLinks stemming from tools or couponsOther And she noticed that the highest performing local business websites in her HVAC study had the most local and topical links. In fact, Amanda mentioned that she saw a local business being really dominant in the rankings with just one good link from a local news site. Amanda stressed that we should remember that for local brands, location falls into both the “local” and “topical” categories because your location is a topic. She also mentioned that different categories of links could exert more power in different verticals. To understand your own scenario, she suggested the following workflow: Identify your top competitors for your key search phrases.Analyze their links with your favorite tool (Check out Moz Link Explorer for free right now!) Categorize your competitors’ backlinks by type. For example, is the link local, like a link on a local community blog, topical, like a link on an industry publication, a citation they built somewhere like Yelp, a link from the distribution of a tool, or something else? You can create your own buckets, but do stick to them throughout your workflow to get consistent results.Look at your data to see if there is a particular category of links your top competitors have focused on.Identifying whether these sources represent link opportunities for you.Get those links! Amanda’s company, Rickety Roo, is in the process of developing a tool to help you categorize links at scale, and that should be a winner. In the meantime, I suggest doing some of this work manually to start thinking in terms of local link categories and learning to see the patterns between link type and visibility. Are you making up your mind about AI yet? Please don’t, because if MozCon proved one thing to me, it's that our SEO colleagues are all over the map on this hot topic. There’s a general consensus that AI is a game-changer…to some degree, and a general groan at the idea that, yet again, “SEO is dead”, but no real consensus on what the eventual impact emergent features like ChatGPT will be. A speaker who stood out to me as forecasting the strongest impacts from AI was Wil Reynolds. You can dive into Wil’s resource at SEER interactive for what he termed “The Great SEO Reset,” but my top takeaway from a local perspective is that you need to figure out what your coverage is in a generative search. I’ve been saying the same here to local SEOs in my Moz column, but part of Wil’s workflow for arriving at a % of your coverage in generative AI struck me as both novel and practical for small local business owners. Wil recommends using People Also Ask feature of Google to get a sense of the kinds of searches people are doing in settings like ChatGPT and Google’s SGE, because of their more conversational quality: If you’re doing this at a large scale for a big brand, definitely read Wil’s full process, but if you’re doing this for a local SMB, simply take these questions, enter them into something like ChatGPT or SGE, and see how often you’re showing up for questions that relate to your business. Why is this a good idea? My fellow Mozzer, Tom Capper, pointed out that both the most common SERP features and SGE features are, in fact, local results. Tom took the pragmatic view that well-written content that requires a human element will be safe from too much AI disruption. That’s good news, but I also strongly resonated with Dr. Peter J. Meyer’s point, that factual queries, like “restaurant near me,” are not ideally fitted to generative search, because he sees this dynamic: Dr. Pete envisions search vs. AI chat as the difference between a factual space and a fluid one, with search providing good quick answers and chat being a more imaginative space that may be akin to letting your mind wander rather than sticking to facts. In my experience, local search intent tends to be pretty factual; ‘tacos near me’, ‘museum downtown’ and “eye doctor San Diego” need a quick, straight answer, not a wander down the primrose path. Google could have a sizeable problem here if local is SGE’s most common feature, but SGE is not strictly factual. I want to reiterate here that Tom’s research found that local results are also the most common ‘traditional’ SERP feature as well, and there isn’t a local SEO worth their salt who isn’t totally aware of the historic problem of local packs containing false information. But of all the possibilities I heard at MozCon 2023 on the topic of AI, this one from Andi Jarvis of Eximo Marketing shone out to me as having the most important message for local businesses and local SEOs: “How you talk to your customers is your competitive advantage.” In Andi’s brilliant talk on how much never changes throughout the history of marketing, he emphasized the mistake large brands are making if they are choosing the promised efficiencies of AI over great human employees, who are able to build relationships with real human customers. I’ll join Andi in urging local brands to devote themselves to really talking to customers, all the time, and to tailoring their marketing to make connections around real human needs. In fact, I’ll go on the record here by predicting that any brand that prioritizes its employees and customers over the ‘next big thing’ in tech is going to start feeling the competitive advantage they’ve won more and more over the next few years. Are you making the most of your local marketing opportunities yet? On-page video SEO Now let’s get into some really grounded tips for setting your business apart in a competitive local market. I think my applause is still echoing somewhere around Seattle for Crystal Carter from Wix and her approachable presentation about on-page video SEO. People are watching an average of 84 minutes of video per day, and 9 in 10 customers want videos from brands. To utilize video efficiently, consider applying these facts and tips in your local business marketing: Even if Instagram, TikTok, Facebook, or some other platform is your favorite, you should be uploading your videos to YouTube. YouTube is auto-set to meet Google’s quality standards, and unlike text content, Google can index YouTube videos and display them live in the SERPs within 2 hours of uploading! If that’s not enough to convince you, re-read Joy Hawkins’ study of what happened to a client’s traffic when they switched away from YouTube to another platform. Yikes!Google has gone all-in on video. They not only include video from multiple sources in the SERPs, but they will often feature the same video from the same source multiple times for a single query.Link from YouTube to your website.Put your videos above the fold on your web pages.Write a transcript for every video and treat this as you would any other piece of content, with a clear set of keywords you’re focusing on.Avoid going on off-topic tangents in your videos, or Google can become confused about the intents your video should be matched to.Do everything you can to engage your audience. Win those comments! But do have on-site comment moderation in place to weed out spam. TikTok SEO I’m with Erin Simmons on this - I will need to wait for the MozCon 2023 video bundle to drop (pre-order here!) to understand everything the brilliant Carrie Rose of Rise at Seven said. But while we’re talking about video SEO, I’m reminded of how the youngest folks in my own family have really embraced TikTok, and if 2023 is the year you're wading in, use these 3 quick tips from Carrie in creating TikTok videos for your local business: Include your focus keywords in the text on your video within the first 5 seconds.Also, include these keywords in the caption.Limit your hashtags to six at the most to avoid confusing TikTok’s algorithm. Local Landing Pages Meanwhile, my ears pricked up when Lily Ray warned that one of the top 3 reasons you might be negatively impacted by a Google core update is if you are publishing low quality local landing pages at scale. The above video still captures a client Lily saw take a nose-dive as a result of publishing thousands of local landing pages to cover the map, and she cautioned that it can take months to recover from an event like this, often until the next core update for Google to notice that you’ve mended your ways. The message is clear for large multi-location brands or any brand that is trying to appear bigger than they are: don’t waste your time or money publishing sub-par local landing pages. It could put your brand at risk. If you’re looking for a sensible answer and approach to the local search marketing FAQ, “How do I rank beyond my location”, I recommend reading: I Want to Rank Beyond My Location: A Guide to How This Works. Brand Building Miracle Inameti-Archibong had two local-worthy brand-building tips I’m eager to share: Find your brand’s personality and emphasize it at the outset at the top of your funnel; look at the difference, above, between what these two businesses have become known for. Grow authority and trust through reviews, social media, and website usability. Customers first, always! Finally, I’ll peregrinate back to Andi Jarvis’ talk for another practical tip for the publication of content that matters to real people: put your benefits first in what you write. In this screenshot, you can see some specs on a vacuum cleaner, and on the far left, how to turn that into content that speaks to customers’ needs. I’m paraphrasing, but Andi reminded us that, “Customers don’t want a quarter inch drill; they want a quarter inch hole.” Local businesses should write product and service descriptions from this perspective Summing Up Apart from catching all the local tips I could over the course of two info-packed days, my personal goal for attending MozCon this year was to listen to a ton of smart people sharing their views on the impact of AI on search and society. These are my top takeaways tied to my goal: There is a really obvious divide in the large SEO industry over what has already happened with AI and what will happen in the near future. Everyone is doing their best right now to figure this out and find their place in a dynamic scenario. One prediction I listened attentively to and have heard elsewhere is that AI will do to “white collar” workers what real-world automation did to “blue collar workers.” The striking image was conjured of how small farmers have been replaced by the self-running machines of factory farms and mono-agriculture. This food production scenario is seen as a great gain by those who own the technology and for that technology’s stakeholders, but as a massive loss to people and the planet. MozCon 2023’s speakers represented both ends of this spectrum in relationship to AI, both encouraging attendees to become the owners and stakeholders to stay relevant, and warning of loss of jobs, human connection, and the general quality of the thing we call ‘Search.’ I highly, highly recommend investing in the video bundle so that you can listen to each talk yourself and find where you stand on this issue. Particularly if you work at a local SEO agency, this is a set of educational talks at the highest possible level. It could set your course for the next 5 years. Study the viewpoints, facts, hype, pitfalls, potentials, tactics, warnings, surprises, and delights for yourself to map out your own plan for the future. If you can’t wait, learn more about this year’s talks in the day one and day two recaps. I want to close by saying that there has never been a more interesting time in search, and every exceptional speaker in the MozCon2023 lineup opened doors and windows to possibilities that I will be thinking about until next year. I hope you’ll act on today’s local takeaways for the local businesses you’re marketing and see success from them. Keep making those connections with your customers - at the end of the day and whatever your approach, they matter the most to your business and your community. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Top Local SEO Takeaways from MozCon 2023"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Top Local SEO Takeaways from MozCon 2023"
    },
    {
      "level": "H2",
      "text": "Are you categorizing your links yet?"
    },
    {
      "level": "H2",
      "text": "Are you making up your mind about AI yet?"
    },
    {
      "level": "H2",
      "text": "Are you making the most of your local marketing opportunities yet?"
    },
    {
      "level": "H3",
      "text": "On-page video SEO"
    },
    {
      "level": "H3",
      "text": "TikTok SEO"
    },
    {
      "level": "H3",
      "text": "Local Landing Pages"
    },
    {
      "level": "H3",
      "text": "Brand Building"
    },
    {
      "level": "H3",
      "text": "Customers first, always!"
    },
    {
      "level": "H2",
      "text": "Summing Up"
    },
    {
      "level": "H2",
      "text": "Register for MozCon 2024!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}