{
  "url": "https://moz.com/blog/mozcon-workshops",
  "slug": "mozcon-workshops",
  "title": "Level Up Your SEO Skills at MozCon Workshops: SEO-Intensive - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Get even more out of your trip to MozCon with our new SEO workshops held the Sunday before the conference! Rand, Dr. Pete, Britney Muller and more Moz experts will dive into the nitty-gritty aspects of SEO to level up your skills and get you ready for the next three days.",
  "content": "Level Up Your SEO Skills at MozCon Workshops: SEO-Intensive SEO Events | Advanced SEO | Moz News By: Danielle Launders June 1, 2017 Table of Contents Copied! By: Danielle Launders June 1, 2017 Level Up Your SEO Skills at MozCon Workshops: SEO-Intensive SEO Events | Advanced SEO | Moz News Can’t get enough of MozCon? Neither can we. Join us a day early for our new half-day working session series and have fun learning, brainstorming, and collaborating with some of the brightest minds at Moz. They’ll cover all of the nitty-gritty aspects of SEO to help those new to the industry have a better understanding of ranking in the SERPs. Those who are more experienced will get some hands-on time with Moz’s SEO experts to fine-tune their skills and take home some actionable tips and action plans. I’m in! Save my spot! The details Exclusive to MozCon attendees, these additional workshops are interactive 75-minute working sessions designed to have attendees leave with outlines, strategies, and action plans to start implementing right away. You’ll be able to customize your workshop agenda by choosing 3 out of the 5 available workshops to attend in the order of your choice. Read through the workshop descriptions below so you can plan your perfect day when you register. MozCon Workshops: SEO-Intensive Schedule Sunday, July 16$400 12:30–1:00pm | Registration1:00–2:15pm | First Workshop2:15–2:25pm | Break2:25–3:40pm | Second Workshop3:40–3:50pm | Break3:50–5:05pm | Third Workshop The workshops The 10 Jobs of SEO-focused Content Rand Fishkin, Wizard of Moz Content creation, optimization, and amplification are powerful levers for SEO, but with more companies than ever investing in the practice, you'll need a competitive edge to get value. More than how to rank content, Rand shows how to make the right content for the right platforms, get it in front of the right people, and earn value from that visibility. Keyword Targeting for RankBrain and Beyond Dr. Pete Meyers, Marketing Scientist The days of one keyword, one page are gone. Thanks in part to machine learning, Google can interpret keyword concepts, understand intent, answer questions, and even guess questions you didn't ask. Dr. Pete guides you through a future-proof approach to keyword research, keyword targeting, and content structure and help you understand where to put your effort. Make the Most of Moz Pro: Insider Tips & Tricks Brian Childs, Training Program Manager Want to save time doing SEO analysis? Learn shortcuts and lesser-known features in Moz Pro from our Training Program Manager, Brian Childs. Unlock the full power of Moz Pro as Brian shows you easy ways to develop reports, analyze competitors, and find link building opportunities. Risk-Averse Link Building at Scale Russ Jones, Principal Search Scientist Nearly all link building strategies tend to either fall afoul of Google's guidelines or fail to deliver effective, sustainable results. Learn a practical strategy for scaling link acquisition efforts comfortably within Google's guidelines, detailing the strategies, tools, and tactics to amplify link growth. Participants will walk away with a sound foundation for executing white hat link building campaigns safely and effectively. Technical KPI-driven SEO Audits Britney Muller, SEO & Content Architect Learn how to deliver technical SEO audits that are rooted in a website’s specific goals. What sections of the site convert the most visitors and need close attention to detail? What technical site fixes would provide the most opportunity? Sign me up! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Level Up Your SEO Skills at MozCon Workshops: SEO-Intensive"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Level Up Your SEO Skills at MozCon Workshops: SEO-Intensive"
    },
    {
      "level": "H2",
      "text": "The details"
    },
    {
      "level": "H3",
      "text": "MozCon Workshops: SEO-Intensive Schedule"
    },
    {
      "level": "H2",
      "text": "The workshops"
    },
    {
      "level": "H3",
      "text": "The 10 Jobs of SEO-focused Content"
    },
    {
      "level": "H3",
      "text": "Keyword Targeting for RankBrain and Beyond"
    },
    {
      "level": "H3",
      "text": "Make the Most of Moz Pro: Insider Tips & Tricks"
    },
    {
      "level": "H3",
      "text": "Risk-Averse Link Building at Scale"
    },
    {
      "level": "H3",
      "text": "Technical KPI-driven SEO Audits"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Danielle Launders\n          \n            Danielle Launders\n          \n            Danielle Launders"
}