{
  "url": "https://moz.com/blog/mozcon-2018-final-agenda",
  "slug": "mozcon-2018-final-agenda",
  "title": "The MozCon 2018 Final Agenda - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We're thrilled to announce our final agenda for MozCon 2018! You'll find descriptions of all our talks, including this year's six community speakers.",
  "content": "The MozCon 2018 Final Agenda Moz News | SEO Events By: Trevor Klein May 23, 2018 Table of Contents Copied! By: Trevor Klein May 23, 2018 The MozCon 2018 Final Agenda Moz News | SEO Events MozCon 2018 is just around the corner — just over six weeks away, on July 9-11 in Seattle — and we're excited to share the final agenda with you today. There are some familiar faces, and some who'll be on the MozCon stage for the first time, with topics ranging from the evolution of searcher intent to the increasing importance of local SEO, and from navigating bureaucracy for buy-in to cutting the noise out of your reporting. We're also thrilled to announce this year's winning pitches for our six MozCon Community Speaker slots! If you're not familiar, each year we hold several shorter speaking slots, asking you all to submit your best pitches for what you'd like to teach everyone at MozCon. The winners — all members of the Moz Community — are invited to the conference alongside all our other speakers, and are always some of the most impressive folks on the stage. Check out the details of their talks below, and congratulations to this year's roster! Still need your tickets? We've got you covered, but act fast — they're over 70% sold! Pick up your ticket to MozCon! The Agenda Monday, July 9 8:30–9:30 am Breakfast and registration Doors to the conference will open at 8:00 for those looking to avoid registration lines and grab a cup of coffee (or two) before breakfast, which will be available starting at 8:30. 9:30–9:45 am Welcome to MozCon 2018!Sarah Bird Moz CEO Sarah Bird will kick things off by sharing everything you need to know about your time at MozCon 2018, including conference logistics and evening events. She'll also set the tone for the show with an update on the state of the SEO industry, illustrating the fact that there's more opportunity in it now than there's ever been before. 9:50–10:20 am The Democratization of SEOJono Alderson How much time and money we collectively burn by fixing the same kinds of basic, \"binary,\" well-defined things over and over again (e.g., meta tags, 404s, URLs, etc), when we could be teaching others throughout our organizations not to break them in the first place? As long as we \"own\" technical SEO, there's no reason (for example) for the average developer to learn it or care — so they keep making the same mistakes. We proclaim that others are doing things wrong, but by doing so we only reinforce the line between our skills and theirs. We need to start giving away bits of the SEO discipline, and technical SEO is probably the easiest thing for us to stop owning. We need more democratization, education, collaboration, and investment in open source projects so we can fix things once, rather than a million times. 10:20–10:50 am Mobile-First Indexing or a Whole New GoogleCindy Krum The emergence of voice-search and Google Assistant is forcing Google to change its model in search, to favor their own entity understanding or the world, so that questions and queries can be answered in context. Many marketers are struggling to understand how their website and their job as an SEO or SEM will change, as searches focus more on entity-understanding, context and action-oriented interaction. This shift can either provide massive opportunities, or create massive threats to your company and your job — the main determining factor is how you choose to prepare for the change. 10:50–11:20 am AM Break 11:30–11:50 am It Takes a Village: 2x Your Paid Search Revenue by Smashing SilosCommunity speaker: Amy Hebdon Your company's unfair advantage to skyrocketing paid search revenue is within your reach, but it's likely outside the control of your paid search team. Good keywords and ads are just a few cogs in the conversion machine. The truth is, the success of the entire channel depends on people who don't touch the campaigns, and may not even know how paid search works. We'll look at how design, analysis, UX, PM and other marketing roles can directly impact paid search performance, including the most common issues that arise, and how to immediately fix them to improve ROI and revenue growth. 11:50 am–12:10 pm The #1 and Only Reason Your SEO Clients Keep Firing YouCommunity speaker: Meredith OliverYou have a kick-ass keyword strategy. Seriously, it could launch a NASA rocket; it's that good. You have the best 1099 local and international talent on your SEO team that working from home and an unlimited amount of free beard wax can buy. You have a super-cool animal inspired company name like Sloth or Chinchilla that no one understands, but the logo is AMAZING. You have all of this, yet, your client turnover rate is higher than Snoop Dogg's audience on an HBO comedy special. Why? You don't talk to your clients. As in really communicate, teach them what you know, help them get it, really get it, talk to them. How do I know? I was you. In my agency's first five years we churned and burned through clients faster than Kim Kardashian could take selfies. My mastermind group suggested we *proactively* set up and insist upon a monthly review meeting with every single client. It was a game-changer, and we immediately adopted the practice. Ten years later we have a 90% client retention rate and more than 30 SEO clients on retainer. 12:10–12:30 pm Why \"Blog\" Is a Misnomer for Our 2018 Content StrategyCommunity speaker: Taylor Coil At the end of 2017, we totally redesigned our company's blog. Why? Because it's not really a blog anymore - it's an evergreen collection of traffic and revenue-generating resources. The former design catered to a time-oriented strategy surfacing consistently new posts with short half-lives. That made sense when we started our blog in 2014. Today? Not so much. In her talk, Taylor will detail how to make the perspective shift from \"blog\" to \"collection of resources,\" why that shift is relevant in 2018's content landscape, and what changes you can make to your blog's homepage, nav, and taxonomy that reflect this new perspective. 12:30–2:00 pm Lunch 2:05–2:35 pm Near Me or Far: How Google May Be Deciding Your Local Intent For YouRob Bucci In August 2017, Google stated that local searches without the \"near me\" modifier had grown by 150% and that searchers were beginning to drop geo-modifiers — like zip code and neighborhood — from local queries altogether. But does Google still know what searchers are after? For example: the query [best breakfast places] suggests that quality takes top priority; [breakfast places near me] indicates that close proximity is essential; and [breakfast places in Seattle] seems to cast a city-wide net; while [breakfast places] is largely ambiguous. By comparing non-geo-modified keywords against those modified with the prepositional phrases \"near me\" and \"in [city name]\" and qualifiers like \"best,\" we hope to understand how Google interprets different levels of local intent and uncover patterns in the types of SERPs produced. With a better understanding of how local SERPs behave, SEOs can refine keyword lists, tailor content, and build targeted campaigns accordingly. 2:35–3:05 pm None of Us Is as Smart as All of UsLisa Myers Success in SEO, or in any discipline, is frequently reliant on people's ability to work together. Lisa Myers started Verve Search in 2009, and from the very beginning was convinced of the importance of building a diverse team, then developing and empowering them to find their own solutions. In this session she'll share her experiences and offer actionable advice on how to attract, develop, and retain the right people in order to build a truly world-class team. 3:05–3:35 pm PM Break 3:45–4:15 pm Search-Driven Content StrategyStephanie BriggsGoogle's improvements in understanding language and search intent have changed how and why content ranks. As a result, many SEOs are chasing rankings that Google has already decided are hopeless. Stephanie will cover how this should impact the way you write and optimize content for search, and will help you identify the right content opportunities. She'll teach you how to persuade organizations to invest in content, and will share examples of strategies and tactics she has used to grow content programs by millions of visits. 4:15–4:55 pm Ranking Is a Promise: Can You Deliver?Dr. Pete Meyers In our rush to rank, we put ourselves first, neglecting what searchers (and our future customers) want. Google wants to reward sites that deliver on searcher intent, and SERP features are a window into that intent. Find out how to map keywords to intent, understand how intent informs the buyer funnel, and deliver on the promise of ranking to drive results that attract clicks and customers. 7:00–10:00 pm Kickoff Party Networking the Mozzy way! Join us for an evening of fun on the first night of the conference (stay tuned for all the details!). Tuesday, July 10 8:30–9:30 am Breakfast 9:35–10:15 am Content Marketing Is Broken and Only Your M.O.M. Can Save YouOli Gardner Traditional content marketing focuses on educational value at the expense of product value, which is a broken and outdated way of thinking. We all need to sell a product, and our visitors all need a product to improve their lives, but we're so afraid of being seen as salesy that somehow we got lost, and we forgot why our content even exists. We need our M.O.M.s! No, not your actual mother. Your Marketing Optimization Map — your guide to exploring the nuances of optimized content marketing through a product-focused lens. In this session you'll learn data and lessons from Oli's biggest ever content marketing experiment, and how those lessons have changed his approach to content; a context-to-content-to-conversion strategy for big content that converts; advanced methods for creating \"choose your own adventure\" navigational experiences to build event-based behavioral profiles of your visitors (using GTM and GA); and innovative ways to productize and market the technology you already have, with use cases your customers had never considered. 10:15–10:45 am Lies, Damned Lies, and AnalyticsRuss Jones Search engine optimization is a numbers game. We want some numbers to go up (links, rankings, traffic, and revenue), others to go down (bounce rate, load time, and budget). Underlying all these numbers are assumptions that can mislead, deceive, or downright ruin your campaigns. Russ will help uncover the hidden biases, distortions, and fabrications that underlie many of the metrics we have come to trust implicitly and from the ashes show you how to build metrics that make a difference. 10:45–11:15 am AM Break 11:25–11:55 am The Awkward State of LocalMike Ramsey You know it exists. You know what a citation is, and have a sense for the importance of accurate listings. But with personalization and localization playing an increasing role in every SERP, local can no longer be seen in its own silo — every search and social marketer should be honing their understanding. For that matter, it's also time for local search marketers to broaden the scope of their work. 11:55 am–12:25 pm The SEO Cyborg: Connecting Search Technology and Its UsersAlexis Sanders SEO requires a delicate balance of working for the humans you're hoping to reach, and the machines that'll help you reach them. To make a difference in today's SERPs, you need to understand the engines, site configurations, and even some machine learning, in addition to the emotional, raw, authentic connections with people and their experiences. In this talk, Alexis will help marketers of all stripes walk that line. 12:25–1:55 pm Lunch 2:00–2:30 pm Email Unto Others: The Golden Rules for Human-Centric Email MarketingJustine JordanWith the arrival of GDPR and the ease with which consumers can unsubscribe and report spam, it's more important than ever to treat people like people instead of just leads. To understand how email marketing is changing and to identify opportunities for brands, Litmus surveyed more than 3,000 marketers worldwide. Justine will cover the biggest trends and challenges facing email today and help you put the human back in marketing’s most personal — and effective — marketing channel. 2:30–3:00 pm Your Red-Tape Toolkit:How to Win Trust and Get Approval for Search WorkHeather Physioc Are your search recommendations overlooked and misunderstood? Do you feel like you hit roadblocks at every turn? Are you worried that people don't understand the value of your work? Learn how to navigate corporate bureaucracy and cut through red tape to help clients and colleagues understand your search work — and actually get it implemented. From diagnosing client maturity to communicating where search fits into the big picture, these tools will equip you to overcome obstacles to doing your best work. 3:00–3:30 pm PM Break 3:40–4:10 pm The Problem with Content & Other Things We Don't Want to AdmitCasie Gillette Everyone thinks they need content but they don't think about why they need it or what they actually need to create. As a result, we are overwhelmed with poor quality content and marketers are struggling to prove the value. In this session, we'll look at some of the key challenges facing marketers and how a data-driven strategy can help us make better decisions. 4:10–4:50 pm Excel Is for Rookies:Why Every Search Marketer Needs to Get Strong in BI, ASAPWil Reynolds The analysts are coming for your job, not AI (at least not yet). Analysts stopped using Excel years ago; they use Tableau, Power BI, Looker! They see more data than you, and that is what is going to make them a threat to your job. They might not know search, but they know data. I'll document my obsession with Power BI and the insights I can glean in seconds which is helping every single client at Seer at the speed of light. Search marketers must run to this opportunity, as analysts miss out on the insights because more often than not they use these tools to report. We use them to find insights. Wednesday, July 11 8:30–9:30 am Breakfast 9:35–10:15 am Machine Learning for SEOsBritney Muller People generally react to machine learning in one of two ways: either with a combination of fascination and terror brought on by the possibilities that lie ahead, or with looks of utter confusion and slight embarrassment at not really knowing much about it. With the advent of RankBrain, not even higher-ups at Google can tell us exactly how some things rank above others, and the impact of machine learning on SEO is only going to increase from here. Fear not: Moz's own senior SEO scientist, Britney Muller, will talk you through what you need to know. 10:15–10:45 am Convert Local Searchers Into Customers With ReviewsDarren Shaw Clicks from local search results to business websites are on the decline. For local businesses, it's no longer enough to rank. Your presence in the SERPs has to stand out in order to attract new customers. So how do you set your business apart from the competition? Reviews! Reviews can help your rankings, but more importantly, positive reviews drive more leads and conversions. In this talk, Darren will teach you the latest strategies and tactics to level-up your review game on Google and other important sites, so that consumers will choose your business over the competition. 10:45–11:15 am AM Break 11:25–11:45 am Location-Free Local SEOCommunity speaker: Tom Capper Let's talk about local SEO without physical premises. Not the Google My Business kind — the kind of local SEO that job boards, house listing sites, and national delivery services have to reckon with. Should they have landing pages, for example, for \"flower delivery in London?\" This turns out to be a surprisingly nuanced issue: In some industries, businesses are ranking for local terms without a location-specific page, and in others local pages are absolutely essential. I've worked with clients across several industries on why these sorts of problems exist, and how to tackle them. How should you figure out whether you need these pages, how can you scale them and incorporate them in your site architecture, and how many should you have for what location types? 11:45 am–12:05 pm SEO without Traffic:Community speaker: Hannah Thorpe Answer boxes, voice search, and a reduction in the number of results displayed sometimes all result in users spending more time in the SERPs and less on our websites. But does that mean we should stop investing in SEO? This talk will cover what metrics we should now care about, and how strategies need to change, covering everything from measuring more than just traffic and rankings to expanding your keyword research beyond just keyword volumes. 12:05–12:25 pm Tools Change, People Don't: Empathy-Driven Online MarketingCommunity speaker: Ashley Greene When everyone else zags, the winners zig. As winners, while your 101+ competitors are trying to automate 'til the cows come home and split test their way to greatness‚ you're zigging. Whether you're B2B or B2C, you're marketing to humans. Real people. Homo sapiens. But where is the human element in the game plan? Quite simply, it has gone missing, which provides a window of opportunity for the smartest marketers. In this talk, Ashley will provide a framework of simple user interview and survey techniques to build customer empathy and your \"voice of customer\" playbook. Using real examples from companies like Slack, Pinterest, Intercom, and Airbnb, this talk will help you uncover your customers' biggest problems and pain points; know what, when, and how your customers research (and Google!) a need you solve; and find new sources of information and influencers so you can unearth distribution channels and partnerships. 12:25–1:55 pm Lunch 2:00–2:30 pm You Don't Know SEOMichael KingOr maybe, \"SEO you don't know you don't know.\" We've all heard people throw jargon around in an effort to sound smart when they clearly don't know what it means, and our industry of SEO is no exception. There are aspects of search that are acknowledged as important, but seldom actually understood. Michael will save us from awkward moments, taking complex topics like the esoteric components of information retrieval and log-file analysis, pairing them with a detailed understanding of technical implementation of common SEO recommendations, and transforming them into tools and insights we wish we'd never neglected. 2:30–3:00 pm What All Marketers Can Do about Site SpeedEmily GrossmanAt this point, we should all have some idea of how important site speed is to our performance in search. The recently announced \"speed update\" underscored that fact yet again. It isn't always easy for marketers to know where to start improving their site's speed, though, and a lot of folks mistakenly believe that site speed should only be a developer's problem. Emily will clear that up with an actionable tour of just how much impact our own work can have on getting our sites to load quickly enough for today's standards. 3:00–3:30 pm PM Break 3:40–4:10 pm Focused Reporting: Fewer Reports that Do MoreDana DiTomaso With an ever-increasing slate of options in tools like Google Tag Manager and Google Data Studio, marketers of all stripes are falling prey to the habit of \"I'll collect this data because maybe I'll need it eventually,\" when in reality it's creating a lot of noise for zero signal. We're still approaching our metrics from the organization's perspective, and not from the customer's perspective. Why, for example, are we not reporting on (or even thinking about, really) how quickly a customer can do what they need to do? Why are we still fixated on pageviews? In this talk, Dana will focus our attention on what really matters. 4:10–4:50 pm Why Nine out of Ten Marketing Launches Suck(And How to Be the One that Doesn't)Rand Fishkin More than ever before, marketers are launching things — content, tools, resources, products — and being held responsible for how/whether they resonate with customers and earn the amplification required to perform. But this is hard. Really, really hard. Most of the projects that launch, fail. What separates the wheat from the chaff isn't just the quality of what's built, but the process behind it. In this presentation, Rand will present examples of dismal failures and skyrocketing successes, and dive into what separates the two. You'll learn how anyone can make a launch perform better, and benefit from the power of being \"new.\" 7:00–11:30 pm MozCon Bash Join us at Garage Billiards to wrap up the conference with an evening of networking, billiards, bowling, and karaoke with MozCon friends new and old. Don't forget to bring your MozCon badge and US ID or passport. Grab your ticket today! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The MozCon 2018 Final Agenda"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The MozCon 2018 Final Agenda"
    },
    {
      "level": "H2",
      "text": "The Agenda"
    },
    {
      "level": "H3",
      "text": "Monday, July 9"
    },
    {
      "level": "H4",
      "text": "8:30–9:30 am"
    },
    {
      "level": "H4",
      "text": "Breakfast and registration"
    },
    {
      "level": "H4",
      "text": "9:30–9:45 am"
    },
    {
      "level": "H4",
      "text": "Welcome to MozCon 2018!Sarah Bird"
    },
    {
      "level": "H4",
      "text": "9:50–10:20 am"
    },
    {
      "level": "H4",
      "text": "The Democratization of SEOJono Alderson"
    },
    {
      "level": "H4",
      "text": "10:20–10:50 am"
    },
    {
      "level": "H4",
      "text": "Mobile-First Indexing or a Whole New GoogleCindy Krum"
    },
    {
      "level": "H4",
      "text": "10:50–11:20 am"
    },
    {
      "level": "H4",
      "text": "AM Break"
    },
    {
      "level": "H4",
      "text": "11:30–11:50 am"
    },
    {
      "level": "H4",
      "text": "It Takes a Village: 2x Your Paid Search Revenue by Smashing SilosCommunity speaker: Amy Hebdon"
    },
    {
      "level": "H4",
      "text": "11:50 am–12:10 pm"
    },
    {
      "level": "H4",
      "text": "The #1 and Only Reason Your SEO Clients Keep Firing YouCommunity speaker: Meredith Oliver"
    },
    {
      "level": "H4",
      "text": "12:10–12:30 pm"
    },
    {
      "level": "H4",
      "text": "Why \"Blog\" Is a Misnomer for Our 2018 Content StrategyCommunity speaker: Taylor Coil"
    },
    {
      "level": "H4",
      "text": "12:30–2:00 pm"
    },
    {
      "level": "H4",
      "text": "Lunch"
    },
    {
      "level": "H4",
      "text": "2:05–2:35 pm"
    },
    {
      "level": "H4",
      "text": "Near Me or Far: How Google May Be Deciding Your Local Intent For YouRob Bucci"
    },
    {
      "level": "H4",
      "text": "2:35–3:05 pm"
    },
    {
      "level": "H4",
      "text": "None of Us Is as Smart as All of UsLisa Myers"
    },
    {
      "level": "H4",
      "text": "3:05–3:35 pm"
    },
    {
      "level": "H4",
      "text": "PM Break"
    },
    {
      "level": "H4",
      "text": "3:45–4:15 pm"
    },
    {
      "level": "H4",
      "text": "Search-Driven Content StrategyStephanie Briggs"
    },
    {
      "level": "H4",
      "text": "4:15–4:55 pm"
    },
    {
      "level": "H4",
      "text": "Ranking Is a Promise: Can You Deliver?Dr. Pete Meyers"
    },
    {
      "level": "H4",
      "text": "7:00–10:00 pm"
    },
    {
      "level": "H4",
      "text": "Kickoff Party"
    },
    {
      "level": "H3",
      "text": "Tuesday, July 10"
    },
    {
      "level": "H4",
      "text": "8:30–9:30 am"
    },
    {
      "level": "H4",
      "text": "Breakfast"
    },
    {
      "level": "H4",
      "text": "9:35–10:15 am"
    },
    {
      "level": "H4",
      "text": "Content Marketing Is Broken and Only Your M.O.M. Can Save YouOli Gardner"
    },
    {
      "level": "H4",
      "text": "10:15–10:45 am"
    },
    {
      "level": "H4",
      "text": "Lies, Damned Lies, and AnalyticsRuss Jones"
    },
    {
      "level": "H4",
      "text": "10:45–11:15 am"
    },
    {
      "level": "H4",
      "text": "AM Break"
    },
    {
      "level": "H4",
      "text": "11:25–11:55 am"
    },
    {
      "level": "H4",
      "text": "The Awkward State of LocalMike Ramsey"
    },
    {
      "level": "H4",
      "text": "11:55 am–12:25 pm"
    },
    {
      "level": "H4",
      "text": "The SEO Cyborg: Connecting Search Technology and Its UsersAlexis Sanders"
    },
    {
      "level": "H4",
      "text": "12:25–1:55 pm"
    },
    {
      "level": "H4",
      "text": "Lunch"
    },
    {
      "level": "H4",
      "text": "2:00–2:30 pm"
    },
    {
      "level": "H4",
      "text": "Email Unto Others: The Golden Rules for Human-Centric Email MarketingJustine Jordan"
    },
    {
      "level": "H4",
      "text": "2:30–3:00 pm"
    },
    {
      "level": "H4",
      "text": "Your Red-Tape Toolkit:How to Win Trust and Get Approval for Search WorkHeather Physioc"
    },
    {
      "level": "H4",
      "text": "3:00–3:30 pm"
    },
    {
      "level": "H4",
      "text": "PM Break"
    },
    {
      "level": "H4",
      "text": "3:40–4:10 pm"
    },
    {
      "level": "H4",
      "text": "The Problem with Content & Other Things We Don't Want to AdmitCasie Gillette"
    },
    {
      "level": "H4",
      "text": "4:10–4:50 pm"
    },
    {
      "level": "H4",
      "text": "Excel Is for Rookies:Why Every Search Marketer Needs to Get Strong in BI, ASAPWil Reynolds"
    },
    {
      "level": "H3",
      "text": "Wednesday, July 11"
    },
    {
      "level": "H4",
      "text": "8:30–9:30 am"
    },
    {
      "level": "H4",
      "text": "Breakfast"
    },
    {
      "level": "H4",
      "text": "9:35–10:15 am"
    },
    {
      "level": "H4",
      "text": "Machine Learning for SEOsBritney Muller"
    },
    {
      "level": "H4",
      "text": "10:15–10:45 am"
    },
    {
      "level": "H4",
      "text": "Convert Local Searchers Into Customers With ReviewsDarren Shaw"
    },
    {
      "level": "H4",
      "text": "10:45–11:15 am"
    },
    {
      "level": "H4",
      "text": "AM Break"
    },
    {
      "level": "H4",
      "text": "11:25–11:45 am"
    },
    {
      "level": "H4",
      "text": "Location-Free Local SEOCommunity speaker: Tom Capper"
    },
    {
      "level": "H4",
      "text": "11:45 am–12:05 pm"
    },
    {
      "level": "H4",
      "text": "SEO without Traffic:Community speaker: Hannah Thorpe"
    },
    {
      "level": "H4",
      "text": "12:05–12:25 pm"
    },
    {
      "level": "H4",
      "text": "Tools Change, People Don't: Empathy-Driven Online MarketingCommunity speaker: Ashley Greene"
    },
    {
      "level": "H4",
      "text": "12:25–1:55 pm"
    },
    {
      "level": "H4",
      "text": "Lunch"
    },
    {
      "level": "H4",
      "text": "2:00–2:30 pm"
    },
    {
      "level": "H4",
      "text": "You Don't Know SEOMichael King"
    },
    {
      "level": "H4",
      "text": "2:30–3:00 pm"
    },
    {
      "level": "H4",
      "text": "What All Marketers Can Do about Site SpeedEmily Grossman"
    },
    {
      "level": "H4",
      "text": "3:00–3:30 pm"
    },
    {
      "level": "H4",
      "text": "PM Break"
    },
    {
      "level": "H4",
      "text": "3:40–4:10 pm"
    },
    {
      "level": "H4",
      "text": "Focused Reporting: Fewer Reports that Do MoreDana DiTomaso"
    },
    {
      "level": "H4",
      "text": "4:10–4:50 pm"
    },
    {
      "level": "H4",
      "text": "Why Nine out of Ten Marketing Launches Suck(And How to Be the One that Doesn't)Rand Fishkin"
    },
    {
      "level": "H4",
      "text": "7:00–11:30 pm"
    },
    {
      "level": "H4",
      "text": "MozCon Bash"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Trevor Klein\n          \n            Trevor Klein\n          \n            Trevor Klein"
}