{
  "url": "https://moz.com/blog/mozcon-virtual-2021-day-one-recap",
  "slug": "mozcon-virtual-2021-day-one-recap",
  "title": "Come One, Come All! The MozCon Virtual 2021 Day One Recap - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We were super excited to bring MozCon back for another action-packed conference. For those of you who may have missed it, or those of you who had a hard time keeping up with this three ring circus, we’ve got a quick recap!",
  "content": "Come One, Come All! The MozCon Virtual 2021 Day One Recap SEO Events By: Brie E Anderson July 13, 2021 Table of Contents Copied! By: Brie E Anderson July 13, 2021 Come One, Come All! The MozCon Virtual 2021 Day One Recap SEO Events Our favorite time of the year is here! The second ever MozCon Virtual kicked off yesterday with attendees from over 35 countries. There were networking rooms, photo booth pics, and live tweets. It almost felt like we were back together in one place (just minus the donuts). Lack of donuts aside, everyone was super excited to be back at MozCon for another action-packed conference. Day one’s speakers brought their A-game and really got people thinking. Already had several 🤯 moments at #MozCon and it’s only Day 1! Can’t wait for tomorrow. Cheers!— Kavi Kardos (@therarevos) July 12, 2021 For those of you who may have missed it, or those of you who had a hard time keeping up with this three ring circus, here's a quick recap! Sarah Bird — Welcome to MozCon Moz's fearless leader started MozCon Virtual off with a bang! She introduced Moz Group, a result of the merger with J2. Then, she announced two product releases — one in alpha and one in beta! Both will be further explained by Mozzers later in the week. A big announcement during the opening session at #MozCon today: \"The Moz Group\" is now a collection of brands and technologies for digital marketers: pic.twitter.com/F62glc6b89— Rob Ousbey (@RobOusbey) July 12, 2021 Sarah’s introduction concluded with a moving tribute to Russ Jones. You can share your own memories with Russ or donate to his family at RememberingRussJones.com. Shannon McGuirk — Lessons in Surviving the Covid News Agenda & What it Means for the Future of Digital PR As always, Shannon started out strong with some radical transparency. She walked us through Aira’s journey through COVID and how it changed everything. I have so much love for @ShannonMcGuirk_'s raw honesty #MozCon 💙 pic.twitter.com/lxo08YJS4K— Areej AbuAli (@areej_abuali) July 12, 2021 In past MozCon presentations, Shannon has shown us the outreach strategies that Aira has depended on for several years, but 2020 threw everyone for a loop. In the first two weeks of lockdown, Aira lost 50% of their revenue. Something had to change. Actually, everything had to change. We got insight into Aira’s three-prong, PR future-proofing system that developed as a result: Ideation: using the ROR framework of relevancy, opinion, resolutionProduction: create proven frameworks that can be customized for your clientPromotion: through accessing, communicating, and having perspective Shannon gave us the nitty gritty of how this system works for Aira, complete with actual photos of their best-performing, always-ready frameworks. Honestly, it felt like we were seeing something confidential, but we were here for it. Um, I think @ShannonMcGuirk_ is sharing some *serious* @Ariadigital secrets here...They have templates for production that are wireframed and customizable.They run TONS of campaigns off of THREE main templates.#MozCon pic.twitter.com/6PcZ3lIlee— Brie E Anderson (@brie_e_anderson) July 12, 2021 Flavilla Fongang — The Science of Purchasing Behavior: How to Use it Effectively to Attract & Convert More Prospects Into Customers Flavilla was ready to prescribe some tactical medicine to those looking to increase their conversion rate. She jumped right in with explaining how our brains function. Ya know, limbic system, neocortex, and reptilian brain? Don’t worry, we didn’t either! She broke them down as the emotional brain (limbic), rational (neocortex), and fight or flight (reptilian). Then Flavilla asked the big question: which brain has the most impact on buying decisions? The answer (which shocked most) was the reptilian brain. Flavilla took us through six ways the reptilian brain can be stimulated. Killer slide from @FlavillaFongang #mozcon pic.twitter.com/6N5OC5jlOz— Noah Learner (He/Him) (@noahlearner) July 12, 2021 But it wouldn’t be a MozCon presentation without something that can be put into action today. Flavilla dropped all sorts of tactics to test: putting the CTA closer to the consumer’s picture, using the power of the gaze, tapping into negative emotion, showing contrast (think before and after), and putting the most important information first. We could have listened to Flavilla talk all day long. Hearing her take on buyer behavior was a bit like looking into a glass ball and getting answers to all of our questions. We can’t wait to put it into action! Dr. Pete Meyers — Rule Your Rivals: From Data to Action Always a crowd pleaser, Dr. Pete showed off a new Moz tool currently in Beta: True Competitor. True Competitor is a project Moz has been working on for the last few years, and this year it’s finally ready to take the stage! (You can request early access to True Competitor here.) Dr. Pete used the new tool to remind us that those we assume to be our competitors sometimes aren’t actually our competition at all. Instead of focusing on who we think we’re losing traffic to, we need to be focused on who is preventing us from making money. There's a big difference between who you \"think\" your competition is and who you compete with in the SERPs. #MozCon— Jason Dodge (@dodgejd) July 12, 2021 Using the new True Competitor tool, and a few cool search modifiers, Dr. Pete was able to find some opportunity keywords to test out. The process looked a bit like this: Use True Competitor to identify potential keywordsUse search modifiers to find the ranking pages for the competitionFind Moz’s current ranking contentCreate content using the similar keywordsLink to the most updated and relevant content Get Keywords, competitor pages, and my best piece of content to compete with: @dr_pete #mozcon pic.twitter.com/VFk5beIbvI— Noah Learner (He/Him) (@noahlearner) July 12, 2021 We knew that Dr. Pete would bring the heat, but it’s safe to say he outdid himself this year. Great talk by @dr_pete from the #mozcon. Take aways:Don't make assumptions about your competitorsDo not make a massive novel - come up with a plan including what is missing from your site content issues.Track what works/what doesn't and amend accordingly. @Moz pic.twitter.com/pnUWqeL2vX— J Turnbull (@SEOJoBlogs) July 12, 2021 Noah Learner — Game-Changing Ways to Use the Google Search Console API This first-time MozCon speaker came ready to play! Right away, Noah gave us some perspective on the actual limitations of Google Search Console. As most of us know, Search Console only gives you access to 1,000 rows. Well, Noah knew that there was a lot more data to be seen and started dabbling with the API. Apparently this led to a 15-hour journey down the GSC rabbit hole, as Noah started working on creating a custom Google Search Console tool using Big Query and Google Data Studio. This tool, Explorer for Search, has already gotten some buzz from those in the industry. If you haven't seen Search Explorer from @noahlearner and Two Octobers you're missing out. Native GSC is abysmal in comparison. #MozCon— Taylor Murchison (@TaylorMurchison) July 12, 2021 Honestly, if you look at the Twitter feed for #MozCon, there aren’t a ton of tweets because nobody could keep up with him! Noah moved rapidly through exactly how he built Explorer for Search with his team, and how they’re using it. Loving this striking distance report @noahlearner is showing off #Mozcon pic.twitter.com/VgUa1CeAcC— Jordan Choo (@JordanChoo) July 12, 2021 Almost instantly, Noah and his team found over $300,000 of keywords that weren’t available in Search Console. They did this through building in position sorting, top of funnel/ bottom of funnel sorting, branded vs. non branded filters, and more. We cannot wait to play with this and get started with the Search Console API! Dana DiTomaso — Build for Search: Modern Web Dev That Puts SEO First A long time MozCon favorite, Dana DiTomaso put on her coach’s hat for this year’s session. Far too often, we find ourselves in awkward situations that require us to scrap all of our work and start over again. “Developers [also] come in way too late […] and come in and say, “oh, I can’t do that” […] or “this isn’t going to work on mobile,” and now you have to start the design all over again. @danaditomaso #MozCon— Melina Beeston (@mkbeesto) July 12, 2021 Dana ran into this way too many times, so she and her team came up with a better solution. She was ready to make us, and our web dev processes, agile(ish). She showed us her team's entire process from presenting keyword research (IN A PIE CHART?!), to using GatherContent to create a website blueprint for clients, all the way to wireframe creation and presentation. SEO projects shouldn't be done in silos.SEO, UX, Design, Dev, & Content teams should all be involved early and often(as needed).The Agile project management method is a great framework that makes this easy to do.Insights from @danaditomaso 's talk #mozcon pic.twitter.com/Fl5B8ncSG0— Ọla King (@justolaking) July 12, 2021 At each step, anyone can jump in and see what is going on and add to the conversation or process. It’s far less linear and allows for more collaboration. Jackie Chu — Internationalization Errors: How to Go Global Without Losing All of Your Traffic With a track record like Jackie’s, it’s hard to imagine not blowing minds. Jackie started by explaining one of the most complex SEO concepts: Hreflang. This explanation led to a few tactical suggestions right off of the bat: Define target language and countrySelf-canonicalize all URLsUse consistent URL patterns Honestly, there were so many takeaways from this presentation that they were hard to keep track of. Imagine, all of that information on Hreflang alone was in the first 17 slides… and this presentation was 60 slides long! Great tip by @jackiecchu about using extra signals beyond hreflang to show Google which version of your site is targeted to which international audience, such as linking to that country's respective social profiles, or editing the NAP to reflect that country's info.#mozcon pic.twitter.com/2T24euwRyZ— Lily Ray 😏 (@lilyraynyc) July 12, 2021 You’ll definitely want to revisit this presentation in the video bundle, available Friday, to glean all insights possible! Cyrus Shepard — Mastering 3 Click + Engagement Signals for Higher Rankings/Traffic Cyrus, a long-time MozCon emcee, takes the stage himself this year to discuss how Google may — or may not — use user engagement signals as an input in ranking websites. Cyrus started by explaining how 20 years of Google patents describe three different types of click signals they could measure: first clicks, long clicks, and last clicks. He then walked through a multitude of small-scale SEO experiments that attempted to influence these click signals to see if he could influence rankings. Some of the experiments included: Optimizing Meta Descriptions in non-traditional waysRemoving Title Tag \"Boilerplate\"Improving the visibility of \"Related Articles\"Adding FAQs Don't do it. For the love of God. Don't do it.#MozCon @CyrusShepard pic.twitter.com/hWxCxLlpju— Brie E Anderson (@brie_e_anderson) July 12, 2021 Finally, Cyrus shared some case studies including the migration of the Moz Q&A — which involved over 100,000 URLs — and how they improved user engagement. What a great URL path migration process and conduction from @Moz's SEO team! Moving the Q&A section with some important checklist is something, but also, when it comes to user-generated content, it's hard to change. So @CyrusShepard came with over 16% success after that. #MozCon pic.twitter.com/bIHk8uVHA6— Roman Adamita (@AdamitaRoman) July 12, 2021 At the end, Cyrus emphasized that SEO is not about manipulating numbers, but that \"User satisfaction is ranking factor #1.\" After watching this presentation, you'll definitely walk away with several ideas for engaging your visitor. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Come One, Come All! The MozCon Virtual 2021 Day One Recap"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Come One, Come All! The MozCon Virtual 2021 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Sarah Bird — Welcome to MozCon"
    },
    {
      "level": "H2",
      "text": "Shannon McGuirk — Lessons in Surviving the Covid News Agenda & What it Means for the Future of Digital PR"
    },
    {
      "level": "H2",
      "text": "Flavilla Fongang — The Science of Purchasing Behavior: How to Use it Effectively to Attract & Convert More Prospects Into Customers"
    },
    {
      "level": "H2",
      "text": "Dr. Pete Meyers — Rule Your Rivals: From Data to Action"
    },
    {
      "level": "H2",
      "text": "Noah Learner — Game-Changing Ways to Use the Google Search Console API"
    },
    {
      "level": "H2",
      "text": "Dana DiTomaso — Build for Search: Modern Web Dev That Puts SEO First"
    },
    {
      "level": "H2",
      "text": "Jackie Chu — Internationalization Errors: How to Go Global Without Losing All of Your Traffic"
    },
    {
      "level": "H2",
      "text": "Cyrus Shepard — Mastering 3 Click + Engagement Signals for Higher Rankings/Traffic"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Brie E Anderson\n          \n            Brie E Anderson\n          \n            Brie E Anderson"
}