{
  "url": "https://moz.com/blog/mozinars-they-are-back-and-free",
  "slug": "mozinars-they-are-back-and-free",
  "title": "#Mozinars: They're Back, and They're Free! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Good things come to those who wait, and you've all been waiting patiently for our new Mozinar series. We're happy to announce that our Mozinars are back and better than ever. Best of all, they're now free for everyone!",
  "content": "#Mozinars: They're Back, and They're Free! Moz News By: Erica McGillivray October 31, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Erica McGillivray October 31, 2012 #Mozinars: They're Back, and They're Free! Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. You've been asking and waiting patiently for them. Well, Mozzers, today's your lucky day! Mozinars are back and better than ever. Now you can join us for any upcoming Mozinar or watch previously recorded webinars as we've opened them up to everyone. That's right; they're now free for everyone's viewing pleasure! Think of it as a big hug from us to you. Photo credit Tristan Reville Because we're committed to bringing you interesting and fun online marketing tips, we've booked some amazing voices from our community for the upcoming Mozinars. We hope you'll enjoy them and learn a ton. Take a gander at our full Mozinar line-up with Mozinars booked through March 2013, and even a few more scheduled further out. Or, scroll through these awesome topics and presenters: 11/1/2012 - Rand Fishkin, CEO of SEOmoz, on Big Picture Conversion Rate Optimization 11/6/2012 - Dana DiTomaso, CEO of Kick Point Inc, on You Probably Think This Citation Source Is About You, Don't You? 11/15/2012 - Rick Smith of NoahsDad.Com on Story-Optimization: How to Get More Links, More Traffic, and Change The World By Optimizing Your Brand's Story 11/20/2012 - Rand Fishkin, CEO of SEOmoz, and Nathan Latka, CEO of Lujure, on SEO for the Social Media Mind 11/27/2012 - Zeph Snapp of Not Just SEO on Foreign Language SEO: The New Long Tail 12/6/2012 - Tanner Christensen, Marketing Director at CLEARLINK, on From Nothing to Expert: How to Blog Like You Mean It 12/11/2012 - Justin Taylor, MD of Graphitas, on Designing for SEO: Improving Site Visibility and Enhancing UX 12/18/2012 - Mike Ramsey, Founder/CEO at Nifty Marketing, on Be Where Local is Going 1/10/2013 - Monique Pouget, Director of Content Marketing at Thunder SEO, on Building a Community Without a Big Ass Budget 1/15/2013 - Robi Ganguly, CEO at Apptentive, on Standing Out in the Sea of Apps: Building an Audience of Fans for Your Mobile App's Success 1/31/2013 - Colby Almond, Viral Marketing Ninja at 97th Floor, on Pinteresting Marketing and Content 2/5/2013 - Nick Herinckx, CEO of Obility Consulting, on Advanced WordPress SEO: Actionable Advice for Ensuring Your WordPress Content is Found 2/12/2013 - Aleyda Solis, Director and Co-Founder at Orainti SL, on Good Practices to Maximize Your Mobile SEO 2/19/2013 - Gianluca Fiorelli, Head of SEO at Emagister, on Social Content Curation: Why, How, and What 2/28/2013 - Brian Skarin, Search and Content Development Specialist at Thunder SEO, on A Foolproof Process for Scrubbing Your Local Footprint Squeaky Clean 3/5/2013 - Will Watrous, President at Watrous Media, on Video Updates Help Local Businesses 4/2/2013 - Shawn Massie, Director of Search and Social Media at Thunder SEO, on Using Instagram to Promote Your Brand and Increase Site Traffic 4/16/2013 - Mike Arnesen, Senior SEO Analyst at SwellPath, on Advanced AuthorRank: 25 Tactics for the Individual to the Enterprise Level 4/25/2013 - Jon Quinton, SEO Consultant at SEOgadget, and Daniel Butler, Senior Search Consultant at SEOgadget, on Making Your Site Audits More Actionable 6/25/2013 - Jonathon Colman from REI on Beyond Content Marketing: Jump Into Content Strategy As you can see, we have a ton of Mozinars coming up that focus on a diverse amount of topics. Register today, and we'll see you soon! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "#Mozinars: They're Back, and They're Free!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "#Mozinars: They're Back, and They're Free!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Erica McGillivray\n          \n            Erica McGillivray\n          \n            Erica McGillivray"
}