{
  "url": "https://moz.com/blog/mozscapes-third-may-2013-index-is-now-live",
  "slug": "mozscapes-third-may-2013-index-is-now-live",
  "title": "Mozscape's Third May 2013 Index Is Now Live - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Our third May Mozscape index is now live; that's a whole lot of fresh data for one month! Check out the updates in all of your favorite apps, including Open Site Explorer, the Mozbar, your PRO campaigns, and the Mozscape API.",
  "content": "Mozscape's Third May 2013 Index Is Now Live Moz Tools By: Brad Friedman May 31, 2013 Table of Contents Copied! By: Brad Friedman May 31, 2013 Mozscape's Third May 2013 Index Is Now Live Moz Tools It has been an amazing month at Moz, and for the first time, we have served up three indexes in one month - holy fresh data, Batman! This index is also our second index release from our Virginia data center.As we've become so regular with our index releases, it seems that a blog post announcing each release may not be the best way to inform our customers on releases as they happen. This will be the last index update announced on the blog, but index release readers, have no fear! There's a new, more digestible way to get all of the information about the index updates you know and love.Going forward, we invite you subscribe to the Mozscape RSS feed found on the lower right-hand corner of the https://moz.com/products/api/updates page so that you will know when we have released a new index. Simply click on the RSS feed icon... ...and you'll be directed to our Feedburner Mozscape updates page. This page makes it easy to enter your information to subscribe to our index updates: Just enter your email address, choose your reader, and let the Mozscape index data flow in! As our index releases continue to become more frequent, you can expect the number of updates received through the RSS to mount. We hope you enjoy this new way to consume fresh update info as much as we do.Here are the metrics for this index:85,870,573,626 (86 billion) URLs5,524,096,501 (5.5 billion) Subdomains155,443,706 (155 million) Root Domains902,845,046,889 (903 billion) LinksFollowed vs. Nofollowed2.17 % of all links found were nofollowed57.32 % of nofollowed links are internal42.68 % are externalRel Canonical - 14.44 % of all pages now employ a rel=canonical tagThe average page has 79 links on it 68.36 internal links on average 11.13 external links on averageAnd the correlations with Google's US search results:Page Authority - 0.36Domain Authority - 0.19MozRank - 0.24Linking Root Domains - 0.30Total Links - 0.25External Links - 0.29This histogram shows the crawl date and freshness of results in this index:This index spans 38 days with crawl starting April 1st and finishing on May 8th. We always love to hear your thoughts! And remember, if you're ever curious about when Mozscape next index release is planned, check out https://moz.com/products/api/updates.Thanks for reading, and have a Mozzy weekend! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Mozscape's Third May 2013 Index Is Now Live"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Mozscape's Third May 2013 Index Is Now Live"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "Moz AI: Introducing Augmented Intelligence"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Brad Friedman\n          \n            Brad Friedman"
}