{
  "url": "https://moz.com/blog/mozs-2013-year-in-review",
  "slug": "mozs-2013-year-in-review",
  "title": "Moz's 2013 Year in Review: More Than You Ever Wanted to Know About Moz, and Then Even More - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Learn more than you ever cared to know about Moz's inner workings. It's the 2013 year in review, complete with gigantic infographic! It's a metricstraveganza!",
  "content": "Moz's 2013 Year in Review: More Than You Ever Wanted to Know About Moz, and Then Even More Moz News By: Sarah Bird January 30, 2014 Table of Contents Copied! By: Sarah Bird January 30, 2014 Moz's 2013 Year in Review: More Than You Ever Wanted to Know About Moz, and Then Even More Moz News Time for the 2013 end-of-year wrap-up. You can read Rand's 2012 wrap-up here. The \"T\" in TAGFEE is for \"Transparency,\" so let's get this show started. This is a long post. Here are some convenient links to whatever tickles your fancy: Four Big Investments in 2013 Community & Customers Inside Moz HQ Technical Achievements Looking Forward If long-form blog posts aren't your thing, I invite you to check out our Moz 2013 Year In Review Infographic extravaganza! Four Big Investments 1. The rebrand from SEOmoz to Moz We'd been planning the rebrand from SEOmoz to Moz for about 18 months before we executed. The original plan was to launch the rebrand simultaneously with the release of Moz Analytics. Ah, yes. What a lovely dream! When it became clear that Moz Analytics wasn't going to be ready before May, we decided to decouple the rebrand from the product launch. The rebrand went amazingly well. Better than we anticipated. Most people weren't surprised, which I think is a good thing; we had been seeding the idea of \"Moz\" for a long time. Recently, Search Engine Land released study results indicating that Moz is the second-most recognized marketing technology brand. Happily, 85% of people who listed us correctly used \"Moz\" instead of \"SEOmoz.\" Whoa! We suffered a slight dip in traffic after the switch from seomoz.org to moz.com, but managed to recover quickly. <high five> You can see our traffic stats in the Community and Customers section below. 2. The epic nine-month launch of Moz Analytics We began launching Moz Analytics in May and are only now wrapping up the final phase of launch. Rebuilding the old PRO application from back to front was the biggest and highest-risk endeavor we'd ever undertaken. Including product planning, we worked on it for two+ years, and a team of engineers spent 18+ months building it. The Moz Analytics launch deserves a thoughtful blog post on its own. I tried to capture the complexity, disappointment, and excitement when drafting this post, but it's just not possible. So I'll just say this: Launch diverged dramatically from the plan. Some of it was forgivable naiveté about the complexity of the project, and some of it was just plain old stupid mistakes. All of the factors were valuable lessons. I'm relieved and happy to say that we're wrapping up the \"launch phase\" of Moz Analytics very soon. We've almost solved the the critical bugs, and soon we'll be launching some critical features (like monthly timeframes) that weren't quite critical enough to block public release. 3. Building data centers in Virginia, Washington, and Texas We create a lot of our own data at Moz, and it takes a lot of computing power. Over the years, we've spent many small fortunes at Amazon Web Services. It was killing our margins and adding to product instability. Adding insult to injury, we've found the service... lacking. We spent part of 2012 and all of 2013 building a private cloud in Virginia, Washington, and mostly Texas. This was a big bet with over $4 million in capital lease obligations on the line, and the good news is that it's starting to pay off. On a cash basis, we spent $6.2 million at Amazon Web Services, and a mere $2.8 million on our own data centers. The business impact is profound. We're spending less and have improved reliability and efficiency. Our gross profit margin had eroded to ~64%, and as of December, it's approaching 74%. We're shooting for 80+%, and I know we'll get there in 2014. 4. Growing the Moz team We ended the year with 134 people on the team. In 2013, we brought in 47 new people, nearly a person each week. We also saw 16 people move on. That's a tremendous amount of change and growth on top of a high-headcount growth year in 2012. It's invigorating and humbling when I think of the talent we've brought together at Moz. Check out our Annual Report Infographic for lots fun extras on the team. Financial Performance Revenue grew 33% last year and ended at $29.3 million. That is off-plan performance. It could have been even worse. Quarters 1 and 2 were actually really strong, and in a subscription business, the year is made by Q1 and Q2 net adds. In the second half of the year, though, we lost momentum while in launch mode. What happened? Many books will be written by many historians on what happened at Moz in 2013. (Okay, maybe not.) Here is a list of contributing factors, in no particular order (like I said, this is really a much bigger topic than we can squeeze into this post): Delayed launches of the rebrand and Moz Analytics (MA) Customer unhappiness from some nasty bugs at launch Customer unhappiness from some high-priority features not included at launch Lower-quality leads than hoped through the invite list for MA Compromised marketing funnel during the transition time from the legacy PRO app to MA Mismatch between marketing materials and launch offering It feels really good to have this launch nearly behind us. I'm looking forward to the next phase of the product development cycle: iterate, iterate, iterate. And we'll take the lessons of this launch with us into all of our future projects. Our Cost of Goods Sold came in at approximately $10.8 million. The vast majority of this spend is Amazon Web Services, listed here as \"Cloud Services\" (see the section above on data centers for more context). While building our data centers and moving our systems over, we paid for both the data centers and Amazon. In 2014, we should see a substantial reduction in Cloud Services because we'll have moved almost entirely off Amazon. Our Gross Profit Margin for the year came in at 63% overall, but it was up to 70% and climbing in December. Data centers FTW! For those of you curious about what we spend money on, feast your eyes: I've included the expense as a percentage of revenue to better express how the business scales. Notice the growth in Personnel (headcount- and benefits-driven), Professional Contractors (the fleet to help us get Moz Analytics out the door), Office Expenses (doubling our square footage means more supplies and snacks!), and the arrival of the Data Center Depreciation line. Yes, you're reading that right. The percentage of revenue is greater than 100% when you add it up. We're not profitable this year. We're ending the year with a $5,754,925 EBITDA loss (that's fancy accounting-speak for how much money was left over after you paid the bills). We knew we were going to burn in 2013. That's why we took the $18m Series B. This is a bigger loss than we planned on, though, and we're disappointed we missed our goals. The good news is that we have enough capital to keep growing the business, and we're really excited to have the hairy launch behind us and a clean platform on which we can start iterating. We expect to be profitable in Q3 of this year. Community & Customers At the end of the year, over 25,000 people had Pro subscriptions. Over 21,000 of those accounts are paying subscribers. On the one hand, I'm disappointed because I don't think we met our potential. We have the skills, resources and passion to build the best Inbound Marketing Analytics software on the planet. We're on the path, but we're not there yet. The whole team is picking up the pace. The destination keeps moving too, which is part of the fun. It was a pretty amazing year for web traffic. We're seeing a little dip here at the end of the year, but we averaged 2.9 million uniques per month. Wow. Our organic search traffic rose by 28% this year, even with the little hit we took during the transition from SEOmoz.org to Moz.com. Our community engagement metrics increased really nicely this year. (Thanks if y'all are still reading this!) Also, people LOVE Whiteboard Friday. Can you believe folks watched over 35,000 hours!? Inside Moz HQ I already mentioned the team growth in my Big Four above. What I didn't talk about is how awesome it is to be a part of this team. Can you believe that combined we donated over $100k to charity in 2013?! Mozzers gave $41k+ to their favorite charities. Moz contributed $63k+ as part of our 150% Moz Match program. That's an average of ~$783 per Mozzer. I'm really proud of this number. It shows me that I work with people who believe the world can be a better place and are willing to do something about it. It excludes the time Mozzers have donated; We should start tracking that, too. The Annual Report has a complete list of the organizations we've helped. It's hard to capture what it feels like to work at Moz. This list helps: Technical Achievements We've already talked about building Moz Analytics and the new data centers. Those are major achievements, but they aren't the only things we've been busy with. Au contraire. Moz is an increasingly complicated business. We have loads of tools. Even if you're a long-time Moz fan, I bet we have tools you've never seen. We've been making investments in some of our key tools and the back-end infrastructure to support complex web properties. Launched Fresh Web Explorer in April 2013 We're really excited to offer a simple, high quality mentions-tracking tool. This is one of our most powerful features, but is still a relatively hidden gem. Do yourself a favor and go check it out. It's better than Google Alerts, and way cheaper than enterprise-y mention trackers. Relaunch GetListed in May 2013 We acquired GetListed in 2012 and did a complete back-to-front rebuild in early 2013. The rebuild improved scalability, reliability, speed, and allowed folks to log in to GetListed with their Moz accounts. The improvements laid the groundwork for an upcoming launch that we can't wait to share with you! The new release will be a major step forward in listing management. Followerwonk Improvements Check out Social Authority Score and our Partnership with Buffer. Open Site Explorer Improvements We added Just Discovered Links to Open Site Explorer in May 2013. We're working hard to get you fresh link data. There will be more to come in 2014. Sexy Behind-The-Scenes Stuff Well, we think it's sexy. We rebuilt our billing system (rapture!), updated our email management back-end (joy!), and created a unified authentication system to tie all our different web properties together (hallelujah!). Looking Forward Things are starting to move fast around here, and that's a good thing. There is a renewed sense of energy. Launch is behind us, and we can focus on bug squashing, tuning, and adding some critical MA features like monthly timeframes, a keyword-not-provided solution, and a content section. We're getting a little bit closer each month to our goal of 80+% gross profit margin (GPM). The launch of our Moz Local v.1 is in alpha testing as I write. For the next several months the company is focused on (1) Increasing retention by making happier customers, (2) Acquiring new customers by improving the funnel and driving high-quality traffic to the site, (3) Getting to 80% GPM, and (4) Launching and learning from our v.1 Local product. Rand and I are settling into our new roles, and the whole team is starting to rock a faster, more iterative approach to building software. We're also learning our way around our brand spanking new digs. If you're in Seattle, you should come say \"hi.\" Did I mention the Annual Report? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Moz's 2013 Year in Review: More Than You Ever Wanted to Know About Moz, and Then Even More"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Moz's 2013 Year in Review: More Than You Ever Wanted to Know About Moz, and Then Even More"
    },
    {
      "level": "H2",
      "text": "Four Big Investments"
    },
    {
      "level": "H4",
      "text": "1. The rebrand from SEOmoz to Moz"
    },
    {
      "level": "H3",
      "text": "2. The epic nine-month launch of Moz Analytics"
    },
    {
      "level": "H3",
      "text": "3. Building data centers in Virginia, Washington, and Texas"
    },
    {
      "level": "H3",
      "text": "4. Growing the Moz team"
    },
    {
      "level": "H2",
      "text": "Financial Performance"
    },
    {
      "level": "H2",
      "text": "Community & Customers"
    },
    {
      "level": "H2",
      "text": "Inside Moz HQ"
    },
    {
      "level": "H2",
      "text": "Technical Achievements"
    },
    {
      "level": "H4",
      "text": "Launched Fresh Web Explorer in April 2013"
    },
    {
      "level": "H4",
      "text": "Relaunch GetListed in May 2013"
    },
    {
      "level": "H4",
      "text": "Followerwonk Improvements"
    },
    {
      "level": "H4",
      "text": "Open Site Explorer Improvements"
    },
    {
      "level": "H4",
      "text": "Sexy Behind-The-Scenes Stuff"
    },
    {
      "level": "H2",
      "text": "Looking Forward"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sarah Bird\n          \n            Sarah Bird\n          \n            Sarah Bird"
}