{
  "url": "https://moz.com/blog/mozworthy-the-viral-video-generator",
  "slug": "mozworthy-the-viral-video-generator",
  "title": "MozWorthy! The only tool you need to make your videos go viral - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Today, I'm super-excited to introduce our latest product from Moz, MozWorthy! It's a tool that takes your regular (perhaps even boring) video, adds some \"oomph\" and pizzazz, and makes it go viral.",
  "content": "You'll Cry Tears of Joy When You Learn how Easy Viral Videos Can Be Video By: Jennifer Sable Lopez April 1, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jennifer Sable Lopez April 1, 2014 You'll Cry Tears of Joy When You Learn how Easy Viral Videos Can Be Video The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Today, I'm super-excited to introduce our latest product from Moz, MozWorthy! It's a tool that takes your regular (perhaps even boring) videos, adds some \"oomph\" and pizzazz, and makes it go viral. With so much talk about content marketing on the rise—and guest posting on the decline—we wanted to build something that helps in both instances. You make the video—heck, it doesn't even have to be that great—and we do the rest. Check out the video we used as the test. What started out as just a regular old video, turned into a HUGE HIT around the world. In fact, it was the original version of the \"internet famous\" FIRST KISS video. You can jump in and give MozWorthy! a try now, or read a bit more about why we made it, see some examples, and learn how it works. Start using MozWorthy! How it began At the end of February, many of us at Moz participated in Ship It Week. This was a time when we focused on using all our internal talent, enthusiasm, and fun to collectively come together and innovate. This meant more than just coding and building things, but working to build new ideas, frameworks, and anything else we could imagine to innovate at Moz. MozWorthy! was one of the tools we created. Our top-rated Ship It Week project is a tool that helps you learn the names of all the Mozzers, called \"Name That Mozzer.\" It was built as an internal tool only, to help staff get to know others on the team. A big thanks to Brandon for all the work he put into making Moz a better place! Although that one was a favorite among staff, we knew that several other projects would be used and loved by the community. For example, Peter Bray built Zoom Profiler, a tool that allows users to very quickly analyze a competitor, influencer, or customer to find their most important relationships, their top tweets, and their top content sources. At the same time, Evan came up with the idea of making it easier for people to get their videos to go viral. As a team, we thought our customers would really love it as well, so we jumped in full force: The product, design, dev, and marketing teams got together to create something truly helpful! Start using MozWorthy! How it works Ok, ok, let's get down to the real dirt. How does this baby work?! It's quite simple, and it only takes a few steps to find yourself in viral video world. Upload your video to YouTube. (Right now, the tool only works with YouTube videos, since it's still in its infancy. However, we plan on adding Vimeo, Wistia, and other platforms soon.) If you already have a video on YouTube that you'd like to use, that's great too. Give it a basic title; you don't need anything fancy here. We'll do the work for you! Once your video is uploaded, head on over to mozworthy.moz.com to add the link to your video and fill out a couple of key attributes. Hit submit! Then we do the rest for you. Viral title generator Once you submit your video, we take it and process both the video and title. Using super-special Moz data based on what words are the most clickable and linkable, we create a viral title for you. A combination of your title, attributes you added, and the addition of \"highly viral keywords\" will be used to make your title as ahhMOZing as possible.Video enhancements But we don't want to stop at just the title. We also take your video and make enhancements to it that will make people love it even more. Honestly, your video doesn't even have to be all that good, and we'll make it great. I mean, everyone wants to do mediocre work and press an easy button to make it awesome, right? Increased social shares Creating a great title and updating the video are all good and great. But what you really want is for people to see it, right? Cool. We help with that too. You'll see social shares across all the major platforms (Twitter, Facebook, Google+, LinkedIn, YouTube) go up practically instantaneously. A couple examples Ok, I know you all well, and you're not going to settle until you see exactly how it works. Which is cool, so I have a few examples to show you the kind of virality I'm talking about here! This One Weird Trick Will Keep You Energized All Day This one is fairly straightforward, but wow, look at that title! You'll Never Believe What This Former Philologist Caught on Video This is just a short, simple video as you see. But with MozWorthy! we were able to add oomph to the video, and make the title something that even your grandmother will want to share. So, what are you waiting for? Go check out MozWorthy! right now, and see what we can do for your social shares! Start using MozWorthy! *** Pssst... This was a joke for April Fool's Day 2014. This is sadly not a real tool. :) *** Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "You'll Cry Tears of Joy When You Learn how Easy Viral Videos Can Be"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "You'll Cry Tears of Joy When You Learn how Easy Viral Videos Can Be"
    },
    {
      "level": "H2",
      "text": "How it began"
    },
    {
      "level": "H2",
      "text": "How it works"
    },
    {
      "level": "H4",
      "text": "Viral title generator"
    },
    {
      "level": "H4",
      "text": "Video enhancements"
    },
    {
      "level": "H4",
      "text": "Increased social shares"
    },
    {
      "level": "H2",
      "text": "A couple examples"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H3",
      "text": "How to Create the Most Basic Google Business Profile Video with Canva, Even If You’re Not Great At This Stuff!"
    },
    {
      "level": "H3",
      "text": "On-page Video SEO – Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez"
}