{
  "url": "https://moz.com/blog/mozzers-run-off-to-paris-leaving-rand-sick-mute-troubled",
  "slug": "mozzers-run-off-to-paris-leaving-rand-sick-mute-troubled",
  "title": "Mozzers Run Off to Paris, Leaving Rand Sick, Mute & Troubled - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Yesterday around 5pm, I noticed myself getting sick - I had a run in with Dax from Webguerrilla, who had just come back from the London Free Clinic, where he was told that he \"had a virus. Nothing to do but wait... Sorry old chap.\" Now I've got the bloody infection, have lost my voice, am speaking…",
  "content": "Mozzers Run Off to Paris, Leaving Rand Sick, Mute & Troubled SEO Events By: Rand Fishkin February 15, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 15, 2007 Mozzers Run Off to Paris, Leaving Rand Sick, Mute & Troubled SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Yesterday around 5pm, I noticed myself getting sick - I had a run in with Dax from Webguerrilla, who had just come back from the London Free Clinic, where he was told \"you've a virus. Nothing to do but wait... Sorry old chap.\" Now I've got the bloody infection, have lost my voice, am speaking on the analytics panel in a few hours and woke up to find this note on Scott's bed: Imagine yourself in my shoes; what would you do? UPDATE: I didn't intend for this post to sound mean or angry - just fun! I think it's terrific that they took the initiative to go and spend time with some other industry folks. I suspect the value of the day trip will be at least on par with the results they would have gotten from a last day of sessions. BTW - My sickness has gotten a bit worse; I've got a nasty fever, too. Hopefully a day of rest before tomorrow's flight back will help. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Mozzers Run Off to Paris, Leaving Rand Sick, Mute & Troubled"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Mozzers Run Off to Paris, Leaving Rand Sick, Mute & Troubled"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}