{
  "url": "https://moz.com/blog/multiple-stage-remarketing-campaigns-13994",
  "slug": "multiple-stage-remarketing-campaigns-13994",
  "title": "Multiple Stage Remarketing Campaigns - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "First of all, What is Remarketing?\nIn case you've been living under a rock for the past year, Remarketing is a form of interest-based advertising used by Google. Joanna Lord did a great job of explaining it here on this post about Remarketing. The short version is that you tag a visitor who comes…",
  "content": "Multiple Stage Remarketing Campaigns Paid Search Marketing (PPC) B By: Bryce Bertola September 14, 2011 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! B By: Bryce Bertola September 14, 2011 Multiple Stage Remarketing Campaigns Paid Search Marketing (PPC) This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. First of all, What is Remarketing? In case you've been living under a rock for the past year, Remarketing is a form of interest-based advertising used by Google. Joanna Lord did a great job of explaining it here on this post about Remarketing. The short version is that you tag a visitor who comes to your website with a browser based cookie, then Google uses that cookie to serve your display ads across the web. Multiple Stage Remarketing Campaigns Multiple stage remarketing campaigns allow you to display different messaging, pitch new offers, and even alter the frequency at which your advertisements appear, all based on the number of days since a viewers last visit tagged on your site. This tactic is particularly useful for products or services with a long sales cycle, or Free Trial Offers (like the SEOmoz 30 day trial). A cookie can last up to 540 days, the maximum duration set by Google. Each cookie can be used to identify any number of shorter durations, allowing you to change the campaign timeline without losing your audience members. Start with a longer cookie duration, but keep it within reason because you don't want to frustrate visitors with ads they aren't interested in. Creating A Campaign Timeline Multiple stage Remarketing is all about getting the right message in front of your viewers at the right time. In order to do that you're going to have to separate your sales cycle into stages, determine what message you want to get in front of the customer, and at what frequency you want them to see your ads for each stage in the process. There can be as many stages as you need, but the more complicated it gets, the harder it becomes to manage. Here's an example timeline for a travel agency; Day 0 to Day 5 - Initial Visit and Price Shopping Day 6 to Day 30 - Deciding Where To Go Day 31 to Day 40 - Booking The Trip Day 41 to Day 45 - Last-Ditch Effort As you can see, there's a stage for each of the major timeframes in the decision making process. During the first few days you want to build brand recognition, then you may want to ease off for a while as they start making their decision. You'll want to remind them of what you have to offer when it comes time to book the trip, Then you throw all the best deals their way as a last-ditch effort. Creating Remarketing Campaign Stages When you first setup your campaign, you typically have an include tag, which identifies your target visitors, and an exclude tag, which identifies which visitors have completed goals or transactions. To use multiple stage Remarketing, you'll need to create a Remarketing list for each stage individually. Creating the Remarketing lists is simple, and you can use your current Remarketing tag. Here's what a it should look like when you create a new remarketing list; You'll notice that when setting up the Remarketing list, you can select an existing audience tag and specify a shorter audience duration. Once you've created a Remarketing list for each stage, create ad groups or campaigns for each stage, using the current stage as an included audience, with the previous stage as a negative audience. The combination of positive and negative audiences will ensure that there aren't any overlapping audiences. Once complete, you can upload your display ads to your campaigns or ad groups with the appropriate messaging for each stage. You can split test ads within each stage to determine which one gets the best response. Controlling Impression Frequency Impression Frequency, or how often your ads are displayed, is controlled by your bid per click within each campaign or ad group. Controlling the frequency of ad impressions is important if you don't want to look like you're stalking your visitors online, and different stages might require a different impression frequency. The best way to measure your impression frequency is your campaign-level impression share, but if you've built all your Remarketing ad groups under the same campaign, you won't be able to see the impression share at each stage. In that case, you can take the number of impressions and divide it by the estimated audience size to get an estimated number of \"Impressions Per Visitor\" This formula will give you a general idea of the average number of times each visitor would see your ads, but it's based on estimated audience size and, therefore, less accurate comparatively. Experiment with the impression frequency by clearing your cookies and tagging your own computer, then watching for your ads to pop up around the web. If you see your ads everywhere you look, maybe your bid is too high. If you don't see your ads at all, you might want to check your campaign settings or increase your bids. What's Your Experience with Remarketing Campaigns? I've seen some great responses to remarketing with ParkCityIndependent.com, an Online High School. What sort of response have you seen, and what creative applications have you dreamed up? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Multiple Stage Remarketing Campaigns"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Multiple Stage Remarketing Campaigns"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Bryce Bertola\n          \n            Bryce Bertola\n          \n            Bryce Bertola"
}