{
  "url": "https://moz.com/blog/music-seo-2015",
  "slug": "music-seo-2015",
  "title": "Music SEO - 7 Lessons in Brand Optimization for 2015 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For B2B or ecommerce, people often discover your brand with commercial queries like \"dining room lamps\" or an informational search like \"how to fix a dishwasher\". Then they look around your site, your social profiles, get retargeted—before ever making a purchase—but in many cases that journey…",
  "content": "Music SEO - 7 Lessons in Brand Optimization for 2015 Technical SEO | Search Engines | Social Media By: Dan Shure March 30, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Dan Shure March 30, 2015 Music SEO - 7 Lessons in Brand Optimization for 2015 Technical SEO | Search Engines | Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Bands, music, and SEO - A different paradigm For B2B or ecommerce, people often discover your brand with commercial queries like \"dining room lamps\" or an informational search like \"how to fix a dishwasher\". Then they look around your site, your social profiles, get retargeted—before ever making a purchase—but in many cases that journey started with an non-branded organic search. Search is certainly not the only discovery channel. But important enough that investment in non-branded keywords is essential. A (very simplified) illustration of this discovery path might look something like this: The above is NOT the case for musicians and bands though. When's the last time you discovered a band with a search engine? Probably never. For bands and musicians, the discovery path is flipped around. THIS is probably more realistic: The search engine is more about reducing friction on the path to becoming a die-hard fan. I don't think many people are discovering their new favorite band like this: But you HAVE probably tried to learn more about bands and musicians after the initial discovery with searches like this: (No, I am not a Lumineers fan—just so there's no confusion ;) ) I don't think many musicians, bands, record labels or managers are looking at this aspect of search. Sure, you can hope that users and Google \"just figure it out.\" Or you can be proactive and create the best fan experience possible.SEO for bands = The branded keyword experience So the REAL opportunity in keywords for bands and musicians is the fan experience here: It's their \"branded\" terms (or what I like to call \"PropWords\"—proprietary keywords): band name musician names album names song names lyrics performance dates interviews etc... For example, there's a TON of volume around Lupe Fiasco's branded terms—and this is only the tip of the iceberg: Just because no one's discovering Lupe Fiasco in organic search, doesn't mean there's no opportunity. It's just not in the normal places you'd look for B2B or eCommerce opportunity. So that's the lens through which the rest of this post should be seen through. SEO for bands is primarily about the fan experience searching their branded terms. Search result opportunities for bands1. Event listings1.1 Optimize your own site for general tour searches As a band, it's important to keep fans and potential fans in your ecosystem. You should keep fans on your properties (website, social etc) as much as possible—so as not to give up extra traffic to third party sites. Being visible for your own event searches is a critical way to keep them there. Let's use on of my new favorite bands, Sylvan Esso. Here's an example of what Google typically shows for a tour search—for the query \"sylvan esso tour dates\": I imagine for this query, fans are trying to get a list of all tour dates. So what is Google doing now? They are providing the list front and center. You notice that Sylvan Esso only has one result—everything else goes to a third party site. This is already a lost opportunity to drive more fans to their site. They could optimize for clicks by aligning the likely user intent with their appearance in the SERP. Using the SEO Mofo SERP tool, I came up with: This listing may perform better because: It aligns with most likely user intent (browse all dates/location & purchase) The URL is more informative It promises something exclusive (as long as they deliver—maybe with a group discount, a meet and greet etc). This is the start to funneling fans through your website instead of a third party. 1.2 Create pages for individual shows (with caution) Some fans may opt to click a tour date Google has provided. What does Google do next? Google then returns a page like this—with a TON of stuff: This SERP is packed! It includes: A date carousel A large AdWords ad A map card Knowledge Graph card Top result has 4 site-links 7 more normal organic results, some with date snippets and extra links Here's the kicker. There's only one tiny little link to sylvanesso.com—in the map card. And it goes to their homepage. They have a pretty poor shot at driving users to their website here. Let's look at a result for a specific Dave Matthews Band tour date: They're doing it a little better. Few observations with this one: Their link in the map goes to their tour page The #1 organic listing goes to their website—because they have a specific page for that exact show. The amount of stuff in this SERP is still immense. The first organic result is way below the fold. The \"with caution\" part is that—you don't want to just create individual pages for every show, without trying to add something of value to them—like information about the venue, past show pictures from that venue, etc. These pages can get quite \"thin\" and this isn't a good thing either.1.3 Tag your site to get official ticket links Finally, the biggest change in Google is the addition of official ticketing agents. To use one of their examples, let's look at Google's example of \"ariana grande tour\" (and no, definitely not a secret Ariana Grande fan—although some of the production is decent): Not only do the tour dates show up at the top, but check out this preferred ticketing link showing prominently in the Map Card: Google first announced this capability about a year ago. And they have recently expanded this for comedians and concert venues as well. Here is Google's official developer documentation on event markup for performers: https://developers.google.com/structured-data/events/performers I want to note, they are giving preferential treatment to official artist websites: You have three options to specify event info: HTML—code it directly into your page Plugins or Widgets New \"Delegation\" Markup—indicate Google to source it from another webpage2. Make an app (or several) and index them For those not aware, App Indexing is getting pretty real. I think this is a major opportunity for bands and musicians. Let's look at mobile search volume for a few albums that have come out recently: According to my small sample, at least 44% of album name searches are on a mobile device (not even including tablets). Recent claims are that Android has almost 50% of the smartphone market share. For Alicia Keys, that would mean about 18,500 searches a month for \"girl on fire\" on an Android. Are you seeing the opportunity? No? Well, Bjork did: She had an app developed just for her new album, Biophillia. Now, Android users searching Google for this album will be able to purchase and experience the \"multimedia exploration\" in this app. If I was a label, I'd be experimenting with making apps for all albums by artists—filling them with an exclusive experience—and seeing what happens. Google put together their 4-steps to appiness—and easy to follow guide to get your Android app indexed in Google search.3. Get a Knowledge Graph result I know we've look at musicians who have already reached a threshold of popularity. They are likely to have a Knowledge Graph result already. But what if you're an up and coming musician? You may not have a Knowledge Graph result—but perhaps with a little nudge you can get one. For example, a friend of mine (and old bandmate) Lost Midas is now a solo electrofusion producer and songwriter. He is signed to an independent label and even just performed at SXSW—but unfortunately Google does not show a Knowledge Graph result: What could someone like him do to get in the Knowledge Graph? One thing I found interesting was Google's suggestions for how performers specifically can get in the Knowledge Graph. It's buried at the bottom of the event listings page: 3.1 Get listed in Wikipedia This is easier said than done. Be sure to read their inclusion criteria for music. If you feel the band or musician is notable enough to get into Wikipedia, you can then start the process here. That is the official page to add an article request for bands and musicians. Please note, Wikipedia does not want you to list yourself. As Google states above— be sure the official homepage is recorded correctly. I take this to mean—list the exact (\"canonical\") version of your homepage URL. The one you would verify in Webmaster Tools. You may also find this article on how someone claimed to sneak through Wiki's notability test interesting (although I can't officially say how good that method is).3.2 Get listed in MusicBrainz The other site Google recommends getting listed in is MusicBrainz.org. I don't have much experience with this site, but you can go here to learn about making contributions. 3.3 Upload audio to Archive.org Note, this is just my hunch. But if Google is using Wikipedia and MusicBrainz to inform their Knowledge Graph results—perhaps they use Archive.org. Why not? It's one of the most authoritative sources on the web. With Archive.org you can upload entire concerts to their site: 3.4 Create and verify a Google Plus page Right, I know. \"No one uses Google Plus.\" \"Google Plus is dying.\" Perhaps there are elements of truth there. But I'd be surprised if having a Google Plus page verified with your website doesn't somehow impact Knowledge Graph listings. My friend does not have a Google Plus listing currently: For those needing to create and verify a Google Plus page: Go here and choose \"Brand\" to create a page. (Note, you are not creating a personal page. This is a mistake I see many organizations making). And then link your website to your brand page by following those instructions.4. Customize your Knowledge Graph Once you have a Knowledge Graph listing—that's just the beginning! Google recently added ways to control what appears there.4.1 Specify your logo For bands (and all organizations really) branding is an essential element of success. Google now gives you the opportunity to directly control the logo users see in your Knowledge Graph result: As you can see above, the jazz group The Bad Plus has a random picture from an article showing—when perhaps there is a better photo they would prefer. This may be especially important from a consistency of branding standpoint.4.2 Specify your social profiles In addition, you can also directly control what social media links show in the knowledge graph. As I've mentioned, getting users to follow you on social is a key goal for bands in terms of audience development. Your audience is everything. And for bands, most search activity is going to come from their brand name. Why not make it easier for them to discover your social profiles? For example, the amazing \"Livetronica\" Band (live electronica music) The New Deal could get all of their social links to show in their Knowledge Box: As you can see they are missing a huge opportunity to get more fans to their Instagram, Twitter and Soundcloud profiles. There's at least 1,700 searches a month for \"the new deal music\" and \"the new deal band\".5. Have a crawlable and indexable site For some reason, I have noticed sites in the music industry tend to be pretty inferior. This could be due to labels using poor frameworks, or the band/artist needing to just get a website up the quickest, cheapest and easiest way possible. This can cause some issues though. Let's check out my friend's site again. He's currently on the Flavors.me platform. It looks like there's several \"pages\" to the user, but to Google his website is just all one page: As mentioned, this is a common yet often overlooked issue with music websites I see. In fact, despite Bjork getting it right by having an app—her website has the same issue: Her website (which actually does looks like an impressive creative endeavor) is built with hashes # in the URLs. Which makes the individual pages uncrawlable. This shows up as an issue if I try to find her mailing list in Google: The first result goes to her record label's page. That's fine right? Well, not really because she has her own mailing list: Because of how the website is built though, that page is basically invisible to Google—and users can not easily find it from a search. The absence of Bjork's mailing list in search results is a critical oversight. For an artist, your mailing list is one of your strongest assets.5. Leverage your own YouTube channel As it's often said, YouTube is the second largest search engine. And there's no doubt music queries make up a huge percentage of their overall search volume.5.1 Create a YouTube channel I'm sad to have to say this, but many bands don't seem to even have a YouTube page of their own. Again, they are missing a massive opportunity to funnel fans searching for their content to their YouTube account—where they can grow subscribers, promote music and cross-promote other channels. For example, that band The New Deal does not have their own YouTube channel: Their live performances are a core selling point. This drives a ton of activity around their band in YouTube (people looking for concert footage). If they added some of their own on their own channel, they could capture a lot of this activity and engage with the fans.5.2 Add video content fans are looking for Having a channel is great, but fans are often looking for specific pieces of content. It's really nice to have lots of fans that upload this content for you for fun, but capturing some of this activity is important. For example, another new band I have been liking a lot - Made In Heights—could be doing this: Fans are looking for live performances, and the only ones there now are all fan uploads. You can use YouTube search suggest to find other things fans are searching for. I don't see it mentioned often, but KeywordTool.io allows you to get YouTube search suggestions: This can quickly give you ideas of what content to add to your band page in YouTube: The above screenshot shows the most common searches around \"Made In Heights\". They mostly look like song names. If I were that band, I'd make sure they have video or content for every one of those songs. You can use YouTube directly of course to find search suggestions off of the band name. For example, there are a lot of lyric searches. This makes sense. People want to listen to the song while reading the lyrics: Wow! Yet, what happens when we look in YouTube for \"made in heights lyrics\"? Never mind the band not having any lyric results—NO one has any lyric results. This is definitely an opportunity to provide content that doesn't exist within YouTube.5.3 Create playlists Playlists are also overlooked in YouTube. They have many benefits: Make your content easier to discover by organizing it. Keep viewers on your content, in your channel I've heard it rumored that creation of playlists can help you rank better in YouTube search only if your channel helps YouTube keep viewers... inside YouTube. Playlists can do this. You can organize videos from any account into your playlists. You can also rank in Google search with playlists (more on that below) I started using playlists on my YouTube music channel (where I mainly post covers and tutorials of hip-hop songs on piano)—and at least anecdotally—have seen my view count rise faster than usual: (I sure did use the word \"content\" a lot in that screenshot!) Many popular artists in YouTube don't have any playlists though—for example Flying Lotus: You can also curate playlists of videos about your band no matter who uploaded it. For example, let's say you're Drake (OK, maybe Drake's record label or social media manager). You could curate playlists of the best Drake interviews, no matter who uploaded them: Then when fans search, they may discover the playlist on Drake's channel which could earn subscriptions and also get them watching their chosen interviews. Speaking of Drake—remember when I mentioned you could rank in Google search with YouTube playlists? Take a look at this: That's a random fan playlist ranking #1 for \"drake playlist\"—which gets 1,600 searches a month. That's not an outlying case though. I barely had to look further for another example: \"john legend playlist\" gets 720 searches a month—and two fan playlists rank at the top.6. Contribute to Medium.com While the idea of \"guest posting\" is saturated in many industries, I don't see this being done a whole lot in the music industry. That's why I was impressed when I noticed a DJ named A-Trak posted this compelling article about rap in 2014: A few months later, this article has earned: 254 recommendations on Medium 1,480 Facebook shares 470 tweets 336 Google +1's Including shares by Fred Wilson (380,000+ followers) and pianist Chilly Gonzales (40,000+ followers and high relevance) It even ranks #2 for [rap in 2014]: Although not super high volume, it potentially ranks for a lot of long tail—and will bring in consistent brand discovery from a relevant audience.6. Provide exclusive content about your lyrics The SEO world is no stranger to lyric searches. Just last year, Rap Genius (now just \"Genius\") was caught up in a Google penalty. And back on December 19, Glenn Gabe was the first to notice Google displaying full lyrics in search results: Glenn Gabe's screenshot from December 19, 2014 of Google displaying lyrics in search. Glenn also recently published a pretty in depth study about lyrics in the SERPs I highly recommend you check out. In his article, Glenn astutely points out that when you add the word \"meaning\" to your lyrics search—the lyrics box goes away—which I found to be true looking at Sylvan Esso \"Coffee\" lyrics: As a band you could release exclusive content about your lyrics such as: A photo of where they were originally written (on a napkin while on tour etc) The story about how/why they were written An explanation about their style (rhyme patterns, metaphors, references to history etc.) Share old/original versions of the lyrics or a certain line and the process of revisions Fans and music publications could also create exclusive content about the lyrics. They could interview the band about their meaning—or publish their own in-depth interpretation of the meaning. I also want to point out—there can be a lot of search volume for a single line of a song lyric, if the song and artist are popular enough. Check out the volume for this one line by Drake: That's 1,000 searches a month (certainly skewed all towards February, when the album came out) for \"runnin' through the 6 with my woes\". And I want to point out, 65% of those searches are being done on mobile phones Check out search volume for Adele lyrics from years ago now: \"But I set fire to the rain\" and \"watched it pour as I touched your face\" both get decent volume and have a good share of mobile share. Yet there is only one result in this SERP explaining the meaning to this line: There's definitely value to be found by: finding lines from lyrics with search volume creating content to satisfy the user intent Both the artists AND third party publishers have an opportunity here. Genius.com is really the only true player in this space right now!7. Optimize for real name searches Remember my friend \"Lost Midas\"? This is obviously not his real name. It's Jason Trikakis. Not a hugely common name. So a search for it should return his website #1 right? Wrong. You can't always rely on Google to \"figure it out.\" The problem here stems back to the fact his website is not very search-friendly. His name is on the website but very hard for Google to find. Solution in this case would be: Ultimately to be on a better web platform. But also adding his name into the title of the page (if possible on Flavors.me) would certainly be a step in the right direction :) Also—remember Sylvan Esso? What if one were to be searching around for \"Nick Sanborn\" who makes up 1/2 of the Sylvan Esso duo? Now, I'd never argue something from sylvanesso.com should appear at the top. But there's nothing from their domain on the first page. As a fan, I'd probably enjoy at least one result from one of their own domains. Here's a few ideas for them: Create a bio page on their own site Have a personal website which can then get people to the band website etc There's SO much more I could have mentioned in terms of marketing music these days. When I played in bands it was the days of MySpace :) I don't even think YouTube was out yet. There are so many opportunities out there now with social media, platforms like Soundcloud and Bandcamp. I left a LOT out of this post. If you have any questions at all, please ask in the comments below! And I also love to chat about music! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Music SEO - 7 Lessons in Brand Optimization for 2015"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Music SEO - 7 Lessons in Brand Optimization for 2015"
    },
    {
      "level": "H2",
      "text": "Bands, music, and SEO - A different paradigm"
    },
    {
      "level": "H3",
      "text": "SEO for bands = The branded keyword experience"
    },
    {
      "level": "H2",
      "text": "Search result opportunities for bands"
    },
    {
      "level": "H3",
      "text": "1. Event listings"
    },
    {
      "level": "H4",
      "text": "1.1 Optimize your own site for general tour searches"
    },
    {
      "level": "H4",
      "text": "1.2 Create pages for individual shows (with caution)"
    },
    {
      "level": "H4",
      "text": "1.3 Tag your site to get official ticket links"
    },
    {
      "level": "H3",
      "text": "2. Make an app (or several) and index them"
    },
    {
      "level": "H3",
      "text": "3. Get a Knowledge Graph result"
    },
    {
      "level": "H4",
      "text": "3.1 Get listed in Wikipedia"
    },
    {
      "level": "H4",
      "text": "3.2 Get listed in MusicBrainz"
    },
    {
      "level": "H4",
      "text": "3.3 Upload audio to Archive.org"
    },
    {
      "level": "H4",
      "text": "3.4 Create and verify a Google Plus page"
    },
    {
      "level": "H3",
      "text": "4. Customize your Knowledge Graph"
    },
    {
      "level": "H4",
      "text": "4.1 Specify your logo"
    },
    {
      "level": "H4",
      "text": "4.2 Specify your social profiles"
    },
    {
      "level": "H3",
      "text": "5. Have a crawlable and indexable site"
    },
    {
      "level": "H3",
      "text": "5. Leverage your own YouTube channel"
    },
    {
      "level": "H4",
      "text": "5.1 Create a YouTube channel"
    },
    {
      "level": "H4",
      "text": "5.2 Add video content fans are looking for"
    },
    {
      "level": "H4",
      "text": "5.3 Create playlists"
    },
    {
      "level": "H3",
      "text": "6. Contribute to Medium.com"
    },
    {
      "level": "H3",
      "text": "6. Provide exclusive content about your lyrics"
    },
    {
      "level": "H3",
      "text": "7. Optimize for real name searches"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dan Shure\n          \n            Dan Shure"
}