{
  "url": "https://moz.com/blog/my-bet-on-webmasterradio",
  "slug": "my-bet-on-webmasterradio",
  "title": "My Bet on WebmasterRadio - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "During the expo hall last Tuesday at SES San Jose, I sat down with Matt Cutts for a 5 minute, impromptu chat on the air. Foolishly, I issued a challenge that anyone who sumo-wrestled me at the WebMasterRadio party on Wednesday night (Jim's got great photos here) and won would earn the right to a…",
  "content": "My Bet on WebmasterRadio SEO Events By: Rand Fishkin August 14, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 14, 2006 My Bet on WebmasterRadio SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. During the expo hall last Tuesday at SES San Jose, I sat down with Matt Cutts for a 5 minute, impromptu chat on the air. Foolishly, I issued a challenge that anyone who sumo-wrestled me at the WebMasterRadio party on Wednesday night (Jim's got great photos here) and won would earn the right to a free link from SEOmoz. This story has a bit of a nasty ending so parents, please put the kids back in the crib. On Wednesday night, I was taken to dinner by the folks at Ask.com, which deserves (and will receive) its own blog entry. We feasted on a half dozen appetizers, 6 bottles of wine and plenty of fine seafood, plus dessert. At 11pm, when I arrived at the WebmasterRadio party, I found myself in an immediate confrontation with none other than famous SEO (and friend), Thomas Bindl. While donning my pseudo-sumo suit, pictured below, I found myself feeling a tad queezy from the full stomach and hot padding. Needless to say, by the end of the match, I'd be in even worse shape. I think I wore the blue suit, above The first match felt short - I dove at Thomas' feet, he danced around and my left arm and leg touched the yellow line. The second match, I raced for Thomas full-bore, he sidestepped and didn't even need to touch me - I simply ran right out of the arena. On the third match, I cautiously approached Thomas, shoved him, and was shocked to see him fall out of the ring. The fourth match, I made the mistake of feet diving again and was quickly dispatched - a 3-1 victory for Thomas. After removing the suit, I made my way quickly to the men's room and proceeded to re-distribute some of the fine meal Ask had purchased. Luckily, the attendent in the men's room was selling mouthwash and gum! Two rules to remember - never pseudo-sumo on a full stomach, and never underestimate a German who owns lederhosen (specifically, these ones). Here's your link, Thomas: Pseudo-Sumoer Extraordinaire BTW - In case you're wondering, this is indeed a link that constitutes an editorial \"vote\" for the quality and relevance of Thomas' site. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "My Bet on WebmasterRadio"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "My Bet on WebmasterRadio"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}