{
  "url": "https://moz.com/blog/my-business-console-free-tool",
  "slug": "my-business-console-free-tool",
  "title": "Moz Local Now Syncs with Google My Business (Plus, a Sweet Free Tool!) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It's now as easy as pie to import locations straight from Google My Business into your Moz Local dashboard. And on top of that, we've got a new free tool to make painful GMB permissions management a thing of the past: introducing My Business Console!",
  "content": "Moz Local Now Syncs with Google My Business (Plus, a Sweet Free Tool!) Local SEO | Moz Tools | Moz News By: Dudley Carr March 10, 2016 Table of Contents Copied! By: Dudley Carr March 10, 2016 Moz Local Now Syncs with Google My Business (Plus, a Sweet Free Tool!) Local SEO | Moz Tools | Moz News [Estimated read time: 4 minutes] Until now, I was confident that developing a software service had never been compared to assembling furniture from Ikea (no Google searches were done to prove this assertion). Believe it or not, we unlocked this achievement while working on the Google My Business API. The piece of \"furniture\" we constructed? We built the recliner that allows you to sit back and have your locations automatically imported from Google My Business to Moz Local. And like most things built with tools meant for hands far smaller than the average human hand, we’re proud of the end result and excited to announce this amazing (and comfortable) feature today in Moz Local! Taking a step back, we looked at our fine construction and realized that there were a number of spare parts laying on the floor. We took those Google My Business API spare parts and built Moz Local’s new My Business Console. In furniture-speak, it’s like a nifty baby gate that actually allows adults to operate it without reading the instruction manual. In seriously-tell-me-what-this-thing-is terms, My Business Console gives you fine-grained bulk permission management for Google My Business. Sync locations from Google My Business to Moz LocalImporting locations from Google My Business into Moz Local can now be done with a single click. This fancy feature replaces the CSV upload process that's been a part of Moz Local since day one. Although Moz Local has always accepted CSVs exported from Google My Business, the process was still quite manual and thus more cumbersome and error-prone than it needed to be. Users can setup the import process via the Add Listings button in your Moz Local Dashboard starting today! Moz Local’s new free tool, My Business Console!My Business Console works with your Google My Business account and lets you, as a Google My Business owner, audit, add, and remove managers in bulk. For brands, agencies, and franchises that have hundreds of locations and dozens of GMB Business Accounts, permission management either gets in the way of collaboration or potentially exposes capabilities to people who shouldn’t have them. Can't wait? Check it out now! Today, there are two ways within Google My Business to collaborate with others. You can add a person as a manager on the Business Account, giving them owner access to all locations in that account, or you can add the person as a manager on each location. The former provides a ton of power to whomever you add; the latter is mind-numbingly tedious to do. With My Business Console, you can easily choose to audit/add/remove people in bulk, either at the Business Account level or at the Google My Business location level, allowing you to dial just the right level of sharing. Easy permission management, coupled with visibility across lots of locations and business accounts, should allow groups to better collaborate on location data. Before we dive into how it works, a couple of really important things about My Business Console: First, it’s completely free now and forever for businesses small and large. Just like with our Check Listing functionality, we believe in providing important and accessible tools to help the Local community. Second, since this is a free tool, you do not need a Moz account. You simply log in with the Google account that you’d like to use to manage your locations. So, how does it work? First, you log in using your Google account from the My Business Console homepage. There are two primary views: Locations and Managers. The \"locations\" view shows all of the locations that you have access to in Google My Business for your Google account. Here you can quickly see which managers can modify a location: To add or remove managers, you need to be the owner of a location. You can use the handy toggle to see exactly which locations those are: Adding a user to two locations requires selecting the locations and then clicking the \"Add\" button: The \"managers\" view shows all managers across all locations. This view is primarily to remove a person without having to find all of the locations containing that manager. Removing a person with a single click is necessary when that person leaves an organization. Similar to location management, it’s easy to add and remove managers for your business accounts. Adding a manager to a business account will automatically give them access to all the locations under that account. Try My Business Console out for yourself and let us know how we can make it even better: No manual required! Have more questions? Check out the FAQ. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Moz Local Now Syncs with Google My Business (Plus, a Sweet Free Tool!)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Moz Local Now Syncs with Google My Business (Plus, a Sweet Free Tool!)"
    },
    {
      "level": "H2",
      "text": "Sync locations from Google My Business to Moz Local"
    },
    {
      "level": "H2",
      "text": "Moz Local’s new free tool, My Business Console!"
    },
    {
      "level": "H3",
      "text": "So, how does it work?"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dudley Carr\n          \n            Dudley Carr\n          \n            Dudley Carr"
}