{
  "url": "https://moz.com/blog/my-departure-from-seomoz",
  "slug": "my-departure-from-seomoz",
  "title": "My Departure from SEOmoz - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As Rand mentioned in his recent post: Big Changes at SEOmoz, I'm leaving the company to pursue other opportunities. It's been nearly 4 and a half years, which is a millennium in tech-industry time, and I feel that SEOmoz is at a point where I'm comfortable leaving. Previously, I was the only…",
  "content": "My Departure from SEOmoz Moz News O By: Oatmeal September 18, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! O By: Oatmeal September 18, 2007 My Departure from SEOmoz Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As Rand mentioned in his recent post: Big Changes at SEOmoz, I'm leaving the company to pursue other opportunities. It's been nearly 4 and a half years, which is a millennium in tech-industry time, and I feel that SEOmoz is at a point where I'm comfortable leaving. Previously, I was the only developer, designer, and systems administrator and our entire infrastructure depended on me. With Jeff, and more recently Mel, I can now leave knowing that SEOmoz is in good hands. An ideal exit opportunity isn't the only reason I'm leaving. About 6 months ago I decided I wanted to apply my skills to a project outside of SEOmoz and see what I could come up with. Online dating was the field I decided I wanted to play in, so I did a bit of research, came up with a business plan, and got to work. All my efforts were done during my nights and weekends, and after a few days of development I realized how quickly things were coming together, so I started logging the number of hours I was putting into it. In the end, I built a full-featured dating website, from concept to launch, in 66.5 hours. In a typical 9-5 job this would amount to about a week and a half. The end result is Mingle2, a Free Online Dating website . Before I go any further I'd like to point out that Mingle2 won second place in the social networking category of SEOmoz's Web 2.0 Awards. A clever person might deduce that since I designed the awards, I had something to do with that. I'm going to be as honest as I can: I asked Jane to include Mingle2 in the nominations, but the actual winners were voted on democratically by people outside of SEOmoz who had no idea that Mingle2 was my project. The first month of being online Mingle2 had around 90,000 unique visitors. By July the site's popularity exploded, seeing nearly 700,000 uniques and 1.9 million page views for that month alone. Being the founder (and a user) of the website, this has been the most interesting and rewarding website I've ever been involved with. Before long I started getting emails from various other dating websites and investors and after countless sleepless nights trying to decide what I wanted to do, I put my indecisiveness to rest and sold Mingle2 to JustSayHi, a competing dating website. I chose JustSayHi primarily because their aspirations are very aligned with mine; we both want this property to be synonymous with free online dating, much like how craigslist has become synonymous with free classified ads. In addition, the value JustSayHi and I can create by working together is going to be phenomenal. They're going to leverage my viral marketing and linkbait abilities, and I'm going to leverage their existing infrastructure, development staff, and business experience. In addition to the acquisition of the website, I will now be working full-time for JustSayHi as a viral marketer, SEO, and web designer. I'll still do a little bit of development, but my focus will be marketing. It's weird to think my primary responsibilities won't be fixing downed servers or hacking together perl scripts anymore, but I'm excited for the change. JustSayHi is in San Francisco, but I'm going to be telecommuting from my home in Seattle. I intend to be very nomadic, however, to keep from going completely stir crazy. Leaving SEOmoz feels weird. I've been here for nearly half a decade and I'm certainly going to miss working with such an awesome team, especially since most of us are friends. I don't know how I'm going to make it through the day without badgering Rebecca. I'll probably buy a punching bag and start stealing Ritalin from the neighborhood kids. I'll snort the Ritalin and go to town on the punching bag, this should be on par with a typical day of interaction with Ms. Kelley. If this doesn't cut it, I'll throw in a few bottles of Nyquil and put The Texas Chainsaw Massacre on as background noise. I was always taught to pick a specialty and become intensely good at it. For example: become a rockstar database guy and focus entirely on writing SQL and all-things-database. As an entrepreneur, however, the opposite is true - diversifying your abilities is absolutely critical. Working at SEOmoz I had to learn everything involved in making a website successful: systems administration, design, development, marketing, branding, analytics, support, and so on. I've done it all: locking down FreeBSD servers, designing logos, answering support questions, executing business ideas, building interactive websites, and generating hundreds of thousands of visitors to our website through viral marketing. If there's one thing I have to thank SEOmoz for, it's providing me with the opportunity to hone all these skills and being flexible through all these years. To wrap this up, my 25th birthday is in about a week and after that I'm flying to Tokyo for a short vacation. Once I return I'll start my new job at JustSayHi. I'll still be consulting for SEOmoz on an as-need basis and I'm going to pubcon in December, so I'll still be around - just to a lesser degree. Rand and Gillian - thank you for sticking it out with me all these years, I know that my personality can be very manic at times - but in the end I think it was worth it for all of us. Best of luck, mozzers :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "My Departure from SEOmoz"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "My Departure from SEOmoz"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Oatmeal\n          \n            Oatmeal"
}