{
  "url": "https://moz.com/blog/my-first-conference",
  "slug": "my-first-conference",
  "title": "My First Conference - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "During my 6 hour flight from Seattle to Baltimore I wrote down a few notes from the SMX Advanced conference and thought this might provide me a chance at my first blog post on SEOMoz.     I will spare you a recap of the conference, as much better writers have already given excellent accounts of SMX…",
  "content": "My First Conference Public Relations K By: Kevin Doory June 9, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! K By: Kevin Doory June 9, 2008 My First Conference Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. During my 6 hour flight from Seattle to Baltimore I wrote down a few notes from the SMX Advanced conference and thought this might provide me a chance at my first blog post on SEOmoz. I will spare you a recap of the conference, as much better writers have already given excellent accounts of SMX Advanced. I would, however, like to recount a story about the true nature of human beings. This simple story begins with a continental breakfast at the Marriot Residence Inn. Since this was my 5th day at the hotel, I was comfortable knowing I could take a little bit more time with breakfast before taking a sedan to Pier 66. With the assurance from the day before that this ride would only take about 10 minutes, I finished my coffee and told the front desk attendant I was “ready-to-roll.” It was raining; it is Seattle after all, so the trip was a bit slower than normal. I decide to send a quick email back east letting my boss know how everything was going. What happened next would change my day and ultimately my view on the world. My usual trip down Broad Street to the Bell Center was impeded by one of the lovely morning trains. I thought everything was fine until the driver and I noticed that the train was not moving. A quick glance at my watch and I asked him to take me up to the sky bridge so I could make it the conference on time. He did just that and as he pulled over so that I could exit the vehicle, I paid him and forgot to grab a receipt because I was now almost late. No worries. I can now get a smoke in before I walk into the show. “Cigarettes? Check . Lighter? Check. Phone? Phone? Phone???\" If I didn’t have my phone it must be in the sedan. The same sedan that is 25 yards away at the stop light and about to turn left. I ran like this overweight man has not run before, screaming and hollering up a Seattle street while I could see the light change and the sedan turn left up a hill that seemed to be on 45% grade. No! No! My phone, my blackberry, my one connection to home is gone. I stumbled into a Tully’s coffee shop and pleaded with two people sitting there. I asked if I could borrow a phone to call my hotel. I thought surely my hotel would have a record of the driver and could ask him to take my phone back. After “Mike” lent me his phone I discovered the hotel had no idea what was going on. I began to feel sick. The hotel asked if I called my phone. Of course I did but it was on silent. The hotel offered me the number of a few companies that supplied sedans. All dead ends. Then something completely unexpected happened. Mike turned to me and said, “This is what we are going to do.” He told me he could tell I was at some sort of conference and he had to get to work. But he knows the hotel I am staying at and he has my card. So Mike told me he “would call all the sedan/limo companies in Seattle and find out which one had my phone.” I was stunned. He said if he were visiting Baltimore and the same thing happened to him, I would have done the same. He explained that I could call him later in the day and we would see what happens. I tried to make it through a couple of the morning presentations, but really couldn’t get my lost phone out of my head. So right before lunch I found a pay phone and called Mike. He said, “Good news, I found it.” I was shocked, absolutely shocked, when Mike told me the 12th company he called said they had my phone and would take it back to the hotel. Mike had called to the hotel to verify that they received it. He did all this for a complete stranger that had interrupted his morning coffee. I thanked him and asked him to send me his address so I could repay him. He declined and said he would look me up if he ever made it to Baltimore. I am so used to turning on the 11 o’clock news and reading the newspaper to find stories of how bad this world’s inhabitants treat each other. It seems that everyday someone finds a new way to make us sad to be human. I wanted to recount this story to counter some of those. I was truly touched by what Mike did. I was happy to get my phone back but much happier to see that selfless people still exist in our world. I left Seattle not only with new friends and new knowledge, but also with a new outlook on the human condition. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "My First Conference"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "My First Conference"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kevin Doory\n          \n            Kevin Doory"
}