{
  "url": "https://moz.com/blog/my-first-true-grey-seo-technique",
  "slug": "my-first-true-grey-seo-technique",
  "title": "My first true grey SEO technique... - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Ok... Here's my first grey technique that I attempted last week for one of our site (not to hard to guess which one). Our company was confronted with the following elements:\n-Dire need to start growing our community on a young domain and newly started blog-Virtually no money to spend on it, only…",
  "content": "My first true grey SEO technique... Social Media E By: Ella_D June 22, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! E By: Ella_D June 22, 2006 My first true grey SEO technique... Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Ok... Here's my first grey technique that I attempted last week for one of our site (not to hard to guess which one). Our company was confronted with the following elements: -Dire need to start growing our community on a young domain and newly started blog-Virtually no money to spend on it, only precious planned time from actual employees-No knowledge of any kind for viral marketing but a strong desire to achieve results-No plugs, no previously built PR relations with any of the major French news platforms (Scoopeo, Fuzz, Nuouz) that are digg-like platforms-No idea how to make it to the First page fast enough to generate decent resultsSo we wondered... what do we have to offer to the community? We can offer our core knowledge... But should we share it with everyone or keep that inside the company as \"competitive intelligence\"? I think I would never have been invited to this great blog if I would hesitate on questions like this :). Here's what we did to score a good 500-1000 visitors with our 1st attempt and start getting some comments, new subscribers and steady inbound links: -Bring 20++ reliable and Internet active friends / employees / collaborators into the fold. -Every time you post a WORTHY comment (I need to insist of the word WORTHY) and you want it to be read by many people, simple paste a link of your post and email it to that 20+ list and gently ask them to go and read your post... and tag it / comment it... (a greyer technique would be to mention that you can vote twice; once being logged and one being unlogged --> I hope they correct this someday and just put plain IP).-Ensure that your team successfully tag your news fast enough so it goes to the First page-Tune your team and your posts so they are getting to the First page at a time where there is the highest traffic on the platformResults: Fast enough, your news will reach the front page... and if the timing is great, you can score thousands of visitors, especially for the American market with Digg. What makes this technique grey is that the \"viral marketing team\" is a little bit abused, but it's a good start if you got to do some guerilla marketing. Any thoughts? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "My first true grey SEO technique..."
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "My first true grey SEO technique..."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ella_D\n          \n            Ella_D"
}