{
  "url": "https://moz.com/blog/my-fantasy-baseball-addiction-parallels-why-i-love-seo",
  "slug": "my-fantasy-baseball-addiction-parallels-why-i-love-seo",
  "title": "My Fantasy Baseball Addiction Parallels Why I Love SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Two years ago a friend introduced me to fantasy baseball (rotisserie style of course), and needless to say, I've been hooked ever since.  As I logged in last night to check my auto-drafted selections (and my wife exasperatingly asks why I am on the computer for the 14th hour in a row), I started to…",
  "content": "My Fantasy Baseball Addiction Parallels Why I Love SEO Public Relations By: KoMarketing Associates March 3, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: KoMarketing Associates March 3, 2007 My Fantasy Baseball Addiction Parallels Why I Love SEO Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Two years ago a friend introduced me to fantasy baseball (rotisserie style of course), and needless to say, I've been hooked ever since. As I logged in last night to check my auto-drafted selections (and my wife exasperatingly asks why I am on the computer for the 14th hour in a row), I started to think about what makes this game so much fun to me and it occurred to me that 'Yes', there are a lot of similarities between the game of fantasy baseball and working in SEO. Here are some of the correlations (and please tell me if I am way off base here – pun intended): It's All About Being At The Top As with any fantasy sports game, the goal is to finish in first place, and in the fantasy season you see your position/ranking (anywhere from first to last), day in and day out for nearly 180 days! Each day is another scoring opportunity and you need to figure out what the best strategies are to win, to place at the top of the list, when early October comes around. In most leagues, it's a long-term process where you pick and choose players to compliment your team's overall strengths and weaknesses and make adjustments as needed. You should be identifying what the teams ahead of you and immediately behind you are doing, so that you can take advantage of their weaknesses, understand their strengths and outperform them in the end. From the SEO perspective, while I practice getting a portfolio of good keywords for a client, designed to drive traffic, quality visits and leads, there is almost nothing as satisfying as doing that with top keyword rankings. It's part of the challenge and satisfaction that I get from working in search engine optimization. However, we know that it does not happen immediately and I am always talking to the client about creating long-term strategies for solid SEO results. Which in turn requires you to look at... Statistics and More Statistics I don't think there is another industry like Major League Baseball that has more freely available, unbiased statistics, which are used at all levels of the game, both fantasy and reality (See Moneyball - the data analyst's dream). There are 162 games with at least 27 at-bats per game/per team (a minimum of 4,374 at bats per team in a season), mixed with on-base percentages, strikeout to walks, hits with runners first and third with two outs and a left-hand pitcher, in his first year, etc etc (you get the picture ;-)). The reality is that statistics help the fantasy baseball player understand who really is performing, who is underperforming and who is hurting or helping your team. Did that batter strike out four times last night? Statistics help uncover a pattern in performance, meaning: is 4 strikeouts a typical evening, or was he facing a top notch pitcher who had his number? Data drives SEO as well, in terms of understanding how keyword rankings are performing in relation to sales and leads. Analytics also uncovers if the content you created is appearing in strategic search results, or getting traffic from social media sites or industry publishers. As the internet marketing industry overall has evolved, marketers are getting a better opportunity to track ROI, pinpoint how visitors accessed their site and identify what keywords are driving conversions. There Are Factors Involved in Being Successful One of the most striking (no pun intended) similarities is how the fantasy baseball player needs to understand what statistics matter the most and tailor their strategy to optimize appropriately. Last year in our league, walks counted for two categories of pitching performance, versus only one the year before. That meant that I wanted pitchers who pitched more efficiently (not walking batters), even though that may sacrifice how many runs they gave up per game. Of course in SEO, we also need to take a look at a series of factors involved in attaining a good search presence, whether that is linking, content, website usability, etc. It's important to remember that what succeeds in Yahoo doesn't always translate to success in Google. In addition, when we take a look at the factors creating success for our competition, it helps identify strategic SEO initiatives for my clients as well. Yes, You Can Game The System I don't do this (or just haven’t been invited), but I know some competitive fantasy baseball players who like to get together offline and make moves (trades and the like) specifically designed to take down another player, block a transaction or move someone else up in the rankings. All in the sport of the game I suppose, but... If You Get Caught Cheating, You're Sure To Get BlackListed It's pretty difficult to cheat, because it's not like any of the fantasy baseball players actually control what happens on the field, but I have seen players try to make unfair trades, or take advantage of an unsuspecting player. Last year, a \"want to be savvy\" player logged into someone's account (who had essentially given up midway through the season) and created a completely unfair trade in his favor. Of course just like duplicate content, cloaking or some other technique designed to manipulate search engines, once it was realized what had happened, that player was suspended from the game, and not invited back. You have to know the rules and codes of conduct with the game, and know that there are penalties for breaking them. Is This Too Far Reaching? Finally, while I couldn’t really tie anything in fantasy baseball to link building, I did consider this relationship to viral marketing efforts: Sometimes you just come across a player, prospect or trade that just works out well - statistics and history aside. No one could have thought that Jonathon Papelbon would set the rookie record for saves in Boston at the beginning of last season, or that Derrick Lee would go down one month into the season after making a bid for the home run title just one year ago. As SEO's we want to create content designed to attract links, traffic and ultimately improve rankings, feeding that information to sites such as Digg, Reddit and the like. Sometimes you don't get it right and other times you hit one right out of the park. Final Thoughts Here in New England, I'm looking forward to the fact that Spring is around the corner and a revamped Red Sox team in good shape for a playoff run. And while I'll be thinking about keyword rankings, link building strategies, traffic and reporting data and the goal of seeing my clients at the top of Google, I'm also thinking about that prospect out in Colorado and that pitcher being converted to a closer in Boston that could help me fill some holes in my roster as I try to defend my 2006 title. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "My Fantasy Baseball Addiction Parallels Why I Love SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "My Fantasy Baseball Addiction Parallels Why I Love SEO"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "KoMarketing Associates\n          \n            KoMarketing Associates\n          \n            KoMarketing Associates"
}