{
  "url": "https://moz.com/blog/my-give-it-up-presentation-from-smx-advanced-in-blog-format",
  "slug": "my-give-it-up-presentation-from-smx-advanced-in-blog-format",
  "title": "My \"Give It Up\" Presentation from SMX Advanced in Blog Format - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In June of this year, I presented on the \"Give It Up\" panel at SMX Advanced. Although some of the material shared by panelists during that session was gray and black hat, my presentation was nearly entirely white hat, and I think that these tips should prove valuable for anyone in the SEO industry.…",
  "content": "My \"Give It Up\" Presentation from SMX Advanced in Blog Format Moz News By: Rand Fishkin July 29, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 29, 2008 My \"Give It Up\" Presentation from SMX Advanced in Blog Format Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In June of this year, I presented on the \"Give It Up\" panel at SMX Advanced. Although some of the material shared by panelists during that session was gray and black hat, my presentation was nearly entirely white hat, and I think that these tips should prove valuable for anyone in the SEO industry. This presentation was broken into 3 parts, and I'll maintain that segmentation here on the blog. #1) Searching for Links In this section, I walked through many query parameters and operators, along with advanced combinations of searches to illustrate how they could be applied to a link acquisition campaign. Basic searches applied to link acquisition: The related command at Google Use to identify sites that are most connected with your own, or, more valuably, your competition. The intitle parameter Find sites and pages that focus directly on your keywords (or include phrases like \"add url,\" \"suggest a site,\" etc.) The inurl parameter As above The intext parameter (and how it's possibly broken) I showed a few screenshots here to illustrate a query that returned a single result for the \"intext\" search, but then said that the terms were only found \"in links pointing to the page.\" When I tested without \"intext,\" pages appeared that had the terms on the page... Who knows? This inconsistency of this parameter lead me to believe it's not particularly accurate or useful. The inanchor parameter Sadly, as with intext, it appears that inanchor produces inconsistent and generally useless results Using the \"allin\" series To save time with multiple intitle/inurl queries, you can use allin, but beware because it won't combine with other parameters Wildcard usage in searching Using the * in queries serves as a wildcard, so you can see all the pages that contain a particular phrase missing a keyword, e.g., top * ways to, the best of *, submit your *, etc. Temporal-based searching I really like temporal searches in Google for competitor brand names and for link submission searches like \"suggest a site\" site:edu for the past 60 days. Linkfromdomain on MSN/Live Using this query, you can see all the domains that a given domain has links out to - linkfromdomain:seomoz.org Competitive links searches: There's a false assumption that only Yahoo! Site Explorer offers link information - not the case! There's a number of sites that show link data (granted, Yahoo!'s still the best). Yahoo! Site Explorer - example Yahoo! Link & Linkdomain - example Google Blogsearch Links - example Exalead Links - example Alexa Links - example Technorati \"Reactions\" Links - example Link searches with a specific region - example (you can also use europe, africa, asia, centralamerica, downunder, mediterranean, mideast, northamerica, southamerica, southeastasia) credit to Ann Smarty for the list Experiments in Advanced Queries: LinkfromDomain + Linkdomain First use linkfromdomain at MSN/Live, then to find where those links are coming from on the domain, use a linkdomain:domain.com site:sourcedomain.com - example. Pages in order of importance We've talked about this in the past, but using a query like inurl:www site:seomoz.org will give you list of pages ordered generally by importance (it's not perfect, but still good for finding important pages on the domain). You can also try inurl:tld (like \"com\" or \"org) +site: and you should always use &filter=0 in the URL string on these to get accurate results. Brand mentions with no links At Yahoo!, try a brand search plus a negative linkdomain, e.g., \"seomoz.org\" -linkdomain:seomoz.org to find people who've mentioned your brand/site but haven't provided a link. Linking to multiple competitors but not your site This is one of my favorites - you can see who's linking to 3 or 4 competitors on a single page, but doesn't have a link to you. Oftentimes, these are prime spots for link requests or submissions - example. Competitor domain + \"add url\" style searches Who's linking to your competition and also has the text \"add url\" or \"suggest a site\" on their page - those are probably prime targets for link building - example. Keyword + inurl \"directory\" style searches If the word \"directory,\" \"resources,\" or \"links\" is in the URL, your chances for finding a link opportunity are pretty high. Adding your keyword just enhances the chance of an on-topic link source - example. Shameless Plug: If you haven't tried SEOmoz's Juicy Link Finder Tool, it's pretty darn good for this kind of thing. You can use basic searches or try some of the more advanced ones above (particularly those that are likely to produce results where you can submit or suggest a link) and get a list that can be re-ordered by domain PageRank or domain age, then be taken to SERPs that contain likely link sources on those sites. Tracking Manual Link Building Efforts: My favorite tactic here is to create a new, nonsense word or use a phrase ordering that's particularly unique and drop that wherever I perform manual link building. I can then search for that term/phrase-in-quotes and see all the pages that each of the engines have spidered that contain my link building efforts. It's a very handy way to show off your link building work in an SEO contract, too. NOTE: My blog posts A Long List of Link Searches and the older A Long List of Competitive Link Searches are both good fodder to continue along this route. #2) Google Local Ranking Tips In this segment of my presentation, I went through a list of factors ordered by personal opinion of most important to least important for earning high rankings in the Google Local SERPs. Register with Google Local (and use your business type in the name you register with, e.g., \"Cascadia Restaurant\" rather than just \" Cascadia\") Be \"close\" to Google's perceived \"city center\" Have a high number of local reviews (in Google Local itself) Get links from other local sources (other sites/directories in your area code) Have a local phone number Participate in online menu services (for restaurants; the ones Google uses most appear to be Zagat, AllMenus, Menutopia & Menupix) Get good ratings in your local reviews (surprisingly, though, more reviews, even with low ratings, appear to carry more weight than good reviews but few ratings) Get your city name included in the anchor text that points to your site Get listed in the non-Google directory sources the engine uses (Gayot, Zagat, Citysearch, Lilaguide, Superpages, etc.) Include your address on your site's pages in spiderable, HTML text Use your keywords/city name in your business name Build up domain authority and PageRank NOTE: IMO, this was a poor man's version of a project David Mihm (who was in the audience and probably thought my advice was amateurish compared to his vast local ranking experience) completed a few weeks later - The Local Search Ranking Factors. #3) Reputation Tracking Queries These are the actual queries I use on a regular basis (not as regular as I'd like, but I'm trying) to keep up with who's talking about or linking to SEOmoz on a daily basis. I think that, taken together, they give you remarkably good insight about where your brand is going on the web and how it's being perceived. Google Web Search (with 24 hour temporal specificity) - example Google Blog Search (ordered by date) - example Google Blog Search for links - example Google News Search - example Technorati Broad Search - example Technorati Link Search - example Shameless Plug #2: SEO Analytics is a really good service for watching the counts of these types of queries as well as indexing and displaying link numbers over time (and all you have to do is plug in the sites you want to watch). Summize/Twitter Search - example Blogpulse Search - example Whew... I covered a lot in 7 minutes on stage, eh? Actually, to be fair, I think I took almost a full 10, even though I boasted that I'd be through within the time limit (oh, that cardinal sin of pride). At the end, I also gave one entirely black hat tactic, though I think it could be useful to know as a white hat. I noted that by pointing the DNS of a very naughty/banned site to another domain, that site on the receiving end would sometimes inherit the penalty and be tossed out of the index (or made to rank at the back of the results for most every query). The folks who showed this to me noted that it only worked some of the time and only when the domain being pointed to was relatively low on the domain authority scale (few inbound links, not much trust, etc). When I observed it in action, I got the same sense. Also - since it's passed the 30-day window after SMX Advanced, it's entirely possible that Google has closed this loophole. Hopefully this has been valuable - I know I talked pretty quickly up on stage, so perhaps this can serve to help all those who gave up on taking detailed notes :-) For those who are interested, here's the downloadable PPT file (warning - it's 5.5MB). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "My \"Give It Up\" Presentation from SMX Advanced in Blog Format"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "My \"Give It Up\" Presentation from SMX Advanced in Blog Format"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}