{
  "url": "https://moz.com/blog/my-own-personal-approach-to-online-reputation-management",
  "slug": "my-own-personal-approach-to-online-reputation-management",
  "title": "My Own Personal Approach to Online Reputation Management - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Let me start off my stating that while this post is obviously geared towards online reputation management, it is not focused on handling negativity in the search engines. While this issue is of incredible importance, my main focus here is total online reputation management and not doing SEO to…",
  "content": "My Own Personal Approach to Online Reputation Management Reputation Management D By: Dana Schumacher April 28, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! D By: Dana Schumacher April 28, 2009 My Own Personal Approach to Online Reputation Management Reputation Management This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Let me start off my stating that while this post is obviously geared towards online reputation management, it is not focused on handling negativity in the search engines. While this issue is of incredible importance, my main focus here is total online reputation management and not doing SEO to remove the negative content in SERP’s. Additionally, I am discussing online reputation management in terms of companies/businesses and not necessarily on a personal level. However, much of this content will apply to managing your personal reputation as well. I’m going to go through some very basic steps with not a whole lot of detail. This is mainly to encourage discussion on the topic (and also because I could write about this for hours, but who would want to read that). Let me begin by expressing the importance of online reputation management in simplest terms (which is safe to assume we all know). Your prospective customers/leads are online. Your prospective customers do research. Your prospective customers talk to other people. What your prospective customers hear from other people has great influence on their buying decision. When you have a bad reputation, bad things happen to your business (I’m so smart…I know). So ORM is important. Very important. Here are the steps I follow in order to handle negative issues with the companies I am involved with. Know What to Monitor: Company name/brand (make sure to include any possible misspellings). You’d be surprised how much people can butcher your name. Product names & product types – for instance, if you sell “Cold as Ice Peppermint gum,” make sure to monitor “gum” and “peppermint gum.” This creates a great opportunity for your product. (Bad example, I know. It’s late afternoon over here on the east coast and is sunny and 85 degrees outside. I’m done using the creative side of my brain for now.) Vendors/Partners – If something bad is said about these guys, it can have a negative effect on your business as well. Employees – primarily top level executives and others in the media. Competitors – what a golden opportunity to illustrate why you’re better. Related Sites/Industries – if someone insulted SEO as an industry (why would someone do such a thing…right?) it has great potential to have an effect on your SEO consulting business. Where to Monitor: Your own company blog/forum - people seem to find commenting on your blog as a nifty way to complain. I think it is too. Blogs and forums across the internet – this is a given. Social Media – the usual suspects we all know and love (Facebook, Twitter, etc.). Search Engines – the usual suspects we all know and usually hate. Reviews – Google, etc. Other sites – primarily complaint-related sites. How to Monitor: Google Alerts – set up alerts for company-related words, product names, employee names, etc. I think we all know how this works. Staying up-to-date with your own blog and comments associated with it. Check your comments every day, multiple times a day. Search engines. Just in case GA doesn’t catch it, do a little research on your own. Blog feeds. Just to be on the safe side. Ways to Engage/Resolve: Try to get in touch with the person who made the complaint/accusation. This can be difficult depending on the person’s desire to remain anonymous and your desire to not look like a stalker. If it is a blog post, provide your name, your company name, and the phone number & email in which you can be reached. Express your concern with the issue and desire to resolve it. When I’ve done this I’ve had nearly all blog/forum complaints resolved (there haven't been many! I swear!). If it is a significant issue, address it in your company blog. Express the problem, apologize for the problem, and explain how it is being taken care of. Make sure you thank them. If it is an especially significant issue, break out your PR best practices book and get the press release started. It says a lot about you and your company that you are willing to accept responsibility for the issue and want the public to know about it. Once again, explain how it is being resolved. Mention the issue in your company-related social media sites. Well, that wraps it up. Maybe it doesn’t wrap up online reputation management entirely, but it wraps up my own basic approach to it. What are your steps? How do you monitor? Perhaps we can put our heads together and create the ultimate approach to reputation management? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "My Own Personal Approach to Online Reputation Management"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "My Own Personal Approach to Online Reputation Management"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Acknowledge and Cope with Fear of Local Business Reviews"
    },
    {
      "level": "H3",
      "text": "Celebrating Canada’s Small Business Month With Sustainable Local Biz Tips"
    },
    {
      "level": "H3",
      "text": "Takeaways from an Irish Locksmith Listing Spam Scandal"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dana Schumacher\n          \n            Dana Schumacher"
}