{
  "url": "https://moz.com/blog/my-story-how-psd2html-worked-to-have-a-manual-penalty-revoked",
  "slug": "my-story-how-psd2html-worked-to-have-a-manual-penalty-revoked",
  "title": "Case Study: How We Removed a Massive Manual Google Penalty in 5 Steps - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When it comes to getting a manual penalty revoked, the process is as much art as it is science. Anna Korolekh of PSD2HTML shares their journey in removing a massive penalty, dealing with the Google Webspam Team, identifying what worked and what didn't, and offers some key takeaways from the process.",
  "content": "Case Study: How We Removed a Massive Manual Google Penalty in 5 Steps Link Building | Search Engines | Advanced SEO By: Anna Korolekh November 4, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Anna Korolekh November 4, 2015 Case Study: How We Removed a Massive Manual Google Penalty in 5 Steps Link Building | Search Engines | Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. When I joined the PSD2HTML team in November 2014, the site had been suffering from a manual penalty related to spammy backlinks for over a year. They'd tried everything to promote a recovery, but nothing worked. They were ready to admit defeat. The penalty resulted in the loss of over 80% of their organic traffic. The story of how this happened is very interesting. PSD2HTML was one of the first companies to market PSD to HTML conversions in 2005. At the peak of their success, they transitioned to an SEO company. In 2013, our relationship with a well-known agency resulted in a manual spam penalty. The following is a screenshot of what this looked like: Recovering from the penalty was a very painful process. There were two in-house marketing departments that hired several agencies to analyze over 2,500 linking domains. They spent a year and a half trying to remove the penalty, which included submitting numerous reconsideration requests that failed. Since we finally had the penalty revoked, we wanted to share our experience with other companies, website owners, and SEOs that might be suffering from the same problem, and include some useful tactics for removing penalties. It is also important to give credit to our outstanding consultant who helped us overcome the disaster. Step 1: Create a master penalty removal sheetThe first thing we did was to collect all incoming links pointing to PSD2HTML.com. We then created a master spreadsheet that we could work through to identify possible artificial links. This process involves the following steps: Download all links from Google Search Console, using the process described here Supplement with links from Majestic.com Sort them by root domain using a simple Excel process from Distilled that can be found here This may sound simple, but it's not. It's important to start with the right data. While it is helpful to have multiple link sources, Google Search Console data is key. Step 2: Identify links that Google sees as artificialTypical unnatural links can include articles, link directories, bookmarks, blog comments, malware, guest posts, and scrapers. They include anything where the content exists primarily to influence rankings more than offering genuine content. PSD2HTML.com had very few of these types of links. This is possibly one reason why the penalty had been around for so long. There were some possible unreliable link directories in their link profile. However, there were very few keyword-stuffed submissions or guest posts with links for rankings. It was important to identify the artificial links. The theory of primary intentionPenalty write-ups typically list types of links that need to be removed. However, as link building methods continue to evolve, the potential types of unnatural links are unlimited. It is very helpful to identify the common denominator for all artificial links, which is the primary intention. If the primary intention of a link is to influence rankings, then it is artificial. We went through all linking domains in order to develop a list of some interesting link types that fit this description. Despite our previous attempts, we could not access previous responses to reconsideration requests. As a result, no sample links from Google were available. Therefore, we had to start from scratch. Giveaways PSD2HTML had a number of links from giveaway promotions, where users could leave comments in return for a chance to win paid services. Paid reviews of services have a long history of being seen as unnatural by the Google Webspam Team. However, it is not necessarily artificial if a company wants to run a giveaway. Since these giveaways didn't have the primary intention of gaining links to influence Google, we decided to keep them. Again, it wasn’t that simple. In the case of at least one giveaway, the page had a genuine intention and also contained specific links with artificial elements. For example, here are two links to PSD2HTML.com that appeared on the same page: - “The world’s first and finest PSD to HTML conversion company, PSD2HTML®, is giving away $400, $300 and $200 worth of services!”- The leading PSD to HTML slicing service has made outstanding changes to the way they do business and provide services. These two links are bolded here, but not linked, as one of them was artificial. I'm sure that you can guess which one. The first one was a genuine reference to the company name. The second one was a keyword phrase. Therefore, the giveaway was not artificial, but the keyword link was. In order to deal with this situation, we kept all of the giveaway links and the domains they were featured on. We drilled down to any pages that also had artificial keyword links and disavowed them individually. When Google denied our first request, none of the sample links were giveaways. We therefore inferred that we’d gotten this one right. Keyword footer linksPSD2HTML had some sites where they’d done conversion work and gained a keyword link at the footer of the site. This brought up the question as to what degree design firms can legitimately place footer links on client sites. John Mueller talks about this here. The intention idea proved useful here. In one instance we noticed, the actual brand wasn’t linked, but the keywords were linked, so they were assumed to be artificial. Sponsor and advertisement linksSponsor links were absolutely fine. We thought sponsor links (not quite sponsored links) could be artificial and wondered if they’d be identified as artificial. However, these were genuine sponsors, so we left them and it worked out fine. We also found that image ads were fine. However, they usually only showed up in Majestic data and not in Search Console. Therefore, there wasn't a problem. Keyword articles, link directories, bookmarks, malware, and scrapersThere were some submission sites with keyword links and the sludge of scrapers that were added to the disavow file. However, the rest of their profile looked clean, so it was submitted. Step 3: Submission to and response from GoogleOur penalty removal consultant had a proven record of eight penalties getting revoked on the first try. Unfortunately for us, after our submission the Webspam Team returned the following three sample links: http://www.tuicool.com/articles/UV3QZf https://www.campaignmonitor.com/forums/topic/5542/html-dev-required/ http://ibartolome.blogspot.com/2012_01_01_archive.html Interpreting Google sample linksThe sample links that Google provides in response to reconsideration requests aren’t just samples. The Webspam Team shows you specific link types that still need to be removed. If you can identify the underlying link types provided by Google, it is possible to look through the link data again and find those link types. Step 4: Identify links that Google sees as artificial from sample linksWe thought the three sample links from Google were unusual. This penalty was interesting because the Webspam Team seemed to be highlighting possible new variations of artificial links. These link types appeared regularly and it looked like they were here to stay. Sample link type #1: Chinese duplicate translation linksThe first such link was a Chinese news site. In the past, it had been possible to clear penalties without similar foreign sites causing problems. These sites were posting verbatim articles from SmashingHub. While the URL included the source (http://smashinghub.com/10-best-online-resources-to-convert-psd-to-xhtmlcss.htm?utm_source=tuicool), Google had identified it as an artificial link. We again went through the links looking for duplicate Chinese pages. This was easy to do with the English ones. However, most of them were not duplicate translations. This article was a duplicate of http://creativeoverflow.net/top-15-psd-to-html-services-to-use/ that was translated into Chinese. This made it more difficult to identify. Although it is tempting to judge a link only based on a language, countries with non-Western scripts form a massive part of the web, and can also offer genuine links to a site. We wanted to keep any genuine links using the primary intention idea, regardless of country or language. This is an example of a genuine link with no duplicate issues: http://www.rysos.com/bbs/redirect.php?fid=49&tid=7586&goto=nextoldset. I identified duplicate Chinese links by searching for English keyword phrases. For example, most of the duplicates featured English website names. Therefore, by Googling “PSD2HTML\" \"CSS Chopper\" \"Direct Basing,\" it was possible to identify the original English post. Sample link type #2: Brand name used as keywords with genuine intentionSeeing https://www.campaignmonitor.com/forums/topic/5542/html-dev-required/ marked as artificial was frustrating. This is a forum post link that was given completely genuinely. However, the link text was “PSD to HTML.” It was used legitimately as a brand name that was rewritten with the number 2 in PSD2HTML converted to the word “to.” There were some giveaway links above with some artificial links using “PSD to HTML” as a keyword phrase to influence Google. Those links were artificial. However, the use of “PSD to HTML” was not artificial since the underlying primary intention was completely genuine. How do you deal with a genuine link that is marked as artificial due to brands listed as keywords? In order to solve this problem, we called Google out on artificial links. In our second reconsideration request message, we argued that while the link text consisted of keywords, they were used as a completely genuine reference to a brand. Therefore, the act of identifying the link as artificial was in itself artificial, since the link itself was entirely genuine. The frustration of having a genuine link marked as artificial became a tool to add weight to our argument and conversation with the Webspam Team. They regularly respond with sample links that can be argued to be genuine, or are already in the disavow file. These sample links are very important. They can be used in your next presentation to the Webspam Team. Sample link type #3: Financial offer to influence linksThis link was very obscure. However, it could be seen as artificial. It was impressive how the Webspam Team isolated this one link type. This link was in Spanish: http://ibartolome.blogspot.kr/2012_01_01_archive.html The writer reported receiving an email offering a Christmas promotion. They would receive $50 off of their next order from \"our friends P2H\" (P2H.com redirects to PSD2HTM.com). There was a subtle, but important, difference between this link and the giveaways. Although the giveaways were promotional, they did not appear to be directly created with the intention of gaining a link. In the email, PSD2HTML offered $50 on their next order to bloggers with whom they had no previous relationship, which raised questions about their motivation. The \"influenced-recommendation-tone\" became clearer as the post continued. This indicated that the emails were sent in order to gain links. We searched for similar links and found one more. This type of task can be difficult when there are many easy-to-spot, low-quality links. The standard artificial link types were largely irrelevant. The process of searching for the links that matched the exact link types implied by the Webspam Team’s three sample links took real precision. Step 5: Second submission and response from GoogleWe submitted this work with our explanation to Google and received a very quick response. Image credit: Comics Alliance Euphoria. Penalty revoked. A note on emails and outreachWe didn’t send any emails to get the penalties removed. There are a number of differences between only using the disavow tool and also using manual outreach. We had the following findings about the use of email outreach: Email outreach is not required to revoke a penalty. Clients and providers often feel they must use outreach to revoke a penalty. This can significantly add to the costs and timeframe. It is possible to commit resources to email outreach. However, it is not true that both outreach and manual action removal are needed. Once you realize this, you can have more control and save time and money. Google penalties are a psychological phenomenon. Therefore, getting the “No manual webspam actions found” message showing quickly is very important. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Case Study: How We Removed a Massive Manual Google Penalty in 5 Steps"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Case Study: How We Removed a Massive Manual Google Penalty in 5 Steps"
    },
    {
      "level": "H2",
      "text": "Step 1: Create a master penalty removal sheet"
    },
    {
      "level": "H2",
      "text": "Step 2: Identify links that Google sees as artificial"
    },
    {
      "level": "H3",
      "text": "The theory of primary intention"
    },
    {
      "level": "H3",
      "text": "Giveaways"
    },
    {
      "level": "H3",
      "text": "Keyword footer links"
    },
    {
      "level": "H3",
      "text": "Sponsor and advertisement links"
    },
    {
      "level": "H3",
      "text": "Keyword articles, link directories, bookmarks, malware, and scrapers"
    },
    {
      "level": "H2",
      "text": "Step 3: Submission to and response from Google"
    },
    {
      "level": "H3",
      "text": "Interpreting Google sample links"
    },
    {
      "level": "H2",
      "text": "Step 4: Identify links that Google sees as artificial from sample links"
    },
    {
      "level": "H3",
      "text": "Sample link type #1: Chinese duplicate translation links"
    },
    {
      "level": "H3",
      "text": "Sample link type #2: Brand name used as keywords with genuine intention"
    },
    {
      "level": "H3",
      "text": "Sample link type #3: Financial offer to influence links"
    },
    {
      "level": "H2",
      "text": "Step 5: Second submission and response from Google"
    },
    {
      "level": "H2",
      "text": "A note on emails and outreach"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Anna Korolekh\n          \n            Anna Korolekh"
}