{
  "url": "https://moz.com/blog/my-twitter-experiment-at-seomoz-training",
  "slug": "my-twitter-experiment-at-seomoz-training",
  "title": "My Twitter Experiment at SEOmoz Training - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I wasn't able to attend SMX Advanced this year.  This really bummed me out.  So I followed the event online and gleaned as much information as I could by following their Twitter hash tag and the multiple live bloggers at the event.  It was awesome!  While I would've much preferred to be in the…",
  "content": "My Twitter Experiment at SEOmoz Training Social Media By: Ed Reese August 27, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Ed Reese August 27, 2009 My Twitter Experiment at SEOmoz Training Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I wasn't able to attend SMX Advanced this year. This really bummed me out. So I followed the event online and gleaned as much information as I could by following their Twitter hash tag and the multiple live bloggers at the event. It was awesome! While I would've much preferred to be in the audience, I got a ton of great information from the event from the comfort of home. Fast forward to the SEOmoz Advanced Training. I decided to pay it forward by being one of the folks who tweeted the hell out of the event. At least that was my hope. There's always the risk that a barrage of tweets will kill your following. Well, I decided to dive right in and see what happens as well as measure and track my actions and results so I could put some sort of value to it. You should know a bit about my background I am not a Twitter power user or social media powerhouse. Sure, I try to stay on top of what I need to know to understand the industry and make good recommendations. However, for the purposes of this post, think of me as your typical client. Before the conference I had 148 followers. That's not even enough followers to get a job a Best Buy. I typically Tweet 2-3 times a day about SEO related articles that I think will be interesting to my SEO peers, clients, and prospects. I haven't really thought of Twitter as something to use for my own business strategy so far. It's been pretty dang organic. When online goes offline it's awesome! Dr. Pete wrote a great post earlier this year about the real power of Twitter. It was about Twitter's power to transforming online connections into real-world relationships. I believed him, but didn't experience it until this conference. Let me explain. Like many of you, I'm not the most extroverted person at conferences. I typically meet a couple of people over the course of an event and call it good. Over time I've developed some really good industry friendships this way, but at a snails pace. Once I started Tweeting, though, things got crazy. I was getting DM'd me to meetup at the events. I got recognized by people when I introduced myself. \"Hey, your the guy Tweeting the event, aren't you?\" It made socializing much easier. I think it also got me out of my shell a bit. I found myself walking right up to people and starting conversations (which is very unlike me). I met no fewer than 30 people (a 10X improvement to any other conference I've attended). But more importantly, I enjoyed some great conversations, made connections with people I'll be contact with in the future, and had a blast. By the numbers 48 # of Tweets sent during the conference 40 # of times re-tweeted 54 # of followers gained (a 35% increase) 240 Percent increase in web site traffic vs average 225 #of links clicked in tweets 26 # of re-tweets of my most popular tweet: Add a \"+\" to the end of any bit.ly link to get almost real time analytics. \"Sweeeeeet!\" #seomoz 4 # of followers that dropped me during my #seomoz barrage What does it really mean? I don't think the numbers by themselves are necessarily all that important. But, a few things bubble to the surface. The first is that I was re-tweeted and thanked by several power users and business owners in Spokane. Since most of my business is local, I think it's great for a number of a variety of reasons (trust, recognition, etc.). But it's also nice to let them know that you are associated with great work. I Tweeted a link to David Mihm's 2009 Local Search Ranking Factors as he was getting peppered with questions about local search. That link was clicked 159 times in about 15 minutes. People wanted the info and it was cool to provide the link and see it go somewhat viral. But as a contributor to the 2009 LSRF it was also nice to show my local followers that I'm part of a piece of work that's so respected and appreciated in our industry. But just like Dr. Pete said in his post, the most important aspect is taking the online offline and meeting in the real world. There are already plans in the works to invite folks to Spokane to participate in local seminars, travel to other SEO's home towns to do the same, collaberate on projects, and help each other out with questions from time to time. It expanded my professional community like never before. It was awesome! But is Twitter really responsible for all of this? Probably not. Much like clients that try to tie a direct correlation between Twitter traffic and sales, it's a tough one to measure. But I can tell you this. It helped push me beyond my comfort zone and meet some amazing people. I'd recommend giving it a try. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "My Twitter Experiment at SEOmoz Training"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "My Twitter Experiment at SEOmoz Training"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ed Reese\n          \n            Ed Reese\n          \n            Ed Reese"
}