{
  "url": "https://moz.com/blog/my-top-three-mozinar-takeaways",
  "slug": "my-top-three-mozinar-takeaways",
  "title": "My Top Three Mozinar Takeaways - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Much has been written about the tactical takeaways from the mozinar this year. There was certainly no shortage of material presented, including websites to visit, tools to use, and practices to employ.  I’m sure for the most advanced SEOs it was just another soaking up of valuable data, but for me…",
  "content": "My Top Three Mozinar Takeaways SEO Events By: Chris Snipes September 21, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Chris Snipes September 21, 2010 My Top Three Mozinar Takeaways SEO Events This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Much has been written about the tactical takeaways from the mozinar this year. There was certainly no shortage of material presented, including websites to visit, tools to use, and practices to employ. I’m sure for the most advanced SEOs it was just another soaking up of valuable data, but for me it was like being tossed into the deep end of a very, very big pool. I've spent considerable time over the last couple of days reflecting on the event and trying to determine what my top takeaways were. Unfortunately, actually thinking proved to be a difficult thing to do, so I decided to join Matt Cutts on his meditation experiment. This helped a lot, and after giving my brain a good rest, I was able to clearly identify the three things that affected me the most. Somewhat surprisingly, none of them had anything to do with SEO. Of the things I was exposed to, the three most valuable to me were: Be Open - Since I started following SEOmoz probably four years ago, and having watched the DVDs, I'm frankly shocked at how open Rand is with information, and how much he reaches out to his customers and potential customers. He returns emails from people he doesn't know (including me). He shows legitimate care and even a need for opinion. I commented to another attendee that SEOmoz’ investors probably cringe whenever Rand speaks to groups because he gives away far more information than most business owners would, he praises the competition too much, and he spends time talking to people when he could or even should be doing other things. I believe that some of this openness is related in part to the bad rap SEOs have gotten. He's a leader in the industry, and I believe he understands that the best way to overcome criticism and build trust is to be open. It works on many levels. Communicate - My second favorite takeaway was the earth-shattering recommendation from Will Critchlow that SEOs should make phone calls. You know, talk to customers, have discussions with them, and learn things that you can’t learn from email. I admit that I personally am guilty of not doing enough of that. Or being open enough for that matter, as Rand is. Act - Tom Critchlow drove home a point with a single black slide and bold white letters; “Just F***ing Do It”. Whatever it is you need to do, whatever it is you intend to do, whatever it is you know needs to be done, just do it. Don't get me wrong, I must have bookmarked 50 websites and downloaded 20 files -- some of the Excel spreadsheets were almost worth the price of admission -- but for me the most valuable takeaways were what I saw were the subtle and true differences between success and super success. - Jeff Hancock PS - reading through this post I realize I could be accused of just trying to curry favor with some of the globes top SEOs. But these really are the things that impressed me the most. And I really did start meditating after Matt Cutts tweeted about it on Wednesday night since I realized I was in deep need of a mental reboot. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "My Top Three Mozinar Takeaways"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "My Top Three Mozinar Takeaways"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Chris Snipes\n          \n            Chris Snipes"
}