{
  "url": "https://moz.com/blog/myspace-madness-the-profile-with-15-million-impressions",
  "slug": "myspace-madness-the-profile-with-15-million-impressions",
  "title": "Myspace Madness - The Profile With 15 Million Impressions - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Ok, so Myspace is kind of a big deal.  I mean, its the 4th most visited site on the internet for God's sake.  Its got something crazy like an average of 35 page views per unique visitor, not to mention its ability to draws its users back so consistently, day after day .   With this in mind, I'd…",
  "content": "Myspace Madness - The Profile With 15 Million Impressions Search Engines By: Dan Tynski April 12, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Dan Tynski April 12, 2007 Myspace Madness - The Profile With 15 Million Impressions Search Engines This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Ok, so Myspace is kind of a big deal. I mean, its the 4th most visited site on the internet, for God's sake. It's got something crazy like an average of 35 page views per unique visitor, not to mention its ability to draws its users back so consistently, day after day. With this in mind, I'd like to discuss two major things on my mind about Myspace.There are 2 major things that I think a little SEO combined with a little Myspace might help us learn. Important information regarding the use of search engines as a navigation tool. Some important information about Google's algorithm, and its preferences. As for number one, I think most people would agree that a navigational search is going to produce extremely low clickthroughs. People using Google or Yahoo as a navigational tool are looking to click through to whatever site they seek easily. Most are probably simply using the Google toolbar as opposed to their address bar, or possibly just using Google search because it is their home page. To this end, someone typing in the keyword \"Myspace.com\" into Google, is expecting to see \"Myspace.com\" as the first result, which they will then click and be immediately taken to the the page they were seeking. There are, of course, 9 more results they could have chosen to click on. But what if it were possible to convince some of those navigational searchers to click elsewhere? What if it weren't even that hard to do, and why don't we have more information about these types of searches? In my opinion, this information is extremely valuable. According to Overture, in the case of myspace.com.....are you ready for this.....there are a staggering 15,124,255 searches done per month. Thats right. 15 MILLION. (That's like, what 3% of America?), and what's more, Google shows a sub result for the search term \"Myspace.com.\" The result is a Myspace User Profile: www.myspace.com/jarvspace. This user's Myspace URL gets between 20-30 million impressions every month. This user has over 40,000 friends. So, just for the hell of it, let's do some really inaccurate math. Let's say that people searching for this term only click on the sub result once every 2,000 searches. (In my opinion, this is an underestimation). In this case, the sub result would get at least 10,000 searches per month. If the conversion were significantly higher, say, once every 200 visitors, the sub result could expect to get 100,000 visitors per month. This could be possible, considering one has control of not only the title (the title of Myspace profiles is always the Myspace URL), but also the description, which is set in your user profile on Myspace, becoming the meta description tag. In the unlikely event that you could actually somehow fool one in 50 visitors to visiting your profile, you would get nearly half a million hits a month. Perhaps this is all very unrealistic.....but how can you not marvel at the possibility of it, especially considering how simple it might be to rank in this space, and how much ranking in this place might be able to tell you. Not to mention, at the very least, your brand/site/person would have the opportunity to catch to eye of millions, and this definitely wouldn't hurt. Which brings us to our next point. If a savvy SEO managed to rank their Myspace profile in this space, what exactly might they be able to learn? SEOs managing to rank their profiles would be able to get a good idea of the clicking behavior of navigational searchers. Is it really true that 99.999% are hellbent on clicking through to the exact page they surfed for, or is it possible to convert a good percentage with a title and description that might pique their interest? In this instance, with Myspace, you would get a fantastic sample size, and could come to some pretty conclusive results about these users' clicking behavior (at least for the Myspace demographic, which in all fairness seems highly distractable). If found to be significant, perhaps the information gleaned from such an experiment might direct you to more carefully manipulate your own websites ranking in the SERPs for your own domain name. In the case of seomoz.org, according to overture, there are 930 searches done a month. The results in the SERPs are as follows: Read SEOmoz, Rank Better | Internet Marketing & SEO - seomoz.org SEOmoz | Google Search Engine Ranking Factors - seomoz.org Style Crunch» Blog Archive » SEOMOZ.ORG - www.stylecrunch.com Rand Fishkin, CEO SEOmoz.org on Flickr - Photo Sharing! - www.flickr.com (hey RAND, what's up?) It would be incredibly easy for SEOmoz to rank for all ten terms. It probably wouldn't be too difficult to control which pages ranked where, just by adjusting they keyword \"seomoz.org\" within their pages. This is a great opportunity for a company to highlight an article or a page, or an idea. By manipulating this, you are essentially telling your users what page is second most important to the home page. An even more interesting scenario might be attempting to rank in your competitors results. Imagine if you could give your customers a reason to choose you over the competition before they even clicked through to your competitor's page. In the case of SEOmoz, result numbers 3, 4, 5, 6, 7, 8, 9, and 10 are all for domains other than SEOmoz.org. Perhaps there's an opportunity to be had here? As for our second point concerning Myspace; In addition to all the potential traffic that might taken, and the possibilities for exposing your brand, website, or self to millions of people, not to mention the important information you might get about the clicking behavior of navigational surfers, there's also a great chance here to run some experiments on Google's ranking algorithm. In the case of ranking a Myspace profile for the search term \"myspace.com,\" there are essentially three major factors that could be manipulated with a degree of precision. The first, obviously, is backlinks to the profile page itself. The second is the use of the keyword \"Myspace.com\" on the profile page, and the third is on page optimization. On page optimization within Myspace is severely limited. Essentially, you have little control over site architecture, and must work within the confines of the templating system they have prepared. Each profile should receive the same benefit of the trust of the domain itself, leaving you the ability to control rankings based mostly just on two factors: The mention of the domain (both on the page and in the title--It would be interesting to see how strongly the title tag might influence these rankings. I expect this would be a major factor). The quality and number of backlinks. You could, of course, run these experiments on your own domain, but the huge number of pages Google has to choose from in ranking Myspace profile pages, and the similar architecture of those pages, presents an interesting scenario for ranking tests to be run. Not to mention, the payout on these type of tests could be great for your brand or business. So, what do you guys think? Is there fertile ground here for gaining some additional knowledge? How about for brand exposure? Who will be the first one to rank their company for \"Myspace.com?\" If you guys like this article, please check out my entry in the Marketingpilgrim.com contest! The 7 Deadly Sins that Hurt You as an SEO or SEM. Go give it a comment and let me know what you think! Also, check out my company's website: www.voltier.com Lastly, keep an eye out for part 2 of Myspace Madness, where i'll talk about the MAJOR security flaws STILL affecting Myspace that make stealing your cookies (and profile) as simple as 1-2-3. In other words...watch where you click. -Dan Tynski Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Myspace Madness - The Profile With 15 Million Impressions"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Myspace Madness - The Profile With 15 Million Impressions"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dan Tynski\n          \n            Dan Tynski\n          \n            Dan Tynski"
}