{
  "url": "https://moz.com/blog/navigate-departments-in-seo",
  "slug": "navigate-departments-in-seo",
  "title": "Navigating Through Departments: The Key to Making Impactful Changes in SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Whether in-house or on the agency side, blockers to success often come from internal site teams or long development queues. The key to making progress comes from two primary avenues: Advocating for SEO through exceptional knowledge of the channel as a whole, and deep integration with internal teams…",
  "content": "Navigating Through Departments: The Key to Making Impactful Changes in SEO Marketing Industry By: Wesley Flippo March 30, 2022 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Wesley Flippo March 30, 2022 Navigating Through Departments: The Key to Making Impactful Changes in SEO Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. SEO is unlike any other digital channel. It does not and cannot live in a silo, while something like a paid search program can be run by a single person with minimal help. From our experience, the biggest deficiency in SEO campaigns is not a lack of understanding of the craft, rather, it’s the roadblocks that occur during implementation and cross-team collaboration. Great ideas can be presented and discussed, but taking an idea from a whiteboard or a slide to actually living on a site where it can impact performance can be difficult. Whether in-house or on the agency side, blockers to success often come from internal site teams or long development queues. The key to making progress comes from two primary avenues: Advocating for SEO through exceptional knowledge of the channel as a wholeDeep integration with internal teams to move projects along The departments that SEO impacts (and how to work with each) With a channel like SEO where progress is not solely achieved by one consultant or advocate for the channel, but from the implementation of recommendations, it’s critical to understand how to navigate through a business to make progress. We break down the departments as follows: Business / MarketingDesign / CreativeDevelopment / EngineeringPR / Thought LeadershipContent Business / Marketing The business and marketing teams are the stakeholders whose resources will be used to execute your SEO strategies. These are the individuals at a company who you must win over to be successful. Ever had an amazing idea only to be squashed by leadership? Many of us have been in that situation at one point or another, so the key is to make the case for SEO. Unlike other marketing channels where ROI can be predicted, it can be difficult to forecast growth for SEO. How do we provide statistical evidence that our strategies will be a driver for success? Although there’s no perfect science, we break down our methodology below: Step 1: Start by quantifying potential traffic gains through ranking improvements by utilizing average click-through-rate at various positions. Step 2: Utilize this data to build a forecast based on investment and potential growth using conversion rate and average order value to predict potential revenue. Step 3: Agree on a reasonable forecast and set expectations with the client. Ensure both parties are on the same page about the opportunity in the vertical to avoid any potential pitfalls, and keep growth conservative. Step 4: Start audit and planning exercises. Our audits serve as the roadmap for success and the forecasting exercise occurs during this phase as a compliment to the strategy. Design / Creative / UX & UI Once your strategy is approved and you’re ready to build out new pages, new sections of the site, or redesign pages, it’s time to consult with the design team. They’ll be the ones to help you move your recommendations from ideation into a design, but that process isn’t always as simple as it sounds. The first issue is not a lack of resources, but the incessant battle between UX (site teams) and SEO. Ever heard any of these statements before? We shouldn’t expand our main navigation because our users want a more simplified approachThis doesn’t meet our brand guidelines as we don’t want any text content on our pagesThese site changes don’t seem to ladder up to our goal of getting people to convertWe can’t change that because our users are used to it that way Although these are all valid statements, they do present an issue with being able to progress and grow organic traffic. SEO and UX need a balance. Finding it can be hard, but necessary. As the advocate for the organic channel, you must always be willing to argue how and why your recommendations can help the business grow. You can do so by providing clear, concise, and effective instructions to design and site teams. We utilize checklist templates to provide to design teams an idea of what needs to be included with examples (after marketing / business teams have approved our recommendations, of course). We finalize these recommendations by signing off on designs prior to development, when the real site work begins. Development / Engineering Why are development and engineering resources the largest blocker to SEO success at the mid-market and enterprise level? SEO is de-prioritized (YES! Even after executives are bought in). We see it again, and again, and again. As engineering and development teams have urgent things come up, it’s easy to move around other projects that are less time sensitive. On average, website migrations we've worked on are delayed one to two months at the mid-market level. For enterprises, this can be much more severe. So how do you get around your projects being moved to the back of a development queue? It can be hard. I have personal horror stories of asking for the same on-site changes for over three years with no movement due to other internal pressure for other things to be done, or blockers from other teams. There are two main tips we have for ensuring that SEO development projects move through the pipeline properly once they’re scheduled: Tip #1: Create in-depth tickets to help alleviate potential development problems. Many times, projects stall out because development can be difficult. The first thing you can do is document in detail what needs to happen. What does the final state need to look like? Many of our clients work in JIRA, and we are able to integrate directly in to create tickets, comment on them, and QA them upon completion. Tip #2: Create an accountability tracker. Whether you’re a consultant, an in-house SEO, or an agency partner, a “next actions” or project tracker sometimes isn’t enough. We create an accountability tracker where we can discuss weekly where projects are when they fall on other teams, specifically on engineering teams that are pulled in many different directions. Project Tracker Template PR / Thought Leadership Ever engaged in some sort of authority building? Well, there’s undoubtedly some overlap with PR efforts, especially with how link building looks at this point in Google’s existence. There is no gaming or tricking the algorithm anymore- linking needs to be through concentrated content development and promotion. Link building is outreach, and therefore, some of the efforts an SEO agency or SEO team might be working on may intersect. We have three main tips to ensure your outreach efforts are successful and well received. Tip #1: Ensure that relationship boundaries are defined between PR and SEO. We start every engagement by first asking for a “Do Not Contact” list from any existing PR agencies. You do not want to be contacting a media outlet that a PR agency or an internal team has an existing relationship with. Start by understanding the types of relationships that already exist. Tip #2: Don’t just email everyone. Similar to establishing boundaries between PR and SEO, consider other areas of the business that have relationships with website owners. For example, affiliates are another area that you want to think more in-depth about. There are strategies you can use to acquire links that are valuable from affiliates, but you’d want to ensure you’re touching base with whoever manages those affiliate teams first. Start by setting a meeting and strategizing with them. In addition, you want to be careful about contacting websites that may not be a fan of your company or client. Be sensitive to the information in an article. When performing a service like link reclamation, be sure that the sites you’re reaching out to weren’t saying something negative or are not a fan of a company. Although this isn’t extremely common, it does happen and can cause internal issues. Tip #3: There is always opportunity. Don’t get discouraged. Even if you’re working on outreach where there are a lot of blockers in place, there are still sites you can contact that will add SEO value. Focus on sites that are strong and receive organic traffic, but aren’t in the same tier of what a PR agency would be focusing on (think USA Today, or Seventeen Magazine). Although these are amazing sites to be featured on, you can still get value from mommy blogs that have strong rankings and some authority. These sites can still move the needle (as long as they are high-quality and don’t have high spam scores). Content Content creation is crucial to SEO progress, and sometimes it is the most critical piece. This varies by business type, but generally every business can benefit in some way from having SEO-focused content on a website (content built to rank for a specific query). Most businesses have some sort of copywriting resources in-house. These individuals are not always focused on web content, but might be focused on many other types of content to support awareness initiatives or internal processes. When looking at the content process, there are many areas that SEO teams need to support. No matter who is actually creating content, the SEO team needs to provide strategy and direction. Our content process is as follows: Just like all other departments that we’ve discussed so far, content teams also need to be aligned with SEO goals and understand how to produce content that ranks. We recommend creating content maps to help guide content teams. These roadmaps should contain everything that a copywriter needs to understand how to write for SEO. As the SEO strategist is working towards the goal of ranking for a keyword that drives business results, the strategy for the content should be coming from someone who knows the goals of the business on a deep level. Content Roadmap Example These are two key areas that impact rankings that can sometimes be harder to deliver on: 1. Content comprehensiveness: Although not always true, longer content does tend to rank better for informational / research queries. While a 2,500 word post may not always be the preference for the business, sometimes it is necessary to rank. It’s important as an SEO to advocate for comprehensive content (when we believe that the result should be an in-depth response). 2. Keyword targeting in content titles: There is no such thing as “writing for search engines” anymore. The truth is that content needs to be written for users. However, we still must use keywords in the title tag and in the title of the post. These are still the strongest on-page signals we have. Many times, the title of posts are written with brand or marketing language, without considering its ability to rank competitively. For example, a content team might title a post about workplace efficiency as “7 Ways to Improve Your Efficiency Throughout the Day'' without taking into consideration a keyword focus for SEO. Whereas, an SEO might recommend a title such as, “Workplace Efficiency: Tips to Improve Workflows”. As the title holds so much weight, the SEO team needs to advocate for ensuring that the title of the post has a balance between being optimized and engaging. Conclusion Making meaningful progress towards growth in SEO takes an entire company. It is our job as SEOs to serve as the project manager and guide projects through the pipeline. We’re also responsible for ensuring that stakeholders on different teams know and understand our initiatives, and that everyone is working towards the same goals. When everything is working as it should, the results will follow. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Navigating Through Departments: The Key to Making Impactful Changes in SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Navigating Through Departments: The Key to Making Impactful Changes in SEO"
    },
    {
      "level": "H2",
      "text": "The departments that SEO impacts (and how to work with each)"
    },
    {
      "level": "H3",
      "text": "Business / Marketing"
    },
    {
      "level": "H3",
      "text": "Design / Creative / UX & UI"
    },
    {
      "level": "H3",
      "text": "Development / Engineering"
    },
    {
      "level": "H3",
      "text": "PR / Thought Leadership"
    },
    {
      "level": "H3",
      "text": "Content"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    }
  ],
  "author": "Wesley Flippo\n          \n            Wesley Flippo\n          \n            Wesley Flippo"
}