{
  "url": "https://moz.com/blog/navigating-youtube-analytics-a-case-study-in-music-part-i",
  "slug": "navigating-youtube-analytics-a-case-study-in-music-part-i",
  "title": "Navigating YouTube Analytics: A Case Study in Music (Part I) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A few weeks ago, some friends of mine set out on their band’s first US tour. I had the chance to see them here in Atlanta, and as we were catching up after the show, started talking about YouTube’s potential as a vehicle for promotion, especially in the music industry. However, the ability to…",
  "content": "Navigating YouTube Analytics: A Case Study in Music (Part I) SEO Analytics By: Brett Snyder December 4, 2011 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Brett Snyder December 4, 2011 Navigating YouTube Analytics: A Case Study in Music (Part I) SEO Analytics This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. A few weeks ago, some friends of mine set out on their band’s first US tour. I had the chance to see them here in Atlanta, and as we were catching up after the show, started talking about YouTube’s potential as a vehicle for promotion, especially in the music industry. However, the ability to analyze data from YouTube was seriously lacking. Well, that was a few weeks ago; earlier this week, YouTube granted that wish by launching YouTube Analytics! YouTube is a remarkably pervasive medium in today’s society. As the second largest search engine with over 800 million unique visitors every month, a staggering 3 billion videos are viewed every day. In the advent of YouTube Analytics, users now have an unprecedented amount of data to evaluate and study not only the videos themselves but also the audience that views them. To be clear, this is not a post about optimizing for YouTube. Rather, the goal is to show you how to harness and leverage the data YouTube Analytics provides to analyze trends and discover new opportunities for marketing and promotion. A Little Background Although YouTube Analytics was only officially launched earlier this week, YouTube has been aggregating user data for quite some time. Those of you familiar with YouTube Insight will recognize much of the information provided in these reports. If this is the first you’re hearing of YouTube Insight, it’s actually been right underneath your nose for months. Even though you can set this information as private, many people don’t even realize this exists and are sharing their YouTube Insight data with everyone, competitors included! This new YouTube Analytics platform is the natural evolution of YouTube Insight. It offers a plethora of user data to help identify not only who your audience is but also where, when, and most importantly how they found and interacted with your videos. Getting Started When you first login, the default view shows data aggregated at the channel level over the last 30 days. To access individual video data, simply use the Content module to select or search the desired clip from your channel uploads. Select your video and voila, YouTube Analytics at your fingertips! Views The clear equivalent to traffic on a traditional website, YouTube Views give a very top-level look at how many total views your channel or video received over the designated date range. Nothing extraordinary, but I was excited to see that YouTube Analytics also provides you with context: how your views during the designated date range compare to lifetime views. Additionally, the interactive graph allows you to analyze the Views trend line overlaid with Unique Visitors; this is a great way to evaluate the popularity of a video from a raw views perspective, evaluate the degree by which your user fan base is growing, and (at least to an extent) attribute that back to a particular video. Demographics Demographic reports are another set of remarkably simple yet engaging set of graphs and chart breaks down data for your videos by age and gender. YouTube Analytics also provides Top Locations by Views. While the default lists only top performing countries, state-level user data is available for the US with a single click of the mouse (although only the top 10 states are available as of now). As a warning, take this data with a grain of salt. The numbers in this table will not necessarily correlate with the rest of the demographic information. For example, we’ll remember from above that “Afraid” received 239 views in the past 30 days (according to the Views report). However, adding up the view totals from this table accounts for only 227 views. Furthermore, you’ll notice above that the 13-17 age group accounted for 4.0% of views during that period. However, looking at the Top Locations by Views table, the 13-17 age group is conspicuously unaccounted for. Additionally, even though French users viewed the video 9 times over the past 30 days, no demographic information on those users is available. Lastly, if you select either “Male” or “Female” individually from the top of this page you’ll notice that the “Views” column is subtly renamed “Approximate Views.” Sneaky sneaky :-) Playback Locations Now we’re starting to get into the juicy stuff! Playback Locations identifies the page, site, or device on which the video was viewed and presents it in a stacked graph for your viewing pleasure. Playback Locations are classified into one of the following four categories: YouTube Watch Page – Views from YouTube's individual video page - the most common viewing page on YouTube YouTube Channel Page – Views directly on your channel page Embedded players on other websites – Views of your video embedded on another website. Mobile Devices – Views on mobile applications (e.g. iPhone, Android) and YouTube’s mobile site (m.youtube.com). Source: YouTube Analytics Support Click through to the link for “Embedded player on other websites” to get more detail about your referring sources. So far, this is the most promising data set for the development of future promotion strategies. For example, now that we know that gaslampdsm.com accounted for the most desktop views of all non-YouTube entities, we’ve learned something about our target audience. In this instance, Gas Lamp was one of the venues the band played along the tour. Knowing this, there’s a lot we can do to leverage this in our future strategies: We might look at sites similar to this one we could reach out to for links Identify backlinks from bloggers with similar music tastes Run through their Twitter followers and ask for an album or song review on their blog. Thinking proactively toward the next tour, we might strategically leak a new single for venues to post to their Facebook page/website to generate buzz about the event or to invite folks to have dinner with the band before or after the show. We know that users responded favorably to this video on the site so our job now is to use what we’ve learned for future promotion. YouTube is a wonderful social media platform in and of itself, if leveraged properly, and the more data you have to do that the better. Traffic Sources Wait a minute; didn’t we just talk about where users viewed the videos? These two sections are decidedly different, each with its own inherent value. Playback Locations described where the video was actually viewed whereas Traffic Sources shows the path users took to find your content on YouTube. We begin with a nice overview of Traffic Sources, giving us a general sense of where are visitors are coming from. Next, we have another of our nice little stacked graphs followed by a table breaking down our top Traffic Sources. Another neat interactive functionality lets you alter the format of the stacked graph by selecting or de-selecting the checkboxes that accompany each row in the Traffic Source table. As you can see, many of these Traffic Sources are actually hyperlinks that provide additional information. For example, clicking on the External Website link shows all external sites that drove traffic to the YouTube page (Facebook and Twitter unsurprisingly topping the list). YouTube Search and Google Search are exceptionally valuable as they show the referring keywords that brought users to the video. Not only does this keyword-level data provide you with insights into how people search for your videos but also helps you identify opportunities for growth and brand building. Our search query data proves that participating in the live Garageband session was able to put us in front of more new eyes and ears (as these queries were some of the only non-branded ones in the list) and should therefore be pursued again in the future. It also gives us a unique look at how YouTube might classify the genre (“garageband instrumental rock”) Historical trends allow us to track how the brand strengthens over time (by looking at branded vs. non-branded referring queries). YouTube Suggested Video gives you unique insights into how YouTube perceives the theme of your video. Depending on the popularity of your video, the implications here are huge. You can identify other high-profile influencers (ie – channels that refer a ton of traffic without necessarily intending to) in your niche to pursue relationships with for ongoing collaboration. You get a fuller understanding of the complementary interests and tastes of your target audience that can help you further develop your personas for outreach. By looking at a variety of your videos together you can identify where you’re able to generate the most success and construct your future video strategies accordingly. And finally, remember that Related Videos are determined algorithmically, so use this information to revisit your tagging strategy (if you don’t have one, develop one!) and your titles and descriptions to give YouTube as many indicators as possible that you’re relevant within your desired theme. Note: Channel-level Traffic Sources are not available for views prior to November 27th, 2009. Historical Traffic Sources are still available for individual videos. Audience Retention The last of the Views Reports is arguably the most valuable asset of the whole suite. An evolution of the Hot Spots report from YouTube Insight, the Audience Retention report lets you as the video producer know exactly where users are most (and least) engaged and also where you might be losing viewers. The report is actually broken down into two sections: Absolute and Relative Audience Retention. Absolute Audience Retention Absolute Audience Retention tracks the engagement of your viewers by determining what percentage of viewers who started the video are still watching at any given point. If a user rewinds to view certain elements of the video again, this would push the graph up and, as you would logically assume, fast-forwarding or abandoning the video would push the graph down. The implications here stem from the ability to quantitatively analyze qualitative data. If we know the exact point and to what degree users lose interest in our video, we can use this to differentiate between what is and is not valuable to our audience. One of my favorite parts about this report is YouTube Analytics actually embeds the video itself onto this page that correlates with the Retention graph. In other words, you can watch your video and follow along with the retention graph to better identify your most and least successful parts. The fact that audience retention declines over the course of the video is not necessarily something to be overly concerned with in my opinion. Think about it: when people watch videos they’re looking to satisfy a need. Whether that is a intellectual need or one based purely on the desire to be entertained, it may not take the entire video. Once they are satisfied, they’re likely to leave. What we need to look at here is the overall trend; if we see a dramatic spike or dropoff at a certain point, that is where we have the responsibility to ourselves to investigate and use the data to better serve our audience with future videos. Relative Audience Retention Understanding that audience retention is going to naturally decline over the course of the video is what I would imagine provided the inspiration for the Relative Audience Retention report. The concept here is to show your Audience Retention relative to all YouTube videos of similar length; in essence, an attempt to normalize the data and account for the natural deterioration of audience attention. Full disclaimer: The abstract concept is about as valuable as I think this report is. Don’t get me wrong, I don’t discount the value of normalizing these trends but there are many additional variables beyond “time of video” that would account for variations in audience retention. For example, a music video is going to have a much different level of engagement and generic appeal than a scholarly speech or personal home video. Additionally, even though this is a video, if I were a betting man I’d wager that not all people who watched this video actually watched the video. Nevertheless, there are some interesting takeaways here. We know that viewers of this video are significantly more engaged than viewers of other videos. While there may not be a lot to learn from this, if the opposite were true and viewers were substantially less engaged than the average viewer it would indicate that we need to reconsider the direction of our YouTube strategy. We also know that, even though the second half of the video only retained about half our viewers, this is actually a much stronger level of engagement than our Absolute graph would have indicated. So, rather than dedicating time to figuring out why people left halfway through and potentially altering our video production strategy, we accept the fact that this is a fundamental truth of YouTube and view this data through that lens. There Will be Some Growing Pains We all know this, so let’s do our part and send detailed feedback so that the YouTube team can give us what we want! It’s super easy to send feedback, just click on the link in the footer and they’ll take it from there. Lastly, I’d just like to give a big thank you to the guys (and gal!) in Minus Ned for giving me the opportunity to really dig into these new Analytics. If you’re interested in the music behind this post, check them out at http://music.minusned.com. Don’t worry, I have no professional relationship with the band, they’re just good friends making great music! Keep your eyes peeled for Part II of the YouTube Analytics breakdown, which will dive into our Engagement Reports, Call to Action implications, and Reporting applications! Have anything to share or add about the new YouTube Analytics? I’d love your feedback in the comments below! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Navigating YouTube Analytics: A Case Study in Music (Part I)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Navigating YouTube Analytics: A Case Study in Music (Part I)"
    },
    {
      "level": "H2",
      "text": "Absolute Audience Retention"
    },
    {
      "level": "H2",
      "text": "Relative Audience Retention"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Brett Snyder\n          \n            Brett Snyder"
}