{
  "url": "https://moz.com/blog/neato-an-anchor-text-analysis-tool-from-webuildpages",
  "slug": "neato-an-anchor-text-analysis-tool-from-webuildpages",
  "title": "Neato - An Anchor Text Analysis Tool from WeBuildPages - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Neato is a great tool from WeBuildPages (Jim Boykin & Todd Malicoat's excellent SEO shop). It analyzes backlinks (up to 1000 at a time) and their respective anchor texts. It's actually insanely v...",
  "content": "Neato - An Anchor Text Analysis Tool from WeBuildPages Moz News By: Rand Fishkin October 3, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 3, 2005 Neato - An Anchor Text Analysis Tool from WeBuildPages Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Neato is a great tool from WeBuildPages (Jim Boykin & Todd Malicoat's excellent SEO shop). It analyzes backlinks (up to 1000 at a time) and their respective anchor texts. It's actually insanely valuable for the experienced SEO, as you can pretty much guage rankings in many competitive areas based on the anchors coming to you. I think it's also got a good use as a way to see if your link building efforts \"stick out like a sore thumb\". I note that SEOmoz, which had completely natural links coming to it looks pretty different in terms of patterns than some sites for clients of ours. I'd love to see some comparisons of all-natural sites vs. all-SEOed sites - probably good information to glean from that. Since I noticed this tool via DD's blog, I think it's worth mentioning that she's now a grandmother (along with being a top-notch SEO). Congrats Donna, to you and the newest member of your family. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Neato - An Anchor Text Analysis Tool from WeBuildPages"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Neato - An Anchor Text Analysis Tool from WeBuildPages"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}