{
  "url": "https://moz.com/blog/need-a-new-tool-3-social-sharing-tools-that-do-something-specific",
  "slug": "need-a-new-tool-3-social-sharing-tools-that-do-something-specific",
  "title": "Need a New Tool? 3 Social Sharing Tools That Do Something Specific - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We have seen many tool introduced to help make our lives easier that are just now starting to gain some exposure, but there were three that really seemed to stand out this year. Below is a quick review of these tools and why they’re unique:",
  "content": "Need a New Tool? 3 Social Sharing Tools That Do Something Specific SEO Tools By: Amanda DiSilvestro September 26, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Amanda DiSilvestro September 26, 2013 Need a New Tool? 3 Social Sharing Tools That Do Something Specific SEO Tools This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. It’s no secret that social sharing is becoming more and more difficult. Between sharing content on your own account, your company account, and worrying about when to share, it's hectic. Sharing content on social media networks isn’t even everything you have to consider—you also have to worry about simply managing and maintaining every account you own, which is hopefully at least Twitter, Facebook, LinkedIn, Google+, and even StumbleUpon. This is why social media tools are becoming essential. They help you stay calm and find success amongst the chaos. This Year’s Social Media Tools You Don’t Want to Miss Companies have certainly picked up on the fact that social media management tools are in demand, and this year’s new tools didn’t disappoint. We have seen many tool introduced to help make our lives easier that are just now starting to gain some exposure, but there were three that really seemed to stand out this year. Below is a quick review of these tools and why they’re unique: 1. Viral Content Bee Gerald Weber of SEM-Group and Ann Smarty of MyBlogGuest and SEOSmarty created this tool in September 2012. How Viral Content Bee Works The idea behind Viral Content Bee (VCB) is to get a piece of content attention beyond just the usual few days, and this is done using the “pay it forward” mentality. In other words, you have to share others content in order to help your content be shared. You earn credits based on how many pieces of content you share, and then you can spend those credits on your own projects. The more content you share, the more credits you have to spend, and the more credits you spend, the more authoritative people will share your content and bring you visibility. You can learn more about how credits work here. The tool supports Twitter, Facebook, and most recently Pinterest and StumbleUpon. It’s completely free to use and is manually moderated so you know that you’re only seeing (and sharing) quality content. There are only a few key points to getting started with the tool: Connect Accounts. You want to connect all of the social accounts you have when registering. You can do this by going to Settings > Social Accounts and then clicking “enable” once you have registered. You can register for your free account at ViralContentBee.com. Dashboard. After registering, you will be able to choose which categories you want to see in your dashboard. This will make it easy to see information that is relevant to your industry and/or interests so you can share and earn credits. Below is a screenshot of my dashboard. If you look at the top of the screen, you will see some of the options you have with the tool (projects, sharing history, etc.): Share Content. You can share content by clicking the buttons below the articles (as seen above). There will be one button for every social account where you are allowed to post that content. The example above just shows Twitter and Facebook available, but other content will options for Pinterest, StumbleUpon, all four, etc. If I were to click the Twitter button on a piece of content, I will see a screen like the one below that shows me how many credits I will earn: Add your content. You can add your own content by clicking “Add Projects” at the top of the screen. It will cost you a few credits, but it’s well worth it in the end. There are also a few notable features of the tool including the ability to buffer and schedule sharing, a customizable dashboard, labels and folders to help you manage multiple projects, and project reports that can be customized as well as emailed and/or downloaded. It might seem complicated at first, but it’s incredibly easy to pick up. You can learn more by watching this video made by the founders themselves. Why Viral Content Bee Matters What makes this tool unique is the fact that it puts a focus on keeping content buzzing (their mascot the bee was no coincidence). While most social tools require you to constantly go back and re-share or focus on bringing visibility to that content at a specific time, VCB makes it easy to continually share the projects that make you proud. 2. Facebook Image Detection Tool The team over at TechWyse created this new tool. It was originally developed for internal use only, but the company recently opened it up to other agencies as well as the public. How the Facebook Image Text Detection Tool Works The point of this tool is to help those advertising on Facebook make sure they are following all the rules. Because Facebook does not allow more than 20% text in a Facebook Promoted Post image, advertisers and page managers need a way to make sure that the image they are using for a Promoted Post meets Facebook’s text policy guidelines. This has been a guessing game for many, and it was getting to a point where advertisers were crossing their fingers, hoping their post would get approved. This tool eliminates that risk and helps to speed up development times and get campaigns up and running without any delays. Getting started is incredibly easy: Download the App. The tool is actually an app that you can download to your Chrome browser here. The page will look like the following: Upload your image. Find the image you hope to use and upload it into the designated area of the tool. It will pop up right away so you can’t miss it, but it looks like this: Results. Once you upload your file, the tool will let you know whether or not that image you want to use is compliant with Facebook’s text policy guidelines. You can click squares around the image where you want to put text (or where you have put text) to see if you’re going over the 20%. Here is a picture I uploaded and the results I received: This is probably one of the easiest and most straightforward new social media tools out there, and it is completely free. Even if you don’t want to download the app for your browser, you can take advantage by visiting this page. 3. BuzzBundle BuzzBundle was launched by Link-Assistant.com in November 2012 in beta and has been coming out with new advanced features ever since. The tool focuses on social media management, reputation monitoring, and combining SEO and social. Although there are other tools out there that might seem similar, BuzzBundle as a whole is quite unique. How BuzzBundle Works Getting started with BuzzBundle involves a simple download. You can download the free edition (no credit card necessary), which I would recommend first, or order a more advanced edition here. You will be emailed installation instructions and then you’ll be set to go. Below is a screenshot of the BuzzBundle homepage that details a few of their most notable features: A Few BuzzBundle Features Explained BuzzBundle has many different features, which you can learn about here, but below are three of the features that really make this tool unique: Personas. You can create different personas and then create different social media accounts for each persona. The example BuzzBundle gave went something like this: “Just imagine: 100 personas with 10 profiles each = 1,000 people talking about your company online. That’s more social buzz than you could ever produce by hand!” You can also switch personas easily. You may want to create a persona for the marketing department, yourself, or even one or two for a targeted audience. Below is a screenshot provided by BuzzBundle that illustrates how someone would switch back and forth: SEO. Most link building initiatives don’t focus on earning links from social media; however, this is a great way to improve the SEO of your site. With this tool, you can find all of the links your site gets from social media, which should help you see where you should publish and promote in the future. See Conversations about Your Business. You can easily read and respond to people who are talking about your business across the social web (so it is slightly different than Google Alerts). You can find and join any discussion that mentions your business or even one of your keywords. Below is another screenshot from BuzzBundle: What social media tools are you most excited about this year? Have you used any of the tools mentioned above? Let us know about your experiences with social media tools and give us your thoughts in the comments below. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Need a New Tool? 3 Social Sharing Tools That Do Something Specific"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Need a New Tool? 3 Social Sharing Tools That Do Something Specific"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Amanda DiSilvestro\n          \n            Amanda DiSilvestro\n          \n            Amanda DiSilvestro"
}