{
  "url": "https://moz.com/blog/need-help-with-pro-introducing-the-help-hub",
  "slug": "need-help-with-pro-introducing-the-help-hub",
  "title": "Need Help with PRO? Introducing the Help Hub! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "At SEOmoz, we know that learning complex software applications can be time consuming and challenging, kind of like playing chess with a Wookie. Having well-written and comprehensive onboarding materials can help to decrease the learning curve, thus preventing droid dismemberment.",
  "content": "Need Help with PRO? Introducing the Help Hub! Moz Tools By: Kenneth Martin August 14, 2012 Table of Contents Copied! By: Kenneth Martin August 14, 2012 Need Help with PRO? Introducing the Help Hub! Moz Tools At SEOmoz, we know that learning complex software applications can be time consuming and challenging, kind of like playing chess with a Wookie. Having well-written and comprehensive onboarding materials can help to decrease the learning curve, thus preventing droid dismemberment. Excellent documentation, videos, and \"getting started\" guides are a key differentiator between software that is successful and software that slowly fizzles away. We've gone to great lengths to bring knowledge to the SEO and inbound communities with our daily blog articles and handy Beginner's Guide to SEO. However, getting up to speed with our PRO application has been a challenge for all of us. We're happy to announce that the previous PRO challenge ends today. Introducing: the new SEOmoz Help Hub! This project has been at the forefront of our Help Team for the past six months. You may have seen me around the blog before; I'm Kenny, and I designed the look and feel of our new Help home base. The walkthroughs, videos, and screenshots are by my fellow helpster, Nick Sayers, our Communications Chief. Together with the rest of the Help Team, we'll be working to bring you the most high-quality self-help customer service experience on the web. What are you waiting for? Check it out now! Over the past few months, we have been fine-tuning our Getting Started Guides, honing our video editing skills, and taking feedback from our new users. Previously we used our customer support software's forums for all of our documentation needs. Sure, these forums were better than having nothing at all, but they didn't allow for many of the features needed to make our help resources useful for new customers. Largely, our old forums lacked the functionality we needed as they existed off of the www.seomoz.org domain. This opened the door for odd issues with cross authentication between the forums on SEOmoz and other stunted processes. We wanted a system that was unique to SEOmoz so customers could easy navigate to a central location to learn about our tools. With the launch of our new Help Hub, customers can become zen-level power users in a single afternoon. SEOmoz PRO levitation initiated! Learning new software through wordy guides and a plethora of screenshots is a good start, but we wanted to shoot for the stars. The new Help Hub hosts a series of finely-tuned video screencasts, which can put the learning process into hyperdrive. Videos are the best way for the community to see where and how to do something on PRO with ease, which is our ultimate goal. In summation, the process should be as quick and painless as a Michael Bay film. Now that we've launched, we'll continue to gather awesome video analytics to see how people are engaged in our content and make improvements to make them even more engaging! At SEOmoz, we use Wistia to host our diverse catalogue of videos. Why? Because Wistia is amazing. Their software allows us to see just what sections of our videos are skipped, replayed, and scrobbled back and forth. This information allows us to cut out any fluff and isolate potentially confusing aspects of our videos and even deeper issues with our software itself. Wistia documents user information to help us create video content that you, our awesome community members, really want. To better measure engagement and success, we are also going to ask for customer feedback. At the end of each article in our Help Hub, you will find a \"Was this document helpful?\" section. All responses are logged and reviewed so that we can better improve our help documentation over time. Feedback is crucial to this process as we want to know what customers are missing in our learning materials, and also what aspects of our product are the hardest to learn. The most common questions that are submitted to our help team will be identified and added to the documentation, or used to refine current copy to make an article clearer. We've dedicated a trove of resources to guarantee that our new Help Hub is improved on a regular basis. As mentioned above, Nick will be managing the Help Hub and making sure the content is fresh, consumable, and accurate. He will also be blogging about our new venture into customer education as it evolves, so be on the lookout for his stellar posts! In sum, if you are just getting started with SEOmoz PRO and want to get up to speed quickly, or if you're long-time member and haven't explored some of the new features, don't forget to check out our Help Hub and get schooled. Let us know what you like and what you want to see improved in the comments below. This is your Help Hub, after all! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Need Help with PRO? Introducing the Help Hub!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Need Help with PRO? Introducing the Help Hub!"
    },
    {
      "level": "H2",
      "text": "What are you waiting for? Check it out now!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "Moz AI: Introducing Augmented Intelligence"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kenneth Martin\n          \n            Kenneth Martin"
}