{
  "url": "https://moz.com/blog/negative-feedback-for-the-seomoz-blog",
  "slug": "negative-feedback-for-the-seomoz-blog",
  "title": "Negative Feedback for the SEOmoz Blog - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For the first time since launch, I've been receiving some negative feedback on certain blog entries, not just from newcomers to the site, but from long-time readers and respected search industry folks. Since the primary purpose of this blog is to provide a hub of information, sharing, news and, on…",
  "content": "Negative Feedback for the SEOmoz Blog Moz News By: Rand Fishkin May 13, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 13, 2006 Negative Feedback for the SEOmoz Blog Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. For the first time since launch, I've been receiving some negative feedback on certain blog entries, not just from newcomers to the site, but from long-time readers and respected search industry folks. Since the primary purpose of this blog is to provide a hub of information, sharing, news and, on occassion, humor for the SEO community, I thought it wise to ask for an entire thread devoted to: Thoughts on what SEOmoz is missing or what you'd like to see Constructive criticism for myself and the other writers Straight negative feedback with no punches pulled In the comments here, feel free to be harsh, honest and unabashed. A good ranting (in the right place) never hurt anyone. For the writers at the blog (myself included), I'd ask you not to take offense at anything you see below or feel compelled to defend or respond (unless it's something you want clarified or are asking for help with, examples, etc.). As always, thanks for the feedback - we take it to heart and it really does make the blog a better place. UPDATE: One thing we have done, by popular request, is remove the advertising on SEOmoz. We'll think about monetization in the future. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Negative Feedback for the SEOmoz Blog"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Negative Feedback for the SEOmoz Blog"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}