{
  "url": "https://moz.com/blog/negative-keywords-for-positive-roi",
  "slug": "negative-keywords-for-positive-roi",
  "title": "Negative Keywords for Positive ROI - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "One of my guilty pleasures is looking through the search query reports (SQR) of an AdWords campaign for the cringe-worthy search queries that led to someone clicking on a PPC ad. Really Google? You felt that goat transportation cost was related to my keyword of freight costs? Or that a babe cam…",
  "content": "Stop Paying for Stupid Clicks: Negative Keywords for Positive ROI Keyword Research By: Keri Morgret February 28, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Keri Morgret February 28, 2012 Stop Paying for Stupid Clicks: Negative Keywords for Positive ROI Keyword Research The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. One of my guilty pleasures is looking through the search query reports (SQR) of an AdWords campaign for the cringe-worthy search queries that led to someone clicking on a PPC ad. Really Google? You felt that goat transportation cost was related to my keyword of freight costs? Or that a babe cam search should show my ad for digital camera? Sadly, these matches and worse can happen if you lack proper negative keywords. This screenshot shows what happens when your campaign does not have enough negative keywords. It is just as important to have negative keywords as it is to have regular keywords. People really DO click on anything and everything, including these off-target ads, and the advertiser gets charged for that click. Most people are smart enough to not click, so the advertiser isn't directly charged. They just get hit when it comes to their quality score (affecting your cost per click and ad ranking) , which is based in part on your clickthrough rate (CTR). If nobody is clicking on your ads, Google is apt to lower your quality score and increase your cost per click. I'm going to help you brainstorm and greatly expand your negative keyword list. Evan Steed, co-founder of Meathead Movers, has been brave enough to let me look at his AdWords account and share some real-life examples with you here (and in my February 29th SMX presentation) from an account with no negative keywords. Meathead Movers is based near my hometown on the central coast of California, and they do some awesome things in the community, including moving women out of domestic violence situations for free. That's always impressed me, and I'm glad to be able to give something back to a local business. Start with the Search Query Report Download your search query report, and review what people actually entered to trigger your ad. You'll find some good candidates for negative keywords here, and you can start developing organized negative keyword lists. Go Beyond the Search Query Report to Find Negative Keywords I use the search query report for gathering negatives I had missed, and to find ideas for entire classes of negative keywords. This all started when I found \"honeymoon with a stranger\" in a search query report, found out it was a movie title, and got the idea to search IMDB for other titles containing honeymoon. Suddenly I had \"zombie honeymoon\", \"honeymoon for three\", and a large variety of other keywords in my negative keyword list. I saw lots of honeymoon resort ads showing for these queries, and realized not too many people were using this method, and started thinking of other ways to find negative keywords. I prefer to have a good negative keyword strategy in place before I even launch a campaign, to prevent some of these stupid clicks from ever happening. Here are some of the resources I use. The first resource is an engaged brain. Words often have many meanings, and this can cause you trouble. If you are marketing only to the United States, it's tempting to dump a list of all countries except the US into a list, but remember that Georgia is both a US State and a country. Also, make sure that you don't use the same word in your campaign as in your negative keyword list. Microsoft AdCenter has a nice feature that will alert you to these keyword conflicts. Existing Negative Keyword Lists Review existing negative keyword lists that other people have generated. If you do nothing else, review these lists. You'll find near-universal keywords (like ebay, craigslist, sex, porn), keywords to exclude job seekers (resume, position, salary, job), keywords to exclude information seekers (how to, about, what is, how do I), and many more. Engine Ready Negative Keyword List 200+ Negative Keywords to Consider for B2B PPC Plastic Surgery negative keyword list. This list has a lot of celebrity names, which can be useful in all types of campaigns. Meathead gets queries about when did a certain actor move to Los Angeles, for example. 150+ Negative Keywords for Software Selling AdWords Campaigns Not explicitly a negative keyword list, but a collection of banned word lists for forums. You probably don't want your ads showing for these types of NSFW words. Geography Lists This is helpful for excluding people searching outside of your area of service. Even though Meathead geo-targeted their ads to appear only where they offered service (they only offer moving services in the state of California), people are looking to move from California to another state. Lists like this are also helpful in building your regular keyword list, as you can easily find all of the counties in a state, and all of the cities in each county, and develop targeted ad groups for your product or service. List of all countries in the world States and provinces in North America List of US counties by state Links to several lists of cities and counties for each state Another plain text list of cities and counties in each state List of California Cities by County Movie Lists I use IMDB's title search and check Feature Film, TV Movie, and TV series to get the most common titles without being bogged down in every single TV episode title ever made. In the display options at the bottom, I choose to display compact and sort by number of votes descending. This gets you a list of the most popular movies at the top of the list, and you can easily copy the titles that make sense for your list. Music Lists Leo's Lyrics does a good job of listing song names in a compact format. In this example, with so many titles being just \"move\", I'd consider adding some artist names to a keyword list, along with the words lyrics, artist, and album. Book Lists For books, I haven't found a great way to get just the most popular titles in an easy manner. I'd just scan Amazon and Barnes and Nobel online and sort by popular items. Wikipedia Lists Wikipedia is a great source of lists on nearly any topic. Search \"list of [keyword] wikipedia\" and you'll often get a great list, along with references for other sites that have similar lists. If you are an animal shelter that only has cats and dogs, you might go for the list of domesticated animals in Wikipedia so your ad doesn't show for people wanting to adopt a pig (and you might want to head to their list of cat and dog breeds as well when you develop your regular keywords). Government Lists Governments are great for more than just good backlinks. For regulated industries, they often have lists of approved companies in that industry. You can use that for a negative list in your branding campaign, and as a keyword list in a campaign targeting people searching for your competitors. Another handy feature is that there is often an export option in these lists to download in a text or CSV format. Top Lists Forbes and other sites have endless top 10 and top 100 lists of all kinds of subjects. In Evan's case, I'd use some of the celebrity names as negatives to block his ads from being shown when someone searches for information on a celebrity moving to Los Angeles or Santa Barbara or another of his target cities. Affiliate Lists Some affiliate programs have detailed lists of negative keywords that can provide inspiration. If I were advertising for something related to Whitney Houston, I'd add the list of JC Whitney (an auto parts retailer) variations to my negatives list. Paulson Management Group and Link Connector have several lists of negative keywords for specific campaigns. Finding alternate meanings You don't want your financial institution showing up for queries for blood banks and food banks. How to think of some of those other meanings for words ahead of time? Wikipedia Disambiguation pages Google Queries Meathead has a new service for packing in addition to just moving. They know they need to exclude Green Bay Packers, but want ideas of what other meanings packing can have beyond the moving industry. Searching for [packers -\"green bay\" -moving -movers] yields a company in their service area called Island Packers, agriculture packing, and a restaurant called Packers. Vocabulary lists Meathead had a query for moving furniture. They don't focus on rearranging furniture, so needs to have an exclusion list for their campaigns that focuses on furniture. An ESL vocabulary list provides a nice text-based list for easy copying and brainstorming. Yahoo Answers Yahoo Answers provides some natural-language ideas for negative keywords that you might have otherwise missed. Keyword Research Tools Soovle shows suggestions from any number of engines (you can choose) for your keyword. It's another way of quickly spotting off-topic trends. Übersuggest scrapes Google Suggest and other suggestion services to come up with lists. Short Words If you have a short keyword or an acronym, check to see if it's also an acronym for something else, a stock symbol, or an airline code. Airport codes Stock symbols Acronyms Link Builder and SEOs You also don't want to show your ad to people looking to build links related to your keywords. Rand's post has a number of phrases you'd want to exclude, like \"submit url\" \"add site\" \"suggest a url\". Trending Topics Keep an eye on Google Trends and Twitter Trends for a new phrase that has come into prominence. Google seems to not display ads for suddenly trending topics much of the time (like not showing ads when you searched for [cruise ship italy] right after the cruise ship sank), but it's also good to add in negatives to keep yourself covered rather than completely trust in Google's algorithms. Bonus Round! Tools to Harvest Data Not every site is going to have a nice plain text list ready for you to copy and paste. I've found a couple of tools that are helpful for harvesting data and making it easily usable. Dafizilla Table2Clipboard lets you easily paste data with its formatting to Excel, where you can then manipulate the data for just the information you need. Outwit Hub offers a variety of ways for you to extract data from web pages. This tool deserves several blog posts of its own on its overall uses for SEO, not just in collecting keywords. Wrapping Up Whew! There's a lot to think about when finding negative keywords. Is it all worth it? Check out an interview with Ken Jurina with case studies where using tens of thousands of negative keywords has helped businesses save 5% to 40% on their PPC. What are some of your favorite ways to find negative keywords, and what are some of the worst search queries you have seen? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Stop Paying for Stupid Clicks: Negative Keywords for Positive ROI"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Stop Paying for Stupid Clicks: Negative Keywords for Positive ROI"
    },
    {
      "level": "H2",
      "text": "Start with the Search Query Report"
    },
    {
      "level": "H2",
      "text": "Go Beyond the Search Query Report to Find Negative Keywords"
    },
    {
      "level": "H3",
      "text": "Existing Negative Keyword Lists"
    },
    {
      "level": "H3",
      "text": "Geography Lists"
    },
    {
      "level": "H3",
      "text": "Movie Lists"
    },
    {
      "level": "H3",
      "text": "Music Lists"
    },
    {
      "level": "H3",
      "text": "Book Lists"
    },
    {
      "level": "H3",
      "text": "Wikipedia Lists"
    },
    {
      "level": "H2",
      "text": "Government Lists"
    },
    {
      "level": "H3",
      "text": "Top Lists"
    },
    {
      "level": "H3",
      "text": "Affiliate Lists"
    },
    {
      "level": "H3",
      "text": "Finding alternate meanings"
    },
    {
      "level": "H3",
      "text": "Wikipedia Disambiguation pages"
    },
    {
      "level": "H3",
      "text": "Google Queries"
    },
    {
      "level": "H3",
      "text": "Vocabulary lists"
    },
    {
      "level": "H3",
      "text": "Yahoo Answers"
    },
    {
      "level": "H3",
      "text": "Keyword Research Tools"
    },
    {
      "level": "H3",
      "text": "Short Words"
    },
    {
      "level": "H3",
      "text": "Link Builder and SEOs"
    },
    {
      "level": "H3",
      "text": "Trending Topics"
    },
    {
      "level": "H2",
      "text": "Bonus Round! Tools to Harvest Data"
    },
    {
      "level": "H2",
      "text": "Wrapping Up"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Keri Morgret\n          \n            Keri Morgret\n          \n            Keri Morgret"
}