{
  "url": "https://moz.com/blog/negative-seo-myths-realities-and-precautions-whiteboard-friday",
  "slug": "negative-seo-myths-realities-and-precautions-whiteboard-friday",
  "title": "Negative SEO: Myths, Realities, and Precautions - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This week we will be covering a topic not often discussed on Whiteboard Friday. We are going to be talking about negative SEO tactics and how these practices function. Negative SEO is definitely not something we condone here at SEOmoz but education around these techniques can be a helpful,…",
  "content": "Negative SEO: Myths, Realities, and Precautions Whiteboard Friday By: Rand Fishkin April 26, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 26, 2012 Negative SEO: Myths, Realities, and Precautions Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This week we will be covering a topic not often discussed on Whiteboard Friday. We are going to be talking about negative SEO tactics and how these practices function. Negative SEO is definitely not something we condone here at SEOmoz but education around these techniques can be a helpful, precautionary method that could prevent you from being the subject of malicious intent. We hope you enjoy the video and don't forget to leave your comments below. Video Transcription Howdy, SEOmoz fans. Welcome to another edition of Whiteboard Friday. This week we're talking about a very concerning and controversial topic - negative SEO. Now, negative SEO has a number of meanings. I want to walk through them and get to some points. If you've been paying attention to the Twitter-sphere or the SEO blogosphere over the past week, two weeks, there's been a lot of discussion around negative SEO, particularly backlink pointing to bring down sites. I will get to that, but first I want to start with some of the classic ways that negative SEO could potentially hurt you. The idea behind negative SEO is that rather than doing good, positive things that will promote signals in the search engines that bump up your rankings, there are ways to do bad, terrible, negative things. Now, obviously you could do these on your own sites, but hopefully you're smart enough not to do that. There may be things that other site owners, webmasters, marketers, or black hat SEO's, mostly we're talking about black hat SEO's, spammers, and even people doing very illegal things to bring down your website in the rankings or to even take your website offline. There are classic types of things, like malware, hacks, and injections. So this is the first one I'm going to talk about. Basically, what we're saying here is that you've got your site, it has some pages on here, and hackers may find security vulnerabilities in your site, in your FTP logins. It may be a WordPress install. Earlier this year I had a hacker essentially come in and inject spam and malware onto my personal blog at RandFishkin.com/blog. The idea is that they all inject spam, links to spam sometimes, sometimes very subtly. They will make changes to your site. One of the classic examples of this is someone going and editing your robots.txt file to block Google bot or to restrict all IPs from a certain range, or those kinds of things. Obviously, that's going to take your site out of the search engines. Or inject viruses or malware that will install itself on computers that visit you. Unfortunately, I was actually visiting MozCation.com, which Gianluca Fiorell, one of our Pro members from Spain - he's Italian but from Spain - had set up last year to promote MozCation in Barcelona, in Spain. Unfortunately, it looked like some spammers had injected some malware on that site, and it had been on there a little while. I think he's taken care of it now, but these are the types of problems. What you'll see is a download will go into your cache, and sometimes Microsoft Security Essentials will alert you that that's happened, hopefully if you've got it installed. So this is something to watch out for. You want to close those security holes. The other kinds of things to watch out for is spam reporting. Sometimes a lot of people, unfortunately, in the SEO-sphere still do manipulative kinds of link building. Obviously, most of the people who watch Whiteboard Friday are not in that group, but some of you probably are. Maybe you buy a few directory listings. You go on Fiverr and you buy some cheap links. You find some spam through some forums that potentially works. You're doing sorts of things that are on the grey hat/black hat borderline, in terms of link acquisition, and sometimes you will see that your competitors might spam report you. So this guy's going to go over to Google and maybe he'll leave a threat at the webmaster forums, or he'll send it through a spam report in his Google Webmaster Tools. A lot of this spam reporting, I think they said they get tens of thousands of spam reports each month, I believe it was. Actually, fewer than I'd expect, but a lot of people do report spam to Google. These might be your competitors. These might be other webmasters. They could just be random people on the Internet who are like, \"Why isn't this site ranking here?. This looks terrible. I don't like this.\" When this happens, Google might take a closer look at your backlinks, and obviously this might bring you down. There are arguments about the ethics inside the search engine industry. Personally, I think that removing low quality crap from the Internet is all of our jobs, and I like to be part of that. I think that it's a good thing to make the Internet a better place, and if you're not making the Internet a better place, I hope that you're not doing web marketing because it makes the rest of our industry look bad. However, certainly reasonable minds can disagree. Aaron Wall, from SEO Book, who I highly respect, who I grew up with in this industry and think the world of, takes a complete opposite view. He thinks that because I support disclosing spam and manipulation to Google and to search engines that this makes me a bad person. That's too bad. That's frustrating, but I think reasonable people can disagree. Certainly whatever angle you are on, on this, you should at least be aware that this stuff happens and know that it's a potential risk, particularly if you're doing highly manipulative things. The last one I want to talk about is actually the biggest one and probably the most important and the most salient and relevant to what we've been talking about today. That is pointing nasty links to your website. Now this has been something that a lot of webmasters have been discussing actively over the last couple of weeks in this sphere, essentially kicked off by a forum thread on Traffic Power Forum. I haven't previously spent a lot of time there, but it's a very active forum populated by a wide mix of white hat folks, grey hat folks, some pretty dark black hat folks, which I'll show you in a minute. Two members there, Jammie and Pixelgrinder, hit two different websites. One is called SEOFastStart.com, that's owned by Dan Thies. Dan, of course, early keyword research guru in the SEO space, big industry mover and shaker. Spoke at a lot of the early search engine strategies conferences. I've met him a number of times, really good guy, solid guy. He complimented Matt Cutts, the Google Webspam Chief, on the search quality team. He complimented him over Twitter on knocking out some spam. Some people on the forum felt that it was, I don't know, in poor taste. Right? Essentially they felt that because he was being complimentary to Google for kicking out webspam, that he should then be the target of this negative SEO. The other site was NegativeSEO.me, which was essentially a website offering services to get someone banned from the search indices, and this a little concerning in and of itself. Now the thing that's interesting about these sites, and Dan admitted this about SEOFastStart. Not a very big site. Right? Not a lot of great brand or link signals. Potentially some small amounts of not wholly white hat types of activities already happening around these sites. So we're not talking about (a) big brand sites, or (b) sites that have no idea about the SEO world and aren't doing anything manipulative and are clean as the driven snow. These are a little off that track. These were both hit by these guys, at least presumably, according to the forum thread, and lost a lot of their rankings. When I say hit, what I mean is this type of thing happens. So here's your site.com up here. Right? Essentially, what's going on is you've got some nice white hat, editorially given, earned links, high quality stuff, and that's great. Then there's some kind of this dark cloud of black hattery, spammy, manipulative posts. They talked about a number of things, XRumer blasts, buying links on Fiverr, buying links from some link networks, pointing some links that they had seen get hit on other sites at this site, and essentially trigger this loss of rankings. Now, they didn't get banned from the index, but they fell from, I think Dan Thies' site in particular fell from ranking #1, for his personal name, to number30, 35, somewhere around there, and hits like that similar across both these sites. The second example was another forum thread started by a user with the user name, Negative SEO, and that was for the domain JustGoodCars.com. Now again, Just Good Cars unfortunately looks like they were doing a little bit of things that might be construed as manipulative, even prior to this attack on them by the Negative SEO guy. Some links that were of questionable sources or how they were acquired, and then a big network of websites that were all pointing back and forth to each other from many different pages on these many different sites. This guy took it upon himself to say, well they were . . . I guess this website had been complaining in the Google webmaster forums about some other sites outranking them, so this person took it upon themselves to do some pretty nasty, evil stuff. Now I can't support this in any way. I'm frustrated that unfortunately this is a part of our world. But you should be aware of it, because what they did was creative, almost to the point of ingenuity, but definitely dark and evil, maybe even bordering on illegal depending on the legalities. I'm not really sure. Here's what they said they did. Of course, I can't prove that they actually did these things, but here's what they said they did. So they did go do a lot of manipulative, nasty backlinking to the site from a lot of those sources we talked about. They mentioned a few XRumer blasts. They posted a lot of duplicate content. They set up fake WordPress splogs, essentially a spam blog, and then they re-posted the content that existed on JustGoodCars.com on tens of thousands of pages across the Web so that Google might say, \"Oh, well why is this duplicate content?\" I don't know that that's actually highly concerning in and of itself. A lot of people copy content from all over the Web for both good and bad reasons. Then they did something that's really nasty. They went to Fiverr and they asked for people to post fake reviews to Google Reviews to make it look like Just Good Cars was manipulating Google Reviews, and actually got them thrown out of that program. According to the forum post, anyway, that's what happened. They got their stars and their Google Reviews and their ratings removed, and all that kind of stuff, which that's whew, that's really low. That sucks if that's what really happened. It's even more terrifying, but they sent fake emails. They set up email addresses that looked like they came from Just Good Cars, and sent fake emails to websites that had posted good editorial, positive links, saying, \"Hey, you should stop linking to this site. There are these problems with it. We're requesting a DMCA take down action against it. Our attorneys will be in touch if you don't remove your links.\" Those kinds of things. So really just, oh man, that's really evil. But stuff that we definitely need to be aware of in terms of the world of negative SEO and what this kind of stuff can happen. Now, it's very tough to verify anonymous users on an anonymous forum posting and whether all of this stuff actually happened, but certainly the ideas behind it are very concerning. What I want to express today is that there are some things you can do on your site that will make you higher risk and lower risk to these kinds of things. Higher risk is going to be, like some of these other sites, you've already done a little bit of manipulative linking. Right? You've already done some spammy stuff. You have manipulative on-site stuff. Meaning for example, like Just Good Cars there's kind of that footer with all these links pointing to all these other places. This was mentioned in the forum thread. So I'm not giving away new information here, but there's stuff on this site that looks like it might be not wholly kosher, not wholly white hat. Your site has few high quality brand signals. High quality brand signals, things like lots of people searching for your domain name and brand name. Lots of mentions of you in the news and press, in outlets that are high quality. Lots of offline sorts of signals. Lots of user and usage metrics types of signals. Lots of verification kinds of things. Using high quality providers of everything from the IP address, where your website's hosted, to the domain registration link, to the services you might have installed on your site, Akamai or any of the CDN networks suggest you're very popular. Any type of signal like this that looks like a highly brand intense signal. Lower risk is going to be the opposite. Right? So things like a totally clean backlink profile. Never done any kind of manipulative linking, at least not intentional outbound backlink building. Don't forget, everyone's going to have some spam links. Even if you've never done any manipulative backlinking or any backlinking or marketing of any kind, you will have some bad backlinks, because the Web, just there are all sorts of weird crawlers and bots that host links all over the place. It's fine. Don't sweat those. It's the normal volume. Things like having a beautiful, elegant, high quality UX. A great UX is a fantastic defense against a lot of spam and manipulation. It's even a great tactic for folks who are trying to do SEO. It's just a great signal in general. Right? Having a great UX is going to get you more conversions and more people using your site. Anyone who is browsing your website, say, from the Google Search Quality team or the webspam team, or the Google reviewers, which Google hires, or from Bing, any of those folks who are looking at your site are going to say, \"Oh this is clearly a great site. We want to have this in our index.\" If you review some of these other sites, you can take them or leave them. One that does not feel very SEO. I think you all know what I mean. There's sort of that sixth sense of, boy, they're doing a lot of things on the page and off the site that don't feel like they're natural, don't feel like they're for users. Whenever you have that sixth sense around a site, that's going to put you in a higher danger category. Not doing that, having that very natural sort of site, you can target keywords, do a good job with your titles, do a good job with your content, do a good job with your internal linking, but make it feel very natural. I'll give you good examples. Amazon, very well SEO'ed, but doesn't feel SEO'ed. Zappos, doesn't feel SEO'ed. Even SEOmoz, it doesn't feel very SEO'ed, but it's doing a good job. TechCrunch, doesn't feel SEO'ed, but ranks phenomenally well. Finally, having those strong brand signals, the branded searches, lots of people searching for your brand name specifically. Good links, good mentions, good press, good user and usage metrics, all these types of things are going to protect you from a lot of these types of spam attacks. That being said, there's nasty stuff that other people can do. So you want to (a) keep your eyes wide open. Make sure you're registered with Google Webmaster Tools so you can get any of these warnings ahead of time. If you happen to see an influx of really nasty looking links, you might want to send a preemptive reconsideration request to Google saying, \"Hey, we don't know where these came from and we have nothing to do with this. We just want you guys to know that this is not our activity. Please feel free to disregard or not count these links.\" 99% of the time Google is not going to say, \"Oh these bad links that are pointing to you, we're going to count those as reducing your SEO and bringing you down in the rankings.\" They're instead going to say, \"Oh well, we're going to ignore these. We're going to remove the value that these pass.\" They're not going to pass PageRank or anchor text value or link trust, or whatever it is. We're just going to count the good stuff. I remember being in a session, this was years ago, probably five or six years ago, with Matt Cutts, the head of webspam for Google. He was looking at a site on his computer, and the person asked about their website from the audience, and he said, I see, I don't remember what it was, 14,000 odd links pointing to this site, but Google's actually only counting about 30 of them. That's why you're not ranking very well. Most of those links we've removed all the value that they pass. So it's not that they were having those bad links hurt the site. It's just that they're saying, \"Oh these are not going to pass any more link value.\" Now, what I would suggest here is, if you see stuff that looks like manipulative and negative SEO, you just be careful. We are trying to do some things here at SEOmoz to help with this. One of the things our data scientist, Dr. Matt Peters, is working with some folks here at Moz to build a large list of spam so we can do some classification, and eventually inside the Mozcape index, which will appear in Open Site Explorer, show up in your Pro-web app, show up in the Mozbar, we'll try and classify sites to say, \"Hey we're pretty sure this is spam. This looks like the kind of thing where we've pattern matched and seen Google penalize or ban a lot of these sites.\" We're also trying to build some metrics to show what are really good, high quality, and editorially given sites. So domain authority and page authority already exist to try and do that. Then, we're also running some experiments where I've offered up my personal blog, which is a relatively small site, probably has as few links as any of these, probably fewer than Just Good Cars, RandFishkin.com, to see if some of these nasty folks, who are hitting and taking down sites with negative SEO, would like to concentrate their focus on my sites. For two reasons, number one, we'd be very curious to see it happen, and number two, we can certainly afford the hit. We offered up SEOmoz as well. Most people seem to think that SEOmoz is not a good target. It won't actually be taken down. We're going to run some experiments internally as well on this front and hopefully be able to disprove that negative SEO is a common thing that works very well. I'd hate to see an industry spring up like this. I think that this type of activity, particularly some of these really nasty things, are just an awful part of being around the black hat spam-sphere. I hope that it's something that we can defend against. I hope you'll join me in contributing. I look forward to your comments. If you've seen stuff like this before, please do feel free to talk about it either anonymously or openly in the comments. I will see you again next week for another edition of Whiteboard Friday. Video transcription by Speechpad.com p.s. from Rand: I incorrectly noted the keyword for which Dan Thies' site lost rankings in the video as being his name. It was actually \"SEO Book.\" My apologies! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Negative SEO: Myths, Realities, and Precautions"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Negative SEO: Myths, Realities, and Precautions"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}