{
  "url": "https://moz.com/blog/net-neutrality-seo-whiteboard-friday",
  "slug": "net-neutrality-seo-whiteboard-friday",
  "title": "Why Net Neutrality Matters for SEO and Web Marketing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Net neutrality is a hot-button issue lately, and whether it's upheld or not could have real ramifications for the online marketing industry. In this Whiteboard Friday, Rand covers the potential consequences and fallout of losing net neutrality. Be sure to join the ensuing discussion in the comments!",
  "content": "Why Net Neutrality Matters for SEO and Web Marketing Marketing Industry | Whiteboard Friday By: Rand Fishkin April 21, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 21, 2017 Why Net Neutrality Matters for SEO and Web Marketing Marketing Industry | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Net neutrality is a hot-button issue lately, and whether it's upheld or not could have real ramifications for the online marketing industry. In this Whiteboard Friday, Rand covers the potential consequences and fallout of losing net neutrality. Be sure to join the ensuing discussion in the comments! Click on the whiteboard image above to open a high-resolution version in a new tab! Video Transcription Howdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week, we're taking a departure from our usual SEO tactics and marketing tactics to talk for a minute about net neutrality. Net neutrality is actually something that is hugely critical and massively important to web marketers, especially those of us who help small and medium businesses, local businesses, and websites that aren't in the top 100 most popular sites and wealthiest sites on the web.The reason that we're going to talk net neutrality is because, for the first time in a while, it's actually at high risk and there are some things that we might be able to do about it. By protecting net neutrality, especially here in the United States, although this is true all over the world, wherever you might be, we can actually help to preserve our jobs and our roles as marketers. I'll talk you through it in just a sec. What is net neutrality? So, to start off, you might be asking yourself, \"Okay, Rand, I might have heard of net neutrality, but explain to me what it is.\" I'm going to give you a very basic introduction, and then I'll invite you to dig deeper into it. But essentially, net neutrality is this idea that as a user of the Internet, through my Internet service provider — that might be through my cellphone network, that might be through my home Internet provider, through my Internet provider at work, these ISPs, a Verizon or a Comcast or a Cox or a T-Mobile or AT&T, those are all here in the United States and there are plenty of others overseas — you essentially can get access to the whole web equally, meaning that these ISPs are not regulating download speed based on someone paying them more or less or based on a website being favored by them or owned by them or invested in by them. Essentially, when you get access to the web, you get access to it equally. There's equality and neutrality for the entire Internet. Non-neutrality In a non-neutrality scenario, you can see my little fellow here is very unhappy, because his ISP is essentially regulating and saying, \"Hey, if you want to pay us $50 a month, you can have access to Google, Facebook, Twitter, and MSN. Then if you want to pay a little bit more, $100 a month, you can get access to all these second-tier sites, and we'll let you visit those and use those services. If you want to pay us $150 a month, you can get access to all websites.\" This is just one model of how a non-neutrality situation might work. There are a bunch of other ones. This is probably not the most realistic one, and it might be slightly hyperbolic, but the idea behind it is always the same — that essentially the ISP can work however they'd like. They are not bound by government rules and regulations requiring them to serve the entire web equally. Now, if you're an ISP, you can imagine that this is a wonderful scenario. If I'm AT&T or I'm Verizon, I might be maxing out how much money I can make from consumers, and I'm constantly having to be competitive against other ISPs. But if I can do this, I can then have a bunch more vectors (a) to get money from all these different websites and web services, and (b) to charge consumers much more based on tiering their access. So this is wonderful for me, which is why ISPs like Comcast and Verizon and AT&T and Cox and all these others have put a lot of money towards lobbyists to try and change the opinions of the federal government, and that's mostly, well, in the United States right now, it's the Republican administration and the folks in Congress and the Federal Communications Chair, who is Ajit Pai, recently selected by Trump as the new FCC Chair. Why should marketers care? Reasons that you should care about this as a web market are: 1. Equal footing for web access creates a more even playing field. Greater competition. It allows websites to compete with each other without having to pay and without having to only serve different consumers who may be paying different rates to their ISPs. It also means more players, because anyone can enter the field. Simply by registering a website and hosting it, you're now on an even playing field technically with everyone, with Google, with Facebook, with Microsoft, with Amazon. You get the same access, at least at the fundamental ISP level, with everyone else on the Internet. That means there's a lot more demand for competitive web marketing services, because there are many more businesses who need to compete and who can compete. Also much less of an inherent advantage for these big, established, rich players. If you're a very, very rich website, you have tons of money, you have tons of resources, lots of influence, it's easy to say, \"Hey, I'm not going to worry about this because I know I can always be in this lowest tier or whatever they're providing for free because I can pay the ISP, and I can influence government rules and regulations, and I can connect with all the different ISPs out there and make sure I'm always accessible.\" But for a small website, that's a nightmare scenario, incredibly hard, and it makes a huge competitive advantage by being big and established already, which means it's much tougher to get started. 2. The costs of getting started online are much lower under net neutrality. Currently, if you register your website and you start doing your hosting: You don't need to pay off any ISPs. You don't need to go approach Comcast or Verizon or AT&T or Cox or anybody like this and say, \"Hey, we would like to get on to your high-speed, fastest-tier, best-access plan.\" You don't have to do that, because net neutrality, the law of the land means that you are automatically guaranteed that. There's also no separate process. So it's not just the cost, it's also the work involved to go to these ISPs. There are several hundred ISPs with hundreds of thousands of active customers in the United States today. That number has generally been shrinking as that industry has been consolidating a little bit more. But still, that's a very, very challenging thing to have to do. If you are a big insurance provider, it's one thing to have someone go manage that task, but if you're a brand-new startup website, that's entirely another to try and do that. 3. The talent, the strategy, the quality of product and services and marketing that a new company, a new website has are going to create winners and losers in their field today versus this potential non-neutrality situation, where it's not quite a rigged system, but I'm calling it a rigged system a little bit because of this built-in advantage that you have for money and influence. I think we would all generally agree that, in 2017, in late-stage capitalist societies, that, generally speaking, there's already a huge advantage by having a lot of money and influence. I'm not sure those with money and influence necessarily need another leg up on entrepreneurs and startups and folks who are trying to compete on the web. What might happen? Now, maybe you'll disagree, but I think that these together make a very compelling case scenario. Here's what might actually happen. \"Fast lanes\" for some sites - Most observers of the space think that fast lanes would become a default. So fast lanes, meaning that certain tiers, certain parts of the web, certain web services and companies would get fast access. Others would be slower or potentially even disallowed on certain ISPs. That would create some real challenges. Free vs. paid access by some ISPs - There would probably be some free and some paid services. You can see T-Mobile actually tried to do this recently, where they basically said, \"Hey, if you are on a T-Mobile device, even if you're paying us the smallest amount, we're going to allow you to access these certain things.\" I think it was a video service for free. Essentially, that currently is against the rules. You might say, \"Rand, that seems unfair. Why shouldn't T-Mobile be able to offer some access to the web for free and then you just have to pay for the rest of it?\" I hear you. I think unfortunately that's a bit of a red herring, because that particular implementation of a non-neutral situation is not that bad. It's not particularly bad for consumers. It's not particularly bad for businesses. If T-Mobile just charged their normal rate, and then they happen to have this, \"Oh, by the way, here you get this little portion of the web for free,\" no one's going to complain about that. It's not particularly terrible. But it does violate net neutrality, and it is a very slippery slope to a world like this, a very painful world for a lot of people. That's why we're willing to sort of take the sacrifices of saying, \"Hey, we don't want to allow this because it violates the principle and the law of net neutrality.\" Payoffs required for access or speed - Then the third thing that would almost certainly happen is that there would be payoffs. There would be payoffs on both sides. You have to pay more as a consumer, to your ISP, in order to access the web in the way that you do today, and as a website, in order to reach consumers who maybe can't afford or choose not to pay more, you have to pay off the ISP to get that full access. What's the risk? Why am I bringing this up now? Higher than ever... Why is the risk so high? Well, it turns out the new American administration has basically come out against net neutrality in a very aggressive fashion. The new FCC Chair, Ajit Pai, has been fighting this pretty hard. He's made a bunch of statements just in the last few days. He actually overturned some rulings from years past that asked smaller ISPs to be transparent about their net neutrality practices, and that's been overturned. He's arguing this basically under what I'm going to call a guise of free markets and competitive marketplaces. I think that is a total misnomer. This creates a truly equal marketplace for everyone. While it is somewhat restrictive, I think one of the most interesting things to observe about this is that this is a non-political issue or at least not a very politicized issue for most of American voters. Actually, 81% of Democrats in a Gallup survey said that they support net neutrality, and an even greater percent of Republicans, 85%, said they support net neutrality.* So, really, you have virtually an overwhelming swath of voters in the United States who are saying this should be the law of the land. The reason that this is generally being fought against by both Congress and the FCC is because these big ISPs have a lot of money, and they've paid a lot of lobbying dollars to try and influence politics. For those of you outside the United States, I know that sounds like it should be illegal. It's not in our country. I know it's illegal in most democracies, but it's sort of how democracy in the United States works. *Editor's note: This poll was conducted by the University of Delaware. What can we do? If you want to take some action on this and fight back and tell your Congress person, your senator, your representatives locally and federally that you are against this, I would check out SaveTheInternet.com for those folks who are in the United States. For whatever country you're in, I would urge you to search for \"support net neutrality\" and check out the initiatives that may be available in your country or your geography locally so that you can take some action. This is something that we've fought against as Internet users in the past and as businesses on the web before, and I think we're going to have to renew that fight in order to maintain the status quo and keep equal footing with each other. This will help us preserve our careers in web marketing, but it will also help preserve an open, free, competitive Internet. I think that's something we can all agree is very important. All right. Thanks, everyone. Look forward to your comments. Certainly open to your critiques. Please try and keep them as kosher and as kind as you can. I know when it gets into political territory, it can be a little frustrating. And we will see you again next week for another edition of Whiteboard Friday. Take care. \u0003Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why Net Neutrality Matters for SEO and Web Marketing"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why Net Neutrality Matters for SEO and Web Marketing"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "What is net neutrality?"
    },
    {
      "level": "H2",
      "text": "Non-neutrality"
    },
    {
      "level": "H2",
      "text": "Why should marketers care?"
    },
    {
      "level": "H2",
      "text": "What might happen?"
    },
    {
      "level": "H2",
      "text": "What's the risk?"
    },
    {
      "level": "H2",
      "text": "What can we do?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}