{
  "url": "https://moz.com/blog/netdisaster",
  "slug": "netdisaster",
  "title": "NetDisaster - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Paralleling the topic of yesterday's \"humor as link-building\" subject, today I've stumbled across a site called NetDisaster that will take a given URL and turn the page into a private battlefield for Martians, meteors and other untimely disasters....",
  "content": "NetDisaster Moz News By: Rand Fishkin April 5, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 5, 2005 NetDisaster Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Paralleling the topic of yesterday's \"humor as link-building\" subject, today I've stumbled across a site called NetDisaster that will take a given URL and turn the page into a private battlefield for Martians, meteors and other untimely disasters.The ability of sites like these to get links is based on the usability of the site, the features of the services offered, the price (free) & the ability to receive initial notice. When link building with alternative tactics like this, it's not always neccessary to manually submit or actively search for link partners - a few, well-placed notices at places like Craigslist, major online forums and an e-mail to a few of the bigger bloggers can help to drive a lot of traffic that will build the links for you. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "NetDisaster"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "NetDisaster"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}