{
  "url": "https://moz.com/blog/new-seomoz-web-app-now-in-beta",
  "slug": "new-seomoz-web-app-now-in-beta",
  "title": "New SEOmoz Web App Now in Beta for PRO Members - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If you've been using SEOmoz's tools for a while, you've likely come across the same frustration that many of us have - they're great, but it's such a pain to run a separate tool and separate report for each aspect of your SEO. That's why, for the past year, we've been working towards building a new…",
  "content": "New SEOmoz Web App Now in Beta for PRO Members SEO Tools By: Rand Fishkin August 11, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 11, 2010 New SEOmoz Web App Now in Beta for PRO Members SEO Tools The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. If you've been using SEOmoz's tools for a while, you've likely run across the same challenge we have -- the data rocks, but you have to run a separate tool and report for each aspect of your SEO. That's why, for the past year, we've been building a new platform to house all of the features and functionality of the SEOmoz toolset, and includes the ability to track metrics over time. We call it the SEOmoz \"Web App.\" It's hard for me to resist making this post nothing but a huge collection of screenshots... Starting TODAY (right now, in fact!), every PRO member has BETA access to the new web app. We encourage you to create your first campaign(s), start tracking some rankings, crawling some pages and getting those optimization recommendations. The web app is our first application to automatically track data for any site(s) you care about on an ongoing, consistent basis, and make recommendations based on what we find. Thus, the real value comes after a week or two of tracking, and it gets more valuable, useful and reference worthy over time. One of our big goals was to make this app give back some beautiful screenshots and reports showing your progress in reducing the crawl problems, improving optimization and gaining in the rankings over time. How it WorksThe challenge with doing SEO on sites bigger than a few dozen pages is that no human has time to visit every page on a regular basis and check to make sure nothing is wrong, no opportunities are missed, no errors are present, and no search rankings are being unintentionally forfeited through poor optimization. The web app is designed to solve this by: #1 - Crawling all the pages on your site every week and identifying potential issues in three categories: Errors - like 404s, 500s, missing titles, duplicate content, etc. Warnings - such as 302s, overly dynamic URL strings, long title elements, meta refreshes, etc. Notices - not problems, per se, but issues you might want to be aware of like 301s, rel=canonical tags, meta robots blocking, etc. While we love what Google's Webmaster Tools does on this front, we felt there were a lot more issues we wanted to see. #2 - Tracking Rankings on the keywords you choose and automatically grading the pages that rank in the top 50 for their on-page optimization. It's a simple concept, but a powerful one. Why? Because, we often found that: URLs ranking on page 2, 3 or 4 for a keyword phrase could move up dramatically in rankings and traffic with just a bit of keyword tweaking Sometimes, SEOs & marketers might not even realize they had a page that was competitive for a keyword, and showing off that potential automatically could make a huge difference Tracking rankings can help identify potential causes of rising/falling traffic and give a key baseline for performance, particularly as we add in data like traffic via web analytics, keyword difficulty scores and estimated search volume. Basic rank tracking is great, but we think there's a lot more you can do with the data when it's integrated with other KPIs and metrics Tracking competitors simultaneously is helpful for those SEOs who want to keep special tabs on select sites #3 - On-Page Grading & Recommendations serve as a great companion to rank tracking, enabling easy identification of low hanging fruit (poorly optimized pages that still rank in the top 50 results are often huge opportunities for improved rankings and traffic). We built this feature because: It's frustrating to figure out the best practices for on-page optimziation, but our correlation and ranking models work have made some valuable strides that deserve to be shared. No one can visit hundreds or thousands of pages and find all the keywords that are suboptimally targeted. The web app (particularly in concert with tip #1 below) can and it will message these with easy-to-parse grades and simple recommendations. You can feel confident that the on-page recommendations are consitently updating with best practices. As we learn more through testing/research or as algorithms change (we re-do our ranking models every few months), that information will quickly make its way into the on-page report cards. An \"A\"! That's good news. Still missing a few recommendations that might be worth checking out, though. Aha! Using the keyword in the alt attribute might be a good addition (both for normal web rankings and for image SEO) #4 - Link Analysis for your site and those of key competitors. This tab is still in progress, but in the future, we plan to integrate all of the link analysis abilities of Open Site Explorer and add historical tracking, competitive SERPs analysis and more. Much more functionality coming soon #5 - One Comprehensive System to Rule It All. More so than any single feature, we wanted to begin the process of replicating all the functionality of SEOmoz's PRO tools into a single, integrated platform. You should be able to do all your SEO from one place - the web app. The functionality released today is just a tiny part of what's to come. Now I can see and access all the sites I care about from one place in my PRO account.How Does this Affect My PRO Account?If you're already PRO, think of this as a big, new feature that's ready to start tracking data for you today. None of the old tools, functionality, guides, Q+A, tips, webinars, etc. are going away. We're just adding the web app as a key part of the SEOmoz PRO package. We are, however, making a few shifts that I think you'll really like. Previously, PRO membership tiers had limits for how many Linkscape reports they could run. We've scaled up our servers to the point where we can handle pretty hefty quantities of requests, so as of today, we're removing your Linkscape advanced report limits - all PRO members can now run unlimited numbers of Linkscape reports. Q+A remains the same, as does access to all the other tools + content. Here's the new PRO membership plans: You may notice we've changed our pricing; however, these prices are for new members only. Existing PRO members will continue to pay what they have in the past, but receive the expanded benefits and privileges we're launching today. It's our way of saying thanks for joining us in the early days. PRO members - you'll get an email soon detailing the improvements/upgrades to your membership. If you're not yet PRO, we're keeping the PRO price of $79/month available until August 25th (14 days from now). After that, the price will go up to $99/month. If you sign up now (at $79/month), you'll be grandfathered in and won't be subject to future price increases. And, as always, as PRO membership gets better, you'll get immediate access to new features & upgrades and we'll never raise your price. 5 Quick Tips to Get StartedThe web app is certainly designed to be largely self-explanatory and I'm sure many of you have already jumped in and given it a spin. But, for those seeking a few tricks, here's some that we've found in the last few weeks of using it for projects (some in concert with our consulting friends at Distilled). #1 - Import some of your top referring keywords from your analytics When I started the SEOmoz campaign, I grabbed our top few hundred keywords that referred traffic and imported them through the manage keywords input box (which kindly accepts CSV, TSV and carriage-return separated inputs). By exporting my list of top keywords from Google Analytics and pasting them into the web app, I've got easy tracking on tons of keywords I care about, and a chance to find some missed opportunities. #2 - Find pages that rank in the top 10-30 with low grades (Cs, Ds and Fs) When my rankings and on-page reports came back, I found tons of pages that got Cs or Ds ranking in position 5-50, ripe for improvement. Those Cs, Ds and Fs are gonna turn into As and send us a lot more traffic! The best part is the automation - it's a simple process, but an incredibly tedious one if performed manually. The web app's a lifesaver on that front. Those Cs, Ds and Fs, if improved to As and Bs, will likely bring up rankings, particularly on the less competitive terms and phrases and those where I may have the links I need to rank, but never took the time to do on-page optimization. Editing a few page titles and adding some keywords to content never felt so rewarding. #3 - Use the \"grade any page\" easter egg feature The web app's on-page optimization system will soon be replacing our tired and somewhat rickety term target tool. In the meantime, you can run \"one-off\" reports through an easter egg feature. Just create the keyword you care about and you can edit the URL field manually to grade any page for any term/phrase: Notice the highlighted portion in blue in the screenshot - easter egg FTW! #4 - Apply labels to your keyword groups to separately track relevant data/metrics Nearly every section of the app allows for filtering based on keyword group, error type, etc. By building smart keyword groups (via the \"manage keywords\" page) to align with the types of terms/phrases I care about, I can separately build reports showing performance in rankings and on-page optimization for those labels. #5 - Point out crawl diagnostic issues to a friend or potential client If your friend has a website with some crawl issues, I'm sure they'd appreciate having that pointed out - you can even export the crawl results to CSV and email it over. Likewise, if you've got clients or managers you're trying to convince to do some SEO fixes, the diagnostic visualization can be very handy to show off the problem. Sending over this report might just bring your buddy a bit more search traffic (or help you win a new client)! What's Next?Oh, believe me - we're just getting warmed up. :-) Our engineering team is committed to regular updates every few weeks, starting with something big a couple weeks from today. Those updates will add features, fix bugs and help grow this web app into the platform professional SEOs deserve - a system that lets you perform all of the essential tasks of SEO from one place - from building, submitting and managing XML Sitemaps to tracking your ROI from organic keywords through integration with your analytics package to tracking search results in verticals like video, maps/local, news, images, et al. to mapping your crawl data from Webmaster Tools against your indexation of pages receiving search traffic (we've had some good chats with the WM Tools team about integrating their API in cool ways) and much, much more. We'll be publishing a post this weekend inviting you to vote for features you'd most like to see. That feedback will be used to help prioritize our work, so suggest now, vote on the weekend and you'll see what you want in the app even sooner! We Need Your FeedbackThe web app is the basis for our future plans around providing great SEO software, and we need your help to make it amazing. On every page of the web app, you'll find a feedback tab on the left-hand side of the page. Please click it often and tell us what you found frustrating, what more you want to see, and even what you liked and want more of. Our team reads every one and build priorities based on the most-requested features. We also know there's going to be bugs at launch. Some early ones we're aware of include: Slowness - many of the web app pages take 10-15 seconds or more to load depending on the quantity of keywords, issues or other data involved. We're working to cache much of this in databases for much faster retrieval in the next few weeks. Crawl & Rankings Retrieval - your first data will take 5-20 minutes to populate. We do an initial \"speed crawl\" of 250 pages, but to be respectful of server load issues, we're pretty cautious with our requests. That first hour inside the app after creation may feel a bit empty, but just wait, it gets much better :-) On-Page Grades - edge cases, including keywords that are out of order or have odd broad matching aren't perfect yet. We'll be working to fix this and make this experience as seemless as possible. Root Domains - currently, campaigns can only be created with single subdomains (e.g. www.seomoz.org, not *.seomoz.org). We're working to make root domains an option as well, so you can track all the pages at mydomain.com, www.mydomain.com, blog.mydomain.com, etc. in one campaign. Adding more than 10 Keywords Simultaneously - to help with load as we begin public testing, we'll only collect rankings for the first 10-20 keywords entered immediately (within 10-15 minutes). If you add 50 or 500 keywords at once, we're limiting rankings and on-page checks until your next update date for now. This isn't just another tool - it's a new approach for SEOmoz - creating an application that uses crawl data, APIs and integrated research to improve your productivity and simplify SEO. But, we need to be realistic - in this first iteration, we're not just in beta, we're at the nascent stages of the app's potential. What we're launching today is pretty remarkable, and I feel confident that for nearly everyone reading this post, it can help you earn a considerable amount more traffic from the search engines. That said, the future is what we feel best about, particularly since we hope to have your help in the improvement process. This is very much a BETA launch, but we think you'll enjoy playing around with the app and get a lot of value in return. So, what are you waiting for? Go build a campaign! p.s. If you'd like to learn more, check out our FREE WEBINAR on the Web App coming up this Friday, August 13th at 10am Pacific - Register here. And you can still sign up for the SEOmoz Tools Training at our Seattle Seminar later this month (we've just added more seats). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "New SEOmoz Web App Now in Beta for PRO Members"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "New SEOmoz Web App Now in Beta for PRO Members"
    },
    {
      "level": "H2",
      "text": "How it Works"
    },
    {
      "level": "H2",
      "text": "How Does this Affect My PRO Account?"
    },
    {
      "level": "H2",
      "text": "5 Quick Tips to Get Started"
    },
    {
      "level": "H2",
      "text": "What's Next?"
    },
    {
      "level": "H2",
      "text": "We Need Your Feedback"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}