{
  "url": "https://moz.com/blog/new-page-authority",
  "slug": "new-page-authority",
  "title": "Page Authority 2.0 Is Coming This Month - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Long gone are the days of just counting backlinks a couple of ways and hoping they correlate well with SERPs. As Moz tends to do, we’re pioneering a new manner of calculating Page Authority to produce superior results. Here are some of the ways we’re changing things up.",
  "content": "Page Authority 2.0 Is Coming This Month: What’s Changing and Why Moz Tools | SEO Reporting | Link Building By: Russ Jones September 1, 2020 Table of Contents Copied! By: Russ Jones September 1, 2020 Page Authority 2.0 Is Coming This Month: What’s Changing and Why Moz Tools | SEO Reporting | Link Building We’ve made the tough decision to delay the launch of Page Authority 2.0 as our team investigates an unforeseen issue. To learn more about the rigorous testing process and updates to the timeline, check out this blog post. Hey folks, I'm Russ Jones, Adjunct Search Scientist with Moz, and I'm proud to announce that this month we’ll be releasing a terrific update to our metric, Page Authority (PA). Although Page Authority hasn't attracted the same attention as its sibling metric Domain Authority, PA has always correlated with SERPs much better than DA, serving as a strong predictor of ranking. While PA has always fluctuated with changes in the link graph, we’re introducing a whole new method of deriving the score. Learn more about Page Authority 2.0 What's changing Long gone are the days of just counting backlinks a couple of ways and hoping they correlate well with SERPs. As Moz tends to do, we’re pioneering a new manner of calculating Page Authority to produce superior results. Here are some of the ways we’re changing things up: The training set In the past, we used SERPs alone to train the Page Authority model. While this method was simple and direct, it left much to be desired. Our first step in addressing the new Page Authority is redefining the training set altogether. Instead of modeling Page Authority based on one page's ability to outrank another page, we now train based on the cumulative value of a page based on a number of metrics including search traffic and CPC. While this is a bit of an oversimplification of what’s going on, this methodology allows us to better compare pages that don't appear in the SERPs together. For example, imagine Page A is on one topic and Page B is on another topic. Historically, our model wouldn't get to compare these two pages because they never appear on the same SERP. This new methodology provides an abstract value to each page, such that they can be compared with any other page by the machine-learned model. The re-training set One of the biggest problems in building metrics is not what the models see, but what the models don't see. Think about this for a minute: what types of URLs don't show up in the SERPs that the model will use to produce Page Authority? Well, for starters, there won't be many images or other binary files. There also won't be penalized pages. In order to address this problem, we now use a common solution of running the model, identifying outliers (high PA URLs which do not in fact have any search value), and then feeding those URLs back into the training set. We can then re-run the model such that it learns from its own mistakes. This can be repeated as many times as is necessary to reduce the number of outliers. Ripping off the Band-Aid Moz is always cognizant of the impact the changes to our metrics might have on our customers. There is a trade-off between continuity and accuracy. With Page Authority, we’re focusing on accuracy. This may cause larger-than-normal shifts in your Page Authority, so it’s more important than ever to think about Page Authority with respect to your competitors, not as a standalone number. What actions should we take? Communicate with stakeholders, team members, and clients about the update Just like our upgrade to Domain Authority, some users will likely be surprised by changes in their PA. Make sure they understand that the new PA will be more accurate (and more useful!) and that the most important measurement is relative to their competitors. We won't release a Page Authority which isn't better than the previous version, so even if the results are disappointing, understand that you now have better insight than ever before into the performance of your pages in the SERPs. Use PA as a relative metric, like DA Page Authority is intrinsically comparative. A PA of 70 means nothing unless you know the PA of your competitors. It could be high enough to allow you to rank for every keyword you like, or it could be terribly low because your competitors are Wikipedia and Quora. The first thing you should do when analyzing the Page Authority of any URL is set it in the proper context of its competitor's URLs. Expect PA to keep pace with Google Just as we announced with Domain Authority, we’re not going to launch the new PA and just let it go. Our intent is to continue to improve upon the model as we discover new and better features and models. This volatility will mostly affect pages with unnatural link profiles, but we would rather stay up-to-date with Google's algorithms even if it means a bit of a bumpy ride. When is it launching? We’ll be rolling out the new Page Authority on September 30, 2020. Between now and then, we encourage you to explore our resources to help you prepare and facilitate conversations with clients and team members. Following the launch of the new PA, I’ll also be hosting a webinar on October 15 to discuss how to leverage the metric. We’re so excited about the new and improved PA and hope you’re looking forward to this update too. If you have any questions, please comment below, reach out to me on Twitter @rjonesx, or email me at russ@moz.com. To get prepared and learn more about the upcoming change to Page Authority, be sure to dig into our helpful resources: Visit the PA Resource Center Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Page Authority 2.0 Is Coming This Month: What’s Changing and Why"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Page Authority 2.0 Is Coming This Month: What’s Changing and Why"
    },
    {
      "level": "H2",
      "text": "What's changing"
    },
    {
      "level": "H3",
      "text": "The training set"
    },
    {
      "level": "H3",
      "text": "The re-training set"
    },
    {
      "level": "H3",
      "text": "Ripping off the Band-Aid"
    },
    {
      "level": "H2",
      "text": "What actions should we take?"
    },
    {
      "level": "H3",
      "text": "Communicate with stakeholders, team members, and clients about the update"
    },
    {
      "level": "H3",
      "text": "Use PA as a relative metric, like DA"
    },
    {
      "level": "H3",
      "text": "Expect PA to keep pace with Google"
    },
    {
      "level": "H2",
      "text": "When is it launching?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "Moz AI: Introducing Augmented Intelligence"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Russ Jones\n          \n            Russ Jones\n          \n            Russ Jones"
}