{
  "url": "https://moz.com/blog/new-premium-services-link-directory-juicy-link-finder-tool-new-pricing",
  "slug": "new-premium-services-link-directory-juicy-link-finder-tool-new-pricing",
  "title": "New Premium Services - Link Directory & Juicy Link Finder Tool + New Pricing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As promised, SEOmoz has new rates for premium membership today:\n\n    Monthly Subscription - now $49/month\n    6 Month Membership - now $249 (15% off monthly rate)\n    1 Year Membership - now $399 (32% off monthly rate)\n\nWe've also got some very exciting new features for premium members. The first…",
  "content": "New Premium Services - Link Directory & Juicy Link Finder Tool + New Pricing Moz News By: Rand Fishkin July 18, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 18, 2007 New Premium Services - Link Directory & Juicy Link Finder Tool + New Pricing Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As promised, SEOmoz has new rates for premium membership today: Monthly Subscription - now $49/month 6 Month Membership - now $249 (15% off monthly rate) 1 Year Membership - now $399 (32% off monthly rate) We've also got some very exciting new features for premium members. The first of these is the brainchild of Matt, who noted that a tiny bit of data about the SERPs could make for some great link discovery. The new tool - Juicy Link Finder - displays a list of URLs ranking in the top 50, 100, or 200 results, along with their age and the PageRank of the domain. It then links to a Google search for likely places to grab links on those domains - a brilliant addition. _ _ The next spiffy offering isn't a tool, but it's also an invaluable resource for link builders. One of the big problems I noticed in the sphere of SEO was this proliferation of two ideas, which are, in my opinion, dead wrong: Directory Link Building is Dead General Subject Directories Built for SEOs and PageRank are Valuable I know these seem like conflicting opinions, but let me explain. Directory link building is not dead. There are thousands of resource lists on the web in industries of all shapes and sizes that link out to excellent websites from excellent domains. However, these sites are tough to find, tough to get into, and often extremely selective about who they accept, which makes them less attractive to those seeking link quantity over quality. Likewise, those built-for-SEO-style directories that so many folks in the search world operate are typically pretty useless. If you run a few searches on domains like that, even the ones that have a PageRank of 4-7, you'll often find that the directory pages themselves rank at the tail end of the results, even for the exact words in their title tags - a very good sign that Google isn't giving them a lot of respect (and why should they?). However, there's a desperate need for a true list of valuable directories and link building sources, and we've created one. Currently, we've got about 78 different sites listed, from Emily Chang's eHub (a great link for those in the Web 2.0 world) to the Pennsylvania Commonwealth Libraries Recommended Websites. For each of these, we've listed our guess at the value of the links (from weak to exceptional), PageRank, & Inlinks to the domain and a direct link (where applicable) to the submission page. Much like our premium tips section, we plan to add new link sources every week to make the value even higher over time. You can check it out here - The SEOmoz Link Directory. I believe that with these two additions, the value of link building related resources on SEOmoz has risen dramatically. But, Rand, you promised to provide free tools and guides in concert with any premium material! Yes, I know... And we're hard at work on it. We should have another very cool tool coming out next week that will be free to everyone, and we'll be working on a new free guide as well. It's a tough balancing act, but we certainly want to do our best to remain committed to providing high value free resources as well as premium services. After all, we want to earn the \"moz\" in SEOmoz :) p.s. Matt hasn't quite updated the pricing yet, so you can still slip in at the old pricing for a few more hours. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "New Premium Services - Link Directory & Juicy Link Finder Tool + New Pricing"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "New Premium Services - Link Directory & Juicy Link Finder Tool + New Pricing"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}