{
  "url": "https://moz.com/blog/new-data-reveals-67-of-consumers-are-influenced-by-online-reviews",
  "slug": "new-data-reveals-67-of-consumers-are-influenced-by-online-reviews",
  "title": "New Study: Data Reveals 67% of Consumers are Influenced by Online Reviews - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Ignore online reviews at your own peril, as they greatly influence prospects who are looking to do business with your brand.",
  "content": "New Study: Data Reveals 67% of Consumers are Influenced by Online Reviews Reputation Management | Branding By: Dan Hinckley September 2, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Dan Hinckley September 2, 2015 New Study: Data Reveals 67% of Consumers are Influenced by Online Reviews Reputation Management | Branding The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Google processed over 1 trillion search queries in 2014. As Google Search continues to further integrate into our normal daily activities, those search results become increasingly important, especially when individuals are searching for information about a company or product. To better understand just how much of an impact Google has on an individual’s purchasing decisions, we set up a research study with a group of 1,000 consumers through Google Consumer Surveys. The study investigates how individuals interact with Google and other major sites during the buying process. Do searchers go beyond page 1 of Google? We first sought to understand how deeply people went into the Google search results. We wanted to know if people tended to stop at page 1 of the search results, or if they dug deeper into page 2 and beyond. A better understanding of how many pages of search results are viewed provides insight into how many result pages we should monitor related to a brand or product. When asked, 36% of respondents claimed to look through the first two pages or more of search results. But, looking at actual search data, it is clear that individuals view less than 2% of searches below the top five results on the first page. From this, it is clear that actual consumer behavior differs from self-reported search activity. Takeaway: People are willing to view as many as two pages of search results but rarely do so during normal search activities. Are purchasing decisions affected by online reviews? Google has integrated reviews into the Google+ Local initiative and often displays these reviews near the top of search results for businesses. Other review sites, such as Yelp and TripAdvisor, will also often rank near the top for search queries for a company or product. Because of the prevalence of review sites appearing in the search results for brands and products, we wanted a better understanding of how these reviews impacted consumers’ decision-making. We asked participants, “When making a major purchase such as an appliance, a smart phone, or even a car, how important are online reviews in your decision-making?” The results revealed that online reviews impact 67.7% of respondents' purchasing decisions. More than half of the respondents (54.7%) admitted that online reviews are fairly, very, or absolutely an important part of their decision-making process. Takeaway: Companies need to take reviews seriously. Restaurant review stories receive all the press, but most companies will eventually have pages from review sites ranking for their names. Building a strong base of positive reviews now will help protect against any negative reviews down the road. When do negative reviews cost your business customers? Our research also uncovered that businesses risk losing as many as 22% of customers when just one negative article is found by users considering buying their product. If three negative articles pop up in a search query, the potential for lost customers increases to 59.2%. Have four or more negative articles about your company or product appearing in Google search results? You’re likely to lose 70% of potential customers. Takeaway: It is critical to keep page 1 of your Google search results clean of any negative content or reviews. Having just one negative review could cost you nearly a quarter of all potential customers who began researching your brand (which means they were likely deep in the conversion funnel). What sites do people visit before buying a product or service? Google Search is just one of the sites that consumers can visit to research a brand or product. We thought it would be interesting to identify other popular consumer research sites. Interestingly, most people didn't seem to remember visiting any of the popular review sites. Instead, the brand site that got the most attention was Google+ Local reviews. Another noteworthy finding was that Amazon came in second, with half the selections that Google received. Finally, the stats show that more people look to Wikipedia for information about a company than to Yelp or TripAdvisor. Takeaway: Brands should invest time and effort into building a strong community on the Google+, which could lead to receiving more positive reviews on the social platform. Online reviews impact the bottom line The results of the study show that online reviews have a significant influence on the decision-making process of consumers. The data supports the fact that Internet users are generally willing to look at the first and second page of Google search results when searching for details about a product or company. We can also conclude that online review sites like Google+ Local are heavily visited by potential customers looking for information, and the more negative content they find there, the less likely they will be to purchase your products or visit your business. All this information paints a clear picture that what is included in Google search results for a company or product name will inevitably have an impact on the profitability of that company or product. Internal marketing teams and public relation firms (PR) must consider the results that Google displays when they search for their company name or merchandise. Negative reviews, negative press, and other damaging feedback can have a lasting impact on a company’s ability to sell their products or services. How to protect your company in Google search results A PR or marketing team must be proactive to effectively protect a company’s online reputation. The following tactics can help prevent a company from suffering from deleterious online reviews: First, identify if negative articles already exist on the first two pages of search results for a Google query of a company name or product (e.g., “Walmart”). This simple task should be conducted regularly. Google often shifts search results around, so a negative article—which typically attracts a higher click-through rate—is unfortunately likely to climb the rankings as individuals engage with the piece. Next, monitor and analyze the current sentiment of reviews on popular review sites like Google+ and Amazon. Other sites, like Yelp or Trip Advisor, should also be checked often, as they can quickly climb Google search results. Do not attempt to artificially alter the results, but instead look for best practices on how to improve Yelp reviews or other review sites and implement them. The goal is to naturally improve the general buzz around your business.If negative articles exist, there are solutions for improvement. A company’s marketing and public relations team may benefit by highlighting and/or generating positive press and reviews about the product or service through SEO and ORM efforts. By gaining control of the search results for your company or product, you will be in control of the main message that individuals see when looking for more information about your business. That's done by working to ensure prospects and customers enjoy a satisfying experience when interacting with your brand, whether online or offline. Being proactive with a brand’s reputation, as viewed in the Google search results and on review sites, does have an impact on the bottom line. As we see in the data, people are less likely to make a purchase as the amount of negative reviews increase in Google search results. By actively ensuring that honest, positive reviews appear, you can win over potential customers. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "New Study: Data Reveals 67% of Consumers are Influenced by Online Reviews"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "New Study: Data Reveals 67% of Consumers are Influenced by Online Reviews"
    },
    {
      "level": "H2",
      "text": "Do searchers go beyond page 1 of Google?"
    },
    {
      "level": "H2",
      "text": "Are purchasing decisions affected by online reviews?"
    },
    {
      "level": "H3",
      "text": "When do negative reviews cost your business customers?"
    },
    {
      "level": "H3",
      "text": "What sites do people visit before buying a product or service?"
    },
    {
      "level": "H2",
      "text": "Online reviews impact the bottom line"
    },
    {
      "level": "H2",
      "text": "How to protect your company in Google search results"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Acknowledge and Cope with Fear of Local Business Reviews"
    },
    {
      "level": "H3",
      "text": "Celebrating Canada’s Small Business Month With Sustainable Local Biz Tips"
    },
    {
      "level": "H3",
      "text": "Takeaways from an Irish Locksmith Listing Spam Scandal"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dan Hinckley\n          \n            Dan Hinckley\n          \n            Dan Hinckley"
}