{
  "url": "https://moz.com/blog/new-illustrated-guide-to-search-friendliness-and-shock-shock-ads-on-seomoz",
  "slug": "new-illustrated-guide-to-search-friendliness-and-shock-shock-ads-on-seomoz",
  "title": "New Illustrated Guide to Search Friendliness and - Shock, Shock! Ads on SEOmoz - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Today I'm very proud to announce that the Illustrated Guide to Search Friendliness is finally complete. I've personally been working on it for over a month - completely writing it from scratch and doing all the designs and illustrations, too. I'm incredibly happy with the results, and I think you…",
  "content": "New Illustrated Guide to Search Friendliness and - Shock, Shock! Ads on SEOmoz Moz News By: Rand Fishkin April 25, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 25, 2007 New Illustrated Guide to Search Friendliness and - Shock, Shock! Ads on SEOmoz Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Today I'm very proud to announce that the Illustrated Guide to Building a Search Friendly Website is finally complete. I've personally been working on it for over a month - completely writing it from scratch and doing all the designs and illustrations. I'm incredibly happy with the results, and I think you will be, too. This guide is, in my opinion, one of the most valuable documents SEOmoz has ever produced. It includes almost everything a web developer or publisher would need to know to build a site that follows the best practices of optimizing for search engines. Plus, it includes tons of clever illustrations: As I noted in the past, we only release premium articles when we've provided something free first. In this case, that was our search engine ranking factors V2, which is on par quality-wise. However, we are going down a bit of the corporate road and also launching ads on SEOmoz. Don't worry, they're our ads, not anyone else's, and they only show for certain folks. For example, our \"overlay\" ad, the most intrusive (but also cool looking), only displays on your first visit to the site every two weeks (and only if you're not logged in as a member). Here's what you'll see: See an example of this (even if you are logged in) here We also have inline ads, ala Aaron Wall's suggestion (so blame him if you're angry ), for the premium content, which displays to non-premium members and the general public. We are seeking to ramp up premium membership and offer as much fantastic content as possible to you, both for free and in paid format. We love working on this kind of material and we think that it offers far greater access to the information we've collected (in a more egalatarian fashion) than our consulting services. Speaking of consulting services, Gillian and I have recently made the decision to move to $1,000 an hour consulting prices. Yes, it's prohibitive, but we also think it accurately portrays the cost of time for our organization at this point. It also makes many of our recommended providers an even better choice. :) p.s. Yes! I do plan to report back about the performance of these ads, and we certainly will be sharing lots of statistics from SEOmoz that you can use as a case study for your own projects/clients. UPDATE: We've made a few changes to the ads - mostly the overlay, which now displays on your 2nd click to the site each week, and only if you're not a logged-in, premium member. We'll be playing around with them more and more over time - we're considering making special, more \"fun\" overlays for those who are regular members - maybe a comic strip from Rebecca or the like. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "New Illustrated Guide to Search Friendliness and - Shock, Shock! Ads on SEOmoz"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "New Illustrated Guide to Search Friendliness and - Shock, Shock! Ads on SEOmoz"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}