{
  "url": "https://moz.com/blog/new-guide-release-the-professionals-guide-to-advanced-search-operators",
  "slug": "new-guide-release-the-professionals-guide-to-advanced-search-operators",
  "title": "New Guide Release: The Professional's Guide to Advanced Search Operators - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Ladies and gentlemen, another guide has seen the light of day! Hooray! Our newest debut is The Professional's Guide to Advanced Search Operators. Available in web and document format, this guide covers advanced searching and identifies various search operators that can help with competitive…",
  "content": "New Guide Release: The Professional's Guide to Advanced Search Operators Moz News By: Rebecca Kelley August 20, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley August 20, 2008 New Guide Release: The Professional's Guide to Advanced Search Operators Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Ladies and gentlemen, another guide has seen the light of day! Hooray! Our newest debut is The Professional's Guide to Advanced Search Operators. Available in web and document format, it covers advanced searching and identifies various search operators that can help with competitive analysis, keyword research, site auditing, link building, and more. The guide also shares some valuable SEO tools available on the web. A sneak peek at some of the information found in the guide This is by far one of the most valuable articles we've released. Written by Ann Smarty (an SEOmoz member/YOUmoz author and blogger for Search Engine Journal), the guide provides some fantastic charts that detail each engine's various search operators and compares them across the board. I've shared the Table of Contents below to get you an idea of what exactly the article encompasses: Introduction: Who is This Guide For? How & When to Employ Tools, Queries & Web Services Valuable Web-Based Tools for SEOs Advanced Search Queries Google Queries Yahoo! Queries MSN/Live Queries Comparison of Advanced Search Operators Across Google, Yahoo! and MSN Other Engines & Query Sources Valuable Search-Related Services on the Web Closing: Employing Queries, Services & Tools for Direct ROI Like our recently released Professional's Guide to Blogging, The Professional's Guide to Advanced Search Operators costs $39 + tax to purchase from our store. If you want to purchase both guides, you'd have to dish out $78 for both of them...or you could pay $49.99 for a monthly SEOmoz PRO membership, which grants you access to all of our PRO guides as well as premium access to our suite of tools (such as our new Trifecta tool and our SEO Analytics). If you're thinking of purchasing both articles, I highly recommend trying out SEOmoz PRO for a month--it's a better value than buying the guides individually, plus you get access to tons of extra goodies. Purchase a PRO membership Individually purchase The Professional's Guide to Advanced Search Operators Already a PRO member? Fantastic--you should be reading this guide already! Ann did a wonderful job putting it together, and it is bursting with incredibly valuable information. Take advantage of your membership and check it out at no extra cost. As always, we encourage feedback from our members, so fire away and happy reading! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "New Guide Release: The Professional's Guide to Advanced Search Operators"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "New Guide Release: The Professional's Guide to Advanced Search Operators"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}