{
  "url": "https://moz.com/blog/new-service-for-invoicing",
  "slug": "new-service-for-invoicing",
  "title": "New Service for Invoicing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I got a call yesterday from Michael McDerment over at 2ndSite. He's hoping that SEOs will start using their software to manage clients & projects, conduct invoicing and keep track of their work. It's not a bad product, actually, probably wor...",
  "content": "New Service for Invoicing Online Advertising By: Rand Fishkin July 13, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 13, 2005 New Service for Invoicing Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I got a call yesterday from Michael McDerment over at 2ndSite. He's hoping that SEOs will start using their software to manage clients & projects, conduct invoicing and keep track of their work. It's not a bad product, actually, probably worth at least a look, particularly if you have a large or mid-size operation or are desperately seeking an alternative to Paypal. Without a doubt, this system looks and feels more professional than EBay's payment system. I do have a few suggestions for the company: It's better to be blogged about naturally than it is to \"push\" your product to bloggers. Make some extraordinary content - a great walkthrough of your product or some valuable articles and let the bloggers come to you. If you have to push it, I'd recommend posting in forum sections that have review requests or sending an e-mail to previously established industry contacts. Buy the domain - www.2ndsite.com - that's where I assumed the site would be, and it's particularly aggravating that the logo uses that spelling but the URL is different - I noted when visiting that it's for sale! Make more screenshots more accessible and add an animated demo first chance you get. For a great example, see ClickTracks' demo. It looks to me like they've got a good product on their hands, and Michael mentioned they already have some 14,000 clients using it, so they've obviously produced something worthwhile. Now, it's just a matter of promotion. Good luck! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "New Service for Invoicing"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "New Service for Invoicing"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}