{
  "url": "https://moz.com/blog/new-moz-local",
  "slug": "new-moz-local",
  "title": "The New Moz Local Is on Its Way! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The secret's ready to share: a new Moz Local is coming your way this June! Check out what you can expect to see from us in the next month as we continue to evolve our solutions for local SEO and help you grow your business.",
  "content": "The New Moz Local Is on Its Way! Local SEO | Moz News By: Miriam Ellis May 14, 2019 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis May 14, 2019 The New Moz Local Is on Its Way! Local SEO | Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Exciting secrets can be so hard to keep. Finally, all of us at Moz have the green light to share with all of you a first glimpse of something we’ve been working on for months behind the scenes. Big inhale, big exhale... Announcing: the new and improved Moz Local, to be rolled out beginning June 12! Why is Moz updating the Moz Local platform? Local search has evolved from caterpillar to butterfly in the seven years since we launched Moz Local. I think we’ve spent the time well, intensively studying both Google’s trajectory and the feedback of enterprise, marketing agency, and SMB customers. Your generosity in telling us what you need as marketers has inspired us to action. Over the coming months, you’ll be seeing what Moz has learned reflected in a series of rollouts. Stage by stage, you’ll see that we’re planning to give our software the wings it needs to help you fully navigate the dynamic local search landscape and, in turn, grow your business. We hope you’ll keep gathering together with us to watch Moz Local take full flight — changes will only become more robust as we move forward. What can I expect from this upgrade? Beginning June 12th, Moz Local customers will experience a fresh look and feel in the Moz Local interface, plus these added capabilities: New distribution partners to ensure your data is shared on the platforms that matter most in the evolving local search ecosystemListing status and real-time updates to know the precise status of your location data Automated detection and permanent duplicate closure, taking the manual work out of the process and saving you significant timeIntegrations with Google and Facebook to gain deeper insights, reporting, and management for your location’s profilesAn even better data clean-up process to ensure valid data is formatted properly for distributionA new activity feed to alert you to any changes to your location’s listingsA suggestion engine to provide recommendations to increase accuracy, completeness, and consistency of your location data Additional features available include: Managing reviews of your locations to keep your finger on the pulse of what customers are sayingSocial posting to engage with consumers and alert them to news, offers, and other updatesStore locator and landing pages to share location data easily with both customers and search engines (available for Moz Local customers with 100 or more locations) Remember, this is just the beginning. There's more to come in 2019, and you can expect ongoing communications from us as further new feature sets emerge! When is it happening? We'll be rolling out all the new changes beginning on June 12th. As with some large changes, this update will take a few days to complete, so some people will see the changes immediately while for others it may take up to a week. By June 21st, everyone should be able to explore the new Moz Local experience! Don't worry — we'll have several more communications between now and then to help you prepare. Keep an eye out for our webinar and training materials to help ensure a smooth transition to the new Moz Local. Are any metrics/scores changing? Some of our reporting metrics will look different in the new Moz Local. We'll be sharing more information on these metrics and how to use them soon, but for now, here’s a quick overview of changes you can expect: Profile Completeness: Listing Score will be replaced by the improved Profile Completeness metric. This new feature will give you a better measurement of how complete your data is, what’s missing from it, and clear prompts to fill in any lacking information.Improved listing status reporting: Partner Accuracy Score will be replaced by improved reporting on listing status with all of our partners, including continuous information about the data they’ve received from us. You’ll be able to access an overview of your distribution network, so that you can see which sites your business is listed on. Plus, you’ll be able to go straight to the live listing with a single click.Visibility Index: Though they have similar names, Visibility Score is being replaced by something slightly different with the new and improved Visibility Index, which notates how the data you’ve provided us about a location matches or mismatches your information on your live listings.New ways to measure and act on listing reach: Reach Score will be leaving us in favor of even more relevant measurement via the Visibility Index and Profile Completeness metrics. The new Moz Local will include more actionable information to ensure your listings are accurate and complete. Other FAQs You'll likely have questions if you’re a current Moz Local customer or are considering becoming one. Please check out our resource center for further details, and feel free to leave us a question down in the comments — we'll be on point to respond to any wonderings or concerns you might have! Head to the FAQs Where is Moz heading with this? As a veteran local SEO, I’m finding the developments taking place with our software particularly exciting because, like you, I see how local search and local search marketing have matured over the past decade. I’ve closely watched the best minds in our industry moving toward a holistic vision of how authenticity, customer engagement, data, analysis, and other factors underpin local business success. And we’ve all witnessed Google’s increasingly sophisticated presentation of local business information evolve and grow. It’s been quite a ride! At every level of local commerce, owners and marketers deserve tools that bring order out of what can seem like chaos. We believe you deserve software that yields strategy. As our CEO, Sarah Bird, recently said of Moz, “We are big believers in the power of local SEO.” So the secret is finally out, and you can see where Moz is heading with the local side of our product lineup. It’s our serious plan to devote everything we’ve got into putting the power of local SEO into your hands. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The New Moz Local Is on Its Way!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The New Moz Local Is on Its Way!"
    },
    {
      "level": "H2",
      "text": "Why is Moz updating the Moz Local platform?"
    },
    {
      "level": "H2",
      "text": "What can I expect from this upgrade?"
    },
    {
      "level": "H2",
      "text": "When is it happening?"
    },
    {
      "level": "H2",
      "text": "Are any metrics/scores changing?"
    },
    {
      "level": "H2",
      "text": "Other FAQs"
    },
    {
      "level": "H2",
      "text": "Where is Moz heading with this?"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}