{
  "url": "https://moz.com/blog/new-moz-local-here",
  "slug": "new-moz-local-here",
  "title": "The New Moz Local Is Here! Can't-Miss Highlights & How to Get Started - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The new Moz Local is here, and it's chock full of new features that'll help you maximize your online local presence!",
  "content": "The New Moz Local Is Here! Can't-Miss Highlights & How to Get Started Local SEO | Moz News By: Miriam Ellis June 20, 2019 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis June 20, 2019 The New Moz Local Is Here! Can't-Miss Highlights & How to Get Started Local SEO | Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Last month we announced that the new Moz Local would be arriving soon. We’re so excited — it’s here! If you're a current Moz Local customer, you may have already been exploring the new and improved platform this week! If not, signing up now will get you access to all the new goodies we have in store for you. With any major change to a tool you use, it can take a bit for you to adjust. That’s why I wanted to write up a quick look at some of the highlights of the product, and from there encourage you to dig into our additional resources. What are some key features to dig into? Full location data management More than 90% of purchases happen in physical stores. The first object of local SEO is ensuring that people searching online for what you offer: Encounter your businessAccess accurate information they can trust about itSee the signals they’re looking for to choose you for a transaction Moz Local meets this reality with active and continuous synching of location data so that you can grow your authority, visibility, and the public trust by managing your standard business information across partnered data aggregators, apps, sites, and databases. This is software centered around real-time location data and profile management, providing updates as quickly as partners can support them. And, with your authorized connection to Google and Facebook, updates you make to your business data on these two powerhouse platforms are immediate. Moz Local helps you master the online consumer encounter. And, because business data changes over time, ongoing management of your online assets is essential. 80% of customers lose trust in a brand when its local business listings mislead them with incorrect information like wrong names, phone numbers, or hours of operation. No brand can afford to lose this trust! Moz Local’s data cleansing service delivers ongoing accuracy and proper formatting for successful submission to the platforms that matter most. Finally, Moz Local supports the distribution of rich data beyond the basics. Give customers compelling reasons to choose your business over others by uploading photos, videos descriptions, social links, and more. Full control over these elements can greatly enhance customer encounters and improve conversions. Automated duplicate deletion Duplicate listings of a business location can turn profile management into a tangle, mislead consumers, dilute ranking strength, and sometimes even violate platform guidelines. But historically, detection and resolution of duplicates has been cumbersome and all but impossible to scale when handled manually. One of the most exciting improvements you’ll experience with the new Moz Local is that duplicate workflows are now automated! Our next-level algorithmic technology will identify, confirm and permanently delete your duplicate listings in a fully automated fashion that requires no interaction or involvement on your part. This is a major development that will save local brands and agencies an amazing amount of time. Deep Google and Facebook reporting & management Logging in and out of multiple dashboards can be such a hassle, but with Moz Local, you’ll have insights about all of your locations and clients in a single space. Moz Local is now hooked up with Facebook management (hooray!) and we’ve deepened our Google My Business integration. We’ll capture Facebook insights data for impressions and clicks for your location's published Facebook content. And you’ll find it convenient that we surface impressions data for both Google Maps and Search. This means you’ll have easy access click data for the familiar attributes: clicks-for-directions, clicks-to-website and clicks-to-call, plus tracking of direct, indirect, and branded queries. Whether you’re dealing with just one listing or 100,000 of them, all the data will be at your fingertips. One new feature I’m especially keen to share is the alerts you’ll receive every time a new photo is uploaded to your Google listing by a third party. Image spam is real, and awareness of public uploads of imagery that violates guidelines is part and parcel of reputation management. Local dashboard Our goal is to make your local SEO work as simple as possible, and very often, the at-a-glance summary in the new Moz Local dashboard will tell you all you need to know for routine check-ups. The default view of all the locations you manage can, of course, be easily filtered and segmented to look at specific clients or locations. Almost effortlessly, you’ll get a very quick overview of data like: Average Profile CompletenessLocations requiring attentionTotal listings in sync (sync is the new term for what we previously referred to as \"published\")Listings being updatedListings requiring syncDuplicate ReportingFacebook Insights dataGoogle My Business Insights data Profile suggestion engine Who has time for guesswork when you’re trying to make the most of your online assets? Our powerful new profile suggestion engine tells you exactly what you what data you need to prove to reach maximum profile completeness. Quickly drill down to a specific location. From there, Moz Local surfaces multiple fields (like long description, photos, opening hours, fax numbers, etc.) along with suggestions based on other verifiable online sources to improve consistency across the data publisher and partner network. Again, this is a big time-saver, especially if your agency has multiple clients or your enterprise has multiple locations to manage. Email alerts, notifications, activity feed Choose how you’d like to stay up-to-date on the status of your listings. Every Moz Local dashboard contains an activity feed that continuously streams the latest information, updates, and alerts for all of your listingsOpt-in for email alerts if that’s your preferred method of notification. Digest emails are configurable to be sent on a weekly, monthly, or quarterly basisOptional upgrade for email alerts for new reviews. If you upgrade, you’ll receive these notification daily, ensuring you aren’t missing complaints, praise and conversion opportunities Review management Google has revealed that about one-third of people looking for local business information are actually trying to find local business reviews. From the viewpoint of consumers, your online reviews are your brand’s reputation. Our own large-scale marketing survey found that 90% of respondents agree that reviews impact local rankings, but that 60% of participants lack a comprehensive review management strategy. The result is that platforms like Google have become mediums of unheard customer voices, neglected leads, and reputation damage. The good news is that Moz Local customers have the option to upgrade their subscriptions to turn this unsustainable scenario completely around. Be alerted to incoming reviews on multiple platforms and respond to them quickly. See right away if a problem is emerging at one of your locations, necessitating in-store intervention, or if you’ve been hit with a review spam attack. And go far beyond this with insight into other types of customer sentiment, like photo uploads and Google Q&A. The truth is, that in 2019 and in the foreseeable future, no business in a competitive market can afford to neglect public sentiment management, because it has become central to customer service. Every brand is in the business of customer service, but awareness, responsiveness, accountability, and action require strategy and the right tools. Let Moz Local help you take control of your priceless reputation. Social posting Manage the interactive aspects of your local business profiles with this optional upgrade. Share news, special offers, and questions & answers with customers on social platforms and in directories. This includes: Engaging with customers on social media to share. News posts can be shared on Facebook and eligible directories. Offers can be posted in eligible directories. Questions & Answers can be posted to your Google Business Profile. Publishing Posts instantly or scheduling them for a future date. And here’s something you’ll be excited to hear: you can submit the same post for multiple locations at once, create and save templates for posts, and edit/delete posts from the publishing dashboard! In competitive local markets, transitioning from passive observation of online assets to interactive engagement with the public can set your brand apart. What should my next steps in the new Moz Local be? Ensure that your location data and your profile are complete and accurate within the new Moz Local. Be sure to add in as much data as you can in the Basic Data, Rich Data, and Photos & Videos sections to reach high profile completeness. Doing so will ensure that your locations’ listings throughout the local search ecosystem are as informative as possible for potential customers. Moz Local acts as a “source of truth” for your location data and overwrites data on third party platforms like Google and Facebook, so be sure the data you’ve provided us is accurate before moving on to step two.Gain immediate insights into your local search presence by connecting your Google My Business and Facebook profiles. Once connected, these will begin to pull in tons of data, from impressions, to clicks, to queries.Once your profile is complete and Google My Business and Facebook profiles are connected, it’s time to sync your data to ensure that what you’ve provided to Moz Local is shared out to our network. Simply click the Sync button in the top right to push your information to our partners. Where can I find more information? I’m glad you’ve asked! Our resource center will be a great place to start. There, a user guide and video tutorial can show you the ropes, and you can also get registered for our upcoming webinar on June 25th at 10:00am PST: Save my spot The Help Hub has also been given a complete refresh with the new Moz Local. There you will find ample resources, FAQs, and descriptions of each area of the tool to dig into. For any questions that you can’t find answers to, you can always reach out to our wonderful Help Team. Download your free copy of the Moz Local User's Manual In the spirit of making things as delightfully simple for every customer, we’ve published a guide to smooth sailing in unfamiliar waters. In this short and sweet Moz Local User Manual, you’ll find: A full visual key to the dashboard and all its functionsInstructions for adding locationsInstructions for editing locationsInstructions for cancelling locationsInstructions for managing reviews and social engagementAnd other actionable info! Who is the Moz Local User Manual for? Anyone on your team who touches your Moz Local account should have a copy of this guide. It will level everyone up and cut down on team leads having to answer the same questions over and over again about basic tasks. Where appropriate, agencies may also want to send a copy over to clients who need clarity about why you’re using Moz Local as an integral part of local search marketing campaigns. We’ve written the manual in non-technical language, with step-by-step instructions any reader can follow. Download the free guide What’s next from Moz? Expect a number of exciting new updates to continue rolling out — both in the new Moz Local tool as well as in other areas of our platform. As I mentioned before, it’s our serious plan to devote everything we’ve got into putting the power of local SEO into your hands. Keep an eye out for more to come from Moz to support your local search marketing. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The New Moz Local Is Here! Can't-Miss Highlights & How to Get Started"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The New Moz Local Is Here! Can't-Miss Highlights & How to Get Started"
    },
    {
      "level": "H2",
      "text": "What are some key features to dig into?"
    },
    {
      "level": "H3",
      "text": "Full location data management"
    },
    {
      "level": "H3",
      "text": "Automated duplicate deletion"
    },
    {
      "level": "H3",
      "text": "Deep Google and Facebook reporting & management"
    },
    {
      "level": "H3",
      "text": "Local dashboard"
    },
    {
      "level": "H3",
      "text": "Profile suggestion engine"
    },
    {
      "level": "H3",
      "text": "Email alerts, notifications, activity feed"
    },
    {
      "level": "H3",
      "text": "Review management"
    },
    {
      "level": "H3",
      "text": "Social posting"
    },
    {
      "level": "H2",
      "text": "What should my next steps in the new Moz Local be?"
    },
    {
      "level": "H2",
      "text": "Where can I find more information?"
    },
    {
      "level": "H2",
      "text": "Download your free copy of the Moz Local User's Manual"
    },
    {
      "level": "H3",
      "text": "Who is the Moz Local User Manual for?"
    },
    {
      "level": "H2",
      "text": "What’s next from Moz?"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}