{
  "url": "https://moz.com/blog/new-uk-law-criminalizes-stealth-marketing-techniques",
  "slug": "new-uk-law-criminalizes-stealth-marketing-techniques",
  "title": "New UK Law Criminalizes Stealth Marketing Techniques - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Our European colleagues have been buzzing about a new law prohibiting certain stealth marketing tactics. Distilled, IPA, The BBC, BigMouthMedia, The Times Online and Marketing Week have speculated on the potential fallout of the new regulation. Many have predicted the demise of common, but…",
  "content": "New UK Law Criminalizes Stealth Marketing Techniques E-Commerce SEO By: Sarah Bird June 3, 2008 Table of Contents Copied! By: Sarah Bird June 3, 2008 New UK Law Criminalizes Stealth Marketing Techniques E-Commerce SEO May It Please the Mozzers, It's not Monday, but I hope it's worth the wait. Our European colleagues have been buzzing about a new law prohibiting certain stealth marketing tactics. Distilled, IPA, The BBC, BigMouthMedia, The Times Online and Marketing Week have speculated on the potential fallout of the new regulation. Many have predicted the demise of common but controversial covert marketing techniques, including paid links, fake reviews, flogs, and comment seeding. What exactly does the law prohibit? Is it the death of stealth marketing? What does it mean for stealth marketers in other countries who may do some business in the UK? The Unfair Commercial Practices Directive (UCPD) came into effect on May 26, 2008. The new law makes the UK consistent with other EU Member states by implementing a broad-sweeping EU-wide mandate, the Consumer Protection from Unfair Trading Directive. In short, the entire EU either already has similar legislation or will soon. The goal is to make it easier for businesses based in one EU Member state to market and sell their products to consumers in other Member states without having to comply with unfamiliar, foreign commercial regulations. What Exactly Does the Law Prohibit? Much of the law repeats and restates old prohibitions against unfair consumer practices, such as classic bait-and-switch schemes, dishonesty, and highly aggressive sales techniques. Only two of 31 specifically identified unfair practices break new and important ground. The controversy surrounds sections 11 and 22 and addresses non-disclosed commercial relationships in advertising. Let's take a closer look. Section 11 prohibits using editorial content to promote a product without indicating that the content is paid. (11) Using editorial content in the media to promote a product where a business1 has paid for the promotion without making that clear in the content or by images or sounds clearly identifiable by the consumer (advertorial). The following is an \"official\" example of a violation provided by one of the UK agencies in charge of enforcing the regulations: A magazine is paid by a holiday company for an advertising feature on their luxury Red Sea diving school. The magazine does not make it clear that this is a paid-for feature – for example by clearly labeling it 'Advertising Feature' or 'Advertorial'. Failure to explicitly identify the commercial relationship between the advertiser and the company is thus directly prohibited by the new law. One can easily see how this law also makes it illegal for a business to pay a blogger/affiliate to write a review about its product without disclosing the commercial relationship. It is open for interpretation whether accepting money in exchange for putting a link on your website without disclosing your financial incentive violates this provision. Is a paid link an \"advertorial\"? If I were a judge trying to make that call, I would rule that a mere link without much more wouldn't constitute \"using editorial content...to promote a product.\" However, if the overall context surrounding the paid link offers an opinion or endorsement of the product (i.e., \"editorial content\"), then you could be in trouble, unless you disclose, of course. To be on the safe side, lists of links with headings such as \"Products or Companies I Like\" should contain disclosures if you're being compensated for links. Section 22 is slightly broader in scope and prohibits falsely giving the impression that you're not motivated by business or falsely representing yourself as a consumer: (22) Falsely claiming or creating the impression that the business is not acting for purposes relating to his trade, business, craft or profession, or falsely representing oneself as a consumer. For example, the following conduct would be a breach of this provision: A second-hand car dealership puts a used car on a nearby road and displays a handwritten advertisement reading 'One careful owner. Good family run-around. £2000 or nearest offer. Call Jack on 01234 56789'. The sign gives the impression that the seller is not selling as a trader, and hence this would breach the law. Section 22, then, is designed to prevent sock puppetry and similar covert tactics. Most people assume this would outlaw techniques such as Wal-mart's fake blog, Sony's AllIwantforxmasisapsp.com gaffe, and anonymously seeding positive feedback about your company or product in blog comments. Further, authors can't create anonymous reviews praising their own books on Amazon. Similarly, hotel owners can't create fake reviews to boost rankings on TripAdvisor.com and similar websites. What Are the Potential Penalties? Both civil and criminal penalties are possible. Penalties will likely be progressive and proportional, at least that's the stated mission by enforcement agencies. This means that your business will likely get a stern letter with some specific guidance, before being slapped with a civil fine or criminal conviction. On a first conviction, the maximum penalty is not more than £5,000 (for now) and up to two years in jail. All claims must be brought within three years of the offense taking place, or within one year of the discovery of the offense by the prosecutor, whichever is earlier. Who's Going to Enforce the Law? In the UK, the law is going to be enforced by the Local Authority Trading Standards Services (TSS), the Department of Enterprise, the Office of Fair Trade (OFT), and a select group of industry-created self-governing bodies, such as the Advertising Standards Authority (ASA). It appears that individual citizens and businesses cannot independently bring a lawsuit to enforce the regulation, but I'm not certain. If any UK law specialists out there know whether private citizens have a cause of action under this law, please let me know. Where Will the Case Be Brought? Within the European Community, violations will usually be dealt within the jurisdiction where the business responsible for the violation is located. Thus, if a breach of the law is hurting UK consumers, but stemming from a business in Spain (a fellow Member State), the UK can ask Spain to crack down on the business violating the regulation. What If the Business Violating the Law Is Located in a Non-EU Country, Like the US? I'm not an expert in UK law, but here's an educated guess: If a US-based business were to violate the law and it has sufficient connections with the UK, it could be prosecuted in the UK. It's not clear what level of connection to the UK would be necessary in order for UK courts to exercise jurisdiction over a US-based business. However, the following factors would be relevant: Whether the business was targeting UK consumers Whether the business has a physical office in the UK Whether the business's server or other services or equipment are located in the UK Whether employees made repeated trips to the UK to further business relationships The more connections you have, the more likely it is that your company could be hauled into UK court when you violate the new law. How Is This Law Going to Affect Internet Marketing in Europe and Abroad? I'm going to go out on a limb here and predict that the new regulation will not make that much of a difference. Why? Because governmental agencies have a lot to do and there are more egregious unfair practices to prosecute than the stealth marketing techniques identified above. Finding and prosecuting undisclosed paid links, reviews and blogs isn't easy. Further, in the continuum of harms to consumers, this is not the most serious of concerns. Thus, I doubt that enforcement agencies are going to put their limited resources to patrolling for and prosecuting these kinds of harms. More likely, violations of sections 11 and 12 will be offenses tacked on to other more serious offenses. I'll keep you informed as the situation develops. Maybe I'll be proven wrong and there really is the political will and resources to tackle internet stealth marketing in the EU. Until then, each individual business needs to decide for itself how risk averse it is and conduct itself accordingly. If you're very risk averse, the solution is to disclose disclose disclose. Even if you have high risk tolerance, set some resources aside to deal with possible fines and steer clear of elaborate, high-profile covert marketing campaigns, at least for the near future. Very truly yours, Sarah Other Resources: The Onion on Stealth Marketing The Seattle Times on Kids and Stealth Marketing WOMMA's List of Unethical Word of Mouth Strategies Eric Goldman Takes A Look at What Lawyers are Saying About Stealth Marketing 1. Throughout this post, I have substituted the word \"business\" for \"trader\" to improve readability for our North American audience. The new law defines a trader as 'any person who in relation to a commercial practice is acting for purposes relating to his business, and anyone acting in the name of or on behalf of a trader'. This includes companies. It could also include individuals who regularly sell goods from their homes on the internet using auction websites. The assessment of whether or not the individual is acting as a \"trader\" will depend on whether or not the relevant activity is done in the course of business. An individual person selling goods on the internet, merely as a means by which to dispose of unwanted goods from time to time, would not be likely to fall within this definition. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "New UK Law Criminalizes Stealth Marketing Techniques"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "New UK Law Criminalizes Stealth Marketing Techniques"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Common Mistakes E-commerce Websites Make Using JavaScript"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sarah Bird\n          \n            Sarah Bird\n          \n            Sarah Bird"
}