{
  "url": "https://moz.com/blog/new-feature-seo-qa",
  "slug": "new-feature-seo-qa",
  "title": "New SEOmoz Feature: SEO Q&A - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We're launching a new section for our premium members this morning: SEOmoz Q&A.  This is a place where premium members can ask the SEOmoz staff SEO related questions and receive tips, advice, or just get pointed in the right direction.  It works a bit like a trouble ticket system:  discussions are…",
  "content": "New SEOmoz Feature: SEO Q&A Moz News O By: Oatmeal June 8, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! O By: Oatmeal June 8, 2007 New SEOmoz Feature: SEO Q&A Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. We're launching a new section for our premium members this morning: SEOmoz Q&A. This is a place where premium members can ask the SEOmoz staff SEO related questions and receive tips, advice, or just get pointed in the right direction. It works a bit like a trouble ticket system: discussions are opened, closed, rated, and eventually archived in a knowledge base of SEO information. Discussions can also be marked as private if it contains confidential SEO information. There's a few things to note about this Q&A section: There's only a handful of mozzers available so we limit each premium member to either three public discussions or one private discussion every 30 days. We made private discussions use more question credits simply because we cannot add them to our knowledge base so their value is not passed on to others. This service is brand new so our knowledge base is currently empty. In the future, however, we encourage our members to search the knowledge base before asking a question to see if that topic has already been covered. We'll provide you with tips and resources - but don't expect us to do any hand-holding. We're here to educate you, not do actual hands-on SEO work for your website. It's okay to ask a variety of questions in a single thread, but don't try and take advantage of the system by asking a variety of unrelated questions. We are expecting a huge influx of questions when we first launch, so if it takes us a few days to answer your question please be patient. This service is going to dramatically raise the value of having a premium membership and place a much greater demand on the SEOmoz staff, so we're going to be raising the price of memberships to $49.00 a month (a $10.00 a month increase) starting July 8th. If you are currently a premium member or you register before July 8th, your subscription rate will not increase, it will be fixed at whatever you originally paid and will stay at this rate until January 1, 2009. Also, I'm releasing a new free SEO tool to all SEOmoz members next week. It's something I use daily and felt it would make a killer addition to our arsenal of tools. I'm also working on fixing the Keyword Difficulty tool today to get some things fixed that need attention (oh how I love playing the regular expression scrape game). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "New SEOmoz Feature:  SEO Q&A"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "New SEOmoz Feature:  SEO Q&A"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Oatmeal\n          \n            Oatmeal"
}