{
  "url": "https://moz.com/blog/new-mozbar-seos-dream-come-true",
  "slug": "new-mozbar-seos-dream-come-true",
  "title": "New Mozbar: An SEO's Dream Come True - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Well, it's this SEO's dream anyway.\nYou see, my biggest frustration in life is lack of time. It limits the potential of any given hour or day. I sometimes think to myself - sure, I could be running an SEO analysis on this site... OR I could be sitting next to my wife on the couch, eating chocolate…",
  "content": "New Mozbar: An SEO's Dream Come True SEO Tools By: Rand Fishkin August 1, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 1, 2009 New Mozbar: An SEO's Dream Come True SEO Tools The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Well, it's this SEO's dream anyway. You see, my biggest frustration in life is lack of time. It limits the potential of any given hour or day. I sometimes think to myself - sure, I could be running an SEO analysis on this site... OR I could be sitting next to my wife on the couch, eating chocolate and watching Venture Brothers re-runs. You can see my dilemma. Enter the new mozbar: _ Sweet, eh? Download it here. _ It probably comes as no surprise that, just like nearly every other SEO in the field, I waste a lot of time doing the same tasks over and over again. Namely: Looking up the link data of a site/page to get an idea of its relative importance from a link popularity perspective Viewing the source code of a page to analyze the meta data, on-page content, and SEO-specific tags And now, with the new mozbar, I'm spending 1/10th of the time it took me previously to get that critical information. I'll show you what I mean. Let's say I needed to analyze my new friend Chadd's website. Chadd sells straight edge & safety razors, but I'm not convinced he's doing all the right things from an SEO perspective: _ Sharp razors, but is the SEO sharp? _ Rather than going through the time consuming act of scrolling through Chadd's nasty source code to find the answers, I can use the mozbar's nifty \"analyze page\" feature, thusly: _ Screw \"view source\" - this rules! _ I can clearly see that my friend Chadd needs to do some work if he wants to rank \"safety razor.\" This view shows me data on: The URL Page Title Meta Description Meta Keywords H1 H2 HTML Text Bold/Strong Italic/Em Alt Text Meta Robots Rel=\"Canonical\" usage IP Address mozRank (for the URL, subdomain and root domain) mozTrust (for the URL, subdomain and root domain) # of External Links (for the URL, subdomain and root domain) # of Linking Domains (for the URL, subdomain and root domain) Unfortunately, we have lost one feature - Google's PageRank. The powers that be at Google have asked us to remove that functionality from our toolbar and we've complied. We know this is frustrating, but we also need to respect the engines' wishes - after all, we wouldn't exist without them :-) If you're searching for alternatives, I'd suggest SearchStatus (which has a number of cool functions) or Live PageRank (which will give you just the PR bar and you can drag it to whatever location you'd like). The new mozbar is just launching and will likely have a few bugs - please report these in the comments below and feel free to suggest any additional functionality you'd like to see. We'll be spec'ing fixes & upgrades in the next couple weeks Change your life. Download the mozbar. _ p.s. Last time Chadd (from RetroRazor.com) and I were out together at a party, he gave me a free Retro Razor to try. Does that mean I'm obligated to put a nofollow on the link above, even though I really like the shave? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "New Mozbar: An SEO's Dream Come True"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "New Mozbar: An SEO's Dream Come True"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}