{
  "url": "https://moz.com/blog/new-mini-guide-seo-reporting",
  "slug": "new-mini-guide-seo-reporting",
  "title": "‘Tis the Season for Reporting (And a New Mini Guide) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "How is it already reporting season again? Don't dread your year-end metrics — read our brand-new not-so-mini mini guide on SEO reporting and wow your clients with clean, clear, efficient reports.",
  "content": "‘Tis the Season for Reporting (And a New Mini Guide) SEO Reporting By: Roger MozBot December 12, 2019 Table of Contents Copied! By: Roger MozBot December 12, 2019 ‘Tis the Season for Reporting (And a New Mini Guide) SEO Reporting How is it already reporting season again? Time to generate those dreaded end-of-year SEO reports that take hours to create and mere seconds for your client to skim through and toss to the side. We’ve all been there. But here's the thing: it’s absolutely necessary! Not only for you and your team to track progress, but to prove value to your clients as well. Reporting for SEO can feel like a time-black-hole. You have an infinite amount of data that you have to sort through and piece together to tell a story. You know that you saw something, somewhere at some point that proved a strategy worked, but of course, now that you need it you can’t find it and now you’ve been looking for it for an hour and you just want to get back to the SEO part of your job. What if we told you we could help you create reports that matter to your team and your clients in less time with better output? Today we launched our newest brainchild, the Mini Guide to SEO Reporting, our free guide to help you create the most effective SEO reports for your business. Give it a read! Okay, so maybe it's not the MOST mini mini-guide that ever did mini. But in comparison to the Beginner's Guide to SEO, it's definitely a munchkin! We like to think it's chock full of easy-to-read chapters and plenty of actionable insights, a few of which we’d like to share with you now. 1. More data, more problems The idea for the mini guide was born after we noticed a trend in SEO reporting — they're often cobbled together and extremely time intensive. Many SEOs rely on multiple platforms to gather all of the data needed to make recommendations and track progress. So, when they want to report back to their clients, they have to go to all of the different platforms to collect the necessary data. This makes everything ten times more complicated because many of the platforms use differing jargon and have different data exporting processes, and when it comes time to piece it all together, it’s extremely difficult to maintain a consistent tone or a clear story to follow. That leads us right into the first actionable insight: your reports need to be KonMaried. Well, kind of. In reporting, you can’t quite ask if a data point brings you joy, but you can ask if a data point is meaningful. You need to ask yourself, your team, and most importantly your client which data points are meaningful to your SEO campaign. Once you nail down the must-haves, stick to them! You can always reassess later, but filling up your report with irrelevant data makes it less appealing to the client and easier for them to gloss over. Plus, narrowing down some of the data you have to report on will allow you to spend more time on SEO and less time on reporting. To get the conversation started with your client, we created a downloadable one sheet with thirty must-ask questions about reporting. 2. The TL;DR report We know that most people who get their hands on our reports don’t read them front to back, but we want to make sure that they get all of the important insights — that’s where the TLDR, or wins/losses, report comes in. In the mini guide, we recommend an “at-a-glance” type report that is simply a bullet list of insights like: What goals were metWhat goals weren’t meantAny discrepancies that need to be considered while reading the rest of the reportOne-sentence explanations of the most important findings for the reporting period This easy to read format will ensure that all of the information you need to get across, gets across. You can think of this section as a summary or a table of contents. The rest of the report will simply go over the data that backs the claims you make in the TLDR report. A very important note to be made here is that there will be losses, and you need to be upfront about that with your clients. Don’t fudge the data because that will set you up for an inevitable break in your relationship with the client (maybe bring fudge with the data instead — a client with chocolate is a happy client). It's much better to be transparent about the strategies that are simply not working or the goals that aren’t being met. Likewise, if you are having trouble with setting or achieving goals, we also go through a step-by-step process on goal setting for clients. It takes into account everything from the client’s SWOT and competitive analyses to what it means to create a SMART goal. 3. Simplify the complex Keeping things easy-breezy when reporting is especially tough when it comes to technical SEO. Though technical SEO is extremely important, it can seem rather bland to clients (especially when they are not up to scuff on the terminology). In the mini guide, we go through some of the ways you can simplify and improve the reporting you do on technical SEO. First things first: you need to make sure your clients know what you're talking about, so use their language! It may be slightly different for each client, but having this foundation set is critical for keeping clients engaged and eager about the improvements you are making. Once the foundation is set, we suggest covering what you’ve done and what you’re planning on doing in context of their respective impacts. When listing these action items, be sure to explain the benefits that can be expected. Just because someone understands what a meta description is doesn’t mean they’re going to understand than an optimized meta description can increase click-through rates. Some of the things you do in a reporting period may be expected or something you’re checking off of a list, but other things may be the result of running into an unforeseen issue — be sure to address both! This helps to establish trust and show your client that you're staying on top of their SEO, even if they aren’t 100% sure what to expect. Give it a read That’s it, no more spoilers. To get the rest of the juicy details you're going to have to read it for yourself! See how mini this guide really is Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "‘Tis the Season for Reporting (And a New Mini Guide)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "‘Tis the Season for Reporting (And a New Mini Guide)"
    },
    {
      "level": "H2",
      "text": "1. More data, more problems"
    },
    {
      "level": "H2",
      "text": "2. The TL;DR report"
    },
    {
      "level": "H2",
      "text": "3. Simplify the complex"
    },
    {
      "level": "H2",
      "text": "Give it a read"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Value of SEO Beyond Traffic and Leads — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Ensure a Flawless GA4 Setup and Ongoing Tracking Functionality"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Roger MozBot\n          \n            Roger MozBot\n          \n            Roger MozBot"
}