{
  "url": "https://moz.com/blog/new-keyword-tool-for-adwords",
  "slug": "new-keyword-tool-for-adwords",
  "title": "New Keyword Tool for Adwords - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I just spent an hour or so at the new keyword tool for adwords.  It gives you a nice list of variants for any search term that you type in.  Different from the Overture Keyword Suggestion Tool and similar to the Wordtracker related terms list.  To find this tool, log into you...",
  "content": "New Keyword Tool for Adwords Online Advertising E By: EGOL November 15, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! E By: EGOL November 15, 2005 New Keyword Tool for Adwords Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I just spent an hour or so at the new keyword tool for adwords. It gives you a nice list of variants for any search term that you type in. Different from the Overture Keyword Suggestion Tool and similar to the Wordtracker related terms list. To find this tool, log into your Adwords account, click into an existing campaign, and look in the \"Tools\" line right above where the proof copy of your ad is displayed.The image on the right is a querry that I ran for \"sneakers\". Note how it returned related terms and not simply concatenations. Great for lateral prospecting. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "New Keyword Tool for Adwords"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "New Keyword Tool for Adwords"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "EGOL\n          \n            EGOL"
}