{
  "url": "https://moz.com/blog/new-feature-for-premium-members-seo-tips-tricks",
  "slug": "new-feature-for-premium-members-seo-tips-tricks",
  "title": "SEO Tips & Tricks: New Feature for Premium Members - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We've added a new feature for premium members: SEO Tips and Tricks.  It's nothing earth-shatteringly huge, just a simple list of SEO tips, tricks, and bits of industry knowledge that we don't make publicly available.  The list will be updated fairly regularly and when a new tip is published you'll…",
  "content": "New Feature for Premium Members: SEO Tips & Tricks Moz News O By: Oatmeal March 29, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! O By: Oatmeal March 29, 2007 New Feature for Premium Members: SEO Tips & Tricks Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. We've added a new feature for premium members: SEO Tips and Tricks. It's nothing earth-shatteringly huge, just a simple list of SEO tips, tricks, and bits of industry knowledge that we don't make publicly available. The list will be updated fairly regularly and when a new tip is published you'll notice a New SEO Tip link in the left-hand navigation underneath your account information These tips are perfect for those busy days when you don't have the time to read a lengthy article but would still like to pick up a few gems of SEO knowledge. They're concise, useful and offer a great ROI in the 30 seconds it takes to read one. There's several in there right now, including an interesting tactic for taking advantage of sites that scrape your content and advice on staying under the radar when purchasing links. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "New Feature for Premium Members: SEO Tips & Tricks"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "New Feature for Premium Members: SEO Tips & Tricks"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Oatmeal\n          \n            Oatmeal"
}