{
  "url": "https://moz.com/blog/new-interesting-insights-into-google-rankings-spam-from-pubcon",
  "slug": "new-interesting-insights-into-google-rankings-spam-from-pubcon",
  "title": "New & Interesting Insights Into Google Rankings & Spam from Pubcon - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Tonight's post comes via the Pubcon conference in Las Vegas and is likely of interest to many in the webmaster and search communities. Today, during the Interactive Site Review Session, Google's head of Web Spam, Matt Cutts, along with Vanessa Fox of ...",
  "content": "New & Interesting Insights Into Google Rankings & Spam from Pubcon SEO Events By: Rand Fishkin November 12, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 12, 2009 New & Interesting Insights Into Google Rankings & Spam from Pubcon SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Tonight's post comes via the Pubcon conference in Las Vegas and is likely of interest to many in the webmaster and search communities. Today, during the Interactive Site Review Session, Google's head of Web Spam, Matt Cutts, along with Vanessa Fox of NinebyBlue and Derrick Wheeler of Microsoft took thorough dives into a number of sites. The session was well coverd on Twitter, and in live form by Barry Schwartz at SERoundtable. Matt Cutts and Vanessa Fox on the Site Review Panel (photo credit: davecolorado.com) A few points in particular stood out and are worthy of coverage: Blocking Internet Archive may be a Negative Signal Matt Cutts noted that spammers very frequently block archive.org from crawling/storing their pages and few reputable sites engage in this. Thus, it's a potential spam signal to search engines. SEO Theory has a good writeup on when and why there may be legitimate reasons to do this, but webmasters seeking to avoid scrutiny may want to take heed. _ Web Page Load Time can Positively Influence Rankings Maile Ohye actually mentioned this at SMX East in New York, but Matt Cutts repeated it again today. In a nutshell - while slow page load times won't negatively impact your rankings, fast load times may have a positive effect. This comes on a day when the Google Chrome blog introduced their new SPDY research project. I'm particularly happy about this news, because it's also true that load times have a positive second-order effect on SEO. Pingomatic recently published some excellent research on load times from Akamai noting the expectations of users for faster web browsing have doubled in the past 2 years. In addition, fast loading pages are, in my opinion, considerably more likely to earn links, retweets and other forms of sharing than their slow-loading peers. This tool from Pingdom is a great place to start testing your own site. _ It May be Easier to Walk Away from Banned Domains Sites that Google's webspam team has severely penalized or banned entirely from the index can be very difficult to re-include, and thus, Matt suggested that \"walking away\" and \"starting over\" may be a more prudent strategy. In my opinion, this is largely due to link profile issues - if your site has a \"spammy\" link profile, it's tough to ask an engineer to sort out the wheat from the chaffe manually (or algorithmically) and stop counting only the bad links. Thus, re-consideration requests may not be as effective a use of time as registering a new site and trying to re-build a more trusted presence. _ Repetition of Keywords in Internal Anchor Text (particularly in footers) is Troubling During a specific site's review, Matt noted that keyword usage in the anchor text of many internal links, particularly in the footer of a website, is seen as potentially manipulative. Yahoo!'s search engineers have noted this in the past and we at SEOmoz have seen specific cases where removal of keyword-stuffed internal links from a footer had immediate impacts on Google rankings (removing what appeared to be large negative ranking penalties sitewide). _ Having Multiple Sites Targeting Subsections of the Same Niche can be Indicative of Spam Matt Cutts today mentioned that \"having multiple sites for different areas of the same industry can be a red flag to Google.\" Though Googlers have mentioned this before, today's site review panel brought renewed attention to both Google's ability and proclivity for carefully considering not only an individual site, but all the other sites owned by that registrant/entity/person. Given Google's tremendous amount of data on web usage behavior, many SEOs suspect that they track beyond simply domain registration records. I also presented at Pubcon today - on a panel called Linkfluence: How to Buy Links with Maximum Juice and Minimum Risk (live SERoundtable coverage here) - as the counterpoint speaker (on why not to buy links). I'll try to have that presentation in written format early next week on the blog. p.s. I was asked by a large number of attendees at the conference about our venture capital fundraising experience. I expect to be able to write about that very soon and certainly appreciate all the support. :-) p.p.s. For those who are interested, my brother, Evan Fishkin (who works at Portent Interactive) had his head shaved by Google's webspam chief. On a personal note, I must say I was particularly impressed with Matt's ability to shave a head without nicks or cuts, and his foresight in bringing proper equipment. Unfortunately, I'm not fully briefed on why this occurred, but I do know that my little brother was in terrible need of a trim (photo of my shocked observance of the event here & more photos/video here). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "New & Interesting Insights Into Google Rankings & Spam from Pubcon"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "New & Interesting Insights Into Google Rankings & Spam from Pubcon"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}