{
  "url": "https://moz.com/blog/new-treaty-makes-uk-laws-apply-to-us",
  "slug": "new-treaty-makes-uk-laws-apply-to-us",
  "title": "New Treaty Makes UK laws apply to US - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "So you're familiar with the US laws and think that you're safe because you're not breaking them?\nIt's time to rethink that notion because of a treaty that the US signed up for. From the ArsTechnica article:\n\nAccording to the EFF, \"The treaty requires th...",
  "content": "New Treaty Makes UK laws apply to US Moz News G By: GeoffreyF67 August 16, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! G By: GeoffreyF67 August 16, 2006 New Treaty Makes UK laws apply to US Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. So you're familiar with the US laws and think that you're safe because you're not breaking them? It's time to rethink that notion because of a treaty that the US signed up for. From the ArsTechnica article: According to the EFF, \"The treaty requires that the U.S. government help enforce other countries' 'cybercrime' laws—even if the act being prosecuted is not illegal in the United States. That means that countries that have laws limiting free speech on the Net could oblige the F.B.I. to uncover the identities of anonymous U.S. critics, or monitor their communications on behalf of foreign governments. American ISPs would be obliged to obey other jurisdictions' requests to log their users' behavior without due process, or compensation.\" Those are legitimate issues to worry about, but among some conservative commentators, the fear goes far beyond thorny questions of international relations. Distrust of \"leftists,\" \"internationalists,\" and \"Eurocrats\" is palpable. \"Even worse, the Cybercrime Treaty is open to all nations to ratify,\" writes one commentator. \"That means a future leftist President could even allow Communist China to sign on to the treaty and direct U.S. law enforcement to investigate Chinese dissidents, even Americans, based in the United States.\" Sure, because the left hates human rights and privacy, and it wants nothing more than to spy on ordinary Americans who haven't committed a crime. Oh, wait. Or again, \"the treaty could allow European or even Chinese Communist agents to electronically spy on innocent Americans.\" The Europeans, as the Convention's drafters, come in for special flogging—\"greater control over what we do on the Internet is the goal of the Eurocrats so enamored with global government.\" It's actually pretty scary when you think about it. The ability of other countries to target their laws at US citizens is a troubling prospect. I'm not surprised that something like this has happened given that the Internet is a global phenonemon. I haven't read the specifics of the treaty but if it's reciprocal - that is, US legal enforcement can enforce US laws abroad - that's also a scary proposition. G-Man Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "New Treaty Makes UK laws apply to US"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "New Treaty Makes UK laws apply to US"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "GeoffreyF67\n          \n            GeoffreyF67"
}