{
  "url": "https://moz.com/blog/new-seomoz-pricing-plans-more-keywords-for-everyone",
  "slug": "new-seomoz-pricing-plans-more-keywords-for-everyone",
  "title": "New SEOmoz Pricing Plans + More Keywords for Everyone! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "More than six months have passed since we last updated our plans and pricing with the launch of our web app last summer. In that time, we have gotten a ton of great feedback, brilliant suggestions, and more specifically, pleas for a better price point between $99 and $499 (with more campaigns). We…",
  "content": "New SEOmoz Pricing Plans + More Keywords for Everyone! Moz Tools By: Adam Feldstein June 2, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Adam Feldstein June 2, 2011 New SEOmoz Pricing Plans + More Keywords for Everyone! Moz Tools The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. More than six months have passed since we last updated our plans and pricing with the launch of our web app last summer. In that time, we have gotten a ton of great feedback, brilliant suggestions, and more specifically, pleas for a better price point between $99 and $499 (with more campaigns). We gave this a lot of thought, crunched some numbers, and today we're launching improved plans and pricing for SEOmoz PRO! Improved Plans & Pricing What's New & Notable 1. PRO plan members now get 300 keywords! That's 50 more than before and they can be tracked across up to 3 search engines. 2. A New PRO Plus tier with more than double the keywords and campaigns! Many of you have asked for it, and now it is finally here. This new plan includes more than twice as many campaigns as PRO, and a bunch more keywords. 12 Campaigns 1,000 Keywords (across up to 3 search engines) 10,000 page crawl depth per campaign 1 private Q&A question per month Branded PDF reports 3. PRO Elite is now beefier! 30 campaigns (compared to just 10 before) 3,500 keywords across up to 3 search engines (compared to 2,000 before) Note: to support the increase in campaigns, we have limited to crawl depth to 20,000 pages. If you already have and like the old PRO Elite plan, nothing has changed, but you can switch over to the new version at any time. 3 private questions per month Branded PDF reports 4. SSL/HTTPS crawling now supported! Many of you have been patiently waiting, and I am now happy to announce that we now crawl https pages as part of campaign craws. If you have any SSL pages on your site, you should start to see them processed and analyzed with the your next crawl that begins later than today. 5. Branded PDF Reports new to PRO Plus & PRO Elite! You may have noticed this mentioned above. We have added a new feature to the PRO Plus and higher plans, which supports the addition of customer logos at the top of all PDF reports. Upgrading is Easy If any of these new plans strike your fancy, we have also improved interface for changing your plan, so it's easy to upgrade or downgrade at any time. or... Switch to Annual Billing and save 20% If you are changing your plan, you might also consider an annual membership. If you buy for a full year, we give you a 20% discount over what you would pay monthly for twelve months. It's easy to switch to annual pricing on the PRO Billing & Subscription page. If I'm already an Elite or Premier member, will my plan change? Nope, nothing will change, but you can opt to choose a different plan at any time. Need more? We've got you covered! We do have a couple of larger plans: Agency - $2,000/month (Great if you are managing lots of sites!) 120 Campaigns 20,000 keywords per account 10,000 pages crawled per campaign 4 private Q&A questions per month Branded PDF Reports Enterprise - $4,000/month (Great if you are managing really large sites!) 20 Campaigns 30,000 keywords per account 1,000,000 pages crawled per campaign (on a 4-week cycle) 4 private Q&A questions per month Branded PDF Reports This plan is not available yet, but will be in the next few weeks These plans are not self service at the moment, but if they like something that you need, contact help@seomoz.org and we will be happy to set you up! Let us know what you think! We took a lot of great feedback into account when creating these new pricing plans, but we know we can make them better. Please share your feedback in the comments below, or click on Help at the very top right of the page, and then Feedback if you want to comment privately. I promise, we're listening. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "New SEOmoz Pricing Plans + More Keywords for Everyone!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "New SEOmoz Pricing Plans + More Keywords for Everyone!"
    },
    {
      "level": "H2",
      "text": "Improved Plans & Pricing"
    },
    {
      "level": "H2",
      "text": "What's New & Notable"
    },
    {
      "level": "H3",
      "text": "1. PRO plan members now get 300 keywords!"
    },
    {
      "level": "H3",
      "text": "2. A New PRO Plus tier with more than double the keywords and campaigns!"
    },
    {
      "level": "H3",
      "text": "3. PRO Elite is now beefier!"
    },
    {
      "level": "H3",
      "text": "4. SSL/HTTPS crawling now supported!"
    },
    {
      "level": "H3",
      "text": "5. Branded PDF Reports new to PRO Plus & PRO Elite!"
    },
    {
      "level": "H2",
      "text": "Upgrading is Easy"
    },
    {
      "level": "H2",
      "text": "or... Switch to Annual Billing and save 20%"
    },
    {
      "level": "H2",
      "text": "If I'm already an Elite or Premier member, will my plan change?"
    },
    {
      "level": "H2",
      "text": "Need more? We've got you covered!"
    },
    {
      "level": "H2",
      "text": "Let us know what you think!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "Moz AI: Introducing Augmented Intelligence"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Adam Feldstein\n          \n            Adam Feldstein\n          \n            Adam Feldstein"
}