{
  "url": "https://moz.com/blog/new-features-in-oses-spam-score-the-mozscape-api",
  "slug": "new-features-in-oses-spam-score-the-mozscape-api",
  "title": "New Features in OSE's Spam Score & the Mozscape API - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Introducing the Spam Score Histogram for Open Site Explorer. Visualize the distribution of potentially spammy links that show up in a site's link profile.",
  "content": "New Features in OSE's Spam Score & the Mozscape API Link Building | Moz Tools By: Rand Fishkin June 17, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin June 17, 2015 New Features in OSE's Spam Score & the Mozscape API Link Building | Moz Tools The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This week, we launched a feature inside Open Site Explorer that I'm very excited about - the Spam Score Histogram, found by clicking on the \"spam analysis\" tab:The histogram is particularly useful for visualizing the distribution of potentially spammy links that show up in a site's link profile. Above, for example, we're looking at Moz.com, with a strong distribution of sites that have 0-5 spam flags. According to our research, that means the vast majority of those sites are unlikely to be penalized or banned by Google.For more detail on Moz's Spam Score, check out the original blog post and my Whiteboard Friday.The new histogram view lets us do nice comparisons like these:Houzz.com has a very large list of sketchy-looking sites linking to them (many seem to be very thin content sites from China, curiously).Competitor (well, sort-of-competitor), Porch.com, has a much smaller link profile with a very different distribution. Their link profile looks even healthier than Moz's to me!But, the new spam score histogram isn't the only new feature. We've also got a new power available to API users - the ability to query data from the previous index. If you want to know what a previous Domain Authority score looked like, or how many links we reported to a page in our last index, you can now do so using the Moz API. If you want to get started, check out the documentation here, or get in touch directly with Chris Airola (email chris.airola at moz.com), who manages paid API accounts and loves to help.Many thanks to the Research Tools and Big Data teams at Moz, who've worked to make this possible. I'm happy to answer questions and will try to be in the comments here frequently. I wish you good spam exploring my friends! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "New Features in OSE's Spam Score & the Mozscape API"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "New Features in OSE's Spam Score & the Mozscape API"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}