{
  "url": "https://moz.com/blog/new-seo-tool-rank-checker",
  "slug": "new-seo-tool-rank-checker",
  "title": "New SEO Tool: Rank Checker - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I've just put the finishing touches on a new tool that I think is a killer addition to our current arsenal of SEO tools.  It's basically a tricked-out version of the \"Where's it Rank?\" PHP script that I of...",
  "content": "New SEO Tool: Rank Checker SEO Tools O By: Oatmeal June 13, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! O By: Oatmeal June 13, 2007 New SEO Tool: Rank Checker SEO Tools The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I've just put the finishing touches on something new that I think is a killer addition to our current arsenal of SEO tools. It's basically a tricked-out version of the \"Where's it Rank?\" PHP script that I offered up for free (source code) several months back. The tool is pretty straightforward: you enter a URL, keyword, and what search engine you'd like to search and it will automatically check your rankings and report back. Rank Checker In addition to the features the original script had, I added the following bells and whistles: Supports Google, Yahoo, MSN, and Ask Allows you to check rankings on all the foreign TLDs on the major SEs (google.co.uk, de.yahoo.com, etc) You can either be forwarded to the actual SERPs or simply have the tool report back the rankings it found Rankings can be added to your rankings archives Ranking archives can be viewed, sorted, and downloaded as a CSV file When rankings are found it reports whether they have increased or dropped (when compared to previous rankings) and this change is stored in your archives I also created a browser button that allows you to conveniently check the rankings for the page you're currently viewing. The tool is free but requires you to be logged into your SEOmoz account. Also, because it's is a bit resource intensive basic members are limited to 5 keywords a day, premium members can run an unlimited amount. I've just got to add that for a tool that took a little over a day to build (oh, how I love my rapid development framework) I'm really pleased with the results - what it lacks in complexity it more than makes up for in replay value. I'm hoping it becomes one of the resources that keeps people coming back day after day, much like the PS tool or IP2Loc. Please send any questions, comments or feedback about our Rank Checker tool to sitesupport@seomoz.org. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "New SEO Tool: Rank Checker"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "New SEO Tool: Rank Checker"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Oatmeal\n          \n            Oatmeal"
}