{
  "url": "https://moz.com/blog/new-native-advertising-best-practices",
  "slug": "new-native-advertising-best-practices",
  "title": "The New Best Practices for Native Advertising on Editorial Sites - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "How and when we interact with ads online drastically changed in March when COVID-19 ushered in a new era of rolling global lockdowns, not to mention lifestyle changes that none of us could predict. People started interacting with content from different devices, at different times, and reacting to…",
  "content": "The New Best Practices for Native Advertising on Editorial Sites Online Advertising | Marketing Psychology | Marketing Industry By: Megan Morreale November 17, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Megan Morreale November 17, 2020 The New Best Practices for Native Advertising on Editorial Sites Online Advertising | Marketing Psychology | Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Digital advertising is different nowadays. How and when we interact with ads online drastically changed in March when COVID-19 ushered in a new era of rolling global lockdowns, not to mention lifestyle changes that none of us could predict. And for native advertising in particular, ad performance has always relied on the nature of consumer behavior on the sites where they appear. Because they fit the form and function of their sites, their best practices are directly dictated by how we interact with the organic content that surrounds them. On editorial sites (think news, niche blogs and online magazines), consumer behavior has shifted quite a bit. People started interacting with content from different devices, at different times, and reacting to different types of campaign creatives. All of this resulted in a new set of best practices for marketers to follow when it comes to running effective native ads. We’ll walk you through those new best practices and answer the following: How have native ads been impacted by COVID-19?How has consumer interaction with native ads changed?What campaign messaging is the most effective?What KPIs are other advertisers in your vertical targeting?What creative strategies perform best? COVID-19's impact on news sites and native ads There was a whole lot of uncertainty this past March, and as a result, many companies pumped the advertising breaks. Despite the slowdown, the industry will spend more on native ads in 2020 than they did in 2019, but at a much smaller growth rate. According to eMarketer, $47.33 billion will be spent on native ads in 2020 — a 4.8% growth spurt. They expect native ad spend to grow by 21% as digital ad spend recovers next year. The ads that did run, though, saw a lot of attention. The coronavirus news cycle brought a boom of interest to editorial sites across the web from March to April. Nieman Lab reported that articles about the pandemic increased overall traffic to 350% week over week, totalling 980 million views. When the dust settled, it was clear consumer priorities had shifted, and where and when they were spending time on editorial sites did, too. Where and when consumers interact with native ads Editorial sites have the potential to serve native ads in a lot of different places. They can appear as promoted articles on a homepage or category page, as native display ads in the middle of an article, and at the bottom of the article, to name a few examples. We partnered with Nielsen using BrainVu, a cloud-based neurocognition technology, to measure consumer reactions to ads on the page, meaning we physically measured people's brain waves as they interacted with ads on editorial sites. Immersive AI and virtual reality technology (think headgear with a ton of wires attached) measured when and where they were paying the most attention and had the highest emotional response. We found that consumers were paying 20% more attention to ads at the bottom of the article and had a 17% higher emotional response than anywhere else on the page. Plus, research participants displayed an 8% lower cognitive load at the end of an article. Basically, they had more “brain space”, or memory resources, to pay attention to new content or ads. A follow-up study from Nielsen revealed that these moments occurred most often as we were on our way to bed or just waking up, taking a work break, or using the restroom. Lunch breaks, lines, and commutes had been deprioritized. When we're in those moments of next, primed and ready to discover content or advertising from brands, what are the topics engaged with the most? We've seen three major shifts in consumer interest that should shape the messaging for your next native advertising campaigns. Campaign messaging people engage with the most The news topics gaining the most attention on editorial sites have changed, which should signal to marketers a need for a shift in native ad messaging. Long-term trends in news are a reflection of consumers most relevant and immediate concerns. Aligning your campaign messaging with these long-term trends will improve your native ad performance. So, what are those long-term trends? First off, content related to the coronavirus and political climate has all but eclipsed consumer attention on editorial sites. Underneath those high-level basic interests, we've identified four trending topics that have emerged since the coronavirus was declared a pandemic, and with which we're seeing a lot of engagement: Investing: The combination of coronavirus and the 2020 election has resulted in some ups and downs in the stock market, and everyone wants to jump on the bandwagon. (Nerdwallet pushed a partnership with Fundrise just in time for the trend).Food: Quarantine baking has resulted in a burst of attention to the food category, specifically for topics related to desserts and baking. (Just Egg leaned into marketing as a faux egg alternative when quarantine baking took off.)Racism: George Floyd's murder and the Black Lives Matter movement have sparked a recent increase in engagement with topics related to racism and equality. (Mint promoted a webinar and video series on how to close the racial wage gap.)Work: How and when we're getting back to work is on our minds. (Nestlé released a series of content, including this article, about how parents were handling working from home.) Here's how interest in these content topics have broken down over the past six months, measured in pageviews: While specific news stories have created spikes of pageviews for content related to these topics, interest has stayed steady for all four since April. How coronavirus influenced native advertising KPIs Native advertising KPIs shifted after COVID-19 was declared a global pandemic. To illustrate this change, we took a look at the total advertiser spend on our network across each vertical, and broke it down by three high-level KPIs: brand awareness, lead generation, and purchases. If the percentage of spend allocated to one of those KPIs changed more than 5% after March or April, we included it here. Brand Awareness Brand awareness includes campaigns optimized for KPIs like impressions, clicks, and pageviews. For the fashion and technology verticals, brand awareness became a much higher priority after March 8th. Lead generation Lead generation includes KPIs like form fills, engagement on the page, or newsletter subscriptions. Both the entertainment and auto industries prioritized lead generation just after the pandemic was declared. They eventually focused more on brand awareness by April, when a need for education and finance products took their place. As consumers looked to support schooling at home, and make sure their finances were in order, education and finance brands started to prioritize lead generation over other KPIs. Purchase Purchase KPIs include cart checkouts, contacting a sales representative, or any digital step in the funnel that results in a sale. Directly after the pandemic hit, healthcare and home good brands prioritized purchase KPIs as consumers looked to stay healthy and improve their inside spaces. Healthcare has continued to prioritize purchase KPIs since the pandemic was announced. Moving into April, more and more education marketers also prioritized purchase KPIs to support homeschooling and professional development needs. Beauty advertisers also filled a need left by closing salons across the globe. Fashion marketers started prioritizing purchase KPIs again through April as it became clear how consumer priorities had shifted. Creative best practices since coronavirus When pen meets paper (figuratively speaking) and it's time to build your campaign creatives, you'll want to be sure to include creative elements that consumers find engaging. Below you’ll find insights for native ads that are either driven by sponsored content (think articles, e-books, photo galleries, and videos on the landing page) and video (think video creatives where a click isn't necessarily the goal). Sponsored content These ads are made up of a headline and photo to entice consumers to click and learn more about what you have to offer. Both require a bit of attention to make sure your ad performs as best as it can. We're seeing increases in click-through-rates (CTRs) for the following photo elements: Photos without text Photography over illustrations People over landscapes Colors over black and white​ Close-ups over photos at a distance We recommend A/B testing photos with one or two of these elements to see what works best for your campaign. Keywords After your photo catches your eye, your headline has to convince people to click and keep reading. We've seen certain keywords give advertisers a better chance at a user clicking through to their landing page. Over the past month, the following keywords have had a positive impact on CTRs: These keywords used to have a positive impact on CTR, but are now used in many different ad campaigns, meaning you'll likely have to bid higher in order to get in front of consumers. Finally, these keywords haven't quite made it into the 'strong engagement' bucket, but have had a positive CTR impact for a smaller selection of advertiser campaigns and might be worth testing if relevant to your brand. Video campaigns When producing video assets, there are specific action types and characteristics to include to make an impact on completion rate and viewability. High completion rate Consider showing scenes with swimming, air travel, stretching, and other high-movement related action types to encourage people to watch your video ad all the way to the end. In addition, video characteristics like winter scenes, men, videos without people, and food are also showing a positive impact on completion rates. High viewability When it comes to catching someone's eye, actions like eating, climbing, and stretching seem to be the most effective. Male actors, videos that aren't illustrated, colors, and food are also great characteristics to include to make sure your video isn't missed. Main takeaways ​The native advertising landscape has changed since March and the declaration of a global pandemic. Ad spend changed in response to consumer behavior, and we walked away with a new set of best practices to use as a basis for our native advertising campaigns. When you're building your next native advertising campaign, ask yourself: Can I incorporate a messaging angle related to investing, food, racial justice or work?Are other advertisers seeing success with my desired KPI in my vertical?Have I considered testing native ad placements at the bottom of the page where people are most likely to be engaged?Am I following creative best practices like including colorful, close-up images of people? You should always A/B test—best practices should always be taken with a grain of salt. Using these best practices as a basis for testing your native advertising campaigns moving forward will make your optimization process a bit easier, and ultimately lead to better performance marketing. You can stay up to date on the latest content topics and creative trends at Taboola Trends. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H2",
      "text": "COVID-19's impact on news sites and native ads"
    },
    {
      "level": "H2",
      "text": "Where and when consumers interact with native ads"
    },
    {
      "level": "H2",
      "text": "Campaign messaging people engage with the most"
    },
    {
      "level": "H2",
      "text": "How coronavirus influenced native advertising KPIs"
    },
    {
      "level": "H3",
      "text": "Brand Awareness"
    },
    {
      "level": "H3",
      "text": "Lead generation"
    },
    {
      "level": "H3",
      "text": "Purchase"
    },
    {
      "level": "H2",
      "text": "Creative best practices since coronavirus"
    },
    {
      "level": "H3",
      "text": "Sponsored content"
    },
    {
      "level": "H4",
      "text": "Photos without text"
    },
    {
      "level": "H4",
      "text": "Photography over illustrations"
    },
    {
      "level": "H4",
      "text": "People over landscapes"
    },
    {
      "level": "H4",
      "text": "Colors over black and white​"
    },
    {
      "level": "H4",
      "text": "Close-ups over photos at a distance"
    },
    {
      "level": "H4",
      "text": "Keywords"
    },
    {
      "level": "H3",
      "text": "Video campaigns"
    },
    {
      "level": "H4",
      "text": "High completion rate"
    },
    {
      "level": "H2",
      "text": "Main takeaways"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H3",
      "text": "Context is King: A Million Examples of Creative Ad Campaigns Getting it Right"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Megan Morreale\n          \n            Megan Morreale\n          \n            Megan Morreale"
}