{
  "url": "https://moz.com/blog/new-search-technology-forum-seochat",
  "slug": "new-search-technology-forum-seochat",
  "title": "New Search Technology Forum @ SEOChat - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The nice folks at SEOChat have made yours truly the moderator for a new section - the Search Technologies Forum. The description for this new area is:\n\n...",
  "content": "New Search Technology Forum @ SEOChat Public Relations By: Rand Fishkin February 16, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 16, 2005 New Search Technology Forum @ SEOChat Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The nice folks at SEOChat have made yours truly the moderator for a new section - the Search Technologies Forum. The description for this new area is: Discuss search engine technologies, algorithms, technical papers and other advanced search concepts. I'm very excited to be able to present this type of work and hopefully see others start some thread on the subject matter as well. Already, the concept that keyword density should be replaced by term weight is spreading throughout SEOChat. I hope that other misconceptions can be put aside as well. Already, this new forum and trend in the online SEO communities has resulted in some controversy over the reasons and value of the IR research material to the common optimizer. Nick W, of threadwatch fame, posted a thread called preeching to the choir (sic): I just know someone will say, \"to understand future algos you need to look at what may come\" - yeah yeah, clearly, however this self trumpeting phenomenomom goes way further than that and if, as i suspect, it's goal is to make everyone else on the forum think your real clever, it's not working with me. It makes me think your a prat. As prats often do, I responded with a thread - Value of Search Technology & IR Research Papers to the Common SEO - that I hope will help SEOs to understand the value of reading complicated IR white papers, slogging through difficult-to-read threads, and taking the time to really understand this work. Nick's a great guy and I'm glad he stirred up this debate - it forced me to explain why this information can be so valuable to the community. Let's hope there's something we can all learn. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "New Search Technology Forum @ SEOChat"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "New Search Technology Forum @ SEOChat"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}