{
  "url": "https://moz.com/blog/new-seo-expert-quiz",
  "slug": "new-seo-expert-quiz",
  "title": "Take the SEO Expert Quiz and Rule the Internet - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "You are master of the keyword. You create 1,000 links with a single tweet. Google engineers ask for your approval before updating their algorithm. You, my friend, are an SEO Expert. Prove it by taking our new SEO Expert Quiz.",
  "content": "Take the SEO Expert Quiz and Rule the Internet Technical SEO | Advanced SEO | SEO Basics By: Cyrus Shepard May 28, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Cyrus Shepard May 28, 2014 Take the SEO Expert Quiz and Rule the Internet Technical SEO | Advanced SEO | SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. You are master of the keyword. You create 1,000 links with a single tweet. You rank for the word \"rank.\" Google engineers ask for your approval before updating their algorithm. You, my friend, are an SEO expert. Ready for fun? Here at Moz we gathered our wits (it didn't take very long) and created a new quiz to test our SEO knowledge. Based on a quiz that our co-founder Rand first published back in 2005, at the dawn of electronics and lighter-than-air travel, we now present to you the new and improved SEO Expert Quiz. The quiz contains 50 questions and takes about 15 minutes to complete. The questions are randomized so no two people will get the exact same quiz with the same order of questions. Here's what to expect.1. The quiz is hard! Like, astronaut training hard. Very few people score 100%. The breakdown of performance looks like this: 0-40% SEO Newbie: You rank on page 7, but are aiming to move up. 41-60% SEO Novice: Young, but strong in the ways of the Force, you are. 61-75% SEO Pro: The traffic is pouring in! 76-90% SEO Expert and Formula One race car driver 91-100% Lord of the Internet, Master of the SEO Realm2. For fun only! The Expert Quiz isn't meant to be a rulebook of the Internet. You may even disagree with some of the answers—and you may be right! We work in a constantly evolving field with lots of room for interpretation at the top levels. Discussion and debate between very smart people is how we learn and grow our expertise. The only reward for finishing in first place is supreme bragging rights. If you win your office pool, you may get free lunch for the next month. Please participate and help our knowledge grow, but don't take it too seriously.3. MVP: next steps We built this out of passion for testing our SEO knowledge. If you like the quiz, we'd love to build a more robust version that saves your score, and even gives you a badge to display on your user profile. Let us know what you think. Ready to get started? Take the SEO Expert Quiz Don't forget to show off your score when you finish. Let us know in the comments below! What surprised you, which question did you totally ace, and what should we ask next time? Rock on, SEO Sensei.Big thanks to Devin, Derric, Josh, Carin, Shelly and Rand for the hard work putting this together. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Take the SEO Expert Quiz and Rule the Internet"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Take the SEO Expert Quiz and Rule the Internet"
    },
    {
      "level": "H4",
      "text": "1. The quiz is hard!"
    },
    {
      "level": "H4",
      "text": "2. For fun only!"
    },
    {
      "level": "H4",
      "text": "3. MVP: next steps"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Cyrus Shepard\n          \n            Cyrus Shepard\n          \n            Cyrus Shepard"
}