{
  "url": "https://moz.com/blog/newbie-tweaks-title-tags-improves-rankings",
  "slug": "newbie-tweaks-title-tags-improves-rankings",
  "title": "Newbie Tweaks Title Tags - Improves Rankings - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I swear I did not rip the title of this post off from The Onion newspaper!\n\nAfter spending weeks locked in my basement reading SEOmoz with nothing but the light of the computer monitor to see, I decided it was time to try some on-site SEO techniques on my website selling locking mailboxes.",
  "content": "Newbie Tweaks Title Tags - Improves Rankings On-page SEO M By: Matthew Prestwich April 22, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! M By: Matthew Prestwich April 22, 2009 Newbie Tweaks Title Tags - Improves Rankings On-page SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I swear I did not rip the title of this post off from The Onion newspaper! After spending weeks locked in my basement reading SEOmoz with nothing but the light of the computer monitor to see, I decided it was time to try some on-site SEO techniques on my website selling locking mailboxes. I'm trying to rank for the keyword phrase \"locking mailbox.\" Before trying any SEO stuff, my website was not even ranking at all for \"locking mailbox.\" So, I made user-friendly URLs, fixed some broken links, and then opened a Google Webmaster Tools account. I downloaded the XML sitemap module for Drupal (my website is a Drupal website) and submitted my sitemap to Google. After about a week I went from not even registering on Google for \"locking mailbox\" to ranking 191 for the term. Next, I changed my title tags. For a LONG time (over a year) my title tag on my home page was \"MailCase | Home\" .... that's it! I didn't know any better! After reading SEOmoz I realized that I should probably have the words \"locking mailbox\" somewhere in my title tags if I wanted to rank for that keyword phrase. So, I changed my home page title tag to \"MailCase | Locking Secure Mailboxes\" ... and then I waited. About a week later, Google recognized the change and viola! My website jumped from 191 to ranking 56 for the term \"locking mailbox.\" I was totally amazed by the dramatic improvement. Now, I realize 56 is not actually that great, but for doing nothing more than following the on-site SEO techniques I learned on SEOmoz, I was able to basically take a website that was not even ranking for a term and in two weeks get it ranking 56. So, that must be the low hanging fruit, right? Moving up the next 55 places will probably be the true test of my newly emerging SEO skillz! Matthew Prestwich is a beginner SEO who sells locking mailboxes on MailCase.com. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Newbie Tweaks Title Tags -  Improves Rankings"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Newbie Tweaks Title Tags -  Improves Rankings"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Matthew Prestwich\n          \n            Matthew Prestwich"
}