{
  "url": "https://moz.com/blog/next-level-3-moz-tools-to-conquer-your-competition",
  "slug": "next-level-3-moz-tools-to-conquer-your-competition",
  "title": "Conquer Your Competition with these Three Moz Tools - Next Level - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Size up your competition and gain the upper hand with this second installment of the Next Level video series. We'll take you on a SERP-fari where you can try out three ways to use the Moz tools to conquer your competitors.",
  "content": "Conquer Your Competition with these Three Moz Tools - Next Level Competitive Research | Moz Tools By: Ellie Wilkinson November 20, 2014 Table of Contents Copied! By: Ellie Wilkinson November 20, 2014 Conquer Your Competition with these Three Moz Tools - Next Level Competitive Research | Moz Tools Welcome to the second edition of Next Level! In the first Next Level blog post, the Success Team and Help Team here at Moz created 10 video walkthroughs to help you \"power up\" your knowledge of the Moz tools. We're continuing the educational series with a new video and a workflow showing you how to take on your competitors using Moz. Read on and level up! For SEOs, the battle to rank highest in the search results often comes down to survival of the fittest. But if you know how to size up your competition, you can gain the upper hand and become king of the jungle! Come on a SERP-fari in this Next Level video and try these three ways to use the Moz tools to out-hunt all the other lions. Workflow summary To review, here's an outline of the three steps to scoping out the competition! (You’ll need a Moz Pro subscription to use Keyword Difficulty and Fresh Web Explorer. If you aren't yet a Moz Pro subscriber, you can always try out the tools with a 30-day free trial.) After you've entered three competitors in your Moz Analytics campaign settings, head over to the Keyword Difficulty tool to get a detailed look at the search results for keywords you're targeting. Don't forget to run a full SERP analysis report for even more data! Next, investigate your competitors' recent links and brand mentions using Fresh Web Explorer to get some content and link building ideas. Finally, head over to Followerwonk to find potential Twitter followers to poach from your competitors. Looking for other resources to help you plan your attack? Here are some that might help. Go get 'em, tiger! (But watch out for zebras…) Open Site Explorer's New Link Building Opportunities Section (and a Slight Redesign) - Learn more about OSE's new link opportunities section, particularly the \"link intersect\" tool, which can help you find pages that are linking to your competitors but not you. Moz Academy: Competitive Analysis with the Keyword Difficulty Tool - Get a detailed walk-through of how to use the Keyword Difficulty and SERP Analysis tool to beat your competition. The Illustrated SEO Competitive Analysis Workflow - Dive into the competitive research process with this illustrated guide. There's also a terrific list of resources at the end of the article. If you have other ways of using the Moz tools to rule the jungle, we'd love to hear them! Sound off in the comments below. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Conquer Your Competition with these Three Moz Tools - Next Level"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Conquer Your Competition with these Three Moz Tools - Next Level"
    },
    {
      "level": "H3",
      "text": "Workflow summary"
    },
    {
      "level": "H2",
      "text": "Try our SEO Competitive Analysis tool"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Actually Be Better Than Your Competitors in the Eyes of Choosy Customers"
    },
    {
      "level": "H3",
      "text": "SEO Gap Analysis — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Daily SEO Fix: Competitive Link Research"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ellie Wilkinson\n          \n            Ellie Wilkinson\n          \n            Ellie Wilkinson"
}