{
  "url": "https://moz.com/blog/niche-tv-i-am-famous-are-you-next-2940",
  "slug": "niche-tv-i-am-famous-are-you-next-2940",
  "title": "Niche TV: I am Famous, Are You Next? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "So - did the thread title get your attention?Cool, because the rest will be even better, I am NOT really \"famous\" but maybe a tad bit in my own niche, also please note that this is a true story and I am really the one in my videos, I actually thought this worked so well that I wanted to share with…",
  "content": "Niche TV: I am Famous, Are You Next? Whiteboard Friday By: Joseph Tamargo October 23, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Joseph Tamargo October 23, 2007 Niche TV: I am Famous, Are You Next? Whiteboard Friday This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. So - did the title get your attention? Cool, because the rest will be even better. I am not really \"famous,\" but maybe a tad bit in my own niche. Also, please note that this is a true story and I am really the one in my videos. I thought this worked so well that I wanted to share with the \"Moz family.\" What's this post about? This is a step by step guide on how I increased my readership and earnings as well as built some nice back links, while providing a great user experience with no money out of pocket. You will be creating your OWN NICHE TV station Things you will need 1) Digital camera or video camera (Don't say you don't know anyone without one, find someone) 2) A friend to act or hold the camera for you 3) Something to show someone (i.e., stick within your niche; it just works better) 4) A small list of videos or episodes you would like to create (save those ideas while there still fresh) Side Note: Everyone has a niche, whether it's cooking, cleaning, sewing , or simply magic tricks or something funny. Step One Now what you do is spend a few minutes with your friend and go over what you will be doing on video so you don't mess up too much You can see my outtakes here. It's kinda funny, if you ask me. Also notice how adding music to your videos will make them more enjoyable. They actually study and use methods like this for shoppers, although do you ever hear that music while you shop? Okay - getting back on topic... Once you decide on what you will be taping, you start the camera and take your footage. Please note it is okay if you mess up: just keep taping. I will show you how to fix that next! Step Two Now that you have your footage, you can upload it the way it is if you feel it came out right. If you do need to edit your video, you can do it a few different ways: Windows Movie Maker is a program that's free, and you can do all kinds of good stuff It only takes a few minutes to learn Sony Vegas Movie Maker (this program is not free but does have a 30-day trial version that is available for download right on the web) With the above programs, you can add background noise, fade frames, and all that good stuff you see on videos. It's really not that hard to do. Step Three: Now that you have your videos ready, edited, all the effects are done, and you are 100% satisfied with your videos, it's now time to get them live and on the web. For this, I recommend YouTube. Why YouTube? It's easy, it's free, it's simple. They also have a large audience, if you haven't noticed, and that gives you the potential to receive more video views. Step Four: Add the section to your website. You can see how I did it here. Once you have your videos on YouTube, it's quite easy to upload them to your site and start getting people to watch them. There are many places from which you can get a lot of free traffic with videos. If you are not sure where, just post here and I can help you, depending on your niche. Some Notes and tips: 1) Create a video that is friendly and makes people comfortable. Trying to brand it with an overdose of a corporate structure will just bore your audience. It is simple things like outtakes, a word slip, or even real laughing and talking that make people connect. Talking like a robot will not get you more video views. Remember, we are all human, and like to interact as such. 2) Don't read this post and say \"Wethead, you are wacked.\" Go out and make some videos. Spend 10 minutes a day and you will notice that after a week you will have a complete video. Maybe you will get excited like I do and work all night, having it done in hours; who knows. 3) I have noticed over the last few weeks while I study my analytics that my videos are being watched, and in turn lowering my overall bounce rate. They also attract lazy people that don't like to read! 4) Don't worry about whether people will watch. Think to yourself how many times you watch a video because someone says, \"Hey, watch this!\" People just love videos. 5) Remember that it will take time to create a perfect on screen appearance. You may feel like it will take forever, but it won't. The more you get in front of the camera, the better you will become. 6) YouTube is your friend. I stressed that above and I will again. You can gain even more branding power with YouTube, so make sure you use it for your videos! Conclusion: So, to bring this long post to a close, just think to yourself: If some random pool guy from upstate New York can get excited and make pool videos, then so can you! Why just limit yourself to boring text? They say a picture is worth a thousand words; what's a video worth? Please feel free to comment , or ask me any questions you like, and I hope this will help you get some more traffic and more readers to your site! Lastly, this post was inspired by Whiteboard Friday. One day I started to watch the \"Moz Tube\" and got hooked, and now look at me: I just spent two hours writing this! Just more proof the video thing works! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Niche TV:  I am Famous, Are You Next?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Niche TV:  I am Famous, Are You Next?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Joseph Tamargo\n          \n            Joseph Tamargo"
}