{
  "url": "https://moz.com/blog/no-liability-for-your-cobloggers-content-another-successful-cda-230-defense",
  "slug": "no-liability-for-your-cobloggers-content-another-successful-cda-230-defense",
  "title": "No Liability for Your Co-Blogger's Content: Another Successful CDA 230 Defense - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "May It Please the Mozzers,\n\nAttention everyone who co-blogs! If you create a blog collaboratively with another person, you may be wondering whether your blogger buddy creates potential liability for you each time she posts.\n\nWe know that website operators can't be held liable for their users…",
  "content": "No Liability for Your Co-Blogger's Content: Another Successful CDA 230 Defense E-Commerce SEO By: Sarah Bird September 30, 2008 Table of Contents Copied! By: Sarah Bird September 30, 2008 No Liability for Your Co-Blogger's Content: Another Successful CDA 230 Defense E-Commerce SEO May It Please the Mozzers, Attention everyone who co-blogs! If you create a blog collaboratively with another person, you may be wondering whether your fellow blogger could get you into legal trouble. We've known for years that website operators cannot be held responsible for their users' content thanks to the broad immunities created by section 230 of the CDA. That's old news. What's still unclear, however, is whether you can be held responsible for content created by a co-blogger if you both blog on the same site. Perhaps you're a guest blogger? Or maybe you work collaboratively with fellow enthusiasts to publish a blog about a common interest? A case came down this month that adds some clarity on this issue on liability for co-blogging. Best Western International, Inc. v. Furber 2008 WL 4182827 (D. Ariz. Sept. 5, 2008) In this case, a group of people co-blogged about problems they were experiencing with Best Western International (\"BWI\"), the hotel chain. Each of the people were members in the non-profit corporation BWI and each owned and operated a hotel under the Best Western brand name. They were not \"partners\" or \"employees\" of the same corporation. They were just individual people who shared concerns about the way BWI did business. They started a website, shared responsibilities in operating it ,and invited people to write on it. The blog didn't make any money, was not a separate business, and was accessible to the public if you knew where to look. Its main purpose was to act as a forum for all of the hotel operators involved with BWI to air their concerns. BWI, as you can imagine, didn't like the conversations being had on the site and decided to sue everybody. BWI makes what seems like a million allegations, tries to bury the defendants in paperwork, and throws every imaginable legal claim at the folks who initiated and co-blogged on the site. The defendants argued that while each should be responsible for the posts that he or she authored or helped author, they should not be legally responsible for posts written by other people. It sounds pretty common sense when you put it that way, doesn't it? On the other hand, if they are all operating and creating the site together, shouldn't they all be responsible for what's happening on the site? These are questions of law that courts are just starting to look at with frequency and clarity. In this case, the judge ruled that Section 230 of the CDA does in fact provide immunity for posts written by co-bloggers. So long as he or she didn't create or develop the post, he or she can't be liable for it. This is true even if you marketed the website, published your own posts, or solicited other people to post on the site. It is important to note that although the bloggers in this case aren't being held liable for their co-bloggers' conduct, there are many situations in which co-bloggers could still be liable for each others' content. For example, if your co-bloggers are employees of the same company, then the company is responsible for all of the co-bloggers' posts. Alternatively, you could be found liable for a co-blogger's post if a judge rules that you are partners or joint venturers, i.e., sharing in the profits and engaging in a joint enterprise together. Bottom Line: If the collaborative blog is not a business (does not make any money), is not incorporated, and there is no employment relationship, then co-bloggers would not be liable for each other's content.... Well...according to this judge, anyway. It remains to be seen whether this type of section 230 analysis becomes a trend. I'll keep you posted! Best Regards, Sarah P.S. My professional hero, Professor Eric Goldman, also blogged about this case and cites his very intelligent article on the legal ramifications of co-blogging. I commend both to your attention if this area interests you. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "No Liability for Your Co-Blogger's Content: Another Successful CDA 230 Defense"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "No Liability for Your Co-Blogger's Content: Another Successful CDA 230 Defense"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Common Mistakes E-commerce Websites Make Using JavaScript"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sarah Bird\n          \n            Sarah Bird\n          \n            Sarah Bird"
}