{
  "url": "https://moz.com/blog/no-mobile-marketing-strategy",
  "slug": "no-mobile-marketing-strategy",
  "title": "Why You Shouldn't Have a Mobile Marketing Strategy - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We all need to move beyond thinking about mobile marketing strategies. This post shows you why and offers actionable tactics that'll keep your team on top of this ever-changing area of marketing.",
  "content": "Why You Shouldn't Have a Mobile Marketing Strategy Mobile SEO By: Will Critchlow September 29, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Will Critchlow September 29, 2014 Why You Shouldn't Have a Mobile Marketing Strategy Mobile SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Before I start, I should address the irony of writing this post on a site that isn't yet designed for mobile. I don't make those decisions, nor have the insight into the development backlog. I still think this is the community to have this discussion with, so I'll just have to put up with the irony. This post isn't really about responsive websites, though. I wanted to address a broader question. There are a few marketing topics that seem to make it into board rooms sooner than others. Social media was one – I've heard a lot of senior people ask \"what's our social strategy?\" over the years and now I'm hearing \"what's our mobile marketing strategy?\". That's why I picked mobile as my topic for our upcoming SearchLove conference in London. But I don't want to give another talk on responsive design, mobile user-agent server headers and googlebot mobile. Those things have their place, but they are inherently tactics. Instead, I want to ask myself the question \"what does a true mobile marketing strategy look like?\". Before I get to that, some background:The changing mobile landscape I've been closely involved in mobile since the early 2000s. Before starting Distilled, I worked for a strategy consultancy called Analysys who specialised in telecoms (and particularly in mobile). I distinctly remember every year back then being hailed as \"the year of the mobile\" (the earliest reference I can find online was optimistic that 2000 was going to be the year of the mobile). It's funny because a decade ago, we were doing email on our phones (the iconic Blackberry appeared in 2003), but somehow WAP, GPRS and the Nokia 6600 all failed to achieve ubiquity. In the end, by 2007, we'd all stopped talking about the year of the mobile, which meant that even the explosive adoption of the iPhone took a while to fully seep into marketers' collective consciousness. At the recent ThoughtWorks ParadigmShift conference, I gave a talk on the three \"paradigm shifting\" trends I see in marketing at the moment (the other two being what I called \"your TV is just another screen\" and \"robots are filtering everything you see\"). I showed these stats: Internet trends for marketers from Will Critchlow Mobile tactics I'm clearly not the first or only person to have noticed this, and it's generated a huge amount of thinking about \"mobile friendly\" and even \" mobile first\" design. Towards the end of this post, I've collected some thoughts and further reading on specific mobile tactics, but before we get into that, I wanted to dive a little deeper into the strategic layer.You shouldn't have a mobile marketing strategy There's something going on that I've referred to as there's no such thing as mobile. What I mean by this is that consumers are seeing less and less of a distinction between their devices. Internet trends for marketers from Will Critchlow To see this, we first have to realise that 77% of all usage of \"mobile\" devices is done from home or work where regular computers are available. http://think.withgoogle.com/databoard/#lang=en-us&study=19&topic=54&dp=211 The vast majority of the attraction is not mobility, but a combination of a device that is: Ubiquitous (the same device everywhere) Personal (with your settings, a degree of privacy, etc) Always-on / instant-on Designed for rapid interactions It's the same set of trends that is driving the \"bring your own device\" (BYOB) trend that IT departments are having to learn to deal with. Our computers are fighting back by becoming more like our mobile devices (instant-on, app stores, even touch screens) and our mobile devices are adding to their ubiquity advantages with features previously limited to the desktop (faster processors, larger and brighter screens, faster connections, better keyboards). So, when you realise that all our data is in the cloud and our connection to the physical device is only sentimentality (and the cost of replacement), and you consider the range of screen resolutions that can be considered \"mobile\", you realise that unless you mean to target customers who are literally walking around at the time, mobile marketing isn't really a distinct thing – it's just the future of digital marketing.Every marketing strategy should be mobile You only have to watch a user who's never built their own website, and therefore can't empathise with the technical difficulties, try to use a website that doesn't work on their iPhone or iPad. They swear at the device. They swear at the brand. They wonder if they're doing it wrong or if their connection has dropped. They abuse the \"idiots who built this website\" without realising the difficulty of what they're asking for. There's no such thing as mobile as far as the user is concerned. Which means you, as marketers, have to work exceptionally hard to play nicely with ubiquity. Fundamentally, people use their devices for: communicating with other people (1-1 and 1-many) consuming media (text, images, video) searching for answers As a marketer, you can see the opportunities to be available, be found, be recommended in any of these uses. To improve your chances, you will need to consider: Your platform – the CMS you use, the outputs it's capable of Your content – the strategy of what to create and the tactical execution Your audience – where are they and how can you reach them? Your conversion paths – what do you want people to do and what would encourage them to do that? Your measurement abilities – how are you going to quantify and demonstrate success, and how are you going to refine your approach in light of new data? So, what does that sound like? It sounds a lot like the approach we take for every client who comes to us for digital marketing. And that's what I mean when I say that every marketing strategy should be a mobile marketing strategy. Through every single step of that process, you can (and should) append \"on mobile\" to the question.How might I be wrong? What if apps beat the mobile web? That's the biggest threat to web marketers right now in my opinion. Clearly this is a threat to Google as well (how do you index the app ecosystem?). So it's interesting to look at their response because they're also embracing it. Think about: The pace of innovation in, for example, mobile gmail apps versus desktop gmail How Chrome is sneaking an operating system onto every device you own and can now run Android apps How much a search in Chrome looks increasingly like a search in the Google app - with features moving from the app to mobile Chrome in a similar way to the way features move from mobile to desktop The trend towards app constellations for most of the major mobile players – taking a slice not only from the monolithic apps, but also from the regular mobile web (\"there's an app for that\") I don't think the pendulum is going to swing too far this way, however. Turns out that it's not only Google that relies on indexing the sum of published human knowledge. Can you imagine going back to a world where you can't Google for an answer? I can't. So, I think that even in this situation, \"content\" remains something resembling the mobile web – as does much of ecommerce away from perhaps Amazon. The long tail of providers simply works against \"an app for everything\". You might have an app for your favourite store and your favourite newspaper, but you're not going to have 15 of each (in my opinion). So where do we focus our marketing? In my opinion, we focus on search, social and content. Those are the fundamental human activities which are enhanced by ubiquitous computing devices, and they're ones we understand deeply. The future looks like brands as publisher like never before.So, should I build an app? I don't believe this is a marketing question. It's a product and business question. I think the answer could well be \"yes\" for many businesses if you have elements that can be improved by: Native APIs (camera, coarse or fine-grained location, etc) Game-engine-style graphics abilities Offline functionality Lock-in that actually benefits your users somehow But it's not a marketing question. Aside from a small number of communication tools that can grow via viral loops (think: whatsapp), apps are not a discovery mechanism. The vast majority of app store searches are navigational (i.e. people searching for apps they've already heard of) and I don't see that changing any time soon – an app store search isn't going to replace a general web search for knowledge and so it's not going to add people into the top of your funnel. It's also such a hugely fragmented market that – from conversations with developers who've seen their apps sitting at #1 in moderate-sized categories – I know that even success doesn't inherently drive more downloads and more success.Tactical recommendations for mobile Apart from repeating the advice to think about how your site appears on mobile, I wanted to end with some positive recommendations – i.e. what should you do tactically? Pay attention to \"dark referral sources\" that obscure the incredible mobile drivers of growth for networks like Facebook and, if your audience is active on Facebook, realise that Facebook marketing increasingly is mobile marketing The same is actually true of email – 66% of emails are now opened on mobile devices Consider all those native APIs and the apps that make the best use of them – 10% of all photos mankind has taken were taken in the last 12 months While most mobile sessions are not happening out and about (77% happen at home or at work), all true mobile sessions of course do happen on mobile devices so it's worth thinking about hyper-locality (iBeacons) Of course, it's not enough to drive just engagement, you need to drive revenue, so it's well past the time that most people should be thinking about mobile CRO (video here if you have a DistilledU account) Make the most of second-screen mobile use (see slide 38 onwards) if you are spending money on offline or branding plays Watch for emerging networks – there are a variety of factors that power a high degree of volatility in mobile social (see slides 53-54 onwards) The key lesson here? We need to stop focussing on mobile as a device we use when 'on the go'. Mobile is no longer a distinct thing but, rather, simply the future of digital marketing. It must inform every strategy we devise as marketers, and at every step of the way. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why You Shouldn't Have a Mobile Marketing Strategy"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why You Shouldn't Have a Mobile Marketing Strategy"
    },
    {
      "level": "H2",
      "text": "The changing mobile landscape"
    },
    {
      "level": "H2",
      "text": "Mobile tactics"
    },
    {
      "level": "H2",
      "text": "You shouldn't have a mobile marketing strategy"
    },
    {
      "level": "H2",
      "text": "Every marketing strategy should be mobile"
    },
    {
      "level": "H2",
      "text": "How might I be wrong?"
    },
    {
      "level": "H2",
      "text": "So, should I build an app?"
    },
    {
      "level": "H2",
      "text": "Tactical recommendations for mobile"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too"
    },
    {
      "level": "H3",
      "text": "Internal Linking for Mobile-First & Mobile-Only Indexing"
    },
    {
      "level": "H3",
      "text": "All About Fraggles (Fragment + Handle)"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Will Critchlow\n          \n            Will Critchlow\n          \n            Will Critchlow"
}