{
  "url": "https://moz.com/blog/nofollow-put-my-kids-through-college",
  "slug": "nofollow-put-my-kids-through-college",
  "title": "Nofollow Put My Kids Through College! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For ages I was on the boat with SEOs who moan about the stupidity of nofollow. But recently I've  moved away from this school of thought. Now I definitely haven't moved to the side of the fence that sides with Google in saying that nofollow either a) cuts down on comment spam, or b) improves the…",
  "content": "Nofollow Put My Kids Through College! Link Building By: John McElborough October 17, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: John McElborough October 17, 2008 Nofollow Put My Kids Through College! Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. For ages I was on the boat with SEOs who moan about the stupidity of nofollow. But recently I've moved away from this school of thought. Now I definitely haven't moved to the side of the fence that sides with Google in saying that nofollow either a) cuts down on comment spam, or b) improves the quality of search results. In fact, I'm still puzzled that the search engines would think to try and get every blog owner/webmaster in the world to adopt a new standard in their markup instead of just tweaking their algorithms to devalue links which obviously come from comments. I mean come on, how hard can it be for the Google engineers to just work out the footprint left by Wordpress/ Typepad comments and set \"link juice passed\" to zero? There's certainly enough tools out there which have reverse engineered the process. Rather, what I've been thinking lately is that Google and the other engines actually did us SEOs a big favour when they introduced the use of rel=nofollow. Let's face it, the only reason SEOs, and particularly blogging SEOs, were pissed when nofollow got introduced was because it devalued hundreds or thousands of backlinks, often from good high PR, juice passing pages. But with nofollow the search engines added an extra level of complexity and intrigue to the SEO process and, for better or worse, that can only be good news for professional SEOs. While explaining SEO in plain English and simplifying certain aspects of it when explaining what we do to clients should be encouraged, ultimately there's still an advantage to be had from keeping some parts of our work complex, specialised and highly skilled- that's how we command the day rates we do. In the few years now since nofollow was introduced there's been a definite shift in what serious SEOs talk about as best practice. Nowadays you're more likely to see the link building categories of decent SEO blogs filled with posts on link bait or viral marketing than cheap tactics like comment spamming. The same goes for other backstreet SEO techniques (think directories, article syndication, social bookmarking), which can just as easily and effectively be conducted in Indian sweatshops as funky new media offices in Soho. While these tactics still have a place, at least in some campaigns, it's not where us high end SEOs earn our purse now. If SEO were as easy as visiting some high ranking, topical blogs -- writing 'great post' in the comments with a link to your site and waiting for your PageRank to rocket -- could we really continue to justify the decent day rates we now command? Similarly, if doing 10,000 directory submissions were still enough to get your SEO campaign off the ground, SEO as an industry would be deskilled and devalued. In fact, without nofollow the whole concept of 'social media marketing', which most SEOs have been selling on for the last few years, would have no weight at all. Why bother writing great blog posts and link bait, building relationships with key bloggers, exchanging PR opportunities and promoting your content on niche social spaces when the same link weight can be achieved with commenting? Put simply, clients wouldn't buy it and really, why should they? Just get the work experience kid out there commenting! So nofollow's not perfect and it's probably overused now, but let's not bear a grudge against the search engines for using it. All they're really doing is boxing out the cheap SEO solution providers and increasing the market value of credible, creative SEOs -- which keeps food on my table! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Nofollow Put My Kids Through College!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Nofollow Put My Kids Through College!"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "John McElborough\n          \n            John McElborough\n          \n            John McElborough"
}