{
  "url": "https://moz.com/blog/nonprofit-local-seo",
  "slug": "nonprofit-local-seo",
  "title": "Local SEO for Nonprofit Organizations: 5 Tactics to Try Today - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Through the “search and deliver” dynamic of SEO, nonprofit marketers have the opportunity to reach local audiences that indicate their interest and engagement through their search behaviors. Nonprofit marketers can leverage this to engage supporters, drive donations, and share their nonprofit’s…",
  "content": "Local SEO for Nonprofit Organizations: 5 Tactics to Try Today Local SEO | SEO Basics By: Kelly Cooper December 2, 2020 Table of Contents Copied! By: Kelly Cooper December 2, 2020 Local SEO for Nonprofit Organizations: 5 Tactics to Try Today Local SEO | SEO Basics Many marketing channels are interruptive by nature, meant to divert attention away from a task, be it reading and replying to emails, perusing articles online, browsing social feeds, listening to the radio, watching TV — the list goes on. SEO is one of the only marketing channels (the only?) that serves to first deliver something, instead of asking before delivering. At its core, SEO is used to deliver helpful content to people actively searching for it. And, it can (and should!) be used to reach target audiences at the local and national level. According to Google, searches for local places without the use of “near me” have grown 150% over the last two years — showing that, when people search, they’re increasingly expecting local results. This creates a powerful opportunity for those organizations primed to take advantage of it. Through the “search and deliver” dynamic of SEO, nonprofit marketers have the opportunity to reach local audiences that indicate their interest and engagement through their search behaviors. Nonprofit marketers can leverage this to engage supporters, drive donations, and share their nonprofit’s mission with the world. So, how do you make the most of local SEO? Read on for local SEO tactics you can try today. Before we dive in, it’s important to first understand what primary factors impact your nonprofit organization’s local search engine rankings. This can be distilled into four primary areas: relevance, distance, trust, and prominence. Relevance: How well your website matches the search term a user searches for. If Google determines your business is an educational charity, then your website has a higher likelihood to rank for the term “education charity” in comparison to another business Google determines is a health nonprofit. Distance: The proximity of your business to the searcher. As Google learns more about you and your whereabouts via the ever present homing beacon in your pocket — your smartphone — distance has become a top (if not the top) ranking factor. Essentially, the search engine result page (SERP) for “health nonprofit” in Portland, Oregon will be completely different from the result in Seattle, Washington. Heck, the SERP in the Portland ZIP code of 97219 will be different than the Portland ZIP code of 97209. Trust: How trustworthy Google thinks your business is, based on its reputation. This could be determined by your review quantity and ratings, or the number of high-authority websites that link to your website. Quantity and quality of reviews, quality and quantity of linking domains, domain age, and quality of website content are a few ways that Google can determine trustworthiness. Prominence: How often your business appears across the web. Examples could be a mention of your nonprofit online (by a local news outlet, for example) or a business listing on directory sites like Great Nonprofits or Charity Navigator. Some of these are easier to impact than others — you can’t change the distance of your business to the searcher — so let’s dive in to five local SEO tactics you can implement today. 1. Create or claim a Google My Business page — it’s free! Google accounts for 88% of all online searches, so making the most of Google is critical in developing a strong online presence for your nonprofit. Google has also reported that 46% of online searches have local intent, so doing what you can to amplify your nonprofit’s local search presence can have a big impact on your business. Are you convinced? I hope so. Creating and/or claiming a Google My Business (GMB) page is a great first step in leveraging Google — and it's completely free. When you create a GMB page, your nonprofit is listed in Google Maps, your odds of getting listed in Google’s local 3-pack improve, and you’re more likely to improve your overall local search rankings, thereby ensuring that more people searching for your nonprofit (or nonprofits like yours) find you. By creating a Google My Business(GMB) page, you tackle all four ranking factors outlined above, so if you can only do one of the tactics outlined in this blog post, do this one. If you already have GMB pages claimed and completed for all your business locations, high-five! Go ahead and skip to #2. Before you start claiming GMB pages, the first thing you’ll want to do is collect and organize accurate location data, or “NAP” (name, address, phone number), for all of your nonprofit locations. A few things to keep in mind when it comes to NAP: Always use your real-world business name. The name you list here should match the sign on your door, your marketing collateral, etc. Always use your real-world address. Don’t include information in the address line to describe the location; stick to your mailing address.Use a local phone number whenever possible vs. a call center helpline. Bonus tip: Depending on how many locations you have, keeping track of location data can get unwieldy fast. If you have more than a few locations, I highly recommend you (or someone in your organization) create and manage a single source, like a spreadsheet, that has all your business’s location data centralized and organized in one place. After you organize your location data, you’ll want to go through and claim and/or update the Google My Business pages for all your locations. Here are step-by step instructions from Google. Things to keep in mind when completing your GMB listing: Include a primary business category to describe what your business does to Google and to the people searching. If multiple categories describe your business, choose the category that most closely matches your ranking goals as your primary category. Then, you can add up to 9 additional categories for a total of 10. For help selecting categories, check out our blog post on How to Choose a Google My Business Category.Select attributes for your business. There are a variety of attributes available for you to share more about your business, such as accessibility attributes, whether your nonprofit identifies as Black-owned or women-led, LGTBQ+ friendly, etc. The list of available attributes is pretty extensive, but select only those that are applicable, relevant, and accurate. Write a thoughtful business description. You have 750 characters to describe what your nonprofit does and what makes it unique. Include keywords in the business description. Focus on 1-2 high-value keywords that are relevant to your nonprofit, and avoid keyword stuffing (the unnecessary repetition of keywords throughout on-page SEO elements). Add photos! According to Google, businesses with photos receive 42% more requests for directions and 35% more click-through to websites. When selecting photos, choose authentic, high-quality photos that showcase your nonprofit.Select a profile photo to note your preferred photo choice for search results. This isn’t foolproof — there is no guarantee that your profile photo will appear first — but it does indicate to Google which photo you prefer. 2. Claim your local business listings The places you can create a business listing online are growing exponentially, from social networking sites to specialized, vertical-specific directory sites that allow people to research, compare, and share reviews of businesses, products and services. These online destinations present marketers with local citation opportunities — opportunities to get your nonprofit in front of more people. In the past, amassing a large quantity of citations was a favored tactic when increasing local search rankings. Now, as factors impacting local search rankings evolve, the verdict is out on whether local citation quantity remains so important. Claiming and managing your online business listings may help your nonprofit rank higher for local search queries and it will help more people discover your nonprofit online. You will reach a larger audience by creating complete, accurate, and engaging experiences everywhere your target audience searches. Not sure how you show up? You can use Moz’s free Check Presence tool to see how your nonprofit appears across the web. 3. Develop an online review strategy Reputation is a valuable asset for any business, and that’s especially true for nonprofit organizations, where donations are given and sponsorships extended based on the organization's reputation for doing good. As more people turn to digital to find, research, and evaluate charities that align with the causes they care about, your online reputation becomes increasingly important. Online reviews are a facet of your nonprofit’s overall brand reputation, and should be managed accordingly. In addition to the brand benefits, an active review strategy has the added value of increasing your nonprofit’s online visibility. Review quantity, recency, and quality are factors that help Google determine how trustworthy your website is, which is one of the ranking factors we covered earlier. Google has said high-quality, positive reviews can improve your business visibility. A few things to keep in mind when it comes to reviews: Make it easy for people to leave reviews. You can create and share a short url for customers to share reviews of your nonprofit. Solicit honest reviews. Sometimes all you have to do is ask! According to a 2019 study, 76% of people who were asked to leave a review do so. Don’t solicit reviews in bulk — This is against Google’s policies. Google does not provide a definition of what they mean by “bulk”, but typically this refers to sending many requests at one time via an automated platform vs. a one-on-one request.Don’t pay for reviews. This practice is also against Google’s policies. Respond to reviews, even negative ones. When you reply to a review, it shows that you value the feedback, plus, conversion rates (clicks to call, clicks to directions, etc.) increase when companies engage with and reply to reviews. Don’t be deterred by negative reviews. 90% of people are open to changing negative reviews if the issue is addressed. Again, sometimes all you have to do is ask. 4. Choose the right keywords to target Keyword research, or choosing the “right” keywords to target, is a foundational aspect of SEO because it provides a roadmap you can use to optimize existing content, and produce new content in the hopes of ranking higher in SERPs. It requires an understanding of your target audience and how they’re searching for content online. The end-goal is to determine: The specific terms your audience is using to search online. The number of searches for a specific keyword over a given time period, or search volume.What your target audience is expecting to find when they search for that term, or the searcher’s intent. When targeting keywords, you want to focus on high-volume, high-intent keywords that are relevant to your nonprofit and that you could realistically rank for. This only begins to scratch the surface — keyword research is a BIG topic! — so if you’re ready to dive in to keyword research, I highly recommend that you check out The Keyword Research Master Guide. Then, once you’ve identified your target keywords, remember to pick terms that best describe your nonprofit and include them in the business descriptions of your Google My Business and other local business listings. 5. Conduct on-page optimization On-page optimization is the process of optimizing specific pages on a website for the keywords you want to rank for. This includes on-page SEO ranking factors like the content on the page itself, or the source code such as page title and meta description. Through on-page seo, you help Google accurately determine what your business is and what it does, and how relevant your website is to what people search for. For example, if you have the term “global education” in a page URL, in the page title, description, and in the content of the page, Google is more likely to determine that the page is about global education and, your page will be more likely to rank for that term. A few tips to keep in mind when it comes to on-page SEO: Develop E-A-T content. E-A-T stands for Expertise, Authoritativeness, and Trustworthiness. Google uses this framework to determine high-quality content, and high-quality correlates with higher search engine rankings. There are a variety of E-A-T tactics you can leverage — for a run-down I suggest you watch E-A-T and the Quality Raters’ Guidelines — but in the end, it adds up to demonstrating your business’s expertise and legitimacy to Google. Intentional keyword usage. It’s still important to include a target keyword in the title tag, description, headers, and through the content of the page, while avoiding keyword stuffing. Page titles and descriptions aren’t just for rankings. Crafting a compelling page title and description can lead to better SERP click-through rates — more people clicking on your website from the search engine result page. You’ll want to pair an attention-grabbing headline with a description that is specific, relevant, and (most importantly) helpful. Don’t forget about page load speed. Page speed is a search engine ranking factor and refers to how quickly your page loads for a user. You can use Google’s free PageSpeed Insights tool to see how your web pages stack up.Avoid keyword cannibalization. Keyword cannibalization occurs when multiple pages on your website are all competing for the same keyword. You put yourself in the position where you’re competing with yourself for rankings! Not only is this inefficient, it can have negative impacts, such as making it difficult for Google to identify the “best” or most relevant page on your website for your target keyword, diluting backlinks, or decreasing page authority. Conclusion These are just some tips of many, many potential ways you can leverage SEO to help grow your nonprofit organization. It may seem daunting at first, but investing in SEO is well worth it. And, it’s okay if you need help along the way! If you’re at the stage where you’re currently evaluating a partner or tool for your SEO needs, ask the following: Does the partner meet your value standards? Do they support programs for social good?Do they have special pricing for nonprofit organizations? For example, Moz offers discounted rates on Moz Pro and has a limited-time discount on Moz Local, available now through Dec 31, 2020.Will the partner make your life easier? There’s no time like the present: dive in to SEO now to reach more people with your message, improve conversion rates, find more sponsors, volunteers, and donors, and connect with more people who need you most. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Local SEO for Nonprofit Organizations: 5 Tactics to Try Today"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Local SEO for Nonprofit Organizations: 5 Tactics to Try Today"
    },
    {
      "level": "H2",
      "text": "1. Create or claim a Google My Business page — it’s free!"
    },
    {
      "level": "H2",
      "text": "2. Claim your local business listings"
    },
    {
      "level": "H2",
      "text": "3. Develop an online review strategy"
    },
    {
      "level": "H2",
      "text": "4. Choose the right keywords to target"
    },
    {
      "level": "H2",
      "text": "5. Conduct on-page optimization"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kelly Cooper\n          \n            Kelly Cooper"
}