{
  "url": "https://moz.com/blog/now-accepting-mozcon-2014-speaker-submissions",
  "slug": "now-accepting-mozcon-2014-speaker-submissions",
  "title": "Now Accepting #MozCon 2014 Speaker Submissions. Ready, Set, Pitch! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Now's the time to pitch to be a community speaker for MozCon 2014! Submissions close on Friday, April 11 at 5:00 p.m. PDT.",
  "content": "Now Accepting #MozCon 2014 Speaker Submissions. Ready, Set, Pitch! SEO Events By: Erica McGillivray April 2, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Erica McGillivray April 2, 2014 Now Accepting #MozCon 2014 Speaker Submissions. Ready, Set, Pitch! SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Are you ready for MozCon 2014, July 14-16th, in Seattle? We've been up to our elbows in planning since December and about knee-high since the last MozCon. Before we go any further, you have bought your MozCon 2014 ticket, right? These tickets will sell out... In 2012, we started the community speaker program, where we take speaking submissions from community members (that's you!) and select the four best pitches to go up on the MozCon stage. These sessions are extremely popular with the audience, and in our feedback, you ask us to bring back the program every year. Last year, speaker submissions were open for a week and a half, and over 130 of you sent in pitches! You did such a great job that the MozCon selection committee had a crazy hard time selecting four amazing people to present their ideas in front of the whole audience. I wrote a bit last year about what makes a great MozCon community speaker pitch. One important point: Do keep in mind that these talks are only 15 minutes long. Make your pitch reasonable for that time limit, as you'll only be able to pack so much breadth and depth of information into that time frame. And, I expect even more greatness from you this year. :) 2013 Community Speaker A. Litsa talks about increasing conversions in email marketing. The details about the community speaker submission process: Your pitch must be submitted by Friday, April 11 at 5:00 p.m. PDT. Please submit only one pitch. We're looking for the best of the best. Presentations will be 15 minutes long with an added ~5 minutes for questions. Please frame your topic with that in mind. Topics can range the online marketing spectrum, so submit something you're passionate and knowledgeable about. No matter whether you've never spoken before or have spoken hundreds of times, we want to hear from you. Where these presentations fall on the MozCon schedule is TBD. So please plan to attend all of MozCon, July 14-16. Widescreen-format slide decks are due Tuesday, July 1, before MozCon. If you are selected as a community speaker and you already have a MozCon ticket, we will refund your money or transfer it to someone else; and if you don't have one, we'll comp you one! (You will still have to book your own hotel, flight, and other transportation.) You will be invited to attend our speakers' dinner on Sunday, July 13. And pre-dinner, there will be time to walk on our stage. You must be at MozCon in person. Sorry, no Skype, Google Hangouts, or other video conferencing. Our community speaker selections are final. Everyone who tossed their hat in the ring will be notified via email whether or not they were selected. At this point, we're still finalizing the 2014 agenda, so you won't know exactly what the other speakers are talking about. However, I do encourage you to look at the lineup and see what's missing or already covered. Pretend you're me or another committee member, and find the holes. Thank you to everyone who has already submitted their community speaker ideas for MozCon 2014. We'll be in touch very soon! Submissions are closed for 2014. May the odds ever be in your favor for those who've pitched. I can't wait to see all the awesome submissions for potential community speakers. And, a big thank you to our past MozCon community speakers, who've made this such a success: Darren Shaw, Dana Lookadoo, Fabio Ricotta, Jeff McRitchie, Sha Menz, Mike Arnesen, A. Litsa, and Kelsey Libert. Dive in and submit your pitch today! You can do it. Photo credit: Hallam Internet Limited. If you haven't snagged your MozCon ticket yet, do it now! It's going to be an incredible summer in Seattle. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Now Accepting #MozCon 2014 Speaker Submissions. Ready, Set, Pitch!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Now Accepting #MozCon 2014 Speaker Submissions. Ready, Set, Pitch!"
    },
    {
      "level": "H2",
      "text": "The details about the community speaker submission process:"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Erica McGillivray\n          \n            Erica McGillivray\n          \n            Erica McGillivray"
}