{
  "url": "https://moz.com/blog/official-welcome-to-jeff-pollard",
  "slug": "official-welcome-to-jeff-pollard",
  "title": "Official Welcome to Jeff Pollard - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Jeff Pollard, SEOmoz's newest employee and a fantastically talented web developer hasn't had a formal welcome yet on the blog - until now.\nJeff will be helping us scrape, spam, hack and reverse engineer... uhhh, I mean build high quality, functional, usable websites and some new tools. He also adds…",
  "content": "Official Welcome to Jeff Pollard Moz News By: Rand Fishkin August 16, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 16, 2006 Official Welcome to Jeff Pollard Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Jeff Pollard, SEOmoz's newest employee and a fantastically talented web developer hasn't had a formal welcome yet on the blog - until now. Jeff will be helping us scrape, spam, hack and reverse engineer... uhhh, I mean build high quality, functional, usable websites and some new tools. He also adds to the number of bearded employees at SEOmoz, which is always a positive. Look for his first blog entry in the near future (under the handle Fluxx), and please help us to welcome him to our ranks. We're thrilled to have you on board, Jeff. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Official Welcome to Jeff Pollard"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Official Welcome to Jeff Pollard"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}