{
  "url": "https://moz.com/blog/offline-marketing-for-mobile-purposes",
  "slug": "offline-marketing-for-mobile-purposes",
  "title": "Offline Marketing for Mobile Purposes - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I want to get a new telephone. There is really nothing wrong with the one I have right now: it's been dropped a couple of (ten) times and I once dropped it into Lake Union. It dried. It calls other phones, receives calls and text messages, and it fits nicely in pockets and purses. But it doesn't do…",
  "content": "Offline Marketing for Mobile Purposes Social Media By: Jane Copland December 25, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jane Copland December 25, 2007 Offline Marketing for Mobile Purposes Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I want to buy a new telephone. There is really nothing wrong with the one I have right now: it's been dropped a couple of (ten) times and I once dropped it into Lake Union. It dried. It calls other phones, receives calls and text messages, and it fits nicely in pockets and purses. But it doesn't do Internet, and that's not acceptable. Too often, I'm away from my computer and I want to look something up online. Often, my desire to use the Internet is driven by offline marketing that is aimed at Internet users. As a consumer, offline marketing doesn't mean as much to me as it will when I'm equipped to take advantage of it. However, there are already millions of people walking around our cities with iPhones, Blackberries, and similar mobile devices who can look up the URLs they see while they're away from a desktop or a laptop. Offline marketing is only going to become more important with the increased popularity of mobile technology. As Rob Kerry wrote a few days ago, many instances of offline marketing could be executed better. Writing about how the advertising on trains is aiming to have people convert online, Rob says, \"99.999% of people traveling into/out-of London will use the internet regularly and will most likely go online within minutes of leaving the train, at either work or home.\" Increasingly, people aren't even waiting to get home. The \"what's that about?\" question can be answered while they're still sitting in front of the advertisement. It is no secret that one of my favourite forms of offline viral marketing is Acquisio.com's t-shirts. Simple, bold, well-designed, and funny, no one at SMX Seattle didn't want one of them. I can't go a day wearing mine without someone asking me what shit I hate doing and where I got the shirt. You can't wear a t-shirt online, but the company gained links, built their brand, and acquired notoriety as a result of the offline campaign. The shirts were also strangely relevant to their company's product: Agustin Vazquez-Levi explains in his blog post that they \"(offer) ad agencies a solution for PPC management and the monthly reporting to clients… because we know they hate doing that shit manually. To make this perfectly clear, we decided to give out t-shirts to help people communicate this frustration, while offering them the solution.\" If I didn't know who created the t-shirts and saw someone wearing one, I may well be tempted to get out my (currently imaginary) Blackberry and look up \"i hate doing this shit shirt\" on a search engine. Agustin's post ranks first. For the term \"i hate doing this shit,\" the post ranks third. And don't The Lisa, Susan, and Curtis look stunning! Some offline marketing campaigns are more obvious in their intent. DirtyBeach is comprised of a group of people who sit beside the Thames and create sand sculptures. Perched on a couch made of sand, the artists include their MySpace and Facebook URLs in their displays. They claim to have also registered a domain, dirtybeach.tv, but the website currently does not load. Without a presence online, this group would be too easily forgotten as an amusing aside when one is wandering along the waterfront. While only a small percentage of people will think to look the group up later, virtually no one would ever think of looking them up with a search engine if their social networking URLs were not available. Similarly, a clever advertisement, seen by commuters on their way to work, is less useful if the ad gives them no way to follow up online. Offline Internet marketing hasn't developed the bad reputation that it has online. While Diggers bemoan the denigration of their precious website at the hands of marketers and linkbaiters and claim that SEOs have \"ruined search engines,\" no one complains when a clever commercial - paid or not - includes a URL. While I smile when I see a piece of obvious linkbait becoming popular at a social news service, I love it even more when I see offline advertising that blatantly aims to draw people to the Internet. As Rob points out when he talks about the visibility of contact information, it's tougher to get people to a website when they can't just click on a link: you have to pay even more attention to the branding and prominence of URLs. How do you get people to link to something if they don't know or can't remember its address? Even someone using a mobile device could forget a domain name as soon as they get off the train or walk past the billboard. Getting people to remember your website's address when they discovered it offline is either made easier or harder with the introduction of alternative TLDs. I'm not sure which. The conundrum is obvious: competitive keywords suddenly become more accessible, but do you think your mum will remember the .info, .tv, .mobi, and .biz TLDs she saw on a billboard? Or will she try and look up the domain names using \".com?\" When you're going to use offline marketing, this type-in problem becomes much more important. Even my father now has a phone with good web capabilities. When people for whom the Internet was never much more than Yahoo! Mail can get online and look for the interesting thing they saw on their way to work, offline marketing for online purposes changes. You want your URL to be easy to remember, whether the domain be a business's premier website or one developed exclusively for the ad campaign. You want to rank first for whatever catchphrase, keyword, or slogan you're pushing. You want whatever genre you're using to be interesting enough to catch the attention and warrant the time of people who are used to seeing ads whenever they look up. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Offline Marketing for Mobile Purposes"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Offline Marketing for Mobile Purposes"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jane Copland\n          \n            Jane Copland"
}