{
  "url": "https://moz.com/blog/offline-buying-advanced-analytics",
  "slug": "offline-buying-advanced-analytics",
  "title": "Offline Buying & Advanced Analytics - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "So SEW (and several other folks) pointed to a study today from Comscore & Google that shows a very high percentage of Internet surfing results in a latent, offline purchase.  ...",
  "content": "Offline Buying & Advanced Analytics SEO Analytics By: Rand Fishkin March 23, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 23, 2006 Offline Buying & Advanced Analytics SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. So SEW (and several other folks) pointed to a study today from Comscore & Google that shows a very high percentage of Internet surfing results in a latent, offline purchase. From Chris Sherman: ...25% of product-related searches resulted in purchases, with 63% occurring in brick and mortar retailers, compared with 37% from online merchants. The study has similar findings to a Yahoo-sponsored ComScore study in December 2004, which found that 92 percent of purchases related to consumer electronics occurred offline... For those marketers who measure conversion rates only on the web, a vast chasm exists between tracking and actual results. So how do you measure offline conversions? There's no cookie you can attach to a human being or their credit card and asking salespeople (whether it's B2B transactions or consumer activity) to collect the information provides lackluster results. The methodology has to lie in comparitive analysis - checking sales figures for Internet promotions and visits against increases in offline sales. With the proper tracking in place, you can see side-by-side comparisons of visitor analytics showing traffic to a particular page (or section) and analyze sales figures over time to determine where the increases are coming from. Offline tracking, however, provides intangible data and if done consistently, can be especially time consuming and expensive. Hence, it becomes wise to eventually cheat :) By cheating, I'm referring to using previous data to predict and measure new trends. For example, if you already know that putting a Seagate hard drive on your homepage results in a 5% click-through to that product and boosts in-store sales by 5%, you can go ahead and put a new product there, measure click-throughs and predict what in-store sales boost you'll get. Don't forget to refine and test your analytics system, but this \"poor man's\" method can be handy in a pinch. Anyone out there run online campaigns and track offline conversions? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Offline Buying & Advanced Analytics"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Offline Buying & Advanced Analytics"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}