{
  "url": "https://moz.com/blog/offline-social-media",
  "slug": "offline-social-media",
  "title": "How To Make Your Offline Presence Work For You Online - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I was recently working on a social media strategy for a popular city newspaper and it got me thinking about the benefits a business can get from a well-thought out crossover between its offline and online presence. I've tried to write this post so that it's useful for any sized business that has…",
  "content": "How To Make Your Offline Presence Work For You Online Social Media L By: LucyLangdon April 27, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! L By: LucyLangdon April 27, 2009 How To Make Your Offline Presence Work For You Online Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I was recently working on a social media strategy for a popular city newspaper and it got me thinking about the benefits a business can get from a well-thought out crossover between its offline and online presence. I've tried to write this post so that it's useful for any sized business that has some kind of offline presence, from a shop, through a publication to any kind of offline advertising or PR. If you're spending money offline, you should consider how that investment can be taken advantage of online. When I say 'make the most of your offline presence', I'm talking about a wide range of potential online benefits: increasing traffic, improving your link profile and/or increasing conversion rates. Optimising this crossover proves the old adage, 'the sum of the parts is greater than the whole' (oh, that old adage). First off, let's talk about why it's a good idea to make the most of this crossover. If someone likes your brand offline, they're probably going to like it online. Make sure your website is a pleasant user experience and has lots of opportunities for your customers to tell their friends about you. Unless you live just down the road from all your customers, it's easier to communicate online that it is offline. It's also often a lot more time-efficient. An online customer is much more likely to give valuable feedback on your brand than an offline one, particularly if you make it easy for them. This kind of interaction can take any number of guises: a form to fill in, commenting, voting, linking. Converting offline customers to online customers can, depending on your business, significantly lower the overhead on any conversions you make. At the risk of sounding obviously biased, online is where it's at. These days, customers almost expect a comprehensive web presence from whoever they spend money with. Don't fluff it up. How to send people to your site I remember the first time a friend of mine put his website on his business card. It was pretty exciting. These days, you'd attract more attention not having a readily-available web address for your company. You have to do something more engaging, more... (you guessed it), 2.0. So here are three tips on how to direct customers, potential or otherwise, to your site: Incentivise. Give your offline customers a proper good reason to visit your site. A competition for 'best feedback' is a good idea. Or, for some great buzz, organise a giveaway at a certain time on a certain day (but make sure your site lives up to expectations under the sudden influx of open-minded visitors or they might not be so open-minded next time). Be provocative. If you've got the space in which you can be provocative, then ask a question that demands an answer from your user. This has to be done carefully; you don't want to be the target of any passionate arguments, but it would be perfect if you could provide the space in which that argument took place. Offer exclusivity. The oldest trick in the book: 'Visit our website for a special, one time only, exclusive deal!'. You don't have to be that blatant, but spreading the word that you might get a better deal or service if you come via the web will convert well. Again, a little tricky to implement: you don't want to ostracise any customers you do have that don't like or use the Internet much. Community. If your customers like buying cars, they probably like talking about them. Building online communities is a whole other ball game, but there's lot of merit in driving genuine, interesting customers to your website. Offline Advertising Google Call to Action There have been a few companies that have used Google call-to-actions in their advertising campaigns. Here's a successful example from way back in 2006. As Paul Mead writes, a Google campaign is “better in terms of recall and it fits in with the way we react to advertising these days.” The danger of course is that your campaign can be hijacked spectacularly. Or, like with this Samsung ad in the Metro today, you can just fail. If you're going to get customers to search for you, at least have something they can find! (Sorry the quality's not that great- if you can't read it, the Samsung ad tells me to 'Search on Google for LED'). Brand If you're starting a new business or thinking about changing the name of your existing one, it's really worth thinking about what people will be googling when they want to find you. Either a memorable and unique brand name or, depending on your online clout, a keyphrase-laden name are much better than, for example, 'Trixy's MEGA Supersaver Store'; who's going to remember that? How to boost your online efforts offline. Say you're doing some linkbait or have just launched a new feature on your site- why not promote it offline as well? If you can get a TV, radio or print mention, you could drive a whole load of unique traffic to your site. Just be careful of making a social media fluff, like Radio 4 did recently with their self-proclaimed 'viral video'. The content was great, but there was some dispute over whether you can call a video viral while giving it a boost on the show. When The Hoards Start Arriving Golden Rule: make sure you're ready for them. Nothing is going to put a customer off a brand more quickly than being urged to visit a site only to find it's not up to scratch. If you've been smart and used a custom URL shortener like Tom suggested last week, then you can track your customer and drive them to exactly the right page. If you haven't got around to that yet, think about how you'll get the right message to the right customers when they arrive at your site. One tip is to make sure your offline prompt aligns with the online equivalent. You could use the same language or the same imagery- anything that will reassure the user that they're in the right place. Stick a big call-to-action in there and you're away. You want your customers to arrive at the page you're directing them to and feel like they've turned up half way through a whoop-ass party. If possible, make sure there's already some buzzing comments and interaction going on. If you're a well known name, consider making a regular appearance in the comments. The personal touch is another nice way to overlap your offline and online efforts; create an avatar that people will recognise and want to connect with. How else do you use your offline presence to benefit your online presence? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How To Make Your Offline Presence Work For You Online"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How To Make Your Offline Presence Work For You Online"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "LucyLangdon\n          \n            LucyLangdon"
}