{
  "url": "https://moz.com/blog/oh-my-god-search-is-changing-forever-seo-is-doomed-run-for-the-hills",
  "slug": "oh-my-god-search-is-changing-forever-seo-is-doomed-run-for-the-hills",
  "title": "Oh My God! Search is Changing Forever! SEO is Doomed! Run for the Hills! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "With every tweak and change that comes to Google, it seems there's a new round of questions and blog posts and hand-wringing that follows the same old formula:\n\nWith the release of their new yippdy goobledy wobbledy, Google has changed the search game forever. Forget classic SEO, from now on, it's…",
  "content": "Oh My God! Search is Changing Forever! SEO is Doomed! Run for the Hills! User Experience (UX) By: Rand Fishkin November 24, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 24, 2008 Oh My God! Search is Changing Forever! SEO is Doomed! Run for the Hills! User Experience (UX) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. With every tweak and change that comes to Google, it seems there's a new round of questions and blog posts and hand-wringing that follows the same old formula: With the release of their new yippdy goobledy wobbledy, Google has changed the search game forever. Forget classic SEO, from now on, it's going to be all about blah blah blah. It happened with: Personalization Local Results & Geo-Targeting Instant Answers & OneBox Results Google Knol Customization Based on History Universal Search And now it's happening again with SearchWiki. Yet, in the 5+ years I've been doing SEO, the game has stayed remarkably similar through nearly every one of these \"massive shifts.\" Actually, the biggest true changes I've seen to SEO have come from directional shifts at Google that typically received far less publicity and media attention: When Google rolled out the Florida update in Winter 2003 and many affiliate, thin content and low quality sites lost rankings (and the ability to pass good link juice) In 2004-5 as the Google Sandbox became a major part of new sites' experience in Google In 2005 when nofollow started to be implemented across blog comments and we could no longer buy our way to the top of the rankings with spammy blog links (although it really took a year or two to take full effect) In November 2006 when the search engines officially agreed to support the Sitemaps.org format It's not that Google's other shifts haven't had an impact on SEO, it's just that they haven't been earth-shattering or groundbreaking or given us new paradigms to conquer. SEO remains, at its core, remarkably similar to what it was in 2002: Make pages accessible Target with keywords that searchers employ Build content that users will find useful and valuable Earn editorial links from good sources Honestly, every time the \"sky is falling\" from some new change at Google, ask yourself if this 4 step process has been fundamentally undermined. Until then, you can relax - which is not to say you can stop learning, evolving and investigating every tactic that might give you an edge, but you don't have to go overboard chasing fads in SEO. As my mother often says, \"Moderation in all things, including moderation.\" p.s. If there are major shifts in the last 5 years that you've felt have had a tremendous impact on how you do SEO, please do share. It's late and I've got an early meeting, so I'm sure I've missed a few. p.p.s. I would say that for some sites and content types, the introduction of the maps results for local queries was actually earth-shattering. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Oh My God! Search is Changing Forever! SEO is Doomed! Run for the Hills!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Oh My God! Search is Changing Forever! SEO is Doomed! Run for the Hills!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Unlock Your B2B SEO Content with Structured Resource Sections"
    },
    {
      "level": "H3",
      "text": "The ROI of Accessibility in SEO"
    },
    {
      "level": "H3",
      "text": "How SEOs and UX Designers Can Work Better Together — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}