{
  "url": "https://moz.com/blog/oh-reddit-thy-mystery-is-infinite",
  "slug": "oh-reddit-thy-mystery-is-infinite",
  "title": "Oh Reddit, Thy Mystery is Infinite - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Most folks who hadn't heard of Reddit before November certainly have now. With the sale to Conde Nast, Reddit has joined the ranks of social media property successes (congrats, BTW to Paul Graham & Y Combinator). To a web marketer, though, Reddit remains an enigma shrouded in a mystery,…",
  "content": "Oh Reddit, Thy Mystery is Infinite Content Marketing By: Rand Fishkin November 22, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 22, 2006 Oh Reddit, Thy Mystery is Infinite Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Most folks who hadn't heard of Reddit before November certainly have now. With the sale to Conde Nast, Reddit has joined the ranks of social media property successes (congrats, BTW to Paul Graham & Y Combinator). To a web marketer, though, Reddit remains an enigma shrouded in a mystery, encapsulated in a cute little robot: From our research, Reddit is one of the very best places to go linkbaiting. While the traffic is typically between 3-6,000 uniques over 24 hours (and totals less than 7,500 over two weeks), the links are amazing. Bloggers and pundits and news sites pick up Reddit material with abandon - I usually don't point to Google search numbers but they make a case here: search for via reddit -site:reddit.com (250K results) vs. via digg -site:digg.com (600K results). Yes, Digg is much bigger (and has been around and popular for longer), but Reddit shows a small number of stories compared to Digg, meaning that for every Reddit story, you get more play in the blogosphere, more links and more reach (just what every linkbaiter wants). The problem is - I can't seem to figure Redditers out. As many times as we've tried to submit links to them for clients or just in general (to try to grow our profiles), they never succeed. We've had several articles/tools/sites on there, but always by accident - someone else submits it and it goes to the top of the site. Unlike the Digg or del.icio.us audience, or even the folks at Slashdot, Fark, Shoutwire and Netscape, there seems to be no clear demographic or tendency that you can focus material towards in order to make it to Reddit's front page. Anyone have any advice? Who are these mysterious Redditers? How do we/you find/make content that pleases them? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Oh Reddit, Thy Mystery is Infinite"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Oh Reddit, Thy Mystery is Infinite"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}