{
  "url": "https://moz.com/blog/oi-another-social-tagging-site",
  "slug": "oi-another-social-tagging-site",
  "title": "Oi! Another Social Tagging Site - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "OK, folks. We've got a new contender to add to our list of social tagging / collective bookmarking sites. In SEO, the more the merrier, but in that industry, you're only as strong as your community. Shoutwire (the newcomer) is pretty...",
  "content": "Oi! Another Social Tagging Site Mobile SEO By: Rand Fishkin December 6, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 6, 2005 Oi! Another Social Tagging Site Mobile SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. OK, folks. We've got a new contender to add to our list of social tagging / collective bookmarking sites. In SEO, the more the merrier, but in that industry, you're only as strong as your community. Shoutwire (the newcomer) is pretty cool, though. Cool enough that they've already suffered through a spam attack by rival Digg users (who feel threatened?) - very odd stuff. So, a list of social tagging sites now includes: Del.icio.us Digg Furl Shoutwire Oh, and there's a heap more in the also-ran category If they can all send traffic, then I'm a fan of all of them. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Oi! Another Social Tagging Site"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Oi! Another Social Tagging Site"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too"
    },
    {
      "level": "H3",
      "text": "Internal Linking for Mobile-First & Mobile-Only Indexing"
    },
    {
      "level": "H3",
      "text": "All About Fraggles (Fragment + Handle)"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}