{
  "url": "https://moz.com/blog/omnitures-matt-belkin-on-visitors-vs-visits",
  "slug": "omnitures-matt-belkin-on-visitors-vs-visits",
  "title": "Omniture's Matt Belkin on Visitors vs. Visits - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Quick one - Visits vs. Visitors is a great piece on why the first matters more than you might think and why the second is less accurate than you might presume. Good read:\n\nHere are my top reasons for using visits:1) Visits are more accurate than Unique ...",
  "content": "Omniture's Matt Belkin on Visitors vs. Visits SEO Analytics By: Rand Fishkin March 31, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 31, 2006 Omniture's Matt Belkin on Visitors vs. Visits SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Quick one - Visits vs. Visitors is a great piece on why the first matters more than you might think and why the second is less accurate than you might presume. Good read: Here are my top reasons for using visits:1) Visits are more accurate than Unique Visitors.2) Every Visit represents an opportunity to persuade or convert a visitor to a customer.3) Measuring visits is based on fairly established industry standards Guess I'm on an analytics binge today. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Omniture's Matt Belkin on Visitors vs. Visits"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Omniture's Matt Belkin on Visitors vs. Visits"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}