{
  "url": "https://moz.com/blog/on-page-seo-2019",
  "slug": "on-page-seo-2019",
  "title": "On-Page SEO for 2019 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In this expert checklist, Britney Muller shares her best tips for doing effective on-page SEO in 2019.",
  "content": "On-Page SEO for 2019 On-page SEO | Whiteboard Friday By: Britney Muller January 4, 2019 Table of Contents Copied! By: Britney Muller January 4, 2019 On-Page SEO for 2019 On-page SEO | Whiteboard Friday Whew! We made it through another year, and it seems like we're past due for taking a close look at the health of our on-page SEO practices. What better way to hit the ground running than with a checklist? In today's Whiteboard Friday, the fabulous Britney Muller shares her best tips for doing effective on-page SEO in 2019. Click on the whiteboard image above to open a high-resolution version in a new tab! Video Transcription Hey, Moz fans. Welcome to another edition of Whiteboard Friday. Today we're going over all things on-page SEO, and I've divided it into three different sections: How are crawlers and Googlebot crawling through your site and your web pages? What is the UX of your on-page content? What is the value in the content of your on-page content? So let's just jump right in, shall we? Crawler/bot-accessible ☑ Meta robots tag allows crawling Making sure your meta robots tag allows crawling is essential. If that's blocking Googlebot from crawling, your page will never be in search. You want to make sure that's all panned out. ☑ Robots.txt doesn't disallow crawling You want to make sure that let's say this page that you're trying to get to rank in search engines, that you're not disallowing this URL from your robots.txt. ☑ URL is included in sitemap Similarly you want to make sure that the URL is in your site map. ☑ Schema markup You also want to add any schema markup, any relevant schema markup that you can. This is essentially spoon-feeding search engines what your page is about and what your content is about. ☑ Internal links pointing to your page with natural anchor text So let's say I am trying to rank for chakra stones. Maybe I'm on a yoga website and I want to make sure that I have other internal pages linking to chakra stones with the anchor text \"chakra crystals\" or \"chakra stones\" and making sure that I'm showing Google that this is indeed an internally linked page and it's important and we want to give it some weight. ☑ HTTPS - SSL You want to make sure that that is secure and that Google is taking that into consideration as well. User experience ☑ Meets Web Content Accessibility Guidelines Does it meet Web Content Accessibility Guidelines? Definitely look into that and make sure you check all the boxes. ☑ Responsive mobile design with same content and links Is it responsive for mobile? Super important with the mobile-first indexing. ☑ Clear CTA Is there one clear call to action? A lot of pages miss this. So, for this page, maybe I would have a big \"Buy Chakra Crystals Here\" button or link. That would be a clear CTA. It's important to have. ☑ Multimedia: Evaluate SERP and add desired media Are you providing other desired media types? Are there images and video and different forms of content on your page? ☑ Page speed: utilize CDNs, compress images, use reliable hosting Are you checking the page speed? Are you using CDNs? Are you compressing your images? You want to check all of that. ☑ Integrate social sharing buttons It's the easiest thing. Make sure that people can easily share your content. Content and value This is where it gets really fun and strategic too. ☑ Unique, high-quality content Are you providing high-quality content? So if you go to Google and you search \"chakra stones\" and you take a look at all of those results, are you including all of that good content into your page? Then are you making it even better? Because that should be the goal. ☑ Optimize for intent: Evaluate SERP and PPC, note which SERP features show up You want to also optimize for intent. So you want to evaluate that SERP. If that search result page is showing tons of images or maybe videos, you should be incorporating that into your page as well, because clearly that's what people are looking for. You also want to evaluate the PPC. They have done so much testing on what converts and what doesn't. So it's silly not to take that into consideration when optimizing your page. ☑ Title tags and meta descriptions What are those titles? What are those descriptions? What's working? Title tags and meta description are still so important. This is the first impression to many of your visitors in Google. Are you enticing a click? Are you making that an enticing call to action to your site? ☑ Header tags H1, H2, and H3 header tags are still super important. You want to make sure that the title of your page is the H1 and so forth. But just to check on all of that would be good. ☑ Optimize images: compress, title file names, add alt text Images are the biggest source of bloat of on-page site speed. So you want to make sure that your images are compressed and optimized and keeping your page fast and easily accessible to your users. ☑ Review for freshness You want to review for freshness. We want to make sure that this is up-to-date content. Maybe take a look at popular content the last year or two of your site and update that stuff. This should be a continual wash and repeat. You want to continue to update the content on your site. ☑ Include commonly asked questions It's such an easy thing to do, but it's commonly overlooked. AnswerThePublic does a great job of surfacing questions. Moz Keyword Explorer has a really great filter that provides some of the most commonly asked questions for a keyword term. I highly suggest you check that out and start to incorporate some of that. Find common questions now These help to target featured snippets. So if you're incorporating some of that, not only do you get the extra traffic, but you find these opportunities of getting featured snippets, which is great. You're expanding your real estate in search. Awesome. PAA boxes are also a great way to find commonly asked questions for a particular keyword. ☑ Add summaries Summaries are also hidden gems. We see Google seeking out summaries for content all of the time. They are providing summaries in featured snippets and in different SERP features to help sort of distill information for users. So if you can do that, not only will you make your content more easily scannable, but you're also making it more accessible for search, which is great. ☑ TF-IDF (term frequency-inverse document frequency) TF-IDF stands for \"term frequency-inverse document frequency.\" It sounds a little intimidating. It's actually pretty simple. What's the number of times that \"chakra stones\" is mentioned in this particular page divided by the number of times it's mentioned anywhere? This is basically just a calculation to determine relevance for the term \"chakra stones.\" Really cool and commonly used by Google. So if you can do this on your on-page, it will just help you in the long term. ☑ LSI (latent semantic indexing) for relevance Similarly LSI or LSA, it sometimes referred to, is latent semantic indexing, and it's also for relevance. This helps determine, okay, if I'm talking about chakra stones, it may also incorporate those other topics that are commonly related to this topic. Relevant. ☑ Flesch-Kincaid Readability Test What is the readability of this page? The easier it is to read the better, but you just want to keep an eye on that in general. Bonus tip! One final tip that Kameron Jenkins put on Twitter, that I love so much, and Kameron is a world-class writer —she's one of the best I've ever had the privilege of working with — mentioned this on-page SEO trick. Find the top three ranking URLs for your target keyword. So if I were to put in \"chakra stones\" in Google and pull the top three URLs, put them into Moz Keyword Explorer and I see what they're ranking for, I see what those three URLs are specifically ranking for, and I look at what they're commonly ranking for in the middle here. Then I use those keywords to optimize my page even better. It's genius. It's very similar to some of the relevant stuff we were talking about over here. Discover new keyword ideas So definitely try some of this stuff out. I hope this helps. I really look forward to any of your comments or questions down below in the comments section. Thank you so much for joining me on this edition of Whiteboard Friday. I look forward to seeing you all again soon, so thanks. Remember, you can track how your keywords are performing and who your Share of Voice* competitors are with STAT! *Share of Voice = which URLs own the most eyeballs for a given keyword(s). Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "On-Page SEO for 2019"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "On-Page SEO for 2019"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Crawler/bot-accessible"
    },
    {
      "level": "H3",
      "text": "☑ Meta robots tag allows crawling"
    },
    {
      "level": "H3",
      "text": "☑ Robots.txt doesn't disallow crawling"
    },
    {
      "level": "H3",
      "text": "☑ URL is included in sitemap"
    },
    {
      "level": "H3",
      "text": "☑ Schema markup"
    },
    {
      "level": "H3",
      "text": "☑ Internal links pointing to your page with natural anchor text"
    },
    {
      "level": "H3",
      "text": "☑ HTTPS - SSL"
    },
    {
      "level": "H2",
      "text": "User experience"
    },
    {
      "level": "H3",
      "text": "☑ Meets Web Content Accessibility Guidelines"
    },
    {
      "level": "H3",
      "text": "☑ Responsive mobile design with same content and links"
    },
    {
      "level": "H3",
      "text": "☑ Clear CTA"
    },
    {
      "level": "H3",
      "text": "☑ Multimedia: Evaluate SERP and add desired media"
    },
    {
      "level": "H3",
      "text": "☑ Page speed: utilize CDNs, compress images, use reliable hosting"
    },
    {
      "level": "H3",
      "text": "☑ Integrate social sharing buttons"
    },
    {
      "level": "H2",
      "text": "Content and value"
    },
    {
      "level": "H3",
      "text": "☑ Unique, high-quality content"
    },
    {
      "level": "H3",
      "text": "☑ Optimize for intent: Evaluate SERP and PPC, note which SERP features show up"
    },
    {
      "level": "H3",
      "text": "☑ Title tags and meta descriptions"
    },
    {
      "level": "H3",
      "text": "☑ Header tags"
    },
    {
      "level": "H3",
      "text": "☑ Optimize images: compress, title file names, add alt text"
    },
    {
      "level": "H3",
      "text": "☑ Review for freshness"
    },
    {
      "level": "H3",
      "text": "☑ Include commonly asked questions"
    },
    {
      "level": "H3",
      "text": "☑ Add summaries"
    },
    {
      "level": "H3",
      "text": "☑ TF-IDF (term frequency-inverse document frequency)"
    },
    {
      "level": "H3",
      "text": "☑ LSI (latent semantic indexing) for relevance"
    },
    {
      "level": "H3",
      "text": "☑ Flesch-Kincaid Readability Test"
    },
    {
      "level": "H2",
      "text": "Bonus tip!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Britney Muller\n          \n            Britney Muller"
}