{
  "url": "https://moz.com/blog/one-of-the-most-talked-about-incidents-at-pubcon",
  "slug": "one-of-the-most-talked-about-incidents-at-pubcon",
  "title": "One of the Most Talked About Incidents at Pubcon - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As always, it's the dramatic moments that get the most press. At Las Vegas' Pubcon this year, one of the most talked-about moments was Matt Cutts' introduction at the podium during the Super Session at the end of (day 3) Thursday. I got a few emails through the suggestion box asking if I'd make a…",
  "content": "One of the Most Talked About Incidents at Pubcon SEO Events By: Rand Fishkin November 19, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 19, 2006 One of the Most Talked About Incidents at Pubcon SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As always, it's the dramatic moments that get the most press. At Las Vegas' Pubcon this year, one of the most talked-about moments was Matt Cutts' introduction at the podium during the Super Session at the end of (day 3) Thursday. I got a few emails through the suggestion box asking if I'd make a post on the topic (and heard plenty of buzz at the conference itself). Let's hope my memory serves me well. Matt rose to the stage and first, asked a few questions of the audience. He wanted folks to raise their hand if they were over 30 or under 30 (I couldn't see the audience, but he said it favored the under 30 crowd). He then asked how many folks were more red state or blue state (I believe he specifically re-worded it as \"How many people were happy with the mid-term elections\"). I couldn't believe my ears and stood slightly to turn around the room and look - it appeared to be about 65-70% \"happy with mid-term elections.\" Two gentlemen to my right appeared to take quick offense, and one muttered to the other (as the \"blue state\" types were raising their hands) \"f--kers.\" Almost simultaneously, a woman behind me said something to her friend about \"damn liberals\" - I imagine that there were negative comments during the \"red state\" hand-raising as well, but didn't hear them from where I was sitting. From talking to others afterwards, however, I gathered that I wasn't alone in hearing antagonistic mutterings. I want to make it clear that I don't blame Matt at all - I think he was geniunely interested to see what the demographics of the WebMasterWorld conference looked like and had no ill intention whatsoever. However, as I've noted in the past on the issue of mixing politics and business, the emotions run so strong that it can be a danger to friendly relationships of all types when these leanings are exposed. It's sad that politics is a topic that can't be discussed in friendly company - certainly disagreements on nearly every other issue are easily shrugged off in the conference environment. That evening at the events I attended, many folks used the event as a starting point for conversation (myself included). While no one I talked to felt offended, nearly everyone was shocked - some even thought Matt (being someone who carefully chooses his words, particularly in front of an audience) was motivated in some way to \"stir the pot.\" The most negative comments I heard were from folks who felt massively uncomfortable and concerned that business or personal relationships they had with the folks around them could be damaged by raising their hand and exposing their viewpoints. I admit that I can empathize with that sentiment. Obviously, it's nowhere close to the most important incident of the event, nor nearly the most interesting, but it certainly can make for a useful lesson - beware of injecting dangerous subject matter into an unfamiliar audience and use caution when exposing your politics. Now back to the important stuff... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "One of the Most Talked About Incidents at Pubcon"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "One of the Most Talked About Incidents at Pubcon"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}