{
  "url": "https://moz.com/blog/one-size-fits-all-seo",
  "slug": "one-size-fits-all-seo",
  "title": "One Size Fits All SEO! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I was in a meeting at Gap headquarters over a decade ago. The then CEO Mickey Drexler explained that “you cannot be everything to everybody” when asked about new clothing lines. This is excellent advice for just about any business but especially for SEOs.",
  "content": "One Size Fits All SEO! Marketing Industry By: Stuart McHenry June 6, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Stuart McHenry June 6, 2012 One Size Fits All SEO! Marketing Industry This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. One Size Fits All SEO! A Branding Lesson from Gap, Inc. In June of 2008 retail clothing giant Gap disenfranchised overweight men to work on their brand image. Fashion is extremely image driven and they wanted a brand that skinny, cute and good-looking people wear. The company in both their Gap and Banana Republic Stores stopped carrying XXL shirts for Men (online only). This shocking decision outraged larger-sized men and had directly impacted the company’s sales. How could a company just say goodbye to all those guys that only fit into XXL tops? It’s all about knowing their brand and who they wanted their customers to be. If you are an SEO do you really want customers that will ruin your image? The cheap customers, the know-it-alls and the single-keyword crazy customers are your XXL. Interesting enough I was in a meeting at Gap headquarters over a decade ago. The then CEO Mickey Drexler explained that “you cannot be everything to everybody” when asked about new clothing lines. This is excellent advice for just about any business but especially for SEOs. There are two common problems with many SEO companies: They take on every client they can (select your clients) They don’t focus on a niche (lost in the crowd) Select Your Clients Start facing the facts right now that you can’t and shouldn’t take on every client that comes your way. Some SEO companies look at potential clients and only see dollar signs. If you do this, you are bound to fail at some point, if you already haven’t. You are doing your company and your clients a disservice by trying to take on every potential client. Here are a few examples of clients you probably should avoid: Cheap Clients Stop trying to “work within” your client’s budget and charge them what the job takes. This is one of the main reasons why the SEO industry has such a bad reputation. There are SEO companies out there that will only charge what a client can pay. After a few months the client will start to wonder why their results are poor. This is generally when anger sets in and they start to think all SEOs are fraud. In this economy there are plenty of businesses struggling financially but you cannot sacrifice quality for price. Charge what you need to get the job done. If you cannot do that then this isn’t the client you want. Over Your Head Some SEOs get in way over their head. Either they start offering services they know nothing about or they try and take on too big of a client. If you aren’t good at something don’t offer it as a service. There is a reason why some companies only focus on PPC and not reputation management and vise versa. They are good at one and not the other, which is OK. I’d rather hire a PPC company that knows they are good at PPC and doesn’t try to waste my money on SEO services. The same example is true for many web development companies that try to venture into SEO to make a few extra bucks. Don’t get me wrong there are some development companies that do a great job of this and even have specific SEO’s that work on staff. Unfortunately this is far from the majority. Unrealistic Expectations Every once in a while you will come across a potential client that has zero SEO knowledge, or even worse, a little knowledge from five years ago. These are the type of clients that think you can rank their website for a big keyword in one month for a couple hundred bucks. We have to fully educated these clients so they get a realistic view of what the marketing entails. After spending time explaining the process and the client still thinks they are correct, let them know you cannot work with them. Clients with unrealistic expectations will ruin your reputation and become a headache. Keyword Crazy Clients If a customer is focused on one or two keywords then you don’t want them as a client. Sure it’s nice to rank for your main keyword but there are plenty of other ways to increase targeted traffic. For every main keyword there are at least a dozen good long-tail keywords that often covert better. These are the type of clients that generally don’t have a good understanding of search engine optimization. In the end you can increase sales and overall site traffic but unless they are number one for their keyword they won’t be happy. Don't Get Lost in the Crowd When you don’t have a niche in the SEO industry you quickly become the crowd. You and your company are just a number. How are you going to compete with thousands of other SEOs and SEO firms out there? Oh, you are going to rank for “SEO” and “SEO Company” OK, good luck with that. The sooner you embrace a niche the sooner your company will do better. This doesn’t mean if your niche is hotels you cannot take on an eCommerce website. Take on the eCommerce website if the client is right but don’t abandon your niche. Become a Rockstar in Your Niche One of the most common problems SEOs face is gaining new clients. OK, maybe if you run a rockstar agency you don’t but the other 98% of us do. Some of the best advice I ever received was to focus on a niche. The first time I heard that eight years ago I was like, meh… whatever. The truth of the matter is the SEOs that focus on a niche are the ones killing it and making a great reputation for them. The fact is that no niche is too small if it’s yours. Some niches may only receive 300 searches per month. If you are the authority in that niche that 300 might feel like five times as much since your conversion will be much higher. Your Local Area One of the best niches is your local area. If you live in a city with a decent population size you should focus building local clients. The best thing is you don’t even have to rank your own website, although it helps. When I started my first SEO Company back in 2004 my first handful of clients came from the city and surrounding cities where I lived. This is no secret but many neglect the importance of being local. Conclusion SEO has never been nor will it ever be a one-size fits all. This goes for both your clients and your company. Choose to work with clients you know you can add value to their organization and choose a niche that will help you obtain those clients. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "One Size Fits All SEO!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "One Size Fits All SEO!"
    },
    {
      "level": "H1",
      "text": "One Size Fits All SEO!"
    },
    {
      "level": "H2",
      "text": "A Branding Lesson from Gap, Inc."
    },
    {
      "level": "H3",
      "text": "There are two common problems with many SEO companies:"
    },
    {
      "level": "H1",
      "text": "Select Your Clients"
    },
    {
      "level": "H2",
      "text": "Cheap Clients"
    },
    {
      "level": "H2",
      "text": "Over Your Head"
    },
    {
      "level": "H2",
      "text": "Unrealistic Expectations"
    },
    {
      "level": "H2",
      "text": "Keyword Crazy Clients"
    },
    {
      "level": "H1",
      "text": "Don't Get Lost in the Crowd"
    },
    {
      "level": "H2",
      "text": "Become a Rockstar in Your Niche"
    },
    {
      "level": "H2",
      "text": "Your Local Area"
    },
    {
      "level": "H1",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Stuart McHenry\n          \n            Stuart McHenry\n          \n            Stuart McHenry"
}