{
  "url": "https://moz.com/blog/one-reason-you-shouldnt-go-to-the-seomoz-premium-training-seminar",
  "slug": "one-reason-you-shouldnt-go-to-the-seomoz-premium-training-seminar",
  "title": "One Reason You Shouldn't Go to the SEOmoz Premium Training Seminar - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I'm tired of reading all these posts explaining the top 10 ways to do this, 21 tips for success at that.  That writing style is getting overused and quickly becoming the blogging format staple. It's like that song you hear on the radio every 30 minutes that you just can't get away from.  So for my…",
  "content": "One Reason You Shouldn't Go to the SEOmoz Premium Training Seminar SEO Events B By: BlueAcorn July 29, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! B By: BlueAcorn July 29, 2007 One Reason You Shouldn't Go to the SEOmoz Premium Training Seminar SEO Events This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I'm tired of reading all these posts explaining the top 10 ways to do this, 21 tips for success at that. That writing style is getting overused and quickly becoming the blogging format staple. It's like that song you hear on the radio every 30 minutes that you just can't get away from. So for my first ever YOUmoz entry, instead of telling you the top 10 reasons you shouldn't go to the SEOmoz Premium Training Seminar, I'll give you one. Are you ready for it? The one reason you should not attend the SEOmoz Premium Training Seminar is: Because I am. There, I said it. The more people that attend, the less attention I get. More people means more questions means less attention for my needs. Yeah, I'm selfish, but can you blame me? As soon as I saw the announcement from the Whiteboard Friday post by Scott, it took me exactly 119 minutes to book my flight across the country and sign up for the seminar. What made this such an easy decision for me? Well let me explain in my... Top 5 reasons for going to the SEOmoz Seminar Kidding. But really, a few factors played in here that got me very excited about the seminar. First of all, I've always wanted to visit Seattle. Something about it just appeals to me personally - the atmosphere, the culture, the environment, the technology - I love it without ever having been there! It's a rare occasion that this east coast boy gets a chance to head out west, so it doesn't take much persuasion to pique my interest. Secondly, I had some free airline tickets just waiting to be used. And just last week I was unsuccessful at using these tickets to find a flight back home to Buffalo, NY for any weekend in the entire month of August (don't get me started). So I was already pursuing taking a long weekend with the wife somewhere else, and Seattle was actually one of the places I was considering. The timing of this announcement worked out perfectly with my travel planning. And thanks for scheduling it on a Monday - that allows me to make a long weekend out of it. Furthermore, and without divulging my entire SEO life story, I've been loosely involved in the SEO community for 3-4 years now. Most of my involvement is quite simply learning, reading, studying, and successfully applying this knowledge to a few websites that I run. But managing these sites is a part-time job for me (technically speaking), as I do maintain a full-time position as a Microsoft CRM Consultant. As such, it has been very difficult to become more actively involved in the industry, conferences, and the like that span multiple days. Not to mention that SEO is only one of the many areas of my focus, so I can only allocate so much time to it. This one day seminar allows me to only have to take a few days off from work, while at the same time getting some personalized attention and getting more involved in the SEO community. At $199 for premium member early bird special, the decision was made for me. All I had to do at this point was to clear it with the wife... So, we'll be staying in Seattle an extra three days to enjoy ourselves and see if Seattle lives up to my expectations - which I'm sure it will. And since I've never been, if anyone would like to recommend some things to do while we're in town, area of town to stay in, or would even like to meet up that upcoming weekend, that would be great. But then again, if you listened to my advice and don't go, then you shouldn't even be there to meet up with in the first place. But in all seriousness, I look forward to the Seminar, to meeting everyone, and especially the famous after-party where I plan on hosting a Rand look-alike contest! [Me at the Forbidden City, Beijing China - 2005] [Rand at the Forbidden City, Beijing, 2007] Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "One Reason You Shouldn't Go to the SEOmoz Premium Training Seminar"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "One Reason You Shouldn't Go to the SEOmoz Premium Training Seminar"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "BlueAcorn\n          \n            BlueAcorn"
}