{
  "url": "https://moz.com/blog/onetime-or-ongoing-seo-is-it-a-yes-or-no-question",
  "slug": "onetime-or-ongoing-seo-is-it-a-yes-or-no-question",
  "title": "One-Time or Ongoing SEO - Is it a Yes or No Question? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Being that I am mostly on the business development/sales side of things, I hear a lot of the concerns, questions, thoughts, etc from our clients. One of the things that has come up more and more is, \"Do we really need to have ongoing SEO maintenance?\", or \"Can we wait on doing the ongoing SEO?\" It…",
  "content": "One-Time or Ongoing SEO - Is it a Yes or No Question? Public Relations By: Brendan Fullam November 6, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Brendan Fullam November 6, 2008 One-Time or Ongoing SEO - Is it a Yes or No Question? Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Being that I am mostly on the business development/sales side of things, I hear a lot of the concerns, questions, thoughts, etc from our clients. One of the things that has come up more and more is, \"Do we really need to have ongoing SEO maintenance?\", or \"Can we wait on doing the ongoing SEO?\" It sounds like it should be an automatic \"You need it\" (being that this is the business I'm in and my business partner and I would love the work), but is it always been that easy? The argument for ongoing SEO: There are many reasons to have your clients stick with an ongoing SEO campaign: Regular review and analysis of analytics Changes made in accordance with analytical findings Content building and tweaking to help increase chances of being found Regular reporting and review to ensure goals are being obtained or at least going in the right direction And many, many more I firmly believe in ongoing SEO and how useful it can be if the contract is built with specific goals in mind. If it's not, well, there are plenty of posts that can and have been written about that! The argument for one-time SEO: This is where some people may disagree. Let me first explain what I mean by one-time SEO. One-time SEO is when a site is being built or a client wants their site optimized but no ongoing monthly service is contracted for when the initial site or optimization is done (that's not to say that they never come back at a later point for monthly service, just that it doesn't happen immediately following). Now that I've explained that, I think there is a time and place for optimizing a website and letting it \"marinate\" in the various search engines without immediately starting a maintenance schedule. An example of when I think one-time SEO would be justified would be on a brand new website. Now at first you might say, \"But there is so much to do to start getting them found, etc.\" I think starting an ongoing SEO campaign right away for a brand new site might be putting the cart before the horse. For one thing, there is no data to go off of to see in what direction you need to optimize the site. After 6 months or so, you start getting some historical data that can give you an idea of what is and isn't working on the site. Another example would be a small company that comes to you for local optimization, but their current site doesn't even mention their home town. After you've done the initial optimization, wouldn't it be smart to wait a few months to see how effective your updates were before you go and change/update on a regular basis? What if you change something that was working, but you weren't aware because the data hadn't accumulated? So do you just sit back and say \"Talk to you 6 months\"? Not at all. Link building, which is more of an SEM thing in my book, would be extremely valuable at this point, or PPC (again, SEM in my book) would be great to send some traffic initially. Then after a time period that you and your client feel is appropriate, sit down and review all the data/statistics that you can get your hands on to see what is and what is not working on the site. Now you have what I feel you need to come up with a solid ongoing SEO campaign. I think this is a great way to build confidence with your clients. What do you think, do you agree that one-time SEO is a valid option, or are you of the mindset that ongoing SEO must happen? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "One-Time or Ongoing SEO - Is it a Yes or No Question?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "One-Time or Ongoing SEO - Is it a Yes or No Question?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Brendan Fullam\n          \n            Brendan Fullam"
}