{
  "url": "https://moz.com/blog/online-advertising-20-ii",
  "slug": "online-advertising-20-ii",
  "title": "Online Advertising 2.0 II - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Ok, welcome to part II...  Public Speaking.  (Part one was media marketing, if you missed it, and III, IV and V will be affiliate marketing, branding and lists respectively.) So, how to speak in public AND market yourself respectively.  Again, I appologise but I'm going to be using a lot of the…",
  "content": "Online Advertising 2.0 II Online Advertising By: Pete Watson-Wailes March 27, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Pete Watson-Wailes March 27, 2007 Online Advertising 2.0 II Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Ok, welcome to part II... Public Speaking. (Part one was media marketing, if you missed it, and III, IV and V will be affiliate marketing, branding and lists respectively.) So, how to speak in public AND market yourself respectively. Again, I apologise but I'm going to be using a lot of the book material in this. It's just easier. And sorry for the delay: I got caught up. Darn real life :p Anyway, what should you speak on? Well, I'd say that your subject should be one of two things:Your Profession. Obviously, this is something that (I hope) you know about. It's what you do for a living, and if you can do it for a living, and you enjoy it, you can teach other people how to do it, and they'll pay.Your hobby. Again, I'm guessing that you know a little something about your hobbies, whatever they may be. And I'm telling you right now, there's money to be made from them. Whatever they are, other people will want to know how to do whatever you do, and they'll pay to learn it. \"But Pete, surely that means I know, right now, everything I need to know to become a millionaire...\" Absolutely right. You know all you need to know, right now. Remember back in our copywriting section when we created the list of credentials? Well, you are qualified to speak, write, teach, blog and host events on those things. You are already and know already everything you need to make money. Now, I want to get something straight here: you can not lie, If you're going to be a public speaker, don't lie. It won't work. You'll be found out. Now here's the other thing. You've got to be yourself. Don't try and speak on something you don't know about. Don't try and speak on something because you think it'll make you more money. Speak about what you know. Speak on what you're passionate about. And if you do that, the money will come in. People can tell a fake speaker. So always be real, and know your subject. Now, when it actually comes to getting on the stage, there's three kinds of speakers: 1 - A Guru. The guy that people go to. The person who knows everything that there is to know on their chosen subject. 2 - A student. You'd need to be a student, of someone who is a guru. There are people who read my blog, who learn from the things that I do. They are, in a very real way, students. If you are learning, you can teach people what you learn. 3 - A reporter. This is similar to the above two. If you are a reporter, you're teaching people what you know, and what you've learned. You're saying I'm someone who isn't a guru, but I'm not a student too. I'm someone who knows a lot, and is learning. This is the category I put myself in. I'm a guru on the things that I'm teaching here, and a student of marketing in a wider sense. Napoleon Hill, who wrote the book “Think and Grow Rich” was one of the best success reporters ever. In that book, he interviewed some of the most successful people around, and found out the things that were common themes in what made them successful. In doing so, he made a huge amount of money and became successful. But he was NOT one of the people in the book. Why? Because he was reporting on how others did it, not on what HE did. Being a reporter is the single best way to speak, write, sell... Anything you can do that will make you money, do it in the form of a reporter. Now, here's the second thing: you need to speak for free. If you speak for free on whatever your topic is, you will get more speaking engagements. You just will. And when you're getting started, it's a great way to gain experience. Oh, and by the way, if you've done that, and you've gotten experience in how to get started as a public speaker, isn't that something you could teach? Isn't that something that people will want to know? Just a little thought to bear in mind... Now you've sorted out your subject, and you know what the two sides to your presentation should be. So what is it you actually need to say? And how do you practise it so you've got it SO perfectly down pat, that you're not going to screw up in front of two thousand people? Well, let's just take a look at that, shall we? Firstly, what to say. Well, you need three different presentations. This is something I learned from one of my mentors. The first presentation has no sales pitch. It's what I loosely call the Press Release Presentation. The basic idea is that you teach people. You stand up, introduce yourself, and then you give top drawer content, for however long your presentation is. Make sure by the end people have our contact details, and then they will come to you, looking to buy. Make sure they have a website address, and your name. The second presentation you need to have is one with a sales pitch. This is the same as the first, but you need to take ten minutes, either at the start or the end, to tell people about what you're selling, and more importantly, HOW IT WILL HELP THEM. Make sure you've got all the features and benefits in there. Again, make sure that they have details of where to go, so they can buy it, and that they know your name, so it has an element of authenticity to it. The third presentation is your back of the room sales presentation. This is similar to the one above, but rather than pitching to get people to go to a website, or call a phone number, you give them a form to fill out, or tell them exactly how to buy, and they'll then buy right then and there. This is quite a hard one, as you have to get everything spot on, to pull it off, but if you can do it, you can make tens or even hundreds of thousands of pounds in a couple of hours. Not a bad way to earn money, is it? For how to prepare them, start by getting a microphone, and some recording software. I'd recommend Audacity for the software, and any microphone for the moment. This is only for you, so we're not too worried about quality here. Then write down four points you want to make. Break each point down into five subsections. Now break each of those down into two simple points, and an example. Now you've got sixty little points. Talk on each one for one to two minutes, and you've got a 1-2 hour presentation. The next part is to start working on what you're going to say. Pick a subsection, and start talking about it. Record everything you say. Then get someone else to listen to it, and to pull out the bits they think work, and the bits that don't. Edit and refine it. Keep doing this, until you've gone through all the subsections, so you've got your entire presentation. Make sure you make lots of notes on each part, so you've got the written framework of the entire speech down on paper. Now, you're going to record the entire thing. Sit down, with your notes, and record the whole whack, start to finish. Again, find a guinea pig and get them to list to it, and pull it apart. Make any amends that need making. Pretty soon, you're going to have your entire presentation recorded. So, you've got your topic, you've got your presentation. But how do you practise it, and how do you memorise it? Well, actually you're half way there already. Here's why: The fastest way to memorise something, is to hear it over and over again. Think about it, how does advertising work? Tell people something until it's stuck in their brain. So, every day, on your way to work, or on the way home, or in your lunch break, or wherever, I want you to listen to your presentation. It doesn't have to be the whole thing. Break it down into the sections again, and learn it a bit at a time. But get it down. And I'm not talking about learning it until you can do it right, I mean get it so entrenched in your brain that you can't get it wrong. Then you're ready. So, the first time you're going to give your presentation is here. And you've just walked on stage, the crowd is cheering, everything is great... Until you realise your mind has blanked. But don't panic. Here's what you do... Make up some cue cards. Remember that your entire presentation is broken down into points. So have some cards with those points on. Then, if you forget, you can refer to them, and it'll all come flooding back, I guarantee it. And what happens if you fluff it, you screw up completely? Everything that can go wrong, does. What do you do? To be honest, nothing. I've never once heard of someone getting sent a letter after a bad presentation saying “Dude, that sucked. You completely fell apart, and your presentation was lame, and everyone hates you...” etc etc etc... All that happens is you don't make any sales, and people mutter about how it was lousy. Everyone fluffs one occasionally. That's just life. It happens. Don't worry about it. The best thing you can do is put it behind you, chalk it up to experience, and move on. In the long run, it doesn't really matter that much. Anyway, I hope that helped some of you. Remember, the people on stage are human too. They weren't born knowing what they know; they just worked hard, asked questions, and got there. And you can too. Look out for part III tomorrow... I hope! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Online Advertising 2.0 II"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Online Advertising 2.0 II"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Pete Watson-Wailes\n          \n            Pete Watson-Wailes"
}