{
  "url": "https://moz.com/blog/online-reputation-tips-my-adtech-london-2009-presentation",
  "slug": "online-reputation-tips-my-adtech-london-2009-presentation",
  "title": "Online Reputation Tips - My Ad:Tech London 2009 Presentation - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Last week I spent Wednesday at ad:tech in London where I spoke about advanced analytics and online reputation management. I thought the online reputation stuff would make a good Monday morning post. The audience was mainly brand and advertising people so I didn't assume too much knowledge of SEO or…",
  "content": "Online Reputation Tips - My Ad:Tech London 2009 Presentation Reputation Management By: Will Critchlow September 28, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Will Critchlow September 28, 2009 Online Reputation Tips - My Ad:Tech London 2009 Presentation Reputation Management The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I am in the middle of a crazy couple of months of seminars, conferences and other assorted presentations. If you're interested in seeing any of them, my speaking schedule is online. Last week I spent Wednesday at ad:tech in London where I spoke about advanced analytics and online reputation management. In my analytics presentation, I was refining ideas for what I'm going to talk about at our own advanced SEO seminar so I'm not putting that one online just yet, but I thought the online reputation stuff would make a good Monday morning post. The audience was mainly brand and advertising people so I didn't assume too much knowledge of SEO or ORM, but instead ran through why you would want to monitor for your brand, how to determine if something is going to be a problem and some tips and tricks we've picked up along the way. For those of you who haven't seen me speak, my slides are not always the most self-explanatory things so although I have included them here, I am also going to run through the key themes and tips: Ad:Tech 2009 Online Reputation - Will Critchlow, Distilled Who's talking about your brand? London Fashion Week: I wanted to start with something topical so I used some examples from London Fashion Week (including brands and models) to demonstrate the impact of news events (interestingly, I found no significant correlation between spikes in search volume for the brands or models during fashion week). Out of this came two kinds of worked example, however: The power of news stories and official websites such as londonfashionweek.co.uk - both of which were ranking for big brand names throughout the week A look at an example set of negative search results - for a model who has no official website ranking, has wikipedia at #1 for her name and has a story about a sex tape on the first page How to tell if something's a problem: although most of this will be obvious to anyone with an SEO background, I presented some ways to tell whether a new story you find while monitoring for your name or brand is likely to end up ranking for your name. The factors I encouraged people to look out for were: Is the keyword in the title / URL Is the keyword in the headline and copy How powerful is the domain (noting that most new stories won't have gathered many links of their own yet so we have to make assumptions based on the power of the domain) Of course I recommended people install the mozbar to get easy access to all these factors The pyramid of pain: the stories you are looking out for especially hard are the negative ones which include the keyword prominently and which reside on a powerful domain. Not only are people very likely to be reading and sharing the story, but it's highly likely to end up ranking Tips and tricks: through our work for a variety of clients, we have been lucky(?) enough to have encountered at least our fair share of gotchas. I thought the least I could do was share a few tips: Have a plan in advance of bad stuff happening - mid-crisis is not the time to be wondering whose job it is to check the wheelnuts We have found the most valuable part of our daily / weekly reports to be the forecast - trying to \"write tomorrow's executive summary today\" When emailing busy executives with critical reputation information make sure your subject line gives them the first thing they need to know, and by the time they've read the first sentence on the preview pane of their iphone they are fully up to speed Know who to speak to out of hours. What happens if you discover something critical during monitoring and you can't reach your normal contact? Make sure you have a plan. I illustrated this with a true story about some monitoring we were doing for a client (not Tesco) and discovered a credible threat against Tesco employees and property. I had to cold-call them and try to get through to the right person without sounding like a bomb-threat nutter. To their credit, I got a quick call back from the head of security, but whenever it's your client, you shouldn't have to take that risk I hope there's some tips in there for everyone. If it raises any questions, feel free to drop me a line or leave them in the comments. My next presentations There are a few tickets left for the PRO SEO seminar but we are expecting it to sell out this week. On Wednesday, at 4.30pm UK time (8.30am PST / 11.30am EST) I am hosting a free conference call entitled How to be an Excel Ninja (and how it helps your SEO) where I will be slicing and dicing Linkscape data among other things. If you'd like to join the call or get the recording afterwards, you can sign up here. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Online Reputation Tips - My Ad:Tech London 2009 Presentation"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Online Reputation Tips - My Ad:Tech London 2009 Presentation"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Acknowledge and Cope with Fear of Local Business Reviews"
    },
    {
      "level": "H3",
      "text": "Celebrating Canada’s Small Business Month With Sustainable Local Biz Tips"
    },
    {
      "level": "H3",
      "text": "Takeaways from an Irish Locksmith Listing Spam Scandal"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Will Critchlow\n          \n            Will Critchlow\n          \n            Will Critchlow"
}