{
  "url": "https://moz.com/blog/online-advertising-needs-to-evolve",
  "slug": "online-advertising-needs-to-evolve",
  "title": "Online Advertising Needs to Evolve - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Jeff, Scott and I had a lengthy, post-work discussion today about online advertising today. We discussed the usual issues:\n\n    The more you use the web, the more immune you are to advertising \n    AdSense (and YPN) prey on the naivete of users - savvy visitors don't click these \n    It's very,…",
  "content": "Online Advertising Needs to Evolve Online Advertising By: Rand Fishkin January 30, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 30, 2007 Online Advertising Needs to Evolve Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Jeff, Scott and I had a lengthy, post-work discussion today about online advertising today. We discussed the usual issues: The more you use the web, the more immune you are to advertising AdSense (and YPN) prey on the naivete of users - savvy visitors don't click these It's very, very hard to find a good advertising model on the web CPM ads are, by and large, invisible and cause more annoyance and frustration than value. Even the relatively solid advice given two years ago by Boxes & Arrows about ad placement seems to ring hollow - I feel like the web surfing population develops ad blinders faster than UI designers can find ways to make them stand out. We also spent a great deal of time talking about how relatively effective some offline forms of advertising have become, including: Magazine ads (which are basically CPM, only without the metrics) - they're generally well-targeted and well designed. I know Mystery Guest actually enjoys some of the ads in Bust magazine, and I enjoy a few ads in Wired and Business 2.0 TV ads, though generally lackluster, are occassionally impressive enough to warrant viewing on Youtube or rewinding on the Tivo Billboard ads, which have evolved into a true art form in many instances (for example, check out some of these) But, in the online world, there's a scarcity of good ads. We came up with only a few good examples: Services like ReviewMe and SponsoredReviews - real opinions from people you trust on products or services they wouldn't have found by themselves. I'm a huge fan - I actually read the entire \"ad\"/\"review\" when a blogger I read writes them. StumbleUpon's paid inclusion program - more sites need to start thinking about how they can do this. The occassional creative ad on a site like TechCrunch or Boing Boing - TLA's ad touting \"easier than getting Arrington to link to your site\" is pretty genius, and it actually stands out. Are there other solid forms of advertising on the web that can truly function as the backbone of a business' income? Am I simply living in the bubble so much that I can't see how regular web users really do read ads, click them and buy from the sites they find? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Online Advertising Needs to Evolve"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Online Advertising Needs to Evolve"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}