{
  "url": "https://moz.com/blog/online-advertising-20",
  "slug": "online-advertising-20",
  "title": "Online Advertising 2.0 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Ok, well since my announcement that I'd post this got two thumbs down, I'm guessing this will be in for a bashing, but hey, tough.  This is something I really believe a lot of people here need to know, so I'm going to say it anyway:   There Is More To Marketing Online Than SEO And PPC Understand…",
  "content": "Online Advertising 2.0 Online Advertising By: Pete Watson-Wailes March 22, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Pete Watson-Wailes March 22, 2007 Online Advertising 2.0 Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Ok, well since my announcement that I'd post this got two thumbs down, I'm guessing this will be in for a bashing, but hey, tough. This is something I really believe a lot of people here need to know, so I'm going to say it anyway: There Is More To Marketing Online Than SEO And PPC Understand kiddies? Cool, 'cause I'm about to show you a whole new world... (shameless plug: I cover all of these in greater detail in my upcoming ebook.) Ok, I'm going to cover the following: media marketing, public speaking, affiliate marketing, branding and lists. But don't worry, I'll be doing it over 5 posts. I'm not going to do THAT much at one go... Media Marketing It will be a mystery to me, until the day I die, why people don't use the media more often. For crying out loud, this is THE biggest way to get yourself, your company and your brand out there, AND make yourself credible at the same time. And it's not THAT hard to do. So what is media marketing? Well, it's any form of marketing using things such as TV interviews, radio interviews, newspaper coverage...Anything media related that is NOT an advert. Now, I'm sure you're thinking at this point,\"“Well, that's nice Pete, but how the heck am I going to get on TV? And even if I DID, what am I gonna say? And how can I apply to MY business? How is this going to help me?\" Well, I don't care what area you're in, this can work for you. Whether you're selling a product, selling a service, and whatever those may be, you can use publicity. And there's another great thing: If you are advertising, people are cagey, because they know you're trying to sell them something. If you are REPORTING, they aren't so wary, and you can get your point across more easily. Now, let me ask you something... do you think that you could sell more if your customers saw you as an authority on something, and didn't think you wanted to sell to them? Damn straight you could. Media marketing makes you a saint in the eyes of your customers. Now, the big question. How much will this cost? Well, a full page article in a big publication WILL cost you tens of thousands of pounds, sometimes even hundreds of thousands of pounds. And that's not good. However, you can do it for nothing at all! “Ok Pete, if it can be done for free, why did you just say it costs tens of thousands of pounds?” Well, I'm very glad you asked. Here's how you do it on the cheap: Find a current breaking news article you can have an angle on. Write a killer press pack. Send it out to radio stations/tv stations/newspapers. Make sure they're ok with giving out your contact details, BEFORE you go on air/in print. Show that you know your stuff, and that you're not an arrogant SoB. During the interview, don't try and sell. Just give away good info, give a solid interview, and make sure you can back up ANY claim you make. And don't insult people. Hey presto, you just got coverage. Now, obviously, it's not quite that simple. There are tricks and tools to it, which I won't go into now, for two reasons: I'd turn this into a 10,000 word treatise on media marketing. It's all going to be in the ebook (which will be free). Just as a quick note, I'm not bashing advertising. Advertising is good, too. But you need to use both. If you want to see the detail behind that, I'll be giving links to LOTS of blogs/portals. After all, it's free, and I'm sure you can stand to wait a little while longer... Anyway, tomorrow I'll put up a quick guide to public speaking, and will use that to draw business. Until then, PLEASE feel free to ask me questions and get as much out of this as you can. I will answer pretty much anything you throw at me as well as I can. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Online Advertising 2.0"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Online Advertising 2.0"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Pete Watson-Wailes\n          \n            Pete Watson-Wailes"
}