{
  "url": "https://moz.com/blog/oodles-of-favicons",
  "slug": "oodles-of-favicons",
  "title": "Oodles of Favicons - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Although they don't get much attention, to the graphically and web adept, favicons are a source of great pride and study. These little 16-pixel graphics are an endless source of optimization and promotion for an entire community of designers, as illustrated by the Delta Tango Bravo blog entr...",
  "content": "Oodles of Favicons Design By: Rand Fishkin July 26, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 26, 2005 Oodles of Favicons Design The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Although they don't get much attention, to the graphically and web adept, favicons are a source of great pride and study. These little 16-pixel graphics are an endless source of optimization and promotion for an entire community of designers, as illustrated by the Delta Tango Bravo blog entry \"Favorite Favicons\", which has over 170 replies. They also have some 200+ favicons reproduced on the site, which could help inpsire the wayward web developer who may need a little push in the right direction. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Oodles of Favicons"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Oodles of Favicons"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}