{
  "url": "https://moz.com/blog/open-call-for-serps-that-need-explaining",
  "slug": "open-call-for-serps-that-need-explaining",
  "title": "Open Call for SERPs that Need Explaining - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Have you ever looked at a set of search results and scratched your head in disbelief? If so, you're like me - occasionally, I'll at some search results at Google and have no comprehension of why one site is ranking in front of another, or why it would rank in the top 10, period. This blog post is…",
  "content": "Open Call for SERPs that Need Explaining SEO Analytics By: Rand Fishkin August 23, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 23, 2006 Open Call for SERPs that Need Explaining SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Have you ever looked at a set of search results and scratched your head in disbelief? If so, you're like me - occasionally, I'll at some search results at Google and have no comprehension of why one site is ranking in front of another, or why it would rank in the top 10, period. This blog post is an open call - feel free to list keywords and search results in the comments that simply make no sense to you. For example, a search for SEO at Google brings up these: Ranking #5 - SEOToday.com (links) Ranking #9 - SEOAdministrator.com (links) To me, these rankings make no sense - they aren't authorities in the field, the links pointing to them are generally off-topic and nowhere near the range of the sites that rank in positions 11-40, nevermind the other candidates for top 10. Obviously, Google might be messing with the results a bit, knowing that we'll all get our drawers in a bunch over the SERPs here, but it serves as a good example. I hope to be able to take many of the comments/suggestions and turn them into a Q+A about who ranks where, what we see as completely egregious and how the algo might be operating in odd situations. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Open Call for SERPs that Need Explaining"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Open Call for SERPs that Need Explaining"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}