{
  "url": "https://moz.com/blog/openrank-pagerank-options-for-moving-forward",
  "slug": "openrank-pagerank-options-for-moving-forward",
  "title": "OpenRank & PageRank - Options for Moving Forward - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As most SEOs in the business know, PageRank in Google's toolbar was unavailable over the Memorial Day weekend. This naturally led to many people asking questions about whether PR had dissapeared forever and if it had, whether a private-party solution could be c...",
  "content": "OpenRank & PageRank - Options for Moving Forward Moz News By: Rand Fishkin May 31, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 31, 2005 OpenRank & PageRank - Options for Moving Forward Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As most SEOs in the business know, PageRank in Google's toolbar was unavailable over the Memorial Day weekend. This naturally led to many people asking questions about whether PR had dissapeared forever and if it had, whether a private-party solution could be created to solve this issue. I had more than one person e-mail me directly asking if SEOmoz could create this type of system. Unbeknownst to many, we have been trying, but were unable to get past the design phase. The major problems with PageRank are its accuracy, infrequent updates and lack of any measure of local (community-specific) popularity. PageRank just measures all the links to a web page and spits out a number from 0-10. However, despite these fallacies, Google's PR bar would be almost impossibly laborious to re-create. PR's value depends on a complete map of the link structure of every website in Google's index (which comprises a fair amount of the world wide web). Just storing link data on 8 billion web pages would require hardware that is well beyond the means of any small or mid-size company. Google's index must also be up-to-date, which requires constant re-indexing of web pages according to their frequency of change - another mammoth task. Last, Google's data uses trained algorithms to weed out certain links and manual input to remove yet others. This step, again requires a great deal of time and effort. Without a fully committed search engine index added to the project, with all the hardware and engineers to run it, an OpenRank project would be virtually impossible. The cost, time and lack of a revenue model indicate that no firm (including SEOmoz) could afford such a thing. However... We are considering it. Through partnerships formed at SES conferences and relationships with major players in the search industry, we are slowly building towards a time when access to a smaller search engine's data may become a possibility. Candidates include SEs like Mozdex and Gigablast, although no formal talks have taken place. Revenue for this would most likely come in the form of a subscription (similiar to WordTracker). If you're interested in contributing your time, resources or expertise to this project, please get in touch with me via e-mail. I will have occassional updates if any progress is made in this arena. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "OpenRank & PageRank - Options for Moving Forward"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "OpenRank & PageRank - Options for Moving Forward"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}