{
  "url": "https://moz.com/blog/optimized-my-site-but-still-not-ranking-next-level",
  "slug": "optimized-my-site-but-still-not-ranking-next-level",
  "title": "I've Optimized My Site, But I'm Still Not Ranking — Help! — Next Level - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When all your hard work seems to be going nowhere, there might be a reason. Jo Cameron walks you through a list of things to check and accomplish to make sure your site can start ranking ASAP.",
  "content": "I've Optimized My Site, But I'm Still Not Ranking — Help! — Next Level SEO Basics | Keyword Research | Link Building By: Jo Cameron May 24, 2023 Table of Contents Copied! By: Jo Cameron May 24, 2023 I've Optimized My Site, But I'm Still Not Ranking — Help! — Next Level SEO Basics | Keyword Research | Link Building In her last piece, Jo took you on an adventure diving for treasure in the long tail of search. This time around we're answering the call for help when you feel like you've done all you can, but you're still not ranking. Originally published in June 2016 this blog has been rewritten to include new tool screenshots and refreshed workflows. Read on and level up! You’ve optimized your pages, written delightful title tags, concocted a gorgeous description to entice clicks, used your target keyword in your copy with similar words, and your content is good, like really good. As far as you’re concerned you’re doing everything you can on that page to say to Google “This is relevant content!” But, lo and behold, you’re not ranking. Frustrating, right? Well, no more. I’m going to show you how you can discover what’s holding you back, and how to make sure your site is a lovely big target for visitors, just like this happy fellow: You’ll learn some tricks you can do in your browser and then we’ll speed things up with some cat magic and pixie dust to sprinkle all over your site. To start, open these tools in another tab so you’re ready to go: Moz Pro Campaign deliciousness (if you don't have it set up, take the free trial for a spin to follow along)Keyword Explorer, your pot of keyword gold Step 1: Check for technical issues Uncovering indexation issues with Google search operators is the first step to ensuring your site is set up to be the success you (and I) know it can be. Hello, operator? You can discover whether your site or page is indexed by running a Google search operator like this: site:yourfabsite.comsite:yourfabsite.com/blogsite:yourfabsite.com/blog/my-site-rocks It’s like saying, \"Hey, Google, show me all the results you have in your index for yourfabsite.com.\" This is what you don’t want to see: If you’re seeing the above, you won’t be able to rank because your site isn’t indexed. It’s got to be indexed before it can rank, and it’s got to be crawled before it can be indexed. Trying to rank without being indexed is like trying to bake a cake without turning on the oven. Search Console is here to console you In the results page above, Google is directing you straight to the Google Search Console. Go — right now, right, right now, don’t read any more, you should have already gone — go and set up your Search Console. Once you’re all set up and your site is verified, you can go to this page and ask (nicely) for Google to recrawl your URLs: https://www.google.com/webmasters/tools/submit-url In Google Search Console head to \"Indexing\" and then \"Pages\" to see the data similar to what we looked at above, but in graph form. Definitely handy for tracking how your pages have been indexed over time. If your site is not being indexed, check your Search Console Messages to see if there's a reason Google couldn’t index your site. If your entire site returns a 503 including the robot.txt crawling of your site will be temporarily suspended. It’s a good time to take a check over your robots.txt file and your meta robots tags. But remember that for bots that obey robots.txt file won’t see noindex tags if the pages are disallowed through the robots.txt file. Learning how to manage your site’s indexation at a page level is a key learning curve for newbie SEOs entering the technical SEO sphere. Giving you the knowledge to advance from troubleshooting indexation issues to managing mega-large sites with millions of pages. Toolkit: Google Search Console – Find out why your pages are not being crawled and indexed Further reading: Quick Start Guide to SEO What is Robots.txt? How to check which URLs have been indexed by Google using Python Fundamentals of Crawling Step 2: Find out where you’re currently ranking Now that you know your pages can be crawled and indexed, you want to get them to the top of the results where they gosh-darn-well should be, right? Turn up the volume It’s quick and dirty, but we’ve all done it, your boss does it, your client does it, so why not succumb and start by entering keywords you want to rank for into your browser. Type in Branded terms, vanity keywords, and click return. Not finding your site on the first page? Instead of clicking through to the many ooooos of Google, we’re going to change the settings in your browser to show 50 or 100 results per search so we can view more results with every search. I’m going to want to see A LOT more pet costume results, so I’ll click on the Quick Settings gear icon in Chrome and hit \"See All Search Settings ,\" then toggle to adjust the \"Results per page\": Now we’ve got a whole page of 50 or 100 results to search through. Use CMD + F for Mac (or CRTL + F for Windows) to search for your domain. This process is great for doing a quick check to see if you’re in the top 50 or top 100. Remember that your browser returns personalized results when you’re logged into Google, using incognito mode will manage this somewhat, but a purpose built keyword rankings tool will enable you to run ranking checks more efficiently and accurately. Start cooking with gas Manual searches aren’t for everyone. I mean come on, we work in technology — we don’t want to be lugging keywords a round the hot, dry Google search page, plugging them in one after another. Grab your list of keywords, and plug them straight into Keyword Explorer. Hit \"Create or upload a new list\" and choose \"Enter Keywords\" to pop those straight in there, bish-bash-bosh. Remember, you’ll need a Moz Pro subscription to create a keyword list. Check if you’re on page 1 of Google Open up your keyword list, click +Add URL to check your rankings to see if you're on page 1. Want to see if you’re in the top 50? Heck yeah! Take that same list and paste them into a new Campaign in Moz Pro. If you already have a Campaign running you can also transfer these straight over from Keyword Explorer. Just check the box next to the keywords you want to track, then choose a Campaign from the drop down. You know before (about 30 seconds ago), when we talked about manual searches returning personalized results? Checking rankings in Moz Pro avoids all that nonsense by anonymizing the data and, in my experience, provides the most accurate results, showing what the \"most\" users see. Pretty snazzy, right? A new Campaign will build in about 30 minutes, which is just enough time to catch up on “Stranger Things” and reminisce about Winona Ryder circa 1990… On the other hand, adding to an existing Campaign will be a bit longer. You’ll see data as soon as your Campaign updates next. So you can binge watch the entire 4 series, because why not, right? ...and we’re back! Check out where you’re ranking for your target keywords, which URL is ranking, and over time, whether you’ve moved up or down. We also pull in search volume from Moz’s Keyword Explorer to give you an idea of demand. When looking at search volume, don’t forget that the higher the demand, the more competition you’ll likely face. Don’t be disheartened by ranking well for keywords with lower search volume, especially if they convert better. Tracking your rankings is crucial to understanding why you’re not performing as well as you expected. If you’re seeing a lot of down arrows, you need to investigate who is jumping ahead of you and why. Dig into keywords with falling rankings Let’s find some keywords that have that sad little down arrow, meaning we’ve dropped down in rankings since our last update. Here's a little bundle of keywords that I can investigate. I’ll click on the keyword to open up the Analysis report and scroll down to \"Your Performance.\" Now we can see a historical graph of your rankings and track those other sites who want to push us to one side. And what do we have here? They’ve gone and nipped in front of us! This will not stand! It’s likely that for some reason your competitor's result has been sending stronger quality, authority and relevance signals to Google. When it comes to SEO you can’t stand still. Toolkit: Keyword Explorer Lists – Check your rankings on the fly Moz Pro – Track your rankings (and your competitors’ rankings) over time Step 3: Optimize your content There are 2 parts to this step, Get your basic on-page optimization in order.Check your content is tip-top quality Don't go changing (too often) I don’t want to recommend you jumping in and making changes to content too often. Even Google needs time to register your updates. However, if your content is a bit dusty and you’re losing out to competitors, then it’s time to check that everything you think is in place is actually in place. View your page like a bot I like to think of this as a “bot’s-eye-view.” When a little bot comes along, it doesn’t go, “Oooh, look at that lovely header image! Oooh, I love that font, the white space is really working for me! Oh, how the Internet has changed since my days as a junior bot trawling through gifs of dancing babies!\" It reads the code and moves on. We can do this too, with a little bit of knowhow. Using Firefox or Chrome, you can right-click and view the page source. If you’re unfamiliar with reading code, it’ll look pretty intimidating. We’re going to use CMD + F (or CRTL + F for Windows) to hunt for the bits and pieces we’re after. Pro tip: If you’re seeing og:title, this is a Facebook tag. Likewise, if you’re using the meta property=\"og:description,\" this is also a Facebook tag. These help format posts when the URL is shared on Facebook. You’ll want to make sure you also have Title and Description tags link these: <title>The best title for this page</title> <meta name=\"description\" content=\"The best description for this page\" /> Basic page optimization This is relatively straightforward, because you control your pages. However, maybe for that very same reason, it’s still a bit of a stumbling block for beginners. If you’re confused and locked in a mind-melt of madness because you can’t figure out if you should use the primary keyword and/or the secondary keyword in the title tag, chill your boots. Here is a brisk and fairly brief run-through on how to get into a productive page optimization mindset. Title tag basics This is the bit you click on in the SERPs. Title tags should be 50-60 characters of punchy goodness that is relevant to your content. Because it’s relevant to your content, it includes the words you want to rank for and accurately describes what you’re talking about. You better believe Google is paying attention to click signals, so draw that click with your awesome headline. Think about the titles you click on when you’re searching for lovely things. Do your own searches to see what title tags are out there; it’s not like they’re hard to find, they’re literally a click away. Meta Description basics This is the bit of text under the title tag in the SERPs. Meta descriptions should be about 155-160 characters of tender lovin’ poetry that talks to the user like they’re a real human being, because they are, and so are you (unless you’re part of the cat colony I suspect controls large portions of the web). This is not a direct ranking factor, but it can heavily influence clicks. Clicks from humans. And what do clicks do? They signal to Google that you’re hot stuff! On-page copy Yep, you’re going to want to pop your keywords here, too. But really, let’s not get too hung up on this. If you’re writing something super-duper about your topic, this will flow naturally. Make it as long as it needs to be to make your point. Don’t rattle off the same words over and over; use language to the best of your ability to describe your topic. Remember all those clicks you worked so hard to get with your title and description tags? Well, if they all bounce back to search, you just know Google is paying attention to this. Your content has to be worth the click. Go and look at what type of content is already ranking. This is not an exercise in scraping content, but a way to make sure that your content isn’t just as good, but much better. This task can be done manually for a small site or for a few pages you’ve cherry-picked, no problem. Check your whole site regularly Maybe you've been creating content like a content-creating super machine and you might have skipped a few description tags. Or maybe you copy and pasted a title tag or two. In this case, you’ll want to check that it’s all hunky-dory on a larger scale and on a regular basis. We’re going back to our Moz Pro Campaign to take the heavy lifting out of this job. Head to the Rankings tab and hit that little \"Optimize\" button on the right. Once you hit that little button, you’ve set off a chain of events where our bot looks at the keyword you’re targeting, then has a good old dig-around on your page and gives you a score out of 100. We’re hoping for that wheel of destiny to roll around to 100. If we make it part-way around, it’s time to look at the suggestions to see how you can improve your on-page optimization. Focus on top-level pages, pages that convert, and high-authority pages first. Toolkit: Moz Pro Page Optimization – Check that your whole site is optimized correctly Further reading: 8 Old School SEO Practices That Are No Longer Effective - Whiteboard Friday Step 4: Become a keyword connoisseur It’s easy to become fixated on a keyword beyond what is reasonable or healthy. Are you carrying a torch for a golden keyword? Stalking it in the SERPs even though it’s completely entranced with the likes of Wikipedia, eBay, AdWords, and Image Packs? Ranking in the high-click zone for your keywords is all about beating other sites. This special, golden ticket to traffic wonderland might be a good long term goal, but you’re not going to get to the top of the results in the near future. On the other hand, maybe you’re afraid of competition, so you only target keywords with very low difficulty. This can be a winning strategy if the keywords have strong intent and you’re targeting the long tail of search, but you don’t want to put in all that work creating content and find that no one is searching for it. No searches means no traffic, and no traffic means no humans to click a thing that makes a person somewhere in the world look at their analytics data and smile. A little bit of competition is a good thing — it indicates a healthy, profitable industry. So we’re looking for a sweet spot: keywords with some demand and less competition. I’m going to break down what organic competition is, and how you know what level of keyword difficulty you can target. What's the meaning of this so-called 'competition?' If you want to rank organically, your competition is the other sites that are currently on the first page for the keywords. It’s not the total number of sites that are using your keywords in their content, and it’s not the AdWords competition. If someone on your team, or an agency or a client sends you competition data that’s defined as low, medium, or high, this is very likely to be AdWords competition, and it relates to the cost-per-click. Moz’s Keyword Difficulty score uses the top 10 organic results to calculate the Difficulty metric. It’s a score out of 100, where a higher number means that the competition is strong, and it may take you longer to see results from your efforts. Every search you bash into Keyword Explorer shows you the Difficulty score from the Keyword Overview, and you can build these into lists so you can compare related keywords. Benchmark your site’s Difficulty rating We know that Difficulty is out of 100, but a question we get all the time is: How do I know what level of Difficulty is too high? Well, first off, testing is a sure way to find out. But if you want a little pointer before you head down that road, here's how you can quickly benchmark your site’s Difficulty rating. Time for another consoling hug from Google Search Console. Grab the keywords that are already sending you traffic from Performance > Search Results and export the results to the format of your choosing. Save these to a list in Keyword Explorer. Hit \"Save,\" and now you have a benchmark to use when looking at other keywords you could potentially rank for. When you’re looking at keywords to target in the future you'll have a good idea whether it’s a short-term or long-term goal. You can also capitalize on keywords you’re already getting traffic for by looking for opportunities in the SERP Features. Can you steal a Featured Snippet? I also want to track these keywords over time to see if I’m losing or gaining ground, so I’ll add them from my list straight to my Moz Pro Campaign. Next time my Campaign updates, and forevermore into the future, I’ll be keeping the sharpest of eyes on these keywords. Toolkit: Google Search Console – Grab keywords already sending you traffic Keyword Explorer – Find the real organic competition and benchmark Difficulty Step 5: Build your site’s authority Now step 5 is a real doozy, and it’s a common stumbling block for new sites. Just like networking in the real world, online authority is built up over time by your connection to sites that search engines already trust. I like to think of authority as the pixie dust from the J.M. Barrie novel Peter Pan. It’s almost mentioned as an afterthought, but without it Wendy and the gang were just kids jumping up and down on their beds. They’re thinking happy thoughts. They might even get a bit of temporary lift, you know, just like when you might get a bit of traffic here and there — enough to keep you jumping. But there's a very big difference between jumping up and down on a spring-loaded mattress and flying off to a world of perpetual youth. Track your authority To figure out how much dust you have in your tank, you’ll need to take a look at the Moz metric Domain Authority. This is our best prediction of how well a site will rank for any given search. It’s on a scale of 1–100, and higher DA means more authority. You can get your paws on DA free through Moz's Link Explorer, the MozBar (Moz's free SEO toolbar), or in the SERP Analysis section of Keyword Explorer. I like to keep MozBar on DA mode so I can check this metric out as I scoot about the web. To make this a whole lot easier, head to the Moz Pro \"Links\" tab. Here you’ll find your historical link metrics, alongside those of your direct competitors. Pixie dust, or website authority, gives you insight into what is powering your rankings, but everyone else's as well. These metrics are relative with respect to the other sites similar to your own, including your competitors. Gather a pocket full of pixie dust The first thing we always recommend when people reach out to us to find out how they can improve their Domain Authority is to improve the overall SEO of their site. The good news for you is we’ve already done that in steps 1-4 — highest of high fives to you! The second thing you have to do is get backlinks. This is commonly known as link building. When I started doing SEO for an ecommerce site back about what feels like a thousand years ago now, I had no idea what I was doing; this term irked me, and still kind of does. It sounds like you need to build links yourself, right? Nope! It’s like you’re playing Minecraft, but instead of building the structures, you’re actually trying to encourage other people to build them for you. In fact, you’re not allowed to build anything yourself, because that's cheating. Game changer! Don’t forget you don’t want just anyone building these structures. You need good people who themselves have authority; otherwise, your lovely gothic mansion might turn into a pile of rubble. A lot of link building today is PR, content creation and outreach. I’m not going to go into that in this post, but I’ll include some links in the toolkit below to help you in that department. We're going to look at what actions you can take to track and build your authority. Check for any leaks There’s no point grabbing up pixie dust if you have a whopping great hole in your pocket. Find and plug any holes quick-smart. Link Explorer has a handy tab just for this job. From “Links” click on “Top Pages” and filter by Status Code. Now here's a list of broken pages , ordered by Page Authority that have inbound links. Pages on your site that are down aren’t passing value — not to mention it’s less than ideal user experience. You can prioritize the pages with the highest PA and amount of linking domains. Internal links I said before that you can’t build any of your links yourself. However, as with everything in SEO there's a caveat: in this case, links from within your own site are not only key to your site’s usability, but they also pass equity. Internal linking is primarily for user experience, but it also helps bots navigate your site for the purposes of lovely indexing. Don’t stuff too many links on your page Your homepage and other top pages will probably have the strongest authority, as other sites will link to your homepage in many cases. You want that high-equity page to link out to other pages in a natural way that resembles a pyramid structure. Don’t forget the user in your rush to dish out equity; do visitors want to go from your homepage straight to some random deep page on your site? Does this help them on their journey? On-Demand Crawl in Moz Pro help you find out if if you have too many on-page links. You also shouldn't go overboard with keyword-rich anchor text. Once again, think about the user, not about gaming search engines. It’s unlikely to get your site penalised, but it’s typically ineffective and not a good use of your time. If you’re scooping up big swaths of copy to get keyword-rich anchor text but it doesn’t really help the person reading the article, then maybe you’ve got yourself an awkward link at your dinner party. To follow or nofollow? Links come in two flavors: follow and nofollow. Generally speaking, you do want your internal links to be “follow.” Although there are good reasons to noFollow internal links depending on your site setup. Bots will literally follow links unless told not to on the journey of your choosing and equity will be passed on, which is just what you want. You can use the MozBar to check your pages for follow and nofollow links. On your own site nofollow links can be marked on a link-by-link basis, or a whole page on your site can be allocated as nofollow. Let’s find the \"Meta-robots Nofollow\" column in your crawl CSV and filter by TRUE to check if you intended to mark these pages as nofollow. Toolkit: MozBar – In-browser link analysis Moz Pro Crawl Test – Find those nofollow pages and pages with too many links Link Explorer – Explore backlink analysis Further reading: Moz’s guide to link building Wrapping up I hope this helps you begin to uncover why your content isn’t ranking for your target keywords, and sets the wheels in motion for climbing up the SERPs. Try Moz Pro + KWE, free for 30 days Don’t forget that Moz Pro is available free for the first 30 days and it includes Keyword Explorer, so you can start to understand your site’s authority, check your on-page optimization, track your rankings over time, and figure out how to improve them. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "I've Optimized My Site, But I'm Still Not Ranking — Help! — Next Level"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "I've Optimized My Site, But I'm Still Not Ranking — Help! — Next Level"
    },
    {
      "level": "H2",
      "text": "Step 1: Check for technical issues"
    },
    {
      "level": "H3",
      "text": "Hello, operator?"
    },
    {
      "level": "H3",
      "text": "Search Console is here to console you"
    },
    {
      "level": "H3",
      "text": "Toolkit:"
    },
    {
      "level": "H3",
      "text": "Further reading:"
    },
    {
      "level": "H2",
      "text": "Step 2: Find out where you’re currently ranking"
    },
    {
      "level": "H3",
      "text": "Turn up the volume"
    },
    {
      "level": "H3",
      "text": "Start cooking with gas"
    },
    {
      "level": "H3",
      "text": "Check if you’re on page 1 of Google"
    },
    {
      "level": "H3",
      "text": "Want to see if you’re in the top 50?"
    },
    {
      "level": "H3",
      "text": "Dig into keywords with falling rankings"
    },
    {
      "level": "H3",
      "text": "Toolkit:"
    },
    {
      "level": "H2",
      "text": "Step 3: Optimize your content"
    },
    {
      "level": "H3",
      "text": "Don't go changing (too often)"
    },
    {
      "level": "H3",
      "text": "View your page like a bot"
    },
    {
      "level": "H3",
      "text": "Basic page optimization"
    },
    {
      "level": "H4",
      "text": "Title tag basics"
    },
    {
      "level": "H4",
      "text": "Meta Description basics"
    },
    {
      "level": "H4",
      "text": "On-page copy"
    },
    {
      "level": "H3",
      "text": "Check your whole site regularly"
    },
    {
      "level": "H3",
      "text": "Toolkit:"
    },
    {
      "level": "H3",
      "text": "Further reading:"
    },
    {
      "level": "H2",
      "text": "Step 4: Become a keyword connoisseur"
    },
    {
      "level": "H3",
      "text": "What's the meaning of this so-called 'competition?'"
    },
    {
      "level": "H3",
      "text": "Benchmark your site’s Difficulty rating"
    },
    {
      "level": "H3",
      "text": "Toolkit:"
    },
    {
      "level": "H2",
      "text": "Step 5: Build your site’s authority"
    },
    {
      "level": "H3",
      "text": "Track your authority"
    },
    {
      "level": "H3",
      "text": "Gather a pocket full of pixie dust"
    },
    {
      "level": "H3",
      "text": "Check for any leaks"
    },
    {
      "level": "H3",
      "text": "Internal links"
    },
    {
      "level": "H4",
      "text": "Don’t stuff too many links on your page"
    },
    {
      "level": "H3",
      "text": "To follow or nofollow?"
    },
    {
      "level": "H3",
      "text": "Toolkit:"
    },
    {
      "level": "H3",
      "text": "Further reading:"
    },
    {
      "level": "H2",
      "text": "Wrapping up"
    },
    {
      "level": "H3",
      "text": "Try Moz Pro + KWE, free for 30 days"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    }
  ],
  "author": "Jo Cameron\n          \n            Jo Cameron\n          \n            Jo Cameron"
}