{
  "url": "https://moz.com/blog/optimizing-your-google-places-page",
  "slug": "optimizing-your-google-places-page",
  "title": "Optimizing Your Google Places Page - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": " As increasing number of searches have local intent behind them, Google is showing Places listings in many more SERPs. This presents an opportunity to either gain a spot on the first page for many businesses or to gain more space on the first page for companies already ranking on the first page.…",
  "content": "Optimizing Your Google Places Page Local SEO By: Geoff Kenyon May 1, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Geoff Kenyon May 1, 2011 Optimizing Your Google Places Page Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As increasing number of searches have local intent behind them, Google is showing Places listings in many more SERPs. This presents an opportunity to either gain a spot on the first page for many businesses or to gain more space on the first page for companies already ranking on the first page. Here are five things that I’ve seen impact rankings in Google Places. Completeness & Consistency There are several fields to fill out when creating or editing and some of them may not seem like they are really necessary. Google wants to give users the best experience possible; in most circumstances the user will have a better experience if there is more information present on the Places page. This means not only filling out the required text fields but also the optional ones: Email address Website Description Categories Further, you should make sure the hours are accurate, that you have filled out additional details, as well as uploading photos and videos of your business. While these may seem auxiliary, they all count towards profile completeness and should be submitted. When filling out your profile, be as thorough as possible, doing much more than the minimum required. Think about it like being back in in school and writing a paper; you'll pass doing the minimum set forth but a little extra effort can go a long way. Don't fill out some of the extra details, fill them all out; and don't just add one photo, add several photos. Additionally, it is important to make sure that this information is consistent across all your different citations. Accuracy across all, or almost all, citation sources helps associate trust with a Places page. If you are looking for citation sources, Get Listed has a good overview of local citation sources. Keywords As with traditional SEO, having your keywords in the right places is important for ranking while stuffing keywords in the wrong places will make you look like a spammer. Avoid placing your keywords in the business name (unless the keyword is part of your business name) and the business categories. Both of these will bring the wrath of Google upon you and end up with your Places page removed. Do make an effort to strategically use your keywords in your description. Don't keyword stuff, but word your description carefully and use your primary keyword phrases. Service Area Specifying a service area is a great idea for many businesses that come to you such as tutors, maids, and handymen. If you are unfamiliar with the service area option, it is simply being able to set an area that your business serves rather than specifying an address for your company; it will show up on the map as a circle rather than a pinpoint. The problem is that we have seen a decrease in rankings when businesses have selected to display a service area rather than their business location. While I hope this is something that Google changes in the future and it becomes a viable option for business, but in the meantime, stay away from the service area feature. Encouraging Reviews Reviews are one of the best ways to increase your local search rankings but good reviews can be difficult to come by as it seems the only folks motivated to write up a review feel they have been treated unfairly. While you can’t incentivize reviews (Google calls this a conflict of interest), you might try some of the following: Send a message to your Facebook fans or email list and ask them to leave a review at your Google Place pageIf you send out follow up, or reminder, post cards (such as many dentists) incorporate a call to action to review your businessPut a call to action (and link) asking for a review on your web siteDisplay a sign by your cash register or hand them a flier with their receipt asking for a reviewMake sure to make the process as easy as possible, provide a link to your Places page and give detailed instructions on what they need to do leave a review. Bulk Uploads While the idea of bulk uploads, creating multiple places pages (10+) at a time by uploading a data file to Google, is a godsend for many companies with franchises or several locations, it can be a long process to get the listings approved. There are a few things you should keep in mind when you are doing a bulk upload: Brand Name in the Title While this might be the only option for companies like Pagliacci Pizza, a Seattle Pizza chain, where all of the locations have the same name, some businesses have names that vary by the individual performing the work or by the location (such as West Coast Athletic Clubs, which own several athletic clubs operated under different names). For businesses doing an upload for branches with different names, make sure the parent company name is incorporated Aggressive Keyword Placement Putting keywords in places they don’t belong, such as the business name, categories, or keyword stuffing the description, is a surefire way to get your entire bulk upload denied. If you have a lot of different listings always err on the side of caution here. Unique New York If all of your listings have the same contact information, you are going to run into trouble. Make sure that all of these listings are as unique, differentiated, and complete as possible. In particular, make sure that the following are all different: Phone numbers (and make sure they are a local area code) Contact emails Addresses (this should be a no-brainer) Description – make this unique to the location Categories/extra fields – if anything varies by location, you should note it. Website – if you have different URLs for different locations, use the specific URL for the location instead of the root (don’t worry, only the root will be displayed). After you have gone through all of the work to create good listings, don't forget you need to verify your listings. Please share any tips for local search that you've learned in the comments. If you want to learn more about local SEO, I recommend the following these folks on twitter and reading their blogs: David MihmAndrew Shotland Mike Ramsey Ed Reese Dev Basu Darren Shaw Erik Whaley Mike Blumenthal Tom Critchlow Dave Oremland Other Local Resources:Get Listed, Local Search Ranking Factors, White Spark Local Citation Finder Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Optimizing Your Google Places Page"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Optimizing Your Google Places Page"
    },
    {
      "level": "H2",
      "text": "Completeness & Consistency"
    },
    {
      "level": "H2",
      "text": "Keywords"
    },
    {
      "level": "H2",
      "text": "Service Area"
    },
    {
      "level": "H2",
      "text": "Encouraging Reviews"
    },
    {
      "level": "H2",
      "text": "Bulk Uploads"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Geoff Kenyon\n          \n            Geoff Kenyon\n          \n            Geoff Kenyon"
}