{
  "url": "https://moz.com/blog/optimize-competitors-branded-keywords",
  "slug": "optimize-competitors-branded-keywords",
  "title": "How to Optimize for Competitors' Branded Keywords - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It's probably crossed your mind before. ​Should​ you optimize for your competitors' branded keywords? How would you even go about it effectively? Well, in today's Whiteboard Friday, Rand explains some carefully strategic and smart ways to optimize for the keywords of a competitor, from determining…",
  "content": "How to Optimize for Competitors' Branded Keywords Keyword Research | Whiteboard Friday | Competitive Research By: Rand Fishkin February 12, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 12, 2016 How to Optimize for Competitors' Branded Keywords Keyword Research | Whiteboard Friday | Competitive Research The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. It's probably crossed your mind before. Should you optimize for your competitors' branded keywords? How would you even go about it effectively? Well, in today's Whiteboard Friday, Rand explains some carefully strategic and smart ways to optimize for the keywords of a competitor — from determining their worthiness, to properly targeting your funnel, to using third-party hosted content for maximum amplification. Click on the whiteboard image above to open a high resolution version in a new tab! Video TranscriptionHowdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week we're going to chat about optimizing for your competitors' branded terms and phrases, the keywords that are your competitors' product names or service names. This gets into a little bit of a dicey area. I think it's challenging for a lot of SEO folks to do this and do it well, and so I'm going to take you through an approach that I've seen a lot of folks use with some success. A strategic approachSo to start off with, let's go to the strategy level. Is it actually the case — and sometimes it's not, sometimes it is not the case — that branded keywords are driving high enough volume to actually be worth targeting? This is tough and frustrating, but basically one of the best thing that I can recommend in this case is to say, \"Hey, if we are...\" I'm going to pretend for the purposes of this Whiteboard Friday that we're all working together on the SEO campaigns for Wunderlist, which is a to-do app in the Google Play and iPhone app stores, bought by Microsoft I think a little while ago. Beautiful app, it looks really nice. One of their big competitors obviously is Evernote, certainly an indirect competitor but still. Are branded keywords driving high enough volumes to be worthwhile?Essentially what you might want to do here is actually go ahead and use AdWords to bid on some of these keywords and get a sense for how much traffic is really being driven. Can you draw any of that traffic away? Are people willing to consider alternatives? If there's almost no willingness to consider alternatives — you can't draw clicks here, you're not getting any conversions, and it is the case that the volume is relatively low, not a lot of people are actually searching for Evernote, which is not the case, there are tons of people searching for Evernote and I'd probably tell Wunderlist they should go ahead. Evernote is actually bidding on Wunderlist's terms, so turnabout is fair play. Bidding on AdWords can answer both of these questions. That can help them get us to: What do you need to solve?All right, now what is it that we need to solve? What are potential customers doing to compare our products or our services against these folks, and what are they interested in when they're searching for these branded names? What makes them choose one versus another product? Related searches can help us here, so too can normal forms of keyword research. So related searches is one form, but certainly I'd urge you to use search suggest, I'd urge you to check out Google's AdWords Keyword Tool, if you like keywordtool.io or if you like Huballin or whatever it is that you think is a great keyword tool, check those out, go through those sources for your competitor's keywords, see what's coming up there, see what actually has some real volume. Obviously, your AdWords campaign where you bid on their branded terms can help tell you that too.Then from there I'd go through the search results, and I'd see: What are people saying? What are the editorial reviews? For example, CNET did this Wunderlist review. What does their breakdown look like? What are people saying in forums? What are they saying on social media? What are they saying when they talk about this?Ask the same questions of your competitionSo if I'm seeing here's what Wunderlist versus Evernote looks like, great. Now let me plug in Evernote and see what everyone's saying about them. By the way, you don't just have to use online research. You can go primary source on this stuff, too. Ask your customers or your audience directly through surveys. We've used here at Moz Google Custom Audience Surveys, and we've used SurveyMonkey Audience's product. We like both of those. Once you've got this down and you say, \"Hey, you know what? We've got a strategic approach. We know what we need to talk about in terms of content. We know the keywords we're targeting.\" Great. Now you get to choose between two big options here — self-hosting some content that's targeting these terms, or using third-party hosting.Self-hosted content With self-hosted content we're going to try and go after those right terms and phrases. This is where I've seen some people get lost. They essentially go too high or too low in the funnel, not targeting that sweet spot right in the middle.1. Target the right terms & phrasesSo essentially, if someone's searching for \"Evernote review,\" the intent there is that they're trying to evaluate whether Evernote is good. Yeah, you know what? That's right in the middle. That's right in the sweet spot, I would say that is a good choice for you targeting your competitors' keywords, anything around reviews. \"Evernote download,\" however, that's really at the bottom of the funnel. They're trying to install at that point. I don't think I'd tell you to go after those keywords. I don't think I'd bid on them, and I don't think I'd create content based on that. An Evernote download, that's a very transactional, direct kind of search. I'd cross that one off my list. \"How to use Evernote,\" well, okay that's post-installation probably, or maybe it's pre-installation. But it's really about learning. It's about retaining and keeping people. I'd probably put that in the no bucket as well most of the time. \"Evernote alternative,\" obviously I'm targeting \"Evernote alternative.\" That is a great search phrase. That's essentially asking me for my product. \"What is Evernote,\" well okay, that's very top-of-funnel. Maybe I'd think about targeting some content like, \"What do apps like Evernote, Todoist and Wunderlist do?\" Okay. Yeah, maybe I'm capturing all three of those in there. So I'd put this as a maybe. Maybe I'd go after that. Just be careful because if you go after the wrong keywords here, a lot of your efforts can fail just because you're doing poor keyword targeting.2. Craft content that delivers a superior user experienceSecond is you need to craft that content that's going to deliver a superior user experience. You're essentially trying to pull someone away from the other search results and say, \"Yeah, it was worth it to scroll down. It was worth it to click and to do the research and to check out the review or check out the alternative.\" Therefore, you need something that has a lot of editorial integrity. You need that editorial integrity. You can't just be a, \"Everything about them is bad. Everything about us is great. Check out why we kick their butt six ways from Sunday.\" It's just not going to be well-perceived. You need to be credible to that audience. To do that, I think what's smart is to make your approach the way you would approach it as if you were a third-party reviewer. In fact, it can even pay in some cases to get an external party to do the comparison review and write the content for you. Then you're just doing the formatting. That way it becomes very fair. Like, \"Hey, we at Wunderlist thought our product compared very well to Evernote's. So we hired an outside expert in this space, who's worked with a bunch of these programs, to review it and here's his review. Here are his thoughts on the subject.\" Awesome. Now you've created some additional credibility in there. You're hosting it on your site. It's clearly promoting you, but it has some of that integrity. I would do things like I'd think about key differentiators. I'd think about user and editorial review comparisons. So if you can go to the app stores and then collect all the user reviews or collect a bunch of user reviews and synchronize those for folks to compare, check out the editorial reviews — CNET has reviewed both of these. The Verge has reviewed both of these. A bunch of other sites have reviewed both of them. Awesome. Let's do a comparison of the editorial reviews and the ratings that these products got. \"Choose X if you need...\" This is where you essentially say, \"If you're doing this, well guess what? We don't do it very well. We'd suggest you use Evernote instead. But if you're doing this, you know what? Wunderlist is generally perceived to be better and here's why.\" That's a great way to do it. Then you might want to have that full-feature comparison breakdown. Remember that with Google's keyword targeting and with their algorithms today they're looking for a lot of that deep content, and you can often rank better if you include a lot more of those terms and phrases about what's inside the products. 3. Choose a hosted location that doesn't compromise your existing funnelThis is rarely done, but sometimes folks will put it on their main homepage of their website or in their navigation. That's probably not ideal. You probably want to keep it one step away from the primary navigation flow around your site. You could conceivably host it in your blog. You could make it something where you say, \"Hey, do you want to see comparisons? Or do you want to see product reviews?\" Then we're going to link to it from that page. But I wouldn't put it in the primary funnel.3rd-party hosted content Third-party hosted content is another option, and I've seen some folks do this particularly well recently. Guest content is one way to do that. You could do that. You could pay someone else, that professional reviewer and say, \"Hey, we want to pitch this professional reviewer comparing our product against someone else's to these other outlets.\" Sometimes there are external reviewers who if you just ask them, if you just say, \"Hey we have a new product or we have a competing product. We think it compares favorably. Would you do a review?\" A lot of the time if you're in the right kind of space, people will just say, \"Yeah, you know what? I'll put that on my schedule because I think that can send me some good traffic, and then we'll let you know.\" You kind of knock on wood and hope you get a favorable review there. You could contribute it to a discussion forum. Just be open and honest and transparent about who you are and what you're doing there.Native adsToday you can do sponsored content or what's called native ad content, where essentially you're paying another site to host it. Usually, there's a bunch of disclosure requirements around that, but it can work and sometimes that content can even rank well and earn links and all that kind of stuff. Promotion & amplificationFor promotion and amplification of this content, it's a little trickier than it is with your average content because it's so adversarial in nature. The first people I would always talk to are your rabid loyal fans. So if you know you've got a community of people who are absolutely super-passionate about this, you can say, \"Hey, guess what? We released our comparison, or we released this extra review comparison of our product versus our competitor's today. You can check it out here.\" You can pitch that to influencers and pundits in your space, definitely letting them know, \"Hey, here's this comparison. Tell us if you think we were honest. Tell us if you think this is accurate. Tell us if this reflects your experience.\" Do the same thing with industry press. Your social audiences are certainly folks that you could talk to. Give them a reason to come backOne of the key ones that I think gets too often ignored is if you have users who you know have gone through your signup flow or have used your product but then left, this is a great chance to try and earn their business back, to say, \"Hey, we know that in the past you gave Wunderlist a try. You left for one reason or another. We want you to see how favorably we compare to our next biggest competitor in the space.\" That can be a great way to bring those people back to the site.Consult your legal teamLast thing, very important. Make sure, when you're creating this type of content, that you talk to your legal professional. It is the case that sometimes using terms and phrases, trademarked words, branded words, has some legal implications. I am not a legal professional. You can't ask me that question, but you can definitely ask your lawyer or your legal team, and they can advise you what you can and cannot do. All right, everyone. Hope you've enjoyed this edition of Whiteboard Friday, and we will see you again next week. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Optimize for Competitors' Branded Keywords"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Optimize for Competitors' Branded Keywords"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "A strategic approach"
    },
    {
      "level": "H3",
      "text": "Are branded keywords driving high enough volumes to be worthwhile?"
    },
    {
      "level": "H3",
      "text": "What do you need to solve?"
    },
    {
      "level": "H3",
      "text": "Ask the same questions of your competition"
    },
    {
      "level": "H2",
      "text": "Self-hosted content"
    },
    {
      "level": "H3",
      "text": "1. Target the right terms & phrases"
    },
    {
      "level": "H3",
      "text": "2. Craft content that delivers a superior user experience"
    },
    {
      "level": "H3",
      "text": "3. Choose a hosted location that doesn't compromise your existing funnel"
    },
    {
      "level": "H2",
      "text": "3rd-party hosted content"
    },
    {
      "level": "H3",
      "text": "Native ads"
    },
    {
      "level": "H3",
      "text": "Promotion & amplification"
    },
    {
      "level": "H3",
      "text": "Give them a reason to come back"
    },
    {
      "level": "H3",
      "text": "Consult your legal team"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}