{
  "url": "https://moz.com/blog/optimizing-for-yahoo-with-the-new-updates-i-have-about-10-highly-relevant-1-keyword-phrase-rankings",
  "slug": "optimizing-for-yahoo-with-the-new-updates-i-have-about-10-highly-relevant-1-keyword-phrase-rankings",
  "title": "Optimizing for Yahoo with the New Updates - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I've been studying and somewhat practicing SEO for about 4 years--and I've never seen great descriptions of what works in Yahoo versus the other engines.  In fact I haven't aggressively or consciously optimized for Yahoo EVER.  Yet I was amazed to see that with the most recent update at the end of…",
  "content": "Optimizing for Yahoo with the New Updates Search Engines D By: dave oremland November 8, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! D By: dave oremland November 8, 2007 Optimizing for Yahoo with the New Updates Search Engines This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I've been studying and somewhat practicing SEO for about 4 years--and I've never seen great descriptions of what works in Yahoo versus the other engines. In fact, I haven't aggressively or consciously optimized for Yahoo EVER. Yet, I was amazed to see that with the most recent update at the end of October '07, Y! had my main business site powerfully ranked with a large number of highly relevant important phrases. I looked at the most competitive keyword phrase for the industry and we were #1. I looked at 14 other important secondary terms that drive traffic and convert also, and the site was #1 at nine of them, either #2 or #3 at five of them, and for some that we were #1 we had a 2nd page at 2 or 3. Isn't that great? I still wasn't sure what we did to merit Y! treating the site that well. I thought it was time for research around the web to see what others had said in the past and see where the site structure, on page efforts, links, age, etc. might correspond with the wisdom of astute observers and commentators. Of some further information, this site represents a local brick and mortar business. In the past we made efforts and had good success with these industry phrases on all 3 major engines. We learned though that the industry phrases weren't as valuable for conversions as longer tail phrases that combined industry and local geographic phrases. Consequently, we refocused, and in Google at least, lost a lot of the top 5 rankings we had for the above referenced industry phrases. Also, the site has always ranked pretty well at Yahoo! from the time it first generated its own SE algo. It's just that this latest update really rocked the site back to exceptional rankings. In any case, I searched around for commentary on high Yahoo! rankings and referenced a number of sources, including: http://www.webpronews.com/expertarticles/2006/10/11/yahoo-seo-techniques http://www.beanstalk-inc.com/articles/seo/seo-for-yahoo.htm http://www.rankquest.com/seotips/200...for-yahoo.html http://www.seobook.com/relevancy/ The WebProNews article stresses on page content. It references that on page elements are more important in Y! than G. Two references from the article that define this business site versus other competitors within the industry are as follows: Make the pages content rich, use greater keyword density than suggested for Google (suggesting about 8% versus 2%), and vary the keyword phrases with stemming and other logical variations. The site definitely does that, being a little more verbose than competitors, and definitely takes the main keyword phrases and, in the course of content, varies them to reflect the stemming variations. By example, if this were an ice cream store, relevant pages might reference ice cream store, ice cream shop, ice cream parlor, etc. all on the same page within content. The same article references that Y! values metatags...and frankly, we continue to use them and treat them seriously. Even if Google doesn't give that any or virtually no value, other engines may and do and the WebProNews author feels Y! does. The Beanstalk article also emphasizes keyword density, but without being as specific as above. It references a keyword density range of between >1% and 8% and suggests comparing keyword density with the other sites ranked in the top ten at Y without being the extreme in either case. Hm....I gotta think my site has the highest density of competitors. Oh well. It references site and page structure. With regard to page structure, it strongly suggests being light on code so that content flows to as high a position on the page as possible. My site is definitely light on code and the content is easily accessible towards the top of the page for spidering. With regard to links, Beanstalk suggests that Y! treats backlinks somewhat like Google, emphasizing variety, quality, similarity in topics, etc. Of note, I'm a believer that Y!'s listing of backlinks suggests that the first links listed probably pass the most Y link juice. I fairly recently added a link from a first page of a weak site, but one that is entirely on topic with this business, plus that new link is listed among the first 20 in Y's backlink reports. The Rankquest article also references keyword density and keyword phrase placement. It specifically references keyword phrase usage in content meta tags, and title tags. Again, my site does all of this. It references static pages being far more important than dynamic pages. If there are dynamic pages, it references a site map to allow Y!'s spiders to move through the site. Aaron Wall at SEOBook writes about Yahoo! differently than the other writers. Without getting into it, it's an interesting read. With reference to Aaron's comments, he seems to suggest that Y! might have a bias towards its own huge volume of content resources. In that regard, my site is referenced independently in Yahoo Answers versus all other competitors. How sweet. I wonder if that helped. It's interesting to note that all the articles I referenced are a year or more old. Hmmmm. Have Y! algos changed that much or hardly at all? Since Y! introduced its own algos, this site has always performed well within Y SERPs, and structurally hasn't changed much. We've added content, refreshed, added links, etc. but the key elements of the site haven't changed for several years. During that time, the site has lost rankings in Google for these industry terms, but in Y! we've always been strong and now seem to be stronger. The one other thing I've noticed is that for a long time we maintained very strong rankings in both G and Y. The site had all the characteristics of above, with no significant structural changes. The only real changes over time have been an effort to add anchor text backlinks and adding content. The real focus on anchor text over the last 2 years was more focused on appropriate regional/industry phrases. That has probably caused the loss of Google rankings from high first page, some #1's, and medium first page to overall lower G rankings within the first 2 pages of SERPs. I'm just trying to see how significantly this site corresponds with what others have said about successful Y! rankings. It would be great to hear what others have found! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Optimizing for Yahoo with the New Updates"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Optimizing for Yahoo with the New Updates"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "dave oremland\n          \n            dave oremland"
}