{
  "url": "https://moz.com/blog/optimizing-joomla-15-for-search-engines",
  "slug": "optimizing-joomla-15-for-search-engines",
  "title": "Optimizing Joomla 1.5 for Search Engines - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A few posts on here have spoken about Joomla and its possibilities - but nothing really has been mentioned about Joomla 1.5 - so I thought I would contribute my experience.The most important things you need to do with Joomla are the following:Get your Template Right!So many times you will look at…",
  "content": "Optimizing Joomla 1.5 for Search Engines Design R By: raaboo July 1, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! R By: raaboo July 1, 2009 Optimizing Joomla 1.5 for Search Engines Design This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. A few posts on here have spoken about Joomla and its possibilities - but nothing really has been mentioned about Joomla 1.5 - so I thought I would contribute my experience.The most important things you need to do with Joomla are the following: Get your Template Right! So many times you will look at Joomla sites, only to notice scripting errors or templates that do not fit all of the content correctly. Plenty of free templates are available and can easily be amended, with the change of a few image files, so that you get the look you want. Avoid just using the default templates that come with Joomla. It does your site no harm in using them, but there are better ones available out there. Paying for a template is a good option as you get some great support and advice from the provider, such as rocket themes or yoothemes (which are generally considered to be some of the best). The great thing about 1.5 is that you can select which templates appear on which pages, according to the menu link that the section is related to. This means you can have different templates for different needs; perhaps there is a template that would work brilliantly for your online shop, but not for your news articles and vice versa.Whilst I do not recommend utilising different templates throughout the site, it does have its advantages, dependent on what your site is for! My main reason for not using multiple templates is purely for consistency - the template brands your site and as such, using different templates can cause confusion over your actual brand image. Avoid using too many modules When building your site it is imperative that you keep the modules appropriate to the content that they display with. In 1.5 you can customize where modules appear and with most templates you get different module 'suffixes' which change the CSS of the module, giving it a different appearance. Most templates have these but various articles on the Joomla help site (www.joomla.org) you should be able to get advice on how to create these suffixes yourself in the default CSS file (editable through your sites template manager). I mention these suffixes because they are extremely useful in helping to organise the look and feel of your site. Avoid overcrowding areas of your site - keep your frontpage content to a minimum of modules. Most importantly utilise all the positions - I don't mean one module in each position as some templates have over 20 positions available, I mean to avoid using just the 'left ' and 'right' module positions - by doing this your site content is kept clean and you can move content around easily without causing too much disruption to site users. Think like your users! Always look objectively at your site - get someone else to tell you what they think, no matter how harsh - pick someone who won't just give you lip service, it will get you nowhere - fast! Remember the key positions for people looking at your site - these are as below: Top Left: generally the first position people see on your site. Your logo and tagline should be here with relevant content underneath. Top Right: The best place to put menus and search functions as this is where they are commonly found on most sites. Centre: CONTENT CONTENT CONTENT - Think you get the message! Avoid putting just modules in the centre of the page although I am not against this. My own homepage has a module as the main homepage content - the reason for this is design! It looks better than just the main content. Joomla allows you to create a custom HTML module. All I did was create a custom module and position it in the top centre. It appears to users as the main content because the module expands down the page. The main content is only a centimetre or so high below this and simply displays any error message or search results. If you go for this option, make sure you set the module to only appear on the home page! Otherwise your homepage will be every page in your site Fully utilise the template typography! Okay, so some templates do not have full typography options - simply enough you can create your own styles in the css of the template, to denote how you want your H1, H2 etc tags to appear. With those templates that do have typography - use it! It really boosts the look and feel of the site by using things like drop caps and different colour styles. One great example is www.talkingminds.org - this uses different template colours and typography styles depending on which area of the site you are in. This helps users define areas of the site and because only slight styles have changed, the difference is noticeable enough for people to differentiate between the areas, but subtle enough to not confuse people. Make sure you use the H1, H2, H3 and H4 tags in your content. H1 should be for your content title, with H2 for your sub-headings. H3 and H4 are recommended for highlighting content. Also BOLD appropriate content but without making your content unreadable. Most importantly, DO NOT do this for all your keywords only. Make a relevant title for the page (more on this below) and design the content for the people reading it, not a search engine - it’s no good having a highly ranked site that people do not use because your content is poor! Avoid using Joomla's Default SEF Service! Lets be fair - the default Joomla SEF (in global configuration) is good for basic use - however it generates URLs punctuated by far too many comma's and forward slashes - your URL then becomes unmemorable. Get something like sh404SEF (I use it although others are available such as Artio and SEF Advance). sh404SEF is free and in constant development and works wonders - with it you can avoid having URLs like mydomain.com/component/content/14/category/12/article/56 and can instead trim this down as much as you want. The URLs for content on my site are all only 1 leading slash - so a review on the Lowry Hotel in Manchester is mysite.com/lowry-manchester.html. In each content item, when creating it, you can set the title and the SEF title; known as 'alias' in Joomla. This also applies for your actual menus as well. You should always make this relevant, so if your article was called The Dangers of Cucumbers, you should set the alias to cucumber-dangers or similar. By default, Joomla will make the alias the same as the content title, but will remove all spaces, replacing them with a hyphen (-) so Cats and Dogs would become cats-and-dogs.With my site, I have every review title set as 'review of {hotel name}'. This is set by what 'title' you give the content when its created in Joomla - again, make it short and sweet but relevant! In sh404SEF you can set text to be pre-pended or appended to the content title (see now why the title is relevant!). So all my content is appended with 'From Chocolate Pillow Hotel Reviews'. Now, my keywords are 'hotel' and 'reviews' so I have managed to get the keywords in to the title of every page, with little effort as it’s automatically appended - as all content on my site is from my site, the title will always make sense! When putting all the above together you end up with the following: Title - Review of The Lowry Hotel Manchester From Chocolate Pillow Hotel Reviews (okay, lets be fair, its a long title, but in my experience, it is still all read, although the main part that shows in searches is 'Review of The Lowry Hotel Manchester...' - the title is still relevant and the keywords are still read by most search engines)Article URL - mysite.com/lowry-hotel-manchester.html - easy to remember and to get to Article content - H1 tags for the following portions: Hotel Name and Location; Editor Review subheading H2 tags for the following: Overall Rating; Editor Review Title (i.e. The Lowry Experience) H3 tags/Bold for the following: Rating Criteria (Cleanliness, facilities, cost of stay etc) I did the above after lots of research and being a non-believer that most SEO would work, however after doing this, my site has jumped massively up the rankings - where I was previously number 40 or so, for the same search I am now in the top 10. Anyone who does care to look at my homepage will see a little trick I discovered (although no doubt to be frowned upon) as below: Create 3 or 4 small paragraphs describing your company and what you do, along with what the site is about. Wrap each paragraph in sequence with a H1 tag, then H2, then H3, then H4, then Bold. So paragraph 1 is a couple of sentences wrapped in H1, paragraph 2 is a couple of sentences wrapped in H2 etc.... writing your paragraphs is tricky as you need to make it readable, but containing your keywords. So mine is: <H1>We are your independant source for Professional Hotel Reviews of Luxury and Boutique Hotels across the UK.</H1> <H2>Our team of independant assessors travel up and down the country all year to bring you honest opinions and editorial reviews of the best and worst luxury hotels, so you can ensure your idyllic break is as luxurious and decadent as you deserve.</H2> <H3>Feel free to have a look around the site and read about where we have already visited, add your own review to places you have stayed or even nominate a hotel for us to take a look at via the Contact Us link. </H3> So you can see how the tags degrade down the intro, but with my keywords still included throughout! My Top Tips for Joomla! Utilise all the available HTML tags - Use H1 etc to their full potential. Don't stuff keywords into pages - obvious really! Put title attributes in your links and on images (this may involve having to do some coding, but the Joomla site has lots of good info on these code hacks) Use a 'random content' module - there are plenty available out there at extensions.joomla.org. This way you can essentially 'fool' a bot into thinking content has changed throughout the site - merely because the random content module will pull different content out and this will be noted by the bots as different content - suggesting your site has been updated, even though it may not have been!Review all your title and menu links - make them relevant to the subject and short and descriptive Capitalise Words in Relevant Titles - these make the content stand out more in links throughout your site ALWAYS make sure that your modules match the size of your content - the worst thing is seeing sites that have a lot of 'whitespace' caused by a long module on ones side of the page that extends further down the page than the main content - this looks unsightly and appears like you have paid no attention to your layout. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Optimizing Joomla 1.5 for Search Engines"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Optimizing Joomla 1.5 for Search Engines"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "raaboo\n          \n            raaboo"
}