{
  "url": "https://moz.com/blog/optimize-marketing-with-keywords",
  "slug": "optimize-marketing-with-keywords",
  "title": "How to Use Keywords Throughout Your Marketing Strategy - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Are you using keywords to optimize your entire marketing strategy? If not, here are some ways to do it beyond webpage optimization.",
  "content": "How to Use Keywords Throughout Your Marketing Strategy SEO Basics | Branding By: Kristi Hines September 15, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Kristi Hines September 15, 2015 How to Use Keywords Throughout Your Marketing Strategy SEO Basics | Branding The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. How do you use keywords? If you're only using them to optimize your website for search, then you're missing out on many ways to get visibility amongst your target audience. In this post, I'm going to share with you the best ways to use keywords across your entire online (and even offline) marketing strategy.Webpage optimizationI don't want to spend a lot of time on this one, especially since you can read all about it in the Beginner's Guide to SEO. But just for a quick review, here are the places that you should use your target keyword phrase on each page of your website that you'd like to optimize for search.In the SEO title tag of your page (or just the main title of the page if your CMS does not allow you to edit SEO fields). This is a requirement for the on-page optimization of a keyword.In the meta description for your page. Even though it may not count for optimization purposes, it will get bolded when someone sees your webpage in search results for that keyword.In at least one image's filename and ALT text. In the first paragraph on the page.In a few places throughout the content on the page in a natural way.Now, let's look at more ways you can utilize your keywords beyond simple website optimization.Content topic developmentIf you are developing content (blog posts, podcasts, videos, etc.) in order to get more visibility in search, then you'll want to create content that's based on keyword phrases that people are searching for. There are two ways to go about this. First, you can create great pieces of content with only your readers in mind. Once you've created your content, you can go back, find the keyword phrases that fit best, and optimize that content accordingly using the webpage optimization steps I've listed above.Second, you can research keywords for your industry, determine which ones would make for great content, and use those as a basis for your topic ideas. For example, let's say you wanted to create a website about dog training. If you search this on Google AdWords Keyword Planner, you can download 801 suggested keyword phrases, all with estimated search volume. Take your downloaded spreadsheet and turn it into a content topic idea generator using the keywords that best fit your content goals.Expand your spreadsheet to include additional notes about your topic idea, the content type you want to create (blog post, podcast, video, etc.), the best person to create the content, and much more. You can then use this spreadsheet to create content that you know your audience wants.With this approach, you can use keywords to plan your content strategy, a side benefit of which will be creating content that has the potential to drive lots of organic search traffic to your website.BrandingDo you want to create a strong brand for yourself or your business? If so, you need to think of the one keyword phrase that sums up your core offering and make sure it's what you use everywhere you go, online and offline. I don't mean in the anchor text kind of way, but in more of a \"I am a freelance writer\" or \"Moz is a marketing analytics software\" kind of way.This will help you brand yourself or your business by what you want to be known for. When people ask who you are or what your business does, you'll have a consistent answer, eliminating any confusion. You don't want to be the subject of conversations where one person believes you're a web designer, while another thinks you're an SEO consultant. Regardless of what's true, both people will end up confused as to whether they're discussing the same person.Once you have that one defining keyword phrase, you will definitely want to use it for the following:Social media profile optimizationWant to increase the likelihood that people will find your social profiles and pages on social networks? Keywords are the answer. If you aren't optimizing your social profiles and pages for your target keyword phrase, you may be missing out on the customers who are searching for you within each social network.While you can't optimize the \"SEO title\" field for your profiles and pages (those are reserved for your name or your business name), you can optimize other key elements within your profiles and pages with your target keywords and phrases. These include the following:For Twitter profiles, make sure your keyword phrase is in your bio.For Facebook pages, make sure your keyword phrase is in your page's \"Category,\" \"Short Description,\" and \"Long Description,\" all of which can be edited on your page's \"About\" tab.For Pinterest profiles, make sure your keyword phrase is in your profile's \"About You\" box.For Instagram profiles, make sure your keyword phrase is in your bio.For LinkedIn profiles, make sure your keyword phrase is in your professional headline, current job title, summary, skills, and other applicable sections throughout your profile.For LinkedIn company pages, make sure your keyword phrase is in your company description, company specialties, and company industry (if possible). For Google+ profiles, make sure your keyword phrase is in your tagline, introduction, occupation, and skills. For Google+ pages, make sure your keyword phrase is in your introduction (story) and category (if possible).As with any other webpage, you shouldn't overstuff your social profiles and pages with keywords. Doing so can cause visitors to assume you're a spammer and move on. But adding your main keywords and phrases in a natural way to the above areas should help you rank better in searches on each respective network. If you're not sure how to best utilize your keyword phrase in your social media bios, look towards your competitors. Analyze each of their top social profiles to see what keyword phrase they use most. You can also use tools like Rival IQ to get a quick overview of their bios for faster analysis.Social media update optimizationIn addition to your profiles and pages, your social media updates themselves can be optimized with keywords. While most of the benefit will be seen on social search within each respective network, it never hurts to think about keyword optimization so your social updates can be found on Google search, like these tweets for current events:The key to optimizing your social media updates with specific keywords and phrases is to use them early in your main status update. Take these posts indexed in Google search from the Moz Facebook page:Notice where the phrase \"link building\" appears in the search results and in posts like this one:And notice where \"link building\" is highlighted in posts that appear in search results on Facebook when you search for that phrase:The point is, make sure each text element of your social media update includes your target keyword phrase naturally, and as early as possible in the update. This will give your updates the chance to be found in search results on both the respective social network and potentially even Google. Guest post opportunity discoveryGuest posting for SEO purposes using low-quality content may be dead, but guest posting with high-quality content for the purpose of gaining more exposure with your target audience isn't. With this in mind, you don't want to use keywords for an over-optimized anchor text link in your author bio. Rather, you'll want to use keywords to find the best opportunities for guest posting.I like to use premium tools like BuzzSumo and Impactana for this. Here's how it works. You take the keywords you want to write about, and you search for them using these tools. BuzzSumo will show which sites have the most socially-shared posts matching those keywords.Impactana will go deeper and allow me to search for sites that have posts matching those keywords with lots of comments, views, backlinks, and other metrics.Both of these tools will ultimately let me know which sites I can submit content to that will garner lots of attention from my target audience, either via social shares, views, or comments. They will separate the top guest posting opportunities from those that have little benefit beyond a low-quality backlink.Directory listing discoveryBack in the early days of SEO, the goal with directory submissions was to get as many easy links as possible, preferably with some keyword-optimized anchor text. You should still use keywords with a directory link-building strategy, but not in the same way.Instead, search for your target keywords and phrases on Google to see if a general, niche, or local directory appears on the first page of search results. For example, a local business in Phoenix that offers dog grooming as their primary service should get listed in the following categories on Yelp and Angie's List:Wedding photographers, on the other hand, should be on The Knot and WeddingWire.Based on your industry, location, and target keyword, you're likely to find several different types of directories. The ones on the first page (especially if the directory ranks above your website in search results) should be considered for your website listing. If you can pay to be on the first page of that directory category, go for it!Email subject line optimizationIf you are sending emails to your customers, then you need to experiment with the keyword optimization of your subject lines. Why? Because emails can be searched, too, and you'll want to make sure that your email appears at the top of the results when people are looking for something specific.For example, let's say that someone has emailed a couple of different web designers for a project. They put the project on hold for a bit, then decide to pick it up again later on. What will they likely do? They'll search their inbox for the web design quotes they received. If your subject line includes those keywords, your email will make it into the search results.The next time you're sending an email to a potential client, think about the keywords they would search to find that email down the road and make sure to incorporate them into your subject line.UTM parameter trackingDo you like knowing exactly how people come to your website? If you are already using UTM parameters to track your links, you can utilize the optional UTM_term (used mostly by AdWords advertisers) to track your keyword usage. For example, if I create a Facebook ad for my business, I could use the following to note that the ad was targeted toward a specific audience, such as content managers, and the ad used the phrase \"freelance writer.\"I could then create variations of my ad to content managers, but using different phrases, such as \"blog content developer,\" \"blogger for hire,\" and other similar terms. Eventually, I could use my Google Analytics to determine which keyword phrase attracted the most clicks from these specific target audiences. You could expand this to tracking your advertising campaigns across Twitter, LinkedIn, Pinterest, and other networks as well. Offline marketingKeyword usage shouldn't just be limited to your online marketing. Think about ways to implement them into your offline marketing as well. In particular, take a look at your own marketing collateral right now and answer these questions:Does your business card have one or two keyword phrases that would tell someone who didn't know you exactly what you and your business have to offer, without them having to go to your website or contact you?Do you have brochures or flyers that lead with a keyword phrase so that someone who's interested in a particular product or service that you have to offer can grab and go?Does your vehicle sign or wrap have a quick list of products or services you have to offer, so people who see it in a parking lot will jot down your number or take a quick picture to contact you later?If you have this kind of marketing collateral and you answered \"no\" to these questions, it might be time to consider a redesign. Keywords can be just as eye-catching and effective offline. In conclusionWhile these aren't the only uses for keywords, they should help you start thinking of more ways you can utilize your target phrases beyond standard webpage SEO. Are you using keywords in these or other ways? If so, please share in the comments! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Use Keywords Throughout Your Marketing Strategy"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Use Keywords Throughout Your Marketing Strategy"
    },
    {
      "level": "H2",
      "text": "Webpage optimization"
    },
    {
      "level": "H2",
      "text": "Content topic development"
    },
    {
      "level": "H2",
      "text": "Branding"
    },
    {
      "level": "H2",
      "text": "Social media profile optimization"
    },
    {
      "level": "H2",
      "text": "Social media update optimization"
    },
    {
      "level": "H2",
      "text": "Guest post opportunity discovery"
    },
    {
      "level": "H2",
      "text": "Directory listing discovery"
    },
    {
      "level": "H2",
      "text": "Email subject line optimization"
    },
    {
      "level": "H2",
      "text": "UTM parameter tracking"
    },
    {
      "level": "H2",
      "text": "Offline marketing"
    },
    {
      "level": "H2",
      "text": "In conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kristi Hines\n          \n            Kristi Hines\n          \n            Kristi Hines"
}