{
  "url": "https://moz.com/blog/optimizing-for-searcher-intent-explained-in-7-visuals",
  "slug": "optimizing-for-searcher-intent-explained-in-7-visuals",
  "title": "What Is Search Intent and Why Does It Matter? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Learn how understanding and fulfilling search intent can assist you in optimizing your content, improving SEO strategies, and ensuring your website aligns with user goals to drive better results.",
  "content": "What Is Search Intent and Why Does It Matter? By Miriam Ellis, edited by Emilie Martin, and updated by Chima Mmeje September 12, 2024. What is search intent? Search intent (also known as “user intent”) is the searcher’s main goal when typing a query into a search engine. Common types of search intent include informational, commercial, navigational, and transactional. For example, if you’re looking to buy a new laptop, your search intent would be commercial, as you’ve indicated you plan to purchase.Sometimes, the intent of a search isn’t straightforward and needs more research and tools to understand. The closer the content you create matches the search intent, the better its chances of appearing in search results. Why is search intent important for SEO? 1. For search engines to deliver relevant resultsSearch engines like Google and Bing aim to better understand the ultimate goals of searchers in order to return relevant results. This is complex because users search intent can often be ambiguous.For example, if you search for “log cabin,” your goal isn’t clear—are you looking to learn what a log cabin is, how to build one, how much it might cost, a particular brand, or something else entirely? Google’s algorithms work to decode this ambiguity and match the query with the most suitable content.With the rise of AI Overviews, Google has refined its ability to match search intent with relevant results. AI-generated results show at the top of the search results for certain queries, providing quick answers and reducing the need for users to click. This makes understanding and optimizing for search intent even more crucial, as it affects the presence of traditional organic rankings in the search results and how voice search devices like Google Home present information to users. 2. For website owners and marketers to optimize for search intentSite owners and marketers also need to understand search intent. Doing keyword research yields a list of search terms, but you need to determine the audience intent behind those terms; otherwise, your content won’t rank no matter how good it is.For example, Moz’s domain tool used to be called Domain Analysis Tool, which drove a lot of traffic to the free tool. But if you Google “domain analysis tool,” you’ll notice some results include “website authority checker” or “Domain Authority Checker” as the title and primary keyword. This indicates that the keyword intent has changed, and our content strategy needs to change with it. Based on the new search intent, we pivoted to optimize the page for “Domain Authority checker,” which helped us reclaim the top ranking for the keyword. The four types of search intent Today, most SEOs recognize four types of search intent:Informational: The searcher wants to learn more about a topic (For example, “What is a gaming computer?”)Commercial: The searcher is thinking about making a purchase but needs to research first (For example, “Best gaming computers”)Transactional: The searcher wants to make a purchase (For example, “Buy HP gaming computer”)Navigational: The searcher is looking to go to a specific destination like a brand’s specific website or online resource (For example, “HP website”) Informational search intent Informational search intent means the searcher wants to LEARN MORE about something — typically an answer to a specific question. These searchers usually use keyword modifiers like What, How, Who, and Why. Examples of searches with informational intent include:What is a backlink?Who owns Target?How to set up a new computerAccording to Moz’s senior search scientist, Tom Capper, AI overviews appear more prominent in informational search results (SERPs). This makes sense, as these SERPs often include featured snippets and big Knowledge Graph results and are not heavily monetized. Navigational search intent Navigational search intent means the searcher wants to GO to a specific online destination, such as a brand’s website or an online resource. Examples of searches with navigational intent include: New York Times Nerd Wallet mortgage calculatorMoz login Commercial search intent Commercial search intent means the searcher wants to RESEARCH before making a purchase.Examples of searches with commercial intent include:Gaming pc for beginnersBest keyword research tool for beginnersAntivirus software for tablets Transactional search intent Transactional search intent means the searcher is ready to DO something, such as buy a product, visit a brick-and-mortar business, or sign up for an event. Examples of searches with transactional intent include: Tickets to the Journey concertTacos near meMoz free trial How to determine search intent Like many SEO tasks, determining search intent combines creativity, industry knowledge, data, and processes. Which is what makes it so much fun. There are two ways to determine search intent for any topic or keyword, and you’ll be putting on your SEO Sherlock Holmes hat to get started.1. Study the SERPsThe first and most important way to understand the intent behind a query is to look at the SERPs. By analyzing the types of search engine results that rank, you understand what search engines have determined as the search intent. This helps you align your content to the expectations of the searcher and search engines.If you Google the keyword “blender,” two types of search results show up. The searcher could be looking for a kitchen appliance or open-source 3D computer graphics software. The first result on page one shows the software, blender.org Product results on the SERP for blender, a type of kitchen appliance This is a mixed SERP intent, where the user search intent isn’t clear, and Google provides various search results to meet different search intents for the keyword.Meanwhile,when we study the search results for “coffee maker” on Google, the intent is very clear from Google’s perspective. The top-ranked organic results are primarily category pages featuring various coffee makers, which indicates that users are likely in the consideration or transactional phase, looking to compare options or make a purchase. 2. Use keyword research tools that label search intentManual research is time-consuming, especially on a large scale. Thankfully, Moz provides search intent as part of the Keyword Suggestions feature of Moz Pro. Moz AI powers the Search Intent column in Moz Pro to show the intent behind a query.You can find this feature inside Moz Pro by clicking Keyword Research and selecting Keyword Suggestions from the dropdown menu. Enter the keyword and choose a location, and Moz will populate a list of keywords with search intent. In this case, the result for “coffee maker” has a high degree of commercial intent. Moz Keyword Suggestions helps you analyze thousands of keyword phrases and identify opportunities to satisfy search intent for each query you’re targeting. Here’s a free search intent checklist for you How to optimize for search intent 1. Reverse engineer competing contentWhen you study the search results as we’ve described above, you’ll begin to notice a pattern for how page titles appear, the content format, content type, and structure of search queries. Use what is already ranking as inspiration for your content. But don’t forget to add your unique expertise to provide more value and show E-E-A-T for the topic.Here's how:Content typeThe first step is to determine the type of content ranking for the keyword you’re targeting. Some types of content you might be familiar with include blog posts, landing pages, product pages, guides, and video content. So, paying attention to what appears for different searches is essential to implementing what is already performing well. Looking at the example of “how to choose a washing machine” on the SERPs, you can see that you’ll be competing with a lot of image results, so you’ll need to include images of washing machines in your content because Google has chosen this feature as essential to satisfy the user’s search query. You also need to structure your content as a buying guide that answers the highlighted questions in the above screenshot.Content titleLet’s use the query “How to choose a washing machine.” The patterns in the titles include mentions of: How toChooseBestBuyWashing machine Let’s say you’re working on a website selling washing machines and want to create content targeting commercial search intent. You would need to mention some of these entities, such as “best” or “how to,” because Google has chosen them as relevant to the search term. So, an ideal title that fits the style of the SERPs while incorporating the entities would be “Buying guide: how to choose the best washing machine.”Content format Understanding the content format that’s already ranking is vital so you know how to structure yours. Options you might see on SERPs include: Listicles such as “7 Best Washing Machines for Your Home”Comparison pages such as “GE vs. LG washer”How-to guides such as “How to Choose the Right Washing Machine for Your Needs”Opinion-style pieces such as “Why Front-Load Washers Are Better Than Top-Load Washers”Reviews such as “10 Best Washing Machines Reviewed by Laundry Experts”User-generated content on Reddit or Quora For example, if we look at the keyword “home buying tips,” five of the top eight articles include numbers, indicating that your content should be a listicle. Target your customers at the right time Find and group keywords with high-search intent with Keyword Explorer in Moz Pro Start your free trial 2. Analyze content for gaps you can coverWhile you want to stick closely to what Google has identified as search intent for a particular query name, standing out from the herd is also important.If you review the top-ranking articles for a query, you’ll notice recurring subheadings, a sign that you should cover these common themes in your content.Let’s say you’re writing content for a legal firm and have identified opportunities for the keyword “How much does a lawyer cost?” Pull up the top five articles for your target keyword and peek at their content. A quick look at the top five articles for “How much does a lawyer cost” shows that they break down attorney fees by different measures, such as hourly fees. Doing keyword research for the topic is also a great way to uncover gaps you can exploit. For example, plug the keyword into Moz Keyword Suggestions in Keyword Explorer. You’ll see secondary keywords to include in your article, such as “how much is a lawyer consultation fee” and “lawyer hourly rate.But this is not enough. You must think critically about the search term and answer these questions:What does the user already know so I don’t repeat it?What new information can I provide to satisfy search intent?To answer these questions, you must deeply understand the user and empathize with their pain. Putting yourself in the shoes of your target customer or audience allows you to create content that solves common pain points, which is more likely to perform well and convert. 3. Cover subheadings in detail Think of every subheading as its own mini-article. Your job is to provide expert-level information that encourages the searcher to read every line of text rather than quickly scan it. Head of Branded Content at Riverside, Erika Varangouli, advises you to do the following: Subheadings should have a logical flowEnsure your subheading features a question or pain point your reader expects to find within the context of the pageGo 1, 2, 3 levels deep and research each subheading like you would an articleReference real-life experience with the problem and how you solved itInclude examplesAdd statistics to back up your pointsInclude quotes from experts with experience of the topic Forums are great at helping you uncover the true source of the problems or questions people have 4. Map search intent to marketing funnels and customer journeys Just as SEOs categorize search intent into four main types, marketers use customer journeys and marketing funnels to visualize how people move through the internet. Knowing these basic models helps in matching intent and fulfilling needs.AwarenessIn the awareness stage, the user is experiencing a problem and looking for ways to solve it. Sometimes, they might not have a name for the problem and will look for information with top-of-the-funnel queries. This is usually where they discover your brand for the first time. You should provide informational content to satisfy search intent for informational queries in the awareness stage.For example, “What are the benefits of a standing desk?”ConsiderationAt the consideration stage, the searcher has defined their problem and is exploring possible solutions. They are not ready to buy, so don’t push for sale. Instead, lead them closer to the decision stage with middle-of-the-funnel content.For example, “Standing desk vs. traditional desk: Which is better for you?” ConversionAt the conversion stage, the searcher fully understands the problem and is ready to decide. They’re looking for possible solutions to make a purchase. However, conversion isn’t always a direct sale, and you might still need to funnel through a free trial, sign up for a demo, or take other actions that interest your website visitor. Target bottom-of-the-funnel keywords for ready-to-buy customers. These keywords usually fit transactional or commercial search intent.For example, “Best standing desks for home office.”RetentionMost marketers only account for the traditional buying cycle, but retention is an integral part of the funnel because it’s where you keep the customer engaged to encourage repeat business. Create post-purchase content to help customers get more value from your product.For example, “How to adjust your standing desk for maximum comfort.” 5. Anticipate the user’s needsIn looking at funnels and journeys, it is critical to always think ahead to the next stage the searcher might take so that you can fulfill this, too. If, for example, a visitor to your site is in the consideration phase and has just landed on your landing page after searching “sales pipeline vs sales funnel,” ask these two key questions:What do they want to do next? What do I want them to do next?Incorporating contextual calls to action (CTAs) into your content seamlessly guides the visitor to the next step in their journey, usually your high-converting pages. This might be an in-text link, a clickable button, a booking calendar, or other actionable element. When it comes to search intent, an inquiring mind is an asset While the intent behind keywords may seem obvious, studying SERPs manually and using tools like Moz's Keyword Suggestions helps you uncover new trends or hidden intents. Adopt an inquiring mind and continuously experiment to find new search intent opportunities. Keep learning Robots.txt Read this post Targeting Multiple Keywords on a Single Page Read this post Google HCU: What Can You Do? — Whiteboard Friday Read this post With Moz Pro, you have the tools you need to get SEO right — all in one place Start your free trial! Additional Articles on Ranking and Visibility What Is SEO? What Is the Role of SEO in Digital Marketing? What is a SERP feature? Show More Domain Authority Page Authority Brand Authority Google Discover SEO Best Practices What Is Search Engine Marketing (SEM)? How to Create a B2B SEO Strategy Informational Keywords and How to Use Them to Drive Traffic How to Find and Use Transactional Keywords to Increase Conversions What is a Navigational Search Query? Commercial Intent Keyword Guide: How to Find and Rank For Them Show Less",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H5",
      "text": "Categories"
    },
    {
      "level": "H5",
      "text": "Moz Tools"
    },
    {
      "level": "H5",
      "text": "Additional Resources"
    },
    {
      "level": "H1",
      "text": "What Is Search Intent and Why Does It Matter?"
    },
    {
      "level": "H2",
      "text": "What is search intent?"
    },
    {
      "level": "H2",
      "text": "Why is search intent important for SEO?"
    },
    {
      "level": "H3",
      "text": "1. For search engines to deliver relevant results"
    },
    {
      "level": "H3",
      "text": "2. For website owners and marketers to optimize for search intent"
    },
    {
      "level": "H2",
      "text": "The four types of search intent"
    },
    {
      "level": "H2",
      "text": "Informational search intent"
    },
    {
      "level": "H2",
      "text": "Navigational search intent"
    },
    {
      "level": "H2",
      "text": "Commercial search intent"
    },
    {
      "level": "H2",
      "text": "Transactional search intent"
    },
    {
      "level": "H2",
      "text": "How to determine search intent"
    },
    {
      "level": "H3",
      "text": "1. Study the SERPs"
    },
    {
      "level": "H3",
      "text": "2. Use keyword research tools that label search intent"
    },
    {
      "level": "H2",
      "text": "How to optimize for search intent"
    },
    {
      "level": "H3",
      "text": "1. Reverse engineer competing content"
    },
    {
      "level": "H4",
      "text": "Content type"
    },
    {
      "level": "H4",
      "text": "Content title"
    },
    {
      "level": "H4",
      "text": "Content format"
    },
    {
      "level": "H2",
      "text": "Target your customers at the right time"
    },
    {
      "level": "H3",
      "text": "2. Analyze content for gaps you can cover"
    },
    {
      "level": "H3",
      "text": "3. Cover subheadings in detail"
    },
    {
      "level": "H3",
      "text": "4. Map search intent to marketing funnels and customer journeys"
    },
    {
      "level": "H4",
      "text": "Awareness"
    },
    {
      "level": "H4",
      "text": "Consideration"
    },
    {
      "level": "H4",
      "text": "Conversion"
    },
    {
      "level": "H4",
      "text": "Retention"
    },
    {
      "level": "H3",
      "text": "5. Anticipate the user’s needs"
    },
    {
      "level": "H2",
      "text": "When it comes to search intent, an inquiring mind is an asset"
    },
    {
      "level": "H2",
      "text": "Keep learning"
    },
    {
      "level": "H3",
      "text": "Robots.txt"
    },
    {
      "level": "H3",
      "text": "Targeting Multiple Keywords on a Single Page"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place"
    },
    {
      "level": "H3",
      "text": "Additional Articles on Ranking and Visibility"
    }
  ],
  "author": ""
}