{
  "url": "https://moz.com/blog/optimize-conversion-funnel-tofu-bofu",
  "slug": "optimize-conversion-funnel-tofu-bofu",
  "title": "How to Optimize Your Conversion Funnel, from ToFu to BoFu - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Acquiring and retaining new customers is tough enough—a leaky conversion funnel will only make things worse. Check out how to build and maintain a cycle from awareness to conversion in this article by Olivia Ross.",
  "content": "How to Optimize Your Conversion Funnel, from ToFu to BoFu Conversion Rate Optimization (CRO) By: Olivia Ross January 22, 2019 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Olivia Ross January 22, 2019 How to Optimize Your Conversion Funnel, from ToFu to BoFu Conversion Rate Optimization (CRO) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. No matter who your customer is or what you’re selling, it’s more likely than not that your customer will have to go through several steps before choosing to buy your product or service. Think about your own shopping habits: you don’t just buy the first thing you see. The first thing you do is note that you have a problem or a need, and then you research a solution online. Once you find that solution, which could be a product or service, you then decide which manufacturer or company is the best fit for your needs based on price, features, quantity — whatever it is that you are looking for.The sales funnel is a drawn-out process, so it’s important for you to understand your customer’s pain points, needs, and intents as they go from learning about your company to deciding whether or not they want to pay you for your services or products. The goal is for a customer to not only choose you but to keep choosing you over and over again with repeat purchases. By understanding where your customer is in the funnel, you can better move them through that funnel into a reoccurring sale.What is the conversion funnel?The “conversion funnel” (also known as the “sales funnel”) is a term that helps you to visualize and understand the flow through which a potential customer lands on your site and then takes a desired action (i.e. converts). This process is often described as a funnel because you're guiding the customer toward your conversion point. And these prospects come from a gamut of methods such as SEO, content marketing, social media marketing, paid ads, and cold outreach. Conversion rate optimization can occur at every stage in the funnel to improve the number of people you drive towards the most important action. To do this effectively, you need to think about the user experience at each stage — what they want, and how you can give it to them.A typical conversion funnel has several stages: awareness, interest, consideration, intent, and finally purchase (buy).Here’s a quick rundown of what to offer for each step of the funnel:Creating your funnelBefore you even bother creating different offers for different steps in the funnel, you’ll need to make sure you’re tracking these goals properly. The first step is to set up a funnel visualization in Google Analytics. In building your funnel, focus on these three things:The name of your goal: This goal should have a recognizable name so you know what you’re looking at in your reports. For example, “Document capture e-book A” or “free trial subscription B.”The actual funnel layout: You may add up to 10 pages in Google Analytics for a conversion funnel. This will allow you to find out where prospects are leaving before completing the goal. Without this, you won’t know which areas need the most attention and improvement.The value of the goal: In order to determine your ROI, you’ll need to decide what a complete goal is worth. If 20% of prospects who download a whitepaper end up becoming customers who spend $1000 with you, the download value might be $200 (20% of $1000).A very important to thing to take note of is that your potential customers will be coming from several different avenues to your site. Assuming you don’t have a very small site with very few visitors, there are several likely paths prospects will take towards conversion.If you try to push all of your prospects through the same funnel, it may look like your site’s conversion rate is extremely low. However, these customers may be getting to you through a different way such as landing pages.You must account for all avenues of traffic. Image SourceAwareness stageIt’s no secret that customers need to know you exist before they can even think about considering you. So in this phase, you need to focus on attracting people to your site.For this first step of the funnel, the goal is to create a strong first impression and to build a relationship with your prospective customers. This content should impress them enough that they fill out a form showing interest by giving you their email. Creating multiple TOFU offers gives you the information (company, name, email address) you need to segment and nurture leads further down the funnel.BloggingLet’s say Directive wants to create lead generation content. We’ll have some blog posts around PPC, SEO, and content marketing, and we will make sure to categorize these, either in the URL itself or on specific pages, in order to more easily segment our audiences.So not only should you be targeting people based on the categories they’re visiting, but if you send people to very specific content upgrades or exit popups based on the content they’re reading, you’re going to increase your conversion rates even more.Let’s pretend your conversion rate is normally just 3–4%, but a blog post talking about technical SEO saw an 18% conversion rate. This is because you’re sending a very specific audience to that page.Look at how HubSpot lays out their resources navigation. There’s tons of valuable content to learn from.HelpScout separates their content into categories, and each post is easily scannable in the 3-column card structure.Social networkingPeople use social networks for everything nowadays, from getting advice to looking up reviews and referrals. They like seeing the behind-the-scenes on a business’ Instagram, they field their complaints through a business’ Facebook and Twitter, and they look for tutorials and how-tos on Pinterest and YouTube. Social proof builds trust and helps increase conversions. Therefore, create an active presence on the networks that make sense for your market in order to meet your customers. Social media can also indirectly impact your search engine rankings.OptinMonster - Image SourceInterest / considerationThis stage of the conversion funnel is where you must start standing out from your competitors. If you offer service A at price B but so does Competitor #3, then how is that going to set you apart? What’s going to make the customer more interested in you over a competitor? The thing that makes you different is what will generate the most interest. This is why your unique value proposition (UVP) is so important.According to Unbounce, your UVP, also known as a unique selling proposition (USP), is a clear statement that describes the benefit of your offer, how you solve your customer's needs, and what sets you apart from the competition.During the interest stage, your website and content are extremely important in creating that closer relationship with your customers. However, people merely visiting your awesome site is not enough. You will want to keep them engaged after they leave. Just like in the awareness phase, we do this by capturing their email. However, we want to push a little further now.PPC and landing pagesYou can easily increase conversions with email opt-ins that only appear to your PPC visitors. Using this page-level targeting can really boost the effectiveness of your PPC campaigns.Focus on creating attention-grabbing content like headlines, carousel images, and banners all focused around your UVP. Here at Directive, we’re constantly coming up with strategies to help our clients get the most leverage out of their content. We created a landing page focused around demo requests. This page was not performing nearly as well as we would have hoped, so we decided to change the offer to a demo video.By switching an offering from a full demo to just a short 5-minute demo video, we saw a tremendous lift in conversion rates. It makes sense when you realize that the people in our target audience were in the awareness stage and were not interested in spending 30 minutes to an hour with a stranger explaining a product that they’re not ready to buy. As you can see, the demo video outperformed the full demo by an increase of 800%. Now these leads aren’t anywhere close to buying yet, but it’s better to build that interest in a larger pool of people who can potentially turn into sales than to only have two sales qualified leads to start with.Site optimizationIf you notice that you're getting decent traffic to your website but the prospects are bouncing after a short amount of time, the problem could be that your website doesn't have the content they're looking for, or that the site is difficult to navigate. Make sure to focus on making your web pages clean and legible. You only get one shot at a first impression, so your site must be easy to navigate and the content must explain the unique value of your product or service.Think about creating supporting content, including a mission statement, blog posts, great promotional offerings, a competitive shipping and returns policy — whatever drives the point home that your customers need the services that only you can offer. Your content needs to encourage visitors to want to learn more about you and what you do. If you're creating blog posts (which you should be), include a call to action for more in-depth content that requires prospects to join your email list to receive it. The Calls to Action on your pages are extremely important to focus on as well. If the prospects aren’t sure what you’re offering, they’ll be less likely to convert. For this client, we changed the CTA text to “Get an Instant Quote” from “Shop Now” and right off the bat, it made a huge difference. We ended the experiment in about 11 days because it worked so well and the client was so happy.When comparing the rest of the quarter after the test was complete to the same period before the test began, we saw a 39% increase in request a quote submissions, and a 132% increase in completed checkouts.Along with concise and clear UVP-related copy throughout your website and blog, continue using white papers, guides, checklists, and templates. These are your lead magnets to gather more customer emails in exchange for your offer.Gather qualitative dataUse qualitative data tools such as Hotjar to find out where people are clicking, scrolling, or getting stuck on your website. You can build your conversion funnel in Hotjar to see where customers are dropping off. This will tell you which pages you need to optimize. In this Hotjar funnel, you can see that there’s a major drop off on the demo page. What information isn’t clear on the demo page? Is there friction on this page to keep customers from wanting a demo?If you’re still not sure what to fix, sometimes it’s best to hear it straight from the horse’s mouth. Set up user polls on your site asking customers what's keeping them from getting their demo/trial/product/etc.Live chat and chatbots are another way to get user feedback. Gartner forecasts that by 2020, over 85% of customer interactions will be handled without a human. People want answers to their problems as quickly as possible, so providing that live chat solution is a great way to keep people from bouncing because they can’t find the information they need.Intent (also known as the evaluation or desire phase)By now, you and some of your competitors are in the running, but only one of you can win first prize. Your potential customers have now started to narrow down their options and eliminate bad fits. According to HubSpot, companies with refined middle-of-the-funnel engagement and lead management strategy see a 4–10 times higher response rate compared to generic email blasts and outreach. Nurtured leads produce, on average, a 20% lift in sales opportunities. Clearly, this is an extremely important part in the funnel.Customers in the middle of the sales funnel are looking for content that shows them that you're the expert in what you do. Live demos, expert guides, webinars, and white papers that explain how you’re better over competitors are very valuable at this stage. Use social proof to your advantage by using testimonials, reviews, and case studies to show how other customers have enjoyed your services or products. Many qualified leads are still not ready to buy. So in order to nurture these leads and turn them into real paying customers, provide interesting emails or an online community such as a Facebook group.EmailStart educating your potential customers about what it is you do. Build trust through automated emails sent to subscribers with answers to FAQs about your services and links to new content you have created.In this email, we offer a piece of content relevant to our subscribers’ interestsCreate location- and product-specific pagesOften times, your prospective clients are searching for a very specific product, or they need a service that's local to their area. By creating pages focused around what these users need, you're likely to get more conversions and qualified leads than a general overview page. At Directive, we created location pages for a client that targeted the areas they serve. We optimized the pages to reflect bubble keywords that increased their rankings and we now rank for a few different keywords on both the first and second page on Google. Since then, the amount of conversions from these pages have been tremendous.Click to see a larger image.Continue using PPC campaignsClick to see a larger image.In this example, we brought a top-of-funnel CTA into bottom-of-funnel targeting.We created ads that linked to a gated whitepaper on the client’s website. As you can see, there are a large number of impressions with 531 clicks. The theory was that our targeting was enough of a pre-qualification. Instead of getting a custom practice evaluation, the user was offered a map to show them how much money they could be making per patient in their state. Continue using landing pagesA specific landing page and call to action is more relevant to the visitor’s needs than your homepage and so is more likely to convert.Following the multi-step model designed to ease visitors into a commitment, here’s a demo example from one of our clients:Notice the questions being asked in the step-one form:Average Monthly RevenueCurrent E-Commerce Pain PointsThese questions allow the user to stay anonymous. They also lead the user to believe that they will get a more custom response to their needs based on the specific information they input.Next, they’re directed to the second-step form fields:This step is asking for the personal information. However, notice the change in headline on the form itself. “Last step: We have your demo ready to go. Who can we give this to?” This second-step language is very important as it reminds the visitor as to why we need their information: it’s for their benefit — we want to give the visitor something, not take something from them. Time and again, I see a multi-step page outperform a one-step by 300%.Take advantage of thank you pagesEven though you’ve already captured a lead/sale/sign-up/conversion, thank you and confirmation pages are a necessary step in the funnel process. Right after people opt in for the offer on your landing page, you’ll want to ask them to immediately take another specific action on the thank you page. For example, if you have a page offering a free e-book, offer a free demo on the thank you page to attempt to push those prospects farther down the funnel. They’ll be much more likely to take an action once you’ve already convinced them to take a smaller action. When visitors land on the report thank you page, we provide them the download link, but we also provide next steps with an option to get a demo. It’s important to tag people based on what they’ve downloaded or what posts they’ve read. That way you can create tailored messaging for these prospects when reaching out to them through email. ActionAssuming you’ve optimized each step of the conversion funnel, you should have some qualified leads becoming paying customers. However, your work here is not done. You will need to continue nurturing those qualified leads. After someone has taken a desired action and converted on your website, you’ll want to get these people back into the funnel in order to coax them into repeat business. Retention is such an important part of growing your customer base, since this will be revenue that you don’t have to pay for — this audience already showed a definite interest in what you're offering.If the lead converts into a customer, show them your other products or services and begin the cycle again. For example, let’s say you provide tree-trimming services and your customer just had you come by to trim the oak trees in their large backyard. After the job is done, continue reaching out to this customer with other services such as grass treatment, stump removals, or whatever else could be useful to them. You can do this by inviting them to an email newsletter or your social media channels. Send coupons and promotions via email. If you have an online store, include loyalty materials in their shipped order so they understand how much you value them as a customer. Along with nurturing this repeat business, focus on optimizing your product pages by removing friction and doing all you can to encourage shoppers to checkout. Examine and improve your checkout flow by answering common questions along the way.Key takeawaysOptimizing your funnel is a process that takes time, so don’t be afraid to experiment. It may take a few different offers before you find one that sticks and garners the most conversions. So create as many TOFU offers as you can think of to cater to the many different personas that make up your customer base. From white books and e-books to free trials, your TOFU content is the first step to building that relationship with your customers.From there, continue creating great content and nurturing those mid-funnel leads. If your content is relevant and your website is optimized, you'll notice that you'll be getting many more leads than you did before optimization. The more leads you gather and keep interested, the more likely you are to get repeat sales! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Optimize Your Conversion Funnel, from ToFu to BoFu"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Optimize Your Conversion Funnel, from ToFu to BoFu"
    },
    {
      "level": "H2",
      "text": "What is the conversion funnel?"
    },
    {
      "level": "H2",
      "text": "Creating your funnel"
    },
    {
      "level": "H2",
      "text": "Awareness stage"
    },
    {
      "level": "H3",
      "text": "Blogging"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Social networking"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Interest / consideration"
    },
    {
      "level": "H3",
      "text": "PPC and landing pages"
    },
    {
      "level": "H3",
      "text": "Site optimization"
    },
    {
      "level": "H3",
      "text": "Gather qualitative data"
    },
    {
      "level": "H2",
      "text": "Intent (also known as the evaluation or desire phase)"
    },
    {
      "level": "H3",
      "text": "Email"
    },
    {
      "level": "H3",
      "text": "Create location- and product-specific pages"
    },
    {
      "level": "H3",
      "text": "Continue using PPC campaigns"
    },
    {
      "level": "H3",
      "text": "Continue using landing pages"
    },
    {
      "level": "H3",
      "text": "Take advantage of thank you pages"
    },
    {
      "level": "H2",
      "text": "Action"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Ensure Your Organic Traffic Actually Drives Revenue — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How Our Website Conversion Strategy Increased Business Inquiries by 37%"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Olivia Ross\n          \n            Olivia Ross\n          \n            Olivia Ross"
}