{
  "url": "https://moz.com/blog/optimize-featured-snippets",
  "slug": "optimize-featured-snippets",
  "title": "How to Optimize for Google's Featured Snippets [Updated for 2024] - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In this article, you'll receive tactical advice on how to optimize your pages for capturing featured snippets, helping to improve your traffic and making you more visible on the SERPs.",
  "content": "How to Optimize for Google's Featured Snippets [Updated for 2024] Advanced SEO | Search Engines | On-page SEO By: Ann Smarty Edited By: Chima Mmeje August 20, 2024 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Ann Smarty Edited By: Chima Mmeje August 20, 2024 How to Optimize for Google's Featured Snippets [Updated for 2024] Advanced SEO | Search Engines | On-page SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Updated for 2024 by Chima Mmeje Google’s featured snippets started as an experiment almost a decade ago. They have since become integral to Google’s SERPs, showing up for many queries. In fact, featured snippets are now considered organic position #1, making it a part of any SEO strategy. What are featured snippets? Featured snippets are highlighted excerpts of text that appear at the top of Google's organic search results (below the ads and AI Overviews). Sometimes referred to as position zero, featured snippets provide quick answers to the user's question and mostly feature for informational searches. Here is a featured snippet example caught in the wild: Clicking a link below the featured snippet takes you to the part of the page featuring that answer. Recent studies reveal that featured snippets have an average 35% click-through rate. The higher click-through rate can be explained by the many search features added to organic search results over the years. Getting featured means being on top of organic search results. The newly launched AI overviews precede featured snippets when a searcher is logged into Google and searches from the United States. AI Overviews may be stealing some clicks from featured snippets, but even with them showing up, featured snippets have much better visibility than the rest of the organic results. Types of featured snippets According to a 2021 STAT study, there are three major types of featured snippets in order of prevalence: Paragraph featured snippet Paragraph-featured snippets provide concise answers to search queries directly in text form. According to an older STAT study, they are the most common type, often appearing as a few sentences of text at the top of the SERPs. List featured snippet The list featured snippets present answers in a bullet or numbered list format. They are ideal for steps, rankings, or lists and offer a structured response to user queries. Table featured snippet Table-featured snippets display information in a table format, usually pulled from data. These snippets are less common but are helpful for comparisons or data-driven answers. Video featured snippets Video featured snippets include video content that directly answers a query. They are the rarest type and often link to platforms like YouTube for more detailed explanations. How to find featured snippet opportunities Start with keyword research It's always a good idea to start by researching your keywords. When performing keyword research with featured snippets, begin with question-type search queries. These queries contain question modifiers like “what,” “why,” and “how” and are the easiest to identify. For example, let’s use the keyword “how to open a bank account.” Log in to Moz Keyword Explorer and enter this keyword. I’ve chosen the United States as my market, but feel free to select your preferred search location. The results page shows that the SERP features include a featured snippet, indicating that you can optimize your content for this feature. The next section shows the top keyword suggestions you can cover in your article or write separately based on search intent. Scroll down to review the ranking of the top 10 articles for the keyword, including the competitor occupying the featured snippet position. Side note: Make sure you target informational intent, not just questions. While featured snippets aim to answer the user’s question immediately, question-type queries are not the only types that trigger featured results. Research popular questions To explore the topic further, research popular niche questions. Many great tools for question research exist, including Moz’s Keyword Explorer. You can find a short list of questions related to your target keyword in the Keyword Suggestions section. Explore more questions by clicking view all. It’s also a good idea to review popular questions from: People Also AskRedditQuora Identify search queries where you already rank high Your lowest-hanging fruit is to identify which phrases you already rank highly for. These will be the easiest to get featured after you optimize for answer boxes (more on this below). Google Search Console shows which search queries send you clicks. To find that report: Click \"Performance\".Check the box to show the position your pages hold for each one, and you'll have the ability to see which queries are your top-performing ones: Note that Search Console labels featured snippet positions as #1 (SEOs used to call them position 0). So when you see #1 in Google Search Console, there’s nothing to do here. Focus on #2 and lower. You can then use the filters to find some question-type queries among those. You can also find queries you already rank high for with Moz’s Ranking Keywords by Site feature. Log in to Moz Pro, click the dropdown menu under Keyword Research, and select Ranking keywords by Site. Next, enter your URL and choose a location. Moz generates a list of ranking keywords organized by position and monthly search volume. For example, the screenshot below shows that Goop ranks number one for keywords like “wellness retreat” and “aura photography.” Go beyond traditional keyword research tools and ask people All the above methods (albeit excellent) tackle already discovered opportunities that you or your competitors are already ranking high. But how about venturing beyond that? One way to identify new content opportunities is by gathering direct feedback from your audience and internal teams. This approach allows you to understand specific needs, pain points, and the language people use when searching for information. Here are several ways to collect direct feedback: On-site surveys: Use on-site survey tools to ask your readers, customers, and followers how they search and what questions they ask. Tools like WPForms, Hotjar, or Google Forms are great options for embedding surveys on your website. Customer interviews: Conduct one-on-one interviews with your customers to understand their experiences, challenges, and how they search for solutions online. Speak to customer-facing teams: Your customer support and service teams often receive questions and concerns directly from customers. These insights can help you understand your audience's frequently asked questions. Content addressing these concerns will more likely capture a featured snippet, which often aligns with peoples' specific queries. Engage with sales teams: Sales teams regularly interact with potential customers and prospects. They deeply understand the objections and questions that arise during the sales process. Use the feedback to create content that addresses pre-purchase queries or educates prospects about your product or service, increasing your chances of ranking for keywords that trigger featured snippets. Consult lifecycle marketing teams: Lifecycle teams usually analyze feedback to gauge customer satisfaction or dissatisfaction with a product. They can provide valuable insights into the types of educational content or how-to guides that customers find helpful. Content that aligns could target long-tail keywords and instructional queries, which often feature snippets. How to optimize content for Google featured snippets 1. Answer the question concisely and immediately Google favors answers that are provided clearly and concisely within one paragraph. While this doesn’t mean your entire article should be brief, the key is to structure your content to deliver immediate answers. For example, if the question is “What is an air fryer,” the answer should start with: An air fryer is… This approach involves: Asking the question in your article as a subheadingImmediately provide a concise one-paragraph answerFollowing up with more detailed information or elaboration as needed This tactic may also result in higher user retention because it makes any article better structured and easier to read. 2. Avoid using brand names Featured snippets are included in voice search, including devices like Google Home, which reads featured snippets as answers to user queries. When crafting content for featured snippets, avoid using specific brand names unless necessary. For featured snippets, Google prefers neutral, universally applicable information to appeal to a broader audience. For instance, instead of saying, “Use a Philips air fryer,” simply state, “Use an air fryer,” to keep the content general and applicable to any brand. It increases the chances of your content getting featured, as it remains relevant to a wider audience without favoring any specific product or brand. 3. Do not write in the first person Due to its impact on voice search, featured snippets are most effective when written in a neutral, authoritative tone, without using first-person language. For example, imagine a voice search assistant reading, \"I think an air fryer is a healthier alternative to deep frying.” The user would be confused and wonder who “I” is in this context since the voice assistant didn’t mention names. Instead, rephrase it: \"An air fryer is considered a healthier alternative to deep frying.” This style of writing maintains objectivity and positions your content as a reliable source of information, which aligns with Google’s preference for authoritative and unbiased content in featured snippets. 4. Organize with subheadings Google often highlights the most factual and concise answers within a snippet. Typically, these snippets feature content that includes numbers, steps, and lists. Align with Google’s preference by using a structured hierarchy to organize content. Using H2 and H3 subheadings helps break your content into clear, digestible sections. It improves readability for your audience and makes it easier for Google to understand and feature your content in snippets. For example: H1 How to choose a personal assistant (Main title) H2 What qualities should you look for in a personal assistant (Subheading) H3 Attention to detail (What you plan to cover under the subheading) For additional guidance, refer to Google’s meta-description guide, which offers valuable insights into creating snippet-friendly summaries and answers. 5. Find related questions Since Google is very good at determining closely related questions, there's no point in creating a separate page answering each specific question. Creating one solid article addressing many related questions is a much smarter strategy if you aim to get featured in answer boxes. For example, take the topic of “winter shoes.” Enter this keyword in Moz’s Keyword Suggestions, and you can filter the results to show the top questions for the keyword. Since you’re optimizing for featured snippets, filter further by informational keywords to optimize your content for related questions. Want to go more granular? Moz’s Keyword Explorer allows you to group keywords or questions by lexical similarity. You can choose low, medium, and high similarity. The lower the similarity, the less relevant questions inside each group. 6. Make sure to use eye-catching images Paragraph-featured snippets with images are ridiculously eye-catching, even more so than regular featured snippets. Honestly, I couldn't figure out how to add an image to be featured. I tried naming it differently and marking it as \"featured\" in the WordPress editor. Google seems to pick up a random image from the page without me being able to point it to a better version. Google is pulling featured snippet images from Google Images search results, so image optimization is important for driving traffic from featured snippets. Also, don’t forget to update and re-upload the images (on WordPress). WordPress adds dates to image URLs, so the photos can be considered old or outdated even if you update an article with newer information. A few tools to explore: Use WordPress plugins to quickly visualize your content (put together graphs, tables, charts, etc.) while working on a content piece. Options include Visualizer and iCharts.Use image editing apps like Canva and Adobe Lightroom to create original images. 7. Match the existing featured snippet Manually review featured snippets to understand what content you need to create. Match your content to fit the existing featured snippet for the keyword. For example, when I looked at the keyword “how to tie a shoelace,” I could see that the video featured snippet ranks for the keyword. Hence, I’d need to create a video to target the featured snippet for this keyword. 8. Implement on-page SEO On-page SEO helps Google understand your page’s content. Moz provides a detailed resource in this beginner's guide to SEO. Meanwhile, here are some tips to help you optimize content for SEO: Headings: Use clear headings to break up your content and make it easier for readers to navigate the page.URL structure: Keep your URLs within three to four words​​Text size and color: To enhance readability, use a minimum of 16-point font, especially on mobile devices. Ensure good contrast between text and background colors.Meta description tags: Write user-friendly meta descriptions that fit within the pixel constraints to drive clicks.Paragraph breaks: Avoid long blocks of text by breaking paragraphs to maintain reader engagement.Bold and italics: Use bold and italics sparingly to emphasize key points, ensuring they stand out without overwhelming the reader.Image Alt attributes: Use descriptive alt text for all graphics to help Google understand the content of your images.Bullet points: Utilize bullet points to make lists easier to skim and understand.Schema markup tags: Implement schema to help Google recognize elements like tables. 9. Prioritize keywords ranking on page one When aiming for a featured snippet, focus on keywords where your content is already ranking well. The higher your position on page one, the better your chances of securing that coveted featured snippet. Your chances of earning a featured snippet increases when your page ranks within the top five results. Websites in the first position have the highest chance, but those in positions 2—5 still hold strong potential. 10. Keep optimizing and monitoring your progress If your first attempt at securing a featured snippet doesn’t succeed, don’t get discouraged. Start with small tweaks, like reverse engineering “what is” definitions based on SERPs or clarifying key points. If you’re still not seeing results, try more substantial changes, such as reworking sections of your content or providing new information. After optimizing your content for featured snippets, monitor organic keyword ranking to track performance. Set up a Campaign in Moz Pro to receive weekly or monthly reporting. Concluding thoughts: Improve your search visibility with featured snippets Featured snippets give you a bigger slice of the SERPs, increasing your visibility and attracting more clicks. Remember to provide concise, immediate answers to user queries to increase your chances of being featured. Don’t stop once you’ve hit publish—keep optimizing and refining your content to maintain or secure the top spot. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "What are featured snippets?"
    },
    {
      "level": "H2",
      "text": "Types of featured snippets"
    },
    {
      "level": "H3",
      "text": "Paragraph featured snippet"
    },
    {
      "level": "H3",
      "text": "List featured snippet"
    },
    {
      "level": "H3",
      "text": "Table featured snippet"
    },
    {
      "level": "H3",
      "text": "Video featured snippets"
    },
    {
      "level": "H2",
      "text": "How to find featured snippet opportunities"
    },
    {
      "level": "H3",
      "text": "Start with keyword research"
    },
    {
      "level": "H3",
      "text": "Research popular questions"
    },
    {
      "level": "H3",
      "text": "Identify search queries where you already rank high"
    },
    {
      "level": "H3",
      "text": "Go beyond traditional keyword research tools and ask people"
    },
    {
      "level": "H2",
      "text": "How to optimize content for Google featured snippets"
    },
    {
      "level": "H3",
      "text": "1. Answer the question concisely and immediately"
    },
    {
      "level": "H3",
      "text": "2. Avoid using brand names"
    },
    {
      "level": "H3",
      "text": "3. Do not write in the first person"
    },
    {
      "level": "H3",
      "text": "4. Organize with subheadings"
    },
    {
      "level": "H3",
      "text": "5. Find related questions"
    },
    {
      "level": "H3",
      "text": "6. Make sure to use eye-catching images"
    },
    {
      "level": "H3",
      "text": "7. Match the existing featured snippet"
    },
    {
      "level": "H3",
      "text": "8. Implement on-page SEO"
    },
    {
      "level": "H3",
      "text": "9. Prioritize keywords ranking on page one"
    },
    {
      "level": "H3",
      "text": "10. Keep optimizing and monitoring your progress"
    },
    {
      "level": "H2",
      "text": "Concluding thoughts: Improve your search visibility with featured snippets"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "20 SEOs Share Their Key Takeaways From the Google API Leaks"
    }
  ],
  "author": "Ann Smarty\n          \n            Ann Smarty\n          \n            Ann Smarty"
}