{
  "url": "https://moz.com/blog/ordered-my-new-laptop-today",
  "slug": "ordered-my-new-laptop-today",
  "title": "Ordered My New Laptop Today - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I ordered my brand new Dell Inspiron 6000 laptop today. I was swayed mostly by the widescreen SUXGA monitor, which allows for a resolution of 1920 x 1200, ...",
  "content": "Ordered My New Laptop Today Moz News By: Rand Fishkin December 29, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 29, 2005 Ordered My New Laptop Today Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I ordered my brand new Dell Inspiron 6000 laptop today. I was swayed mostly by the widescreen SUXGA monitor, which allows for a resolution of 1920 x 1200, along with the weight (6.65 lbs.), battery life (almost 6 hours) and price (mine was $1500 including 3 year warranty). I'm a big Dell fan, and though I've tried some products from Toshiba, Gateway, HP and a few others, I find that Dells seem to be solid, reliable, powerful and problem-free. I admit to spending an inordinate amount of time researching laptops (almost 4 months now) and at the last second, I almost bought the Thinkpad T-Series, but simply couldn't stomach the extra $1000 it would have cost to get what I wanted (128MB graphics card, 1024 RAM, etc). I'll let you know how it performs late next week. I'm planning to replace my desktop at work with it and take it with me on my many planned travels this year. You could probably tell from my last post that laptops were on my brain :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Ordered My New Laptop Today"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Ordered My New Laptop Today"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}