{
  "url": "https://moz.com/blog/other-relevance-factors-please-google-if-its-30-of-my-quality-score-let-me-know",
  "slug": "other-relevance-factors-please-google-if-its-30-of-my-quality-score-let-me-know",
  "title": "Other Relevance Factors? Please, Google, if it's 30% of My Quality Score, Let Me Know! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As PPC managers, we need to account for every percentage point, every up and down, and ultimately the cost of every conversion. We need to squeeze infinitely more out of a continually shrinking per-keyword budget to optimize ROI.  We track, collect, analyze, implement, and iterate at the most…",
  "content": "Other Relevance Factors? Please, Google, if it's 30% of My Quality Score, Let Me Know! Paid Search Marketing (PPC) By: Melina Engel April 2, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Melina Engel April 2, 2012 Other Relevance Factors? Please, Google, if it's 30% of My Quality Score, Let Me Know! Paid Search Marketing (PPC) This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Hello, Everyone! I'm the PPC manager over at SimpliSafe Home Security, and this is my first YouMoz. After a long period of repackaging what I've learned on this site in my own work, I thought today would be a good day to share what I hope is helpful to other PPC managers out here in Mozland. The Set Up As PPC managers, we need to account for every percentage point, every up and down, and ultimately the cost of every conversion. We need to squeeze infinitely more out of a continually shrinking per-keyword budget to optimize ROI. We track, collect, analyze, implement, and iterate at the most granular level. The bad things about our marketing platform can typically be cured by hard work and analysis. The one exception: your Keyword Quality Score. Cue the Quality Score battle-cry: Optimize the Landing Page! Optimize your CTR! Optimize your Ad Relevance! We do what we can to optimize our landing pages, click through rates (CTR), and ad relevance (aren't they the same thing anyway?). But when we're staring at a Quality Score that just won't budge, we need some clarity. Google Team Assemble! I recently sent off a series of e-mails asking Google why our exact match brand keyword has a lower quality score than a misspelling of that same keyword in the same campaign. Here is their response: \"After further analyzing the [yourbrandhere] keyword with our technical team, the simplest answer is that that the CTR (22.17%) is not quite as high as some of the keywords that have a Quality Score of 10. The CTRs of keywords with a Quality Score of 10 in that campaign range from 32.84% - 100%. Although the Quality Score for the [yourbrandhere] keyword is a 7, this should not be concerning. As a general guideline, if a Quality Score is above 5-6, the keyword is in good shape. I confirmed with the technical team that there are no backend issues with the keyword.\" Let's analyze the implications of this statement, shall we? The keyword in question (a unique brand name, if you're wondering about competition) has a quality score of 7/10. Currently, the top result costs X, and at a quality score of 10, the top result would cost (7/10)*X. A long-term savings of 30%. That's something everyone would love to see, but how do we get there? How Google (Reportedly) Calculates Your Quality Score Quality Score for Google and the Search Network: While we continue to refine our Quality Score formulas for Google and the Search Network, the core components remain more or less the same: The historical click through rate (CTR) of the keyword and the matched ad on the Google domain. Your account history, which is measured by the CTR of all the ads and keywords in your account. The historical CTR of the display URLs in the ad group. The quality of your landing page. The relevance of the keyword to the ads in its ad group. The relevance of the keyword and the matched ad to the search query. Your account's performance in the geographical region where the ad will be shown. Other relevance factors. Let's Analyze Our Keyword Here we're going to analyze our keyword relative to other keywords in the campaign, since this is the frame of reference Google uses in their e-mail. Remember: most other keywords in this campaign are quality score 10. The historical CTR of the keyword and the matched ad on the Google domain. This keyword's historical CTR is 22.17%, and the most recently promoted ad has a higher CTR than the historical. Your account history, which is measured by the CTR of all the ads and keywords in your account. This is the same for all keywords in this campaign. The historical CTR of the display URLs in the ad group. This is the only keyword in the ad group, so 22.17%. The quality of your landing page. Again, this is the same for all keywords in this campaign. The relevance of the keyword to the ads in its ad group. This is the only keyword in the ad group. The relevance of the keyword and the matched ad to the search query. Since this is an exact match keyword, the search query can only be [yourbrandhere], and the ad is the same structure as all other ads in this campaign. Your account's performance in the geographical region where the ad will be shown. This will, again, be the same for all keywords in this campaign. Other relevance factors If this, as Google tells us in their e-mail, means CTR relative to other keywords in the campaign, then this keyword is at the low end. Compared to other quality score 10 keywords the account (but outside of this campaign)? It's an order of magnitude better. How This Insight is Actionable I've heard other PPC managers say they have great success in building unique campaigns for their reportedly 'low-quality' keywords, but never have I heard a good reason why. Well, folks, here it is. Your quality score can be impacted up to 30% by the keywords CTR relative to all other keywords in the campaign. We've created a unique campaign for this keyword to isolate it from the impact of other keywords within its campaign. We're also moving to a structure that includes low quality keywords with similar CTR into their own unique campaign by searcher intent. The bad news here, seemingly as always, is campaign proliferation. The good news is a 30% cost gain on on high volume keyword (and likely many more) with more granular control. The great news? More data! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Other Relevance Factors? Please, Google, if it's 30% of My Quality Score, Let Me Know!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Other Relevance Factors? Please, Google, if it's 30% of My Quality Score, Let Me Know!"
    },
    {
      "level": "H2",
      "text": "Hello, Everyone!"
    },
    {
      "level": "H2",
      "text": "The Set Up"
    },
    {
      "level": "H2",
      "text": "Google Team Assemble!"
    },
    {
      "level": "H2",
      "text": "How Google (Reportedly) Calculates Your Quality Score"
    },
    {
      "level": "H2",
      "text": "Let's Analyze Our Keyword"
    },
    {
      "level": "H2",
      "text": "How This Insight is Actionable"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Melina Engel\n          \n            Melina Engel"
}