{
  "url": "https://moz.com/blog/our-secret-project-codename-carhole-set-to-release-on-oct-6th-at-smx-east",
  "slug": "our-secret-project-codename-carhole-set-to-release-on-oct-6th-at-smx-east",
  "title": "Our Secret Project: Codename Carhole, is Set to Release on Oct. 6th at SMX East - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It's almost here. This is the project I've been dreaming of launching since 2003 and after 12 months of research and development and an extremely large investment (especially for a small company like SEOmoz), we're nearly at the finish line.\nOn October 6th, SEOmoz will introduce a lot of…",
  "content": "Our Secret Project: Codename Carhole, is Set to Release on Oct. 6th at SMX East Moz News By: Rand Fishkin September 24, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 24, 2008 Our Secret Project: Codename Carhole, is Set to Release on Oct. 6th at SMX East Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. It's almost here. This is the project I've been dreaming of launching since 2003 and after 12 months of research and development and an extremely large investment (especially for a small company like SEOmoz), we're nearly at the finish line. On October 6th, SEOmoz will introduce a lot of substantial changes to our website, including: A New Design, courtesy of our extremely talented new designer, Matt Heilman. A New PRO UI that should help PRO members to more easily access all the tools and content behind the PRO wall. New Pricing, featuring three levels of PRO membership depending on the size and needs of our members. Current PRO members need not worry - you'll be grandfathered in at the current price level. We're just creating two new echelons for those who need access to more. If you'd like to lock in at the current price level ($49/month), I won't stop you :-) Our Secret Project, which I wrote a bit about here. It will include some (free) functionality for everyone and dramatically enhanced features for PRO members. More Sneak Peeks - I like to be transparent and after this release, we won't be as cagey about what we're working on, so expect to see 3-6 months into the future of SEOmoz's dev cycle from here on out The launch of Carhole is a big turning point for us and the fulfillment of a long time dream. It's also a big risk - we're going to need to generate the same level of passion and enthusiasm that I have for it across the industry, which is no small task. It's one of those moments where we'll find out if Rand really does have his finger on the pulse of what SEOs need. As you may have read, we've started sending out some early beta invites to our current PRO members. We'd love to preview it to a larger audience, but we need to keep the size fairly small for now. The beta testing will run for the next couple weeks, but we've already done a lot of on-site testing with local SEOs and partners around Seattle to give us some insight (many thanks to all of you!). Compared to past projects, which featured a maximum of 2-300 developer hours (for something like Trifecta), this project has enveloped our entire dev team, now 8 strong, solidly for the last 6 months and several members have been working since 2007. They've given up weekends, holidays, meals, girlfriends, wives, puppies, and driving shiny yellow Corvettes in the summer to make this deadline, and I'm very proud of all of them. October 6th will find myself, Nick Gerner, Danny Dover and Gillian Muessig at the SMX East conference in New York to publicly launch this project. I'll be speaking first on Monday at 12:30pm in the SMX Theater (where sponsored presentations take place), then again on Tuesday at 4:45pm on the External Linking Tactics panel. We'll also have a booth set up to help answer questions and demo, and we've even got killer new green t-shirts designed by Matt (featuring a giant robot monster). The rest of our team will be back here in Seattle, making sure the tubes don't melt and the wheels keep turning at the mozplex, for which I'm extremely grateful. I do hope to see many of you in New York in a few weeks, where you'll be able to watch me go bananas in person. As everyone who's met me in the past 12 months knows, I'm practically bouncing off the edge of my seat in anticipation. It's taking all my willpower not to put a screenshot in this post - seriously. p.s. Nick would like me to kindly note that the first release of this project, while extremely exciting, is going to be rough around the edges. It will be, in his words, \"the worst it's ever going to be\" on launch day and will improve dramatically with each successive update. I'll try to keep that in mind as I sing its praises to the sky :-) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Our Secret Project: Codename Carhole, is Set to Release on Oct. 6th at SMX East"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Our Secret Project: Codename Carhole, is Set to Release on Oct. 6th at SMX East"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}