{
  "url": "https://moz.com/blog/our-online-reputation-management-playbook",
  "slug": "our-online-reputation-management-playbook",
  "title": "Our Online Reputation Management Playbook - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We recently completed an interesting reputation management project and I thought it'd be helpful to post our strategy and results to the SEOmoz community. My hope is that you'll read this and get some ideas, or even better, you'll point out some areas that we overlooked or things we can do to…",
  "content": "Our Online Reputation Management Playbook Reputation Management By: Samantha Heald April 25, 2023 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Samantha Heald April 25, 2023 Our Online Reputation Management Playbook Reputation Management The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Online reputation management can be daunting – but advantageous – for brands or individuals that are seeing their search engine displays implicated by third-party content, and want to take the reins. When the media controls the narrative, it can lead to untrue perceptions and a more biased sentiment down the line. At Go Fish Digital, our team works closely with our clients to understand the sensitive issue they’re facing so we can meet their goals and rectify their online reputations. The situation We would not perform reputation management services for any company that was a scam or has participated in fraudulent or misleading activities. Prior to taking on a client, we fully research the business and ensure we are 100% comfortable in helping them with their problem. When big brands come to us communicating their search results complications, our team thoroughly reviews the situation before we decide to take it on. Our vetting process includes doing due diligence on each client to be sure we can validate the issue. Most of the time, a brand has a controversial topic or story in the current news cycle that is populating their search results. In such cases, the project goals usually include two things: changing the sentiment of the narrative and getting any negative articles off of the page one search results for their brand. To give you a better idea of how our team would approach a situation like this let’s take a look at the semi-current SERP complication we’re seeing for LuLaRoe, a multi-level marketing company that sells women’s clothing. Back in September 2021, a couple very authoritative news sites, Forbes and The Guardian, published stories about the “downfall of the company” based on the documentary The Rise and Fall of LuLaRoe, which came out that December. While this is not necessarily a company we would take on as a client, we are using them as an example as there are specific ORM strategies that we could identify to help improve the SERPs for their brand name. Our research When researching LuLaRoe, we saw that both the Forbes and The Guardian articles were ranking at the bottom of their page one search results, just below their Facebook page and just above their Amazon Storefront profile listing. We recorded what each link was, the position it was ranking in, and the sentiment of each for the first 30 results we found. As part of our process, it’s important we research and consider all the variables before putting together our plan of improvement. As mentioned above, we begin by gathering the search results rankings and assessing each URL we see in the first 30 positions. Our team tracks all of the factors and signals Google will look at when determining which URLs they rank for a keyword. Some of these factors include the relevance of the page, the keyword itself, backlink data, click-through rate, and social engagement. Gathering this data can be done by using tools like MozBar or Moz Keyword Explorer. Once we gather the important data points from every link on the first three pages or 30 positions using infinite scroll for our keyword, it’s time to put together our approach. For LuLaRoe’s case specifically, here’s some of the data we found from the SERPs: Our approach The ORM goal remained to control as much of the first 30 results as we could, as well as move the negative articles off the page one results. After doing the data collection as shown above, we took note of the areas that we could influence. For example, you can see that the Amazon link ranking in position eight has zero backlinks, so building new quality backlinks here is a strategy we would recommend to increase the quality of this signal to Google. In addition to launching our best ORM strategies, we decided that we would identify many new pieces of content, as well as update as much existing content as we could. The action plan for each business situation is specific to what we see ranking for that brand. Below, you can see our ORM strategies, broken down into three different categories, including pre-existing content, existing content, and engagement tactics. Pre-existing content strategies Setting up subdomains on the client's website In some cases, we recommend setting up subdomains that specifically address the controversy. For LuLaRoe, we would help them build out a subdomain on their website. Identifying news articles A benefit of a business being in the spotlight is that they may already have plenty of mainstream press. We can identify any positive articles from high Domain Authority (DA) news sites and other industry publications to promote. For LuLaRoe, we would not recommend this strategy, as there’s an overwhelming amount of negative press out there. They could potentially work with an authoritative news site to publish a piece detailing their side of the story or where the business is now, but we would suggest doing so down the road,after the dust settles from the bad press. This could produce ranking potential because it could be something unique to the results of the brand. Reviewing Wikis & other profile pages We recommend taking stock of any Wikis and existing profile pages a brand already has out there. For example, LuLaRoe could update its Crunchbase profile regularly. Doing so may have the potential to move the profile upward in the brand’s SERP. In LuLaRoe’s case, we would also recommend taking full advantage of its YouTube presence by adding new videos with a “new light” sentiment, and turning off all comments on each video. Since we see their YouTube profile ranking highly on their page two search results, this is a domain that has the potential to move above the negative stories ranking on page one. New content strategies Post on sites you have relationships with (or own) This could be a partner that has a completely different domain than you, or another brand that you have worked with in the past and have a good relationship with. Reaching out to these confidants to create new positive press surrounding the topic could help to get something new in the SERPs. Leveraging any existing relationships, or forging new ones, is a strategy that could potentially work for LuLaRoe. Research article directories Random directory sites are not to be forgotten. In doing research on the specific industry you’re looking to influence, you can suss out directory listings to expand your presence on. That said, this isn’t a strategy that would make much of a difference for a huge brand like LuLaRoe, but it could be used to make their n overall reputation look cleaner and more put together. Establish mini blogs We would recommend setting up a number of mini blogs on WordPress, Blogger, Posterous, and Tumblr, as well as a few other WordPress MU sites we have identified with high ranking potential. But again, these mini blogs may not have the high-ranking potential to make a significant difference for a bigger brand like LuLaRoe Take ownership of other domains We would recommend purchasing the .com, .net, and .org versions of the exact match domains for the search phrase –including the brandnamecharity.com. The general content we would recommend adding to these pages would include customer testimonials, positive stories, general information about the company, satisfaction guarantees, posts that debunk misinformation, and other stories that either didn't pertain to the issue at all or show positive aspects about our client. Also, creating new profiles on sites like Medium, or doing an IdeaMensch interview, could help positive controlled content to rank highly in your results. Engagement strategies Link building We highly recommend the link building tactic for all brands, especially LuLaRoe. When it comes to positive sentiment that has a low backlink data number, building links can help to increase that number. To do this, we would work with niche bloggers to build new links to the URLs that are ranking below the negative links on page one. The goal is to build backlinks to more than one target so these blog posts aren’t all about a specific brand as the topic, but rather, mention the brand in passing. Interlinking Another helpful tactic involves taking advantage of interlinking opportunities from the brand’s main website to the positive URLs we see ranking within the first 30 results for the brand. This will help to show Google that they’re relevant, important, and should be associated with the brand. Click-through rate (CTR) search team The goal here is to send clicks to certain positive targets in the SERPs to help move them above the negative. Like other tactics, this is about sending signals to Google that the target is a valuable piece of content to put on the first page of the SERPs. We would recommend sending high-value, US or local, clicks to the target URLs you identify. For LuLaRoe these include the Amazon Storefront, thredUP, Poshmark, LuLaRoe Bless, Twitter, YouTube, eBay, and Pinterest URLs. Competitor research Another tactic we would recommend is to take a look at competitors in your industry. Gathering a bigger picture of what’s ranking in a similar brands’ SERP could give you ideas of what to replicate. Sometimes, you may even find a random profile ranking for a competitor that you don’t have a profile on. LuLaRoe should take a look at other big brands facing similar controversies to gain knowledge on where and how they responded and moved forward. Influencer engagement Working with influencers and other social media engagers in the space is so important. Not only does it bring awareness to the ideas you're trying to promote, but it helps to increase engagement to articles that your brand would like to see higher in the search results. LuLaRoe could really benefit from working with any influencers who support their new business direction and are willing to help clean up their reputation. Case study & tracking progress Without giving away any of our past client’s project details, we wanted to give you an idea of some of the results we’ve seen after applying our tactics. The questionable situation was surrounding a commercial about a controversial topic at that time. After getting negative news coverage, we saw a few negative articles “stick” on the page one results for their brand. Using our proprietary technology for reputation management tracking, we calculated what’s called the “Sentiment Score” of the search result to be a 91. Our team took the time to thoughtfully review all aspects of the brand’s search results, as I detailed above. From there we applied the tactics we thought would make a difference and made sense considering the industry. The strategies that were successful in this case included increasing click-through rate, link building, and social engagements. Other strategies that helped to move the negative links on to page two included new profile creation and updating pre-existing content that was dated. It was great to see the positive results of our work, although it did take time due to the relevance of the article. The client also took part in charitable events that helped to create new press to surround the brand, which helped to meet their end goal even. These initiatives resulted in a Sentiment Score of a perfect 100 with no negatives on page one. You can read more about how we calculate the overall sentiment score for a query here. Conclusion The results from implementing the ORM strategies above vary from brand to brand. It all depends on how each ranking factor is determined by Google. The authority and relevance of an article also make a huge difference in how it’s placed. Our team has seen a ton of success utilizing and being strategic when implementing many of them, but some of our techniques work better than others because of the industry. This proves the importance of doing research to find out what tactics are best suited — and will be most beneficial — to a given brand of business. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Our Online Reputation Management Playbook"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Our Online Reputation Management Playbook"
    },
    {
      "level": "H2",
      "text": "The situation"
    },
    {
      "level": "H2",
      "text": "Our research"
    },
    {
      "level": "H2",
      "text": "Our approach"
    },
    {
      "level": "H2",
      "text": "Pre-existing content strategies"
    },
    {
      "level": "H3",
      "text": "Setting up subdomains on the client's website"
    },
    {
      "level": "H3",
      "text": "Identifying news articles"
    },
    {
      "level": "H3",
      "text": "Reviewing Wikis & other profile pages"
    },
    {
      "level": "H2",
      "text": "New content strategies"
    },
    {
      "level": "H3",
      "text": "Post on sites you have relationships with (or own)"
    },
    {
      "level": "H3",
      "text": "Research article directories"
    },
    {
      "level": "H3",
      "text": "Establish mini blogs"
    },
    {
      "level": "H3",
      "text": "Take ownership of other domains"
    },
    {
      "level": "H2",
      "text": "Engagement strategies"
    },
    {
      "level": "H3",
      "text": "Link building"
    },
    {
      "level": "H3",
      "text": "Interlinking"
    },
    {
      "level": "H3",
      "text": "Click-through rate (CTR) search team"
    },
    {
      "level": "H3",
      "text": "Competitor research"
    },
    {
      "level": "H3",
      "text": "Influencer engagement"
    },
    {
      "level": "H2",
      "text": "Case study & tracking progress"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Acknowledge and Cope with Fear of Local Business Reviews"
    },
    {
      "level": "H3",
      "text": "Celebrating Canada’s Small Business Month With Sustainable Local Biz Tips"
    },
    {
      "level": "H3",
      "text": "Takeaways from an Irish Locksmith Listing Spam Scandal"
    }
  ],
  "author": "Samantha Heald\n          \n            Samantha Heald\n          \n            Samantha Heald"
}