{
  "url": "https://moz.com/blog/our-day-with-andy-beal",
  "slug": "our-day-with-andy-beal",
  "title": "Our Day with Andy Beal - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Andy Beal spent the day with SEOmoz, consulting with us on how to grow our business, take advantage of our strengths and shore up areas of weakness. Andy's experience with WebSourced, a giant firm in the field and Fortune Interactive, a mid-size player, has given him the ability to take a close…",
  "content": "Our Day with Andy Beal Moz News By: Rand Fishkin September 26, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 26, 2006 Our Day with Andy Beal Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Andy Beal spent the day with SEOmoz, consulting with us on how to grow our business, take advantage of our strengths and shore up areas of weakness. Andy's experience with WebSourced, a giant firm in the field and Fortune Interactive, a mid-size player, has given him the ability to take a close look at a firm in SEO and immediately identify strategies to pursue and steps to take towards broader success. Although I can't be entirely transparent, I will share as much as possible. The morning started with Andy talking to each of SEOmoz's staff members individually. He went over their strengths, their goals, and their concerns with the current state of the firm. These one-on-ones proved invaluable later in the process. From there, Andy, Gillian, and I went out for a 2:30 hours long coffee break, during which we walked Andy through SEOmoz's financials, our clients, and the items we struggle with in the business. We presented Andy with our opportunities - the amount of consulting work we turn away is astounding, much of it because we don't have the time or ability to take on multiple, high-demand projects. We've been offered VC funding for some of our internal ideas and we've long been considering monetizing internal projects on our own. We've even received a buyout offer in the past six months. Sharing this with Andy and getting his input, backed by direct experience and an analytical, practical approach, helped to clarify our long and short-term goals for the business. Along with the good, we reviewed the bad. SEOmoz has communication issues, both internal and external. We face the enormous challenge of scaling a brand that is largely based around a single person's reputation and expertise. We have issues of cash flow, finding new sources of revenue, and even managing the SEOmoz community itself. Matt joined us for lunch and we spent a good deal of time concentrating on the SEOmoz website and its potential for growth. We also focused on staffing issues and talked about the next few hires we might make. Matt & Andy both opted for turkey club sandwiches (apparently, the most talented folks in search are fans of a good club). After lunch, Andy laid out his plans for us, which I've described in short detail below (sorry, gang - you have to buy Andy yourself if you want the whole scoop): Transitioning from consulting-based services into a true SEO-product company. It took me several hours to wrap my head around the concept that, as valuable as my consulting can be, it will always be a trade of time for dollars and a system that can't scale. Building SEO products that can be managed by our team (with my oversight), however, is something we can grow. Adding a campaign coordinator to our team is imperative. At this point, I'm managing contact directly with clients - another portion of the business that can't scale. Andy pointed out that 80-90% of the questions and emails and phone calls I receive can be handled by someone who coordinates the project and manages contact between myself and the other team members working on an account. Allowing time to develop alternate revenue streams for SEOmoz, outside of the traditional client relationship. Training my team to be as good (or better) than I am at SEO, business, marketing, and content strategies Optimizing our services pricing, timeframe, & contract structures to create a system that would be both profitable for us and create incredible value for our clients. Andy helped us with all of these items and much more. At the end of the consulting session between Andy, Gillian, and myself, we asked Andy to take our decisions back to the office and present them to the team - in his words and from his perspective. There was early resistance and pushback - as Andy noted, there's always fear surrounding change. But Andy was persistent and accomodating and excellent at showing the positive side of every one of our ideas. By the end of the day, everyone at SEOmoz was 100% on the same page. Will this change SEOmoz? Absolutely. But, I think it will be a change for the better - helping us to grow, allowing us to take on more clients and projects (of the right variety), and enabling everyone at SEOmoz to do what they do best and love most. I haven't been this excited about our company's potential in a long time. Big thanks to Andy, and thanks also to Jim Boykin, whose initial use of Andy's services convinced me that he was absolutely necessary to our growth. Inside the Restaurant at Dinner (photo courtesy of Mystery Guest) Andy Beal, Rand, Rebecca, Jane (our newest mozzer), Matt & Jeff After our consultation, we met for dinner at Chiso, in the center of Seattle's liberal heart (where a statue of Lenin is decorated throughout the year). Sadly, Brandon & Gillian couldn't make it - oddly enough, both had homework. And yes, in the center is SEOmoz's latest acquisition - Jane Copland, who'll have an introduction thread tomorrow. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Our Day with Andy Beal"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Our Day with Andy Beal"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}