{
  "url": "https://moz.com/blog/our-forgotten-friend-the-meta-description",
  "slug": "our-forgotten-friend-the-meta-description",
  "title": "Our Forgotten Friend, The Meta Description - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The transition from early noughties SEO to today's SEO is akin to going from an early Nokia to the latest iPhone in no time at all. The industry is growing up, changing VERY fast and is getting a lot more complex. Was there really a time before the nofollow tag? With all this change, no wonder the…",
  "content": "Our Forgotten Friend, The Meta Description On-page SEO By: Andy MacLean December 4, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Andy MacLean December 4, 2013 Our Forgotten Friend, The Meta Description On-page SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. SEO is changing radically (duh) Back in the days when SEO was much simpler, the humble meta description was one of the areas that you spent a lot of time discussing, working on and improving. Heck, working on the meta description and other on-page items, like the URL, H1s and page titles were a big part of what SEO people like me did as part of new projects and on-going campaigns. It almost laughable now to think how us good SEO folks felt spent a bulk of our time fiddling with page content here and there, applying some meta tag magic and doing some (by today's standards) quick and easy link building efforts and, by and large, getting really fast and really good results for our clients. The transition from early noughties SEO to today's SEO is akin to going from an early Nokia to the latest iPhone in no time at all. The industry is growing up, changing VERY fast and is getting a lot more complex. Was there really a time before the nofollow tag? With all this change, no wonder the once mighty meta description feels a little forgotten. What is the meta description? While it needs no introduction, here's one anyway. The meta description is one of several meta tags that every page has or should have. It plays no direct part at all in increasing ranking (one reason it's overlooked), but it is very important in helping drive traffic by maintaining a high clickthrough rate from your search results. The meta description (most of the time*) forms the bulk of your search results, so it serves as your ad copy. Therefore, the meta description needs to be compelling, relevant to your audience and include USPs or a call to action, depending on the page in question. * There are some instances when Google will use other content for the bulk of your search snippet. If you use tabled data on your pages or if Google thinks other content on the page is more appropriate, it will use it. Why is it important? As mentioned above, the meta description can directly affect traffic volume. The better the meta description, the higher the clickthrough rate and the more traffic your site will get. Aside from increasing traffic, it's an opportunity to present your own unique business style. As a blogger, I like to keep my content informal, interesting and humorous. I try and reflect this is in my meta descriptions. This doesn't apply to all sites though. If your site caters for budget conscious shoppers, then your meta description should perhaps focus on value and price rather than humour. If your site provides 'how to' information for amateur rock climbers, then it might be a good idea to detail exactly why the page content will help your audience (e.g., 'How to tie a clove hitch with a carabineer in three easy steps...') It's also worth noting that in the absence of any open graph tags on your site, Facebook and other social sharing sites use the description tag when your page is shared. This means your meta descriptions can directly impact the amount of clickthroughs, likes and further shares you receive from those social networks. Tips on writing great meta descriptions 1) Solve a problem - People are generally searching to find an answer to a problem, online shopping included (they're searching for a product at the best price, quickest delivery, etc.). So the meta description should address this. For example 'You deserve a little black dress. LOOK GREAT in ours. Sizes 8-14. 50% off this fall. Shop with confidence today.' Note how the meta description includes all these qualities: You deserve a little black dress. ENCOURAGEMENT Look great in ours. FLATTERY Sizes 8-14. INFORMATIONAL 50% off this fall. INCENTIVE Shop with confidence today. CALL TO ACTION & REASSURANCE 2) Include capitals - Google Adwords doesn't allow you to use capitalisation in paid ads. However, you can use it sparingly in meta descriptions and it really draws the eye. 3) Use numbers - Where you have a number to use, use it. It really stands out and numbers often imply more than words can (e.g., 50% off, top 10 company, award winning 2013). 4) Call to action - If you are selling a product or service, always try and end a meta description with a call to action. Remember this is your advert. Telling people to 'buy today', 'save now' or 'view our products here' is exactly what you would do in any other form of advert and it works. 5) Key facts - Are size, model number, colour, next day delivery, close to city centre or how long you have been in business important to your audience? If so, include the most important fact or facts concisely in your meta description. 6) Remember your tone - As discussed earlier, write in the style you see fit. Solicitors make me very nervous. I'd be more likely to visit a solicitor’s web site from a search result if the tone was welcoming and assuring. (I know which I prefer) 7) Show off - Can you name drop or claim to be superior to competitors in some way? For example: 'As worn by David Beckham...' would be compelling to many. 'Voted best for the 3rd year running...' gives you a great edge. 8) Use superlatives - Similar to the previous point, don't undersell yourself or your page content. 'View our stunning new designs...' is a lot better than 'We sell a wide range of clothing...' 9) Keep it less than 155 characters - Your meta description, and thus your message, risk getting cut short if you go over this limit. 10) Format - It often works well to start with something attention grabbing and then an affirmation of why the searcher should choose your site. This should be followed by a call to action. Where possible in using that format, use the other pointers in this list. I repeat the earlier example which, ticks a lot of boxes. 'You deserve a little black dress. LOOK GREAT in ours. Sizes 8-14. 50% off this fall. Shop with confidence today.' 11) Redundancy - Don't include anything that will get outdated, unless you are willing and remember to update your meta descriptions. 'The latest 2009 smart phones right here...' isn't particularly compelling! Meta descriptions for big sites Okay, at this point, some of you are thinking how on earth are you supposed to write awesome meta descriptions for your multi thousand page web site? Don't despair! In my opinion, the best way of dealing with this is to create protocols that your site developer can implement and then manually edit your most important page meta descriptions afterwards. For example, if you sell varieties of branded bed linen products: Lowest prices on [INSERT BRAND NAME] bedding here! Next day deliver on all [INSERT PRODUCT TYPE] items. Never overspend on quality bedding again. Shop now. Translates into: (Dorma, 4 foot bedding page) Lowest prices on Dorma bedding here! Next day delivery on all 4 foot bedding items. Never overspend on quality bedding again. Shop now. (Fogarty, Goose down bedding) Lowest prices on Fogarty bedding here! Next day deliver on all Goose down bedding items. Never overspend on quality bedding again. Shop now. And the list can go on and on. Matt Cutts recently stated that it was better to have no meta description than have lots of duplicate ones, a problem large sites often have. Having no meta descriptions of course isn't ideal though as you want control of your search snippet as far as possible and to this end meta description protocols for very large sites are a great solution. Useful tools for better meta descriptions Screaming Frog SEO Spider - Lets you see all of your meta descriptions and those of your competitors. SEOmofo Snippet Optimizer - Useful for checking out how your meta descriptions will look in search results. Finally I hope this post has left you a bit more encouraged about the potential value of the meta description and how you can edit your own meta descriptions to increase traffic. Much of what I've written above can also be applied to other aspects of a web site, such as page or meta titles, as well as on-page copy. Thanks for your attention! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Our Forgotten Friend, The Meta Description"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Our Forgotten Friend, The Meta Description"
    },
    {
      "level": "H2",
      "text": "SEO is changing radically (duh)"
    },
    {
      "level": "H2",
      "text": "What is the meta description?"
    },
    {
      "level": "H2",
      "text": "Why is it important?"
    },
    {
      "level": "H2",
      "text": "Tips on writing great meta descriptions"
    },
    {
      "level": "H2",
      "text": "Meta descriptions for big sites"
    },
    {
      "level": "H2",
      "text": "Useful tools for better meta descriptions"
    },
    {
      "level": "H2",
      "text": "Finally"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Andy MacLean\n          \n            Andy MacLean"
}