{
  "url": "https://moz.com/blog/outranking-google",
  "slug": "outranking-google",
  "title": "Outranking Google - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I wouldn’t say Google is the “enemy”, but all too often they’re far being from a friend. Understanding Google and understanding yourself will set you up to avoid catastrophe.",
  "content": "Outranking Google Advanced SEO E By: Ed Fry July 25, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! E By: Ed Fry July 25, 2012 Outranking Google Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. “Know your enemy, know yourself, and you can fight a hundred battles without disaster...” The Art of War, Sun Tzu I wouldn’t say Google is the “enemy”, but all too often they’re far being from a friend. Understanding Google and understanding yourself will set you up to avoid catastrophe. Here on SEOmoz, we love reading about tactics. Smart, repeatable, step-by-step processes you can implement and see results from right away. Everything else is a frustration, right? So, if you'll kindly bear with me... we're going to talk strategy rather than tactics. How to future-proof your marketing from Google. Deep breaths. First, let me paint you a picture… Imagine, YOU are Larry Page. You have billions of dollars to spend... (Image Credit: One Billion Dollar (Most Expensive Artwork Ever) You have thousands of super-talented software engineers. You also have thousands of super-savvy marketers. (Image Credit: Joel on Software) You derive almost all your revenues currently from selling adverts. Oh, and you also have thousands of shareholders and analysts breathing down your back. What do you do? Some ideas that come to mind... Turn commercially-focused searches such as shopping into a pay-to-play game. By-pass parasitic “search within search” sites and own other multi-billion dollar industries such as flights and hotels. Start experimenting with disrupting job search, insurance comparison, credit card comparison, people search, lawyer search, real estate search, Google+ dating… and put forward the convincing argument that it’s better for users (at least in the short term?). Use Adwords data to find other high-paying industries where Google can cut out the middleman, setup shop on their own, and take a higher margin. Buy out or joint venture with successful incumbents to gain rapid market share and infrastructure in these high-margin industries. Replicate the total dominance of Adwords in search in other media channels. Google TV, intelligent and responsive outdoor media, and Google Glasses (or whatever becomes of that) coupled with inevitable integration of everything with Google+ to give Google unparalleled reach and targeting to advertisers across every media channel. It begins to get very evil, very quickly... This is a new world we could be entering into. Basic rules of SEO may begin to go out of the window. Building anchor text links to “hotels in New York” is meaningless when Google has rolled out their own solution straight into the search results. It sort of feels like this. So what to do about the 600lb gorilla in the cage? Here are five strategies to get you thinking. Strategy #1: Optimize Search Demand, not Search Supply This isn’t experimenting into influencing Google suggest, running Superbowl ads, or other similar short-term wins. You need to build something that, once someone knows about you, they’d be crazy not to come back to each time they need to buy. Brands, as companies and as products will perform better against Google. Building a brand stops both people and Google treating your products as commodities. They'll come to you first. Zappos, for instance, strives to delight customers. Whether it’s the fast, free delivery and free returns for up to a year, or the huge resources pumped into phone calls to build relationships with customers, Zappos has built a truly great platform for customers. ~75% of their sales are from repeat customers. Being remarkable is important. Instead of relying on unbranded search terms for shoes, it's better to use word of mouth marketing by your delighted customers. They might start at Google, but search instead for your brand rather than the product they want. Google, outranked! Similarly, invent your own search demand. Apple didn’t make a “tablet PC”. They made an iPad. The ensuing onslaught of consumer searches was for the “iPad” - a branded term. Since users love brands, and Google says it will continue to serve its users interests first, Google will steer out the way. You don’t even have to be a massive company conquering a massive industry to do this. The brand new startup Dollar Shave Club pulled off a one-hit video stunt, but the long term marketing win that delivers lasting value is people talking about their brand. Action: Build a Brand Branding isn’t just a name. It’s what other people call it and why they identify with it. (Fast Company has an excellent primer on brand building). How do people identify with your company and products? You need to spend time mapping this out and defining a brand for current and future customers. The community on Inbound.org has some great links on branding too. Of course, you have to make sure your all set up to win your branded SERPs. Here are two Whiteboard Friday refreshers for you on Dominating Your Brand SERPs and the Renewed Value of Branding. Your Small First Step: Answer These Two Questions: What information is so critical to your customer’s next purchase that, if you had it on your site AND they knew about it, they’d be crazy not to check it out? What in your company can you brand so that you can manipulate search demand? Strategy #2: Build Genuine Permission Assets If customers really care about you, they don't need Google to find you. You need to build a customer base who want to hear from you, and who can buy from you in the future. These customers will be people who will come straight to you because they know and trust you. I bet you’ve read countless articles and guides on growing larger email lists, getting more twitter followers, and earning more likes on your Facebook page. That information is great, but the trouble with this scoreboard mentality is that it focuses you on building sheer numbers rather than real engagement. A list of 100,000 subscribers isn’t really a list of 100,000 loyal fans. 50,000 Twitter followers aren’t really 50,000 people who will go out their way for you. 1,000 Facebook Likes isn’t really a list of 1000 people who will passionately defend the webpage and content if it’s ever criticized. The bar in and out is set too low. You have to gain genuine permission assets from your audience by their loyalty rather than numbers. What have your followers done for you lately? Look at some of these examples... TheOatmeal has a clear, loyal following. His tribe rallied behind him during his recent legal spat. Seth Godin has a clear, loyal following. His tribe helped him convince publishers to put his upcoming book in physical stores. Zappos has a clear, loyal following. Their tribe post rave reviews and testimonials publicly on their Facebook page. In their thousands... ​If your business closed down, website disappeared and employees disbanded today, would your customers, audience, and community miss you tomorrow? Or the next time they need to buy? Action: Build a Loyal Tribe of Customers You need to build a loyal audience and community or customers that will go out of there way for you, even if that means just skipping Google search results. Find the people who will miss you dearly when you’re gone. Those loyal few are your strongest asset. Don’t measure your audience by numbers, but measure their responses instead. How much revenue do they generate? How often do they send enquiries? What kind of email do they send to you? Build an community. Connect your followers together, and build a stickier brand. Jen Lopez put together an excellent, pithy post on using community as an Inbound marketing channel. Your Small First Step: Connect a Dozen People Together See if these people would be interested in forming a community that aligns with your brand values by seeding a relevant conversation. This ties in closely with the actions in Strategy #1, building a brand. This could be online (Twitter chat, LinkedIn group, webinar, G+ hangout) or offline (drinks, meetup, conference, breakfast). BONUS! Buy Tribes book by Seth Godin and/or watch Seth’s TED Talk on The Tribes We Lead (It's 20 minutes. You can watch it in your lunch break.). Strategy #3: Prepare for Long-Term SEM If Google shopping and Google flights are any indicator of the future, it's likely Google will put you on a diet of some kind of Adwords-type service you must adopt in order to keep you in the SERPs. That means you must be getting ready to master online advertising in your niche, which doesn't work without knowing your lifetime customer value, costs per customer acquisition and conversion rates. Who’s to say you can’t thrive under Google? In search advertising in particular, where Adword’s quality score appears to tie more closely with SEO (relevant pages, strong social signals, passing “the panda questionnaire”), continuing with traditional SEO appears to be the future for staying in the SERPs. SEOs and Adwords folks appear to be getting closer anyway, and there's more and more relevant information we can learn from one another. In the long run for both, in competitive niches especially, knowing your numbers and driving down costs to acquire customers will only help win, be that for increasing PPC budget or SEO spend on content, outreach, acquiring data or anything else. Conversion rate optimization is the key to unlocking a prosperous future with Google. You need to get your team on top of this. Action: Conquer Conversion Rate Optimization In order to truly win at SEM and the Adwords game, you must conquer conversion rate optimization. Thankfully there are many great resources on CRO here on SEOmoz; my favourite so far is by Stephen Pavlovich. Send this to your team. I’ve always loved Conversion Rate Expert's case studies for insights to processes as well as for reinforcing the case for CRO. Here’s an example of a case study where they doubled a companies conversion rate, making them £14 million extra that year, and another slightly older case study, but with a familiar face. SEM is process driven. CRO is process driven, too. The asset you need to build is a process for testing and winning at CRO. You need to bring your developers, designers, other marketers, and C-level execs on board with the idea of incremental benefits to CRO, and get them onboard with a continual process of testing new ideas. Incidentally, the same skills will be needed for mastering Adwords, when the time comes. Consider a rolling contest for people to suggest things to test, and if they move the needle by a significant percentage, a significant reward be dealt out. Keeping that in mind... Your Small First Step: Setup One Small CRO Experiment Read through the guides above, and pinpoint one small test you can implement. The first test might be painful as there are no processes in place to make it all happen easily, but once you’re setup you can run more and more experiments. But start with one. Today. You could have tangible results at the end of the week. More money, please! Strategy #4: Overseas Conquest Our search comrades in Russia, China, South Korea, Japan, and many other countries will still benefit from lack of Google dominance... for the time being, at least. Focus on targeting places where Google is not inherently strong and is unlikely to invade within the medium term. There will still be good money to be made here, and often these are high-growth, emerging markets. Who in travel doesn’t want to be selling holidays to the emerging middle class in China? That said, “understand your enemy.\" How long until Google, Microsoft, or even Facebook makes a move for Yandex, Baidu, Naver, and all the foreign incumbent search engines? Action: Optimize for \"unGoogled\" Emerging Markets First, take care of the essential technical SEO to target foreign countries. Rand put together a Whiteboard Friday on international SEO a while back, and Matt Cutts also has some suggestions for using unique domains to target specific countries. Take a look at this detailed list of country domain extensions. Yandex, Baidu, and others all have broadly similar interests algorithmically, so you’re not going wrong following Western SEO advice you get from SEOmoz or Google’s user guidelines. A few links worth following and bookmarking:. An excellent blog on SEO for Russia, and Yandex in particular at Russian Search Tips. Yandex Webmaster Tools (in English) Baidu Webmaster Tools (not in English currently, but usable by auto-translate in Google Chrome) Submit your site to Baidu (sounds ol’ school doesn’t it?) here if you aren’t already indexed. SEO for Naver, by Search Engine Watch If you've got any additional helpful links to add, please post them in the comments :) Although it’s horrible, overwhelming advice... you’ll need to have language skills on your SEO team. Bring bilingual SEOs onboard by recruiting internally and externally. Foreign language skills are going to become invaluable for tapping lucrative emerging markets. Like having talented designers, developers, and marketing processes, you either have them or you don’t. Put yourself ahead of the competition. Your Small First Step: Find One Bilingual Helper Search within your organization, on LinkedIn, Facebook, maybe via local universities and colleges for people who have an interest in online marketing and language skills in emerging markets. It needn’t be something full time and permanent, but at least someone you can turn to and ask about their local market. Just one person who can speak Russian or Chinese or something significant. BONUS! Buy your .cn, .ru, .kr etc. domains Strategy #5: Build an Essential Step in the Chain Search is only one step in the chain. You can construct your business to force people and/or Google to come through you before or after visiting Google. There are two ways to do this: you can either win the context war (pre-commercial search) or you can win the fulfillment war (post-commercial search). Google can’t create contextual information surrounding a search without degrading their search quality. If Google starts inserting flight and hotel search results whenever you search for “Maui,” maybe looking for pictures for a project or something, it’s going to frustrate users. This is where you can win. Amazon jumps early on the e-commerce chain by becoming the canonical source of reviews and product research information. What’s stopping you from listing products on Amazon? Similarly, TripAdvisor drives huge volumes of traffic by becoming the canonical source of information for hotel reviews. Win the fulfillment war by becoming the one and only way of fulfilling a certain good. This might mean proprietary products, proprietary software or complete monopoly over a certain, specific market. Apple owns the supply chain for sales of their goods, but you don’t have to be a pan-global company to have a similar effect. Travelocity earns commissions from selling tickets. They launched a Travelocity rewards program for regular customers and offered various ways to earn points redeemable on more travel through booking tickets through them and using Travelocity-branded credit cards. This encourages people to keep returning to book through Travelocity, while still maintaining other loyalties and benefits such as frequent flier miles with the airlines they actual travel with. Action: Build an Essential Step of the Chain What content would be so incredibly useful that users would have to go through it? Take a look at Rand’s Whiteboard Friday from a few years back on The Path to Conversion, and use it to work out where you can add incredible value in your market. Alternatively, what value-add could you build into the chain that Google can’t touch? Could you add a loyalty program with unique rewards? Your First Small Step: Map Out The Buying Process from Research to Fulfillment … then brainstorm ideas around each one where you might be able to add value that can’t be copied easily. In summary. Google has a ridiculous amount of resources and motivation to disrupt your market. They’re going to take your cake and eat it too, unless you can fight for your turf. Use these five strategies to fend off their advance: Build a Brand - Start by identifying your brand positioning Build Genuine Permission Assets - Connect a dozen people together + Buy book/watch Tribes talk by Seth Godin Prepare for Long-Term SEM - Start a small CRO test Conquer Emerging Markets - Find one bilingual helper + buy your foreign domains Build an Essential Step in the Chain - Start by mapping out the buying process, from research to fulfillment PRO Tip: Do all of them! ... but if none of these hit the spot, consider this ... \"Strategy\" #6: Can't Beat 'Em? Join Them! Image Credit: This Green Machine Of course, if you can’t find a way of outranking Google in the long run, consider giving in. Expect Google+ to encircle your industry. Embrace G+ now, and win in the long run. Alternatively, consider selling out to Google. Or you could give up completely. Google is hiring. ;) ... and on that bombshell! I think it’s time to end! See you in the comments for more serious strategy talk, and also more “If I was CEO of Google I would _______________________” :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Outranking Google"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Outranking Google"
    },
    {
      "level": "H2",
      "text": "Imagine, YOU are Larry Page."
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Strategy #1: Optimize Search Demand, not Search Supply"
    },
    {
      "level": "H3",
      "text": "Action: Build a Brand"
    },
    {
      "level": "H3",
      "text": "Your Small First Step: Answer These Two Questions:"
    },
    {
      "level": "H2",
      "text": "Strategy #2: Build Genuine Permission Assets"
    },
    {
      "level": "H3",
      "text": "Action: Build a Loyal Tribe of Customers"
    },
    {
      "level": "H3",
      "text": "Your Small First Step: Connect a Dozen People Together"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Strategy #3: Prepare for Long-Term SEM"
    },
    {
      "level": "H3",
      "text": "Action: Conquer Conversion Rate Optimization"
    },
    {
      "level": "H3",
      "text": "Your Small First Step: Setup One Small CRO Experiment"
    },
    {
      "level": "H2",
      "text": "Strategy #4: Overseas Conquest"
    },
    {
      "level": "H3",
      "text": "Action: Optimize for \"unGoogled\" Emerging Markets"
    },
    {
      "level": "H3",
      "text": "Your Small First Step: Find One Bilingual Helper"
    },
    {
      "level": "H2",
      "text": "Strategy #5: Build an Essential Step in the Chain"
    },
    {
      "level": "H3",
      "text": "Action: Build an Essential Step of the Chain"
    },
    {
      "level": "H3",
      "text": "Your First Small Step: Map Out The Buying Process from Research to Fulfillment"
    },
    {
      "level": "H2",
      "text": "In summary."
    },
    {
      "level": "H2",
      "text": "\"Strategy\" #6: Can't Beat 'Em? Join Them!"
    },
    {
      "level": "H2",
      "text": "... and on that bombshell!"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ed Fry\n          \n            Ed Fry\n          \n            Ed Fry"
}