{
  "url": "https://moz.com/blog/outsource-link-building",
  "slug": "outsource-link-building",
  "title": "When (and When Not) to Outsource Link Building - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Alexandra shares her insights as the owner of a link building agency so you can better understand which option is the right one for you: to hire an agency or an in-house link builder.",
  "content": "When (and When Not) to Outsource Link Building Link Building | Marketing Industry By: Alexandra Tachalova December 1, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Alexandra Tachalova December 1, 2020 When (and When Not) to Outsource Link Building Link Building | Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Have you ever outsourced link building? How did you like the experience? To be honest, mine was terrible. Allow me to share my story. When I had a typical 9-to-5 job as a marketing director at SEMrush, we made a decision to get more links from the top resources in our segment. We ended up hiring an agency to help us build these links. The agency was charging us an outrageous $13K a month, but, unfortunately, the high price didn’t equal quality. They weren’t capable of writing anything meaningful, not to mention publishing their content on trustworthy industry blogs. What made things worse was the fact that I brought them on board. Needless to say, we stopped working with this agency. We decided to give another one a try, thinking that this time luck would be on our side. Well, we were wrong. Although the second agency charged us nearly three times less and promised premium quality work with superb links and stellar results, the outcome was disappointing, to say the least. We ended up getting links from irrelevant content published on sites that wrote about everything, from the ten best sex positions to the ultimate guide on cleaning your toilet. As ridiculous as it may sound right now, back then, I didn’t feel amused. These two failed attempts at outsourcing link building left me convinced in two things: getting high-quality links is a job to be done internally, and outsourcing is simply pouring money down the drain. Fast forward to now, and I can honestly tell you that my opinion on outsourcing has changed. Since these two unfortunate scenarios with outsourcing, I went from working for SEMrush to being a freelancer, and, when the amount of work started to grow, I launched my own link building agency, Digital Olympus. As I gained more experience in this field, I started to realize why our attempts at outsourcing failed so miserably. At that time, I didn’t know the ropes of link acquisition. We weren’t thinking ahead to establish strict requirements to prevent us from getting links from low-quality sites. Thus, as I went through trial and error, I gathered some unique insights about the pros and cons of link building outsourcing. Today, I’d like to share these insights with you so you can better understand which option is the right one for you — to hire an agency or an in-house link builder. When is outsourcing the right choice for you? Here’s my perspective as the owner of a link building agency. The majority of our clients come to us because they don’t have the time or resources to set up a decent link building process by themselves. Most of the time, their current focus is shifted towards some other business goals, but they still understand the value of links and have some pages that are trying to rank well on Google. Usually, our ideal client knows what kinds of pages they want to boost via links, and they understand how SEO works. In most cases, they have an SEO team that has a lack of resources to step into link building, so they’re looking for someone who could help them get some juicy links. So, at the end of the day, our clients pay for our knowledge and experience. But there are also other reasons why companies may choose to outsource link building to an agency as opposed to hiring an in-house specialist. 1. If hiring an experienced link builder is too expensive The first reason to outsource link building is in the recruitment costs. According to Glassdoor, the average salary of a junior-level link builder is about 30-40K, while those who are extremely experienced will be looking for an estimated yearly salary around 100K USD. As for the hourly rate, the lowest would be $13, while more experienced link building specialists expect you to pay them as high as $16 an hour. Besides salaries, you also need to consider other points. For example, your in-house link building specialist would also need content developed specifically for link building purposes, which should have its own separate budget. Apart from that, to do the job properly, they need to have access to backlink analysis tools, like Ahrefs (costs $99/month), SEMrush (also $99/month), Moz (starting $99/month), and Pitchbox (starting from $300/month). All in all, you’ll have to pay for these tools, which alone will cost around 6K a year. To put a long story short, hiring an in-house link builder will cost you a pretty penny. Moreover, it might take you quite a while to find the in-house link builder you’re looking for. So, while you’re searching for one, you could give an agency a try to get your link building strategy started. 2. If you need to get links straight away The biggest difference between hiring an in-house link builder vs. an agency is the speed of acquiring links. Usually, an agency already has a tried-and-tested link building strategy, while an in-house link builder still has to develop one. In my opinion, this is the biggest reason why our clients are choosing our fellow link building agencies and us. We have a well-established process of building links, but most importantly – we’ve already developed meaningful relationships across particular industries and niches. So, in some cases, it doesn’t take us longer than a few minutes to secure a link. However, if you decide to do link building by yourself, you shouldn’t expect instant results. On average, it takes 3-4 months to start getting at least 10-20 links every month. Besides, it might take you a while to find the right and meaningful way to connect with other sites, and to learn how to pitch your ideas properly. I should say that, even for my agency, it’s always a big issue to open a new niche and start building a decent number of links per month. The first few months are resulting in 2-4 links, and that for sure can’t be described as a decent flow of links. 3. If you need help educating your team on how to build links the right way The exchange of knowledge and experience is another reason to outsource link building. It’s definitely why I outsource some tasks, and work closely with those who have substantial expertise in the areas where I don’t feel as confident. Paying for knowledge is an excellent way to spend money, especially if you lack time. For example, I understand how long it would take me to learn before I could do technical SEO myself, so I’d rather hire someone to help me with that instead. And, while we’re working together, I’ll take this opportunity to enhance my knowledge as well. For this exact reason, we have a few contractors on our team who are working on other projects, but gladly share their unique strategies and approaches with us. It’s like a breath of fresh air – their experience gives us new perspectives on building high-quality links. By the way, if you decide to hire an in-house link builder, it might take them quite some time to learn how to work with such contractors, while a link building agency would already have well-established relationships with them. So, with all that said, try to perceive outsourcing as a learning opportunity. If you already have some experience in link building, you don’t necessarily need to ask an agency to educate you. Instead, you can follow their strategy if you see that it’s working. We have a few clients who follow this logic, as they do link building in-house while still being under our guidance. Sure, one day, they might start building links independently, but it feels nice that we paved that path for them. 4. If you want links that would take you ages to acquire by yourself Again, it’s all about the connections and how well you can build relationships with them. If you don’t have a tight circle of partners, you can’t expect quick results from your link building efforts. Usually, the best link building agencies already have a great network of partners. However, it’s still very important to double-check that an agency operates within your niche and has some meaningful connections. But even if the agency hasn’t worked in your niche before, don’t give up on it just yet. Most likely, the agency might still be able to network faster due to existing relationships with partners and word-of-mouth power. Still, even for an experienced agency, developing the network of connections in a new and unexplored field will take some time. We’re always very transparent when it comes to telling a client that we haven’t yet worked within their industry, but some clients are ready to wait. However, your needs might be different, so always bring up this question to avoid misunderstandings. 5. If you need to scale your current link building efforts Sometimes brands realize that link building can be a good strategy for them, but they might not fully understand how to approach it, considering the specifics of their industry and niche. If this is your case, the agency will help you select the right angle and review your current link building needs objectively. Another pain point that makes our clients ask for our help is building links to problematic targets. Some pages — commercial ones, for example — are hard to build links to in an organic way. In my recent blog post, I talked more on the topic of building links to commercial pages and a few examples of how it can be done. But if you struggle with acquiring links to some pages, you can outsource this task to an agency, which will find the right way to address these difficulties and tackle them. When outsourcing isn’t your best option As someone who went through an unpleasant experience with outsourcing, I should say that you really have to know what you need when hiring an agency. This might be the first and most crucial reason not to outsource link building – you should know what to expect. However, there are also other situations when outsourcing link building will be a waste of time and money. Let’s take a look. 1. You’re looking for digital PR and consider it link building Over the years, I’ve met a lot of potential clients who ask for articles on leading sites in their industry just for the sake of having their brand mentioned by a popular resource. While getting links from such websites would be good for your brand image, this is a task for PR. Here’s the thing: Links acquired from such resources are usually very weak from an SEO standpoint. Besides, there are cases when guest contributors sell links from these sites. In one of them, a well-known writer who worked for Forbes and Entrepreneur sold links under the radar, which is forbidden by Google’s guidelines. As a result, links to such websites rarely bring any benefit, because they don’t carry the SEO value we are usually looking for. From an SEO standpoint, the best links come from websites that are not involved in such suspicious activities. In addition, don’t be quick to trust influencers, since they often sell links on their websites as well. Instead, try to find a website that doesn’t have guest posts. Google typically favors guest posting, while pushing the websites which are only used for link building to the bottom of search results. 2. You don’t have a solid SEO strategy and you just want to build some links Many clients don’t understand that link building and SEO are interconnected. When it comes to link building, you need to remember that the results only come if you make links to the right pages from an SEO standpoint. What does that mean? Such pages should target the right keywords relevant to your business, and that don’t have an insane level of competition. Also, content that is allocated on those pages should match user intent. Just for context, it takes 10 times more time to get a page with commercial intent to the top of Google results, especially if the top 10 have informational intent. Ideally, you should understand how many links you need in order to close the current link gap; otherwise, it might take ages for your page to rank well on Google. By analyzing what kind of links your rivals have already built, you can set up the right requirements for your link building agency. 3. You have very strict requirements and an agency can’t hit that mark Sometimes, clients underestimate their link building needs. But other times, their expectations can be way too high, and it turns into a real problem. Let me give you some examples. Once, we had a client that wanted us to implement a whole new link building approach just for his campaign. Everything should have gone great, except he forgot to tell us that he would need a unique approach, and what we were capable of providing at that time wasn’t what he was interested in. Naturally, our partnership ended on that note. We decided to return the funds to this client and move forward. Now we do an in-depth interview with every client to give them a very detailed overview of our link building approach and our capabilities. The same problem can occur in a few other cases: You want links that will be allocated only in particular content. Ask the agency if it gets links through guest blogging. If not, this is not the best option for you. You have a list of sites from which you want to get links. Contrary to what you might expect, link building isn’t an exact science, and it’s hard to predict or guarantee that a link will be secured on a particular site. You want links only on pages that have already built a solid number of links and are already ranking well on Google. That’s a smart strategy, but it should only be done internally, since getting a link on such a page might take ages. So, as I mentioned before, ask the agency about its capabilities before you outsource link building. It would be fair for both sides if you and the agency have clear expectations of the final result. 4. You expect to receive referral traffic from links that an agency will be building for you Unfortunately, there’s minimal chance that referral traffic will come. Digital marketing experts confirm that there’s a very slim chance that even guest blogging on leading sites will bring you a solid flow of referral visitors. Nowadays, steady referral traffic only comes through sources of organic traffic. A good example is this article with a list of SEO tools by Brian Dean that receives over 7K organic visitors per month: Certainly, tools listed in Brian’s post are all getting some traffic, too, as those visitors are browsing through them and would love to learn more about them. In general, we rarely see that our clients are getting referral traffic. Getting a good link is one scenario, but getting a good link that will send referral traffic is a whole other story. In my opinion, building the links that will most likely send you a solid flow of referral visitors requires an analysis of current sources of referral traffic to your competitors and industry leaders. Then, you must try to understand the reason behind this traffic, whether it’s an active audience, being featured in a newsletter, etc. But the entire process differs from the link building strategy we usually follow. 5. You’re too busy to communicate your feedback to the agency If you expect the link building agency to deliver the results you expect, communication is key. Outsourcing is not about delegating the task and forgetting about it. It’s about close collaboration. With that said, be prepared to have to go on a number of calls with an agency just to figure out the link building strategy you will follow, not to mention other related meetings that will occur in the process. It is especially important if your link building needs are very specific. So, let me reiterate – ongoing communication is crucial for building juicy, high-quality links. If you don’t have time to talk with the agency and articulate your needs and expectations properly, outsourcing link building is not the right option for you. 6. You don’t have a sufficient budget If you are planning to hire an agency to outsource link building, you should evaluate your financial situation first, because it will cost you a fair amount of money. To give you some context, we only take long-term contracts starting from $10K because one-time partnerships don’t help bring permanent link building results. In general, the entire process of building links should be ongoing, and your website should continuously show a rising link growth graph: So, no matter how hard you try, the lack of a systematic approach to link building means no tangible results, and the client won’t get any profit from these links. That’s what made me understand that single-time link building is a waste of time and money. What’s the verdict? All in all, I should say that hiring a link building agency is worth every penny, as long as it has the experience you’re looking for, of course. Just from the rational standpoint, it’s much harder and more cost-intensive to do link building by yourself, especially if you have little knowledge of it. There are also other perks of outsourcing link building. First and foremost, when you’re hiring an agency to build links, you’re paying for the speed of acquiring links. An agency already has all the connections to get links faster, in addition to a well-established process of building links in general. Nevertheless, evaluate your needs first. Outsourcing might not be the best option for you if you are more interested in PR, not link building. You might also want to check what the agency can offer, as your requirements might not fit its profile. And, of course, outsourcing is not an option if you don’t have time to communicate with an agency or you have insufficient funds for such partnership. However, in general, if you ask me now if outsourcing is worth it, I would say yes, but only if you are committed. Remember, outsourcing link building to an agency shouldn’t be a one-time occasion. If you want ongoing results, you need to commit to a long-term, close cooperation. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "When (and When Not) to Outsource Link Building"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "When (and When Not) to Outsource Link Building"
    },
    {
      "level": "H2",
      "text": "When is outsourcing the right choice for you?"
    },
    {
      "level": "H3",
      "text": "1. If hiring an experienced link builder is too expensive"
    },
    {
      "level": "H3",
      "text": "2. If you need to get links straight away"
    },
    {
      "level": "H3",
      "text": "3. If you need help educating your team on how to build links the right way"
    },
    {
      "level": "H3",
      "text": "4. If you want links that would take you ages to acquire by yourself"
    },
    {
      "level": "H3",
      "text": "5. If you need to scale your current link building efforts"
    },
    {
      "level": "H2",
      "text": "When outsourcing isn’t your best option"
    },
    {
      "level": "H3",
      "text": "1. You’re looking for digital PR and consider it link building"
    },
    {
      "level": "H3",
      "text": "2. You don’t have a solid SEO strategy and you just want to build some links"
    },
    {
      "level": "H3",
      "text": "3. You have very strict requirements and an agency can’t hit that mark"
    },
    {
      "level": "H3",
      "text": "4. You expect to receive referral traffic from links that an agency will be building for you"
    },
    {
      "level": "H3",
      "text": "5. You’re too busy to communicate your feedback to the agency"
    },
    {
      "level": "H3",
      "text": "6. You don’t have a sufficient budget"
    },
    {
      "level": "H2",
      "text": "What’s the verdict?"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Alexandra Tachalova\n          \n            Alexandra Tachalova\n          \n            Alexandra Tachalova"
}