{
  "url": "https://moz.com/blog/overcoming-your-fear-of-local-landing-pages",
  "slug": "overcoming-your-fear-of-local-landing-pages",
  "title": "Overcoming Your Fear of Local Landing Pages - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Are you a local SEO feeling unsure of how to handle your client's city landing pages? In today's post, Miriam Ellis offers up a plan of action to address the uncertainty and confusion that commonly surrounds the topic of creating local landing pages.",
  "content": "Overcoming Your Fear of Local Landing Pages Local SEO By: Miriam Ellis March 1, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis March 1, 2016 Overcoming Your Fear of Local Landing Pages Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. [Estimated read time: 12 minutes] When tasked with developing a set of city landing pages for your local business clients, do you experience any of the following: brain fog, dry mouth, sweaty palms, procrastination, woolgathering, or ennui? Then chances are, the diagnosis is a fear of local landing pages. But don’t worry! Confusion and concern over this common challenge have made it an FAQ in the local column of the Moz Q&A forum, and my goal here is to give you a prescription for meeting these projects with confidence, creativity, and even genuine enjoyment! Up ahead: a definition, a \"don't\" list, a plan of action, and a landing page mockup. Quick definition: What’s a local landing page? Local landing pages (aka city landing pages) are pages you create on a website to highlight a geographic aspect of a business for its customers. Local landing pages are most appropriate for: Service area businesses (SABs) that need to publicize the fact that they serve a variety of cities surrounding the city in which they are physically located. In this scenario, the goal of most local landing pages is to gain organic rankings for these service cities, as they're unlikely to earn local pack rankings unless there is minimal geographic competition for the services offered. Multi-location brick-and-mortar businesses that need to publicize the fact that they have more than one forward-facing office. In this scenario, the goal will often be to get multiple offices ranking in the local packs by linking from the Google My Business listing for each office to its respective local landing page on the company’s website. You may also achieve organic visibility, as well, depending on the competition. Diminish your fear by knowing what to avoid Knowledge is power. By avoiding these common pitfalls, you’ll feel confident knowing that you’re developing a new set of pages that will help your client’s website, rather than harming it. 1. Do not publish fake addresses on local landing pages. Tell clients that PO Boxes and virtual offices are considered ineligible in Google’s guidelines, so it’s not a good idea to use them on the website in an attempt to appear more local. Be especially cautious here if your client is an SAB and gives you a string of addresses. Of course, an SAB can have multiple legitimate locations (like a pizza delivery chain) but if it’s a small business, your due diligence is required to make absolutely sure the addresses are legitimate and do not represent your client’s brother’s house, aunt’s house, friend’s house, etc. Look the addresses up via Google Streetview. Do you see residences, or even empty lots? Red flag! Let such clients know that Google can read street-level signage and doesn’t take kindly to falsified address information. Google understands that SABs may operate out of a single home, but operating out a string of homes may look (and be!) spammy. 2. Do not engage in creating local landing pages for clients who lack a reasonable amount of time to discuss their business with you. A minimum requirement is that they can have a phone session with you for each city you’re going to cover, but a much better hope lies with clients who are willing to make an active contribution to the project. *More on this later. 3. Do not engage in creating local landing pages if you don’t have enough information about the business to avoid creating thin or duplicate content. This is related to point 2. Writing a paragraph and swapping out the city names on a set of pages is not a good plan, and you’ll encounter this lazy scenario on countless local business websites. Don’t be tempted to go this route just because your client’s competitors are getting away with it. Properly view them as weak competitors whom you can surpass with a superior effort. 4. Do not create city landing pages if no one involved in the project (including yourself) can discover a genuine reason (apart from a desire to rank) to differentiate cities and services from one another. Don’t create these pages unless you can honestly say that you believe they will be useful and interesting to the company’s customers. *Suggestions for inspiration to follow. 5. Do not stuff local landing pages with blocks of city names, zip codes, or keywords. Google’s Webmaster guidelines specifically state that they do not like this. 6. Beware call tracking numbers. If your client wants to use call tracking numbers, be sure you fully understand the risks and options. 7. Do not bury your local landings pages somewhere deep within the architecture of the website. Link to them from a high-level menu. 8. Finally, do not build an unreasonable number of landing pages. At some point in your work as a local SEO, you will be contacted by a company that serves most or all of a state, or multiple states. They will say, “Our goal is to rank for every single town and city in our service area.” If your client serves California, there are some 500 incorporated cities in the state, not to mention thousands of tiny towns. Can you honestly build thousands of unique, high-quality pages? With enough funding and a large staff of copywriters, this might be possible, but it’s going to be the exception rather than the rule for small-to-medium local businesses. It’s generally more reasonable to have the client designate their most important cities and target these first. Then, if need be, move on from there, provided that you can avoid all 7 of the above pitfalls in creating further landing pages. Recommending PPC for more minute coverage may be a wiser alternative to prevent website quality from suffering. Sigh of relief! Now that you know the major errors to avoid, you can move forward with the landing page development project feeling confident that your work is going to help your client, rather than harming them. Gather that tension up into a ball and cast it away! Jump-start landing page inspiration with tools, talk and action Here’s a ready-made process for generating ideas for the content you’re going to be developing. I’m going to make the assumption that you’ve already had your client fill out some sort of questionnaire prior to taking them on. This questionnaire may have been really detailed, or kind of generic. If it missed geo-specific questions, the following process will help you glean the initial information you need from the business owner. 1. Ask your client (more) questions By now, you’ve assessed that your client is willing to be engaged in the landing page process. Now, either create a second questionnaire, or, if preferable for both of you, get on the phone and cover all of the following: Every service offered Every major city/town served Most typical type of client Most typical client requests/needs/questions Services, tips, or advice that are unique to each city (such as different requirements based on laws, weather, terrain, style, precautions, codes, etc) Types of satisfaction guarantees offered Specials offered Why the business is better than its competitors Who those competitors are Participation in or support of local events, teams and organizations *As you take notes, be sure you’re jotting down not just what your client says, but how they say it. Language matters, not only as a means of learning the lingo of your client’s industry, but in discovering whether corporate lingo actually matches customer speech. 2. Assess their local landing pages From your notes from conversation #1, you’re ready to first pay a virtual call to the websites of every major local competitor your client mentioned. Assess their local landing pages, if they have them, for content quality, usability, and usefulness. There’s a good chance that you'll see lazy efforts that you can surpass with your own work. Take notes about what you like and don’t like in the competitors’ landing pages. Note, too, what keywords they're targeting. 3. Transform your notes into content Now, it’s time to take your notes and turn them into: Unique, introductory text regarding the client’s services in each city At least one unique customer question and owner answer per page Specific advice/tips for that city that are unique to that city 4. Discover common questions and find their answers Next, let’s fire up a really awesome tool to start generating additional topics. Hat tip to Linda Buquet who first alerted me to AnswerThePublic.com, a free tool that enables you to type in a keyword and generate the best list of related questions I’ve ever seen. It’s available in 5 countries, and even a simple search like \"house painting\" turns up 24 questions you can sort through to discover what types of queries people are commonly making about your client’s business model. Return to the business owner for expert answers. Bingo! By now, you’ve got some very useful content already taking shape to help differentiate one landing page from another. I also like combing through Google’s \"related searches\" at the bottom of SERPs for further ideas. 5. Incorporate appropriate visuals Now we turn to the visual documentation of your client’s business. Have them equip a designated staff member with a camera, either to take before-and-after photos of projects or to do a full video documentary of a minimum of 1–3 projects per city. If your client’s industry isn’t of exceptional visual interest (plumbing, HVAC, accounting) a modest visual documentation, accompanied by a text transcript, should be sufficient to give customers a good idea of what it would be like to work with the business. If your client’s industry is highly visual (landscaping, architecture, home staging), the more you can show off their best work, the better. For the sake of authenticity, be sure that photo labeling and tagging are specific to the target city and that video narratives mention the target city. While you’re shooting footage, consider getting 1–3 video testimonials in each city from very happy clients and write transcripts. If competition isn’t stiff, even a single video testimonial can set the business apart. In tougher markets, go to extra effort with this step. An alternative (or addition) to video testimonials is use of an on-page traditional review app. And don’t forget that brick-and-mortar businesses can link to their various profiles on third-party review sites (Yelp, Google, etc). Have widely recognized customers? Get their permission to brag about it! For example: “We clean the carpets at every branch of Bank of America in San Diego,” “We designed the Transamerica building in San Francisco,” or “We groomed the Pomeranian who won Best in Class at the Boston Dog Show.” Be city-specific with this content. Consider the usefulness of interviewing staff who either operate each brick-and-mortar office or who travel to serve the SAB's customers. A short, welcoming video that displays professionalism, approachability, and company ideals can help customers feel comfortable even before a transaction occurs. If there is an element of the business that changes from location to location (brick-and-mortar) or from city to city (SAB), be sure you are aware of this and describing this on the page. Some examples would be a class schedule for a yoga studio that's unique to each location, or a landscaping company’s recommended schedule of yard cleaning at high elevations versus valley floor locations. This content should be highly visible on the page, as it’s highly relevant to city-specific user groups. Finally, think back to your assessment of your client’s competitors. Is there something they weren’t doing and that isn’t mentioned above that your client’s business inspires you to showcase? Maybe it’s something funny, extra persuasive, or extra local in flavor that would help your client stand out as particularly individualistic. Don’t hesitate to go beyond my basic suggestions to provide a creative edge for your client. Pulling it all together Fear is now a thing of the past. While you may be a bit buried under a heap of notebooks, spreadsheets, and docs, you’ve gathered both confidence and a wealth of resources for getting these local landing pages built. Whether you’re working with the owner’s webmaster or are implementing the development yourself, I hope the following basic mockup will help you get organized. *I’m using an SAB for my example — a fictitious house painter who is targeting the town of Mendocino, California as part of his service area. If your landing pages are for a multi-location brick-and-mortar business, be certain that the very first thing on the page is the complete name, address and phone number of the respective location, preferably in Schema. Click the image for a larger version in a new tab. Key to the mockup This section covers your introductory text — including a basic description of what the company does — plus geographic-specific advice, satisfaction guarantee information, and a mention of well-known clients served. Here is a vertical section featuring 3 project showcase videos + text project summaries. The reviews section features an on-page review widget, a request for customers to leave a review, and an invitation to see further reviews on third-party platforms. Here’s where we put our question research to work, with the owner answering questions he says customers frequently ask, plus questions generated by a tool and other research. Here’s an area for extra creativity. We’re featuring a \"Meet the Owner\" video, some relevant local news, and mentioning company support for local entities, including a special deal. While we’ve sprinkled calls-to-action throughout the page, never forget that final CTA in closing up! Speaking of closing up… Your landing pages won’t look exactly like my sample mockup (hopefully they'll be a lot nicer!) but I do hope this exercise has helped you gain confidence in moving fearlessly forward with these projects. I want to stress again the importance of owner involvement in this scenario. Your questionnaires and phone conversations are invaluable, and even if you have to use a crowbar with some clients, the effort truly shows in the authenticity, usefulness, and persuasiveness of the finished product. I did want to take a minute to talk about scale, because this also comes up pretty frequently in our forum. Depending on available funding and creativity, the approach I’ve described is likely scalable for a medium-to-large business with anywhere from two to a few dozen target cities. Once you get beyond that, the project might get out of hand in terms of ROI, but I want to provide a couple of real-world examples. I’ve cited REI before, but I’ll do it again. They operate 143 stores across 36 states, and I continue to be impressed by the effort they’ve made to differentiate their landing pages for each location. An interactive map drills down to pages like this: http://www.rei.com/stores/san-diego.html. They’re not quite as text-intensive as my mockup, but the inclusion of a schedule of interesting local events makes these pages feel cared-for and worth visiting. If you’re operating at a similar scale, like Orchard Supply Hardware with 91 stores, and don’t feel you can or should make the investment in landing pages, you’ll likely end up going with something like a city/zip code search that shows store NAP in a given radius. Granted, this approach is going to be lacking in SEO opportunities, but if your brand is big enough and your competition isn’t too tough, it’s an option. Do you have any other good ideas for making your local landing pages valuable? Please share them with the community! Learn More:• Duplicate Content | SEO Best Practices Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Overcoming Your Fear of Local Landing Pages"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Overcoming Your Fear of Local Landing Pages"
    },
    {
      "level": "H2",
      "text": "Quick definition: What’s a local landing page?"
    },
    {
      "level": "H2",
      "text": "Diminish your fear by knowing what to avoid"
    },
    {
      "level": "H4",
      "text": "1. Do not publish fake addresses on local landing pages."
    },
    {
      "level": "H4",
      "text": "2. Do not engage in creating local landing pages for clients who lack a reasonable amount of time to discuss their business with you."
    },
    {
      "level": "H4",
      "text": "3. Do not engage in creating local landing pages if you don’t have enough information about the business to avoid creating thin or duplicate content."
    },
    {
      "level": "H4",
      "text": "4. Do not create city landing pages if no one involved in the project (including yourself) can discover a genuine reason (apart from a desire to rank) to differentiate cities and services from one another."
    },
    {
      "level": "H4",
      "text": "5. Do not stuff local landing pages with blocks of city names, zip codes, or keywords."
    },
    {
      "level": "H4",
      "text": "6. Beware call tracking numbers."
    },
    {
      "level": "H4",
      "text": "7. Do not bury your local landings pages somewhere deep within the architecture of the website."
    },
    {
      "level": "H4",
      "text": "8. Finally, do not build an unreasonable number of landing pages."
    },
    {
      "level": "H2",
      "text": "Jump-start landing page inspiration with tools, talk and action"
    },
    {
      "level": "H3",
      "text": "1. Ask your client (more) questions"
    },
    {
      "level": "H3",
      "text": "2. Assess their local landing pages"
    },
    {
      "level": "H3",
      "text": "3. Transform your notes into content"
    },
    {
      "level": "H3",
      "text": "4. Discover common questions and find their answers"
    },
    {
      "level": "H3",
      "text": "5. Incorporate appropriate visuals"
    },
    {
      "level": "H2",
      "text": "Pulling it all together"
    },
    {
      "level": "H3",
      "text": "Key to the mockup"
    },
    {
      "level": "H2",
      "text": "Speaking of closing up…"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}