{
  "url": "https://moz.com/blog/overture-bid-tool-gone",
  "slug": "overture-bid-tool-gone",
  "title": "Overture Bid Tool Gone - Know a Good Alternative? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It appears that the overture bid tool is finally gone (for real this time).   The information from this tool is used in our own Keyword Difficulty Tool, so now I'm looking for an alternate source of similar data.  Previously the overture bids accounted for around 12% of your keywor...",
  "content": "Overture Bid Tool Gone - Know a Good Alternative? SEO Tools O By: Oatmeal February 8, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! O By: Oatmeal February 8, 2007 Overture Bid Tool Gone - Know a Good Alternative? SEO Tools The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. It appears that the overture bid tool is finally gone (for real this time). The information from this tool is used in our own Keyword Difficulty Tool, so now I'm looking for an alternate source of similar data. Previously the overture bids accounted for around 12% of your keyword difficulty score, so having it removed is temporarily lowering all the scores until I get it fixed. Does anyone know of a good tool for estimating search volume? I don't spend a lot of time in the SEO trenches so I figured asking our community for input would be the best route. In the interim I am considering simply upping the weight of the page strength scores in the keyword difficulty formula. Running a keyword difficulty report looks at the top 10 ranking sites at Google and Yahoo! and calculates a page strength score for each. It then calculates the average page strength score and uses that as part of the formula for determining how difficult it is to rank for your target term. The average page strength scores account for around 33% of the total keyword difficulty score. With the page strength tool becoming more reliable since the new site launched, I think simply upping the weight of these scores to around 45% would make up for the loss of the over bid tool data. Again, this is an interim solution, ultimately I'd like to find a better factor for estimating search volume. Also, I heard a rumor that the Overture keyword selector tool might be going away as well? Any merit to this? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Overture Bid Tool Gone - Know a Good Alternative?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Overture Bid Tool Gone - Know a Good Alternative?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Oatmeal\n          \n            Oatmeal"
}