{
  "url": "https://moz.com/blog/overcoming-client-objections-whiteboard-friday",
  "slug": "overcoming-client-objections-whiteboard-friday",
  "title": "Overcoming Client Objections - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Finding ways to deal with a client's objections requires both empathy and diplomacy. In today's Whiteboard Friday, Brittan Bright guides us through some common objections and how we can best resolve them.",
  "content": "Overcoming Client Objections Whiteboard Friday By: Brittan Bright August 16, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Brittan Bright August 16, 2013 Overcoming Client Objections Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Whether the objection is over a line in your contract or an aspect of your process, when a client's thinking doesn't align with your own, moving projects forward can be difficult or impossible. In today's Whiteboard Friday, Brittan Bright shares her insight into some of the most common objections, along with recommendations for how to get things back on track. For reference, here's a still image of this week's whiteboard: Video Transcription Hi, everyone. Welcome to Whiteboard Friday. My name is Brittan Bright. I'm the director of client strategy at iAcquire. Today we're going to be talking about overcoming client objections. So my role is to work directly with clients. For SEOs, sometimes this can be challenging, and depending on how your organization determines how they're going to service clients, these skills are helpful at every level of an organization. Some common objections we have over here are things I'd like to cover today. I also have a checklist of how you can think through the thought process of how to effectively overcome some of these objections or find a way to compromise with them. One of them is, commonly, our clients are going to object to our contract. Sometimes it's during the negotiation phase. Sometimes you get a new point of contact at an organization that might review the contract and interpret it differently. Sometimes there are stipulations that are mandated by one company or another that they can't agree to. So oftentimes, a contract can be a point of contention with the clients at any stage in the relationship. Objections to recommendations. Not everybody thinks that every recommendation we make as a service provider is always going to be as brilliant as we think it is, or be able to actually implement the recommendations in the full way that we intend them to be. We have to be prepared to understand and speak to any objections that we encounter when it comes to the recommendations that we make for our clients. Our business model. This is an interesting one. I've seen a lot of conversations about this in the blogs and on Twitter, but it's challenging because everybody is kind of trying to figure out the best way to service clients. Different people have approached it in a variety of ways. Sometimes clients have a preference. Sometimes clients just want what they want, and it really depends. You have to be able to speak to your business model and overcome that when it becomes a challenge and in a relationship with a client, as well. To your process. This is an interesting one. It depends, again, on your point of contact and who you're working with at an organization, but there are times that you may have your process questioned. There may be a client that is particularly interested in a specific tactic being done a specific way. There are many times we are having to defend and sometimes explain our process, and I think there are some really productive ways that we can get around that. Then also your staff. Not everyone likes the people that have been assigned to their account. Not everyone is able to work effectively. Not everyone is able to understand personalities. So that is something that we have to be prepared to do, is understand how we can overcome objections to the staff that has been assigned to a specific account. I have several different ways that we can look at this, because as we all know, there is not just one answer to this. It's very customized to the particular client, to your organization, to the situation, and to the project. So instead of telling you exactly what to do, I think it's helpful to understand a good way to think through some of these issues. So I put together a checklist of things I like to go through in my mind as I'm advising my team on how to overcome some of these challenges when we encounter them. Understanding the objection. That's really, really important and often not thought about. Sometimes a client might come back and say, \"Hey, I don't like the terms of this contract,\" and provide a different solution like, \"I want a 30-day out,\" or, \"I want to be able to approve every single thing that you do before I see it,\" just something that will throw off the process. Instead of reacting to the actual thing that the client says, we need to make sure that we understand the root of that issue. Is it because they have quality concerns? Is there another way that we can overcome that? Is there something we didn't do in the sales process that left them feeling a little unsure and wanting a little bit more of the process in their control? Is a 30-day out something standard across their organization? Is there another way that we could compromise with that and understand what needs to be achieved in order to get buy-in from possibly someone higher up, who determines whether or not a contract is approved? So understanding what the objection is and what's behind it is often more important than just immediately reacting to what the objection is at first. One solution to contract objections that I thought I'd share, that is pretty simple, is sometimes using their contract. Now, obviously that's not ideal, but there are some organizations that have very, very strict contracts, and we all know what it's like to get held up in legal, or their industries are very particular. If it's something that your organization allows you to do, sometimes using their contract is a way to show that you're taking a few steps toward the direction of really compromising and resolving the issue with the client, and can be very much appreciated and realized by creating a better relationship through the length of the engagement with the client. Understanding the objection goes both ways too. So if you're a client and you have an objection to something that your service provider is doing, it is in your best interest to make sure that your objection is understood to who you're working with. Like I said, if your issue is with the contract, instead of necessarily kind of coming up with a solution, try to make sure that the person you're negotiating with understands where you're coming from, because they might have a creative solution that they've done for another client in the past that they can then do for you. Put yourself in the objector's shoes. Empathy is key. I always think this one is very obvious, but I'm told that it's not. This is something that's really, really important when it comes to working with other people. The reason you've been hired, or the reason you're hiring someone, is to help you succeed. That can be a very personal thing. It determines how people perform. It determines how people are reviewed in their jobs. It's a very, very personal thing. So putting yourself in someone shoes will help you understand some of the feedback you're getting on some of these. Maybe someone rejected your recommendation because it was completely the opposite of something that they, themselves, had championed before bringing you on board. Understanding that you might be coming in and, unbeknownst to you, possibly destroying some of the work or negating some of the work that the person you're now working directly with had put into place, and the sort of emotions and feelings behind that, might help you approach rephrasing your recommendation in another way. Also, some internal road blocks, understanding how challenging and frustrating it might be to know what the right thing is to do and not be able to do it. Be creative. This is a huge, huge thing. Really, really talented SEOs have the ability to apply an artistry to the science that is SEO. Having the ability to be creative with your recommendations, to make sure that there are things that your client can implement, is extremely powerful, and it will get you a long-term client. Do unto others, the golden rule. Again, something that seems pretty obvious, but it can be easy to forget when we get caught up in the passion and the frustration of the way we pour our heart and souls into the work that we do, especially when we feel misunderstood or maybe under-appreciated by the client. For example, if someone doesn't like your business model, if someone would rather speak to one of the consultants that's working on their project, instead of maybe their account manager, or maybe somebody wants to speak to someone more senior than the person they've been assigned to, there are a lot of different ways that accounts are serviced, and that is a tough decision to make as an organization. So something that I like to point out is to know that the sales process never ends. If somebody doesn't understand your business model, then that could be part of the challenge. So never forget that you need to stay on your toes with your clients. You always need to help them understand why they're working with you, why we're doing everything we can to make them be successful, and don't forget to be on your best behavior and pull out all the stops. You know, don't get lazy just because you have a client already locked down. This will help them get a better appreciation for things like the way you choose to run your business. Compromise when you can. That's really, really important. Sometimes we just have to compromise. We can't draw a hard line in the sand. I think this is really, really hard for some people, particularly when it might seem very clear cut from a technical perspective. For example, with your process, I know that we have that challenge sometimes internally, when we're doing creative things. For example, if we're creating a infographic for a client, and the client might have a different vision, and sometimes we need to really take that vision into consideration and understand why it's important to them, what we can do on our end, even if it might be outside of what we would typically recommend. If it's something that goes more towards the goals that the client has laid out for us, sometimes we might just have to do a little compromising. But in this, trust is essential. So when your process needs to be compromised, make sure it's happening, not to appease a client, but because the client trusts you and you trust the client. You trust that the client knows that you're going outside of your process, and this might mean sacrifices in other areas, and the client will be less likely to challenge your process if they trust that you have their best interests at heart and that you understand their business. So trust is really, really important when overcoming this particular objection. Then don't compromise when you shouldn't. This is very, very, very important, and also something that's very difficult. Sometimes you do have to draw a line in the sand. Sometimes you do have to say no. Sometimes you do have to walk away, because respect is very, very important. I'm going to use this as it relates to your staff, but again, everything on this checklist can apply to all of these objections. When it relates to your staff, you might have a client who doesn't treat one of your staff members very well. I don't like to compromise in that situation. Now if it's a situation where someone on my team has dropped the ball or has done something disrespectful, which hasn't happened, under my watch at least, I believe and I support my team, and I think that's really, really important. If you support and you invest in your team and that's visible to the client, then there are times when you shouldn't compromise, and you should hold your ground, because respect on a mutual level for your client, and the work they do, and for them to have that for you, creates a much better foundation for a long-lasting client relationship. So that's all I have for today. Thank you so much. I look forward to seeing all of you at MozCon. I will be speaking there, and I hope to meet some of you in person. Thanks. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Overcoming Client Objections"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Overcoming Client Objections"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Brittan Bright\n          \n            Brittan Bright"
}