{
  "url": "https://moz.com/blog/overheard-at-ses-london",
  "slug": "overheard-at-ses-london",
  "title": "Overheard at SES London - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Much like how I shared The Best Things I Overheard at SES Chicago, I thought I'd enlighten the readers with the best, funniest, most outrageous, or downright random things said and heard at SES London:\n\n\n    “What dialect did he speak?”--Rand, asking about an unintelligible Brit t...",
  "content": "Overheard at SES London SEO Events By: Rebecca Kelley February 17, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley February 17, 2007 Overheard at SES London SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Much like how I shared The Best Things I Overheard at SES Chicago, I thought I'd enlighten the readers with the best, funniest, most outrageous, or downright random things said and heard at SES London: “What dialect did he speak?”--Rand, asking about an unintelligible Brit that Scott and I had met at the bar the night before “I don't know, mud?”--Scott “Dave Naylor is like an idiot savant! He's an obnoxious drunk in the evenings, but when he's on a panel he's a genius!”--me “Oh my God, he's like my Rainman!”--Greg Boser “...and I had to use the toilet so bad. My bladder was so tight you could bounce a pea off it.”--Dave Naylor, in reference to his plight in finding a bathroom in time “Woof, that's awful!”--Scott, after tasting the hotel bartender's attempt at making a Long Island Iced Tea (in a discussion about how Frank went gambling the night before) “Did you win?”--Alex Bennert “Yeah, I took home about 300 pounds.”--Frank Watson “Oh, is that how much she weighed?”--me “Well, I'm not that caring a father. A real caring father would have given his son the whole pasty.”--Danny, after I told him how impressed my coworkers were when I told them how he split half of his pasty with his hungry son during my visit to Salisbury. “Quick, take a picture!”--Frank, as Allan Dick is choking during dinner. “I'm not putting that in my comics!”--me “Wow, these mussels are really big!”--Scott, as we're eating dinner at a Thai restaurant. “Like these muscles?”--Rand, flexing his bicep “Are you jealous that your boss was on CNN?”--Frank “Nah. If I wanted to be on CNN, I could just go on a killing spree...which, after a few more sleepless nights, I might end up doing.”--me “Dave Naylor just said that guy was a sleazebag! You need to take that guy's picture!”--an incredulous Rand to me “Who, the guy with the EuroMullet?”--Scott “...and then Greg starts screaming, 'Hey, are you accusing my wife of cheating?!' And it was so nice of him to stick up for me! I was cheating, by the way.”--Barbara Boser describing her experience being thrown out of a London casino (in her defense, she didn't know her actions constituted cheating). “You should come and visit our office. We can get drunk, turn on the video camera, and have a roundtable discussion about Wikipedia.”--Greg, teasing us about our video. “Damn it, you just cost me 3.5 million!”--Barbara to Elisabeth Osmeloski after Elisabeth pulled Greg back from the path of an oncoming train. “I need to blow my nose.”--me “What? You want eggs?”--Scott, practicing his famous \"selective hearing\" “Yeah, that's exactly what I said.”--me (as Enrique Iglesias's song “Hero” is playing on the karaoke screen at a Chinese restaurant) “Come on, Scott, sing some Enrique Iglesias!”--me “Hold on, I need to stick a piece of chorizo on my face first.”--Scott “Don't they have a song in a language that we can read?”--Scott, complaining about the Chinese karaoke \"I tried to take out a bunch of money at the ATM, and the machine told me 'Your request is indecent.'\"--a confused Becky Ryan \"Ugh, this idea seemed really easy when I was drunk at the bar last night.\"--Greg, as we're sitting on the EuroStar on our way to Paris. \"Wait, it's a 3 1/2 hour ride? I thought it was 2 1/2 hours.\"--Barb, confused about the length of time it takes to get to Paris. \"Don't think about it too much, because if you'll do you'll start to realize how stupid this idea was.\"--Greg \"I got yelled at for sleeping with my head on the tray. The lady said it was unsanitary to sleep like that.\"--Dax, complaining about getting yelled at during a flight. \"Who yelled at you?\"--me \"I dunno...that lady...who brings drinks...\"--Dax \"You mean the stewardess?\"--me \"Yeah, whatever.\"--Dax (he's clearly tired) \"Paris subways must be filled with morlocks.\"--Scott, observing the dinginess of the Parisian subway system. \"You should have put it in your mouth.\"--Barb, after Greg couldn't find his contact lens solution and needed to clean his contact. \"I did, and it was awful.\"--a disgusted Greg. \"I am so tired. I feel like a shark--if I stop moving, I'll die.\"--Scott \"This elevator looks like Willy Wonka's great glass elevator if his chocolate factory were in Compton.\"--me, as we're standing in a filthy glass elevator in Paris's train station. \"Bye! I'll see you at the next conference...unless you get fired...in which case (looks around at the roomful of SEOs who would probably hire us), I'll see you at the next conference!\"--Elisabeth. That's all my groggy brain can remember. As before, share any other gems in the comments. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Overheard at SES London"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Overheard at SES London"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}