{
  "url": "https://moz.com/blog/overcome-the-google-analytics-learning-curve-in-20-minutes",
  "slug": "overcome-the-google-analytics-learning-curve-in-20-minutes",
  "title": "Overcome the Google Analytics Learning Curve in 20 Minutes - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As recently as a month ago I was a victim of a state of mind I call Analytics Dismissal Disorder. This mindset is common after hearing about the importance of analytics, installing the tracking code and then getting overwhelmed by all of the graphs and scary numbers. When I suffered from analytics…",
  "content": "Overcome the Google Analytics Learning Curve in 20 Minutes SEO Analytics By: Danny Dover May 26, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Danny Dover May 26, 2010 Overcome the Google Analytics Learning Curve in 20 Minutes SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As recently as a month ago I was a victim of a state of mind I call Analytics Dismissal Disorder. This mindset is common after hearing about the importance of analytics, installing the tracking code and then getting overwhelmed by all of the graphs and scary numbers. When I suffered from analytics dismissal disorder (which my doctors called A.D.D. for short), I knew Google Analytics was important but avoided the extra effort necessary to learn how to get the most out of the software. This post explains what I needed to learn to get over this. After learning the basics of Google Analytics, you can learn interesting facts like what search terms people use to find your website. In this case, web searchers are more interested in fat people falling than they are in me. Here is the problem with Google Analytics: It is obviously potentially useful but who has the time to study how to use a product. I don’t even read the text-less IKEA manuals so why would I read documentation for software. Sounds boring. This all changed when SEOmoz offered to pay for me to go to WebShare’s Google Analytics Seminar (Wait, you are paying me to leave the office? Mission Accomplished). This 16 hour class walked me through Google Analytics and pushed me through the massive learning curve. This post distills what I learned in those 16 hours of employer-paid-learning into something you can understand and act on in 20 minutes. Nerd High Five! (*Pushes up glasses*) Overcome the Google Analytics Learning Curve in 20 Minutes: An actionable guide to learning what you need to know about Google Analytics. First Things First: What are Accounts and Profiles and how are they different? When you first log in to Google Analytics you need to navigate to your desired data set. This is much more confusing than it ought to be. Accounts are like folders on a computer. They can contain a lot of different files (profiles) and serve mostly just for organization. An example of an account might be Work Websites or Personal Websites. (Be forewarned, this is not intuitive on setup. Don't make the mistake I did and name an account after a website. That naming convention is more appropriate for a profile). Profiles, on the other hand, are like files on a computer. They can't contain additional profiles or accounts. They represent one view of a website (although not necessarily the only view). An example of a profile might be api.seomoz.org or SEOmoz minus Office IP addresses. You can limit a profile to whatever view of a website you want by using filters. What are Filters and Segments and how are they different? This is also more complicated than it ought to be. (grrr) Filters are attached to website profiles (i.e. \"SEOmoz minus office IP addresses\") and are permanent. If a profile includes traffic data from all IP addresses except SEOmoz's office computers, there is absolutely no way to reinclude this excluded data in the given profile at a later time. Filters are irreversible and kinda mean (thus the anal in Google Analytics). You can set them up on the profiles page. (See Below) Segments are similar to filters except they are profile agnostic and their effects are temporary. In addition, they can be compared against each other. The example segments below shows all visitors (blue line), new visitors (orange line), and returning visitors (green line) and their distribution on the top content of the given website. What are \"raw\" profiles and why use them? (Ctrl+Z won’t save you here) Google Analytics is different from other Google products in that it doesn't provide a way to undo certain types of data processing (i.e. filters). In order to give you freedom to explore (and potentially ruin) your profiles, it is important that you create an unfiltered (raw) profile of your website that you can use in case something goes wrong with one of your other profiles. In SEOmoz's case, this profile is literally called \"Do Not Touch! Backup Profile\". This is the backup profile we will use to get historical data when Joanna Lord screws up our other profiles. (Danny!) What if I don't trust a specific metric? Tough beans! The key to getting the most out of Google Analytics is to trust it. This is very similar to how we measure time. We all know that our bedroom clock is probably not exactly synced with our office clock but we trust each time-peice as close enough. You need to make the same leap of faith for Google Analytics. The metrics might not be 100% accurate all of the time, but like a clock, at least they are consistent. This makes Google Analytics metrics good enough. (And quite frankly it is as accurate as all of its competitors) Navigating Google Analytics: Google Analytics Navigation Dashboard (Mostly Useless High-level Metrics) As you would expect, the dashboard shows you the high-level status of your website. The problem is that these metrics tend not to drastically change very often so if you keep looking at your dashboard, you won't like see any big changes. ZzzzzzzzZZZzzzzz. Real analytics pros don't let friends rely on the default dashboard stats. Intelligence (Automated e-mail alerts) - Check Monthly Intelligence is Google's confusing name for automatic alerts. Did traffic to your homepage jump 1000% over last week? Are visits from New Zealand down 80% from yesterday? Intelligence alerts will, with your permission, e-mail you if anything unexpected happens on your website. Visitors (The type of people that come to your site) - Check Monthly As the name implies, this section reveals information about your visitors. Want to know what percentage of your users have Flash enabled or how many people viewed your website on an iPad? This section will tell you. (Long live Steve Jobs!) Traffic Sources (Where people are coming from to reach your site) - Check Weekly This section shows you different reports on the sources that drove you traffic. Content (Metrics on your pages) - Check Weekly Whereas, Traffic Sources shows you information about other people's pages as they relate to yours, the Content section only shows you information about what happens on your pages. Goals (Metrics on whether or not people are doing what you want them to do) - Check Daily Goals are predefined actions on your website that you want others to perform. It is important to note that you must configure these manually. Google can't auto detect these. This section shows metrics on how people completed these goals or where they dropped off if they didn't complete them. Report Interface: The bread and butter of Google Analytics are the reports. These are the frameworks for learning about how people interact with your website. Graph: The graphs/reports in Google Analytics have 6 important options. The first three are detailed below: Export. This is pretty self explanatory. You can export to PDF, XML, CSV, CSV for Excel or if you are too good for commas you can export to TSV. E-mail. This is one of Google Analytics more useful features. This tab allows you to schedule reoccurring e-mails or one time reports for your co-workers. As an added bonus, if you set up these auto-reports, the recipeients don't even need to log into Google Analytics to access this data. Units (in this case Pageviews). This is a report dependent unit that you can change based on the context. Advanced Segments. This is an extremely powerful feature that allows you to slice and dice your data to your likings. Date Range (in this case, Apr 24 2010 - May 24 2010). Graph By. This feature allows you to choose the scope of the graph in relation to time intervals. For some reports you can even break down data to the hour. Data: Data is your tool to see specifics and and make quantifiable decisions. Views. This feature actually affects the graphs and the data. It dictates the type of graph or the format or the data. ?. This is your source for help on any given metric. Secondary Dimension (in this case, None). This allows you to splice the data table by specific data dimensions (cities, sources, etc...) Which Reports To Track and When: I recommend using this as a starting point and tailoring it to your needs as you learn more about the unique needs for your website. Daily Goals -> Total Conversions Content -> Top Content (at the page level) Traffic Sources -> All Traffic Sources Traffic Sources -> Campaigns - (Optional) Weekly (or bi-weekly if you have a content intensive website) Goals -> Funnel Visualization Goals -> Goal Abandoned Funnels Content -> Site Search Traffic Sources -> Direct Traffic Traffic Sources -> Referring Sites Traffic Sources -> Keywords Monthly Visitors -> Overview Intelligence -> Overview Content -> Content Drilldown (at the folder level) Content -> Top Landing Pages Content -> Top Exit Pages Traffic Sources -> Adwords - (Optional) Which Reports to Ignore: Visitors -> Benchmarking From installation validation tools, it's estimated that as many as 70% of Google Analytics installs are either incomplete or incorrect. This means that the data that these benchmarks rely on, is very likely inaccurate. Visitors -> Map Overlay While this feature is one of the most popular features of Google Analytics, it is also one of the least useful. The data these maps present is not normalized so areas with high populations tend to always dominate the screen. They are not completely useless as they show trends but they are not something that can be relied on heavily either. Use your best judgement when viewing this report. Content -> Site Overlay This feature seems like a good idea but is not able to be implemented in a way that makes it accurate. Put simply, in order for this tool to work, Google Analytics would need to have more information about the location of a link on a page and a mechanism for tracking which instance of a link gets clicked. Clicktale and Crazy Egg are nice alternatives. Conclusion: Tracking the metrics above is only the first step. Imagine Google Analytics as a magical yard stick (For you sissies on the metric system, a yard stick is like a meter stick but better). It is essential for measuring the success or failure of a given online strategy but it is not an online strategy alone. It is best used as a supplement to the your current activities and should be treated as such. I am surely going to get some flak from some Analytics gurus who know more than me. (You want to go Kaushik?) Remember, this guide is intended to help people get over the GA learning curve, not to be a comprehensive guide. If you are looking for the latter, check out the hundreds of blog posts at the Google Analytics Blog. One last thing, if you’re interested in taking the Seminars for Success classes, here’s the upcoming schedule. Phoenix, AZ June 9-11, 2010 Chicago, IL June 23-25, 2010 Berkeley, CA July 28-30, 2010 Los Angeles, CA Aug 18-20, 2010 San Diego, CA Sep 1-3, 2010 Salt Lake City, UT Sep 15-17, 2010 Vancouver, BC Oct 6-8, 2010 Atlanta, GA Oct 27-29, 2010 Orlando, FL Nov 3-5, 2010 Washington, DC Dec 8-10, 2010 If you have any other advice that you think is worth sharing, feel free to post it in the comments. This post is very much a work in progress. As always, feel free to e-mail me if you have any suggestions on how I can make my posts more useful. All of my contact information is available on my profile: Danny Thanks! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Overcome the Google Analytics Learning Curve in 20 Minutes"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Overcome the Google Analytics Learning Curve in 20 Minutes"
    },
    {
      "level": "H2",
      "text": "Overcome the Google Analytics Learning Curve in 20 Minutes:"
    },
    {
      "level": "H3",
      "text": "First Things First:"
    },
    {
      "level": "H4",
      "text": "What are Accounts and Profiles and how are they different?"
    },
    {
      "level": "H4",
      "text": "What are Filters and Segments and how are they different?"
    },
    {
      "level": "H4",
      "text": "What are \"raw\" profiles and why use them? (Ctrl+Z won’t save you here)"
    },
    {
      "level": "H4",
      "text": "What if I don't trust a specific metric?"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Navigating Google Analytics:"
    },
    {
      "level": "H4",
      "text": "Dashboard (Mostly Useless High-level Metrics)"
    },
    {
      "level": "H4",
      "text": "Intelligence (Automated e-mail alerts) - Check Monthly"
    },
    {
      "level": "H4",
      "text": "Visitors (The type of people that come to your site) - Check Monthly"
    },
    {
      "level": "H4",
      "text": "Traffic Sources (Where people are coming from to reach your site) - Check Weekly"
    },
    {
      "level": "H4",
      "text": "Content (Metrics on your pages) - Check Weekly"
    },
    {
      "level": "H4",
      "text": "Goals (Metrics on whether or not people are doing what you want them to do) - Check Daily"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Report Interface:"
    },
    {
      "level": "H4",
      "text": "Graph:"
    },
    {
      "level": "H4",
      "text": ""
    },
    {
      "level": "H4",
      "text": "Data:"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Which Reports To Track and When:"
    },
    {
      "level": "H4",
      "text": "Daily"
    },
    {
      "level": "H4",
      "text": "Weekly (or bi-weekly if you have a content intensive website)"
    },
    {
      "level": "H4",
      "text": "Monthly"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Which Reports to Ignore:"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Conclusion:"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Danny Dover\n          \n            Danny Dover\n          \n            Danny Dover"
}