{
  "url": "https://moz.com/blog/p15",
  "slug": "p15",
  "title": "The Moz Blog [SEO] - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Billie Geena September 20, 2023 The ROI of Accessibility in SEO User Experience (UX) | Marketing Industry Discover the return on investment of accessibility in SEO and learn why it’s crucial for your business. Gain greater revenue, improve user experience, and stay compliant with legal standards. Read this post By: Sara Moccand-Sayegh September 18, 2023 GenAI and the Future of Branding: The Crucial Role of the Knowledge Graph Branding | Marketing Industry | AI and SEO Learn how Generative AI can enhance your brand's online presence. Discover the crucial role of Knowledge Graphs in ensuring accurate and reliable information in the evolving world of AI-driven chatbots and search engines. Read this post By: Ross Simmonds September 15, 2023 How to Repurpose Your Old Content – Whiteboard Friday Whiteboard Friday | Content Marketing Breathe new life into your existing content. Join Ross Simmonds in this Whiteboard Friday as he shares strategies to transform your old content into valuable assets that drive results and boost brand authority. Read this post By: Molly Ploe September 11, 2023 Author names: Do They Matter? How to Attribute Content Content Marketing | Blogging Learn about the importance of author attribution in content creation and SEO. Discover when and why to attribute content to authors, and gain insights from Google's perspective. Read this post By: Tom Mansell September 8, 2023 How to Create an SEO Forecast [Free Template Included] — Whiteboard Friday Whiteboard Friday | SEO Reporting Learn how to forecast and demonstrate the value of your SEO efforts in this week's Whiteboard Friday and put it into practice with a free worksheet. Tom Mansell talks about quantifying predicted SEO value, closing performance gaps, and calculating ROI. Read this post By: Minnie Mururi September 7, 2023 How to Future-Proof Your Brand with SEO Branding | Marketing Industry Learn how to future-proof your brand with SEO by adapting to the ever-changing digital landscape and securing your online presence. Follow Minnie’s eight essential tips to ensure your brand's long-term success through SEO. Read this post By: Dr. Peter J. Meyers September 4, 2023 August 18 Algo Update: The Cyclone Before the Storm Search Engines | Marketing Industry | Algorithm Updates Dr. Peter Meyers discusses a volatile SERP with reference to a reduction of indented results, which occurred before the August 2023 algorithm update. Read this post By: Tom Capper September 1, 2023 Why Should SEOs Measure Brand? — Whiteboard Friday Whiteboard Friday | Branding In this Whiteboard Friday, Tom discusses why SEOs should measure their brand, with specific reference to Moz’s new metric, Brand Authority. Read this post By: Preeti Gupta August 30, 2023 GA4: Leverage the Power of Custom Reports to Enhance Your Reporting SEO Analytics | SEO Reporting Preeti covers how to leverage the power of GA4 custom reports, with steps on how to create them and modify them to suit your own needs. Read this post By: Zoe Ashbridge August 28, 2023 How to Earn Topical Authority in 2023 and Beyond Search Engines Zoe takes a deep dive into topical authority, a Google ranking factor. Learn about what it is, how to earn it, and, importantly, how to strategically develop topical relevance. Read this post By: Rejoice Ojiaku August 25, 2023 Map Your Keywords to the Buyer's Journey and User Intent — Whiteboard Friday Whiteboard Friday | Keyword Research Rejoice takes you through how to map your keywords to both the buyer’s purchasing journey and the relative user intent. Read this post By: Miriam Ellis August 21, 2023 What Diners Write About Most: A Study of Restaurant Review Place Topics Local SEO | Reputation Management Find out what diners write about most in their reviews in Miriam’s new study. Understand the sentiment behind customer reviews and use 'Place Topics' to improve areas that customers talk about the most, to ultimately enhance your restaurant's reputation and attract new customers. Read this post By: Jon Earnshaw August 18, 2023 Identifying, Fixing, and Preventing Cannibalization — Whiteboard Friday Whiteboard Friday | Keyword Research In this Whiteboard Friday, Jon discusses how to identify, fix, and prevent cannibalization. He identifies three specific types of cannibalization: internal, international, and subdomain. Read this post By: Miriam Ellis August 16, 2023 Top Local SEO Takeaways from MozCon 2023 Local SEO | SEO Events Miriam touches on all of the top local SEO takeaways from MozCon 2023, including tips on local link categorization, video SEO, and diverse takes on AI. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Moz Blog"
    },
    {
      "level": "H2",
      "text": "The ROI of Accessibility in SEO"
    },
    {
      "level": "H2",
      "text": "GenAI and the Future of Branding: The Crucial Role of the Knowledge Graph"
    },
    {
      "level": "H2",
      "text": "How to Repurpose Your Old Content – Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "How to Create an SEO Forecast [Free Template Included] — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "How to Future-Proof Your Brand with SEO"
    },
    {
      "level": "H2",
      "text": "August 18 Algo Update: The Cyclone Before the Storm"
    },
    {
      "level": "H2",
      "text": "Why Should SEOs Measure Brand? — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Never miss a beat. Get Moz Blogemail updates daily in your inbox"
    },
    {
      "level": "H2",
      "text": "GA4: Leverage the Power of Custom Reports to Enhance Your Reporting"
    },
    {
      "level": "H2",
      "text": "How to Earn Topical Authority in 2023 and Beyond"
    },
    {
      "level": "H2",
      "text": "Map Your Keywords to the Buyer's Journey and User Intent — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "What Diners Write About Most: A Study of Restaurant Review Place Topics"
    },
    {
      "level": "H2",
      "text": "Identifying, Fixing, and Preventing Cannibalization — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Top Local SEO Takeaways from MozCon 2023"
    }
  ],
  "author": "Billie Geena\n          \n            Sara Moccand-Sayegh\n          \n            Ross Simmonds\n          \n            Molly Ploe\n          \n            Tom Mansell\n          \n            Minnie Mururi\n          \n            Dr. Peter J. Meyers\n          \n            Tom Capper\n          \n            Preeti Gupta\n          \n            Zoe Ashbridge\n          \n            Rejoice Ojiaku\n          \n            Miriam Ellis\n          \n            Jon Earnshaw\n          \n            Miriam Ellis"
}