{
  "url": "https://moz.com/blog/p513",
  "slug": "p513",
  "title": "The Moz Blog [SEO] - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin October 11, 2005 Understanding Computer Logic Search Engines A great page from John Sofwa, a math PhD and founder of Vivomind Intelligence (who could really use a new website), gives a thorough explanation of many of the ... Read this post By: Rand Fishkin October 10, 2005 10,000 Scraper Sites Blogging I've gotten more than a little concerned lately over a trend I see in the SEO world. I've noticed through following the backlink acquisition of several client sites that the better a site ranks (for a wide variety of phrases), the more spam/scraper sites will re-publish your text or site description from the SERPs and link to you. A ... Read this post By: Rand Fishkin October 10, 2005 Aaron's Interview with Matt Cutts SEO Events This is a totally worthwhile read (if a little long). Mr. Wall (of SEOBook) gives Matt some floaters, some tough questions and some in the middle and Matt answers them all with honesty and... Read this post By: Rand Fishkin October 7, 2005 One Page at SEOmoz out of the Sandbox Blogging I've noted on several occassions that SEOmoz is largely sandboxed at Google. Despite having great, natural link popularity (thanks everyone!), the traffic from Google is on the order of 20-50 people a day, all of whom either typed in 'randfish' or 'seomoz'. Thankfully, at Yahoo! and MSN, the site ranks spectacularly for a great variety of searches (but, it seems that web-dev types don't use tho... Read this post By: Rand Fishkin October 6, 2005 Ranking Factors Article Finally Finished Moz News Apologies for the long delay, but the search ranking factors article is now complete. Thanks to everyone who contributed; it's quite an impressive display of how much knowledge and experience professional SEOs can share when they get together on a project. There are now two formats, one where all of the comments left by the contrib... Read this post By: Rand Fishkin October 6, 2005 Boardtracker Public Relations At SEW, Orion points out a great service called Boardtracker that Chris Sherman mentioned earlier. Th... Read this post By: Rand Fishkin October 4, 2005 Press Release Advice Link Building One of the best threads in SEO is Cre8asite's one on Press Releases for Google News. Advice given there ranges from source to source but is all of very high quality, including an actual illustration of the traffic and readership levels that can be achieved with a successful release. While I encourage a full reading, I'll... Read this post By: Rand Fishkin October 4, 2005 Welcome to Keijo Kortelainen Moz News SEOmoz welcomes to our posting team a 3rd member - Keijo Kortelainen of 2KMediat in Finland. It's a pleasure adding international flair to our editorial content and Keijo's first post on keyword research is a great one. I'm l... Read this post By: Rand Fishkin October 3, 2005 Neato - An Anchor Text Analysis Tool from WeBuildPages Moz News Neato is a great tool from WeBuildPages (Jim Boykin & Todd Malicoat's excellent SEO shop). It analyzes backlinks (up to 1000 at a time) and their respective anchor texts. It's actually insanely v... Read this post By: Rand Fishkin October 3, 2005 Threadwatch is 1 year old Public Relations It's hard to believe that Threadwatch is only a year old (today). In that time, Nick has taken the site from obscurity to infamy. They've been Slashdotted, added to major blogrolls all around the search and technology industries and created a hotbed for SEO/M and search politics. Congratulations, Nick. I hope SEOmoz can do half as well in a yea... Read this post By: Rand Fishkin September 30, 2005 Simple Regression Tool Moz News This may not apply directly to a lot of SEOs, but an automated regression analysis is what allowed me to build most of the SEOmoz tools' reports accurately. This sweet l... Read this post By: Rand Fishkin September 30, 2005 Dodge the Sandbox for $79... Is this for real? Blogging mrkryz03 at SEOChat uncovered some great information about a new product purporting to prevent your site from falling prey to Google's sandbox. The methodology is somewhat ingenious and creative - sending fake traffic to the search engines for your site and its keywords, which is likely a component that helps new sites escape \"boxin... Read this post By: Rand Fishkin September 29, 2005 Anatomy of a Forum Thread Public Relations Kim Krause Berg posted a hilarious topic over at Cre8asite on the subject of a forum thread on light bulb changing. Naturally, her fellow SEO forum members chipped in with their own personal takes on the post and ma... Read this post By: Rand Fishkin September 28, 2005 New Article Listing 93 Ranking Factors Search Engines With the help of some friends from SEOChat, I've compiled a list of 93 metrics that may play large or small roles in determining how search engines rank documents in a query. This list is by no means comprehensive, but it does offer a great deal of information about each factor, as well as a relative measure of each factor's perceived importanc... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Moz Blog"
    },
    {
      "level": "H2",
      "text": "Understanding Computer Logic"
    },
    {
      "level": "H2",
      "text": "10,000 Scraper Sites"
    },
    {
      "level": "H2",
      "text": "Aaron's Interview with Matt Cutts"
    },
    {
      "level": "H2",
      "text": "One Page at SEOmoz out of the Sandbox"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Ranking Factors Article Finally Finished"
    },
    {
      "level": "H2",
      "text": "Boardtracker"
    },
    {
      "level": "H2",
      "text": "Press Release Advice"
    },
    {
      "level": "H2",
      "text": "Welcome to Keijo Kortelainen"
    },
    {
      "level": "H2",
      "text": "Never miss a beat. Get Moz Blogemail updates daily in your inbox"
    },
    {
      "level": "H2",
      "text": "Neato - An Anchor Text Analysis Tool from WeBuildPages"
    },
    {
      "level": "H2",
      "text": "Threadwatch is 1 year old"
    },
    {
      "level": "H2",
      "text": "Simple Regression Tool"
    },
    {
      "level": "H2",
      "text": "Dodge the Sandbox for $79... Is this for real?"
    },
    {
      "level": "H2",
      "text": "Anatomy of a Forum Thread"
    },
    {
      "level": "H2",
      "text": "New Article Listing 93 Ranking Factors"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin"
}