{
  "url": "https://moz.com/blog/p514",
  "slug": "p514",
  "title": "The Moz Blog [SEO] - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin September 27, 2005 Seeking Contributors Moz News With EGOL and I the loan wolves running SEOmoz, I think it's time to find some new talent to write for the site. SEOmoz, as you know, doesn't deliver copies of the daily headlines (although we occassionally give our take on big news). We're more focused on providing specific, daily tips and information that SEO/Ms and webmastesr can use in their site optimization efforts. If you're some... Read this post E By: EGOL September 25, 2005 Weigh in on Article Trades Link Building Lots of people are doing article trades or posting them out for massive distribution. They do this hoping for a traffic flow and also for the links that will appear within the article or in their signature line.I think that this worked great in the early days of SEO, bu... Read this post By: Rand Fishkin September 23, 2005 A Brilliant Trick to Get a Link from Authority Sites Link Building Using hex coding of a page's content, some clever folks have found a way to make it appear that they had links coming directly from high-level authority sites. Dannomatic at Threadwatch points this out: A series of pages are created on a domain say ... Read this post By: Rand Fishkin September 22, 2005 When Money Can't Buy You Link Love Link Building What do you do when money doesn't appeal to your link targets. This happens to me all the time - sometimes because they're an educational institution, a non-profit or simply a webmaster who doesn't want to \"compromise\". If purchasing \"advertising\" links becomes impossible, there are some great ways around it that I've used successfully. Know Before You Ask - When... Read this post By: Rand Fishkin September 20, 2005 Debating the Value of Outbound Links Design Over at Sitepoint forums, Aspen (a very well-respected and knowledgable member of their community) disagrees with me on whether outbound links on a web page can affect your rankings at the search engines. My views: \"I believe that search... Read this post By: Rand Fishkin September 19, 2005 In SEO, Do You Get What You Pay For? Public Relations Search Engine Optimization has been described as an art, a science, a practice, an abomination and a career by those in and around the industry. But, to most outsiders learning about the practice for the first time, SEO is primarily seen as a service that professionals provide to clients. Although I'm often in the professional seat, I have become a client of many well known SEOs and secondary p... Read this post By: Rand Fishkin September 15, 2005 Ask Jeeves Does Gift Search Mobile SEO Ask Jeeves noted on their blog today that they've got a new gift search service and it's awesome. It's so much fun to play around with all the different personality types and ages and other demographics to see what they'... Read this post By: Rand Fishkin September 15, 2005 Neuromarketing Online Advertising Rather than ask samples of the population to watch ads and write their responses down, neuromarketing uses MRI scans to identify what types of brain activity correspond to different ad messages and p... Read this post By: Rand Fishkin September 14, 2005 Link Data at the Search Engines Link Building A thread from surfdude (Vaughn of the famous One-Pagers) has a thread at SEOChat on the value of link data fomr the search engines and the reliability of the numbers therein. He notes that as you drill down to the end of the listing results, the number of results reported by the search engines changes (at Google, Yahoo! and MSN). I... Read this post By: Rand Fishkin September 13, 2005 Bumvertising Online Advertising This 22 year-old econ major from my alma mater has been using the local indigent population to score one of the most creative link building ideas I've seen in years. And, to top it off, I can actually see the guys holding his poker signs from my office window. Definitely worth a look and a read.... Read this post By: Rand Fishkin September 13, 2005 Cre8asite's Website Hospital Moz News The various webmaster and SEO/M forums on the web all offer their own versions of a peer review for member websites, but no one does as good a job as Cre8asite forums with their ... Read this post By: Rand Fishkin September 13, 2005 A Non-SEO View of How to Get Blogged Link Building TechCrunch has a post from last Friday - Top Ten Things You Can Do To Get Blogged - that explains carefully and simply how the company chooses Web 2.0 companies to be profiled or written about on their site. While this a... Read this post By: Rand Fishkin September 8, 2005 The Importance of an About Page Design Kim's got a terrific thread going at Cre8asite on the importance of \"about us\" or \"about me\" pages. She starts by pointing to Andy Beal's ... Read this post By: Rand Fishkin September 8, 2005 Dirty Tricks at the DMOZ Link Building I watched a nasty trick take effect at the DMOZ today. Apparently, unscrupulous editors have been getting more and more black hat about using particularly clever techniques to foil their competitors who are listed at the directory. This particular technique came to me via an online acquaintance whose name I promised not to mention. This editor's technique, as he controls some real estat... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Moz Blog"
    },
    {
      "level": "H2",
      "text": "Seeking Contributors"
    },
    {
      "level": "H2",
      "text": "Weigh in on Article Trades"
    },
    {
      "level": "H2",
      "text": "A Brilliant Trick to Get a Link from Authority Sites"
    },
    {
      "level": "H2",
      "text": "When Money Can't Buy You Link Love"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Debating the Value of Outbound Links"
    },
    {
      "level": "H2",
      "text": "In SEO, Do You Get What You Pay For?"
    },
    {
      "level": "H2",
      "text": "Ask Jeeves Does Gift Search"
    },
    {
      "level": "H2",
      "text": "Neuromarketing"
    },
    {
      "level": "H2",
      "text": "Never miss a beat. Get Moz Blogemail updates daily in your inbox"
    },
    {
      "level": "H2",
      "text": "Link Data at the Search Engines"
    },
    {
      "level": "H2",
      "text": "Bumvertising"
    },
    {
      "level": "H2",
      "text": "Cre8asite's Website Hospital"
    },
    {
      "level": "H2",
      "text": "A Non-SEO View of How to Get Blogged"
    },
    {
      "level": "H2",
      "text": "The Importance of an About Page"
    },
    {
      "level": "H2",
      "text": "Dirty Tricks at the DMOZ"
    }
  ],
  "author": "Rand Fishkin\n          \n            EGOL\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin"
}