{
  "url": "https://moz.com/blog/p515",
  "slug": "p515",
  "title": "The Moz Blog [SEO] - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin September 6, 2005 Typoglycemia & Internet Phenomenon Link Building An interesting thread at Cre8asiteforums (typoglycemia) about random wording got me thinking about Internet Phenomenon in general. JanussunaJ starts the thread with the following: Msot ploepe can raed tihs, athlhuog it lokos raehtr odd. It is cllae... Read this post By: Rand Fishkin September 6, 2005 Digging up Dirty DNS Deeds Mobile SEO SamSpade.org has a fantastic collection of tools for digging up everything from falsified IP addresses to browsing the web anonymously to checking traceroutes, running whois and reverse lookups and much more. The site's super-clean, minimalis... Read this post By: Rand Fishkin September 6, 2005 Katrina &amp; the SEO World SEO Events Hurricane Katrina has taken a devastating toll on the gulf states of the US and the people who lived there. The SEO world has responded with a variety of donations and contributions, as well as threads, posts and information relating to the subject. DazzlinDo... Read this post E By: EGOL September 4, 2005 Great Books for Webmasters Marketing Industry Don't think that everything about SEO and building websites can be found on the web. Over the past two years I have read many books about these same subjects that were printed on paper. So if paper books are off your radar screen these days here the BEST three from my long reading... Read this post By: Rand Fishkin September 2, 2005 A Little Bit Naughty Mobile SEO Google's SafeSearch feature doesnt' strongly affect most of us in the non-adult industry, but I came across a fun little tool yesterday that I thought was worth mentioning. Monzy's UnSafe Search is a play on Google's adult filtering and conducts a search at Google with SafeSearch on and off, then filters out those results that... Read this post By: Rand Fishkin September 2, 2005 Librarian's Directory Mobile SEO The two groups most commonly associated by search engines as being interested in things like link data and information retrieval technology, outside of their own engineers, are librarians & SEOs. The first group are typically lauded while the second receives both internal and external... Read this post By: Rand Fishkin September 2, 2005 Mr. Cutts... Your Pants are on Fire Search Engines Matt Cutts is one of the friendliest, most fun people to be around at an SES conference. But, like all of us, he's not infalliable and is prone to make mistakes once in a while. Far be it from me to criticize him, however, as I too have notorious errors of judgement ... Read this post By: Rand Fishkin September 1, 2005 Visiting Bad Neighborhoods Blogging Cygnus, over at SEOChat, posted a thread back in July that has quickly become one of the most popular and visited threads of the summer. Delisted Sites? poses questions about many recently dropped sites at Google from a variety of sources. I was lucky enough to have some private ... Read this post By: Rand Fishkin August 31, 2005 Got 15 Minutes? We've got a new SEO/M Exam Moz News After a much longer than expected delay from May, when I posted the original SEO Quiz, we've got a new, full-featured SEM Exam. It's fun and a great way to pass the last few lazy days of... Read this post By: Rand Fishkin August 31, 2005 Decption at Yahoo about Index Size; Google still bigger Search Engines As much as it pains me to have to give ground to the industry giant, Google appears to still have the edge in index size. Despite Yahoo!'s claims to over 19 billion web documents indexed, in a very good report from earlier this week, Matthew Cheney and Mike Perry from the Univ... Read this post E By: EGOL August 31, 2005 Throwing Out the Book on SEO! Design OK... It's a new day in my office. I am changing my focus away from the standard SEO optimizing stuff and instead putting my focus where it really belongs - getting site visitors to embrace my site. Let's call this SEO for SITE VISITOR ACTIONS. I think that the search engine... Read this post E By: EGOL August 27, 2005 Unconventional Link-Building Ideas Link Building Everybody talks about recip link trades, directory submission and buying links. How about let's share a few unconventional link-building ideas here. I'll give you my best three and if every person who reads this adds just one more we will build one of the best collections on the web. Ask for the Link: If you have content that people will link to naturally then plant a seed in the mi... Read this post By: Rand Fishkin August 26, 2005 If You're Going to San Francisco Moz News I'm heading out of town for the weekend (and an additional two days next week). We're landing in Oakland, but staying near Union Square in San Francsico from Saturday to Tuesday. While I'm away, EGOL will be blogging ... Read this post By: Rand Fishkin August 26, 2005 Thinking about Off-Topic Links Link Building So-called \"off-topic\" links, those which are not directly related by subject matter on the linked-to page, have been getting some bad press lately. One of the problems with rejecting the idea of off-topic links from a search engine's perspective, is that the index of WWW would be unspiderable if they didn't exist. Besi... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Moz Blog"
    },
    {
      "level": "H2",
      "text": "Typoglycemia & Internet Phenomenon"
    },
    {
      "level": "H2",
      "text": "Digging up Dirty DNS Deeds"
    },
    {
      "level": "H2",
      "text": "Katrina &amp; the SEO World"
    },
    {
      "level": "H2",
      "text": "Great Books for Webmasters"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "A Little Bit Naughty"
    },
    {
      "level": "H2",
      "text": "Librarian's Directory"
    },
    {
      "level": "H2",
      "text": "Mr. Cutts... Your Pants are on Fire"
    },
    {
      "level": "H2",
      "text": "Visiting Bad Neighborhoods"
    },
    {
      "level": "H2",
      "text": "Never miss a beat. Get Moz Blogemail updates daily in your inbox"
    },
    {
      "level": "H2",
      "text": "Got 15 Minutes? We've got a new SEO/M Exam"
    },
    {
      "level": "H2",
      "text": "Decption at Yahoo about Index Size; Google still bigger"
    },
    {
      "level": "H2",
      "text": "Throwing Out the Book on SEO!"
    },
    {
      "level": "H2",
      "text": "Unconventional Link-Building Ideas"
    },
    {
      "level": "H2",
      "text": "If You're Going to San Francisco"
    },
    {
      "level": "H2",
      "text": "Thinking about Off-Topic Links"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            EGOL\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            EGOL\n          \n            EGOL\n          \n            Rand Fishkin\n          \n            Rand Fishkin"
}