{
  "url": "https://moz.com/blog/p519",
  "slug": "p519",
  "title": "The Moz Blog [SEO] - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin July 11, 2005 167 Days to Christmas & 37 Signals has Advice Design 37 Signals has a list of holiday \"to-do's\" on your e-commerce website to prepare it for the holiday shopping season. Since Christmas often accounts for up to 40% of a store's entire yearly profits, there's no doubt ... Read this post By: Rand Fishkin July 11, 2005 A New Home Page Moz News On the suggestion of a friend, I've changed my home page to a new location, Wikipedia's Random Article page - it's a special feature and has to be manually entered as the home page for your web browser, but it's a great way to learn something new every time you start surfing. If it bogs down workflow too much, I may change back, but for ... Read this post By: Rand Fishkin July 8, 2005 Mis-directing and Re-directing Advertisements Online Advertising A friend pointed me to a unique form of advertising, conducted by the company AdEngag. This particular incidence was caught on the 'I am Bored' site, which practically deserves its own link if it weren't for the fact that no... Read this post By: Rand Fishkin July 8, 2005 Nike Dodges Apology Being Indexed Online Advertising Since 1968, a blog I recently came across, points to Nike's fascinating technique of using a gif image of their ... Read this post By: Rand Fishkin July 7, 2005 Web Color Schemes Design In the world of web design, one of the most frustrating topics I butt my head up against is color scheme. I search and search the color wheel in Photoshop and scour the web to help inspire me on themes that will work for a client or a site. Luckily, I now have some help, and ... Read this post By: Rand Fishkin July 4, 2005 SEO's Grim Reaper Public Relations Threadwatch has a terrific (though poorly titled) thread (hats my arse) today on the demise of SEO. There are intelligent opinions from both sides, primarily in the comments on Nick's somewhat over-the-top post - a response to a ... Read this post By: Rand Fishkin July 2, 2005 What do Houses of Ill Repute and Link Buying have in Common? Link Building Over at WebHostingTalk, a very popular forum in the web hosting industry, there's a thread about buying links vs. earning them. The advice tends towards a ... Read this post By: Rand Fishkin July 1, 2005 Dear DMOZ Forum Visitors Blogging I notice 3 unique DMOZ threads that are sending quite a few visitors to SEOmoz today. I want to welcome and thank all of the editors there who've made their way over. We may have our differences, but I realize that most of you are doing a great job organizing and classifying sites and maintaining what is still the best directory available. Hopefully, you're not too upset over my ... Read this post By: Rand Fishkin July 1, 2005 Ian Turner's Been Found SEO Events Ian has been found - the details are at Threadwatch. He's in the Atlanta airport, delayed due to a lack of a passport and an especially prickly TSA. I haven't felt this relieved in a long time.... Read this post By: Rand Fishkin July 1, 2005 Blogging about Morgan Spurlock's 30 Days Moz News Most people will recognize the name Morgan Spurlock from the famous documentary he made last year - SuperSize Me. He's also the author of Don't Eat this Book (a play on Abbie Ho... Read this post By: Rand Fishkin June 30, 2005 Greg Jarboe from SEO-PR Answers Questions at SEOChat Online Advertising I've asked Greg Jarboe of SEO-PR.com, with whom I spoke on the link building panel at SES Toronto, to stop by SEOChat and answer some of the members' questions. Luckily for us, Greg has a couple of spare minutes today a... Read this post By: Rand Fishkin June 30, 2005 Writing for the Web Tips from Demon @ Thus Online Advertising A website I stumbled across through del.icio.us today, Demon @ Thus, has a great short article on writing for the web. The article covers 10, easy-to-understand points, from which I shall paraphras... Read this post By: Rand Fishkin June 29, 2005 Posting Light Today Moz News Due to my work schedule being overwhelmingly busy today, I won't be posting much. I feel bad about this, since my loyal readers - you - have been kind enough to drop by. There are a few interesting things taking place in the SEO world that are worth reading about: Kim Krause-Berg is talking about... Read this post By: Rand Fishkin June 27, 2005 Wall Street Journal Covers SEO Public Relations Sifish pointed me to an article at the Wall Street Journal's Startup Journal by Sarah Needleman - Three Myths on Boosting Search-Engine Rankings. It a fairly primitive stab at explaining how the industry operates, and once again it pushes the pervasive view that most search engine optimization comp... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Moz Blog"
    },
    {
      "level": "H2",
      "text": "167 Days to Christmas & 37 Signals has Advice"
    },
    {
      "level": "H2",
      "text": "A New Home Page"
    },
    {
      "level": "H2",
      "text": "Mis-directing and Re-directing Advertisements"
    },
    {
      "level": "H2",
      "text": "Nike Dodges Apology Being Indexed"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Web Color Schemes"
    },
    {
      "level": "H2",
      "text": "SEO's Grim Reaper"
    },
    {
      "level": "H2",
      "text": "What do Houses of Ill Repute and Link Buying have in Common?"
    },
    {
      "level": "H2",
      "text": "Dear DMOZ Forum Visitors"
    },
    {
      "level": "H2",
      "text": "Never miss a beat. Get Moz Blogemail updates daily in your inbox"
    },
    {
      "level": "H2",
      "text": "Ian Turner's Been Found"
    },
    {
      "level": "H2",
      "text": "Blogging about Morgan Spurlock's 30 Days"
    },
    {
      "level": "H2",
      "text": "Greg Jarboe from SEO-PR Answers Questions at SEOChat"
    },
    {
      "level": "H2",
      "text": "Writing for the Web Tips from Demon @ Thus"
    },
    {
      "level": "H2",
      "text": "Posting Light Today"
    },
    {
      "level": "H2",
      "text": "Wall Street Journal Covers SEO"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin"
}