{
  "url": "https://moz.com/blog/p522",
  "slug": "p522",
  "title": "The Moz Blog [SEO] - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin May 24, 2005 The SEOmoz Quiz Moz News I whipped together something fun for the SEO community to do on their respective lunchbreaks today - the SEOmoz Quiz. It's fun, light-hearted and easy to cheat on (but don't do that 'cause you'll spoil all the fun). Anyone who gets a perfect s... Read this post By: Rand Fishkin May 23, 2005 The Blue Collar SEOs SEO Events Noteworthy this past weekend was Donna's post on the subject of Blue Collar SEO. It's a fantastic short article on the different types of SEO companies and individuals in the business and worthy of 5 minutes of everyone's ti... Read this post By: Rand Fishkin May 23, 2005 D'oh! SEO Analytics The twin issues of fairness and bias in search engines has come to the forefront this week with 2 threads. Homer's twitching eyes and nervous hands should give you an idea of how the SEs might feel addressing these sensitive issues. The first, ... Read this post By: Rand Fishkin May 20, 2005 Dealing with a Yahoo! Penalty Blogging Yahoo! and I have always had an excellent relationship, which is why I was so perturbed to find that they banned a site I've been working with for several years - www.avatarfinancial.com. Last week, a ... Read this post By: Rand Fishkin May 18, 2005 The SEO/SEM's Industries Growing Pains Public Relations Nacho at SEW Forums has posted a thread entitled \"SEM Industry Biggest Growing Pains\". In it, you'll find some of the best responses to any thread at any SEO forum in the last several week... Read this post By: Rand Fishkin May 17, 2005 How Big is the World Wide Web Online Advertising Antonio Gulli, who I've mentioned before at SEOmoz, has an online report on the size of the world wide web. It's a detailed description of the process and results of his inquiries into the indexable portion... Read this post By: Rand Fishkin May 16, 2005 Understanding Stemming Search Engines Xan Porter has an excellent blog entry on the subject of stemming in search engine indices. The article points to a terrific trove of resources on stemming, how it is performed a... Read this post By: Rand Fishkin May 9, 2005 What a Good Link Request E-Mail Looks Like Link Building I got the e-mail I've copied below today. It's probably the best link request example I've ever gotten. Even after realizing that it was probably an auto-generated and mass-sent e-mail, I considered responding to let him know I appreciated the kind words. People are always asking how to phrase their link request letters, so here's a sample: ... Read this post By: Rand Fishkin May 6, 2005 At a Hotel Bar in Boston SEO Events Rebecca Leaf Homepage - I'm teaching a cousin how search engines work while I'm in Boston. So here's her website, and shockingly, by next week, her site will be #1 for \"Rebecca Leaf Homepage\". Just watch...... Read this post By: Rand Fishkin April 29, 2005 Fractals & Semantics - A Great Paper from Dr. Garcia Search Engines Dr. Garcia, known on the forums as Orion, has written what will surely become one of the most linked to documents in the SEO world over the next few days. The article - ... Read this post By: Rand Fishkin April 28, 2005 The Changing Role of an SEO/SEM Public Relations A fantastic thread at Cre8asite focuses on the new role played by SEO/SEMs in website development and management. Although we have a very tight-knit and well organized online community (between all the popu... Read this post By: Rand Fishkin April 27, 2005 Politics, SEO & the Forums Public Relations As most of you who see me in the forums know, I'm a Jon Stewart kinda guy. This can also lead people to make natural assumptions about my personal politics, which is certainly justifiable. Tod... Read this post By: Rand Fishkin April 27, 2005 Link Vault - A Tool for Link Building Link Building As 3-way, 4-way and more-way linking has grown popular, particularly with the advent and overwhelming popularity of Shawn's Digitalpoint Co-Op Advertising Tool, other systems have popped up to attempt to create ... Read this post By: Rand Fishkin April 26, 2005 An Average Conversion Rate Design While conducting some research, I came across a brilliant website on the specific subject of conversion rates. Conversion Chronicles details a remarkable amount and depth of information on the subject of e-commerce conversi... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Moz Blog"
    },
    {
      "level": "H2",
      "text": "The SEOmoz Quiz"
    },
    {
      "level": "H2",
      "text": "The Blue Collar SEOs"
    },
    {
      "level": "H2",
      "text": "D'oh!"
    },
    {
      "level": "H2",
      "text": "Dealing with a Yahoo! Penalty"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "The SEO/SEM's Industries Growing Pains"
    },
    {
      "level": "H2",
      "text": "How Big is the World Wide Web"
    },
    {
      "level": "H2",
      "text": "Understanding Stemming"
    },
    {
      "level": "H2",
      "text": "What a Good Link Request E-Mail Looks Like"
    },
    {
      "level": "H2",
      "text": "Never miss a beat. Get Moz Blogemail updates daily in your inbox"
    },
    {
      "level": "H2",
      "text": "At a Hotel Bar in Boston"
    },
    {
      "level": "H2",
      "text": "Fractals & Semantics - A Great Paper from Dr. Garcia"
    },
    {
      "level": "H2",
      "text": "The Changing Role of an SEO/SEM"
    },
    {
      "level": "H2",
      "text": "Politics, SEO & the Forums"
    },
    {
      "level": "H2",
      "text": "Link Vault - A Tool for Link Building"
    },
    {
      "level": "H2",
      "text": "An Average Conversion Rate"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin"
}