{
  "url": "https://moz.com/blog/p525",
  "slug": "p525",
  "title": "The Moz Blog [SEO] - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin March 8, 2005 IR Tools to Play with Search Engines Normally, I would endeavor to research the tools I present a little more before sharing, but I've been having so much fun exploring this list that I had to present it (that, and I'm almost out of minutes left in the day). KDNuggets, a data mining & knowledge dicsovery guide website has ... Read this post By: Rand Fishkin March 7, 2005 Jeff Dean of Google Speaks to UW Search Engines On October 21, 2004, Jeff Dean of Google gave a taped speech to the University of Washington's Computer Science department. Lucky for us, the UW put this ~55 minute speech on some of the more technical aspe... Read this post By: Rand Fishkin March 7, 2005 SES Conference NYC 2005 SEO Events It was an incredible event. For me, this was not only my first SES conference, but my first professional conference in the search industry. It was fantastic to see so many people that I only knew from their avatars and forum names. I believe the event helps to give a real sense of the S... Read this post By: Rand Fishkin March 1, 2005 Too Busy to Blog SEO Events This conference is insane. I'm literally too busy to share information with you. I have fantastic notes from every session, and Si is reporting from a completely seperate set of sessions - together we're trying to cover as much as possible in a meaningful way.The events of today includ... Read this post By: Rand Fishkin February 26, 2005 Deep Insight into the Corporate Culture & Business Strategy of Google Search Engines John Heilemann, who has been writing about companies in Silicon Valley for the last ten years, has one of the most comprehensive, critical & engaging pieces on the corporat... Read this post By: Rand Fishkin February 25, 2005 David Naylor - A Great Perspective Public Relations David Naylor, an SEO based in the UK (of which there are quite a few it seems), has a terrific, if brief blog on which he writes - Changing Face... Read this post By: Rand Fishkin February 24, 2005 Interview with Ask Jeeves Mobile SEO Mike Grehan, one of the most diligent and intuitive people in the search marketing industry, has conducted a fantastic interview with some of the top technology & business people at the Ask Jeeves engin... Read this post By: Rand Fishkin February 23, 2005 Yellow Shoes @ NYC SES Moz News It may seem unconventional to wear yellow sneakers with a suit, but that's what I'll be in on Monday the 28th - the first day of the Search Engine Strategies Conference. Look for a touch of yellow on the floor if you'd like to chat and feel free to criticize my Seattle fashion ... Read this post By: Rand Fishkin February 22, 2005 Keyword Phrases that Bring Conversions Keyword Research A report from emarketer today - Search Query Keyword Insight - details the results of some research over the pas... Read this post By: Rand Fishkin February 22, 2005 The Keyword Research Guru Keyword Research Rarely do I give a colleague praise so publicly, yet Dan Thies deserves it. His efforts are unmatched in the area of keyword research and targeting, an often under-appreciated specialty in the SEO business. Recently, Dan has started a ... Read this post By: Rand Fishkin February 22, 2005 Disambiguation & Homographs in Search Keyword Research For many designers & graphic artists, a first experience with disambiguation will be during an image search at a site like Getty One or Corbis. We'll conduct a search for \"marine\" and a pag... Read this post By: Rand Fishkin February 21, 2005 The Semantic Web Search Engines An article from the Scientific American, The Semantic Web, describes several examples of how semantic understanding by computers will help to revolutionize the utility of technology in... Read this post By: Rand Fishkin February 17, 2005 Web Standards & W3C Guidelines Design Web standards and code validation can often be a boring subject in the SEO and web development world. It's not fun to hack through the W3C's validation complaints about missing alt tags, improperly entered text symbols and incomplete div tags, but it is neccessary.... Read this post By: Rand Fishkin February 16, 2005 New Search Technology Forum @ SEOChat Public Relations The nice folks at SEOChat have made yours truly the moderator for a new section - the Search Technologies Forum. The description for this new area is: ... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Moz Blog"
    },
    {
      "level": "H2",
      "text": "IR Tools to Play with"
    },
    {
      "level": "H2",
      "text": "Jeff Dean of Google Speaks to UW"
    },
    {
      "level": "H2",
      "text": "SES Conference NYC 2005"
    },
    {
      "level": "H2",
      "text": "Too Busy to Blog"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Deep Insight into the Corporate Culture & Business Strategy of Google"
    },
    {
      "level": "H2",
      "text": "David Naylor - A Great Perspective"
    },
    {
      "level": "H2",
      "text": "Interview with Ask Jeeves"
    },
    {
      "level": "H2",
      "text": "Yellow Shoes @ NYC SES"
    },
    {
      "level": "H2",
      "text": "Never miss a beat. Get Moz Blogemail updates daily in your inbox"
    },
    {
      "level": "H2",
      "text": "Keyword Phrases that Bring Conversions"
    },
    {
      "level": "H2",
      "text": "The Keyword Research Guru"
    },
    {
      "level": "H2",
      "text": "Disambiguation & Homographs in Search"
    },
    {
      "level": "H2",
      "text": "The Semantic Web"
    },
    {
      "level": "H2",
      "text": "Web Standards & W3C Guidelines"
    },
    {
      "level": "H2",
      "text": "New Search Technology Forum @ SEOChat"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin"
}