{
  "url": "https://moz.com/blog/pagerank-link-patterns-the-new-flow-of-link-juice",
  "slug": "pagerank-link-patterns-the-new-flow-of-link-juice",
  "title": "PageRank, Link Patterns & the New Flow of Link Juice - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I'm back home from a day's trip to San Francisco. Despite the 3:30am wakeup time, it was a good day - 8 hours of talking SEO with some very smart, talented people. One of the many subjects we discussed was passing link equity and I think there are valuable lessons to be learned for everyone in the…",
  "content": "PageRank, Link Patterns & the New Flow of Link Juice On-page SEO By: Rand Fishkin May 1, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 1, 2007 PageRank, Link Patterns & the New Flow of Link Juice On-page SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I'm back home from a day's trip to San Francisco. Despite the 3:30am wakeup time, it was a good day - 8 hours of talking SEO with some very smart, talented people. One of the many subjects we discussed was passing link equity and I think there are valuable lessons to be learned for everyone in the search marketing (and web development) space. Let's start with a look at the typical patterns of external link equity that flows to sites: From experience, most of are familiar with this pattern. Our best content (or at least, our most Linkerati-appealing content) receives most of the inbound links. Meanwhile, more e-commerce or business focused pages receive very little link love. A great example is SEOmoz itself. Our premium membership page might be a page we'd like to be popular and rank well for queries (still need to do the KW research for that) but, it doesn't attract many external links, while our Page Strength Tool (which doesn't target any particular search phrases) has thousands of inbound links. Of course, not everyone's site falls into these patterns, which isn't neccessarily problematic, but can be an indicator of less-than-positive traits. As you might imagine, the pattern above could be a red flag to the engines that something's \"funny\" with the site. Maybe it's just a very small site (a restaurant or a local business), in which case the patterns might make sense. However, if it's a large e-commerce or content site, a pattern like this suggests that there's a lot of \"link building\" to the home page, but not much interest in the content from the linking community. The key takeaway is twofold, first - to build up a link profile that shows that both your site (homepage) and content (deep pages) are interesting to linkers and second - that those \"mountains\" of link-rich pages need to help their link poor, \"valley\" friends with some internal link juice love. In order to help these valleys, the mountains need to link, but how? where? when? Let's take a look: As you can see from the diagram, PageRank, the classic model of link flow through pages on the web, doesn't work the way it used to. The toolbar is an awful predictor of PR flow, and even though some remnants of the PR model may be in use at Google (and similar algorithms at the other engines), it's certainly not the end-all, be-all of linking practices. However, we still want something like this: Here are the \"best practices\" on the subject from my perspective: Use Google's Webmaster Central to sort link numbers to your site's page - make a list of everything that gets more than \"X\" links (in our case, we'd probably use something like 500, but for less-well-linked-to sites, that number might be 10 Determine the \"valley\" pages that need link juice and their relevance to your various \"mountain\" pages. You don't want to add links that are completely irrelevant and off-topic, and ideally, you'd even want to convert visitors from those link-rich pages into viewers of your link-poor pages. Use relevant, accurate anchor text from the \"mountains\" to the \"valleys\" Double-check with an outsider - do those links still look relevant and valuable to visitors? If not, refine and try again. You want to pass the link-juice, but not at the price of losing usability & potential inbounds to link-rich pages. In the old days of SEO, this practice meant linking from every page on the site to help pass the maximum PageRank, while limiting the total number of links on a page to as low as possible (to take advantage of the odd weighting system of the PR algo). Nowadays, a system like the one above will produce far more positive results. Obviously, at SEOmoz, we're doing a generally terrible job of following our own advice on this issue, but we'll get there :) p.s. For anyone who's emailed me since Saturday, I do apologize for the slow response - been very busy dealing with re-building a presentation, booking a single-day rountrip flight and giving a seminar. I'll be back to my usual responsive self by the end of today (only 132 emails to go!) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "PageRank, Link Patterns & the New Flow of Link Juice"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "PageRank, Link Patterns & the New Flow of Link Juice"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}