{
  "url": "https://moz.com/blog/pages-rank-in-one-geography",
  "slug": "pages-rank-in-one-geography",
  "title": "How to Diagnose Pages that Rank in One Geography But Not Another - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It's not uncommon to rank well in one locale and tank in another, even for sites without an intent to capture local queries. In today's Whiteboard Friday, Rand shows you how to diagnose the issue with a few clever SEO tricks, then identify the right strategy to get back on top.",
  "content": "How to Diagnose Pages that Rank in One Geography But Not Another Advanced SEO | Whiteboard Friday | Local SEO By: Rand Fishkin September 1, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 1, 2017 How to Diagnose Pages that Rank in One Geography But Not Another Advanced SEO | Whiteboard Friday | Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Are you ranking pretty well in one locale, only to find out your rankings tank in another? It's not uncommon, even for sites without an intent to capture local queries. In today's Whiteboard Friday, Rand shows you how to diagnose the issue with a few clever SEO tricks, then identify the right strategy to get back on top. Click on the whiteboard image above to open a high-resolution version in a new tab! Video TranscriptionHowdy, Moz fans, and welcome to this edition of Whiteboard Friday. This week we're going to chat about rankings that differ from geography to geography. Many of you might see that you are ranking particularly well in one city, but when you perform that search in another city or in another country perhaps, that still speaks the same language and has very similar traits, that maybe you're not performing well. Maybe you do well in Canada, but you don't do well in the United States. Maybe you do well in Portland, Oregon, but you do poorly in San Diego, California. Sometimes you might be thinking to yourself, \"Well, wait, this search is not particularly local, or at least I didn't think of it as being particularly local. Why am I ranking in one and not the other?\" So here's a process that you can use to diagnose. Confirm the rankings you see are accurate:The first thing we need to do is confirm that the rankings you see or that you've heard about are accurate. This is actually much more difficult than it used to be. It used to be you could scroll to the bottom of Google and change your location to whatever you wanted. Now Google will geolocate you by your IP address or by a precise location on your mobile device, and unfortunately you can't just specify one particular location or another — unless you know some of these SEO hacks.A. Google's AdPreview Tool - Google has an ad preview tool, where you can specify and set a particular location. That's at AdWords.Google.com slash a bunch of junk slash ad preview. We'll make sure that the link is down in the notes below. B. The ampersand-near-equals parameter (&near=) - Now, some SEOs have said that this is not perfect, and I agree it is imperfect, but it is pretty close. We've done some comparisons here at Moz. I've done them while I'm traveling. It's not bad. Occasionally, you'll see one or two things that are not the same. The advertisements are frequently not the same. In fact, they don't seem to work well. But the organic results look pretty darn close. The maps results look pretty darn close. So I think it's a reasonable tool that you can use. That is by basically changing the Google search query — so this is the URL in the search query — from Google.com/search?q= and then you might have ice+cream or WordPress+web+design, and then you use this, &near= and the city and state here in the United States or city and province in Canada or city and region in another country. In this case, I'm going with Portland+OR. This will change my results. You can give this a try yourself. You can see that you will see the ice cream places that are in Portland, Oregon, when you perform this search query. For countries, you can use another one. You can either go directly to the country code Google, so for the UK Google.co.uk, or for New Zealand Google.co.nz, or for Canada Google.ca. Then you can type that in.You can also use this parameter &GL= instead of &near. This is global location equals the country code, and then you could put in CA for Canada or UK for the UK or NZ for New Zealand. C. The Mozbar's search profiles - You can also do this with the MozBar. The MozBar kind of hacks the near parameter for you, and you can just specify a location and create a search profile. Do that right inside the MozBar. That's one of the very nice things about using it. D. Rank tracking with a platform that supports location-specific rankings - Some of them don't, some of them do. Moz does right now. I believe Searchmetrics does if you use the enterprise. Oh, I'm trying to remember if Rob Bucci said STAT does. Well, Rob will answer in the comments, and he'll tell us whether STAT does. I think that they do. Look at who IS ranking and what features they may have:So next, once you've figured out whether this ranking anomaly that you perceive is real or not, you can step two look at who is ranking in the one where you're not and figure out what factors they might have going for them. Have they gotten a lot of local links, location-specific links from these websites that are in that specific geography or serve that geography, local chambers of commerce, local directories, those kinds of things? Do they have a more hyper-local service area? On a map, if this is the city, do they serve that specific region? You serve a broad set of locations all over the place, and maybe you don't have a geo-specific region that you're serving. Do they have localized listings, listings in places like where Moz Local or a competitor like Yext or Whitespark might push all their data to? Those could be things like Google Maps and Bing Maps, directories, local data aggregators, Yelp, TripAdvisor, etc., etc. Do they have rankings in Google Maps? If you go and look and you see that this website is ranking particularly well in Google Maps for that particular region and you are not, that might be another signal that hyper-local intent and hyper-local ranking signals, ranking algorithm is in play there. Are they running local AdWords ads? I know this might seem like, \"Wait a minute. Rand, I thought ads were not directly connected to organic search results.\" They're not, but it tends to be the case that if you bid on AdWords, you tend to increase your organic click-through rate as well, because people see your ad up at the top, and then they see you again a second time, and so they're a little more biased to click. Therefore, buying local ads can sometimes increase organic click-through rate as well. It can also brand people with your particular business. So that is one thing that might make a difference here. Consider location-based searcher behaviors:Now we're not considering who is ranking, but we're considering who is doing the searching, these location-based searchers and what their behavior is like. Are they less likely to search for your brand because you're not as well known in that region? Are they less likely to click your site in the SERPs because you're not as well known? Is their intent somehow different because of their geography? Maybe there's a language issue or a regionalism of some kind. This could be a local language thing even here in the United States, where parts of the country say \"soda\" and parts of the country say \"pop.\" Maybe those mean two different things, and \"pop\" means, \"Oh, it's a popcorn store in Seattle,\" because there's the Pop brand, but in the Midwest, \"pop\" clearly refers to types of soda beverages. Are they more or less sensitive to a co-located solution? So it could be that in many geographies, a lot of your market doesn't care about whether the solution that they're getting is from their local region, and in others it does. A classic one on a country level is France, whose searchers tend to care tremendously more that they are getting .fr results and that the location of the business they are clicking on is in France versus other folks in Europe who might click a .com or a .co.uk with no problem. Divide into three buckets:You're going to divide the search queries that you care about that have these challenges into three different types of buckets: Bucket one: Hyper-geo-sensitive This would be sort of the classic geo-specific search, where you see maps results right up at the top. The SERPs change completely from geo to geo. So if you perform the search in Portland and then you perform it in San Diego, you see very, very different results. Seven to nine of the top ten at least are changing up, and it's the case that almost no non-local listings are showing in the top five results. When you see these, this is probably non-targetable without a physical location in that geography. So if you don't have a physical location, you're kind of out of business until you get there. If you do, then you can work on the local ranking signals that might be holding you back. Bucket two: Semi-geo-sensitive I've actually illustrated this one over here, because this can be a little bit challenging to describe. But basically, you're getting a mix of geo-specific and global results. So, for example, I use the &near=Portland, Oregon, because I'm in Seattle and I want to see Portland's results for WordPress web design. WordPress web design, when I do the search all over the United States, the first one or two results are pretty much always the same. They're always this Web Savvy Marketing link and this Creative Bloq, and they're very broad. They are not specifically about a local provider of WordPress web design. But then you get to number three and four and five, and the results change to be local-specific businesses. So in Portland, it's these Mozak Design guys. Mozak, no relation to Moz, to my knowledge anyway. In San Diego, it's Kristin Falkner, who's ranking number three, and then other local San Diego WordPress web design businesses at four and five. So it's kind of this mix of geo and non-geo. You can generally tell this by looking and changing your geography in this fashion seeing those different things. Some of the top search results usually will be like this, and they'll stay consistent from geography to geography. In these cases, what you want to do is work on boosting those local-specific signals. So if you are ranking number five or six and you want to be number three, go for that, or you can try and be in the global results, in which case you're trying to boost the classic ranking signals, not the local ones so you can get up there. Bucket three: Non-geo-sensitiveThose would be, \"I do this search, and I don't see any local-specific results.\" It's just a bunch of nationwide or worldwide brands. There are no maps, usually only one, maybe two geo-specific results in the top 10, and they tend to be further down, and the SERPs barely change from geo to geo. They're pretty much the same throughout the country. So once you put these into these three buckets, then you know which thing to do. Here, it's pursue classic signals. You probably don't need much of a local boost. Here, you have the option of going one way or the other, boosting local signals to get into these rankings or boosting the classic signals to get into those global ones. Here you're going to need the physical business. All right, everyone. I hope you've enjoyed this edition of Whiteboard Friday, and we'll see you again next week. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Diagnose Pages that Rank in One Geography But Not Another"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Diagnose Pages that Rank in One Geography But Not Another"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Confirm the rankings you see are accurate:"
    },
    {
      "level": "H2",
      "text": "Look at who IS ranking and what features they may have:"
    },
    {
      "level": "H2",
      "text": "Consider location-based searcher behaviors:"
    },
    {
      "level": "H2",
      "text": "Divide into three buckets:"
    },
    {
      "level": "H3",
      "text": "Bucket one: Hyper-geo-sensitive"
    },
    {
      "level": "H3",
      "text": "Bucket two: Semi-geo-sensitive"
    },
    {
      "level": "H3",
      "text": "Bucket three: Non-geo-sensitive"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}