{
  "url": "https://moz.com/blog/pagerank-sculpting-parsing-the-value-and-potential-benefits-of-sculpting-pr-with-nofollow",
  "slug": "pagerank-sculpting-parsing-the-value-and-potential-benefits-of-sculpting-pr-with-nofollow",
  "title": "PageRank Sculpting: Parsing the Value and Potential Benefits of Sculpting PR with Nofollow - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Thanks to the SEOmoz Q+A, we get to monitor a lot of the hot button issues that hit the SEO world, and as Jane noted to me during a meeting today, they always seem to come in waves. The latest buzz (and flurry of questions) comes around the practice of PageRank Sculpting. We've discussed this topic…",
  "content": "PageRank Sculpting: Parsing the Value and Potential Benefits of Sculpting PR with Nofollow Technical SEO By: Rand Fishkin October 14, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 14, 2008 PageRank Sculpting: Parsing the Value and Potential Benefits of Sculpting PR with Nofollow Technical SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Thanks to the SEOmoz Q+A, we get to monitor a lot of the hot button issues that hit the SEO world, and as Jane noted to me during a meeting today, they always seem to come in waves. The latest buzz (and flurry of questions) comes around the practice of PageRank sculpting. We've discussed this topic in some detail previously on SEOmoz (1, 2 and 3) and recently published a guide. However, with renewed interest comes a need for renewed focus. Does PageRank Sculpting Work? The simplest answer is yes. It definitely does work - the devil is in the details of how well and to what extent it brings value. However, anyone can set up a simple test to watch PageRank sculpting with nofollow in action. Just follow these simple steps: Create a new page in a test environment (either on a new domain or in a new section of an existing site). Point enough links to this new page to get it indexed in the three major search engines. There are a variety of methods to do this, but for testing sites, I like Jane's clever tactic of leveraging the social media link sources to get the engines visiting regularly and keeping it in the index. Create 10-20 links on the new page pointing to completely unique pages, targeting make-believe terms and phrases for which no search engine shows results (like yootermimitank). Wait for the engines to visit and see these new pages. Chances are, they won't index all of those new, nonsense word pages (particularly if you've pointed very small amounts of link juice to your test page). If they do index all of them, just keep adding links to new nonsense pages until they stop getting all of them. Start nofollowing those links a few at a time, until all the pages that remain with links pointing to them are in the engines' index. Remarkably, the engines all behave fairly similarly, and seem to have fairly similar thresholds for keeping a page in the index (though Yahoo! appeared to be the most lenient when I performed this test several months back). You've now used nofollow to \"sculpt\" where PageRank/link juice is pointing and through it, influenced which pages the engines keep in their index vs. discard. You're also directly observing the phenomenon of how a page splits its PageRank through the links it points to - fewer links means more juice per page, leading to a higher probability of being crawled and indexed. (BTW - for another fun test, try this one I wrote about at Sphinn a while back) This illustration shows the basic principle of link flow and how nofollow impacts it: Looking at the diagram above (which is overly simplistic, but illustrates the basic concept), if Google, for example, had a threshold of 1.4 link juice units to keep a page indexed or re-crawl every X days, this use of nofollow could be exceptionally valuable. It's also the exact behavior you can observe in the test above - at a certain level of link juice, the engines no longer keep the pages in their index and by using nofollow, we can flow more juice to the pages we care about. At the most basic level, the search engines are using PageRank (or whatever global popularity variable they calculate - StaticRank/WebRank/mozRank) to determine their threshold for indexation. I think Mr. Martinez's prescient comment on this topic (from an Eric Enge post last year) provides excellent insight: PageRank is now used as a quality filter on the other end — Google divides the Web into pages with sufficient PageRank (the elite pages admitted into the full Main Web Index) and pages with too little PageRank (the pages — probably the majority of Web documents — that are stored in the Supplemental Results Index). But Google also says it uses PageRank to help determine crawling priorities. In a natural crawling system PageRank would only be an indicator of the probability of a crawl, but Matt Cutts and other Google representatives have made it sound (to me) like Google actually favors pages which meet some internal PageRank threshold requirement... ...PageRank was never very important to RANKINGS, but now it has become extremely critical to INCLUSION. I somewhat disagree with his final sentence and believe that in many cases, PageRank (or global link popularity/juice) can play an important role in rankings, but I find his underlying logic very sound. Link juice, in whatever form it's calculated, appears to play a substantive role in both indexation and crawl rate. We use it inside Linkscape to help determine which pages are important and deserve crawling, just as the major search engines do, and I don't see it going away anytime soon. Does PageRank Sculpting Matter for My Site? That all depends on what kind of site you've got. When we've seen PageRank sculpting provide benefit, it's almost always on large domains with tens or hundreds of thousands of pages. In these types of environments, eliminating juice from passing through 5-10 links per page (everything from the copyright policy to the login/register links to the terms of service) can have a massive impact on how much juice flows down the category stream to the pages that need it most - new content and long-buried archives. Using it on much smaller sites with tight, carefully controlled link architecture hasn't produced the same sort of value. It also depends on the issues you're having. PR sculpting solves a very particular kind of problem - one where crawl rates and indexation of content are the primary concern. It's barely going to help you rank better for your primary terms on your site's homepage and it's certainly not going to make your site convert better or entice more people to link to you. Applying PR sculpting to problems like these would be akin to taking Viagra to help get rid of a sore throat - only in very weird circumstances could it help. :-) When Should I Engage in PageRank Sculpting? A lot of advice in the SEO world suggests that PR sculpting should be used only when all other methods for improving SEO are completed. I disagree strongly. My feeling is that using nofollow to flow link juice is something that should come up at the same time site architecture and link architecture does - when you're trying to figure out how to get the search engines to index all your content and find new content as quickly as possible. Building nofollow into a site's architecture intelligently from the start (or in the planning stages of a redesign) is almost always better than using it as a band-aid after the fact. Isn't PR Sculpting a Dead Giveaway that I'm an Evil SEO? Well, considering that nearly 1% of all pages on the web (according to Linkscape's crawl data) engage in internal nofollows to flow link juice, I'd say no. We're talking in the hundreds of millions of pages, so adoption is pretty rampant - more so, in fact, than 301 and 302 redirects combined! Huge sites like Technorati, Delicious, Reddit, About.com, Facebook and millions more are using it. The search engines themselves endorse the use of it and say publicly that it's not a flag for spam or manipulative activity. If you're incredibly paranoid about nofollow, do what clever SEOs (many of them black and gray hat) used to do back in the days before nofollow and use externally called javascript redirects or some other method for letting humans follow the links while search engines can't. PageRank sculpting has been around a lot longer than nofollow, and back in the early 2000s it was employed to great effect according to a few folks who did so back then. It achieves the same effect (and follows the same principle) - you've got links that engines can follow, and others that are just for human visitors. Well, I think PR Sculpting is a Waste of Time That's OK by me. There's a lot of differing opinion in the world of SEO, and this is certainly one where some SEO practitioners disagree. However, I'd urge you to, at the least, try some tests with it and make sure you're not missing out on opportunity before dismissing it entirely. After all, SEO is all about testing, refining and implementing based on data - from what we've seen in the projects we've worked on, it's been a positive tactic and one that, when done well, have a valuable impact on getting more pages included and new pages included more quickly (as well as occasionally helping long tail content rank better). Feel free to share your own thoughts around this - one question that nags at me is why this is suddenly a hot topic again... Was there an announcement or a trove of discussion on the issue that I missed during my week in New York? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "PageRank Sculpting: Parsing the Value and Potential Benefits of Sculpting PR with Nofollow"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "PageRank Sculpting: Parsing the Value and Potential Benefits of Sculpting PR with Nofollow"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}