{
  "url": "https://moz.com/blog/page-strength-one-week-later",
  "slug": "page-strength-one-week-later",
  "title": "Page Strength: One Week Later - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It's been a week since we launched the Page Strength SEO tool and I'd like to give an update on how things went and what lies ahead. First off, I'd like to apologize for the downtime on thursday morning.   The tool launched last monday and received a fair amount of traffic that lasted through…",
  "content": "Page Strength: One Week Later SEO Tools O By: Oatmeal July 17, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! O By: Oatmeal July 17, 2006 Page Strength: One Week Later SEO Tools The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. It's been a week since we launched the Page Strength SEO tool and I'd like to give an update on how things went and what lies ahead. First off, I'd like to apologize for the downtime on thursday morning. The tool launched last monday and received a fair amount of traffic that lasted through wednesday. Thursday morning, however, it got picked up by a few social bookmarking sites and the amount of page strength reports sky-rocketed. I noticed the server was acting really slow so I logged in and saw there were almost 100 simultaneous reports running at any given time. Our load average, which is usually less than 1.0, was hovering around 800. Moments later the server stopped responding and everything went down. Unfortunately this occurred an hour before I was supposed to fly out to san francisco, so after getting online at the airport I wrote a frantic email to our hosting company and managed to get our server rebooted. The server came back from the reboot and I managed to temporarily turn of the tool to keep the server alive until I could implement a better solution. The strange thing was that we launched on monday to avoid any hick-ups while I was traveling on thursday, but the tool didn't really get slammed until four days later. I've made a few changes and the tool is running as smooth as silk now. We've fetched and processed the page strength for around 20,000 unique URLs since we launched and overall reception of the tool has been very positive. SearchEngineWatch even put together a cool screencast that highlights some of the features of the tool. There are a few areas I'd like to improve upon: Better support for international domains Comparision functionality and the ability to view reports in the aggregate Overall improvement in reliability of data that is fetched, particularly incoming link data and the wayback machine Faster report times - we're going to be upgrading our servers soon which should help with this as well as prevent another server crash Integration of page strength into the keyword difficulty tool (replaces \"quick strength\"). Thanks to everyone who reviewed the tool and submitted feedback. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Page Strength: One Week Later"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Page Strength: One Week Later"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Oatmeal\n          \n            Oatmeal"
}