{
  "url": "https://moz.com/blog/paid-social-content-marketing-launches",
  "slug": "paid-social-content-marketing-launches",
  "title": "Paid Social for Content Marketing Launches - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Boosting your signal with paid social introduces your brand to new audiences and improves traffic and overall results for your content marketing launches. Today's Whiteboard Friday highlights four straightforward, actionable tactics you can use ASAP to make those launches shine.",
  "content": "Paid Social for Content Marketing Launches Content Marketing | Whiteboard Friday | Paid Search Marketing (PPC) By: Kane Jamison September 29, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Kane Jamison September 29, 2017 Paid Social for Content Marketing Launches Content Marketing | Whiteboard Friday | Paid Search Marketing (PPC) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Stuck in a content marketing rut? Relying on your existing newsletter, social followers, or email outreach won't do your launches justice. Boosting your signal with paid social both introduces your brand to new audiences and improves your launch's traffic and results. In today's Whiteboard Friday, we're welcoming back our good friend Kane Jamison to highlight four straightforward, actionable tactics you can start using ASAP. Click on the whiteboard image above to open a high-resolution version in a new tab! Video TranscriptionHowdy, Moz fans. My name is Kane. I'm the founder of a content marketing agency here in Seattle called Content Harmony, and we do a lot of content marketing projects where we use paid social to launch them and get better traffic and results.So I spoke about this, this past year at MozCon, and what I want to do today is share some of those tactics with you and help you get started with launching your content with some paid traction and not just relying on your email outreach or maybe your own existing email newsletter and social followers. Especially for a lot of companies that are just getting started with content marketing, that audience development component is really important. A lot of people just don't have a significant market share of their industry subscribed to their newsletter. So it's great to use paid social in order to reach new people, get them over to your most important content projects, or even just get them over to your week-to-week blog content. Social teaser contentSo the first thing I want to start with is expanding a little bit beyond just your average image ad. A lot of social networks, especially Facebook, are promoting video heavily nowadays. You can use that to get a lot cheaper engagement than you can from a typical image ad. If you've logged in to your Facebook feed lately, you've probably noticed that aside from birth announcements, there's a lot of videos filling up the feed. So as an advertiser, if you want to blend in well with that, using video as a teaser or a sampler for the content that you're producing is a great way to kind of look natural and look like you belong in the user's feed. So different things you can do include: Short animated videos explaining what the project is and why you did it. Maybe doing talking head videos with some of your executives or staff or marketing team, just talking on screen with whatever in the background about the project you created and kind of drumming up interest to actually get people over to the site. So that can be really great for team recognition if you're trying to build thought leadership in your space. It's a great way to introduce the face of your team members that might be speaking at industry conferences and events. It's a great way to just get people recognizing their name or maybe just help them feel closer to your company because they recognize their voice and face.So everybody's instant reaction, of course, is, \"I don't have the budget for video.\" That's okay. You don't need to be a videography expert to create decent social ads. There's a lot of great tools out there. Soapbox by Wistia is a great one, that's been released recently, that allows you to do kind of a webcam combined with your browser type of video. There are also tools like... Bigvu.tv Shakr Promo, which is a tool by a company called Slidely, I think. All of those tools are great ways to create short, 20-second, 60-second types of videos. They let you create captions. So if you're scrolling through a social feed and you see an autoplay video, there's a good chance that the audio on that is turned off, so you can create captions to let people know what the video is about if it's not instantly obvious from the video itself. So that's a great way to get cheaper distribution than you might get from your typical image ad, and it's really going to stick out to users because most other companies aren't spending the time to do that. Lookalike audiences Another really valuable tactic is to create lookalike audiences from your best customers. Now, you can track your best customers in a couple of ways: You could have a pixel, a Facebook pixel or another network pixel on your website that just tracks the people that have been to the site a number of times or that have been through the shopping cart at a certain dollar value. We can take our email list and use the emails of customers that have ordered from us or just the emails of customers that are on our newsletter that seem like they open up every newsletter and they really like our content. We can upload those into a custom audience in the social network of our choice and then create what's called a lookalike audience. In this case, I'd recommend what's called a \"one percent lookalike audience.\" So if you're targeting people in the US, it means the one percent of people in the US that appear most like your audience. So if your audience is men ages 35 to 45, typically that are interested in a specific topic, the lookalike audience will probably be a lot of other men in a similar age group that like similar topics. So Facebook is making that choice, which means you may or may not get the perfect audience right from the start. So it's great to test additional filters on top of the default lookalike audience. So, for example, you could target people by household income. You could target people by additional interests that may or may not be obvious from the custom audience, just to make sure you're only reaching the users that are interested in your topic. Whatever it might be, if this is going to end up being three or four million people at one percent of the country, it's probably good to go ahead and filter that down to a smaller audience that's a little bit closer to your exact target that you want to reach. So excellent way to create brand awareness with that target audience. Influencers The next thing I'd like you to test is getting your ads and your content in front of influencers in your space. That could mean... Bloggers Journalists Or it could just mean people like page managers in Facebook, people that have access to a Facebook page that can share updates. Those could be social media managers. That could be bloggers. That could even be somebody running the page for the local church or a PTA group. Regardless, those people are probably going to have a lot of contacts, be likely to share things with friends and family or followers on social media. Higher cost but embedded value When you start running ads to this type of group, you're going to find that it costs a little bit more per click. If you're used to paying $0.50 to $1.00 per click, you might end up paying $1.00 or $2.00 per click to reach this audience. That's okay. There's a lot more embedded value with this audience than the typical user, because they're likely, on average, to have more reach, more followers, more influence. Test share-focused CTAs It's worth testing share focus call to actions. What that means is encouraging people to share this with some people they know that might be interested. Post it to their page even is something worth testing. It may or may not work every time, but certainly valuable to test. Filters So the way we recommend reaching most of these users is through something like a job title filter. Somebody says they're a blogger, says they're an editor-in-chief, that's the clearest way to reach them. They may not always have that as their job title, so you could also do employers. That's another good example. I recommend combining that with broad interests. So if I am targeting journalists because I have a new research piece out, it's great for us to attach interests that are relevant to our space. If we're in health care, we might target people interested in health care and the FDA and other big companies in the space that they'd likely be following for updates. If we're in fashion, we might just be selecting people that are fans of big brands, Nordstrom and others like that. Whatever it is, you can take this audience of a few hundred thousand or whatever it might be down to just a few thousand and really focus on the people that are most likely to be writing about or influential in your space. Retarget non-subscribers The fourth thing you can test is retargeting non-subscribers. So a big goal of content marketing is having those pop-ups or call to actions on the site to get people to download a bigger piece of content, download a checklist, whatever it might be so that we can get them on our email newsletter. There's a lot of people that are going to click out of that. 90% to 95% of the people that visit your site or more probably aren't going to take that call to action.So what we can do is convert this into more of a social ad unit and just show the same messaging to the people that didn't sign up on the site. Maybe they just hate pop-ups by default. They will never sign up for them. That's okay. They might be more receptive to a lead ad in Facebook that says \"subscribe\" or \"download\" instead of something that pops up on their screen. Keep testing new messaging The other thing we can do is start testing new messages and new content. Maybe this offer wasn't interesting to them because they don't need that guide, but maybe they need your checklist instead, or maybe they'd just like your email drip series that has an educational component to it. So keep testing different types of messaging. Just because this one wasn't valuable doesn't mean your other content isn't interesting to them, and it doesn't mean they're not interested in your email list. Redo split tests from your site We can keep testing messaging. So if we are testing messaging on our site, we might take the top two or three and test that messaging on ads. We might find that different messaging works better on social than it does on pop-ups or banners on the site. So it's worth redoing split tests that seemed conclusive on your site because things might be different on the social media network. So that's it for today. What I'd love for you guys to do is if you have some great examples of targeting that's worked for you, messaging that's worked for you, or just other paid social tactics that have worked really well for your content marketing campaigns, I'd love to hear examples of that in the comments on the post, and we'd be happy to answer questions you guys have on how to actually get some of this stuff done. Whether it's targeting questions, how to set up lookalike audiences, anything like that, we'd be happy to answer questions there as well. So that's it for me today. Thanks, Moz fans. We'll see you next time. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Paid Social for Content Marketing Launches"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Paid Social for Content Marketing Launches"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Social teaser content"
    },
    {
      "level": "H2",
      "text": "Lookalike audiences"
    },
    {
      "level": "H2",
      "text": "Influencers"
    },
    {
      "level": "H3",
      "text": "Higher cost but embedded value"
    },
    {
      "level": "H3",
      "text": "Test share-focused CTAs"
    },
    {
      "level": "H3",
      "text": "Filters"
    },
    {
      "level": "H2",
      "text": "Retarget non-subscribers"
    },
    {
      "level": "H3",
      "text": "Keep testing new messaging"
    },
    {
      "level": "H3",
      "text": "Redo split tests from your site"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kane Jamison\n          \n            Kane Jamison\n          \n            Kane Jamison"
}