{
  "url": "https://moz.com/blog/panda-patent-brand-mentions",
  "slug": "panda-patent-brand-mentions",
  "title": "The Panda Patent: Brand Mentions Are the Future of Link Building - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If a recently filed patent is any clue, Google is now working on major algorithmic changes to measure authority outside of followed links. Find out more about how brand mentions play an increasingly important part in that mix.",
  "content": "The Panda Patent: Brand Mentions Are the Future of Link Building Advanced SEO By: Simon Penson April 30, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Simon Penson April 30, 2014 The Panda Patent: Brand Mentions Are the Future of Link Building Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. There has long been speculation about how Google actually measures \"brand authority.\" Many times over the past couple of years have those who speak outside of those fortified Googleplex walls made it clear that brand building is the way to win the organic visibility war. That statement however has always sounded wooly in the extreme. How is it possible to measure an almost intangible thing at scale and via a complex formula? If you are Google, it seems there is ALWAYS a way. A fairly innocent-looking patent filed last month, which some say could be the Panda patent may have gone some way to answering that question. Within this post we dive into that patent and other supporting evidence in an attempt to understand what the opportunity may be for digital marketers in the future. As part of that attempt, we offer our interpretation of various pieces of the patent itself, and also look at actual data to see if mentions are already playing a part in the ranking of sites. The patent in question, which can be found here and has been expertly covered by Bill Slawski, may cover the Panda Algorithm's key workings, but the piece we are really interested in right now is the information around measuring site authority and relevance using a ratio of links and mentions, or \"implied links.\" It's this specific area that got both the team here at Zazzle Media and also at Moz excited. You can see Cyrus Shepard and Rand Fishkin's reaction right here: I knew it! RT @CyrusShepard: This Google patent defines non-linking citations as \"implied links\" http://t.co/cOxv0irklk— Rand Fishkin (@randfish) March 26, 2014 So, what exactly does the patent imply? It is complex, wordy, and difficult to interpret, but it starts by talking about what Google calls \"reference queries:\" \"A reference query for a particular group of resources is a previously submitted search query that has been categorized as referring to a resource in the particular group of resources.\" To most of us, that statement appears as bad English at best, but there are a couple of ways this could be used. It first allows Google to look at what terms people have used previously through search to find and then click on a site, or group of sites. In doing so, it would then also allow them to \"map\" semantically relevant queries (and thus mentions of a brand) to a site in order to further extend an understanding of the \"popularity\" or \"authority\" of that entity. The patent also covers a mechanism for allowing Google to discount some links and give others greater weighting based on a modification factor: \"The method of claim 1, wherein determining a respective group-specific modification factor for a particular group of resources comprises: determining an initial modification factor for the particular group of resources, wherein the initial modification factor is a ratio of a number of independent links counted for the particular group to the number of reference queries counted for the particular group.\" This could be especially important where lots of links from the same company (or \"group\") point at a site, as the search engine could discount those from the true overall picture. It then also gives engineers the ability to look at \"quality\" as a measure of the overall relevance to the queried subject matter, which is called out in a separate bit of the patent: \"For example, the initial score can be, e.g., a measure of the relevance of the resource to the search query, a measure of the quality of the resource, or both.\" Then, the patent specifically mentions that links can either be \"express\" or \"implied,\" calling out non-linking mentions in a rather unmistakable way: \"The system determines a count of independent links for the group (step 302). A link for a group of resources is an incoming link to a resource in the group, i.e., a link having a resource in the group as its target. Links for the group can include express links, implied links, or both. [...] An implied link is a reference to a target resource, e.g., a citation to the target resource, which is included in a source resource but is not an express link to the target resource. Thus, a resource in the group can be the target of an implied link without a user being able to navigate to the resource by following the implied link. What does all this mean? It means that once a connection is made by someone typing in a brand name or other search query and then clicking on a site it creates a connection in Google's eyes. The search engine can then store that info and use it in the context of unlinked mentions around the web in order to help weight rankings of particular sites. If this is the Panda Patent, as it is part of a wider algorithm, it would also look at the quality of pages on a site and how \"commercial\" they are in their targeting – this was originally designed to negatively impact content farms that created content targeted aggressively at commercial terms – those that think \"search engine-first\" as opposed to \"audience-first.\" The patent publication was closely followed by a related Webmaster video by Matt Cutts within which the head of Google's webspam team talked about a \"forthcoming update\" that would look differently at how the search engine measures authority: By arguing that there is a difference between popularity and links, Cutts made clear that his engineers are looking very closely at how to continue to tweak the existing algo to make more popular sites rank higher. That's a big deal. Those two pieces of new evidence suggest there is a seismic shift underway in how links are weighted and how relevance is measured – the two building blocks of search. It's something Rand here at Moz first touched on back in late 2012 and I covered in detail in this post a few weeks later. In it I gave a little background into why Google is hell bent on getting away from the concept of a link-based economy: \"My view is that Google is really trying to clear up the link graph and with it valueless links so that it can clearly understand relevance and associations again. It's something that web 'creator' Tim Berners Lee first wrote about back in 2006 in this magazine article and Google has been talking about ever since, ploughing lots of cash into acquisitions to get it there. So, why invest so much time, effort and resource into such a game-changing project? Quite simply because its existing keyword based info retrieval model is in danger of being bettered by semantic search engines.\" Let's look into the how and why in a little more detail. Links Everybody who reads this article will be more than aware of the importance of links in building authority. A lot has changed in this space over recent years, however, as Google has developed systems to measure where the link is coming from and assign more (or less) value to it as a result. The next logical step in that process could be the downgrading of the follow link within the overall picture of ranking factors. It is something that has been expected for some time and was reiterated by Moz's own panel of experts in the annual Ranking Factor survey. We know that follow links have been gamed \"to death\" in the past, so it would make sense to make that particular element a little less important in the overall mix. Nofollows can still tell Google a lot about a site, as can how much people are talking about it. Nofollow By definition a nofollow link does not pass equity, or PageRank, to a site. We know that for certain. What is less clear is what, if anything, it does pass. Google certainly knows these links are there, and this latest patent could suggest they are taking a little more notice of them than they are letting on. The patent highlights the importance of \"reference queries\" and \"implied links,\" and also that Google looks to discount links from the same \"group\" or brand and instead wants to concentrate on independent links from unassociated domains. Critically, PageRank is not mentioned, which suggests that other factors are being measured in terms of how much equity is being passed by each independent link, or mention. Mentions It is the \"implied link\" element that makes most interesting reading, as it is black-and-white evidence that Google is looking at mentions as a measure of authority. It is logical, after all, that a popular brand would have more people talking about it online than one that is simply good at manipulating the algorithm and has invested heavily in link building to that end. The results from our sample research also support this, with larger, better-known brands generally attracting greater numbers of mentions than others. Testing Of course, the question remains, is this already in use? To test this properly would require a monumental amount of measurement across a plethora of verticals over an extended period of time, and sadly, I did not have the time or resources to run that project for the sake of this post, but it is still worth sharing some of the data and an overview of what may be going on. The caveat here is absolutely that this does NOT constitute any kind of fact-finding mission, simply an informed commentary on a few anomalies that cannot be explained simply by looking at follow links alone. To discover if there are any initial signs that this kind of system may already be in effect, I spent some time analyzing three separate, random SERPs here in the UK. They were: \"Car Insurance\" \"Mortgage Calculator\" \"Mens Clothing\" All three are competitive terms and are \"owned\" in the main by what we might know as brands in the wider world. Below you can see a simple chart for each of these, showing: Follow links Nofollow links Follow/nofollow ratio The number of brand mentions in the last four weeks Ratio between links and mentions Clearly this isn't a scientific study, but it does serve as a \"finger in the air\" analysis from which a few interesting observations can be made. The first two tables contain data examining the whole domain's link profile, while the third looks specifically at links to the URL indexed for the particular term we are analyzing. The raw data is below and here is an explanation of where that data was drawn from: Position – Records what position we saw the domain in for the given search term in google.co.uk. Follow link – for the first two ('Car Insurance' and 'Mens Clothing') this is the number of follow links across the whole domain. For 'mortgage calculator' it records just the follow links into the specific URL indexing for that term. The data is from AHREFS. As above but for no follow links. The number of referring domains into the domain ('Car Insurance' and 'Mens Clothing') and the URL ('Mortgage Calculator'). Mentions – How many mentions of the brand there have been in the last four weeks (as taken from Moz Fresh Web Explorer and using exact match brand term only). Ratio of follow to no follow links – Designed to see if there is a correlation with this and position. Ratio of links to mentions – A look at the relationship between how many links a site has and how many mentions in the previous four weeks. Let's now look at each table in a little more detail but with the understanding that there are a myriad of other factors that affect the result. After each piece of analysis I have added general comments: \"Car insurance\" Despite having considerably fewer links overall across the domain, Go Compare is first. Does this suggest they have hit a sweet spot in terms of links versus mentions and brand metrics? Money Supermarket proves that more links doesn't win. The site has many, many more than anyone else in the top five and yet is not first. Link volume clearly matters, but it is absolutely not the only factor at play. Do Compare the Market and Confused \"win\" and feature in the top five on the strength of their mention data? A higher ratio than the top three but MUCH lower link numbers suggests that might be the case. LV.com is the anomaly as its mention to link ratio is low. This suggests that sheer numbers of links are potentially helping it rank well as well as on-page factors that make the brand super-relevant for car insurance. \"Mens clothing\" ASOS and House of Fraser walk away with it here, and interestingly both of these sites have very similar ratios for both follow and no-follow links AND for links and mentions. Next is an anomaly but only because measuring true mentions is very hard due to the brand having a \"generic\" word as its \"brand.\" Could this cause issues for Google going forward in measuring similar brands? Again, Burton (in particular) and Topman to a degree show that you can earn your place with high link-to-mention ratios. Topman should rank higher. Is it because of link quality? Certainly the ratio of follow to nofollow is lower than those above them. \"Mortgage calculator\" This batch looks just at the URL ranking for the term, not the whole domain, to allow us to see both sides of the story. The BBC clearly runs away with it in every sense and by these figures would be almost impossible to usurp. The data is less correlated here; suggesting that domain-wide factors are definitely at play in factoring which URL should rank where. NatWest is a really interesting result as it has very few links relative to those around it. The ratio of no-follow-to-follow is very high, and the brand gets a lot of mentions. The site is also very relevant for \"mortgages\" as a percentage of overall content. As a further piece of analysis we have also included a \"random\" site from page two to support the concept that a combination/ratio of links to mentions affects rankings. That site is woolwich.co.uk, a small UK building society (bank). Its own mortgage calculator page was ranking 16th when we ran the analysis, and interestingly, we can see that its ratio of follow-to-nofollow is low, as is the number of mentions of the brand in the past four weeks. On pure followed link numbers the site should rank top five, but instead it languishes on page two. Is there a perfect ratio? It's clear that the small sample above is no true reflection of how the ratio of links to mentions affects rankings, but it has certainly raised some interesting points for further discussion and testing. What certainly can be said is that the measurement of brand mentions is certainly possible, and Google certainly now has the patent to cover it off as a potential ranking factor. Mentions alone do not tell the whole story, of course, and links are still very important in the overall mix of factors that affect rankings, but it is now time to start thinking about how you can create brand buzz and grow those mentions. The possible good news for the smaller guys, though, is that it does seem that Panda is beginning to look at how much of a site is relevant to any one specific term and giving over extra \"authority\" to that site in that niche. A great example are the building societies in the UK that rely on mortgages to make up the majority of their business. As a result they do seem to rank better for mortgage-related terms. This could really help specialist businesses compete again with the \"big guys.\" What can you do? The key point here is how you can utilize this data to improve your own strategy, and while there is no conclusive proof that mentions and nofollow links matter, the evidence is starting to pile up. Given what Mr. Cutts said in the video we mention earlier in the post, the patent for Panda and increasing amounts of data highlighting similar findings, the argument is certainly there. My advice would be to begin thinking outside of follow links. Be happy to earn (and build) nofollowed links and mentions. Think outside the link, because there IS value in driving mentions and building brand. How do you do that? The simple answer is to get creative with your communications strategy and build content that will make people talk about you and share. At the heart of that is a great ideation process, and I have previously shared Zazzle Media's own way of creating great ideas consistently here. Think particularly around creating content that plays on core emotions and also give things away. In a detailed report first shared in 2010, titled \" Social Transmission, Emotion, and the Virality of Online Content,\" the authors discovered there is a strong relationship between emotion and how likely it is your content will \"go viral.\" Amongst the many eye-opening discoveries the publication discusses: Negative content tends to be less viral than positive content Awe-inspiring content and content that surprises or is humorous is more likely to be shared Content that causes sadness can become viral but is generally less likely to Content that evokes anger is more likely to be shared And finally, make sure you start tracking and reporting mentions and nofollowed links. Knowing how you are performing can help you iterate your PR and content strategies to achieve greater traction. In short, compelling content, created over the long term WILL now win, as it is being rewarded. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Panda Patent: Brand Mentions Are the Future of Link Building"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Panda Patent: Brand Mentions Are the Future of Link Building"
    },
    {
      "level": "H2",
      "text": "Links"
    },
    {
      "level": "H2",
      "text": "Nofollow"
    },
    {
      "level": "H2",
      "text": "Mentions"
    },
    {
      "level": "H2",
      "text": "Testing"
    },
    {
      "level": "H3",
      "text": "\"Car insurance\""
    },
    {
      "level": "H3",
      "text": "\"Mens clothing\""
    },
    {
      "level": "H3",
      "text": "\"Mortgage calculator\""
    },
    {
      "level": "H2",
      "text": "Is there a perfect ratio?"
    },
    {
      "level": "H2",
      "text": "What can you do?"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Simon Penson\n          \n            Simon Penson\n          \n            Simon Penson"
}