{
  "url": "https://moz.com/blog/passionate-users-blog",
  "slug": "passionate-users-blog",
  "title": "Passionate Users Blog - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "After being dissapointed in the past with where 9Rules was pointing me, I came across a truly worthwhile blog today - Creating Passionate Users...",
  "content": "Passionate Users Blog Online Advertising By: Rand Fishkin December 20, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 20, 2005 Passionate Users Blog Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. After being dissapointed in the past with where 9Rules was pointing me, I came across a truly worthwhile blog today - Creating Passionate Users (I'm gonna call them CPU for brevity's sake). The team behind the posts is terrific at conveying simple and complex messages in a fun, easy-to-remember way and the content they produce is the kind that makes you scratch your head and dream about how you can apply it with your own business (kinda like EGOL's posts here at SEOmoz). Some recent favorites include: You are a Marketer, Deal with it - wherein CPU humorously deals with the frequent resentment felt towards marketers and then tell us that we're all marketers. I expecially dig the chart contrasting old-school marketing and neo-marketing. Is it Memorable - CPU explores the connection between emotion and memory and gives some good ideas for making your branding and message memorable to your viewers. Crafting a User Experience - It doesn't deal with UI the way U and I (I'm so punny) might think of it, but this short post delivers exactly the right idea about how to engage and treat users in an automated process. Tool builders, software developers, online application writers, even the creative website builder will all benefit from taking this advice. I'll let you read and explore the rest of the site for yourself. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Passionate Users Blog"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Passionate Users Blog"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}