{
  "url": "https://moz.com/blog/paul-graham-on-the-silicon-valley-startup-environment",
  "slug": "paul-graham-on-the-silicon-valley-startup-environment",
  "title": "Paul Graham on the Silicon Valley Startup Environment - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Suw Charman is covering Xtech in Amsterdam. Today she put up a fascinating presentation from Paul Graham - How American are Startups?\nThere's no direct relationship to SEO here, and the content is slightly un-PC (giving it that rough...",
  "content": "Paul Graham on the Silicon Valley Startup Environment Social Media By: Rand Fishkin May 17, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 17, 2006 Paul Graham on the Silicon Valley Startup Environment Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Suw Charman is covering Xtech in Amsterdam. Today she put up a fascinating presentation from Paul Graham - How American are Startups? There's no direct relationship to SEO here, and the content is slightly un-PC (giving it that rough, exceptionally honest quality). After reading Paul's other articles (including an excellent rant on Web2.0), I shouldn't be surprised to find excellent advice and insight in his live work. Some partcicularly good excerpts stuck with me: Could you recreate Silicon Valley elsewhere? With the right 10,000 people, yes. It used to be that geography was important, but now it's having the right people. You need two kinds of people to create a start-up: rich people and nerds. Towns become start-up hubs when there are rich people and nerds. NYC could not be a start-up hub because there are lots of rich people but no nerds. Result: no start-ups. Pittsburgh has the opposite problem - lots of nerds, no rich people. Uni of Washington yeilded a hi-tech community in Seattle, but Pittsburgh has a problem with the weather I never thought of Seattle as reliant on the Univ. of WA for its startup environment, but since I dropped out to start SEOmoz (in 2000) it's tough to argue. Any town's personality needs to have a good nerd personality. Nerds like towns where people walk around smiling, so not LA because people don't walk around, or NYC where people don't smile. Nerds will pay a premium to live where there are smart people. They like quiet, sunlight, hiking. A nerd's idea of paradise is Berkeley or Boulder. The start-up hubs in the US are very young-feeling, but not new towns. Want a place that tolerates oddness. Get an election map and avoid the red bits. I have to chuckle at this... Seattle is a big \"walk-around\" town and it's also close to great hiking. And yes, we've got a big left-lean and a terrific crop of \"nerds\" (which I take pride in). (The proper environment) Need(s) really good (universities), and the US has those. Outside of the US, people think of Cambridge in the UK, then pause. The best professors seem to be all spread out, instead of concentrated, so that hinders them because they don't have good colleagues, and their institutions don't act as a Mecca. Germany used to have the best universities, until the 30s. If you took all the Jews out of any university in the US, there'd be a huge hole, so as there are few Jews in Germany, perhaps that would be a lost cause. Like I said, Paul's not particulary keen on staying politically correct, but he certainly makes for good reading. The full article is worth at least 10 minutes of your time. I read it this morning and it's been sticking in my head all day. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Paul Graham on the Silicon Valley Startup Environment"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Paul Graham on the Silicon Valley Startup Environment"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}