{
  "url": "https://moz.com/blog/penguins-pandas-and-panic-at-the-zoo",
  "slug": "penguins-pandas-and-panic-at-the-zoo",
  "title": "Penguins, Pandas, and Panic at the Zoo - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In the aftermath of Google's Penguin update, there's no shortage of panic. Like any algorithm update, you need to assess the damage - here are some dos and don'ts to keep you from making a bad situation worse.",
  "content": "Penguins, Pandas, and Panic at the Zoo Search Engines By: Dr. Peter J. Meyers May 2, 2012 Table of Contents Copied! By: Dr. Peter J. Meyers May 2, 2012 Penguins, Pandas, and Panic at the Zoo Search Engines Google’s war on lovable critters escalated on April 24th with the release of the “Penguin” update (originally dubbed the “webspam update” by Google). While every major algorithm update causes some protest, post-Penguin panic seems to be at near record levels, worsened by weeks of speculation about an “over-optimization” penalty. Webmasters and SEOs are understandably worried, and many have legitimately lost traffic and revenue. Before you go out and burn your website to the ground for fear of a penguin in the pantry, I want to offer some advice on how to handle life after an algorithm update. 1. What We Know First, let’s review what we know. I’m going to break the rules of blogging and recommend that you stop and read this level-headed Penguin post by Danny Sullivan. It covers some of the basics and is the most speculation-free post I’ve read on the subject so far. Glenn Gabe also had a good post on potential Penguin factors. There’s still a lot of speculation, but likely culprits include: Aggressive exact-match anchor text Overuse of exact-match domains Low-quality article marketing & blog spam Keyword stuffing in internal/outbound links Many people have suggested low-quality link profiles in general, but analysis of Panda has been complicated by Google’s recent attack on link networks, which seems to have been manual and has probably been going on for weeks. The overlap has made analysis difficult, so let’s take a quick look at the timeline. What’s the Timeline? The official roll-out date for Penguin was April 24th, and it seems to have rolled out, for the most part, in a single day. Unfortunately, it came on the heels of other events. On April 19th, Panda 3.5 rolled out (most likely a data update). On April 16th, a data glitch caused a number of sites to be mistakenly tagged as parked domains. Throughout April (and weeks before Penguin), Google started sending out a large number of unnatural link notices via Google Webmaster Tools. Sadly, it seems that April really was the cruelest month. How Bad Was It? Google officially claimed that Penguin impacted about 3.1% of English queries, compared to Panda 1.0’s 12%. Since rankings change daily – even hourly – even with no updates, these numbers are nearly impossible to confirm, but it does appear that the impact of Penguin was immediate and substantial. This is an internal SEOmoz graph of Top 10 ranking changes around April 24th (please note that the Y-axis is scaled to accentuate changes): Pardon the slightly cryptic nature of this graph – it’s for an upcoming project – but the core point is that the impact of Penguin dwarfed either Panda 3.5 or Google’s 4/16 glitch. Is It Going Away? In a word: no. Penguin wasn’t accidental, and Google is clearly serious about combatting spam tactics that have been lingering for too long. As you can see from the graph, it doesn’t appear that there were any major reversals in the few days since Penguin rolled out. Does that mean Google won’t make ANY adjustments? Of course not – it’s entirely likely that they’ll continue to tweak Penguin. For comparison’s sake, remember that Panda 3.5 came 14 months after the initial launch of Panda 1.0. We’ve come a long way since the monthly “Google Dances” of 2003. Keep in mind, though, that Panda was somewhat unique – we believe that it feeds multiple variables into a single ranking factor that gets updated outside of the real-time index. There’s currently no compelling evidence to suggest that Penguin works in the same way. The Penguin update appears to be integrated directly into the main algorithm, like a more traditional Google update. Update (May 11, 2012): Google seems to have confirmed that Penguin is operating similarly to Panda, with data updates occuring outside of the main index. It appears that my initial assumptions on that were incorrect. Danny Sullivan has a good follow-up piece on Penguin today, with some direct feedback from Google. It's not good news, for the most part, but it's a very useful read. 2. What to Do Given the overlapping timelines, this advice applies to any Google update, and not just Penguin. The algorithm is changing constantly (Google reported 516 changes in 2010, and that rate seems to be accelerating), and I want to give you the tools to survive not just Penguin, but Zebra, Skunk, Orca, and any other black-and-white animals Google can ruin… DO Take a Deep Breath I’m not trying to be condescending or to minimize any losses you may have suffered. Over 17 years of working with clients, I’ve learned that panic almost never makes things better. No matter how hard Penguin hit you, you need to stop, take a breath, and assess the damage. Dig into your analytics and find out exactly where you sustained losses. Segment your data (by channel, engine, keyword, and page) as much as possible. It’s not enough to know that you lost traffic – you need to be an expert on exactly which traffic you lost. DO Check the Timeline Even though the overlapping timelines make analyzing the core Penguin factors difficult, the actual timeline when Penguin rolled out is clear. If you saw major traffic losses between Tuesday, April 24th and Wednesday, April 25th, odds are good that Penguin is at least part of the problem. DO Double-check IT Issues I can’t tell you how many times I’ve been involved in a Q&A or consulting situation where a website owner was 100% sure they had been hit by an algorithm update, only to have their 17th message to me go something like this: Oh, by the way, our site was down for 3 days a couple of weeks ago, right before our rankings dropped. I’m sure this wasn’t the problem, but I just thought I’d let you know. Um, erp, what?! I’ve died a little inside so many times from messages like this that I’m not sure that I’m technically still human. Especially if your losses weren’t sudden or don’t match the algorithm timeline precisely, make absolutely sure that nothing happened to your site or changed that could impact Google’s crawlers. One of the worst things you can do in SEO is to spend a small fortune solving the wrong problem. DO Quickly Audit Your SEO Likewise, make sure that you know exactly what SEO efforts are underway, not just within your own team but across any 3rd-party contractors. I’ve had clients swear up and down that everything they did was completely white-hat only to find out weeks later that they hired an outside link-building firm and let them loose with no accountability. Make absolutely sure you know what every agent under your control did in the weeks leading up to the algorithm update. 3. What Not to Do Panic leads to drastic action, and while I don’t think you should sit on your hands, bad choices made under uninformed hysteria can make a bad situation much, much worse. I’m not speaking hypothetically – I’ve seen businesses destroyed by overreacting to an algorithm change. Here are a few words of advice, once you’ve taken that deep breath (don’t forget to start breathing again)… DON’T Take a Hatchet to Your Links It’s unclear how Penguin may have penalized links, or if recent reports of link-related issues are tied to other April changes, but regardless of the cause, the worst thing you can do is to start simply hacking at your back-links. Even low-quality back-links can, in theory, help you, and if you start cutting links that aren’t causing you problems, you could see your rankings drop even farther. I highly recommend this recent interview with Jim Boykin, because Jim has freely admitted to dabbling in the gray arts and he knows what he’s talking about when it comes to risky link-building. Tackling your problem links is incredibly tough, but start with the worst culprits: Known, obvious paid links Links in networks Google has recently delisted Footer links with exact-match anchor text Other site-wide links with exact-match anchors Whenever possible, deal with low-authority links first. If a link is passing very little authority AND it’s suspicious, it’s a no-brainer. Cutting links is tough (see my tips on removing bad links) – if you don’t have control over a link, you may have to let it go and focus on positive link-building going forward. DON’T “De-optimize” Without a Plan One complaint I hear a lot in Q&A is that the “wrong” page is ranking for a term. So, to get the “right” page to rank, the well-meaning SEO starts de-optimizing the page that’s currently ranking. This usually means turning a decent TITLE tag into a mess and cutting out keywords to leave behind Swiss-cheese copy. Sometimes, the “right” page starts ranking again. Other times, they lose both pages and their traffic. “Over-optimize” is a terrible phrase, and that alone has people in a panic. There’s nothing “optimal” about jamming a keyword 87 times into 500 words of copy and linking it to the same affiliate site. “Over-gaming” would be a better word. You think you figured out the rules of the game, so you pounded on them until there was nothing but a pile of dust on the board. If you think you’ve played the game too aggressively, step back and look at the big picture. Does your content serve a purpose? Does your anchor text match the intent of the target? Do your pages exist because they need to or only to target one more long-tail variations of a term? Don’t de-optimize your on-page SEO – re-optimize it into something better. DON’T Submit a Reconsideration Request While I don’t think reconsideration will doom you, Penguin is an algorithmic change, not a manual penalty, and reconsideration is not an appropriate avenue. If you think you were impacted by the recent crackdown on link networks, IF you have removed those links, and IF you aren’t engaged in other suspicious link-building, you might consider requesting reconsideration. Just make sure your house is in order first. Google has created a form for sites unfairly hit by Penguin, but it’s unclear at this point whether that form will result in manual action, or if Google is just collecting broad quality data. If you sincerely believe that you’re an accidental victim, then feel free to fill the form out, but don’t base your entire recovery strategy on clicking [Submit]. Fix What You Can Fix Recently, I had a long debate with a client about whether or not they had been hit by a specific algorithm update. In the end, it was a pointless debate (for both of us), because we had two clear facts: (1) organic traffic had fallen precipitously, and (2) there were clear, solvable problems with the site. From a diagnostic standpoint, it definitely helps to know whether you were hit by Penguin or another update, but after that, you have to fix what's in your power to fix. Don't spend weeks trying to prove to management that this was all Google's fault. Isolate the damage, find the problems you can fix, and get to work fixing them. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Penguins, Pandas, and Panic at the Zoo"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Penguins, Pandas, and Panic at the Zoo"
    },
    {
      "level": "H2",
      "text": "What’s the Timeline?"
    },
    {
      "level": "H2",
      "text": "How Bad Was It?"
    },
    {
      "level": "H2",
      "text": "Is It Going Away?"
    },
    {
      "level": "H2",
      "text": "DO Take a Deep Breath"
    },
    {
      "level": "H2",
      "text": "DO Check the Timeline"
    },
    {
      "level": "H2",
      "text": "DO Double-check IT Issues"
    },
    {
      "level": "H2",
      "text": "DO Quickly Audit Your SEO"
    },
    {
      "level": "H2",
      "text": "DON’T Take a Hatchet to Your Links"
    },
    {
      "level": "H2",
      "text": "DON’T “De-optimize” Without a Plan"
    },
    {
      "level": "H2",
      "text": "DON’T Submit a Reconsideration Request"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}