{
  "url": "https://moz.com/blog/people-also-ask-how-to-take-advantage",
  "slug": "people-also-ask-how-to-take-advantage",
  "title": "People Also Ask | 5 Key Facts & How to Optimize for PAA - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "People Also Ask boxes represent growing opportunity in the SERPs, but they're not the most straightforward SERP feature around. Learn all about PAAs and how you can start optimizing for them today.",
  "content": "5 Things You Should Know About \"People Also Ask\" & How to Take Advantage Advanced SEO | Search Engines By: Samuel Mangialavori October 21, 2019 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Samuel Mangialavori October 21, 2019 5 Things You Should Know About \"People Also Ask\" & How to Take Advantage Advanced SEO | Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. It's undeniable that the SERPs have changed considerably in the last year or so. Elements like featured snippets, Knowledge Graphs, local packs, and People Also Ask have really taken over the SEO world — and left some of us a bit confused. In particular, the People Also Ask (PAA) feature caught my attention in the last few months. For many of the clients I've worked with, PAAs have really had an impact on their SERPs. If you are anything like me, you might be asking yourself the same questions: How important are these SERP features? How many clicks do they “steal” from SEO?And most importantly: who are these people that also ask SO MANY questions? Somehow, I always imagine the hipster-looking man from Answer the Public being the leader of such a group of people... The first part of the post focuses on five things I've learned about People Also Ask, while the second part outlines some ideas on how to take advantage of such features. Let’s get started! Here are five things you should know about PAAs. 1. PAA can occupy different positions on the SERP I don’t know about you all, but I wasn't fully aware of the above until a few months ago; I just assumed that most of the time PAAs appeared in the same location, IF and only IF it was actually triggered by Google. I didn't really pay attention to this featured until I started digging into it. Distinct from featured snippets (which appear always at the top of the SERP), PAAs can be located in several different parts of the page. Let’s look at some examples: Keyword example: [dj software] Example of SERP where PAA is at the top of the page For the keyword [dj software], this is what the SERP looks like: 3 PPC adsRelated videos4 PAA listings at the top of the page10 organic results Keyword example: [cocktail dresses under 50 pounds] Example of SERP where PAA is in the middle of the page For the keyword [cocktail dresses under 50 pounds], this is what the SERP looks like: Shopping ads1 PPC adImage carousel3 organic results4 PAA listings in the middle of the page Keyword example: [tv unit] Example of SERP where PAA is at the bottom of the page For the keyword [tv unit], this is what the SERP looks like: Shopping ads1 PPC ad10 organic results3 PAA listings at the bottom of the page Why does this matter to you? Understanding the implications of the different positions of PAA in the SERPs impacts organic results’ CTR, especially on mobile, where space is very precious. 2. Do PAAs have a limit? I'm just giving away the answer now: No-ish. This feature has the ability to trigger a potentially infinite number of questions on the topic of interest. As Britney Muller researched in this Moz post, the initial 3–4 listing could continue into the hundreds once clicked on, in some cases. With one simple click, the 4 PAA questions can trigger three more listings, and so on and so forth. Has the situation changed at all since the original 2016 Moz article? Yes, it has! What I'm seeing now is actually very mixed: PAAs can vary extensively, from a fixed number of 3–4 listings to a plethora of results. Let’s look at an example of a query that's showing a large number of PAAs: Keyword example: [featured snippets] Example of SERP where the number of PAA expands when clicked upon, and is not fixed For the query [featured snippets], the PAA listings can be expanded if clicked on, which process generates a large number of new PAA listings that appear at the bottom of such SERP feature. For other queries, Google will only show you 4 PAA listings and such number will not change even if the listings get clicked on: Keyword example: [best italian wine] Example of SERP where the number of PAA listings is fixed and does not expand For the query [best italian wine], the PAA listings cannot be expanded, no matter how many times you hover or click on them. Interestingly, it also appears that Google does not keep this feature consistent: a few days after I took the above screenshots, the fixed number of PAAs was gone. On the other hand, I've recently seen instances where the keywords have a fixed amount of only 3 PAAs instead of 4. Now, the real question for Google would be: “What methodology are they using to decide which keywords trigger an infinite amount of PAAs and which keywords cannot?” As you might have guessed by now, I don’t have an answer today. I'll continue to work on uncovering it and keep you folks posted when/if I get an answer from Google or discover further insights. My two cents on the above: The number of PAAs does not relate to particular verticals or keywords patterns at the moment, though this may change in the future (e.g. comparative keywords more or less inclined to a fixed amount of PAAs.) Google’s experiments will continue, and they may change PAAs quite a bit in the next one to two years. I wouldn't be surprised if we saw questions being answered in different ways. Read the next point to know more! Why does this matter to you? From an opportunity standpoint, the number of questions you can scrape to take advantage of will vary. From a user standpoint, it impacts your search journey and offers a different number of answers to your questions. 3. PAAs can trigger video results I came across this by reading an article on Search Engine Roundtable. Example PAA with video results I wasn't able to replicate the above result myself in London — but that doesn't matter, as we're used to seeing Google experimenting with new features in the US first. Answering a PAA listing with a video makes a lot of sense, especially if you consider the nature of many of the queries listed: What is...How to...Why is/are... And so on. I expect this to be tested more and more by Google, to a point where most of the keywords that are currently showing video results in the SERPs will trigger video results in the PAA listings, too. Keyword example: [how to clean suede shoes diy] Example of SERP for keywords that often trigger video results Video results will matter more and more in the near future. Why is that? Just examine how hard Google is working on the interpretation and simplification of video results. Google has added key moments for videos in search results (read this article to know more). This new feature allows us to jump to the portion of the video that answers our specific query. Why does this matter to you? From an opportunity standpoint, you can optimize your YouTube and video results to be eligible to appear in PAAs. From a user standpoint, it enriches your search journey for PAA queries that are better answered with videos. 4. PAA questions are frequently repeated for the same search topic and also trigger featured snippets This might be obvious, but it's important to understand these three points: Most PAA questions also trigger featured snippetsThe same PAA question (& answer) can be triggered for different keywordsThe same answer/listing that appears for a certain question in a PAA can also appear for different questions triggered by PAAs Let’s look at some examples to better visualize what I mean: 1. PAA questions also trigger Featured Snippets Keyword 1: [business card ideas] Keyword 2: [what is on a good business card?] Example of PAA listings for case n.1 The keyword [business card ideas] triggers some PAA listings, whose questions, if used as the main query, trigger a featured snippet. 2. Different keywords can trigger the same PAA question and show the same result. The same listing that appears for a PAA question for keyword X can also appear for the same question, triggered by a different keyword Y. Keyword 1: [quality business cards] Keyword 2: [business cards quality design] Example of PAA listings for case n.2 To summarize: Different keywords, same question in the PAA and same listing in the PAA. 3. Different questions listed in a PAA triggered by different keywords can show the same result. The same listing that appears for a PAA question for keyword X can also appear for the same question, triggered by a different keyword Y. Keyword 1: [quality business cards] Keyword 2: [best business cards online] Example of PAA listings for case n.3 To summarize: Different keywords, different question in the PAA but same listing in the PAA. The above keywords are clearly different, but they show the same intent: “I'm looking for a business card by using terms that highlight certain defining attributes — best & quality.” Small Biz Trends in the above screenshot has created a page that matches that particular intent. Keyword intent is a crucial topic that the SEO community has been talking about for a few years by now. Why does this matter to you? From an opportunity standpoint, your PAA listings can trigger featured snippets and also have the possibility to cover a portfolio of different keyword permutations. 5. PAAs have a feedback feature Most of you have probably glanced over this feature but never really paid attention to it: at the bottom of the last PAA listing, there is often a little hyperlink with the word Feedback. By clicking on it, you're shown the following pop-up: Example of feedback for PAA Google states that this option is available “on some search results” and it allows users to send feedback or suggest a translation. Even if you do go through the effort, Google says they will not reply to you directly, but rather collect the info submitted and work on the accuracy of the listings. Does this mean they'll actually change the PAA listing based off of feedback? Unfortunately, I don’t have an answer for this (I've tried to submit feedback manually and nothing really happened) but I think it's very unlikely. The only for-sure thing you get from Google is the following response: Google’s response after feedback submission Why does this matter to you? From an opportunity standpoint, if you notice that PAA listings (for questions you are trying to appear for) are not accurate, you can flag it to Google and hope they'll change it. Now that we've covered some interesting facts, how can we take advantage of PAA? Determine how deeply your SERP is being affected by PAA (and other SERP features) This task is fairly straightforward, but I guarantee you very few people actually pay much attention to it. When monitoring your rankings, you should really try to dig deeply into which other elements are affecting your overall organic traffic & organic CTR. Start by asking yourself the following questions: What elements affect the SERP for my core keywords?How often do these SERP elements appear?How deeply are they affecting my organic results? You might spot an increasing amount of paid results (in the form of shopping ads for products or text ads for services) appearing for many of your key terms. Established tools like SEMrush, Sistrix, and Ahrefs can show you the number of ads, overall spending, & how the ads look at a keyword level. Kw: [hr software] SEMrush ads history graph by keyword Or it may be the case that organic SERP elements, such as video results, are being triggered in the SERP for many of your informational queries, or that featured snippets appear for a high percentage of your navigational & transactional terms, and so on. Recently, I came across a client where over 90% of their primary keywords triggered PAAs at the top of the SERP. 90%! Which tools can help? At Distilled we use STAT, which reports on such insights in a really comprehensive manner with a great overview of all the SERP elements. This is what the STAT SERP features interface looks like: STAT SERP features Ahrefs also does a great job of allowing you to download the SERP features of the top twenty results for any of the keywords you're interested in. Understanding where you stand in the current SERP landscape & how your SEO has been affected by it is a crucial step prior to implementing any SERP strategy. Tactics to take advantage of PAAs There are several ways to incorporate PAAs into your SEO strategy. It's already been written about many times online, so I'm going to keep it simple and focus on a few easy tactics that I think will really improve your workflow: 1. Extract PAA listings This one's pretty straightforward: how can we take advantage of PAAs if we cannot find a way to extract those questions in the first place? There are several ways to “scrape” PAAs, more or less compliant with Google’s Terms & Conditions (such as using Screaming Frog). Personally, I like STAT’s report, so I'll talk about how easy it is to extract PAA listings using this tool: One of the features of STAT’s reporting is called “People also ask (Google),” which is pretty self-explanatory: for the keywords you've decided to track in the tool, this report will provide the PAA questions they trigger and the URLs appearing for those listings, along with their exact rankings within the PAA box. This is an example of how the report will look like after you've downloaded the “People also ask (Google)” report: STAT PAA report 2. Address questions in your content Once you have a list of all PAA questions and you are able to see which URLs rank for such results, what should you do next? This is the more complicated part: think how your content strategy can incorporate PAA findings and start experimenting. Similarly to featured snippets, PAAs should be included in your content plan. If that's not yet the case, well, I hope this blog post can convince you to give it a go! Since I am not focusing (sadly, for some) on content strategy with this article, I will not dwell on the topic too much. Instead, I'll share a few tips on what you could do with the data gathered so far: Understand what type of results such PAA questions are triggering: are they informational, navigational, transactional? Many people think featured snippets and PAA questions are triggered by heavily informational or Q&A pages: trust me, do NOT assume anything. heck your data and behave accordingly. Keyword intent should never be taken for granted. Create or re-optimize your content Depending on the findings in the previous point, it may be a matter of creating new content that can address PAA questions or re-optimizing the existing content on your site. If you discover that you have a chance at ranking in a PAA with your current transactional/editorial pages, it might be best to re-optimize what you have. It may also be the case that one of the following options can be enough to rank in PAAs: Adding questions and answers to your content (don’t limit yourself to just the bottom of the page)Using the right headings to mark up such elements (h1, h2, h3, whatever works for your page)Copying the formatting of results that are currently appearing in PAASimply changing the language used on your site If you do not have any content to cover a certain keyword theme, think about creating new ones that would match the keyword intent that Google is favoring. Editorial content with SEO in mind (don’t limit yourself to PAA, but look at the overall SERP spectrum) or simple FAQs pages could really help win PAA or featured snippets. Depending on your KPIs (traffic, leads, signups, etc), tailor your newly optimized content and be ready to retain users on your site Once users land on your site after clicking on a PAA listing, what do you want them to see/do? Don’t do half the job, worry about the entire user journey from the start! 3. Test schema on your page The SEO community has gone a bit cray-cray over the new FAQs schema — my colleague Emily Potter wrote a great post on it. FAQs and how-to schema represent an interesting opportunity for SERP features such as featured snippets and PAAs, so why not give it a go? Having the right content & testing the right type of schema may help you win precious snippets or PAAs. In the future, I expect Google to increase the amount of markup that refers to informational queries, so stay tuned — and test, test, and test some more! Think of the extended search volume opportunity Without digging too much into this topic (it deserves a post on its own), I've been thinking about the following idea quite a lot recently: What if we started looking at PAAs as organic listings, hence counting the search volume for the keywords that trigger such PAAs? Since PAAs and other elements have been redefining the SERPs as we know them, maybe it's time for us marketers to redefine how these features are impacting our organic results. Maybe it's time for us to consider the extended search opportunity that such features bring to the table and not limit ourselves at the tactics mentioned above. Just something to think about! PAA can be your friend By now, I hope you've learned a bit more about People Also Ask and how it can help your SEO strategy moving forward. PAA can be your friend indeed if you're willing to spend time understanding how your organic visibility can be influenced by such features. The fact that PAAs are now popular for a large portfolio of queries makes me think Google considers them a new, key part of the user journey. With voice search on the rise, I expect Google to pay even more attention to elements like featured snippets and People Also Ask. I don't think they're going anywhere soon — so my dear fellow SEOs, you should start optimizing for the SERPs starting today! Feel free to get in touch with us at Distilled or on Twitter at @SamuelMng to discuss this further, or just have a chat about who these people who also ask so many questions actually are... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "5 Things You Should Know About \"People Also Ask\" & How to Take Advantage"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "5 Things You Should Know About \"People Also Ask\" & How to Take Advantage"
    },
    {
      "level": "H2",
      "text": "1. PAA can occupy different positions on the SERP"
    },
    {
      "level": "H3",
      "text": "Keyword example: [dj software]"
    },
    {
      "level": "H3",
      "text": "Keyword example: [cocktail dresses under 50 pounds]"
    },
    {
      "level": "H3",
      "text": "Keyword example: [tv unit]"
    },
    {
      "level": "H3",
      "text": "Why does this matter to you?"
    },
    {
      "level": "H2",
      "text": "2. Do PAAs have a limit?"
    },
    {
      "level": "H3",
      "text": "Has the situation changed at all since the original 2016 Moz article?"
    },
    {
      "level": "H3",
      "text": "Keyword example: [featured snippets]"
    },
    {
      "level": "H3",
      "text": "Keyword example: [best italian wine]"
    },
    {
      "level": "H3",
      "text": "My two cents on the above:"
    },
    {
      "level": "H3",
      "text": "Why does this matter to you?"
    },
    {
      "level": "H2",
      "text": "3. PAAs can trigger video results"
    },
    {
      "level": "H3",
      "text": "Keyword example: [how to clean suede shoes diy]"
    },
    {
      "level": "H3",
      "text": "Why does this matter to you?"
    },
    {
      "level": "H2",
      "text": "4. PAA questions are frequently repeated for the same search topic and also trigger featured snippets"
    },
    {
      "level": "H3",
      "text": "1. PAA questions also trigger Featured Snippets"
    },
    {
      "level": "H3",
      "text": "2. Different keywords can trigger the same PAA question and show the same result."
    },
    {
      "level": "H3",
      "text": "3. Different questions listed in a PAA triggered by different keywords can show the same result."
    },
    {
      "level": "H3",
      "text": "Why does this matter to you?"
    },
    {
      "level": "H2",
      "text": "5. PAAs have a feedback feature"
    },
    {
      "level": "H3",
      "text": "Does this mean they'll actually change the PAA listing based off of feedback?"
    },
    {
      "level": "H3",
      "text": "Why does this matter to you?"
    },
    {
      "level": "H2",
      "text": "Determine how deeply your SERP is being affected by PAA (and other SERP features)"
    },
    {
      "level": "H3",
      "text": "Which tools can help?"
    },
    {
      "level": "H2",
      "text": "Tactics to take advantage of PAAs"
    },
    {
      "level": "H3",
      "text": "1. Extract PAA listings"
    },
    {
      "level": "H3",
      "text": "2. Address questions in your content"
    },
    {
      "level": "H4",
      "text": "Understand what type of results such PAA questions are triggering: are they informational, navigational, transactional?"
    },
    {
      "level": "H4",
      "text": "Create or re-optimize your content"
    },
    {
      "level": "H4",
      "text": "Depending on your KPIs (traffic, leads, signups, etc), tailor your newly optimized content and be ready to retain users on your site"
    },
    {
      "level": "H3",
      "text": "3. Test schema on your page"
    },
    {
      "level": "H2",
      "text": "Think of the extended search volume opportunity"
    },
    {
      "level": "H2",
      "text": "PAA can be your friend"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Samuel Mangialavori\n          \n            Samuel Mangialavori\n          \n            Samuel Mangialavori"
}