{
  "url": "https://moz.com/blog/people-who-cant-link-and-a-vague-argument-for-google-analytics",
  "slug": "people-who-cant-link-and-a-vague-argument-for-google-analytics",
  "title": "People Who Can't Link, and a Vague Argument for Google Analytics - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We work in an industry where no one lacks the ability to link. It's very tough to find one SEO, or one person who's interested in SEO, who doesn't have a website of some sort. Many of us have more than one: a work-related domain and a personal or hobby site. None of us lack the ability to…",
  "content": "People Who Can't Link, and a Vague Argument for Google Analytics Link Building By: Jane Copland May 26, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jane Copland May 26, 2008 People Who Can't Link, and a Vague Argument for Google Analytics Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. We work in an industry where everyone can link. It's very tough to find one SEO, or one person who's interested in SEO, who doesn't have a website of some sort. Many of us have more than one: a work-related domain and a personal or hobby site. None of us lacks the ability to link. Thus, it seems we sometimes forget that not all industries are like ours. Natural link building of editorial links (also known as the kind search engines like best) is difficult enough when one is dealing with the \"linkerati\" or at least with Internet-savvy people who have a grasp of the idea that links make the web go around. How much tougher does it get when your key audience members do not maintain websites and do not blog? When you're looking at the stats or analytics of a website whose audience members don't link, it's frustrating to see referrals like this: ar.mg2.mail.yahoo.com/dc/launch?.rand=f02agh2jdl92h4 http://www.facebook.com/inbox/readmessage.php?t=10091495216274&f=1&e=0 It's the \"send a link to a friend\" phenomenon in real life. The forwards, the chain letters, the messages from Mum, suggesting you check out this neat thing she saw on the Internet. In the right (wrong?) niche, a website could have a steady flow of relevant traffic and yet show minimal links on Site Explorer and a dearth of external referrals. Directory listings and other such \"acquired\" links can help out, but it takes a lot of those to make up for the editorial link. When people mail links to each other, they're often expressing exactly the sort of vote of confidence that a do-followed link is to a search engine. A, \"Hey, look at this. I liked this article.\" Email spam is, of course, the exception to this rule, but with email providers' spam filters becoming more sophisticated and the public becoming better at spotting Barclay's Bank frauds, it seems that emailed links that elicit click-throughs are quite solid metrics. By the way, Barclay's Bank spammers: we don't even have Barclay's Bank in the United States (or New Zealand), so you have been wasting your time on me for eight years. Just to let you know. So how do I expect search engines to take emailed links into account? Although I'm willing to admit that my email inbox is rarely interesting, I'm far from ready to open its contents to anyone, human or otherwise. The only vaguely plausible way I can see of showing search engines how much traffic a site gets from email, IM or other forms of private message depends on whether you believe Google Analytics is spying on us. We receive plenty of questions about the likelihood that Google uses its Analytics data for rankings purposes, and whilst we'll almost certainly never get a definitive response, my best guess is that they might. I'd do it, but we've already established that my moral thermostat is set to Medium. If we go with the idea that Google does use its Analytics data for ranking purposes, it's totally acceptable that email and private message referrals should be taken into account. After all, a visitor arriving at a site from an emailed spam link will behave in much the same way as a visitor sent from a spam link on another website: the likelihood of a fast bounce is very high. Conversely, a site with negligible backlinks that receives a lot of quality, non-bouncing browser-bookmarked and emailed traffic should perhaps be rewarded with higher search engine placements. If your site is in the above category and a lot of your traffic is rather invisible to search engines, it makes sense to use Google Analytics. We've long said that if your search traffic and regular referral visitors are of a good quality and your bounce rate isn't bad, \"letting Google know\" might not be a bad idea. If we're to believe that Analytics data is fair game for Google, it seems to be exponentially more important to let Google know that your site is a good one if it has none of search engines' \"traditional\" means of assessing trust: links. Very quickly, it's worth noting that you can always encourage non-linkers to get off email and onto the web. Yet another strong argument for starting a blog of your own on a commercial website is that it makes people aware of the draws of blogging and having an outlet online. It won't appeal to some people, but it may well take the fancy of visitors who are into leaving comments. Writing posts of one's own is only one step away. Secondly, providing (relevant, non-spammy, accurately cited, disinfected and tested for worms) widgets or badges can help push people towards maintaining their own piece of the web. Provide a detailed yet noob-friendly explanation of what the widget or badge does and how to use it: sure, people will embed them in MySpace pages, which have not passed any link juice for many months, but you will still be demonstrating how the web works and introducing the idea of passing links. As an aside, mentioning that the widget / badge links back to your site should relieve you of the accusation that you're tricking people into linking to you. A personal story on the subject of people who take part online but do not link, and one that I find endlessly amusing: an associate of my father's used to leave lengthy comments on things my father wrote. Lengthy to the extent of sometimes being longer than the posts themselves. Long-winded barely conveys the horror of these comments; however, when presented with the idea that he may be interested in starting his own simple, Blog/press-style site and expressing some of his views there, the person responded that he was far too busy to spend his time writing things on the Internet. I wanted to point out the irony but sometimes it really is best to take the hands off the keyboard. Suffice to say, starting websites isn't for everyone and it will be a while before we see the end of \"1.0\" online behaviour. In the meantime, think about installing Google Analytics if your 90s-style traffic is actually quite impressive and ask your mother if she's thought any more about that Wordpress thing you showed her. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "People Who Can't Link, and a Vague Argument for Google Analytics"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "People Who Can't Link, and a Vague Argument for Google Analytics"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jane Copland\n          \n            Jane Copland"
}