{
  "url": "https://moz.com/blog/perfect-example-of-how-to-email-a-blogger",
  "slug": "perfect-example-of-how-to-email-a-blogger",
  "title": "Perfect Example of How to Email a Blogger - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "One of the best techniques for starting the ball rolling on a content-rich, high quality new site is to email bloggers in your industry and ask for their input. I got this one from Jon Kemp yesterday:Rand,I just wanted to write you and say that I have been an admirer of yours for about six months…",
  "content": "Perfect Example of How to Email a Blogger Link Building By: Rand Fishkin March 2, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 2, 2006 Perfect Example of How to Email a Blogger Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. One of the best techniques for starting the ball rolling on a content-rich, high quality new site is to email bloggers in your industry and ask for their input. I got this one from Jon Kemp yesterday:Rand,I just wanted to write you and say that I have been an admirer of yours for about six months now, maybe more. I first got turned on to your web site for the tools. I soon started reading your blog and I was really impressed with your opinions and ideas. I now read your blog everyday and you have become a sort of role model for me in the SEO community over all the other well known SEO commentators out there.Now a little bit about myself, I have been doing internet marketing since 2000, so about 6 years give or take. I don't spend very much time at all in forums or go to conferences so I never became known as a commentator. I did try my hand at writing several years ago and really liked it. I was actually out of the game for a few years but started freelancing again in 2004. I got hired by another company last year to do SEO full time so thats what I am doing now. I recently created a new site called SEO Profile. I did all the design, programming and writing myself. I have been working on it for about 2 months and now I feel it is ready for people in the community to start looking at and judging it. It may seem remedial for some people but I created it out of a desire to educate webmasters and siteowners about the confusing world we deal with everyday in SEO. I also want to talk about more advanced SEO and marketing priniciples but at the same time I don't want to cover the same thing everyone else is covering over and over again. I want to make myself stand out and talk about areas of Internet marketing that may not get as much attention.Well, if you wouldn't mind looking at my site and giving me your opinions. I really like the redesign of your site. Hope you are having fun in New York right now. Thanks.JonWhat does the email do right? It shows that Jon knows who I am and that his intent is personal It gives a relatively compelling background story It doesn't outright ask for a link - but, it does request a review and input Good work on the link request, Jon - I'm happy to oblige such a well-executed performance.Anyone else have input on how the request could have been even better? Any input for Jon's site? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Perfect Example of How to Email a Blogger"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Perfect Example of How to Email a Blogger"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}