{
  "url": "https://moz.com/blog/personalized-pointofview-personally-speaking-that-is",
  "slug": "personalized-pointofview-personally-speaking-that-is",
  "title": "Personalized Point-of-View - personally speaking, that is - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Personalized search has its place – I guess. Personally, I’m not a huge fan, and I don’t think its going to have either a terribly big, or a terribly negative impact on SEO. I wanted to mention Danny’s great post for those who might have missed it, and also add my own somewhat obvious pov. ...",
  "content": "Personalized Point-of-View - personally speaking, that is Public Relations L By: lauramaccallow@yahoo.co.uk March 12, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! L By: lauramaccallow@yahoo.co.uk March 12, 2007 Personalized Point-of-View - personally speaking, that is Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Personalized search has its place – I guess. Personally, I’m not a huge fan, and I don’t think its going to have either a terribly big, or a terribly negative impact on SEO. I wanted to mention Danny’s great post for those who might have missed it, and also add my own somewhat obvious POV. Firstly, I’m probably not a ‘normal’ searcher. Though I’m not all that sure what a ‘normal’ searcher is. Everyone has predilections for specific modes of entertainment or information online, and I guess those are relatively easy to personalize, and serve a time saving purpose. I like skynews, some ratty entertainment sites, and then of course loads and loads of SEO blogs (ahem -, yes, SEOmoz is one of my faves – mostly due to the quality of the posts). Do I necessarily want Google to track my search behavior back and forth to those blogs? Is it really of any interest to me? Do I like feeling like I have a cyber-big brother hovering around me every time I go online and see my ‘personalized’ Google home page? Urm...no. And yet, I do make use of the home page because I have a few nice feeds (one of which is from Search Engine Land) that keep me up to date on new bits and bobs. But as to how much all this brouhaha is going to affect SEO? Well look, I might very well be a an avid SEO blog reader, I might like news sites, and as before (blush) give undeserved attention to some ratty entertainment sites, but I amazingly have other needs and wants that I just don’t search for every day. Today I pinched the skin under my eyes while popping my contacts in, and it stayed like that, you know, like putty, so in order to do something more drastic than my normal daily application of Nivea, I decided on the spur of the (highly traumatic) moment to search for a 'powerful anti-wrinkle cream'. Then, hypothetically blogging of course, let’s say I decided I’d better do something about that unsightly wart on my left pinkie, so I look for a nice 'natural wart removal over the counter treatment'. I forgot all about my best friend's birthday again this year (it was on the 5th), and figure that while I'm overindulging myself online I’d better overdo it in the present arena to make up for the lateness, so I go and search for 'great gadgets for girls'… These searches are unique. The engines are not going to be able to predict what I am going to search for to fulfill my everyday non-habitual wants. People selling natural wart removal treatments, girly gadgets, and anti-wrinkle creams to soothe and smooth my puckered brow (and eye-lids) are going to stand a pretty good chance of my finding them in the normal good old SERPS using normal good old fashioned SEO (well, current-good-old-seo tactics, anyway). I’m sure personalized search has its place, and will serve some marvelous function in the future as it is whipped into shape by the ever inventive Google folks (the inventiveness is all a bit much for me sometimes), but as to whether it's going to affect non-geo-targeted and non-habitual searching preferences – Nope, I’m not worried. You? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Personalized Point-of-View - personally speaking, that is"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Personalized Point-of-View - personally speaking, that is"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "lauramaccallow@yahoo.co.uk\n          \n            lauramaccallow@yahoo.co.uk"
}