{
  "url": "https://moz.com/blog/personas-understanding-the-person-behind-the-visit",
  "slug": "personas-understanding-the-person-behind-the-visit",
  "title": "Personas: The Art and Science of Understanding the Person Behind the Visit - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "With the erosion of keyword intelligence and the move to strings-not-things for the user, Google is pushing all marketers to focus more on their target audience. This post will teach you how to understand that audience, the future of Google, and how to build data-driven personas step by step.",
  "content": "Personas: The Art and Science of Understanding the Person Behind the Visit User Experience (UX) M By: Michael King January 29, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! M By: Michael King January 29, 2014 Personas: The Art and Science of Understanding the Person Behind the Visit User Experience (UX) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Market segmentation is a basic tenet of marketing that has long been ignored by SEOs. And that's okay, because for a long time working on the keyword-level of abstraction was enough. In fact, you can still do SEO and marketing in any other channel without ever having the idea of market segmentation cross your mind despite (not provided), Hummingbird, and a whole host of changes Google is forcing as of late. That is… if you enjoy 0.04% conversion rates. Right. There have been many posts about personas in the wake of the methods I've popularized for SEO, but nothing that truly walks through the process with data or gives context into how measurement has matured. In this post I'll go into detail about these approaches, giving frameworks and step-by-step instructions on how to build and use personas. There's something in this post for everyone from beginners to advanced marketers. I feel that it's important to give context to the discussion to clarify why developing and using data-driven personas is critical to the future of search and digital marketing in general. Use this table of contents as a way to navigate to precisely what you want to know. You'll also find \"Back to table of contents\" links at the end of every section. Wait…what are personas? What is the difference between segments, cohorts, and personas? Segments Cohorts Personas Google is pushing all channels in this direction Affinity segments/categories Building personas Layering data Qualitative research Quantitative research Building Mozzy Smurf User journeys Use cases Further applications Frequently asked questions Resources First, personas are a method of market segmentation wherein we collect a combination of qualitative and quantitative data to build archetypes of the members of our target audience. In other words we take data to tell a predictive story about our users based on past behaviors and attributes. I mentioned keywords as a level of \"abstraction;\" Google has obscured that type of abstraction with (not provided), taking an otherwise perfect direct-response dataset and turning up the opacity. Nonetheless, it was always a representation of a person taking an action to fulfill a need. However, that abstraction removed us completely from those people and placed our focus clearly on the keyword and the Boolean idea of whether or not their visit on that keyword led to the completion of a task. If the keyword-level of abstraction is a stick figure a persona is an action figure. Over the past few years I've built methodologies in a land of marketing make believe to develop personas and apply them to the intersection of Search and Social Media helping us understand the person behind the search. Much like the cartoons that action figures are modeled after personas have a set of attributes that they are to (ahem) personify. Dictated by the business goals and the data that can be collected and analyzed these attributes are typically a picture, demographics, psychographics, user needs and a user story, but can be as in-depth or as vague as you want - as long it's actionable. For example, some people like to give each persona a \"quote\" that sums them up. Personas also come with a user journey which is a collection of steps a user takes in fulfilling those needs. Ultimately, though, you're trying to tell the most actionable story with your data. Think of it as another layer to your analytics. The most important layer. The people layer. People often ask me why they need to use personas. In my previous role of selling SEO services to people that talk about SEO and marketing as separate things I've experienced a lot of pushback. Fortunately there were far more instances where a CMO or VP was in the room and speaking in terms of segments and market opportunity rather than just keywords, meta tags and guest posts helped us win the business. But I digress. One of the main reasons for using personas is that when you target everyone you actually target no one. The art of segmentation is about narrowing your focus in on people in the market more likely to become your users/customers so you can better serve them. This applies not only to your product and/or service, but your content as well. Donald A. Norman of the Nielsen Norman Group explained it best when he declared \"A major virtue of personas is the establishment of empathy and understanding the individual who uses the product.\" In the Content Strategy world one of the major concepts they push is \"empathy.\" How can we understand and then fight for the user to create the best possible content experience to fulfill their needs? Not just the right words, but the right structure, the right metadata, the right presentation. User Experience professionals use that idea of empathy with personas to plan and build things that work for the target audience. For example, if our audience is people over 50 then it may make sense to design a site with the larger text. In the world of marketing this is all a means to specific end of course, but ultimately we just want to know who we're talking to so we can improve our rate of persuasion - or conversion. Organic Search as a marketing channel is about just that - persuading people who have a specific intent to believe you can fulfill their needs. Building personas allows you to speak directly to their needs from as early as the page title and meta description. This applies to not only your product and/or service, but your content as well. Back to table of contents The terms are often used interchangeably, but they can mean slightly different things. All of these concepts are abstractions of people, but the basic difference between the three lies in their specificity. A segment is the broadest concept of a person while a persona is the most specific snapshot of a user archetype. For the purposes of this discussion the Smurfs will act as a way to make these ideas a little more real (whoa, meta). I tried to get G.I. Joe, but, they were busy fighting wars and stuff… yeah, anyway… Segments Segments are groupings of similar entities. You can (and should) quite literally segment by any set of rules in your data as I've discussed in my last Moz post. On the cartoon the Smurfs you had humans, animals and Smurfs. Each of those could be a segment. You could segment just the Smurfs themselves by color of their mushroom homes. You can segment them based on things that happened on the show. Two segments could be \"Those that Gargamel Has Captured\" and \"Those that Gargamel Has Not Captured.\" You could segment by where they live in the Village. North Smurfs, West Smurfs, Southeast Smurfs. You could sub-segment any of these groups with any granularity that you see fit or combine criteria just like you would with standard clickstream data in Google Analytics. The point is, although you can segment by anything you can track, will it be actionable? Popular actionable segments that are used every day are geographic, behavioral, seasonal, and benefit segments. Nielsen PRIZM is a popular market segmentation system that is based on zip codes where people are chunked into subsets regarding their location, income and behavior. Nielsen builds this system on top of US Census data and sends out surveys to a large sample of people to create 66 segments throughout the United States. Experian Simmons is similar, and maybe more interesting to inbound marketers with its connection to Hitwise, but Google has recently brought segmentation purely online and has the potential to supplant them all. More on that later. Cohorts Cohorts are groupings based on similar experience. Common vernacular for cohorts would be generations. In the Smurf Village you had three generations of Smurfs. The baby Smurfs (which for whatever reason had the only other female Smurf). Let's call them Generation Next. You had the adult Smurfs like Jokey, Vanity, Brainy, and Smurfette's cohort. Let's call them Generation Now. A cohort that walked around believing shirts were optional. And you had Papa Smurf and a few of his buddies. Let's call them the Elder Smurfs. Obviously, each individual in any of these groups is different from the next, but they are grouped by their shared temporally attitudes, cultural interests (ex. fashion sense, music), and life experiences (Gargamel captures, first appearance of Smurfette). In the real world we have Baby Boomers, Generation X, and the ever elusive Millenials. Baby Boomers were a generation defined in the post-World War II era of increasing affluence, Civil Rights movements and the death of JFK. Generation X was a people defined by rebellion, MTV, baggy pants, the dot Com Bubble, the rise of Grunge, Microsoft, and the death of Kurt Cobain. Millenials are defined by 9/11, job-hopping, Apple, Google, Facebook, free music, nerd glasses, tight jeans, everybody having a startup and the death of Michael Jackson. Right now every big product-driven company is asking how do we get Millenials to care about us? Personas Personas are specific archetypes of people in the target audience. The attributes identified across the group are collected to give birth to a single entity that represents these users. A persona has a descriptive name and is meant to be thought of like someone that actually exists. They are generally a composite of people that do exist. In this case we will use individual Smurfs themselves as our personas. While some people in the 80s viewed the cartoon as communist it can also be seen as an exercise in behavioral segmentation. Each character was clearly differentiated by what they specifically did or how they acted within the Smurf Village. You had Brainy Smurf, the original hipster. He's a bit of an introvert and likely to be found at a Barnes & Noble sipping a macchiatto latte and discussing Sartre, injecting barbs of sardonic wit. He spends a lot of time updating his blog, and he's a freelance copywriter for a multinational ad agency, but he only shops at the mall. Brainy prefers Facebook over Twitter as he would rather have a long-form discussion where he can definitively disprove what you believe. He listens to NPR and of course is a Mac rather than a PC. You had Smurfette. Well, you had two Smurfettes, each of which could be a persona. The first Smurfette was a tom boy who just wanted to hang with the homies. After all she was created by Gargamel as a way to distract and trap the Smurfs. She shopped at second hand stores before it was in style. No, really. Old Smurfette goes to open mics and loves to be around music. She enjoys vintage vinyl records and playing with her rescue cat. The Old Smurfette is a bit of a couch surfer who frequents SmurfBNB and eats at Baker Smurf's restaurant rather than the big chains. You guessed it; Old Smurfette is a persona based on the female hipster Millenial cohort. Later, after Papa Smurf turned her into a real Smurf she got all high-end fashion on us, dying her hair blonde, wearing Diane von Smurfstenburg dresses and Christian Smurfboutin shoes. She's more likely to be found at high-end establishments, but only goes out when invited. Smurfette would rather be shopping than go to a music night spot. She's all about convenience over supporting her local community. Smurfette likes to see and be seen. Then you had Jokey Smurf. His persona name would probably be Terrorist Tom because he loves to hand people presents that explode. In the context of marketing Jokey is the type of user who loves extreme sports, sites like Break.com, and the type of content that Red Bull creates. He's highly likely to buy Ed Hardy clothing. Only the jeans, though, because males in his cohort don't wear shirts. Jokey loves craft beer, Xbox One and action movies. In the above cases I've taken what I know about the millennial cohort and layered it into a story about the different Smurf characters based on things that could be observed on the show. As marketers building personas we do this with regard to the context of our marketing programs. That is to say we focus on elements of the story that is relevant to our goals rather than including every data point we can find. A key distinction to be made in the context of inbound marketing programs is that between the buyer person and the audience persona. The audience persona is typically someone looking to consume content for education or entertainment. These people are not actively looking to purchase a good or service and are better measured via KPIs having to do with the spread or the building of authority for that content or the building of community. Conversely, buyer personas may also be looking to consume content, but only as a means to make the specific transaction to support their needs. There is frequently overlap between the two types of personas and a given user can also transition between the two types. Keep this in mind as you develop your personas. Once this in-depth profile of the audience is created smart marketers ask questions and take actions with regard to how these personas would best be served to meet the business objective. At Amazon, Jeff Bezos leaves a chair empty at meetings to signify the customer persona is in the room listening to the decisions they are making. At Experian they have developed the character and placed her on banners throughout the office and in the company newsletter to keep the customer top of mind. When I worked on LG they sent a poster of their home appliances persona Wendy and she came up often in our strategy meetings. At AirBNB they have a section of the office with the personas in storyboards on the wall along with illustrations of those of personas going through the user journey. No matter what method you use, it is important to keep the consumer, customer, user at the center of the marketing initiative. Don't just build personas and forget they exist. Back to table of contents \"Why should I care,\" you say? Well for some time I have touted this idea of the intersection of search and social media to take intent to match it up with the person. This and some of Google's actions towards the end of 2011 (remember the consolidation of the privacy policies ?) led me into the idea that they are using G+ to model users to apply a sliding scale of authority based on topical relevance for better search quality and to provide the Holy Grail of advertising opportunities. In fact I believed the whole purpose was modeling beyond the keyword to make every dollar worth a lot more by marrying multiple data sets. It turns out this is exactly where Google wants to go with their marketing products and I'm basically just ahead of my time. ;] Ian Lurie has also been talking about this extensively for the past few years as well through a concept he calls \"random affinities\" which is similar to something I was (perhaps mistakenly) calling \"co-relevance\" when I built a tool for getting ahead of search demand with social media. Forgive the quality of these screenshots, but in a recent video from Google featuring Forrester Research's VP/Principal Analyst Nate Elliot they discussed the concept of affinity and market segmentation. What he describes as Smart Affinity is what a methodology like Keyword-Level Demographics is looking to harness. This is a capability that marketers in general have yet to embrace because it's simply too complicated for most. Google is taking us there kicking and screaming. Diya Jolly from Google gives some of the insight into why Google is obviously the best suited for the job in her discussion of the data signals available across the Google ecosystem. The amount of data combined with the sample size allows Google to have probably the most robust and accurate model of user behavior which potentially render other modes of advertising and market research nearly obsolete or at least less effective. I dug a little deeper into the process and found the \" Inferring User Interests\" patent where they discuss more in-depth how they figure out user interests. For example: \"In the situation where a first user lacks information in his profile, profiles of other users that are related to the first user can be used to generate online ads for display with the first user's profile. For example, a first user Isaac may not have any information in his profile except that he has two friends-Jacob and Esau. The server system 104 can use information from Jacob and Esau's profiles to infer information for Isaac's profile. The inferred information can be used to generate online ads that are displayed when Isaac's profile is viewed.\" How's the saying go? When it's free, you're the product. Affinity segments/categories All the data we give Google for free has allowed them to roll out this new Affinity Segments product which is Google's own new segmentation system. In their own words : \"We use the main topics and themes from the page as well as data from third-party companies to associate interests with a visitor's anonymous cookie ID, taking into account how often people visit sites of those categories, among other factors. Google may use information that people provide to these partner websites about their gender, age, and other demographic or interest information. We may also use the websites people visit and third-party data to infer this information. For example, if the sites a person visits have a majority of female visitors (based on aggregated survey data on site visitation), we may associate the person's cookie with the female demographic category.\" In typical Google fashion, aside from the video and a few articles in the Adwords Support site, the detailed information about these segments is pretty sparse. Luckily, I was able to get my hands on a deck with short user stories and targeting ideas for each segment. I'm sure your Adwords account manager would be able to furnish something like the below if you asked them nicely. Affinity Segments is the broad name for these targeting types, but in practice Google offers \"Affinity Categories,\" \"In-market Buyers,\" and \"Other Categories\" as targeting types in AdWords. Affinity Segments are users in a broad sense, In-market segments are people that are actively looking to purchase and other categories are a variety of things. You're likely to see other categories the most if you're not in the US. I appreciate that Google makes the distinction between \"Affinity Categories\" and \"In-market Buyers\" as this directly mirrors the approach I take in creating both \"Audience Personas\" and \"Buyer Personas.\" More on that later. As an end user you can see which demographics and interests Google has associated with you in your Ad Settings. You can also opt-out or change your features as seen below. However, the most important point for this persona discussion is that you can now measure everything in Google Analytics based on these segments. Let that sink in for a second. Google has Google+ as an \"identity platform\" which is pretty much a front end for data collection and modeling of people. They have Google Consumer Surveys so marketers can poll the audience and I imagine at some point you'll be able to ask questions by affinity segment. And now you have Google Analytics showing website actions in context of those affinity segments. Google has just set itself up to disrupt the entire market research industry with end to end people modeling. If that doesn't sell you at least on the power of segmentation nothing will. This is completely unprecedented. Back to table of contents Ok, enough with the background; let's get you building personas. There are many methods for developing personas and I will discuss several of them, but you should choose your approach based on the data and resources at your disposal. Again, what we will be doing is collecting data, segmenting it and telling a story about that segment. First I'll outline different processes then we'll walk through the creation of a persona for Moz leveraging data from the scraping post, Twtrland, Followerwonk, and the community Q&A forum. In my experience a combination of approaches yields the best personas. Otherwise you'll end up relying too much on your own assumptions. Also I typically build four personas with Googlebot, which AJ Kohn has aptly named the Blind Five Year Old, acting as the fifth, but you can build as many as you see fit. Layering data If you've seen me speak in the past year or so you've probably seen this image. When I was at my previous agency my market research lead Norris Rowley and I developed a methodology wherein we layered data from Nielsen Prizm and Experian Simmons to collect data on segments at scale. When I say layering I mean that we look for commonality between datasets and if there is enough commonality or overlap we consider all features potentially valid for sub-segments. That is to say if enough attributes of a Prizm Code and a MOSAIC Type are shared we consider any data in one to be potentially valid for the other and we applied this approach across all the available datasets. Whether or not that is scientifically sound can be debated, but remember that personas are hypotheses that will ultimately be validated or invalidated through measurement. Since the Prizm and Simmons surveys deal mostly in offline behaviors we'd plug those data points into Social PPC inventories (Facebook Ads, Twitter Ads, LinkedIn Ads) to ensure that those segments were valid online. If they proved to be valid then we'd take that segment and build a persona. I still believe this to be a solid approach especially if you can leverage this data in context with some of Simmons' other products measure online usage behavior as well as Google's Affinity Segments. No matter which method you use you should start by determining the business objectives which will then help to determine the goals of your research. Then define how these personas will be used. Are you just looking to focus on your buyer personas or will you be thinking about audience personas as well? Qualitative research With Qualitative Research you're asking open-ended questions to small sample sizes to get a sense of the \"how\"s and the \"why\"s behind a specific problem. You're typically looking at unstructured data to inform commonality amongst your user group and any insights are then validated for scale throughout quantitative research processes. Qualitative research within our context is often user interviews, focus groups, content analysis, text-mining, ethnography and affinity mapping. (image source) Affinity mapping / affinity diagramming When most people think of a persona-building exercise they think of this. Affinity mapping or affinity diagramming is the process of collecting everyone's thoughts and segmenting them into meaningful groups. In the context of personas this is typically done in a several hour session of everyone writing their ideas of their customers on post-it notes with Sharpies, discussing them as a team and then grouping them. This process is great for putting the consumer back in focus for the team and also for getting executive buy-in. However it's mostly based on assumptions so I would not suggest doing only this when building personas as your research may be attacked and biased by HIPPOs. When you do this you want to get all the key stakeholders involved, especially the upper management team but most importantly the people that deal with your customers or users on a regular basis like your Sales or Help teams. The former helps with internal adoption. The latter helps get closest to the right answer. Many people building personas stop here to save time and resources, but when you do these profiles are typically known as \"proto-personas.\" Affinity Mapping is typically done in the following 90 minute rounds: Assumption round one (Needs) - Each person spends 5-20 minutes jotting down a goal, activity, need, or problem for any user. This is to be exclusive of any attributes of the user, rather it's about what the user is trying to accomplish. An example assumption could be \"User needing to make a confident decision on which LSAT prep course to enroll in.\" Once everyone has comfortably collected their ideas you go around the room and each person introduces one of their post-its. The entire team weighs in on how valid they believe the assumption to be. Those that are valid are placed on the board. Those that are not are discarded. You continue until all post-its are on the boards or in the trash. Throughout the process groups start to emerge as assumptions begin to fit together. You can give the groups names if you'd like, but at this point it's not that important as names can be given later in the analysis phase. Assumption Round Two (Attributes) - Each person again spends 5-20 minutes jotting down information about the target audience, but this time they present attributes of the user groupings from the first round. Again, you'll go around the room and everyone will share and discuss their assumptions. The ones that the group agrees are valid will then get added to the wall. To continue the example from above an assumption could be \"College graduate 25-34 who is unhappy with their career.\" Starting with the needs in the first round helps to really zero on the demographics and psychographics of the people in this round. If you go the other way around the parameters of the people may be too broad. Factoid Round - The final round of the exercise involves everyone in the group spending 15-30 minutes finding data points to back up the groups of assumptions. This data can come from any number of other relevant sources including analytics, sales data, internal and external research. Again, the team discusses the data points and decides their validity and adds it them to the groups. An example fact could be \"20% of all signups for our LSAT prep course graduated college 4-11 years ago and reported in their registration that they want to make more money.\" The factoid round helps perfect the user story based on quantifiable realities instead of just assumptions. It also allows you to potentially dump segments if there's no data to back them up. ProTip: Although it sounds like a daunting procedure that requires in-person interaction it can be done very effectively remote by using Mural.ly and Google+ Hangouts. The screenshot above is from a recent session I did with a startup called Trip.Me in Berlin. We got members of the marketing team, the CEO and the Operations team together on G+. We color-coded each round of assumptions and factoids with the virtual post-it notes and then the tool makes it easy to bring in links and content that supports any assumptions anyone on the team had. The Google+ effects made it a fun time for all. Build Personas - At this point you have all the data to build out the skeletal personas. Your goal should be to whittle all of these insights into 3-5 actionable personas. While you can make as many as you'd like, it's difficult for teams to stay mindful of too many. We'll go into more of how to formulate stories based on the data when I actually walk through the process, but at this point that is what you'll do. These are often referred to as skeletons or proto-personas because they don't have direct user research or a large wealth of quantitative data behind them. However for many people this is just fine because the team may be most invested in this type of persona, and that will help with adoption. Focus groups Focus groups are formal meetings with people of the target segment wherein a moderator asks research questions to understand users and their needs. I've personally never run one of these, but the ones that clients have conducted and shared with us have made useful inputs in the creation of personas. They help with determining questions and need states of users. However I often find that moderators lead the group on some of the questions thereby invalidating their responses to draw bias conclusions. The quality of the output from a focus group has entirely to do with the experience and biases of the moderator, the quality of the questions, and most importantly the selection and attentiveness of the panelists. Another thing to be leery of is the dominance of one opinion in group settings as people are often swayed by the loudest participant. Furthermore the incentive the people set for being involved may be their only reason to participate and they won't give thoughtful answers. We're about halfway through the post so I encourage you to take a break and watch Conan O'Brien go undercover and moderate a focus group about himself: User/customer interviews These are similar to focus groups except they involve a one-on-one or small one-on-two group environment where you directly speak to a user or customer. For design, products or CRO this can be usability testing and eye-tracking or it can just be direct Q&A as in the case of personas. All of the insights on how customers user the product can be valuable to both the personas and the determining the user journey. Ethnographic research Ad-Hoc data collection is what I've been calling the method of using social listening, forum searches and keyword research to build personas , but I've come to learn that research such as this when you watch users act in their natural habitats is called \"ethnography\" or when it's on the web \"netnography.\" This is a great way to build personas when you have few resources because you can easily identify online communities or watch hashtags and specific representatives of your users on Twitter. Great tools for this include Topsy, Sysomos, Radian6, Google Discussion Search, Keyword Planner, and the Display Planner, Twtrland and Followerwonk. The Display Planner, Quantcast, Compete, Twtrland and Followerwonk will all give you demographic data that helps you frame your personas. Where Twtrland bests Followerwonk is in its ability to infer interests from tweets and not just user bios. The Keyword Planner gives you the keywords associated with the site for use as the vocabulary to find your users in discussion search and eavesdrop on their conversations with Social Listening tools like R6, Topsy and Sysomos. Naturally, you'll need to do several iterations of looking at keywords and conversations to identify trends across your users. You can also uses sites like Quora and Reddit by going as far as to pose questions to kickstart the conversation. While the screenshot above is a good framework to work within there's no defined structure to ethnographic research. You'll have to judge for yourself when you feel your research questions have been answered. However you should generally expect to do the following: Collect examples of what you see users doing in their natural environments called \"field notes\" Analyze notes to discover new questions and reiterate Look for shared patterns of belief, language and behavior Write the ethnography which in this case is the persona Ethnographic research is both the easiest and hardest of approaches because it just requires observation, but the approach is completely subjective so it's hard to convince people that the insights should stick in and of themselves without quantitative research to back it up. Quantitative research If you're reading Moz you're probably a data-driven marketer so this end of the research spectrum will appeal to your sensibilities. Quantitative research is about using numbers and statistics to understand behaviors of users empirically. The sample sizes are often quite large so that the insights can be applied to broad populations of people. Multiple-choice surveys Polling your target audience allows you to ask precise questions. There are many options for this, but I prefer SurveyMonkey Audience for this type of work simply due to the fact that they collect of demographic data explicitly from users while Google has is inferring it from user behavior. Survio is also a good choice for surveying non-US markets. Survey Design is a science in itself and SurveyMonkey has great resources on it , but the key thing to note here is that at this point you want your surveys to not be exploratory or open-ended in nature. You want your surveys to give users well-defined choices that you've defined based on your qualitative research. The results will need to be cross-tabbed until insights are wrangled out and personas begin to appear. Market segmentation tools As I mentioned before Experian Simmons, Nielsen as well as tools like MRI and ComScore provide market segmentation based on surveyed panels and usage data. These tools are incredibly helpful with scaling the persona building process by providing prebuilt segments as well as a wealth of data in context of those segments. These tools fail when there if a specific question has not been included. These providers are eager to take feedback and insights to add to their quarterly surveys, but even when they do you are at least 3 months away from seeing your questions answered and input into the system. Analytics Even without demographic tracking your analytics can have a wealth of knowledge especially internal search, paid search and historical organic search keywords in context of site actions. Also looking at location demographic data as well as the times your users are visiting can be helpful determinations of their attributes. Really what you can pull from analytics is completely dependent upon your setup. User profiles If your site has user profiles, especially those that have collected data from Social logins or other identity data providers there is a wealth of data that users have explicitly set. Internal data Data on sales, calls, returns, reviews, users and transactions of all types can be leveraged to give parameters and color during the persona development process. Publicly available studies Every industry has public research and data that can be leveraged when building personas. For example Google has the Consumer Barometer where you can pull various data points. I tend to use a combination of these approaches in my persona building depending on what resources are available. In my client work experience I've found it best to start with an affinity mapping session and then to prove or disprove those assumptions and gain additional insights with data from the other sources. Back to table of contents For this exercise we will be using data I've scraped from Moz in context with some social analysis and listening tools to build Mozzy Smurf. I'm calling this persona Mozzy Smurf just to keep with the theme of the post, but I generally like to give personas an alliterated name in the form of [adjective] [name]. For example, this persona might normally be called \"Busy Bob.\" Naming is incredibly important because the adjective helps all the people that will use the personas to recall their attributes much easier and the name portion helps us imagine them as a real person. State our goal One of Moz's key business goals is to increase the number of users that signup for free services that become monthly subscribers. Therefore the goal of this persona exercise will be to discover a key segment of Moz's audience that is very likely to share and link to content, but hasn't purchased a Moz Analytics pro membership yet. Let's get to the bottom line of how we can show Moz is valuable enough to pay for. The ultimate output will be the user story, user needs, psychographics, demographics and engagement insights. Additionally, we'll have all the values required to set up a segment to measure this persona in Google Analytics including which Affinity Segment best represents the persona in the data that we've collected. We'll be using data from the Google Display Planner, Twtrland, Followerwonk, Moz Q&A, and data I scraped from Moz user profiles almost a year ago. Demographic data First, I'll start by pulling demographic data from the Google Display Planner. If you remember the DoubleClick Adplanner this has replaced it. Starting from the demographic data allows me to determine what parameters of features are valid for the user segments that I'm looking to discover. While the Display Planner will be the most relevant we could have also pulled this data from sites like Compete and Quantcast. If there's no data for your site pull data on a high-performing competitor site. Based on this data most of the people that visit Moz are between 25 and 34, Male, and use Mobile devices. They are interested in SEO, Marketing, Advertising, and Loyalty Programs. By the same token based on this data it's also valid to build a segment that is 65+, female, is a heavy tablet user and is interested in Loyalty Programs, but not SEO. While this segment is valid it's not actionable to Moz so we wouldn't create a persona based on that combination. As we collect more data the attributes we'll zero in on who are persona is. There's one big caveat to this data, I've noticed that when comparing this to client analytics that the devices data is typically way off. You must keep in mind that every analytics program measures differently and ultimately your analytics is the proving ground for any assumptions. Another caveat is that since I'm so close to the Moz brand and the 25-34, Male, mobile devices segment is me it's easy for me to lean on my assumptions. This is the very reason that I'll need to pull data from a variety of sources in order to validate any hypotheses and get the most value out of this exercise. User needs Normally user needs are best surfaced qualitatively through user interviews, but as digital marketers we can discover the user needs that we aren't currently serving through internal search analytics and social listening. Before (not provided) we could also look at Organic keywords, but now only PPC will work for that data. Once needs are determined we'll be able to identify \"need states\" which are the specific goal the user is looking to fulfill with their search and/or visit. An example need state could be \"How do I found out the best software for rankings?\" and this could be mapped to the awareness phase of the consumer decision journey. We'll speak more about this when we get to the user journey. In this case we already have a quantified user needs data set from the user profile data that Jiafeng Li already analyzed. While this information was pulled in early 2013, it'll still work to illustrate the process. From the screenshot we see that the biggest segment of users with Basic accounts is the Business Owner which we can assume means Small Business Owner in the case of Moz. Some more key data points from the report are: The largest single group of Basic users has been using Moz for less than a year though there are many that have been users for 2-7 years. There is a large group of Business Owners that spend more than 50 hours a week on SEO and are Basic users. Super Heavy Basic Users that are Business Owners are mostly interested in on-page optimization, link building, content & blogging, intermediate & advanced SEO, analytics, SEO technical issues, social media, keyword research, and entrepreneurship and web design - in that order. Business Owners make up 22% of the entire sample of users. Next, I'll switch to netnographic research. I'll take a random sampling of Moz Q&A threads looking at popular questions in each of the categories that fits my audience to identify what their needs are. I'll also look at the feature requests section of the site and finally do some social identification and listening. In Moz Q&A there are filters that help with this process allowing me to pull the questions with the most responses of each of the topics. Unfortunately this is a relatively time-consuming process because I'll need to double check the profiles of the contributors to ensure they fit within my basic user / small business segment. In interest of time I'll only review the first page of results for each topic looking at only the past 30 days because I'm not sure whether or not the old private Q&A was merged into public Q&A when Moz made the change. Next we'll look at the explicitly requested user needs with regard to the Moz product. The issues and features request section of the site provides just that. I'm sorting by the most popular feature requests and looking at the top 10. Again, this may not be completely scientifically sound because I'm looking at different windows of time for each dataset. Unfortunately, this is a hazard of netnography, but it's worth keeping track of the dates of posts when you collect your data so you can decide the range you'll be looking at after data collection is complete. A lot of this data will be captured in the form of screenshots and if you're using a tool like SnagIt it will keep track of the URL so you can refer back. Then I review the people asking and contributing to the questions to see what they are specifically talking about. Since the feature request app is on Zendesk I have to search for people's Moz profiles for verification. After this process I've found that the small business owner segment is largely underrepresented in the feature requests section of the site. Those that do give feedback are mostly agency, followed by in-house, and followed by independent consultants or agency owners. Naturally, Moz does proactively reach out to users for feedback, but the mom and pops that the getListed.org acquisition was likely to be target are definitely underrepresented in the online conversation I was able to find. Roughly, in the order of pain points that had the most business owners, we have: Multi-seat accounts - Users have been incredibly vocal for the last couple of years about wanting to be able to associate multiple email addresses with an account so multiple users can login. The conversation has gotten a bit heated because the team hasn't been able to deliver on the timelines due to other more pressing features, updates and the rollout of Moz Analytics. This was the biggest issue across all account types, but it was definitely dominated by agencies. This makes sense because business owners typically will not require multiple parties to login to their account. The Value of Moz - Based on the insights I got from the segmentation I went into this exercise I assumed the biggest pain point would be in a small business owner not understanding the value of Moz. These users seem to understand that there is some value in the Moz toolset, but they can't quite justify the expense when they are a small fry. Moz iPhone App - Some People want at least top line metrics from Moz Analytics and Whiteboard Friday in a native phone app. Cloning / Altering Campaigns - Users need to be able to make changes to the domain name in accounts and not lose their historical data Analysis of More Competitors - Users need to compare more than 5 competitors. Some are asking for as many as 15 Moz Link Manager - Some users appear to be big fans of the toolset, but wish it had features of other tools so they could just use Moz for everything From this I've found some specific user needs and validated that there are indeed users within the demographic that the Display Planner reported. The next step is social listening. I'll be leveraging free tools with keywords identified in the user needs collection phase for this, namely Twtrland and Twitter Search. Normally, I would have used Discussion Search, but it seems like Google killed it recently. Luckily Twitter Search allows us to search by sentiment and return tweets that have questions. The negative sentiment filter is a bit of a joke though because it just looks for a frown smiley face rather than performing sentiment analysis. I'll keep it simple and search for tweets with questions. Immediately I find a user within our target group is asking for feature. It's good old Justin Briggs asking for improvements to the workflow. Justin is no longer a small business owner, but was until recently so I'd consider his feedback valid. However this reveals my bias and context so I will dump it. Further searches through the tweet with question marks reveal more ephemeral questions regarding the status and uptime of Moz. However that's an insight in and of itself, Moz should do a better job of making the Application Status experience more visible. It took me 10 minutes to remember where it was and I couldn't find it by searching. My next step is to review the users that fit my demographic data to look for commonalities. In this case I can use Twtrland to look at that specific subset of Followers. Twtrland has filters that allow me to set the gender, the age range and whether or not the user is an entrepreneur. I'll also take a quick peek at Graph Search on Facebook to see what type of people it returns when I look for Men who are not my friends and like Moz. This allows me to review these people's timelines to discover more common interests and develop more robust profiles. For example, I've noticed a lot of users that follow Moz also read Tim Ferriss books. Then I can go to Followerwonk and see that there is a user overlap of nearly 20k users which tells me this is a potentially valid data point. Bringing it all together At this point we've discovered more than enough data points from the user's ecosystem to tell a full story of Mozzy Smurf, so let's do it. Mozzy Smurf is an internet entrepreneur whose coffee table is littered with books like \"The Lean Startup\" and \"The 4-Hour Work Week.\" As a young male business owner in an always-on world he has little tolerance for lack of speed or agility in the tools he chooses to pay for. Mozzy Smurf is a power user that prefers one tool over many and he needs his data easily on the go. A fan of the Moz brand, he has learned a lot of what he knows from the thought leaders on the Moz blog and is busy putting it into practice on his business venture. Trying to get his business off the ground he knows SEO is free traffic, but he also knows that it requires a large time and content commitment. While Mozzy Smurf subscribes to the philosophies in the books he's read he knows it'll take hard work to get him there and he appreciates that. Keeping the ball in the air takes a lot of traveling for Mozzy Smurf. He's often found in the SmurfAir Lounge between connections on upgraded flights. Mozzy Smurf appreciates his loyalty programs and will pay money to get exactly what he wants, but only if he's getting exactly what he wants. Mozzy Smurf is an avid reader of the Moz blog and its long form content. He especially enjoys listening to Whiteboard Friday as he's traveling. Mozzy Smurf wants to know the tactics that will get his business to profitability as soon as possible and he needs his team to be able to help out and monitor the progress. Mozzy Smurf was a long time follower of Moz for some time and considers himself a fan of the brand, but he expects more out of the software in the wake of their funding and doesn't see enough value. He monitors the growth of the product, but finds it difficult to invest in when there are so many features that he never uses. Engagement Insights: A la Carte Pricing Tier - Moz should consider an a la carte tier of product pricing model for this user type, but only offer it sometime after they cancel their account. Mozzy Smurf wants his account to scale up and down as required. iOS/Android App or Phone-Optimized Views - Mozzy Smurf wants to check his Moz metrics at a glance when he's about to hop on a plane or when he's in a meeting. Moz should consider building a paired down app that allows for customized dashboard display. Multi-Seat Accounts - Mozzy Smurf's team needs to be able to login to his account when he's on the road, but he doesn't like them being so close to the password he uses for everything else. He also doesn't quite understand that other users can't access his credit card details. Post the Moz Roadmap and Progress - Mozzy Smurf could believe in the Moz product more if he had more visibility into the overall roadmap and progress. While Moz does do some of this, a more robust experience integrated with the Moz Status experience may be exactly what Mozzy Smurf needs. He's a savvy enough individual to know making great products takes time, but just wants to know what's going on. Gamified Feature Catch up - Mozzy Smurf loves the features of Moz's competitors, but hates having to use several different tools. Moz should consider polling this persona for the features they want the most. This experience can delivered in a leaderboard fashion and there could be an offering of incentives to those users who have picked the feature that will roll out next. More Premium Gated Content - With the launch of Moz Analytics Moz made a lot of the gated content free. Mozzy Smurf saw the value of a subscription decrease when Mozinars and Q&A became public. Moz may be well-served developing even more new gated content units and typoes. Value-based On-boarding - Mozzy Smurf doesn't know about all the awesome products in Moz and therefore doesn't understand what his $99/month is getting him. Tooltips at Login - Surfacing features, tricks and content relevant to Mozzy Smurfs interests as tooltips will help him see more value in the product. Of the Affinity Segments Mozzy Smurf matches the Technophiles best and the following is how he'd be represented as a custom segment in Google Analytics. We use the demographics we uncovered in our research as well as the most relevant Affinity Category. In the case of Moz we'd also look to fire custom variables based on the user profiles so we can more accurately ensure that it's Mozzy Smurf that's visiting. Now just like that we have a persona whose activity can be measured across the entire site. Normally there would be even more iterations of the research and deeper dives into every available data point, but this illustrates the process of collecting data and then telling a plausible story that we can act against. Back to table of contents The user journey is the path the user must take to fulfill a given need or meet a given goal (which can be a collection of needs). You may be familiar with the concept of the marketing funnel and the consumer decision journey; the user journey can mirror these or can be comprised of various steps that lie within these stages. For designers this typically is just the path within the site, but for the marketing context these need states represent different phases that are associated with different actions, content and even keywords. User journeys happen across various properties, devices and time periods. For example, planning a vacation involves many steps. Research places to go, search for things to do, research to plan itinerary, find the best prices, book the trip, find out whether you need a visa, get the visa, buy things for the trip, pack bags, find transport to the airport, check into the flight, fly, get to the hotel, enjoy the trip, come home, post on social media about the trip, review the trip on the travel agent site. Some portions of the user journey is online, some is off. All of these need states that are relevant to the business can be mapped to the consumer decision journey and your funnel for better measurement and optimization, but what's important is understanding user needs and how to support them at all relevant stages in order to meet the business objectives. The phase in the user journey or need state is what we're looking to uncover per keyword with the persona-driven keyword research process. I'll go more in-depth on this in a future post, but the user journey will become relatively obvious during the persona creation exercises if you're doing them right. As you interview, review and empathize with the user it'll be clear what steps they are taking to the meet their goals and which of those steps are large pain points. In your content auditing process you should make sure that content fits the need states of the user journey and your content plan should support any phases within the journey that have content gaps. For example, until recently Moz lacked robust documentation for the API. Users on a journey to leverage Moz data in their own applications or custom reporting systems looking for information were not able to find what they are looking for. Therefore the \"How do I use Moz data in my application?\" need state was not sufficiently met. The new docs are amazing. Shoutout to the Moz team for fixing the issue. Back to table of contents Now that we've built our personas we are able to add more layers of intelligence to our marketing efforts. Lead scoring I've never used Marketo, but I know their product is one of the leading tools for lead management. However by identifying your personas using data sets like FullContact or RapLeaf or even by having them sign in to your site with LinkedIn and tracking their actions over time you can score the leads yourself. I'm sure I will follow up with a more detailed post on how to do this including the code, but from a high-level it goes as follows: First develop values for different actions on the site. Visiting the pricing page several times is worth more than reading a blog post while visiting the jobs page and looking at a specific job is worth negative points. Upon arrival log the following for the user in persistent cookies: The channel the user came from The landing page Their first action Score of actions Offer progressively aggressive opportunities for the user to login and/or self-identify using LinkedIn, creating an account. Once the user has self-identified apply the previously logged actions to the user and save them in the database and continue to log their score. Keep tracking the user's actions across all possible channels until they meet a specified threshold. At which point send an email to your team and log them as a hot lead in SalesForce or whatever other CRM you use. Lead scoring also needs to be a feedback loop between the marketing and sales teams because you're ultimately trying to mathematically determine when a lead is worthwhile. Your salespeople will know better if your math is right or wrong. Building effective business cases It tends to resonate far more with clients when you make a business case in context of a persona. \"Our link building campaign will help us capture 40% more of the Mozzy Smurf persona who converts at a rate of 13.4% when they land on our signup page and has subscription retention rate of 42.3%\" means a lot more to a client than \"our link building campaign will get us number one for the keyword \"software as a service.\" I spoke about this at length in my MozCon talk in 2012. Content strategy and content marketing I usually start all conversations when I mention Content Strategy and Content Marketing in the same sentence with some sort of remark about how they are not the same thing and this will be no different. Content Strategy and Content Marketing are very different things, but what they should always share is a focus on the user. The work products of both disciplines are much less effective without keeping the user at the center. With all the intelligence collected on users it's quite easy to make data-driven decisions about what content will resonate with your target audience and drive processes and workflows to support the inclusion of those users in ideation phases. You'll also become acutely aware of channels where those users are hanging out so you can get direct feedback on any content you're thinking about creating and you can easily identify these influencers that will spread your content. Vetting content ideas through the lens of your users keeps the strategy in your Content Marketing and the marketing in your Content Strategy. Legitimate guest posting With all the discussion of the death of guest posting the focus shifts back to high quality guest posting opportunities to place your message in front of your target audience in order to drive referral traffic. If there is a good contextual link opportunity within that framework - awesome. Otherwise guest posting should be vetted by more than just domain authority or PageRank. Once you've got a strong understanding of your audience you'll be able to compare their makeup with the makeup of a given site's audience. Considering the situation where I'm targeting the Mozzy Smurf segment and I have two sites to choose from for a guest post, the Smurf's Village site and the Moz site. Using a tool like Twtrland or Followerwonk I can pull demographic and interest data on their followers. It's clear from the demographic data that my audience is not strong in the Smurfs' Village community. It's also clear that my audience is definitely here on the Moz site. Granted this is an obvious example, but the methodology holds true for sites that are not as obvious. For example, what if I made a SaaS toolset for managing outreach, but realized that it doubles as a good CRM system for entrepreneurs? Now I want to write a post about digital entrepreneurship in New York City and my choices are Forbes and Wall Street Journal. Which should I choose? Your research now shows empirically that you are better off guest posting on Forbes than WSJ. This gives your content the best opportunity to spread naturally. It's cyclical however because without the research you may not have discovered that the topic is one that your audience cares about or you may not have realized that your biggest user opportunity is in NYC, but once you've got those inputs the tools make it easy. Outreach I've spoken at length about persona based outreach with Social Media methodologies I've developed and shared. Personas help with the identification of link prospects at scale through tools like Followerwonk and Twtrland. They also help with the creating contextual conversations with these people . The psychographics of the persona allows you to quickly identify topics that may be of interest to these people in order to write outreach emails that will resonate. Measurement I went into a lot of detail on what is called cohort analysis in my last Moz post. The key takeaway is that cohort analysis gives us context that keywords never did. Consider this hypothetical case of my favorite ambiguous keyword \"reading glasses.\" The keyword \"reading glasses\" is a funny one because it could mean one thing to me as someone who lives in New York City, but it could mean something entirely different to someone visiting Reading, Pennsylvania looking for souvenirs. Let's compare two scenarios. Explicit intent scenario Users land on the \"men's reading glasses\" landing from Organic search on the keyword [reading glasses] Time On Site: 00:01 Bounce Rate: 100% Implicit intent scenario Cohort Lands on the \"men's reading glasses\" landing page from Organic Search Age: 25 - 34 Gender: Female Location: Reading, Pennsylvania Affinity Category: Do It Yourselfers Time On Site: 00:31 Site Action: Visits Souvenir Reading Glasses for Women page Bounce Rate: 50% In the explicit intent scenario we knew that the user landed on the \"men's reading glasses page\" using the keyword [reading glasses] from Organic Search and they left immediately. We're not all that sure why that happened we just know that it did and they must not have found what they were looking for. However in the implicit intent scenario although we don't have the keyword to tell us what this user is looking for we know she is between 25 and 34, landed on the \"men's reading glasses\" page from Reading,PA. She's of the DIY Affinity Category, she stayed on the site for 31 seconds and her immediate action once she landed on the wrong page was to visit the Souvenir Reading Glasses for Women page. That tells me that this person most likely came in on the keyword [reading glasses] and we've failed in our page title and meta description. We should also figure out how to build a better landing page that supports both ideas and drives the user straight to the conversion once they arrive. Ultimately, using personas gets us closer to the why behind what a given user type is doing. With (not provided) still on everyone's mind as we are rapidly approaching 100% Secure Search in all the relevant engines, applying this idea to solve not provided allows us a more sophisticated form of measurement through implicit intent rather than explicit intent. If you're going to do this you should implement the following code rather than the code that Google tells you to because Google's code relies on the execution of DoubleClick to populate the data into GA. The problem is that many users have installed AdBlock and, as you can see in the Ad Settings above, users can opt-out entirely (hat tip to Mike Pantoliano for schooling me on this). Using Google's DoubleClick code would be far worse than the sampling issues that pop up in those infernal yellow indicators below the date in GA. <script type=\"text/javascript\"> var _gaq = _gaq || []; _gaq.push( ['_setAccount', 'UA-XXXXXXX-1'],['_trackPageview'] ); (function() { var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true; ga.src = ('https:' == document.location.protocol ? 'https://' : 'http://') + 'stats.g.doubleclick.net/dc.js'; var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s); })(); window.onload = function() { if(_gaq.I==undefined){ _gaq.push(['_trackEvent', 'tracking_script', 'loaded', 'ga.js', ,true]); ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true; ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js'; s = document.getElementsByTagName('script')[0]; gaScript = s.parentNode.insertBefore(ga, s); } else { _gaq.push(['_trackEvent', 'tracking_script', 'loaded', 'dc.js', ,true]); } }; </script> You should further consider leveraging Google Analytics Content Grouping in context with this so you can easily see which content types are performing for each persona type. And finally you should consider tracking site actions to infer intent through context of personas as well. Optimization On a basic level what Conversion Rate Optimizers do is look to understand the audience and make adjustments based on what will work better in persuading the people that are likely to take action. Now Google's Content Experiments allows you to set up you're A/B tests based on segments (demographics, affinity categories, channels). So the first thing to do is build user personas atop of Google's Affinity Segments so they are inherently measurable and now you have a much better idea of which of your personas is performing. Back to table of contents Although there are many advanced applications that we've discussed there are even more ways that personas can be leveraged as building blocks to more intelligent marketing. Web psychology Nathalie Nahai's work is very much the next level of progression of what to do with personas. Applying cohort and socio-psychological principles to personas specifically with regard to the user journey is a more complicated layer that I'm not learned enough to do. However filling in the blanks beyond what can be directly inferred from the data is precisely the way to make personas more actionable. Check out her MozCon talk. Behavioral economics The behavioral economics field in general is also highly applicable here and Dan Ariely has written some great books on it. If you've ever wondered why people are more likely to by something for $999.99 than for $10,000.00 then behavioral economics is a field for you. Start with A Marketer's Guide to Behavioral Economics for an overview and then check out Dan's books. Dynamic targeting / personalization The ability to personalize experiences based on the given persona is the true power of digital marketing. Despite the ugly light that the NSA has cast on tracking usage data this is the same reason why the user experience with Amazon is so incredible. As Christopher Butler discusses in his \"Don't Make Me Search\" post, Amazon tracks all of your actions in context of your user type and surfaces products you need before you think to search for them. Amazon believes in their ability to model users so effectively that they are taking steps to start shipping products to you before they even order them ! This is the same type of customer modeling we found out that Target is doing to figure out a girl was pregnant before her family knew a few years back. As marketers we can easily harness this power with tools like Nudgespot and Keyword Lift. Back to table of contents Like I said I've experienced a lot of pushback, especially amongst those that have more SEO than marketing experience. Here are some questions I've gotten on more than one occasion. This isn't SEO. Why do I need to do it? If SEO is marketing then I'd argue that this is indeed SEO. You need to understand the user in order to fight for the user. Their attention, their money, their time. Many optimized pages fail to perform against the KPIs beyond rankings largely because we stop at the keyword and forget there is a person seeking to fulfill a specific need behind it. Also, I firmly believe that the future of Google is the personal algorithm and we're seeing the beginnings of it with Google Now and the like. Google will soon be using your identity in context with your search history and all the other affinity data they've collected to do the same thing Amazon does. Soon creating content that speaks to specific audiences will be the only way to effectively get your message in front of them through Organic Searc. In fact Bing is already rumored to be taking demographic data into account when they rank pages. That makes sense given the wealth of data they have via their Facebook and Twitter partnerships and the Page-biased Search patent supports that idea with this statement: \"A page-biased search system can use demographic information to bias search results toward results associated with similar demographics. Demographic information of a user of the page-biased search system, of other viewers of a currently- or previously-viewed Web page or other suitable document or Web site, or a combination of these can be compared with demographic information of viewers of a Web page or document to be included in a set of search results. Web pages or other suitable documents to be included in a set of search results having demographics that are similar to demographics of a user or a currently- or previously-viewed Web pages or documents can be ranked more highly than other Web pages or other suitable documents.\" I think we can all agree that Google is rarely, if ever, behind. After all these features are already built into the ad platform and personalization of SERPs is already a very real thing. My site's doing well without this. Why should I build personas? If your conversion rates across all KPIs are 100%, then I agree. Otherwise there are always ways to improve and better serve users. Understanding and segmenting the available market is a key first step to doing that. My target audience is everybody, why do I need to segment? Targeting everyone is targeting no one. Treating every visitor as exactly the same is not the best idea for marketing since it limits your ability to get the most conversions. At the very least users should be able to take separate paths through the site that speak directly to their needs and. I would suggest reassessing who needs your product or service and developing content strategy with regard to them rather than just keywords. I don't have any data, how can I build personas? You can always do ethnographic research through social listening and reviewing communities where your users or targets congregate. If you have customers you always have data. If you don't have customers you can always survey your targets or leverage competitive intelligence tools. How long does it take to build personas? That's hard to say. How long did it take you to put together your first analytics report? How about your first SEO & Social report? It depends how in-depth you'd like to go. As with anything it takes a long time the first time, but you get better at spotting trends quickly or you learn how to use your tools faster as you master the process. What if we or the client already has personas, do I use those? That's your judgment call to make. Norris and I always looked to vet a client's personas before we'd use them. If they aren't actionable for your context definitely don't use them as-is. You can use them as inputs for your own research. Debunking personas can go either way. Your client can get onboard saying they always thought their previous personas were inadequate or they could push back against your new ones for reasons that are not necessarily logical. I'm in a small niche, small or local biz. Do I need to do this? Heavens, yes! I'd say that if you're in a small niche you need this more than anyone because the people looking to use your products or services will be especially fickle and looking for differentiation. If you're a small or local business you are in a better position to leverage market segmentation tools out of the box. PRIZM was especially made for your use case. The ZIP-code lookup tool is free for a certain amount of queries to try out and it will return the top 5 PRIZM codes in your ZIP code. This is especially useful if you're working on local search campaigns. Back to table of contents Here are some smurfy resources for continued reading. There are many resources out there, but I feel these are the most actionable that I've come across. How Understanding Your Customer Will Help You Create Copy That Sells How Developing Role-Based Personas Can Increase Conversions The Ultimate Guide to Targeting Twitter Users and Connecting with Influencers Why You Ought to Throw Away Your Vanity Metrics for These 5 Customer Metrics Customer Analytics: How Analyzing Real People Will Improve Your Business An Introduction to Personas and How to Create Them Keyword-Driven Personas An Introduction to User Journeys Reconciling Market Segments and Personas The Essential Persona Lifecycle: Your Guide to Building and Using Personas Also, here are some things that I've written on related topics: Keyword-Level Demographics Persona-driven Keyword Research Process Personas for SEO What I Learned from Creating SEOmoz's Userbase Psychographic Targeting Unhinged! The Zen Of “Whole Customer” Persona Modeling Go forth and fight for the users So you've made it through the longest post I'll probably ever write about anything. I'd love to hear how you've leveraged personas to do better inbound marketing. Or if you haven't done it yet, I'd love to hear about how you plan to. I'd also be delighted to answer any questions around research and implementation. Oh yeah, and I wrote this entire post in the voice of Gargamel. I dare you to go back and read it again. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Personas: The Art and Science of Understanding the Person Behind the Visit"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Personas: The Art and Science of Understanding the Person Behind the Visit"
    },
    {
      "level": "H3",
      "text": "Segments"
    },
    {
      "level": "H3",
      "text": "Cohorts"
    },
    {
      "level": "H3",
      "text": "Personas"
    },
    {
      "level": "H3",
      "text": "Affinity segments/categories"
    },
    {
      "level": "H3",
      "text": "Layering data"
    },
    {
      "level": "H3",
      "text": "Qualitative research"
    },
    {
      "level": "H4",
      "text": "Affinity mapping / affinity diagramming"
    },
    {
      "level": "H4",
      "text": "Focus groups"
    },
    {
      "level": "H4",
      "text": "User/customer interviews"
    },
    {
      "level": "H4",
      "text": "Ethnographic research"
    },
    {
      "level": "H3",
      "text": "Quantitative research"
    },
    {
      "level": "H4",
      "text": "Multiple-choice surveys"
    },
    {
      "level": "H4",
      "text": "Market segmentation tools"
    },
    {
      "level": "H4",
      "text": "Analytics"
    },
    {
      "level": "H4",
      "text": "User profiles"
    },
    {
      "level": "H4",
      "text": "Internal data"
    },
    {
      "level": "H4",
      "text": "Publicly available studies"
    },
    {
      "level": "H3",
      "text": "State our goal"
    },
    {
      "level": "H3",
      "text": "Demographic data"
    },
    {
      "level": "H3",
      "text": "User needs"
    },
    {
      "level": "H3",
      "text": "Bringing it all together"
    },
    {
      "level": "H4",
      "text": "Engagement Insights:"
    },
    {
      "level": "H3",
      "text": "Lead scoring"
    },
    {
      "level": "H3",
      "text": "Building effective business cases"
    },
    {
      "level": "H3",
      "text": "Content strategy and content marketing"
    },
    {
      "level": "H3",
      "text": "Legitimate guest posting"
    },
    {
      "level": "H3",
      "text": "Outreach"
    },
    {
      "level": "H3",
      "text": "Measurement"
    },
    {
      "level": "H3",
      "text": "Optimization"
    },
    {
      "level": "H3",
      "text": "Web psychology"
    },
    {
      "level": "H3",
      "text": "Behavioral economics"
    },
    {
      "level": "H3",
      "text": "Dynamic targeting / personalization"
    },
    {
      "level": "H3",
      "text": "Go forth and fight for the users"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Unlock Your B2B SEO Content with Structured Resource Sections"
    },
    {
      "level": "H3",
      "text": "The ROI of Accessibility in SEO"
    },
    {
      "level": "H3",
      "text": "How SEOs and UX Designers Can Work Better Together — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Michael King\n          \n            Michael King\n          \n            Michael King"
}