{
  "url": "https://moz.com/blog/personality-analysis-the-makings-of-a-seo",
  "slug": "personality-analysis-the-makings-of-a-seo",
  "title": "Personality Analysis: The Makings of an SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A look at the unique and rare personality combinations that drive the best in the industry.  Ok, lets face it…people love to read these kinds of things to get the ego boost that can come out of them. Invariably, any online personality analysis pumps you up by going into great detail your many…",
  "content": "Personality Analysis: The Makings of an SEO Public Relations By: Dan Tynski April 1, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Dan Tynski April 1, 2007 Personality Analysis: The Makings of an SEO Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. A look at the unique and rare personality combinations that drive the best in the industry. Ok, let's face it…people love to read these kinds of things to get the ego boost that can come out of them. Invariably, any online personality analysis pumps you up by going into great detail your many unique strengths while glossing over, playing down, or even spinning any negative traits into something positive. There is even an entire sect of psychology known as personality theory that seeks to understand the reasons for the development of certain traits. Recently, the Jung typology, based upon the personality theories of world famous psychoanalyst Carl Jung, have gained somewhat of a pop culture appeal. Its become somewhat of a fad to discover whether you’re an ISTJ, and ENTP or an ESFJ (and then of course the quest to discover your partner’s typology and if you are, indeed, compatible). Putting this to the side, in an attempt to forget the pop psychology and gross over generalizations, most of us can probably agree that there, at the very least, a definite set of personality types which each of our personalities can loosely be defined. So here is my attempt to explore the typology of an SEO. This analysis is, of course, based upon no real empirical knowledge, completely biased, and based mostly on my own bloated sense of self….but it will be an interesting exercise nonetheless —and hopefully an ego boost to those of you out there proud to call yourself SEO’s. The traits: Highly Inquisitive Nature The scientific types are drawn to questions that don’t yet have answers. They are practitioners of the scientific method, proposing hypotheses that can be tested. In this way, SEOs are very similar. We have been faced with a great mystery of the internet (why Google & others do what they do and why). The search algorithms are, to us, what a grand unified theory might be to a physicist. We are working with a black box whose inner workings are only revealed to us slowly, piece by piece, often in contradictory or changing ways. But this is the truly great thing about being in this industry. We are constantly challenged. Each time we think we understand what needs to be done to get our sites to the top, something changes, little variables change, and we are faced with the challenge of discovering what will bring us back where we want to be. An Analytical Mind Some would define the term analytical as an approach defined not by trial and error, but by formula and definitive equations. I would not necessarily argue with this definition, and it could be said that we are in the business of trial and error, but I believe our methods are more precise than this, and our goals are certainly loftier. Our analytical minds may have to play the game of trial and error, but we derive our satisfaction through our concrete discoveries. The rooting out of those little problems on our sites, the little gems and techniques we find that offer us insight and better understanding (and of course better rankings!). In fact, this analysis of our results, our analytics (ha!) are at the crux of our business, and what we learn through these discoveries is what propels us forward. So this thinking person that loves to be analytical, to ask why, to be looking for those formulas that exist somewhere and can explain our questions - this is the SEO. A Gambler’s Sensibility I’ve read that being in SEO is similar to being on crack. I have to agree with this on some levels. The addicting nature of anything has to do with the high that it brings you, and then the loss of that high. The reward which is processed is so great, and the low felt when that reward has been lost sends you hungering again for that high. If this is the definition of an addiction, SEO is an addiction. Like any gambler, we love those highs and hate those lows. We’ve experienced the blow of a drop in our rankings, any number of penalties or (gasp) being faced with the prospect of filing a reinclusion request. We also know that feeling of hitting the jackpot when their SERPS change drastically and you’re on top of the world. Whether you’re white hat or black hat, you know the temptation of “checking your stats.” It's addicting, and to me, it's like playing the slots every time. A Highly Active Imagination This is one trait that I believe really makes people in our industry exemplary. It's what makes our personalities truly unique and a very special combination of abilities. The combination of an incredibly creative mind that is also highly analytical is certainly uncommon. It is, however, the archetype of the SEO. We are the definition of the out of the box thinker. We love to hear those ideas that make us slap ourselves on the forehead and say “Why didn’t I think of that?” We’re constantly putting our analytical mind to work on those creative projects, those creative ideas. It's this combination that makes a fanciful marketing notion into a reality….what makes an idea on a whim into a killer piece of link bait. Independent Attitude For me, this does not mean an aversion to working in groups. In fact, I would credit with most people in our industry as being highly collaborative and in many ways, community minded. What I mean here is that we have the self-reliance and the resourcefulness necessary to propel our businesses forward, to take that extra step, or come up with that little push that will deliver results. This is essential, I think, and it comes along with our ability to be independent thinkers, to take what others say at face value, and to always question what we find, and what others find. Entrepreneurial Nature This seems like a universal, and is perhaps applicable to many who make their living on the internet. For SEOs, though, there is certainly that desire to build something brewing under the surface. Like any entrepreneur, we desire networking, new knowledge, new techniques, anything that will help our business grow, anything that can help us help our clients. We learn all we can hungrily, understanding that knowledge truly is power in this business, the power to become an authority, to be trusted. Those in our business approach the goal of growth from different viewpoints. Some agree that sharing knowledge is the key; others hoard their secrets and hold their ideas closely. Some are white hat, some are black, and some somewhere in the middle, but we all share that entrepreneurial spirit. We are all, of course, very different. So what do you think? What would you add to the list…or possibly take away.? Or are we way off base to be attributing a list of qualities to a whole group to begin with? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Personality Analysis: The Makings of an SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Personality Analysis: The Makings of an SEO"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dan Tynski\n          \n            Dan Tynski\n          \n            Dan Tynski"
}