{
  "url": "https://moz.com/blog/personal-brand-punch",
  "slug": "personal-brand-punch",
  "title": "Personal Brand Punch: Why Your Brand Should Be Represented by Real People - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "More and more brands realize their is real business value in humanizing their brand via content and social media. But far fewer have taken the next step: nurturing and supporting real in-house personal brands to represent the brand. Learn how to harness the incredible power that happens when people…",
  "content": "Personal Brand Punch: Why Your Brand Should Be Represented by Real People Content Marketing | Branding By: Mark Traphagen December 2, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Mark Traphagen December 2, 2014 Personal Brand Punch: Why Your Brand Should Be Represented by Real People Content Marketing | Branding The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. What do you think was the biggest leap forward in human evolution? The ability to walk upright on hind limbs? Stereoscopic eyesight? Opposable thumbs? I'd argue that our most beneficial adaptation was our propensity to be social. While many other animals are also social to some degree, humans combined the advantages of the pack for defense and hunting with a brain capacity that allowed advanced levels of communication. That social instinct combined with speech gave us an extraordinary survival ability that led to us becoming the dominant species on the planet. This article isn't a science lesson, but I'm proposing that understanding the social and interpersonal aspect of our humanity is crucial to effective marketing. Now that may seem like a \"duh\" to many of you. You get that in this social web era brands need to be more \"human\" and more \"engaging,\" that they need to foster real \"conversations.\" However, in this article I'm going to contend that no brand is really fully tapping into the potential of any of those social marketing aspects until they are doing so with real people: actual company representatives who become the \"face\" for that company in its content and social media interactions. I intend this as a follow-up and further development of my last two articles for Moz: Why Your Brand Shouldn't Fear Assigning Authorship Author Photos Are Gone: Does Google Authorship Still Have Value? Both of those articles were about Google Authorship, a Google Search feature that no longer exists. Yet it is my strong belief that the principal value of Authorship is alive and well. That is, there is tremendous value in having a recognized personal brand with trusted, authoritative content, connected to your company brand. This article will explore that principle value in four parts: The power of a social brand The power of brand EAT (Expertise, Authority, Trustworthiness) The power of the personal for social EAT Putting the power to work Parts one and two are introductory. They lay the groundwork for what I see corporate personal brands doing most effectively. If you think you have a good understanding of why brands need to be social, and how expertise-authority-trustworthiness contribute to real business goals, then feel free to skip straight to part three. Parts three and four demonstrate how the power of a social brand that understands the value of expertise, authority, and trust can be supercharged by tying itself to powerful personal brands. 1. The power of a social brand Before I build this out any further, I want to distinguish between what I'm calling a \"social brand\" and the popular term \"social business.\" A social business is defined either as a business that invests heavily in social causes, or as a business that encourages its employees to be active online on behalf of the business. The latter type of social business is probably more effective in being a social brand, but it is not necessary to be a social business to be a social brand. So what do I mean by a social brand? Simply this: a social brand is a brand that actively pursues use of online social platforms for the purposes of marketing and branding by taking advantage of the full spectrum of social interactions. In other words, a social brand does not just post to social networks. It actively engages there, seeking to enter into and create relevant conversations with real people. Coca-Cola and Denny's Restaurants are examples of social brands by that definition. Coke's Hub Network command center follows a listen > analyze > engage process to catch relevant online conversations, quickly assess whether Coke has something to contribute, and when it does, create social engagements that enhance the conversation and win the brand new fans and friends. Denny's has a much smaller social team, yet they have proven themselves just as agile and creative as Coca-Cola in developing conversations around their brand. They built on the idea that the kinds of conversations people have online are similar to the chats people have with friends around a diner table to develop their \"America's Diner\" brand. In both cases, these brands were able to use social conversations to enhance and reinforce the kinds of associations they wanted people to have with their brands. Those kinds of social engagements make the best use of what social media does best for marketing. While it may be true that social media rarely creates either direct customer acquisitions or direct sales, smart marketers realize that they have to be planting the seeds that may one day sprout in the leads and sales that are their ultimate objectives. And that's where social media is immensely useful. On social networks brands have the opportunity to share content and engage in conversations that build the expertise, authority, and trust that make real people more likely to buy from them when that moment of decision comes. In the next section, we'll explore the value all that brings to a brand. 2. The power of brand EAT What is brand EAT? The EAT acronym comes from the most recent version of the perennially-leaked Google Quality Rating Guidelines, the handbook for training the humans who help evaluate how well Google's algorithm does at assessing the quality of web sites. Google now wants those evaluators to focus on three main quality criteria: Expertise, Authority, and Trustworthiness (hence EAT). Even though those are criteria for determining quality as a search ranking factor, we should realize that Google emphasizes them because they are the \"in real life\" factors that affect how real people evaluate not only web pages, but entire brands. Let's briefly explore each factor. Expertise People want to do business with brands that seem to know what they are talking about. Even though it's generally cheaper and more convenient for my wife and me to deal through big box home improvement chains, we go to our local independent hardware store whenever possible. Why? We got tired of sales people at the big box stores who knew less than we did about paint or roofing materials or lighting fixtures. Our local storefront hardware supplier has won our loyalty and business because he's always able to answer our questions. It can work the same way online. I'm severely graphically challenged. When it comes to creating effective visuals for my content, I'm a great nuclear physicist (and I had to look up how to spell nuclear!). But via some social media shares I ran across the very helpful design tutorials at Canva.com. Those guides were so helpful, they caused me to want to look into Canva's user-friendly image creation tool. And now I'm a loyal customer. Authority Authority is expertise taken to the next level. You can be an expert in your topic and just be crying out in the desert, but when people start listening to you, recommending you, and resharing what you say, you've graduated to the authority level. At the risk of being slightly sycophantic to my publisher, I'll point to the Moz brand as being a recognized authority. Through the high level of content associated with Moz, whether on this blog, in Whiteboard Friday videos, or at conferences, a great many people have high confidence in pointing to Moz and having their own names associated with Moz in the areas of SEO and digital marketing in general. When I've published here in the past, I noticed that within seconds of my post going live, people were already sharing it on social media. Given the length of my posts, they can't possibly have read them in that time! But that's where the Moz authority kicks in. People have learned to have confidence that if Moz publishes it, it must be good. And so they hit that share button even before they read. Of course, that makes me always want to bring my A game when I write here! The value for Moz is that the authority generated by their high quality content gets associated with the tools and services they sell. Trustworthiness It's difficult to tease out trustworthiness from the other two factors, as it seems to me to be a natural by-product of expertise and authority. In other words, people are willing to place their trust in a brand that has helped them, enriched their life in some way, or to which others they trust point as being worthwhile. Just as in human relationships, brand trust is never instantaneous. It has to be earned over time. And so I might propose that trustworthiness is the time dimension of the expertise and authority factors. Another way of saying that: trustworthiness is reliable expertise leading to true authority expressed consistently over time. If you're a regular consumer of content online, inevitably you've reached a point when you had to make decisions about whom you're going to give your limited attention. Brands that have achieved trustworthiness with you are far more likely to be on that short list. And they are therefore much more likely to be top-of-mind when you are in the marketplace. The missing dimension As important as expertise, authority, and trustworthiness are for establishing quality, standing alone I believe they lack something that could bring them to life and make a brand truly stand out from the crowd. In the next section I'll unveil that missing dimension. 3. The power of the personal for social EAT The fourth dimension Back in elementary school you probably learned that we live in a three-dimensional world. The dimensions of length, width, and height create space, the place in which we live and move and have our being. When you advanced further in your education, you probably heard, though, that a universe does not exist by space alone. Space must be accompanied by a vital fourth dimension: time. Time allows for motion within space, and everything we know and love comes from that. I believe the three \"EAT\" dimensions described above (expertise, authority, trustworthiness) also need a fourth dimension to bring them to life and set them in motion. That fourth dimension is the personal. What makes us humans Remember my little evolution lesson at the top of this article? I highlighted two characteristics of humans that contributed powerfully to our ability to survive and thrive: Our innate desire to be together, especially with our families and tribes. Our ability to communicate. Together, those two factors not only contributed to human survival and development, but eventually enabled what we call civilization. While most marketers don't have goals quite as lofty as civilization building, we do want to do more than survive. We want to build our own brand empires, so to speak. In that endeavor, the social and communicative aspects of humanity are our allies, just as they were to the very creation of humanity. Face up to it Take a look at the image below. What do you see? Of course, it's a common US electrical outlet. But I'm betting you couldn't help seeing a human face. The mere suggestion of two eyes and a mouth in the right configuration, surrounded by a circle, and our brain fills in the rest. What's more, doesn't this \"face\" suggest to you some emotion? Perhaps fright, or dismay? Pretty powerful for a piece of plastic from a hardware store! Scientists call this phenomenon pareidolia. It's the persistent human tendency to see human faces even in inanimate objects. The fact is that as humans we are powerfully drawn to other humans. So powerfully that we often project human attributes on to non-human things. That's why we can even speak of \"humanizing\" brands, brand \"personalities,\" and brands being \"social.\" But even though it is possible for faceless brands to achieve a certain level of humanization and socialization, there is no substitute for the real thing. That is, the power of human connection is most powerful when it occurs between two or more real human beings. Even Google understood it Even though Google recently abandoned its Google Authorship program that displayed a face photo (sometimes) and a byline name in search results for content by qualified authors, the fact that the experiment lasted three full years demonstrates that Google understands the power of a personal connection. I find it interesting that Google has retained Authorship-style snippets in personalized (logged-in to a Google+ account) searches for Google+ posts by people you have circled. That means that even if Google decided Authorship snippets were too much for regular search, seeing a name and a face are still powerful and useful signals if that name and face are familiar to the searcher. So it stands to reason that when a real face and name become associated with authoritative, trustworthy content, people will more naturally make a personal connection with that content. And they will look for that same face in the crowd when they need to know more. Let our powers combine! Let's put this all together now. We've already seen the power of EAT, that a combination of expertise, authority, and trustworthiness adds up to real value, something Google thinks worth recommending as a valuable exchange for your time after you click. We've also seen that humans connect most easily and naturally with other humans, and those associations can be long-lasting and sought after when accompanied by the EAT attributes. So here's the simple idea, the thesis of this entire article: Your brand will most rapidly and successfully gain the social trust of its audience when it is closely associated with powerful personal brands. The long journey home When your brand begins to market, a journey has begun. You hope to get prospects to join you in your journey. Your authoritative, relevant content is the table you set to entice those prospects to board your train. But you still need to extend an invitation, and invitations are most powerful when they come from someone we know and trust. It's the difference between getting a flyer in my mail box inviting me to try out a new restaurant, and a friend calling me up to ask me to come along with him to check it out. I'm much more likely to go in the latter case. Now imagine how much more powerful that invitation would be if my friend were a respected restaurant critic, who had already visited the eatery and was now telling me I shouldn't miss it! Why wouldn't you be using the method that is more likely to get more people on board your brand train faster, and with more confidence about their decision. A challenge to all brands Before I get into my recommendations for how to put the power of personal brands to work for your brand, I want to issue a challenge. I know what I'm asking here seems like a huge hurdle for many brand marketers. Once upon a time all you had to do was put ads in the right places and hope the right people would see them and be moved by them. Then along came the Internet and search engines, and suddenly you had to be producing authoritative content to attract traffic and give that traffic the confidence to buy from you. You'd no sooner put in the hard work and investment to build all that content then along came the social web. Now you've got to make personal connections with your prospects and engage them in ways that they will pay attention to your content, come to trust your brand, and eventually become customers. In some ways the journey has become longer, but it can also be much more richly rewarding. Helpful, engaging content channeled through social connections can bring exactly the right people to your cash register at exactly the right time. And now I come along wanting to add more engines to your already hard-working customer journey train. But I wouldn't ask you to do that unless I myself had seen how much faster those new engines can drive the train. Here's my challenge: In the coming year, hire and/or cultivate from within at least one powerful personal brand intimately associated with your brand who represents you via his or her content and social presence. Make this one of your highest marketing priorities. I believe with all my heart and mind that as the great battle for attention heats up in the years to come, those brands that had the courage and foresight to put their best personal brand representatives on the front lines will emerge the winners. Objections, Your Honor! Whenever I push this challenge, whether while speaking at a conference or conferring with a client, I tend to get the same objections to the proposal that brands put real people front and center in their marketing: Wouldn't it be better for our content to be branded with our company name/logo? Will individual author authority really translate into better exposure, trust, and (bottom line) new customers for our brand? What if the employee author leaves our company? Thankfully, I answered those objections in my Moz article about why your brand should have real authors behind its content, and I'll refer you to that post if any of those questions are buzzing around your head right now. I still stand behind the answers I gave there. Now let's move on to my recommendations for how to put the power of personal brands to work for your brand. 4. Putting the power to work First, let's look at some case studies of people whose personal brands have had a powerful positive effect on the corporate brands for which they work. Erica Campbell Byrum, Director of Social Media, For Rent Media Solutions and Homes.com (@ericacampbell) When social media started to become an emerging marketing channel in 2006, Erica Campbell Byrum couldn't even access it because of IT department blocks at her company. She tirelessly campaigned for the value of social media, and eventually won over senior management. She went on to create and champion online brand ambassadors for each of their 65 offices around the country. Erica always set the example and model, steadily building her own online audience. Based on overwhelmingly positive data showing how here efforts brought ForRent and Homes.com real business, the company expanded her responsibilities to oversee a 20-person social media team. Erica is now the unmistakable face of the ForRent and Homes.com brands. Her engaging social presence led to invitations to speak at huge industry events, and eventually to New York Times Best Selling author Jay Baer selecting her to co-author his latest book, Youtility for Real Estate, vastly increasing her \"youtility\" to the brands she represents. Sarah Hill, Digital Storyteller for the Veterans United Network - powered by Veterans United Home Loans (@SarahMidMo) As an anchor for KOMU-TV news, Sarah Hill made TV journalism history when she became the first television newsperson to incorporate Google+ Hangouts and Google Glass into her online newscasts. She became an early Google+ celebrity, where she now has 2.7 million followers. She went on to become the live video spokesperson for Veterans United Network, the veteran and military news hub of Veterans United Home Loans, a mortgage lending service for US military veterans. She used her journalism skills combined with her vast social following and reputation to create a strong association between VUN and various veterans causes. As a result, Veterans United Home Loans has become a first choice for veterans looking to buy homes. Space doesn't allow for dozens more stories I could include, but here's a list from Rand Fishkin of people he knows whose powerful personal brands helped build their company's brands: Heather Brunner at WPEngine, Hilary Mason formerly of Bitly, Oli Gardner with Unbounce, Caterina Fake at Flickr now Findery, Dan Shapiro at Robot Turtles, Sean Ellis of Qualaroo, Marie Steinthaler of HopsterTV. (Rand told me he had to stop the list there or he could go on all day!) How to make best use of personal brands for your brand Now on to how to make this work for you and your company. My recommendations are based both on my own experience as well as my careful observations of top-performing personal brands like those listed above. The Right Stuff When I look at people who have built influential personal brands and try to assess their common qualities, the old nature vs. nurture conundrum always surfaces. Does someone have to have an innate gift and the right personality qualities to be effective in this role? I won't try to solve that here, but whether natural or developed, people who do well representing their brands in public tend to exhibit the following characteristics: Likability. I put this first because even though it is the hardest characteristic to quantify, given how much the effectiveness of a personal brand is dependent on the ability to make personal connections, the tendency to be well-liked is key. That doesn't at all mean someone who sacrifices personal integrity or refuses to take a stand in order to \"win friends and influence people.\" A truly likable person can maintain relational ties even through disagreements. Smarts. By this I mean the person has to have a deep understanding of your business and your marketplace. They really should be an expert in at least some aspect of your business. You're looking for the kind of person who in a press conference or Q&A session could authoritatively answer most any question thrown at him or her. Gift of gab. Here I don't mean \"chatty,\" but rather someone who truly enjoys getting into conversations about his or her passions and interests. They should feel comfortable in front of a camera or life audience. She or he should also have the ability to create coherent, compelling content that displays your brand's attributes and expertise. Integrity. This person should be someone you trust enough to be on their own without bringing embarrassment to your brand. For a personal brand to be effective, the person can't be babysat every moment. They need to have the flexibility to respond and engage when the opportunity arises, without having to vet everything through the home office. Remember that your hope is for the qualities of the personal brands representing your business to \"rub off\" on your brand. People will make this transference quite naturally, so make sure you have the right people in place. Insource vs. Outsource The first question you'll face once you are convinced of the value of developing personal brands for your company is whether to develop them from within or recruit them (or even outsource entirely). In my experience developing your personal brand representatives from within, from existing employees, is going to have the most impact and be most effective. Your own people know your brand best and (we hope!) will have real passion for it. The advantage here is that training is minimal so content creation and social audience building can commence immediately. The only downside I see is that many companies, especially smaller ones, may not have a person who fits the bill readily at hand. In such a case it may be necessary to recruit someone who can become your personal brand representative. In fact, that's how I ended up representing Stone Temple Consulting. CEO Eric Enge had come to know me online. While he was already a very effective personal brand for STC in his own right, Eric had grown the company to a place where he was ready to expand its inbound marketing efforts. He saw that the content I was producing and the audience I had attracted were both highly relevant to and valuable for Stone Temple. So he made me an offer I couldn't refuse: come be yourself for us. I'm pretty good at being myself, so I accepted (and haven't regretted it for a moment!). The least desirable choice, in my opinion, is completely outsourcing your personal brand representation. In other words, hiring a freelancer to create content and speak and engage on behalf of your brand. This might be better than nothing, but since I believe the best personal brand representatives grow out of a vital relationship with the brand they represent, I doubt it can be as effective. Your best bet here might be simply to get some recognized subject matter experts to publish content on your site, rather than try to palm them off as actually representing you. Inauthenticity gets sniffed out way too quickly these days. Even if you don't currently have any in-house, ready-for-prime-time stars in your stable, I would invest in ferreting them out and nurturing them to where they can do the job. Give them creative space If a personal brand representative is going to be effective for you, they have to have the freedom to create and experiment. Of course, that doesn't mean without any guidelines or boundaries, but if you give your representatives too little freedom and initiative, you risk squashing the very thing that would make them most productive for you. Make sure you have a good, clear mutual agreement with your personal brand rep of how your brand is to be represented. He or she should feel completely at home with your brand's values, chief goals, and tone. It's also important that you give your representative the time they need to do their job. If you're serious about getting the most benefit for your company from what they do, then their work as your representative should be their primary—perhaps only—responsibility. Creating great content and engaging with your audiences both take a lot of time to do well. Make the brand connection clear, but subtle Because you're obviously hoping for the reputation, trust, and authority your personal brand representative builds to reflect on your brand, you might be tempted to push the connection too hard. By that I mean pressuring the representative to mention your brand frequently or even to be \"selly\" in her or his content and engagements. In my experience that's a mistake. If you push the corporate connection or sales pitch too hard, you kill the goose laying the golden eggs. You destroy the very thing that makes a personal brand so powerful. People have to be able to make a sincere and personal connection with the representative first, not with your brand. Once that connection is made, the connections to your brand will be obvious and much more meaningful. People will see that his or her content is home-based on your site, and of course your brand will be clear on all the profiles of your reps. If you let people make the connection on their own, the transference of their trust in and liking for your reps over to your brand will occur more naturally, and therefore will be more \"sticky.\" Multiply the connection opportunities This recommendation is closely tied with the one about giving your representatives enough creative space and time to do their work well. In addition, make available to them multi-faceted, multi-channel opportunities to gain exposure. This is one of the secret weapons of real personal brad representatives: they can get into places where your brand logo never would. For example, set aside budget to get your reps to important conferences. As they gain reputation and stature, they will get opportunities to speak at such events. Never underestimate the value of these in-real-life opportunities. Though they may not seem to have the potential reach of things like social media posting, they can be just as effective, sometimes more so. While Eric Enge and I believe that our content and social media presences help create fertile ground for business opportunities, we know that we have landed many of our best clients through our conference appearances. You should also encourage your reps to take opportunities to get in front of other people's audiences online. Whether by guest posting or being interviewed on podcasts, Hangouts, or other media shows, such occasions are yet another way where personal brands can get exposure in places to which you otherwise would have no access. Your turn Have you built an effective personal brand? If so, how has it benefited your company? Do you see it as worth the investment? If you haven't taken advantage of personal brands to help market your business, why not? What fears or concerns hold you back? I'd love to hear from you in the comments! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Personal Brand Punch: Why Your Brand Should Be Represented by Real People"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Personal Brand Punch: Why Your Brand Should Be Represented by Real People"
    },
    {
      "level": "H2",
      "text": "1. The power of a social brand"
    },
    {
      "level": "H2",
      "text": "2. The power of brand EAT"
    },
    {
      "level": "H3",
      "text": "Expertise"
    },
    {
      "level": "H3",
      "text": "Authority"
    },
    {
      "level": "H3",
      "text": "Trustworthiness"
    },
    {
      "level": "H3",
      "text": "The missing dimension"
    },
    {
      "level": "H2",
      "text": "3. The power of the personal for social EAT"
    },
    {
      "level": "H3",
      "text": "The fourth dimension"
    },
    {
      "level": "H3",
      "text": "What makes us humans"
    },
    {
      "level": "H3",
      "text": "Face up to it"
    },
    {
      "level": "H3",
      "text": "Even Google understood it"
    },
    {
      "level": "H3",
      "text": "Let our powers combine!"
    },
    {
      "level": "H3",
      "text": "The long journey home"
    },
    {
      "level": "H3",
      "text": "A challenge to all brands"
    },
    {
      "level": "H3",
      "text": "Objections, Your Honor!"
    },
    {
      "level": "H2",
      "text": "4. Putting the power to work"
    },
    {
      "level": "H3",
      "text": "How to make best use of personal brands for your brand"
    },
    {
      "level": "H4",
      "text": "The Right Stuff"
    },
    {
      "level": "H4",
      "text": "Insource vs. Outsource"
    },
    {
      "level": "H4",
      "text": "Give them creative space"
    },
    {
      "level": "H4",
      "text": "Make the brand connection clear, but subtle"
    },
    {
      "level": "H4",
      "text": "Multiply the connection opportunities"
    },
    {
      "level": "H2",
      "text": "Your turn"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Mark Traphagen\n          \n            Mark Traphagen\n          \n            Mark Traphagen"
}