{
  "url": "https://moz.com/blog/personalizing-your-404-error-pages",
  "slug": "personalizing-your-404-error-pages",
  "title": "Get Creative With Your 404 Error Pages - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "One of the recommendations we often make to our clients is to ensure proper structure of 404 pages. We generally urge that at least one or more of the following be included on a site's 404 page:",
  "content": "Get Creative With Your 404 Error Pages On-page SEO By: Rebecca Kelley September 13, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley September 13, 2007 Get Creative With Your 404 Error Pages On-page SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. One of the recommendations we often make to our clients is to ensure proper structure of 404 pages. We generally urge that at least one or more of the following be included on a site's 404 page: Notification that the user has reached a page that does not exist A search box A link to the site's site map A link to the home page Additionally, the 404 page should look like the rest of the site in terms of design and aesthetics. We've seen plenty of 404 pages that look generic and don't reflect the site's design, which is unconventional and can potentially confuse users. Another way to confuse users is to automatically redirect 404s back to the home page. From an SEO perspective, 301-redirecting incorrect URLs is fine as long as you know which page your user was trying to access and point the redirect to that page. However, sending 404s to the home page can confuse users because they may not realize that the page they were trying to access doesn't exist, and they'll wonder why they ended up back on the home page. With that being said, 404 pages don't have to be your standard snoozetastic \"You've reached a page that doesn't exist\" format. Weird Asia News buddy Brent Csutoras sent me a link to Smashing Magazine's feature on creative, imaginative 404 pages. Many of these examples are great because they engage the user in a creative and innovative way. I don't know about you, but I'm less likely to be grumpy about getting a 404 if the page looks cool or makes me smile. Some of my favorite 404s from the article: Radiohead At Ease's 404 is almost Neanderthalian, with a scrawled Post-it note looking message. The message links to the home page, and the page includes a search box. Luminous (and a few other sites) display a nifty 404 message in haiku form (Luminous's suggests bourbon as a resolution, and they include a search box and a link to their contact form). Jeremy Fuksa's 404 design is self-deprecating, which is a nice stray from the norm. It links back to the home page and to an email address for contact. Next Wave Performance offers an amusing, easy to follow flow chart to help poor, confused users. Expansion Broadcast Radio, meanwhile, just calls you a douche bag, but at least they provide you with a contact form and a search box. CSS Leak rewards 404-reaching users with two drink recipes. Huzzah! See? 404s don't have to be stuffy, mechanical, impersonal messages. You can include some eye-popping graphics, some personalization, a joke or two, and even a recipe. As long as you remember to include the resources your users will need to find what they were looking for (and keep the tone consistent with your site/brand), getting creative with your 404s is an innovative way to serve up a positive user experience. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Get Creative With Your 404 Error Pages"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Get Creative With Your 404 Error Pages"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}