{
  "url": "https://moz.com/blog/phishing-on-facebook",
  "slug": "phishing-on-facebook",
  "title": "Phishing on Facebook? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As you all know, FB is a very viral network, and with two of the most viral applications easily available (superwall and funwall), it was about time people got up to mischief. I have been geting a whole lot of chain posts lately, but the one below takes the cake: Attention all Facebook…",
  "content": "Phishing on Facebook? Social Media By: Rishi Lakhani December 19, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Rishi Lakhani December 19, 2007 Phishing on Facebook? Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. As you all know, FB is a very viral network, and with two of the most viral applications easily available (superwall and funwall), it was about time people got up to mischief. I have been getting a whole lot of chain posts lately, but the one below takes the cake: Attention all Facebook membeRs. Facebook is recently becoming very overpopulated, There have been many members complaining that Facebook is becoming very slow. Record shows that the reason is that there are too many non-active Facebook members And on the other side too many new Facebook members. We will be sending this messages around to see if the Members are active or not, If you're active please send to other users using Copy+Paste to show that you are active Those who do not send this message within 2 weeks, The user will be deleted without hesitation to create more space, If Facebook is still overpopulated we kindly ask for donations but until then send this message to all your friends and make sure you send this message to show me that your active and not deleted. Founder of Facebook Mark Zuckerberg It's obvious to most people that this is a hoax - but a large population of FB users aren't that sophisticated to realise that FB logins and sessions are recorded and available to view usage of the site - hence, I have received this post from about 10 people in the last 2 days. I am not sure what the end goal is, except to get it viral, but it would be an easy way to soften up the uninformed users to send donations - as per the email above. Is this the new form of phishing? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Phishing on Facebook?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Phishing on Facebook?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rishi Lakhani\n          \n            Rishi Lakhani\n          \n            Rishi Lakhani"
}