{
  "url": "https://moz.com/blog/pigeon-advice-from-local-seos",
  "slug": "pigeon-advice-from-local-seos",
  "title": "Pigeon Advice from Top Local SEOs and a Pigeon-Proofing Checklist - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Six top local SEOs share their Pigeon survival tips, and I've added a Pigeon-proofing checklist for your perusal!",
  "content": "Pigeon Advice from Top Local SEOs and a Pigeon-Proofing Checklist Local SEO By: Miriam Ellis September 4, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis September 4, 2014 Pigeon Advice from Top Local SEOs and a Pigeon-Proofing Checklist Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. If you work in Local SEO, chances are you've been fielding tons of questions from clients since Google rolled out the Pigeon update in late July. Need a little extra support providing sound advice in what are still the early days of this development that has caused both organic and local ranking shakeups? Here's your chance to learn what six of the finest Local SEOs on the map are telling their own clients and readers about Pigeon, followed up by a checklist aimed at helping you Pigeon-proof your local presence. Read closely, and I believe you'll find some gems of wisdom from these generous pros! Mike Blumenthal says... With Pigeon, it's important to understand that several things happened at once and you need to understand which of those things happened so that you can respond appropriately. One major change was a shifting of the calculations for distance around a search. Typically, but not always, Google reduced the search radius. If you are no longer included in the search radius you have several choices (besides opening another office). The one that makes the most sense is learn what geographic areas you are showing in and emphasize those AND find the less competitive categorical searches where you can compete to get some visibility. \"Jewelry Appraisals\" might not be as lucrative as \"Jewelry\" in a given market, but if you can dominate the search, it can lead to long term sustainable client acquisition. Figure out what these phrases are and be sure that you have both the right site content AND the right categories at places like YP.com and elsewhere. The other change was a reordering of search results with some listings losing rank even though they are still within the new search radius. If you lost rank but are still within the search radius then you need to do the things that Google is looking for. When in doubt, go back to the basics of internet marketing and be sure that you are participating in activities that make your business more visible on-line - becoming more citation worthy and linkable in your local market. In essence become newsworthy in your local market. Mary Bowling says... This is the gist of what I have found myself saying repeatedly over the past few weeks to clients: 1. Just because obvious spam is being rewarded in the SERPs, don't think that you should spam, too. If you're concerned about spam in the local packs that affect you, report it. The more people you can get to report it, the more likely it is to be examined and, hopefully, demoted. 2. Brands with their own directories of locations (or store finders) should do whatever is needed to boost their potential for ranking well, which will help both the brand website and the individual locations. The website needs to be structured to push PageRank down to all of the location listings. The directory section must be thoroughly crawlable and well-optimized at every level. The location listings themselves must have plenty of unique, location-specific content that visitors find interesting and valuable. 3. Make certain you are in the directories that are ranking in or above the local packs for the terms you'd like to rank for. Regardless of your feelings toward Yelp, most businesses need to maintain accurate and complete listings there, preferably accompanied by good reviews. 4. To appear in the shrunken local packs, you must now rank in the top 3 positions, which are usually influenced by organic rankings. So keep working on your organic rankings via valuable, well-optimized content and incoming links from other good websites. Linda Buquet says... My advice? The Pigeon has flown the coup, but has not landed yet! There is too much flux for any of us to make sense of yet. I've been sharing tracking screenshots at the Local Search Forum and we have 200 Pigeon analysis posts so far. All I can say is that hopefully by the time this bird is tested and/or trained it will settle into something equitable for users and business owners alike. So no solid advice can be given now, except to keep working on best practice strategies, which will always help in the end. A couple of unique and more recent observations: 1. After doing lots of Pigeon analysis, I'm almost positive that Google is testing at least 3 versions of Pigeon on different datacenters and rotating results - maybe for AB testing. I say this, in part, because all the Google datacenter IPs I can find are still showing the old pre-Pigeon results and many of the tools I use that send me screenshots or ordered pack results are still showing the old algo ranking order as well. Classic Google maps is showing the old ranking order too, because it's using a different datacenter than Google search. Here is a detailed post with all my observations and screenshots to back them up: Pigeon Analysis - New Insights about this Crazy Google Local Algo & the Constant Flux So that would account for the crazy constant flux we are seeing. Depends on which of the rotating datacenters you hit. I repeat - the Pigeon has not landed! 2. Duplicate discovery has changed and Pigeon is now hiding lots of dupes. Those dupes can still rank and mess you up but are just harder to find. (h/t to Joy Hawkins for this discovery.) The old map search for phone # may only surface 1 listing even though there are 6. There is a long post about the various ways to search now, including a couple new ways at my forum. So if you deal with doctors, dentists, attorneys, just be aware that if your standard method of dupe discovery shows 0 additional listings – it does not mean they are not out there. They are just in hiding! (Plus Pigeon is handling dupes differently too, but I think going into that will make this too long.) Phil Rozek says... You have to figure out which strain of Pigeon Flu has got you down. Is Google showing only 3-packs, and now your #5 ranking doesn't get you on page one? Don't panic and change your strategy; you're on the right track. Have you been knocked out of the 7-pack by spammy results? Not much you can do, but Google will probably fix it anyway. Hang tight and work on your non-Google Places visibility efforts. Lost your rankings in the big city? Well, your first priority always should have been to be King or Queen of your immediate area first and foremost. (And if that doesn't bring you enough phone calls, then you need to earn more reviews and make your site stickier.) In my experience, Pigeon is a wake-up peck. Andrew Shotland says... Our best advice to clients is to keep calm and carry on. We are still seeing a lot of changes in the local SERPs on almost a daily basis. So adjusting tactics while the game board is still moving seems ill-advised. In cases where things are really broken - and we've seen a bit of that (e.g. multi-location brands that have a 100-mile-away location ranking for <brand>+<city> queries even though they have a location in the searched city) - we are definitely hitting Google My Biz Support and making sure there's nothing screwy on the NAP side that could be causing this. Thus far the big fix we are seeing to defeating spammy results in the local packs is to get links, which unfortunately is going to lead to a whole new wave of local link SPAM, because it appears to be working, for the moment. My best advice to clients would be to do \"real local SEO sh*t\". Lots of local SEOs, especially at large firms, have focused on the local part of the algorithm to the exclusion of localized organic search. The Pigeon update, with its fusing of the local and organic ranking factors, appears to push us back to basic SEO tactics. Get good, local, links. Create quality content. Eliminate technical issues on your website and Google My Business page. Do this and you will be ahead of the vast majority of local businesses in the turd covered post-pigeon landscape. Nyagoslav Zhekov says... I do believe it is very early to comment on an update that appears to be as impactful as \"Pigeon\" (I really dislike the name, and I don't think it fits too well), partly because I do not even think the SERPs have settled down yet, and partly because very little targeted testing and research has been done to date. The only thing we know for sure is what Google shared ( indirectly): \"Google has released a new algorithm to provide a [sic]more useful, relevant and accurate local search results that are tied more closely to traditional web search ranking signals.\" \"…Google said that this new algorithm improves their distance and location ranking parameters.\" The first part could be interpreted as Google now giving more value to the \"traditional\" organic ranking factors (website-related ranking factors). This could be seen as a sort of a \"follow-up\" on Venice, which significantly impacted the type of local SERPs (major shift from \"pure\" to \"blended\" SERPs). Pigeon had significant impact on the display of local \"packs\" in the local SERPs, too (23.4% drop in local packs display). The second part of Google's \"announcement\" could be interpreted as an attempt to further \"localize\" the search results, wherever it might make sense. There have been observations of \"tightening\" of the radius of the displayed local search results, and experts generally agree that the update had a serious impact on the hyper-local search results. What a business owner should do? My advice – do what you have been doing up to now. A strong, end-to-end, local SEO campaign, without cutting corners, and without stressing on one aspect while neglecting the rest, is the most sustainable way to win in the long term, and practically the only way not to have to worry every time Google update their algorithms.\" My 6-point Pigeon-proofing checklist for local businesses Stay alert. Experts agree that the dust has not settled on this update, so this would not be the right time to react with a complete 180 in your marketing strategy. Stay tuned in to local blogs and fora and monitor the SERPs on a regular basis to watch things progress in the coming weeks and months. Based on past experience, I would not be at all surprised to see Google continue to turn dials up and down with this update. Don't panic like a birdbrain and start making major changes, but do keep up-to-date! If your radius has shrunken for your core terms, you may need to consider focusing more effort on less competitive terms to try to make up the difference. Among other things, this could include changing a category on your Google My Business page, building new content that proves your relationship to these topics and earning new reviews and links that cement your presence in reference to these somewhat lesser terms. If your 7-packs have shrunken to 3-packs, striving to build greater organic authority may help you more than purely local signals like citations and reviews. No mystery here – make your website as clean, fast, usable and rich in information as you possibly can, and brainstorm for those ideas that will set you apart from more sluggish or boring competitors, making your business link-and-shareworthy. If more spam seems to be rearing its ugly head in your important SERPs, report it! You have several vehicles for doing so. In Google Mapmaker, search for a spammy business, click the 'edit' link and then the 'report this' link. Provide as much detail as you can, documenting and proving that the listing contains spam. Or, while signed into your G+ account, find the spammy Google+ Local page, click the downward pointing in the row of icons beneath the business NAP, choose the report/block option and then fully describe the issue. If you notice widespread spamming, you might want to consider reporting it via a thread at the Google And Your Business help forum in hopes of getting the attention of Top Contributors and/or staffers. Because Pigeon appears to be giving more emphasis to local business directories for more searches now, it is more important than ever to have clean, consistent citations across the board. Do your most important keyword searches and see which directories are appearing high in the SERPs for these terms. Be sure you've got a fully-filled out listing on these directories and that the data on it is good and correct. Local SEO strives to build a web-based mirror-image of local business communities – but don't forget that it is only a reflection of the offline world. Citation building, content development, link earning, review acquisition – these are all incredibly important tasks, but they do not take the place of the service you offer and relationships you are building in the real world with face-to-face customers and associates. Becoming 'a name' in your neighbors' households by dint of your excellence should always be your #1 priority. So, give that better-than-expected customer service, launch that new in-store campaign, join that local business association and go to those local events and seminars! Become a vital local resource to your neighbors and you'll be standing in a strong place, no matter what updates may come your way. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Pigeon Advice from Top Local SEOs and a Pigeon-Proofing Checklist"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Pigeon Advice from Top Local SEOs and a Pigeon-Proofing Checklist"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Mike Blumenthal says..."
    },
    {
      "level": "H2",
      "text": "Mary Bowling says..."
    },
    {
      "level": "H2",
      "text": "Linda Buquet says..."
    },
    {
      "level": "H2",
      "text": "Phil Rozek says..."
    },
    {
      "level": "H2",
      "text": "Andrew Shotland says..."
    },
    {
      "level": "H2",
      "text": "Nyagoslav Zhekov says..."
    },
    {
      "level": "H2",
      "text": "My 6-point Pigeon-proofing checklist for local businesses"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}