{
  "url": "https://moz.com/blog/piggybacking-off-of-survivor",
  "slug": "piggybacking-off-of-survivor",
  "title": "Piggybacking Off Of Survivor - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Fortunately, Coach Wade wasn’t voted off of Survivor this past week.  I’m happy about this not just because I’m a fan of his, which I admit I am, but because it means I’ll still get some more traffic from his hilarious turn on the show.  The things he says and his sort of delusional ideas and…",
  "content": "Piggybacking Off Of Survivor Link Building I By: imarker May 19, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! I By: imarker May 19, 2009 Piggybacking Off Of Survivor Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Fortunately, Coach Wade wasn’t voted off of Survivor this past week. I’m happy about this not just because I’m a fan of his, which I admit I am, but because it means I’ll still get some more traffic from his hilarious turn on the show. The things he says and his sort of delusional ideas and stories start to grow on you, along with his kid-like passion and earnestness. He just wants to be part of the team. But I like Coach Wade mainly because he’s been a good source of traffic for a website I run, and I hope he can last as a cast member so people keep punching in ‘coach wade’, ‘survivor coach’, and ‘survivor coach wade’ at Google, and end up on my site. I run a soccer website, soccertraininginfo.com, and as Coach Wade was a soccer coach at Southwest Baptist University before his reality TV turn, it made sense to write an article and embed a YouTube video about him to try and grab some search share. The question though, is does this really result in more revenue or return visitors for my site? I gain roughly 35-50 visitors per day from searches surrounding ‘coach wade’. Not a ton of traffic, but this all adds up if you have say twenty ‘coach wade’ type of articles around various topics, where you’re piggybacking off of a TV show or some other type of advertising campaign. In a sense, they do the promoting: you just create the landing page. It all adds up if you create content that is relevant and timely, and then has a built in TV audience that spurs a viral type of interest over time. Take a look at Google Trends or Yahoo Buzz for some ideas. Usually, just after a TV show airs, people are punching in names or trying to get more information about a certain topic that’s just been on, say, Survivor, 60 Minutes, or Lost. Is there something on TV or in a brand advertising campaign that relates to your business or website you can develop some content around? Another thing I noticed was that people were posting the page about Coach Wade I created in forums. So the article not only generates traffic and clicks, but also links from other sites. This all helps boost page rank for those pages and the site. Coach Wade is a character, an ingenious selection by the Survivor producers, you don’t know if he’s for real or a joke. So that stirs up even more interest, whether it’s to ridicule him or learn more about him or both. Wade set on turning the game of survivor into some sort of Greek mythology, using terms like dragon slayers and warriors, when in reality the game is being played right underneath him. He’s just along for the ride for now. He’s loyal enough to where other cast members are keeping him around. They know they can trust him. He’s also a good source of traffic for my soccer site. However, this isn’t really about Coach Wade or Survivor, it’s about piggybacking off of the news, TV, brand advertising and the marketing of products by bigger companies. Is there a new book coming out that relates to your industry? If you post a review about the book then visitors might just end up on your site before they visit the main product’s actual site. Is there a movie or TV show coming out that relates to your industry? What can you write about that relates to your site or niche that will bring in some traffic on the back of someone else’s advertising or coattails? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Piggybacking Off Of Survivor"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Piggybacking Off Of Survivor"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "imarker\n          \n            imarker"
}