{
  "url": "https://moz.com/blog/pinpoint-vs-floodlight-content-and-keyword-research-strategies-whiteboard-friday",
  "slug": "pinpoint-vs-floodlight-content-and-keyword-research-strategies-whiteboard-friday",
  "title": "Pinpoint vs. Floodlight Content and Keyword Research Strategies - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Keyword research and content creation have a major aspect in common: We can choose a wide range of topics (or keywords), from very broad to very narrow. In today's Whiteboard Friday, Rand shows us how that parallel affects the decisions we make as marketers.",
  "content": "Pinpoint vs. Floodlight Content and Keyword Research Strategies Content Marketing | Whiteboard Friday | Keyword Research By: Rand Fishkin July 24, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 24, 2015 Pinpoint vs. Floodlight Content and Keyword Research Strategies Content Marketing | Whiteboard Friday | Keyword Research The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. When we're doing keyword research and targeting, we have a choice to make: Are we targeting broader keywords with multiple potential searcher intents, or are we targeting very narrow keywords where it's pretty clear what the searchers were looking for? Those different approaches, it turns out, apply to content creation and site architecture, as well. In today's Whiteboard Friday, Rand illustrates that connection. For reference, here are stills of this week's whiteboards. Click on it to open a high resolution image in a new tab! Video TranscriptionHowdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week we're going to chat about pinpoint versus floodlight tactics for content targeting, content strategy, and keyword research, keyword targeting strategy. This is also called the shotgun versus sniper approach, but I'm not a big gun fan. So I'm going to stick with my floodlight versus pinpoint, plus, you know, for the opening shot we don't have a whole lot of weaponry here at Moz, but we do have lighting. So let's talk through this at first. You're going through and doing some keyword research. You're trying to figure out which terms and phrases to target. You might look down a list like this. Well, maybe, I'm using an example here around antique science equipment. So you see these various terms and phrases. You've got your volume numbers. You probably have lots of other columns. Hopefully, you've watched the Whiteboard Friday on how to do keyword research like it's 2015 and not 2010. So you know you have all these other columns to choose from, but I'm simplifying here for the purpose of this experiment. So you might choose some of these different terms. Now, they're going to have different kinds of tactics and a different strategic approach, depending on the breadth and depth of the topic that you're targeting. That's going to determine what types of content you want to create and where you place it in your information architecture. So I'll show you what I mean. The floodlight approachFor antique science equipment, this is a relatively broad phrase. I'm going to do my floodlight analysis on this, and floodlight analysis is basically saying like, \"Okay, are there multiple potential searcher intents?\" Yeah, absolutely. That's a fairly broad phase. People could be looking to transact around it. They might be looking for research information, historical information, different types of scientific equipment that they're looking for. Are there four or more approximately unique keyword terms and phrases to target? Well, absolutely, in fact, there's probably more than that. So antique science equipment, antique scientific equipment, 18th century scientific equipment, all these different terms and phrases that you might explore there. Is this a broad content topic with many potential subtopics? Again, yes is the answer to this. Are we talking about generally larger search volume? Again, yes, this is going to have a much larger search volume than some of the narrower terms and phrases. That's not always the case, but it is here. The pinpoint approachFor pinpoint analysis, we kind of go the opposite direction. So we might look at a term like antique test tubes, which is a very specific kind of search, and that has a clear single searcher intent or maybe two. Someone might be looking for actually purchasing one of those, or they might be looking to research them and see what kinds there are. Not a ton of additional intents behind that. One to three unique keywords, yeah, probably. It's pretty specific. Antique test tubes, maybe 19th century test tubes, maybe old science test tubes, but you're talking about a limited set of keywords that you're targeting. It's a narrow content topic, typically smaller search volume. Now, these are going to feed into your IA, your information architecture, and your site structure in this way. So floodlight content generally sits higher up. It's the category or the subcategory, those broad topic terms and phrases. Those are going to turn into those broad topic category pages. Then you might have multiple, narrower subtopics. So we could go into lab equipment versus astronomical equipment versus chemistry equipment, and then we'd get into those individual pinpoints from the pinpoint analysis. How do I decide which approach is best for my keywords?Why are we doing this? Well, generally speaking, if you can take your terms and phrases and categorize them like this and then target them differently, you're going to provide a better, more logical user experience. Someone who searches for antique scientific equipment, they're going to really expect to see that category and then to be able to drill down into things. So you're providing them the experience they predict, the one that they want, the one that they expect. It's better for topic modeling analysis and for all of the algorithms around things like Hummingbird, where Google looks at: Are you using the types of terms and phrases, do you have the type of architecture that we expect to find for this keyword? It's better for search intent targeting, because the searcher intent is going to be fulfilled if you provide the multiple paths versus the narrow focus. It's easier keyword targeting for you. You're going to be able to know, \"Hey, I need to target a lot of different terms and phrases and variations in floodlight and one very specific one in pinpoint.\" There's usually higher searcher satisfaction, which means you get lower bounce rate. You get more engagement. You usually get a higher conversion rate. So it's good for all those things. For example...I'll actually create pages for each of antique scientific equipment and antique test tubes to illustrate this. So I've got two different types of pages here. One is my antique scientific equipment page. This is that floodlight, shotgun approach, and what we're doing here is going to be very different from a pinpoint approach. It's looking at like, okay, you've landed on antique scientific equipment. Now, where do you want to go? What do you want to specifically explore? So we're going to have a little bit of content specifically about this topic, and how robust that is depends on the type of topic and the type of site you are. If this is an e-commerce site or a site that's showing information about various antiques, well maybe we don't need very much content here. You can see the filtration that we've got is going to be pretty broad. So I can go into different centuries. I can go into chemistry, astronomy, physics. Maybe I have a safe for kids type of stuff if you want to buy your kids antique lab equipment, which you might be. Who knows? Maybe you're awesome and your kids are too. Then different types of stuff at a very broad level. So I can go to microscopes or test tubes, lab searches. This is great because it's got broad intent foci, serving many different kinds of searchers with the same page because we don't know exactly what they want. It's got multiple keyword targets so that we can go after broad phrases like antique or old or historical or 13th, 14th, whatever century, science and scientific equipment ,materials, labs, etc., etc., etc. This is a broad page that could reach any and all of those. Then there's lots of navigational and refinement options once you get there. Total opposite of pinpoint content. Pinpoint content, like this antique test tubes page, we're still going to have some filtration options, but one of the important things to note is note how these are links that take you deeper. Depending on how deep the search volume goes in terms of the types of queries that people are performing, you might want to make a specific page for 17th century antique test tubes. You might not, and if you don't want to do that, you can have these be filters that are simply clickable and change the content of the page here, narrowing the options rather than creating completely separate pages. So if there's no search volume for these different things and you don't think you need to separately target them, go ahead and just make them filters on the data that already appears on this page or the results that are already in here as opposed to links that are going to take you deeper into specific content and create a new page, a new experience. You can also see I've got my individual content here. I probably would go ahead and add some content specifically to this page that is just unique here and that describes antique test tubes and the things that your searchers need. They might want to know things about price. They might want to know things about make and model. They might want to know things about what they were used for. Great. You can have that information broadly, and then individual pieces of content that someone might dig into. This is narrower intent foci obviously, serving maybe one or two searcher intents. This is really talking about targeting maybe one to two separate keywords. So antique test tubes, maybe lab tubes or test tube sets, but not much beyond that. Ten we're going to have fewer navigational paths, fewer distractions. We want to keep the searcher. Because we know their intent, we want to guide them along the path that we know they probably want to take and that we want them to take. So when you're considering your content, choose wisely between shotgun/floodlight approach or sniper/pinpoint approach. Your searchers will be better served. You'll probably rank better. You'll be more likely to earn links and amplification. You're going to be more successful. Looking forward to the comments, and we'll see you again next week for another edition of Whiteboard Friday. Take care. \u0003Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Pinpoint vs. Floodlight Content and Keyword Research Strategies"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Pinpoint vs. Floodlight Content and Keyword Research Strategies"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "The floodlight approach"
    },
    {
      "level": "H2",
      "text": "The pinpoint approach"
    },
    {
      "level": "H2",
      "text": "How do I decide which approach is best for my keywords?"
    },
    {
      "level": "H2",
      "text": "For example..."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}