{
  "url": "https://moz.com/blog/pissedconsumer-link-farm-dominating-google-serps",
  "slug": "pissedconsumer-link-farm-dominating-google-serps",
  "title": "PissedConsumer.com: Link Farm Dominating Google SERPs - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "First off I would like to point out that I am a paid search specialist, not an experienced SEO.  If this article contains technical mistakes, I apologize.  I am a marketer by nature, not a techie.  I am technically savvy enough, however, to spot an obvious link farm/spam scheme, such as the one run…",
  "content": "PissedConsumer.com: Link Farm Dominating Google SERPs Blogging C By: chris1 October 22, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! C By: chris1 October 22, 2008 PissedConsumer.com: Link Farm Dominating Google SERPs Blogging This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. First off I would like to point out that I am a paid search specialist, not an experienced SEO. If this article contains technical mistakes, I apologize. I am a marketer by nature, not a techie. I am technically savvy enough, however, to spot an obvious link farm/spam scheme, such as the one run by the web site www.pissedconsumer.com. If you do SEO work for any consumer-based business, there is a good chance that you are familiar with Pissed Consumer, or at the very least you know of similar business complaint sites (with no accountability) such as RipOffReport.com. Even if you just run a blog, chances are you have been hit with blog spam from Pissed Consumer. As this chart illustrates, pissedconsumer.com was getting no (or virtually no traffic) until late December 2007 and their traffic has been dramatically increasing each month since. Pissed Consumer first showed up on my radar when I noticed that it ranked 3rd for my company’s brand name in the Google SERPs. I took a look at the site (@ http://mycompany.pissedconsumer.com) and saw merely 2 complaints – neither of which would hold up to BBB scrutiny, by the way. How in the hell could this site be ranking so highly for our brand term with so little relevant content? So I took a look at the link profile of this page using Yahoo Site Explorer and found that there are 30 links pointed at this domain. Really… 30 inbound links to this page? Next I took a look at which sites are linking to this page, and here’s a few of the domains that I found: http://www.customer-story.com/ http://www.advertisementcomplaints.com/ http://www.ripoffcomplaints.com/ The first thing I found very “interesting” was that all of the sites that linked to this domain as well as pissedconsumer.com were running under the same AdSense ID. According to AdsSpy, all of these sites use the AdSense ID of pub-5723196868151024. At this point, I wasn't really pleased that this site is ranking in the third position for our brand terms. I started to take a look at these sites and here are some of my observations: www.customer-story.com has over 4K links pointing at the domain. All “articles” on this blog are the exact same format (description of company usually followed by a general complaint about their products and/or services). Each article has 3 or 4 links with the company name as the anchor text, one (NOFOLLOWED!) link to that company’s site, and 2 or 3 followed links to that company’s page at pissedconsumer.com. www.advertisementcomplaints.com has over 9K inbound links. This site distributes its link equity outbound via the related section tag clouds on each page. As you can see, if you go to this site those anchor text rich tag clouds link to pissedconsumer.com, identically designed sites, and other sites that eventually link to pissedconsumer.com. And what do you know…all the sites here are using the same AdSense ID! www.ripoffcomplaints.com has over 3K inbound links and an identical format to customerstory.com. Same AdSense ID with all followed links pointing at Pissed Consumer. It should also be noted that in some cases the content on these sites is pulled directly from pissedconsumer.com.: Advertisement complaints.com: http://www.advertisementcomplaints.com/robert-corum-work-home-website-ct24882.html Identical article on pissedconsumer.com: http://robert-corum-free-survey.pissedconsumer.com/robert-corum-work-at-home-website-20080911135016.html Now, the link farm that Pissed Consumer is using is clearly bigger than three domains – or it wouldn’t be much of a link farm, would it? I don’t have the time or space to cite examples of each and every domain they own and how they are interlinking each and every one of them with the purpose of sending all link equity to Pissed Consumer. But a reverse IP lookup is all it takes to get at least a partial list. I have gone through many of these sites and they are doing exactly the same or a close variation as the three domains mentioned above. Below is a list of domains involved in this link farm scheme and the IPs they are hosted on. Just take a look at some of the domains listed below and what those domains are doing: IP: 65.98.58.74 pissedconsumer.com IP: 65.98.58.75 advertisementcomplaints.com alternativemedicinecomplaints.com auction-complaints.com autofinancingcomplaints.com autorepaircomplaints.com campingcomplaints.com cleaningcomplaints.com communicationcomplaints.com consultingcomplaints.com cosmeticcomplaints.com creditcard-complaints.com days-inn.hotel-complaints.com debtservicecomplaints.com directlendercomplaints.com drug-complaints.com drycleanercomplaints.com emergencyservicecomplaints.com expedia.hotel-complaints.com financecomplaints.com fitnesscomplaints.com grocerycomplaints.com harrahs.hotel-complaints.com hospital-complaints.com hotwire.hotel-complaints.com hummingbird-house.hotel-complaints.com installercomplaints.com intownsuites.hotel-complaints.com invesmentcomplaints.com investmentcomplaints.com laundrycomplaints.com loancomplaints.com marinacomplaints.com marriott-international.hotel-complaints.com medicalcentercomplaints.com medicalequipmentcomplaints.com mgm-mirage-grand.hotel-complaints.com priceline.hotel-complaints.com productreviews911.com repaircomplaints.com restaurant-complaints.com sears.laundrycomplaints.com special-t-travel.hotel-complaints.com store-complaints.com thebankreviews.com theservicereviews.com tourismcomplaints.com www.autofinancingcomplaints.com www.beautysaloncomplaints.com www.childcarecomplaints.com www.cosmeticcomplaints.com www.cruise-complaints.com www.drug-complaints.com www.drugscomplaints.com www.electronicscomplaints.com www.employmentcomplaints.com www.entertainmentcomplaints.com www.hardwarecomplaints.com www.hotel-complaints.com www.kosherservice.com www.laundrycomplaints.com www.medicalcentercomplaints.com www.mortgagebroker-complaints.com www.movingstoragecomplaints.com www.professionalcomplaints.com www.resortcomplaints.com www.restaurant-complaints.com www.school-complaints.com www.spa-complaints.com www.store-complaints.com www.thebrokerreviews.com www.tutorcomplaints.com www.vendorcomplaints.com www.veterinarycomplaints.com IP: 65.98.58.76 ripoffcomplaint.com IP: 69.72.137.86 a380reviews.com advertisementcomplaints.com alternativemedicinecomplaints.com auction-complaints.com autofinancingcomplaints.com autorepaircomplaints.com campingcomplaints.com cleaningcomplaints.com clientstory.com codeprofile.com communicationcomplaints.com conreviews.com consultingcomplaints.com cosmeticcomplaints.com creditcard-complaints.com days-inn.hotel-complaints.com debtservicecomplaints.com directlendercomplaints.com drug-complaints.com drycleanercomplaints.com emergencyservicecomplaints.com expedia.hotel-complaints.com fightadware.com financecomplaints.com fitnesscomplaints.com geo-leo-elias.net globalmobileadvertising.com grocerycomplaints.com harrahs.hotel-complaints.com hithealth.com hospital-complaints.com hotwire.hotel-complaints.com hummingbird-house.hotel-complaints.com installercomplaints.com intownsuites.hotel-complaints.com invesmentcomplaints.com investmentcomplaints.com laundrycomplaints.com loancomplaints.com marinacomplaints.com marriott-international.hotel-complaints.com medicalcentercomplaints.com medicalequipmentcomplaints.com mgm-mirage-grand.hotel-complaints.com picsedit.com picseditor.com priceline.hotel-complaints.com productreviews911.com repaircomplaints.com restaurant-complaints.com sears.laundrycomplaints.com special-t-travel.hotel-complaints.com store-complaints.com stylehot.com thebankreviews.com theservicereviews.com tourismcomplaints.com www.anotherreview.com www.autofinancingcomplaints.com www.bankerreviews.com www.beautysaloncomplaints.com www.childcarecomplaints.com www.clientstory.com www.corpreviews.com www.cosmeticcomplaints.com www.cruise-complaints.com www.customer-story.com www.cutesig.com www.drug-complaints.com www.drugscomplaints.com www.electronicscomplaints.com www.emohome.com www.employmentcomplaints.com www.entertainmentcomplaints.com www.financingreviews.com www.freeprincess.com www.hardwarecomplaints.com www.healthrunner.com www.hotel-complaints.com www.kosherservice.com www.laundrycomplaints.com www.medicalcentercomplaints.com www.mortgagebroker-complaints.com www.movingstoragecomplaints.com www.pixeditor.com www.pleasedconsumer.com www.professionalcomplaints.com www.resortcomplaints.com www.restaurant-complaints.com www.school-complaints.com www.shopperstory.com www.spa-complaints.com www.store-complaints.com www.thebrokerreviews.com www.tutorcomplaints.com www.tutorreviews.com www.upsetclient.com www.upsetconsumer.com www.upsetshopper.com www.vendorcomplaints.com www.veterinarycomplaints.com www.writecomplaint.com Normally, I would not choose to try to publicly “out” any company for blackhat SEO tactics. But the issue with Pissed Consumer and similar sites is that it is directly attacking the brands of legitimate companies. If you want to spam Viagra terms with blackhat SEO that’s one thing, but to use these tactics in an attempt to profit by tarnishing other people’s brands is something entirely different, IMO. And this site has absolutely no credibility whatsoever. The only credibility (you could measure with legit inbound links) they might have is due to the fact that they are ranking in Google SERPs. And the only reason they ever ranked in Google in the first place is because of link farms, spam and blackhat SEO. Google needs to step in and take this site out of its listings ASAP. While they are at it, they might want to take a look at ripoffreport.com and others in this niche. How could a site with such obvious blackhat SEO get past Google’s algorithm? The smartest and brightest in Mountain View can’t come up with something that would throw up red flags here? All the sites are using the same AdSense ID and they are hosted on only 4 separate IPs! How hard is that to figure out? I don’t even know how to code a web page and it took me all of about ten minutes to figure out what was going on here. Plus, I would almost guarantee that Google has gotten multiple spam reports about this site. Bottom line is that Google needs to remove pissedconsumer.com from its listings now. They might only be getting a relatively small amount of traffic at this point, but they continue to grow and as long as they remain in the Google SERPs, they will continue to get links from webmasters who think that if Google ranks the site so high, it must be legitimate. And if this site isn’t ranking on the first page right now for your brand, it probably will soon enough. This is Rip Off Report 2.0 and this site is poised to be a real headache for many brands online unless Google steps in soon to block its traffic. So I encourage webmasters to report this site to Google and/or Matt Cutts as spam. And I encourage Google to not only temporarily remove them from the listing, but remove the domain permanently. Too often Google is too easy on those that blatantly try to manipulate Google results. Google needs to send a message to those looking to scam their way to a profit through ruining the reputations of legitimate brands. There’s no incentive to stop producing blackhat scam sites if all you get is a temp ban. I also encourage anyone to expand on what I wrote here. There are a ton of domains involved in shady practices listed above (and probably many more!). Or, even do an analysis on some of these other sites, such as ripoffreport.com. We don’t have to take this crap from these rip off artists and scammers in this no-accountability complaint site niche anymore. If enough of us make noise and provide evidence of shady practices, I feel that Google will do the right thing. By the way, thanks to the SEOQuake team for making their excellent FireFox extension that allowed me to easily research this issue. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "PissedConsumer.com: Link Farm Dominating Google SERPs"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "PissedConsumer.com: Link Farm Dominating Google SERPs"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "chris1\n          \n            chris1"
}