{
  "url": "https://moz.com/blog/plagiarism-a-case-study",
  "slug": "plagiarism-a-case-study",
  "title": "Plagiarism - A Case Study - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As we go through life we invariably at some point run into a chance to or see a case of someone else to plagiarize.Case in point. Just the other day I was checking another Search Marketing site that I read for updates.  (gasp! I'm sorry seomoz its just a short fling, it doesn't mean anything) I…",
  "content": "Plagiarism - A Case Study Content Marketing M By: mattm October 2, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! M By: mattm October 2, 2007 Plagiarism - A Case Study Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. As we go through life, we invariably at some point run into a chance to or see a case of someone else to plagiarize. Case in point. Just the other day I was checking another Search Marketing site that I read for updates. (Gasp! I'm sorry, SEOmoz ,it's just a short fling, it doesn't mean anything.) I found out, to my disappointment, that his always excellent content had been published on another's marketing blog with no attribution to the original source at all. I found myself wondering how often this happens. I find this practice repugnant, and I was very angry that someone would do this to another writer. Can't you write your own stuff? At least ask for permission and properly attribute the original writer. One of my clients is going to be adding a new feature to their e-commerce site. They will be adding reviews from customers to their products and also will have a Coaches Corner section, which will be updated several times each month. CC will provide playing tips, equipment reviews, and maintenance tips. I find myself wondering what should steps should I take if it does happen to my clients? How do you think it's best to respond when it does? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Plagiarism - A Case Study"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Plagiarism - A Case Study"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "mattm\n          \n            mattm"
}