{
  "url": "https://moz.com/blog/plan-for-the-holidays-nice-and-early",
  "slug": "plan-for-the-holidays-nice-and-early",
  "title": "Plan for the Holidays Nice and Early By Analyzing Search Trends - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Happy Halloween, everyone! We here at SEOmoz are all dressed as internet marketers! Wheee! Did you adequately prepare for the holiday? Have your costume picked out and ready to go? Pumpkins carved into spooky jack-o-lanterns? Decorations put up? Candy purchased (none of those healthy granola bars,…",
  "content": "Plan for the Holidays Nice and Early By Analyzing Search Trends SEO Basics By: Rebecca Kelley October 31, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley October 31, 2007 Plan for the Holidays Nice and Early By Analyzing Search Trends SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Happy Halloween, everyone! We here at SEOmoz are all dressed as internet marketers! Wheee! Did you adequately prepare for the holiday? Have your costume picked out and ready to go? Pumpkins carved into spooky jack-o-lanterns? Decorations put up? Candy purchased (none of those healthy granola bars, or your house'll get egged)? Site optimized for all that lovely holiday traffic? No? Uh oh... If your site offers some sort of holiday product (Halloween costumes, gifts ideal for Christmas, Valentine's stuff) or if you just want to write holiday-related content, it's pretty important to have your site visible in the SERPs for those search queries so you'll get optimum traffic for those terms. And, as we all know, it can take a little bit of time to get high rankings. How do you know when to start SEOing for that holiday rush of search queries? Well, a little research never hurt anyone. Here's Google Trends data from the past twelve months for the search term \"halloween costume ideas.\" As you can see, searches start gaining traction towards the end of August and into the fall; thus, if you're doing SEO for Halloween-related terms, you would want to start building content and links towards the end of the summer so you're more visible to searchers when they think to start doing research. The same goes for Christmas-related searches. Here I looked at \"christmas gift ideas\": Searches start consistently increasing towards the end of September. With Valentine's Day, the searches start in mid-December: In each case, searches started about 2-3 months before the holiday, so it's important to acknowledge that and start crafting your content and targeting those keywords with ample time before the searches start gaining traction. KeywordDiscovery, by the way, also graphs search trends, so if you have a membership I highly recommend analyzing their graphs if you're looking to craft a holiday campaign: If you mouse over each bar, you'll see KWD's search count for the provided term during that time period (for example, the first September count shows 426 searches, then 741, then 917, then 2,085 as the month progresses). The chart can also be sorted by historical data (how many searches in the past year), monthly data (number of searches broken down into each month), trend (a graph of the search trends over the past year), combination (a graph of global vs. premium search data), and market share (a breakdown of which search engines were used to search for the query). KeywordDiscovery's monthly data chart: By market share: Don't take your cue from when the drugstore starts selling bags of Halloween candy--do some research and find out what last year's trends were so you're prepared this year. If you start early enough, you'll be basking in glorious search traffic while your competitors are scrambling with last minute link building campaigns three weeks before the holiday. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Plan for the Holidays Nice and Early By Analyzing Search Trends"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Plan for the Holidays Nice and Early By Analyzing Search Trends"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}