{
  "url": "https://moz.com/blog/planning-for-post-local-pack",
  "slug": "planning-for-post-local-pack",
  "title": "Planning for a Post-Local-Pack Possibility - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Local SEOs are accustomed to continuous change in the SERPs, but if the American Innovation Online Choice Act becomes law and prevents monopolies like Google from preferencing their own assets, we need to prepare for what could be the largest search overhaul we’ve ever seen.",
  "content": "Planning for a Post-Local-Pack Possibility Local SEO | Search Engines | Marketing Industry By: Miriam Ellis July 5, 2022 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis July 5, 2022 Planning for a Post-Local-Pack Possibility Local SEO | Search Engines | Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Local SEOs are accustomed to continuous change in the SERPs, but if S.2992, the American Innovation Online Choice Act, becomes law and prevents monopolies like Google from preferencing their own assets, we need to prepare for what could be the largest search overhaul we’ve ever seen. This could be bigger than the day we saw 7-packs become 3-packs. It could be bigger than any of the major updates like Possum or Vicinity. We’re talking about major potential change and new opportunity for local businesses. Just how big might it be? That’s exactly what we’ll be looking at today! Stats and tests Per Moz’s most recent study by Dr. Peter J. Meyers, when we ran 1,000 search phrases through MozCast, half or which were localized to particular cities, 33% percent of our queries returned a local pack like this one in the SERPs: If S.2992 should become law, industry experts observe that local packs would likely be one of the widgets Google would be obliged to stop preferencing in their results. And, in April of this year, marketers began spotting a test of a very different layout that could signal what local SERPs might look like, post-S.2992. I haven’t been able to replicate the test myself, but Mike Blumenthal of Near Media kindly granted permission for me to share this screenshot from his excellent piece, A Look at Google’s Local Results without ‘Self-Preferencing’: Instead of three local results grouped into a pack, this test shows a new widget we’re currently terming a “local card”, interleaved within the organic results. As Mike explains, when you click on the card, you’re taken straight to the Google Business Profile instead of to the long-established local finder. But perhaps of even more importance, the organic link to the website is now fully prominent, instead of totally absent as in some packs, or grey and easily-overlooked, as in the Google Business Profile. Rand Fishkin predicts that billions of clicks that were absorbed by Google’s widgets would become up-for-grabs by organic and paid advertisers. It’s this possible reality that’s really gotten me thinking about how local businesses could respond to what could be a tremendous opportunity. Taking website inspiration from Google’s local playbook Google takes a lot from businesses. They take business data and make money from aggregating and displaying it in their local packs, finders, and maps. They take publishers’ content — which is the result of innumerable hours of paid work by human beings — and republish it in zero-click SERPs. Most SEOs learn to work within this system, this “partnership” in which we try not to be overly stressed so long as Google’s operations don’t hinder conversions. In other words, we resolve not to worry whether a sale results from a click on a Google Business Profile or the Contact Us page of a website, so long as transactions keep rolling in. However, at the same time, there has been an ongoing saga of industry complaints that Google throws its weight around too much without any consultation with the business owners and publishers on whose livelihoods its profits are based. Of late, there has been particular distaste over Google using search as a political tool to protect itself from anti-trust actions like S.2992, threatening SMBs with negative outcomes if Google’s monopoly is regulated. Depending on your perspective, it might feel like Google takes it upon themselves to build a business model on your identity and content, doesn’t offer adequate support when things invariably go wrong with how they represent you, and then insults your intelligence with see-through scare tactics. It’s really no wonder when business owners and marketers grumble. However you feel about this scenario, though, there is one thing that every local SEO knows by heart: local SERPs exist in a state of constant experimental change geared to maximize public engagement with them for Google’s benefit. They have the data and the engineers to discover exactly what works and what doesn’t. Think of this as a gift to us that we might take in return for all we’ve given, because Google’s SERPs are actually telling us what we should be doing with our websites if local packs go away, local cards take their place, and tons of clicks end up back on our websites instead of the Google Business Profile. Check out this quick mockup I did of a GBP-inspired website homepage and see how many of the elements you can spot that correspond directly with fields you’ve come to know so well on your Google listing: Most important elements Did you notice how my mockup emphasizes location and contact data, photos, and reviews? I believe that the ongoing iterations of Google’s packs and profiles indicate that these are the three listing elements that matter most to the public when choosing a local business. If more clicks should start going to the website, companies should organize the homepage so that visitors can instantly find the NAP, hours of operation (including whether the business is open right now plus its most and least popular time slots), see tons of relevant photos, and both read and leave reviews. You’ll notice I’ve also included some basic sentiment analysis of the reviews à la Google Place Topics. Action-oriented elements This mockup emphasizes all of the actions a visitor might be used to taking via Google Business Profiles. In addition to things like getting directions and interacting with reviews, the homepage should quickly facilitate whichever activities are most relevant to the model and customers, such as calling or texting the company, booking an appointment, asking questions, and, of course, shopping. If there is any actionable field on your GBP that you believe is connecting customers to the business, feature it or link to it on the homepage. This is basic website design of course, but think again about how Google organizes such features in their profiles to test what you should be emphasizing on sites. Informational elements Your website’s textual image and video-based content take the place of Google posts, business descriptions, categories, Q&A, and other informational media. Meanwhile, you can boost trust signals for Google’s quality raters and the public by displaying awards, accreditations, and associations. It’s great to think that, with a website, you have all the space you need to showcase a local brand’s community involvement, B2B relationships, customer-centric guarantees, environmental initiatives, and human rights policies. So, while you’re taking cues from GBPs on how to provide a ton of info at a glance for quick decision making, the joy of websites is that they support the architecture for telling a deeper story about why a business is truly the best bet in town for specific needs. Your choice on UGC Since the advent of Google Maps, Google has taken an open-source approach to local business data. Anyone, including bad actors, can suggest edits to your core business data, upload photos, leave reviews, and write questions and answers on your GBP. With your own website, the choice is yours on how much space you want to give to user generated content. I’ve long been an advocate for featuring customers’ words and stories as central to business identity, and I would recommend that marketers and owners carefully plan how to present content like reviews, photos, and videos. There could be a temptation to show only flattering UGC, but be advised that activities like review gating can lead to litigation, and that businesses will already be facing something of a struggle in getting the public to trust website-based review content as much as they might trust the same content on a third-party platform. In seeking to emulate the successful layout of GBPs, do take your community into account, but also, take a breather knowing that S.2992 would return to local business owners some of the reputation and marketing control that they’ve lost to Google over the past 20 years. Summing up, should the American Innovation Online Choice Act become law, sending more traffic directly to websites, owners and marketers should have a plan in place to revamp website homepages so that they are as informative and actionable as Google Business Profiles. In the case of multi-location brands, you may need to bring a GBP mindset to landing pages rather than homepages. Why not spend some time this week making a more beautiful and useful mockup than mine for some of the businesses you market? Maybe yours will feature bulleted list attributes, or key product and service menus, or direct message/live chat capabilities. Would local cards and a less dominant Google be good for local businesses and marketers? Image credit: Jo Zimny To be honest, you’ll have to come up with your own answer to this question based on your philosophy and hands-on experience, should Google become the subject of increased regulation. For my part as a big supporter of localism, I observe that monopolies have an unsustainable negative effect on human happiness and the planet, on innovation and diversification, on commerce and culture. I am personally in favor of very strong antitrust measures and believe they will deliver amazing benefits to independently-owned businesses, the communities they serve, and the environment on which we depend for life. But as to how something like the local cards might impact us, I think it’s important to note that the test that’s been spotted is unlikely to be the ultimate format we’d see in the SERPs. I’ve seen several peers asserting that they feel the layout is a bit messy, and it would certainly cause some temporary confusion for Internet searchers who have gotten used to former displays. But, time and again, we’ve all adjusted to SERP modifications, and we would simply do so once more. For local search marketers, regulation would signal that it’s time to double down on your organic SEO skills if what emerges is an increased emphasis on organic SERPs. For owners, customers will still find you, and the great thing would be that more of them would likely be spending more of their time at your house instead of at Google’s. The role of host, then, will be more on your shoulders. It will be your patio, your deck chairs, your BBQ pit, and ramada that welcome and shelter people. And, after all, that’s what you went into business to do: to take care of your own customers. You’ve spent years learning to do that, so don’t worry - with some fine tuning of your website to make it as good as and better than a Google Business Profile, you’ve got some good times ahead! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Planning for a Post-Local-Pack Possibility"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Planning for a Post-Local-Pack Possibility"
    },
    {
      "level": "H2",
      "text": "Stats and tests"
    },
    {
      "level": "H2",
      "text": "Taking website inspiration from Google’s local playbook"
    },
    {
      "level": "H3",
      "text": "Most important elements"
    },
    {
      "level": "H3",
      "text": "Action-oriented elements"
    },
    {
      "level": "H3",
      "text": "Informational elements"
    },
    {
      "level": "H3",
      "text": "Your choice on UGC"
    },
    {
      "level": "H2",
      "text": "Would local cards and a less dominant Google be good for local businesses and marketers?"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}