{
  "url": "https://moz.com/blog/position-one-whiteboard-friday",
  "slug": "position-one-whiteboard-friday",
  "title": "How to Appear in Position One in 2024 — Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Unlock the secrets of SERP dominance in 2024 with Tom Capper. Discover the evolving landscape of position one rankings and seize the opportunities amidst shifting trends in SEO.",
  "content": "How to Appear in Position One in 2024 — Whiteboard Friday Whiteboard Friday | Search Engines | Marketing Industry By: Tom Capper Edited By: Emilie Martin April 12, 2024 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Tom Capper Edited By: Emilie Martin April 12, 2024 How to Appear in Position One in 2024 — Whiteboard Friday Whiteboard Friday | Search Engines | Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Unlock the secrets of SERP dominance in 2024 with Tom Capper. Discover the evolving landscape of position one rankings and seize the opportunities amidst shifting trends in SEO. Click on the whiteboard image above to open a high-resolution version! Happy Friday, Moz fans. Today I want to talk to you about position one in 2024. So, as I'm recording this, we're just coming to the end of January 2024, and I want to have a look at what is actually in position one in the SERPs right now, how it's changed in the last year, and what that means for us as SEOs. We're often prone as an industry sort of complaining that Google is stealing more and more and more of our lunch. I think there's some truth to that, but there's also some nuance to that, and I think there are more positive stories available as well. Now all the data I'm about to share with you, is from STAT, our enterprise SERP analytics platform, rank tracking, this kind of thing, and I'm using the MozCast corpus of keywords. So this is 10,000 head terms tracked in the US and the UK, so two sorts of suburban locales and on desktop and smartphone, so 40,000 total keywords. And the reason I'm using this is we've had this sort of as a consistent dataset for a long time, both at Moz and now at STAT as well. I want to talk a little bit about what I mean by position one. So in STAT, we have this contrast between rank and base rank. And by rank, we mean whatever is actually the first thing on the search engine results page, the SERP, and by base rank, we mean the first regular or organic result. And so here I'm interested in what is first, no matter what. So, it might not be an organic result. That said, I'm not talking about ads. I think there's an interesting discussion to be had about how much real estate is going to ads over time. Google Shopping now is almost entirely ads. SGEs, interestingly, have almost no ads in and around them at all. What’s actually in position one? However, we're putting that to one side for today. I just want to talk about not necessarily traditional organic results, but not sponsored results. So what's actually in position one, excluding ads? Well, most of the time, about two-thirds of the time, it is actually regular organic, your 10 blue links. This surprised me. I don't know whether it's the naysaying. I don't know whether it's because adverts are always there, so I don't sort of notice it. But, yeah, most of the time, you are actually looking at organic in position one. When you're not looking at organic, you're looking at a bunch of other features, some of which are in play, some of which are not. So Knowledge Graph, maybe for a branded term or something, but you can't really appear in Knowledge Graph, and that is the second biggest result. Local, of course, you can appear in local, and that's 7%. So that's a big chunk of what's left. Images, sort of, yes, like it is organic image search, although how much click-through rate you're going to get is very much open to debate. Found on the web, this is a new feature that's kind of come from nowhere in the last year. It's a bit of a hybrid between featured snippets and Knowledge Graph. So you can click through to a website from this. It is in play. And then Other, and Other includes a lot of things. Probably the most notable ones are things like videos, which, again, maybe you could have from your brand's YouTube channel or something like this. How this tends to work out, sort of another way of saying this same statistic, the two-thirds organic, is that the average rank of the first organic result tends to be about 1.5 on desktop or about 2 on mobile. So that doesn't sound amazing, like, oh, the average rank that you could get by ranking first is 1.5. But really that's not too bad when you consider how many other result types are out there. So like I said at the start, I think there are some positive news stories here, and there are some less good ones. You can appear So the positive one is, as I've just said, you can appear. Most of it is organic. A lot of what isn't organic is stuff that you actually can appear in as a brand. But not everywhere What's not so good is that's not universally true. So like I said, some of these features, like Knowledge Graph, for example, are not so easy to appear in. And actually, even a lot of organic position one is still not really in play. So these are some of the top sites that appeared in position one; in this, 67% of position ones that were organic sites. So you've got the NHS, Wikipedia, IRS, gov.uk. So half of these keywords being UK is why you've got the NHS and gov.uk here. And then google.com, and this is things like play.google or support.google or chrome -- is it chrome.google, I can't remember -- these kinds of sort of Google subdomains. These, I'm not drawing that very well, but these sort of 5 sites alone are 8.6%. So that's quite a big chunk. That's more than a tenth of what's available here is just these five sites. So that's the less good story there. Steady year-on-year What's more positive again, though, is that this is broadly steady year-on-year. In the last year, we haven't seen a big collapse of organic, like a lot of people tend to think and tend to fear. So this is showing how the organic share has broken down over device and locale. So you can see for GB-en desktop, for example, this is about 72%, so slightly more than the two-thirds average, about 72%. And actually, the amount going to organic has gone up a bit year-on-year. And then for GB smartphone and US desktop, basically dead even year-on-year. So that's kind of positive. Canary in the mine However, the less good story is that there is a bit of a canary in the coal mine because US smartphone, which I think tends to be a bit of a leading indicator, tends to move ahead of other markets a bit, this is on -6.4 year-on-year, and this hasn't really gone to sort of any one other result type in particular. It's not like found on the web came up from nowhere and took exactly 6.4 or something like this. This is sort of spread across everything. So this is kind of a trend in what organic is doing, not just one feature being swapped in and out. So this is a little bit concerning, but hopefully, this is the exception that proves the rule and not, as I put here, a canary in the coal mine. So anyway, I hope this has given you a lot of interesting things to talk about. Like I say, the message that I take away from this is that despite all of the sort of angry bickering within the SEO industry, there is still a lot to play for here, and even in non-organic results that there are a lot of other features that you can appear in as a brand that we track as well and that we think do represent opportunities. So yeah, hope you found that interesting. Thank you. Transcription by Speechpad Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Appear in Position One in 2024 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Appear in Position One in 2024 — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "What’s actually in position one?"
    },
    {
      "level": "H3",
      "text": "You can appear"
    },
    {
      "level": "H3",
      "text": "But not everywhere"
    },
    {
      "level": "H3",
      "text": "Steady year-on-year"
    },
    {
      "level": "H3",
      "text": "Canary in the mine"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon ticket!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    }
  ],
  "author": "Tom Capper\n          \n            Tom Capper\n          \n            Tom Capper"
}