{
  "url": "https://moz.com/blog/post-pandemic-travel-marketing",
  "slug": "post-pandemic-travel-marketing",
  "title": "Post-Pandemic Travel Marketing: What Now? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We still live in uncertain times, especially with increasing costs in almost every industry a big concern for consumers. But for travel and tourism brands, now is the time to push forward with recovery and work with customers who, after two long years, are looking to finally take a trip away from…",
  "content": "Post-Pandemic Travel Marketing: What Now? Marketing Industry | Branding By: Rachel Vandernick August 24, 2022 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rachel Vandernick August 24, 2022 Post-Pandemic Travel Marketing: What Now? Marketing Industry | Branding The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As borders reopen and travel resumes, the stakes to make up for the time and revenue lost in 2020 and 2021 have never been higher. For many travel and hospitality organizations, there’s no question about it – the 2022-23 season must be a success. The good news is that hope is firmly on the horizon. US Travel’s latest data shows that, for the first time since the pandemic began, travel spending was above 2019 levels by 3%. While nearly 60% of US travelers note that rising gas prices will impact their upcoming travel decisions, more than a quarter plan to spend more money on vacations this summer than in 2019. We still live in uncertain times, especially with increasing costs in almost every industry a big concern for consumers. But for travel and tourism brands, now is the time to push forward with recovery and work with customers who, after two long years, are looking to finally take a trip away from home. Following many near-complete strategy and product pivots of 2020, there’s plenty that travel and tourism brands can be doing with their marketing to support their own long-term success. Anticipating consumer needs and concerns One of the biggest changes that many travel and tourism brands have seen over the past year is a longer consumer buying cycle. Where customers may have been ready to book a flight, hotel, or tour experience with very little research before 2020, that’s no longer the case. Instead, customers are taking their time deciding whether or not travel is safe, affordable, and accessible for them and their families. This has ultimately led to lengthier waits for travel companies as customers move down the sales funnel. But as a travel business, part of your role has always been to reassure customers that their experience will be what they’re looking for. The biggest difference now is in anticipating and responding to new fears that have arisen in the past two years around travel safety. Educational tour company Context Travel has seen this attitude change firsthand, and found success through adjusting their marketing strategy accordingly. “We’re getting in front of travelers much higher up the funnel to gain trust by creating and sharing compelling content for people who are just dipping their toes back into travel”, says Director of Marketing, Ali Murphy. “This is a big shift from pre-pandemic, when we focused our marketing efforts on capturing people who were ready to buy a tour.” Acknowledging the fear You’ve likely spent the majority of the past two years continually adjusting your marketing strategy — and now isn’t the time to stop. While there may be some trepidation from consumers around travel picking back up, tourism and hospitality brands must acknowledge and accept these fears rather than turning a blind eye to them. This is where you need to think like your customers and alter your search marketing approach. What is the data telling you? Instead of looking for large group tours, are your customers more likely to be interested in smaller, private tours with just their family group? Or are outdoor-based activities becoming the most-viewed pages on your site? These are also the pages on your site that you might want to consider prioritizing in an SEO refresh. Consider whether the consumer landscape matches existing messaging and keyword strategy. If not, now might be the right time to find some copy and content resources to give those pages a re-write more consistent with current strategy and offerings. There’s a good chance that your customers will be prioritizing different aspects of their experience for the foreseeable future, so it’s up to you to meet those needs. Instead of backing away from marketing your products and services, promote private accommodation, outdoor adventures, and a more people-concious travel experience. Embracing new opportunities in search Going after a whole new set of experiences in your search strategy is one thing, but travel brands should also be keeping tabs on what new features in search itself can be leveraged for their benefit. Mobile-first marketing is on the rise and your travel brand needs to be front and center. You may not immediately think of TikTok as part of your search marketing plan, but we’ve all seen YouTube videos and tweets appearing in search results over the years, and TikTok content is finally making its way into SERPs as well. While social content should still be focused on your primary channel audiences (aka the people that are actually seeing the content on its intended platform), there are plenty of benefits to be gained if your content can rank in traditional search results. When you’re working on your social strategy and planning for new content creation, keep this in mind as you optimize your videos later on (or loop in your brand team to tackle this across silos!) This is just as applicable for in-destination brands offering consumers dinner, a night out, or an activity, as it is the destination marketing organization (DMO) marketing the destination itself. Social-as-search allows brands and organizations to actually influence the discovery phase, not just the decision-making phase of the consumer buying journey. According to a recent study from TikTok, 49% of its users use the platform for discovering something new, and are 1.5 times more likely to immediately go out and purchase what they have discovered compared to other platforms. The opportunity to rank for high intent keywords, especially driven around experiential and food/beverage activities, with consumer proof in places like TikTok is a virtually untapped opportunity for brands across the board. For many tourism brands, these opportunities simply didn’t exist in a pre-pandemic world. Yet many of the biggest companies are still refraining from embracing them. To stay competitive and attract both US-based and overseas customers, now is the time to jump on these opportunities before everyone else. Leveraging existing marketing channels for conversion At this point, we should all know that marketing channels work best when we think of them as complementary, rather than silos. “Always-on” marketing means that customers have access to brands 24/7, every day of the year. Because of that, they’re interacting with brand content across multiple platforms — from ads, to social media, to search results, to emails. Travel consumers have always been a multi-platform, multi-stage audience. But the lengthening of the sales process means that securing a conversion after several touch points has become even more difficult for this industry. If your travel or tourism brand wasn’t already working to leverage different channels at once, now is the time. Search is certainly still a long game when it comes to digital marketing, but it’s also one of the most trusted avenues out there. When you’re working on new content that can benefit you in six to 12 months, go back to thinking about your customers’ fears and needs first. How can you answer those questions and concerns better than your competitors? From there, echo that content across other platforms. While you wait for the SERPs to catch up, get in front of your audience with additional messaging, proof points, and content that amplifies why to buy, why to visit, and why to trust your brand (user generated content is a great avenue for this). Search is undoubtedly important, but it is not the only channel that your consumer base is going to interact with on their path to purchase. Think about each channel as a unique opportunity to engage your audience and where they might be in the buying and consideration cycle when they encounter it. For example, if a consumer is searching for content related to “best things to do in Costa Rica”, and your brand is well-positioned to answer that question through search, it might also be worth trying to get that user to sign up for your newsletter with Costa Rica travel tips, follow you on social media for local restaurant recommendations, and retarget with ads to re-engage them later in the buying cycle. Treat search as an entry point — not the only point — of opportunity and build your other channels as amplifiers. This concept of social-as-search is also a great way to familiarize your brand to consumers. Almost no space on TikTok is as saturated as travel, and yet one airline manages to stand out for terms like “rating airlines” and “european travel”: Air Baltic. @airbaltic it do be like that 🥲 #airline #cabincrew #airBaltic #okayletsgo ♬ Okaaay lets go - Sarah Vilard It’s not hard to see why. Their personality-driven content is relatable, humor-forward, and draws in viewers while educating consumers in the crowded low cost carrier space about their crew, destinations, and air frames. Accepting changes within the travel industry as a whole Instead of burying your head in the sand and thinking about the negative impacts, make travel industry changes part of your marketing campaigns. For instance, with non-refundable travel becoming a thing of the past, being more flexible with customers after they book isn’t going to land you more business. Letting them know their options ahead of time, though, can make you stand out. Hotels.com is a great example of this. Their 2021 “revenge travel” campaign perfectly highlighted their understanding of customer concerns around making reservations: that may need to be changed or canceled last-minute. Instead of assuming that they could return to a point of non-refundable travel, their marketing fully acknowledged these customer pain points and made their position clear (with obvious dramatic humor), and favorable, for consumers looking to travel with flexibility. Customers are ready for travel, and brands that embrace this “moment” and make it memorable are prepared to win. Brands that are prepared to go the extra distance will win favor with eager consumers, and brands that are simply meeting expectations will be seen as doing the bare minimum. The opportunity is in the “memorable”. “Experiences sell way more than [traditional] products. Even more so in the hospitality industry. There are hundreds of hotels selling the same plans and accommodations as we are. So what makes us so special? Added value. Feeling. Belonging. Unique experiences. The most loyal clients buy that ‘special something’ that a product makes them feel rather than the product itself,” saya Ella Bencosme, Sales & Marketing Coordinator for the Holiday Inn Resort Aruba. This is also a good time to make your reviews work for you as a marketing tactic. Many of your prospective customers will be looking for reviews that call out some of these widespread industry changes, like flexible change policies, hygiene standards, general safety, linens and laundering, contact with other guests, and the ability to “go private”. Whether you like it or not, how you respond matters and your audience is watching. Customer reviews have always been a fundamental part of the travel and hospitality industry, and this has only become of increased importance in recent years. Stay on top of reading and responding to your reviews, particularly from those who may not have had a good experience. If you need just one more reason to put stock in the user experience, think of the visibility that Google reviews, and OTAs like Expedia and Trip Advisor, have in the SERP. Brand guarantees are not enough to satisfy consumers. Instead, hearing and reading recent first-hand accounts of travel experiences from customers just like themselves will continue to be a significant deciding factor for many people. In conclusion Tourism and hospitality have changed — probably forever. Travel expectations that the pandemic introduced will not be easily walked back. In a post-pandemic world, travel brands must adjust their marketing strategies to align with new consumer needs, expectations, and fears. Embracing and leveraging new forms of search marketing, while continuing to build a reputable and consistent brand in the eyes of travel-cautious consumers is the only way to succeed. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Post-Pandemic Travel Marketing: What Now?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Post-Pandemic Travel Marketing: What Now?"
    },
    {
      "level": "H2",
      "text": "Anticipating consumer needs and concerns"
    },
    {
      "level": "H2",
      "text": "Acknowledging the fear"
    },
    {
      "level": "H2",
      "text": "Embracing new opportunities in search"
    },
    {
      "level": "H2",
      "text": "Leveraging existing marketing channels for conversion"
    },
    {
      "level": "H2",
      "text": "Accepting changes within the travel industry as a whole"
    },
    {
      "level": "H2",
      "text": "In conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    }
  ],
  "author": "Rachel Vandernick\n          \n            Rachel Vandernick\n          \n            Rachel Vandernick"
}