{
  "url": "https://moz.com/blog/post-click-marketing-copy-that-sells",
  "slug": "post-click-marketing-copy-that-sells",
  "title": "Post Click Marketing Copy that Sells - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "STEP 1. - CATCH THEIR ATTENTION! Everyone wants something for free - tailor your copy to appeal to your customers immediate need, or if not immediate, then related - free e-book, free research, free trial, free somethingSTEP 2. - Write your copy...",
  "content": "Post Click Marketing Copy that Sells Content Marketing L By: lauramaccallow@yahoo.co.uk May 24, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! L By: lauramaccallow@yahoo.co.uk May 24, 2007 Post Click Marketing Copy that Sells Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. STEP 1. - CATCH THEIR ATTENTION! Everyone wants something for free. Tailor your copy to appeal to your customer's immediate (or if not immediate, then related) need - a free e-book, free research, free trial, free something. STEP 2. - Write your copy to elicit the 'Yes! Factor' Promote the ideal and habitualize the response of your visitors Appeal to their emotions/desires/fears Focus on the benefits, not the product itself - 'what this will do for you' as opposed to 'what this is.' Many online buyers are not the most patient of people and, to generalize, when in the initial stages of the purchase, are less likely to be interested in the fact that the ingredients of a product are 2.3% aloe vera, 47.1% hydrothingey, 1.9% tigerbalm, yada yada. Those details are for later in the conversion path. STEP 3 - Follow up your copy promise with proof Use before and after pictures (real ones - not fake ones, please) and testimonials. Again, don't fake them--if you're found out, it can be somewhat bad for business, especially online where trust is everything, and the social community is becoming more and more influential and is gaining more and more exposure. Don't piss off the \"mob.\" STEP 4 - Price Display. Where you display the price probably depends most on the competition in your marketplace and how competitive your pricing is. If the marketplace is saturated, and your product is more expensive, offer the price discreetly (maybe not even on the first page), after they have committed and after they have been reminded of the discount they are receiving as a thank you. And while you're at it, if you are selling related products, once they have indicated their purchase intent, offer a discount. Use your copy skills to full advantage and sell visitors on the benefits of your product with a discount teaser first, leading them to the price. On the other hand, if you have a price advantage, then include the price big and bold straight away. Best practice: Testing landing pages with different pricing displays is the best way of determining what will work for your product, at your price, in your market. STEP 5 - Who are you writing for? Finally, always bear in mind that on-line you are appealing to an audience that contains all the personality types. While all types are motivated to a lesser or greater degree by emotion, there are other factors to bear in mind apart from the obvious factor of using their own query language to 'prove' your page answers their query intent. Appeal to the 'steadies' with the benefits, the logical advantages of purchasing, and a sense of security, both regarding the purchase itself and online security. You need to appeal to the 'dominants' by focusing on the point, proving the results, and being direct. Appeal to the 'influencers' by offering an immediate response/order interactive facility, praise and social interest factor. Sample Copy Illustration - specifically based on the 5 steps outlined in this article Business objectives: sale leads Assumption: You have received a CTR for a targeted term via natural search... e.g. 'anti-wrinkle cream' Note: this is a purely copy-based example; obviously design, buttons, layout, etc need to be taken into consideration. Read more on PCM / Landing Page Optimization. LANDING PAGE COPY Anti-Wrinkle Cream - Which one is right for you? Perfect skin must be nice to have, don't you agree? No blemishes, no scars, just smooth, soft, clear skin. If you've seen a little child lately, you know what I mean about skin perfection. We would like to offer you a free ebook entitled, \"How to Identify Your Skin Type to Best Protect & Care for It,\" and as a thank you for your interest, we would also like to offer you a 20% discount on the selling price of our all natural 'XJ Factor Anti-Wrinkle Night Cream'. Advanced modern application of ancient traditions can achieve previously unattainable results in maintaining youthful skin. The exact extraction of essential oils, the perfect mix of ingredients to provide the perfect skin tone blended products tailored to your skin type, backed by years of proof*, and stamped with a satisfaction guarantee. You have to age; your skin doesn't have to quite so fast. Help your skin to feel as young as you want to look. o Yes I would like to receive my Free e-book o Yes I would like to receive my Free e-book AND receive my 20% discount *Rigby MacArthur, CA - 83 [picture]\"I swear by the Perfectly Natural Anti-Wrinkle Range. I've been using it for 11 years, and look years younger than my age . [I]... can't recommend it strongly enough.\" Chesney Delacroix, AB - 33 [picture] \"I have 3 kids under 5, including 2 year old twins, they sleep badly, and so do I. I have a full time job, and I'm exhausted. My only saving grace is the Perfectly Natural Range which makes my skin glow, and keeps my wrinkles at bay. Thanks PNR.\" CONVERSION PATH 2 - served after they click on o Yes I would like to receive the free e-book and receive my discount Please enter your: email address Name State/Province ZIP code Billing address Postal Address if different Thank you! SUBMIT CONVERSION PATH 2 - PAGE 2 - served after submitting [Picture nightcream] Normal Price $17.95 - Your price $14.36 add to cart Or take advantage of our online offer and receive a further 10% discount your entire purchase if you order our Night and Day Cream combination offer AND free shipping (within USA) [Picture combo offer] Normal Price $35.90 - Your Price $28.72 add to cart CONVERSION PATH 2 - PAGE 3 Payment details. ....You got 'em..... didn'tcha... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Post Click Marketing Copy that Sells"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Post Click Marketing Copy that Sells"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "lauramaccallow@yahoo.co.uk\n          \n            lauramaccallow@yahoo.co.uk"
}