{
  "url": "https://moz.com/blog/predicting-search-queries-before-demand-arrives",
  "slug": "predicting-search-queries-before-demand-arrives",
  "title": "Predicting Search Queries Before Demand Arrives - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In the stock market, analysts and traders buy, sell and trade shares in companies based on the speculation of future earnings or declines. Stock pickers attempt to determine which investments will rise and fall based on publicly available information. Slate magazine recently pointed out that even…",
  "content": "Predicting Search Queries Before Demand Arrives Keyword Research By: Rand Fishkin January 28, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 28, 2007 Predicting Search Queries Before Demand Arrives Keyword Research The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In the stock market, analysts and traders buy, sell and trade shares in companies based on the speculation of future earnings or declines. Stock pickers attempt to determine which investments will rise and fall based on publicly available information. Slate magazine recently pointed out that even the best stock pickers, however, are generally terrible at beating the market as a whole over the long term. However, we in search have our own market from which to pick and choose rising stars - the daily demand for search queries. It's strange to me that this topic is so rarely discussed and that so few individuals in the search world talk about the power of \"predictively picking keywords.\" In the search market, there's no rules against insider trading - if you know that ABC is running a special about whatever happened to Marianne from Gilligan's Island on Sunday, writing a blog entry or creating a landing page for that phrase isn't \"insider trading,\" it's just smart keyword targeting. Similiarly, there's almost no downside to being wrong - you may waste a half hour putting together some content, but you won't lose money and even the worst predictions may pay off in the future. If, as a savvy website operator or search marketer, you can anticipate trends in your field (or any field) from a query perspective, you stand to be exceptionally successful. First to market with a great piece of content on a subject can often mean that your resource becomes the reference \"source\" for future content pieces, meaning you can maintain the top position simply by being first (and thorough). Some solid examples include creating pages or sites for: New television shows New books or films Artists whose popularity is rising (in any field) Current events Geographies that receive attention (particularly smaller towns, landmarks, etc.) Historical references or events New technologies or products Has anyone played the keyword query prediction market lately? Any big ones to show for it? Please feel free to link out to references or examples of successes. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Predicting Search Queries Before Demand Arrives"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Predicting Search Queries Before Demand Arrives"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}