{
  "url": "https://moz.com/blog/prepare-for-client-meetings-next-level",
  "slug": "prepare-for-client-meetings-next-level",
  "title": "How To Plan and Run a Successful Client Meeting - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Client meetings are one of the keys to success for any SEO consultant or marketer. In this edition of Moz’s educational Next Level series, Meghan shows you how to use Moz Pro to prepare for and run a successful meeting with your clients.",
  "content": "How To Plan and Run a Successful Client Meeting – Next Level Moz Tools | SEO Consulting | Digital Marketing Agencies By: Meghan Pahinui Edited By: Chima Mmeje August 14, 2024 Table of Contents Copied! By: Meghan Pahinui Edited By: Chima Mmeje August 14, 2024 How To Plan and Run a Successful Client Meeting – Next Level Moz Tools | SEO Consulting | Digital Marketing Agencies Welcome to the newest installment of our educational Next Level series! Together, we’ll uncover how to plan and run a successful client meeting. Explore more: Looking for more Next Level posts? Previously, we explored how to easily find backlink opportunities. Set yourself up for success Whether you’re meeting a new client, heading into a regular monthly meeting, or catching up for the first time in a while, preparing for client meetings can be anxiety-inducing. Having a comprehensive plan at your fingertips relieves the stress of scrambling to get everything organized and ready. So, let’s look at what you can do before, during, and after your client meeting to set you and your client up for success. Before the client meeting Preparing beforehand is the key to achieving a positive outcome from a client meeting. Arriving to your meeting with the correct data, expectations, and goals ensures the meeting runs smoothly and makes you look like the professional you are. These are the three important steps to take before gathering data for your client: Do client research You must know your clients to do good work for them. If you’re preparing to meet with a newly acquired or potential client, research ahead to understand their business and industry better. In her recent blog post on how to prepare for local client meetings, Miriam Ellis suggests keeping a client file for each of your customers. This is a great way to personalize your exchanges and demonstrate that you care about your clients. Also, note any personal details they share with you that are important to remember, like recent birthdays or celebrations. Lastly, ensure you’re up to date on recent industry news so you can address any questions as they arise. Make sure everyone is prepared Preparedness is a double-sided coin. On one side, your team needs to be ready; on the other, you want your client to be equally prepared. To prep your team, share all client-related information with anyone attending the meeting well in advance. This gives them time to review and ask questions away from the client. You want your team to have access to anything that may come up. To ensure your client is prepared, send a reminder email highlighting any pending tasks and meeting details like date, time, and Zoom links—this way, they have everything in one place. Set an agenda based on what you aim to achieve Create a clear agenda to keep the meeting focused and organized. Share it with your client a day or two before the meeting, inviting them to add any discussion points so you can allot time for them and prepare materials or data related to the request. Finally, include the agenda in the meeting invite for easy reference. Prepare data for the client meeting With the agenda set and your client prepared, it’s time to gather the necessary data. While this can feel overwhelming, using the right tools can simplify the process. Moz offers a variety of tools and features to help you shine. Here are some ways to streamline your prep work and impress your clients with data-informed Insights. Provide a comprehensive overview of site performance Starting a client meeting with an overview of site performance overview is crucial, but gathering this data can be time-consuming. Moz’s Domain Overview tool simplifies this process by offering a comprehensive dashboard of any site’s performance, saving you time and helping you deliver clear, concise reports to your clients. Domain Overview consolidates data from various Moz tools, making it a one-stop shop for meeting prep. Some of the key data in this report includes: Domain Authority® — A Moz proprietary metric that predicts how well a domain will rank in Google based on a machine learning algorithm of link metrics. Higher scores indicate a greater likelihood of ranking, helping you compare your site’s ranking potential against competitors.Brand AuthorityTM — This score, developed by Moz, measures a domain’s total brand strength on a scale of one to 100. Linking domains count — A Moz metric showing the number of unique root domains linking to a website. It’s a great way to understand the diversity of a site’s backlink profile.Ranking keywords count — Highlights the number of keywords a site ranks for in the Moz corpus, with a breakdown of how many ranks in the top three and ten positions.Top ranking keywords — Outlines the top ranking keywords for a site based on rank and monthly volume. Frequently used anchor text — Insights into how others talk about and link to your brand online. Moz also includes features powered by Moz Data and generated by Moz AI, such as Domain Search Theme and Domain Keyword Topics features: Domain Search Theme is the dominant theme of the SERPs associated with the most frequently searched keywords. This insight helps you understand the types of SERPs a site appears in and the competing results in those spaces.Domain Keyword Topics shows the top keyword categories, or clusters, for the site queried, offering a glimpse into how users are searching for and discovering the site based on its ranking keywords. This comprehensive tool is free for anyone with a Moz Community account, with additional queries available to Moz Pro subscribers Meeting with existing clients? In addition to the Domain Overview report outlined in this section, consider setting up a Campaign in Moz Pro to track rankings and site crawl issues over time. You can create custom reports to automatically send to your customers weekly or monthly, and you can pull data from your Campaign via CSV to prepare for meetings. Not a Moz Pro customer? Try it out with a free trial. Identify target keywords It’s no mystery that clients often prioritize keywords due to their direct impact on rankings, traffic, and, ultimately, revenue. To prepare for questions like “What keywords should we focus on?” it’s essential to compile a list of potential target keywords. Moz Pro offers two tools to help with this. Start with the Ranking Keywords feature in Keyword Explorer. Enter your client’s site URL and click Analyze. This will generate a list of keywords the site already ranks for, including the ranking URL and Difficulty score for each keyword. To identify content improvement opportunities, filter this list by ranking position to highlight keywords just outside the top 10 results. You can also enter up to two competitors to see how their ranking keywords overlap with your client. For deeper Insights, the Keyword Gap tool in Competitive Research is invaluable. Start by entering your client’s URL and up to three competitors. (Pro tip: If you need help identifying your client’s top SERP competitors, the True Competitor tool is a great place to start.) The Keyword Gap tool generates a list of Keywords to Improve, which you can sort and filter. You can focus on keywords where your client is being outranked or where competitors rank, but your client doesn’t. Additionally, the Traffic Lift metric highlights keywords with the highest potential traffic gains if your client overtakes competitors in the SERPs. With these two tools (both of which are free for anyone with a Moz Community account, with additional queries available to Moz Pro subscribers), you can create a customized, comprehensive list of target keywords for your client and content strategy suggestions based on existing rankings. Meeting with existing clients? Both Ranking Keywords and Keyword Gap provide useful data for new and existing clients. Level up your data with ongoing Rankings reports from Moz Pro Campaigns. Outline content opportunities Targeting a list of keywords is great, but you also need a content plan to make it actionable. Top Competing Content within the Competitive Research suite of tools identifies content opportunities for your client. After entering your client’s URL and up to three competitors, the tool will show you competitor content that outranks your client’s, along with the relevant keywords, their rank, your client’s rank, and the corresponding URLs. Now, you can compare those pages to see why the competitor may be outranking your client. Understanding search intent is crucial when creating new content for target keywords. Knowing a consumer’s query helps you understand the content format that fulfills the search intent. To see what intent is associated with a given keyword, go to the Keyword Suggestions section of Keyword Explorer. Enter a target keyword, and Search Intent will populate for the keyword and all the suggested and associated keywords. Use this data to:Generate content ideas that align with the intent behind a keyword.Identify additional keywords to target based on existing content and the intent it fulfills. For example, if you have a blog post comparing running shoes, you may also target the keywords “best running shoes for women” or “ best marathon shoes” since they both have commercial search intent associated with them. Search Intent Fulfillment Opportunities from the Moz SEO Learning Center Finally, use your collected data to create a content plan for your client. Even if it is only for a few pieces of content, it gives them a starting point and shows that you have a robust plan to help them succeed online. As with the previously mentioned tools, the ones mentioned here are free to use for anyone with a Moz Community account, with additional queries available to Moz Pro subscribers. Meeting with existing clients? Both tools highlighted in this section can provide actionable data for both new and existing clients. Supplement your data for existing clients with rankings data and Page Optimization reports for newly created and updated content. Highlight valuable link prospects You’re almost ready for your client meeting. You’ve gathered data on keywords, content, and general site health. Now, let’s prepare a list of potential link building opportunities. Link Intersect in Link Explorer allows you to enter your client’s URL and up to five competitor URLs to see what sites (or pages) link to competitors but not your client. Use the domains option to see a broad overview of potential link sources and then narrow it down to opportunities that would best fit your client. Or, get a granular by selecting the pages option. Our previous Next Level blog post discussed a workflow for quickly finding backlink opportunities with the Link Intersect tool (free to use for anyone with a Moz Community account, with additional queries available to Moz Pro subscribers). Meeting with existing clients? The Link Intersect tool can offer valuable insights at any stage of the client lifecycle, but you can supplement this data by tracking link metrics in Moz Pro Campaigns or Domain Overview. Additionally, filter the Top Pages feature by status code to identify opportunities for link reclamation. Bonus — highlight technical SEO wins If you’re meeting with a client for the first time, you may not have the time or resources to complete a site audit. So, consider highlighting opportunities for technical SEO improvements to enhance the data you present to your client. Use the On-Demand Crawl tool in Moz Pro to crawl up to 3,000 pages and identify issues like 4xx errors or redirect problems. Export the data to a CSV to find low-hanging fruit to highlight in your meeting. For larger sites or ongoing clients, setting up a Moz Pro Campaign provides deeper Insights. Apart from crawling larger sites with Campaigns, you can perform weekly crawls to monitor new and existing issues. Also, use Campaigns to track fixes by marking issues as resolved or ignoring those that fall outside the scope of your SEO strategy. Meeting with existing clients? On-Demand Crawl allows you to quickly crawl smaller sites for one-off site audits, while Site Crawl in Moz Pro Campaigns helps with regular site audits and issue tracking. Both tools are only available with a Moz Pro subscription or free trial. During the client meeting Hopefully, with all your data prepared and pre-meeting emails sent, you’ll feel ready to walk into your client meeting with confidence. Now, let’s talk briefly about running the meeting and how to keep everyone on track. Listen to your client but minimize distractions Nothing can turn a meeting sour faster than the client feeling dismissed and unheard. Make an effort to show them that you hear their suggestions and concerns while still sticking to the topic(s) of the meeting. Allow room for questions by not overloading the agenda, and guide the conversation back to your strategy when necessary. A great way to steer folks back to the task is to tie their concerns or comments to the strategy you have laid out. Remember, you are the expert, so stay calm and composed when addressing their questions. If the client insists on discussing something wildly off-topic, suggest scheduling a separate meeting time to discuss it. This approach acknowledges the importance of their concerns while keeping the meeting on track. Present data to reflect the outcomes your client cares about Remember, both you and your client share the same goal: their business success. Connect your data and strategy to their primary objectives to reinforce that you’re on the same team. If this is your first meeting with a client and you don’t know their primary goal, now is the time to ask. While your expertise is important, your client may not see the connection between specific SEO strategies and their business outcomes. It’s your job to bridge that gap. This is where your prep work shines. You have the data to impress your client and the strategy to move forward. By aligning your Insights with what the client values most, you’re setting the stage for a successful collaboration. Use repetition to reinforce the key outcome As your clients ask questions or offer suggestions, continue to reiterate their goals and how your strategy will help them achieve those goals. Repetition reinforces the key outcome, easing any concerns they might have and keeping everyone focused on the shared objective. It also gives the client plenty of opportunities to interject if they feel the goal has changed or to better understand how you support their mission. Establish next steps Before wrapping up the meeting, outline the next steps for you and the client. Make sure to cover: What you will prepare for the next meetingWhat your client should have ready by the next meetingAny tasks or deliverables needed before the next meeting, along with their deadlinesIf not already scheduled, set a date and time for the next meeting After the client meeting Even though the client meeting is over, your work isn’t complete. Make sure you jot down any notes you missed during the meeting, including due dates for the deliverables discussed. Keep key stakeholders informed on the outcome of the meeting and update any client files with relevant notes, comments, and data. Lastly, don’t forget to follow up with the client. Follow up After the meeting, follow up with the client via email (or their preferred communication method, such as Slack) with a summary of what was discussed. Include any deliverables they are responsible for before the next meeting, and outline what you will prepare for them. Also, confirm the date of the next meeting or ask about scheduling if it hasn’t been set yet. This follow-up helps keep everyone on track and provides a written record for reference. In conclusion We’ve covered how to gather data using Moz Pro to make informed decisions and shared tips for keeping your meetings on track. Now, you’re set to plan, run, and follow up on client meetings with new and existing clients. Good luck with your next client meeting — not that you’ll need it! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H2",
      "text": "Set yourself up for success"
    },
    {
      "level": "H2",
      "text": "Before the client meeting"
    },
    {
      "level": "H3",
      "text": "Do client research"
    },
    {
      "level": "H3",
      "text": "Make sure everyone is prepared"
    },
    {
      "level": "H3",
      "text": "Set an agenda based on what you aim to achieve"
    },
    {
      "level": "H2",
      "text": "Prepare data for the client meeting"
    },
    {
      "level": "H3",
      "text": "Provide a comprehensive overview of site performance"
    },
    {
      "level": "H3",
      "text": "Identify target keywords"
    },
    {
      "level": "H3",
      "text": "Outline content opportunities"
    },
    {
      "level": "H3",
      "text": "Highlight valuable link prospects"
    },
    {
      "level": "H3",
      "text": "Bonus — highlight technical SEO wins"
    },
    {
      "level": "H2",
      "text": "During the client meeting"
    },
    {
      "level": "H3",
      "text": "Listen to your client but minimize distractions"
    },
    {
      "level": "H3",
      "text": "Present data to reflect the outcomes your client cares about"
    },
    {
      "level": "H3",
      "text": "Use repetition to reinforce the key outcome"
    },
    {
      "level": "H3",
      "text": "Establish next steps"
    },
    {
      "level": "H2",
      "text": "After the client meeting"
    },
    {
      "level": "H3",
      "text": "Follow up"
    },
    {
      "level": "H2",
      "text": "In conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "Moz AI: Introducing Augmented Intelligence"
    },
    {
      "level": "H3",
      "text": "Find Your Difficulty Benchmark – Next Level"
    }
  ],
  "author": "Meghan Pahinui\n          \n            Meghan Pahinui\n          \n            Meghan Pahinui"
}