{
  "url": "https://moz.com/blog/preparing-for-negative-seo",
  "slug": "preparing-for-negative-seo",
  "title": "Negative SEO: Should You Be Worried? If Attacked, What Should You Do? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Many rumors have spread about negative SEO. Should we be worried? How should we protect our sites? This post paints a comprehensive picture to help put concerns to rest.",
  "content": "Negative SEO: Should You Be Worried? If Attacked, What Should You Do? Link Building | Advanced SEO By: Marie Haynes August 26, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Marie Haynes August 26, 2014 Negative SEO: Should You Be Worried? If Attacked, What Should You Do? Link Building | Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. There has been a lot of talk lately about negative SEO. Does it really happen? If so, should you be worried? How do you know whether someone is attempting to attack you with negative SEO? And what should you do to protect yourself? The purpose of this article is to shed some light on the subject, and hopefully to reduce some of the fear exists in this area.What is negative SEO? Negative SEO occurs when someone makes attempt to lower a site's rankings in the search engines. There are multiple ways that this can be attempted. The most common type of negative SEO that gets discussed is link based negative SEO, but there are many other techniques that unscrupulous people can use to try to reduce your rankings. We'll talk about how to recognize some of these tactics later on in this article .Does negative SEO really work? We know that a site can be penalized or can be suppressed by Google algorithms if they have engaged in manipulative link building. The result can be a manual unnatural links penalty or an unnanouced demotion at the hands of the Penguin algorithm. So, if links that I made can hurt me, then intuitively it makes sense that links that someone else made could have the same negative effect. Or can they? Google is quite adamant that true, effective negative SEO is very rare. In an effort to understand more about Google's stance on negative SEO I decided to research every instance I could find where a Google representative discussed negative SEO. You can read transcriptions of a good number of John Mueller's and Matt Cutt's statements on negative SEO in this article. I'll be quoting from these transcriptions several times in this Moz post as well. Prior to January of 2003, Google had a page on their site that said the following, \"There is nothing a competitor can do to harm your ranking or have your site removed from our index. \" And then in 2003, they changed the wording to say, \"There is almost nothing a competitor can do to harm your ranking….\" And really, the change made sense. I don't believe Google was admitting at this point that you could drop a site by pointing links at it. Rather, they were likely conceding that there could be cases where someone could harm your website by, for example, hacking into your server and deleting your site or changing your robots.txt file to tell search engines not to crawl the site any more or other such nefarious things. But what about links? Can a competitor point bad links at you and reduce your rankings? In 2007, Matt Cutts was quoted in a Forbes article on negative SEO: \"Matt Cutts, a senior software engineer for Google, says that piling links onto a competitor's site to reduce its search rank isn't impossible, but it's extremely difficult. \"We try to be mindful of when a technique can be abused and make our algorithm robust against it,\" he says. \"I won't go out on a limb and say it's impossible. But Google bowling is much more inviting as an idea than it is in practice.\" So, at that point Google is admitting that negative SEO via linkbuiding is a possibility, albeit quite a remote one. Let's jump forward to 2012. In April of 2012 Google released the first version of the Penguin algorithm which was created to reduce and even penalize for the use of unnatural links. This is when the topic of whether or not you could negatively affect a competitor's site by pointing bad links at them became a very common discussion. Take a look at the Google Trends data for searches for \"negative SEO\": Shortly after Google refreshed the Penguin algorithm in October of 2012, Matt Cutts announced the creation of a new tool, the disavow tool, which would allow site owners to ask Google not to count links that they felt could damage their site. Matt stated that the vast majority of sites would not need to use the tool and that Google's algorithms were really quite good at making sure that these bad links would not hurt your site. But, he did admit that it could potentially be a concern for people in high money, competitive niches, saying, \"For the people who are in maybe super competitive poker, casino, whatever kind of niches and they're worried about, 'OK, what if someone is trying to do some ill will towards my site?' we've just released a new tool called disavow links.\" If you read through the transcriptions of things that Matt Cutts and John Mueller have said about negative SEO, here are the points that Google seems to be emphasizing: Google works hard to ensure that a competitor cannot hurt your site by pointing bad links at it. They have things built into their algorithms to help determine whether the links are self made or not. For example, if there has been a pattern of unnatural linking that has been occurring for many years, then it's not likely that a competitor is at fault. If you notice a bunch of bad looking links pointing at your site, most likely they are not going to do any harm to you. But, Google admits that they may not get things 100% correct all of the time and as such, it's not a bad idea to disavow any spammy looking links that you see. If you see a situation where you feel that negative SEO is actually being effective, Google would like you to report it either in the webmaster forums or by contacting John Mueller and they will look into the situation to see if they can improve their algorithms. The vast majority of cases where people report negative SEO attacks to Google end up NOT being negative SEO.Examples of things that are NOT negative SEO I can't tell you how many times I have had a client claim that a competitor is attacking them with bad links when in most cases, this probably isn't true. If you start looking at your backlink profile and seeing some odd looking links it's a normal reaction to think, \"I didn't make these spammy links! So, if I didn't make them, who did? It must be my competitor!\" Here are some examples of situations where negative SEO was suspected, but in reality there is another explanation for what is going on:Example #1: \"Weird\" links are not necessarily bad links There are some websites that link out to almost every site on the web. For example, most sites will have links from sites like: askives.com mrwhatis.net m.biz (and hundreds of m.biz clone directories. I don't know where these come from, but although it's probably not necessary, I disavow them just to be safe. In my opinion, they're not likely negative SEO though.) directories that have scraped dmoz.org links from sites that analyze and provide domain info Chinese sites that scrape alexa.com ...and so on.Example #2: Sitewide links are not all bad links I've seen site owners get really upset when they look at their \"Links to your site\" section of Webmaster Tools and see something like this: The fear is that Google is going to think that you built tens of thousands of links to your site. Now, in the example that I have given, where the site is a well known one like yellowpages.com, it may be a little more clear that this is not an unnatural link. But, what if a site owner in your niche really liked your content and linked to you in their sidebar? And what if they linked to you with a keyword? Underneath \"Links to your site\" in Webmaster Tools is a section called, \"How your data is linked\" that contains your most commonly used anchor text. So, if I got a sitewide link from a site with thousands of pages and they linked with a keyword, I'm going to see that Google thinks that the majority of my links are keyword anchored. Oh no! I've had people think that they've been hit by negative SEO because they have seen a single keyword anchored sitewide link. In my opinion, Google is pretty good at figuring out that a sitewide link is really just one vote from a site. A single sitewide link is not a sign of negative SEO even if it causes thousands of links to appear in Webmaster Tools.Example #3: Your old habits are coming back to haunt you Have you ever in the past purchased a link building package? For example, years ago when I was learning SEO I purchased a citation building package to one of my sites. It was one of those deals where you pay $100 and you get a whole bunch of directory listings. (Yeah...I'm not proud of it, but hey...we all had to start learning somewhere.) I've since cleaned up those links. But, the amazing thing is that they keep replicating. I will often see new links appear that are using the same text that I used when I purchased that package. It would be easy for me to say, \"Hey! I haven't built any links in years...and now I'm seeing spammy directory listings appear. This must be a competitor pointing bad links at me!\" But really, my own actions were the cause for these unnatural links.Example #4: A well-meaning employee or friend is building you links You might laugh at this example, but I've seen it happen. I had a client who contacted me for help with a manual unnatural links penalty. He swore he had never purchased or built a link in his life, but his backlink profile was full of a lot of pretty manipulative stuff. He assumed it had to be a competitor doing this. As we were doing the cleanup for his site we noticed new bad links that were appearing. Agh! We're under attack! Well, it turns out that the site owner's nephew had been doing some reading about SEO. I am not kidding. He thought he was helping his uncle out by SEOing his site for him. Oy vey.Example #5: A previous SEO made these links Some people are shocked when they find out that their SEO company has been building them unnatural links. I have seen many cases where an SEO company promised they were going to give a site \"White hat links\" or links that were within the Google guidelines, but in reality it looks like they outsourced the job to a cheap linkbuilding company that created spammy bookmarks, blog comments and forum signatures. If you've got unnatural links and you've ever hired an SEO company, there is a good chance that those bad links were actually made on purpose and that YOU paid for them! Remember, prior to April of 2012, these links used to work well to rank pages and very few websites would get penalized for using them.Example #6: You've been hacked While someone could negative SEO your site by hacking into it, not all cases of hacking are negative SEO. A while back, a friend of mine emailed me and said, \"Hey! Did you know that one of your sites is ranking highly for Michael Kors handbags?\" His suggestion was that I take advantage of that and throw an affiliate page up on the site. :) I had a look at the backlinks and here's what I saw: Crap. This was not a competitor trying to hurt my rankings. In fact, the tens of thousands of spammy links that were pointing at my site were actually helping my rankings at that point. What had happened here is that someone had taken advantage of a vulnerability in a Wordpress plugin that had not been updated. They were able to hack into the site and create a whole bunch of new pages. They then pointed huge numbers of spammy links at these pages and redirected them to their Michael Kors affiliate sites. If you are looking at your backlink profile and you see odd keyword anchors for things like viagra, cialis, casinos, payday loans, ugg boots, etc, then there is a good chance that you have been hacked. In most cases these links can be removed by finding and removing the pages that the hacker created on your site. However, if you have been hacked, it's a good idea to have someone familiar with cleaning up hacks look at your site to figure out how the hacker got in and how you can close that door. In this situation, we removed the offending pages, found and fixed the access point, AND I also disavowed all of those links. According to Google, if you get hacked and have bad links pointing to you, you can probably ignore them because their algorithms are good at picking up and just discounting this sort of thing. However, it concerned me that these bad links actually were helping this site. If Google was just discounting them then they should have had no effect. I am 99% sure that I would have been ok to leave them, especially since the pages they pointed to had been removed (which also removes the link pointing to that page), but just to be absolutely sure that something odd didn't affect me with the next Penguin update, I disavowed them all at the domain level. I now have alerts on Google Alerts and Moz Freshweb Explorer set up to help me determine when someone is hacking my site. To do so for your sites, in each of these tools you can set up alerts for things like: site:yoursite.com \"michael kors\" site:yoursite.com viagra site:yoursite.com casino site:yoursite.com \"payday loans\" site:yoursite.com \"cialis\" ...and so on.Signs of things that COULD be negative SEO I said at the start of this article that the vast majority of cases of suspected negative SEO that I see really aren't negative SEO after all. But, there are situations where it does indeed happen. Here is the type of link that you can commonly see when someone is trying to attack you with negative links: Links from foreign forums A huge number of links from sites with TLDs of .ru, .cz, .cn, .pl, .ro, .bg, .biz, .com.ar, .com.br and .info. Not all of those links are going to be unnatural, but if you are suddenly getting an influx of links from russian sites, it could be a sign of an attack. A large number of links from complete nonsense blog posts: Lots of keyword-anchored links from multiple sources. (I'd like to reiterate that receiving one sitewide link from a questionable source is not a sign of negative SEO, even if you are suddenly seeing thousands of links coming from that site.) An influx of links from bad neighbourhoods such as porn sites, gambling sites, payday loan sites, etc. There are many other tricky techniques that can be used to attack sites with negative SEO, but most sites will not need to worry about these tactics. (I'll explain more about whether or not you need to worry below, so keep reading!) I'm not about to describe all of the different ways you can do negative SEO, as I don't want to give any evil people any ideas. But, the one tactic that I will mention and that you can keep an eye on is someone redirecting penalized sites to yours. Take a look right now at your site on ahrefs.com. You don't need a membership to see whether you've got redirects pointing to you. Scroll down until you see \"backlink types\" and then \"redirect\". Now, not all redirects are bad. If you have affiliates, they may have pages that redirect to your product pages, These are usually okay, and there are many other valid reasons for a site to redirect to yours. But if today you see that you have three sites redirecting to you and next week you've got 30 or even 300 sites redirecting to you, then this could be a sign of a problem. Can these redirects hurt you, though? Can an influx of bad links hurt you? Do you need to worry? Google has given conflicting advice in this regard. In one place, they have said that bad link signals will definitely pass through a 301 redirect, but in another place they have said that attempting to 301 redirect a penalized site to a clean site will not cause a penalty on the clean site. In my opinion, what Google is saying here is that if you are redirecting one of your own sites to another of your own sites, then they'll pass the bad link signals. It's just like you building your own unnatural links. But if you try to 301 to someone else's site then they won't let those links count. How does Google know the difference? That's part of the secret sauce. I do think that they use all sorts of signals to determine whether links are self made or made by a competitor.Should you worry about negative SEO? OK, so let's say you see evidence that someone is attacking your site with unnatural links. Does this mean you are going to lose your rankings? Google really does work hard to algorithmically protect sites from this type of link causing a problem. And, I would say that for the vast majority of you who are reading this post, you DO NOT NEED TO WORRY ABOUT NEGATIVE SEO. Yes, just shouted there. I really want to emphasize that most sites do not need to worry. This is the point in the article where the black hatters start getting upset. I wonder who the first person will be to post a comment saying, \"You don't know what you're talking about! Negative SEO works because I've done it on hundreds of sites.\" Or, \"I know negative SEO works because my site got taken down.\" Here is my opinion on the types of sites that could possibly be adversely affected by a link based negative SEO attack: Sites in very competitive, high-money niches such as casinos, payday loans, insurance, pharmacy sales, etc. - People who are running negative SEO in these circles have more knowledge of sophisticated methods that just may possibly work. Some of these people spend hours and hours trying to find loopholes in Google's algorithm that will allow them to take down a competitor. When Google adjusts their algorithms to be able to combat those methods then these people spend even more hours trying to beat the system. They also have huge budgets that they can throw into a negative SEO attack. For the average small business owner to pay someone to do a high level intensive SEO attack that has the potential to work, it would likely cost more money than it would cost to implement regular SEO methods on your own site. Sites that have a long standing history of doing their own manipulative linking. If you have received a manual link-based penalty in the past or have been affected negatively by the Penguin algorithm, then in my opinion you really should keep a watch out for additional unnatural links pointing to your site. In a hangout, John Mueller spoke about a situation where Google may not be certain whether to discount bad links that look like negative SEO because the site itself had a lot of signals that indicated that the site owner had been engaging in webspam. He implied that Google may not be able to tell what was self made and what was an attack: \"It's something where we see these problematic links and we don't really know how we should react to that. It's not that we can just close our eyes and say, 'Oh well... we can recognize these problematic links and ignore them. It's more that we don't know what we should do with all of the other signals that we find attached to your website\" In these cases, if it does appear that negative SEO is being targeted at your website, the best tool you have is to do monthly monitoring of your backlinks.How can you protect yourself from negative SEO? If you are in a competitive niche, or if you have a history of being penalized and having to do link cleanup, then you really should be monitoring your backlinks regularly. What we do for our regular link audit clients is a monthly backlink audit. This really should be frequent enough to find and clean up unnatural links. However, if you are under a strong attack where new unnatural links are coming in daily, it may be a good idea to do this cleanup every one-to-two weeks. It's not a bad idea for other sites that are at low risk of succumbing to a negative SEO attack to do a monthly link audit as well. What we have found is that when you monitor your new links monthly, you can easily see the new, good links that your site is attracting. This can give you a lot of ideas on how to get even more links. If you see, for example, that a few people had recommended a particular product of yours via a link from forum posts, then you may want to create more content surrounding that product and engage on an email outreach campaign to get more people to link to that content. But wait….why would I recommend doing a regular link audit if Google says that they can catch negative SEO and discount it? The reason is that you're relying on an algorithm and the algorithm is not going to be 100% accurate. Here are some quotes from John Mueller of Google regarding their accuracy on catching and discounting negative SEO: \"It's a tricky situation and not something where I'd say that we can guarantee that we always get it 100% right. But, from the cases I've looked at I think we've done a pretty good job.\" \"We do work very hard to make sure that third party effects like that don't play a role within the search results. It's something we can't absolutely guarantee that we'll always get it right. So, if you're seeing something like this you're welcome to let us know about that. \" \"If you're looking at the links in Webmaster Tools for example I might go ahead and submit a disavow file for those links. In general though, we do recognize these kind of situations and handle them appropriately. \"How to do your backlink audit There are many different ways to do a backlink audit. Some people will use automated link auditing tools, but if you do choose to do this it is vitally important that you do a manual audit alongside of the automated suggestions. I can't tell you how many failed reconsideration requests I have seen because people have relied solely on these reports. I have also seen these tools recommend disavowing some fantastic natural links as well. In my opinion, you must look at your links manually! If you are working on a site that does not have a history of unnatural linking, you can probably get away with just using the links that you get from Webmaster Tools. Google has said in the past that Webmaster Tools links are \"all you need\". However, John Mueller and Matt Cutts have clarified that statement saying that they are all you need in order to pick up your patterns of unnatural linking. This is fine if you are lucky enough to have a complete list of all of the links that have been ever made on your behalf, but if you don't have that then you're likely going to have to go looking to other sources to find all of these links. We have come across many unnatural links that are indexed in Google and not reported in Webmaster Tools. And, we've even been given some of these as examples on failed reconsideration requests. The links you see in Webmaster Tools are just a sample of your links. As such, we use links from the following sources: Webmaster Tools (Recent) Webmaster Tools (Sample) ahrefs.com (a paid tool) majesticseo.com (a paid tool, but it's free for your own site if you verify your site) opensiteexplorer.org (This is Moz's tool, and for most sites you can get a good number of your links for free provided you register an account with Moz. I would say though that I find that Open Site Explorer tends to pick up more of the good links and doesn't catch as much as the overt spam as Ahrefs and Majestic. We then sort the links into a more manageable list so that we only analyze one link from each domain. If you are doing monthly audits, you will want to keep track of which domains you have already audited so that you don't waste time assessing that domain again. You can use a VLOOKUP formula in Excel to highlight which domains you have already audited in previous months. You can use a similar VLOOKUP to highlight domains that are already in your disavow file. It took me a while to understand how VLOOKUP works. There are many tutorials out there, but here is my simple explanation: Let's assume that your link auditing spreadsheet is \"Sheet1\" and you have a list of your disavowed domains on \"Sheet2\". Let's say that column A of each sheet contains your domains and column B of \"Sheet2\" contains the words \"in disavow\". Let's assume that you have 1000 domains on \"Sheet2\". Again, this is your list of disavowed domains. On \"Sheet1\" create a new column and enter this formula:=VLOOKUP(A1, Sheet2!$A$1:$B$1000,2,FALSE). Now, copy that formula down the entire column. You will end up having each row saying either \"in disavow\" or \"N/A\". For those domains that are in your disavow, you don't need to re-audit them because you have already disavowed them. I have prepared hundreds of link audit spreadsheets. This summer I dedicated a huge amount of time to creating and programming a system that allows me to keep track of my monthly audit clients and create awesome spreadsheets for manual link audits. The sheet that is produced chooses the best link from each domain to audit, eliminates domains that I have already audited for each client, marks the nofollows, marks which links are keyword anchors, and marks which domains have already been disavowed (and also takes into account subdomains when you have disavowed the full domain.) It also tells me whether or not each domain is my list of tens of thousands of domains that I call my \"disavow blacklist\" and also my whitelist that contains domains that I know contains links not made for SEO purposes such as sites like alexa.com, aboutus.org, known dmoz scrapers and so on. This system saves me a huge amount of time, especially for those clients for whom we do regular backlink audits. I want to thank Moz for allowing me to mention this system. I am now making it available for others to use (for a fee). You can get more details here. The next step, once you have audited your links and determined which ones are ones that were made to manipulate Google, and are therefore unnatural, is to add these sites to your disavow file. You almost always want to disavow these domains on the domain level. This means including \"domain:example.com\" rather than \"http://www.example.com/page1.html\". Once this is done, add these domains to your existing disavow file and upload it to the disavow tool. Don't worry...there is no harm in submitting regular disavows.Summary I have covered a lot of info in this post and hopefully I haven't confused too many people. The topic of negative SEO really is a tough one to understand. On one hand Google says, \"Don't worry about it.\" But, on the other hand they tell us that although it shouldn't be a problem, it's not a bad idea to disavow any spam links you find pointing to your site even if you didn't make them. Here are the takehome points of this article: Not everything that looks like negative SEO is negative SEO. All sites have weird links pointing to them. Don't always assume that every odd looking link is one that a competitor has made. A sudden influx of odd links very well could be an attack. In most cases, if a site does get attacked by a competitor pointing spammy links at them, Google's algorithms will just ignore those links and you won't see a drop in rankings. If you are in a hyper-competitive niche then you are much more likely to fall victim to a sophisticated negative SEO attack. If you have a history of doing a lot of unnatural linking yourself then you could fall victim as well, as Google may not be able to tell the difference between your unnatural links and the attack links. Sites that are not in a competitive niche and have not been engaging in manipulative linking, most likely do not need to worry about negative SEO. In any case, if you think you are under a negative SEO attack, it is a good idea to audit your links regularly and submit a disavow file. Negative SEO always brings up interesting discussion. Have you been a victim? Do you do monthly audits? Do you feel that Google is good at preventing negative SEO? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Negative SEO: Should You Be Worried? If Attacked, What Should You Do?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Negative SEO: Should You Be Worried? If Attacked, What Should You Do?"
    },
    {
      "level": "H2",
      "text": "What is negative SEO?"
    },
    {
      "level": "H2",
      "text": "Does negative SEO really work?"
    },
    {
      "level": "H2",
      "text": "Examples of things that are NOT negative SEO"
    },
    {
      "level": "H3",
      "text": "Example #1: \"Weird\" links are not necessarily bad links"
    },
    {
      "level": "H3",
      "text": "Example #2: Sitewide links are not all bad links"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Example #3: Your old habits are coming back to haunt you"
    },
    {
      "level": "H3",
      "text": "Example #4: A well-meaning employee or friend is building you links"
    },
    {
      "level": "H3",
      "text": "Example #5: A previous SEO made these links"
    },
    {
      "level": "H3",
      "text": "Example #6: You've been hacked"
    },
    {
      "level": "H2",
      "text": "Signs of things that COULD be negative SEO"
    },
    {
      "level": "H2",
      "text": "Should you worry about negative SEO?"
    },
    {
      "level": "H2",
      "text": "How can you protect yourself from negative SEO?"
    },
    {
      "level": "H3",
      "text": "How to do your backlink audit"
    },
    {
      "level": "H2",
      "text": "Summary"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Marie Haynes\n          \n            Marie Haynes\n          \n            Marie Haynes"
}