{
  "url": "https://moz.com/blog/presenting-seo-projects-whiteboard-friday",
  "slug": "presenting-seo-projects-whiteboard-friday",
  "title": "Practical Tips for Presenting SEO Projects to Executives — Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Any time you have to present your SEO work to other departments or executives, you're going to have different groups of stakeholders with different interests, so you need to approach them differently. To help you, Bethan walks you through her top five tips for sharing your work with the C-suite.",
  "content": "Practical Tips for Presenting SEO Projects to Executives — Whiteboard Friday Whiteboard Friday | Marketing Psychology By: Bethan Vincent April 14, 2023 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Bethan Vincent April 14, 2023 Practical Tips for Presenting SEO Projects to Executives — Whiteboard Friday Whiteboard Friday | Marketing Psychology The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Any time you have to present your SEO work to other departments or executives, you're going to have different groups of stakeholders with different interests, so you need to approach them differently. To help you, Bethan walks you through her top five tips for sharing your work with the C-suite. Click on the whiteboard image above to open a high resolution version in a new tab! Video Transcription Hi. So my name is Bethan Vincent, and I'm the Managing Partner at Open Velocity and I'm here to talk to you about how to deliver better presentations to executive stakeholders. 1. Set the groundwork So we're going to start off with a tip that kind of occurs pre-presentation, and essentially it's setting the groundwork to understand your stakeholders. In any situation, you're going to have different groups of stakeholders with different needs and different stakes, and you want to approach them slightly differently. So I love a magic quadrant. So here we've got one that basically shows you within any decision-making process you've got people with high influence and low influence. Stakeholders can be individuals or groups of individuals. Keep that in mind. You've then got people or groups with a high stake, so they've got a high kind of interest in the outcome of the decision, and people with a lower stake. So essentially in any process, you want to divide and conquer, and this is something I advise you do. Don't spend loads of time on it. It's more a thought exercise. You can do it on the back of a napkin. But think about who are the people with high influence and low stake, because those people are very interesting and they can be your champions in the decision-making process, because essentially you can leverage their influence. I would be as explicit to go and speak to the individual or group of individuals that I think fall in my champions box and say, \"Hey, would you champion this decision? Would you help it get pushed through? This is what it's going to mean for you. This is what it's going to mean for the organization.\" You've then got the high influence and high stake groups, and those are the people that really you want to spend the majority of your time on engaging, persuading, and inspiring. Essentially, you want to show them: How is this decision, how is what I'm proposing going to be better for them? How is it going to produce better outcomes? How is it going to contribute to revenue for the company? How is it going to contribute to something tangible? So spend a lot of time with those people, because ultimately, actually, if you can't get it past your kind of priority stakeholders, the decision is probably not going to go in your favor. So you've then got the people with a high stake and low influence. This, I'm afraid, is often marketing, especially when it comes to projects like, let's say, CRM changes. We love a surprise CRM change. Essentially with this group, you do want to consult them because the impact of the decision is going to be so high on them that you want to consult them and make sure that you're not really frustrating them, you're not going to introduce something that makes their life, their work unworkable. You've then got your kind of low stake, low influence group, and those are people you want to inform and you want to basically monitor their kind of feedback on the proposed decision because you might actually find those people that you think are low stake and low influence move into one of these groups when you fully get to the bottom of actually what their work is, what are they trying to achieve. So that's something to be mindful of. So set your groundwork. Engage people pre-presentation. Get those champions on side. 2. Keep it succinct So secondly, when you come to present to executive stakeholders, and whether this is a formal presentation with a whiteboard and slides and all of that kind of stuff, or whether it's in a meeting and you're just proposing an idea, I want you to keep this slightly weirdly named BORA acronym in mind. So you want to keep it succinct. Any presentation, any kind of pitch to senior stakeholders, you want to keep it really digestible and understandable. The way I like to structure my kind of presentation, or even if it's a document that I'm presenting to senior stakeholders, is I'll start off with the background, start off with the context, paint the picture. I'll then get straight to the opportunity. So what tangible thing is on the ground? What can we actually get out of making this decision? How is it going to impact the company? How is it going to drive revenue? Then you want to move on to the request, and I think this is something that people often miss out of presentations. So that they'll kind of set the background, set the opportunity, and then kind of leave it up to the senior stakeholder to kind of figure out what they're asking for. Be really explicit. What is your ask? Is it budget? Is it resource? Is it a decision to be made? Then finally, stick all of your appendices with this information. If people want to go into detail, make sure they've got the data, make sure they've got the contextual stuff on hand, but don't try and get through all of it within a meeting, because frankly you're just not going to be able to get through all of the nuance of the material within a tight time frame because I think it's fair to say that when you're presenting to senior stakeholders, their time is often really precious, and if you've got an hour or half an hour for the presentation, frankly that's all you've got, so you need to keep it very, very time-bound. 3. Anticipate interruptions This brings me on to point number three. You've got to anticipate interruptions. So I think a lot of us have been in meetings with senior stakeholders where we've started off doing our presentation, doing our pitch, and we've been interrupted with questions. A lot of people find this quite frustrating. You know what? To some degree it is a little bit frustrating, but I think we've got to understand that senior stakeholders are often questioning stuff because they're really invested, they're interested, they're trying to dig into things a little bit deeper. Actually, there's nothing worse than doing a presentation to senior stakeholders and there is tumbleweed and silence. That's a worse sign. So the very fact you're getting those questions is excellent. But you've got to anticipate them. You've got to build them into the meeting structure. So again, this comes back to keeping it succinct. Start off with the background and your opportunity, maybe in kind of 5 or 10 slides, or a one-page document. But then give that space for those questions to happen and just anticipate. It is going to. You can't fight against it. But then also at the end of the meeting, you've got to bring it back around to the request, because again, if you've been derailed, some people run out of time, oh my gosh, I've got five minutes left, or have run out of time and those people have got to go and they've not got anything out of the discussion. So anticipate interruptions. Bring it back to that request. You've got to know your request, know your ask before you're going into the meeting. 4. Weekly updates We're going to move on to a point that's linked with almost my first point, which is about setting that groundwork and before you kind of do your proposal or your presentation, making sure you understand the stakeholders, you understand the landscape. You've done some of that pre-work. After you've done the meeting, I think there's a lot of kind of post-decision work. So hopefully you've got the decision. You want to basically keep people abreast of the good work you're doing. What I love to do is send around a weekly update. It's a really super short email I'll put together, or it can go on an internal wiki, for example, as well, if you've got that. But I'll send it to the wider organization, not just stakeholders, and it keeps people abreast of the good work you're doing. It can be as simple as a summary, so this is what's happened this week, a little bit of, again, setting the background, and then a bulleted list of updates. This is what we've done. These are the results we've achieved. These are the things we've launched. You may not have loads of stuff that you've launched. It could just be this is what the team has been doing. This is what they've enjoyed working on. It doesn't have to be really in-depth or anything like that or anything scary. Then finally, this is the most important point of this communication -- close with an invitation to engage. I've done these before and sent them around organizations and sent them to developers and engineers, and actually opening that door and saying like, \"Look, this is what Marketing is up to. These are some of the things we've been doing. These are some of the results, the outcomes we've got. Hey, does anyone have any questions or thoughts on them?\" It invites that conversation, and it really helps you kind of nurture your internal audience. We're very good at nurturing external audiences, but I think we can do better internally as well. 5. Why I pass Finally, I just wanted to kind of give a little bit of context on why I'm now relatively, well, pretty senior in my career, I run a company, and why I pass sometimes on things my team brings to me. So firstly, I pass on stuff because frankly I don't understand it. I think there's this kind of misconception that people in really senior positions know everything. We definitely don't. Especially when we're dealing with specialists, like SEO specialists, you've got a whole depth and contextual information that I may not have. So sometimes I just don't get it. I don't get what I'm supposed to do here. I don't get the context. I don't get the background. So then that goes back to keeping it succinct. Secondly, I just simply don't have time or budget. I think when people are kind of proposing and ask, that they've got a proposal to do something, they might put in the budget cost of it, they might put in the financial cost of it, but they don't necessarily recognize that there's a time cost. Budget and time are the two things that are very, very finite within an organization. So have a little bit of a think about the time implication and what you're asking for and does the organization have the resource to deliver on that. So sometimes, yeah, I just don't have time and I don't have the budget for it. Thirdly, I don't see the big picture. What I mean by this is you're pitching something to me, and I don't understand or I can't make the link between what you're pitching and our organizational goals, our business goals. This is where it's really important, even if you're an SEO specialist, PPC specialist, whatever, that you understand that organizational objective that you all should be working towards. Any good business should have a business plan and should be able to communicate that to you. So wherever possible, make sure what you're proposing fits into that bigger picture. Then finally, I just don't see how this is going to make us money. Businesses exist to make money. We live in a capitalist world. We kind of can't fight against that. So sometimes I just can't see the route to ROI. I don't necessarily have to see the direct route. It doesn't have to be we are guaranteed this ROI within this time period. I do understand, especially in things like SEO where it takes time, there's a lot of unknowns, that it can be a bit more intangible. But I need to be able to see the causal link. If I can't see that, I'm not going to sign it off. So I hope that's given you some context about how to approach those conversations with senior decision-makers. Thank you. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Practical Tips for Presenting SEO Projects to Executives — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Practical Tips for Presenting SEO Projects to Executives — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "1. Set the groundwork"
    },
    {
      "level": "H2",
      "text": "2. Keep it succinct"
    },
    {
      "level": "H2",
      "text": "3. Anticipate interruptions"
    },
    {
      "level": "H2",
      "text": "4. Weekly updates"
    },
    {
      "level": "H2",
      "text": "5. Why I pass"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon ticket!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    }
  ],
  "author": "Bethan Vincent\n          \n            Bethan Vincent\n          \n            Bethan Vincent"
}