{
  "url": "https://moz.com/blog/presentation-skills-for-seo",
  "slug": "presentation-skills-for-seo",
  "title": "Presentation Skills for SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Good presentation skills are essential in the SEO industry. As well as the multitude of conferences that feature so prominently in our industry, we are also often called on to present SEO clearly (and favourably!) to potential clients and skeptical CEOs.",
  "content": "Presentation Skills for SEO SEO Events L By: LucyLangdon March 24, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! L By: LucyLangdon March 24, 2009 Presentation Skills for SEO SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Good presentation skills are essential in the SEO industry. As well as the multitude of conferences that feature so prominently in our industry, we are also often called on to present SEO clearly (and favourably!) to potential clients and skeptical CEOs. Having submitted an ambitious number of pitches to SMX London, several of Distilled attended an excellent seminar on presentation skills last week. I want to share a few of the things that we learnt, as well as some further thoughts we've had on the subject since then. First and foremost, three nuggets of practical advice from the presentation last week: 1. Devise a good presentation We were taught about the GOER model, devised by a presentation guru called James Caplin. I suggest you go and read more around it, but here's a brief run-down... Goal - take time to learn exactly what you and your audience want to achieve from your presentation. The best way to do this is to pick up the phone, go for a coffee, go for a stroll or whatever and just ask them. Outline - brain dump everything you could ever possibly want to talk about around the subject and then dig through it, picking out the bits that correspond with what you learnt in step one. My advice on this is be ruthless. You'll know more than you could possibly talk about so don't try and cover it all; there'll always be other opportunities. Elaborate - Pick out an outline from the ruthlessly thinned brain dump above and then get creative. Give yourself time to daydream about the best possible things you could say in this presentation and work them into the outline. The more individual your presentation, the more chance you have of delivering something really special. Refine - Time for the red pen. Remembering that less is more, go through and refine your presentation so that everything in there deserves to be. 2. Think about your audience Audiences come in all shapes and sizes, but it's worth bearing the following in mind whoever you're presenting to. Apparently, there are four types of people that make up an audience. We were advised to try and cater for all four categories in our presentations. Which one are you? Participation - these people want to put their hands up, be asked questions and just generally get involved. Even rhetorical questions will do the job. Personal - these people love to feel like they're connecting on a personal level. Walk around, tell a story or paint a picture on how the stuff you're talking about affects them. Scientific/factual - graphs, statistics, diagrams: you know the score. Observe and reflect - these folk won't get involved or interact; they need time and space to take on board what you're saying before they risk a response. As well as these four groups, we also learnt about the three 'representational systems' you might find in an audience. You can take a test here to find out which of these you are. Visual - respond to words like see, look, watch, picture, glimpse, etc. Use phrases like “I see what you're saying.” Auditory - respond to words like hear, say, click, voice, ring, etc. Use phrases like “that rings a bell.\" Kinaesthetic - respond to words like touch, handles, throw, shock, grip, impact, etc. Use phrases like “That feels about right to me.” 3. Get confident We learnt quite a few tips on how to get confident before and during presentations. My favourite is a subliminal message you can send to the audience by pointing to yourself when you use a word describing something positively. For example, if you were to say, “Reputation Monitor is just so fantastic,” point to yourself (it doesn't have to be that obvious) when you say the word 'fantastic'. Sounds a bit far fetched? Maybe, but I think it's worth a go. Particularly as so many of you are fantastic. How important is content? As with online, content is hugely important in a presentation. However, the style of your presentation is just as, if not more, important. We've all attended presentations, in SEO or otherwise, that are chocka-block full of excellent content but that are so poorly presented it's nigh on impossible to stay focused and take anything away. Similarly, I can think of several presentations which I've enjoyed immensely at the time but, in retrospect, taught me very little. I'm not saying we should all take crash courses in bullsh*t, but it's definitely worth appreciating how far style can go towards making or breaking a presentation. SEO Presentations Finally, I want to talk about these points in relation specifically to our industry, whether you're doing the keynote at SMX or persuading your CEO that SEO isn't snake oil. Let's run a link building presentation through the GOER gauntlet. Goal: Find out what your audience wants from this link building presentation. If it's SMX Advanced, you don't need to explain why links are important; if it's a potential client, there's every chance they won't even know what a link is. Outline: You'll know more about link building than you could possibly imagine. Get it all out of your brain and onto some paper and now, based on what you learnt in 'Goal', go through and pick out the really useful stuff. Build a presentation around those points; they're the important bit, after all! Elaborate: Got a personal story about link building? Or an original idea about it? Make sure you make space for this in your talk because it's probably what your audience will remember you for. Refine: Be realistic. There's no way you can talk about all those link building techniques in a 20 minute slot. Focus on precisely what you want to cover and do it well. You'll often have to cover a lot of technical information in these presentations. For those of you that fall into the 'scientific/factual' group above, taking in this information is a walk in the park. For the rest of us, it can be a bit of mission. Take time to put your tech stuff in a format that works for all - use big, clear diagrams and, if possible, illustrate each key point you make. SEOmoz is actually a great source of examples for this. How often does Rand use some kind of diagram or chart in his Whiteboard Fridays? And who will ever forget Googlebot? It's also important to use specific examples in these kind of tech/jargon-heavy presentations. For example, if you can show your audience a real life example of link building in action, they're much more likely to believe you and recall what they've learnt once the session is over. In the same way, you should offer further resources for those skeptical audience members in group 4; give them something to go away and think about. Lastly, this isn't about presentation skills... but while I'm here, don't forget to make the most out your presentation: do a follow up blog post about it and link to your slides; make sure you blog about anything new that was thrown up in the presentation and, if possible, contact anyone that spoke to you about your session. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Presentation Skills for SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Presentation Skills for SEO"
    },
    {
      "level": "H2",
      "text": "1. Devise a good presentation"
    },
    {
      "level": "H2",
      "text": "2. Think about your audience"
    },
    {
      "level": "H2",
      "text": "3. Get confident"
    },
    {
      "level": "H2",
      "text": "How important is content?"
    },
    {
      "level": "H2",
      "text": "SEO Presentations"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "LucyLangdon\n          \n            LucyLangdon"
}