{
  "url": "https://moz.com/blog/preventing-linkbased-penalties-whiteboard-friday",
  "slug": "preventing-linkbased-penalties-whiteboard-friday",
  "title": "Preventing Link-Based Penalties - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "At the end of February, Google announced that it was updating its search algorithm to serve higher-quality results to searchers. The update has since been dubbed the \"Farmer Update\" due to the algorithm's new bias against what Google considers \"sites which are low-value add for user...",
  "content": "Preventing Link-Based Penalties Whiteboard Friday By: Aaron Wheeler March 10, 2011 Table of Contents Copied! By: Aaron Wheeler March 10, 2011 Preventing Link-Based Penalties Whiteboard Friday At the end of February, Google announced that it was updating its search algorithm to serve higher-quality results to searchers. The update has since been dubbed the \"Farmer Update\" due to the algorithm's new bias against what Google considers \"sites which are low-value add for users, copy content from other websites or sites that are just not very useful.\" Translation: if you own www.how-to-rank-better-by-reading-these-articles-i-stole.com, things aren't going to be looking as peachy-keen as they may have been beforehand! In this week's Whiteboard Friday, Rand shows how to avoid being penalized by Google for suspicious linkage and having your rankings slip or completely disapparate as a result. He uses the example from the SEOptimise blog of What Happens When You Build 10,00 Dodgy Links to a New Domain in 24 hours. Hint: if you do own the aforementioned domain, you may want to reconsider your users' needs - for at least a couple of reasons. Video Transcription Howdy, SEOmoz fans! Welcome to another edition of Whiteboard Friday. Today we're talking about preventing link-based penalties. So, a lot of you have likely experienced the kind of thing that I am talking about. Whether you are a consultant or you are in-house, you're working at an agency, or you're just kind of tuning on your own site, you've seen this problem of the temptation to build, buy, borrow, beg, steal lots of links that are questionable in quality and value. I want to share with you a quick story before we get started here. The blog SEO Optimize wrote a great piece about an experience they had in building these types of links. They started with a traffic graph of what had happened with their site. They put the new site on the Web. It's a relatively new site. They were growing sort of slowly and steadily. The spikes were a little bit lower than the valleys every week. They were sort of growing and growing. Then they decide, you know what, why don't we buy/build 10,000 dodgy links. I love the British because they use much better -- hi, everyone in London -- they use much better language. So, they go to these dodgy neighborhoods, maybe the East End, that's where it's dodgy, right? They build some links. They built 10,000 of these links. That's a lot. I think I should put a \"whoa\" there. Spell whoa. So, they build 10,000 dodgy links in this period, and what happens to their Goggle traffic? Shoots up. Skyrockets. Look at that. Insane growth. They, in fact, more than 5Xd their Google traffic, at least according to the graph that I was looking at on their blog post. You can see that it actually stayed like that for a few weeks. Google clearly not catching these links. I love the description that the blog post has. What he says is, \"Just as I was beginning to worry that Google couldn't recognize this kind of crap, pow.\" It just drops down. It dropped down to a level so low that it was below the prior level of traffic, and essentially all they were getting here is branded terms, so people literally searching for that website itself. They're not ranking for any of their old keywords. These links aren't just not helping them, they are actively hurting them and preventing them from ranking, and it has been going on like that. The moral of the story is invest in low quality links and temporarily you may see some benefit, but for the long term it can be quite harmful. You might be thinking to yourself, wait a minute, if this is the profile of how Google operates, couldn't I just build 10,000 dodgy links to all my competitors? Let's back up in time and remember that this is a new site. This is a new domain. They are likely looking at the profile of this site and saying, \"Hey, they haven't built up a reputable, important, powerful brand yet. So it is much more likely that links can hurt them dramatically than it is a site that's been around a little while.\" That being said, there's likely many of you, possibly some of you even watching this video, who have sites like this or have friends with sites like this, clients with sites like this, and so you are wondering how can I prevent this kind of potential if I have seen that they did acquire some dodgy links, I did maybe acquire some dodgy links, I am considering it, or I am worried that my client did, I am worried the previous SEO did -- remember the case study with JCPenney and losing all their rankings because of the ins and outs of how Google measured them. You might want to be thinking, boy, I am in this period right now, maybe I am in that grace area. How can I prevent this from happening to me? The first thing that I want to ask you to do is to ask yourself why. Not why are you going to get penalized. Why do you deserve to be ranking number one? Why do you deserve to be in the top few sites for these particular queries? Is it that you have the best product out there? Do you have the most innovative UI, the most usable format for it? Do you have the highest quantity of information? Are your user reviews the best that they could be? Is it the fact that you have access to data that no one else has? There has to be a unique value proposition for any given business and that includes a web-based business model. If you don't have this, then, yeah, you're only option to get links, to get references, is to go to those dodgy neighborhoods because no one is going to organically want to link to you editorially and say, \"I endorse and recommend this particular business.\" Once you have answered that question, I need you to focus on content. Well, I don't need it. You need it. You need you to focus on content because content is where those links are going to come from. In the absence of a reason apart from money or manipulation or some type of a personal relationship, the only way to get good reference links, good editorial links on the Web is to be the best resource for that particular query. Being that resource means content. I don't just mean text. I mean everything. I mean images and video. I mean other forms of content like user generated material. I mean things like the interface that you're putting on it, the UI that surrounds it. I even mean things like the humans, the people in the real world that are associated with creating that content. Having the authority and the credibility that comes from a big name in your particular field, which could be a very small field and a very unknown person to most of the rest of us, still matters quite a bit. The third thing that I would do is go look at the top link sources to brands. So, where a lot of SEOs get into trouble is that you go and you look at the links that are pointing to the people who are ranking number 1, number 2, number 3, maybe top 10. A lot of them might be in this neighborhood. They might be the type of people who have built links for the short term, and they are ranking in the short term and Google is eventually going to catch up with them, which is why I encourage you to go find the brands. Those particular sites/pages that have built up authority, not just in the search results through links but in the equity that is built through mindshare, through branding, through knowledge of that website, and those brands will often have references to them that come from very good places. If you look at their top links using Open Site Explorer, using something like the Link Intersect tool, if it is a local site you could use Ontolo Whitespark's Link Finder, which I think is a great tool as well, even doing searches like, if I do a search query, let's say that I see a brand like O'Neill who makes surfboards and surf equipment and that kind of stuff, right. So, I might do a search like, \"Where is O'Neill - site: O'Neill.com?\" What I am doing here when I am searching Google like this, is I say, \"Show me all the places where this brand is mentioned that is not on their website.\" That will show you a bunch of places that are talking about that brand. Those types of mentions often lead to links, often lead to references, build that brand's equity, build that brand's awareness and knowledge. Those are probably really good places to get links. Number four, finally, and this one might even be a priority depending on how nervous you are that this is about to happen. You want to clear out the worst links. This means digging into your link profile and identifying anything that looks especially manipulative. Sometimes those huge long lists of reciprocal link pages, where you're pointing to everybody else and they're all pointing to you, that might be a good thing to clear out. You might want to e-mail your link partners and say, \"Hey guys, sorry, but I think Google might really jump on us about this. I need to get rid of those.\" You might want to go and dig through any link brokers or buyers that either you have engaged with or the client previously engaged with or who knows, whoever was working on the site before you engaged with, your evil alter ego fight club style Tyler Durden worked on. You know, a guy gets up in the middle of the night, never know what he's going to do. Finding those links. Clearing them out. Getting rid of the ones that you can. Don't panic. Bad links aren't always going to hurt you. Everyone on the Web has some bad link pointing to them. Scrapers. Back in college, I built some bad links when it was late at night. That happens to everyone. It's okay. But, if you can find the worst of those, you are going to prevent some of these penalties. If you can find those really good ones, you build up that profile that protects yourself from some of this negative stuff. All right everyone. I hope you've enjoyed this edition of Whiteboard Friday and hope we'll see you again next week. Take care. Video transcription by SpeechPad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Preventing Link-Based Penalties"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Preventing Link-Based Penalties"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Aaron Wheeler\n          \n            Aaron Wheeler\n          \n            Aaron Wheeler"
}