{
  "url": "https://moz.com/blog/prioritize-seo-tasks",
  "slug": "prioritize-seo-tasks",
  "title": "How to Prioritize SEO Tasks [+Worksheet] - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Five tips for prioritizing your SEO work: setting specific goals, identifying important pages for conversions, uncovering technical opportunities via a site crawl, time management, and providing consistent benchmarks and reporting.",
  "content": "How to Prioritize SEO Tasks [+Worksheet] SEO Basics | SEO Consulting By: Britney Muller September 21, 2017 Table of Contents Copied! By: Britney Muller September 21, 2017 How to Prioritize SEO Tasks [+Worksheet] SEO Basics | SEO Consulting “Where should a company start [with SEO]?” asked an attendee after my AMA Conference talk. As my mind spun into a million different directions and I struggled to form complete sentences, I asked for a more specific website example. A healthy discussion ensued after more direction was provided, but these “Where do I start?” questions occur all the time in digital marketing. SEOs especially are in a constant state of overwhelmed-ness (is that a word?), but no one likes to talk about this. It’s not comfortable to discuss the thousands of errors that came back after a recent site crawl. It’s not fun to discuss the drop in organic traffic that you can’t explain. It’s not possible to stay on top of every single news update, international change, case study, tool, etc. It’s exhausting and without a strategic plan of attack, you’ll find yourself in the weeds. I’ve performed strategic SEO now for both clients and in-house marketing teams, and the following five methods have played a critical role in keeping my head above water. First, I had to source this question on Twitter: How do you prioritize SEO fixes?— Britney Muller (@BritneyMuller) September 15, 2017 Here was some of the best feedback from true industry leaders: Murat made a solid distinction between working with an SMBs versus a large companies: This is sad, but so true (thanks, Jeff!): To help you get started, I put together an SEO prioritization worksheet in Google Sheets. Make yourself a copy (File > Make a copy) and go wild!: Free SEO prioritization workflow sheet TLDR; How to prioritize SEO? Agree upon & set specific goals Identify important pages for conversions Perform a site crawl to uncover technical opportunities Employ Covey's time management grid Provide consistent benchmarks and reports #1 Start with the end in mind What is the end goal? You can have multiple goals (both macro and micro), but establishing a specific primary end goal is critical. The only way to agree upon an end goal is to have a strong understanding of your client’s business. I’ve always relied on these new client questions to help me wrap my head around a new client’s business. [Please leave a comment if you have other favorite client questions!] This not only helps you become way more strategic in your efforts, but also shows that you care. Fun fact: I used to use an alias to sign up for my client’s medical consultations online to see what the process was like. What automated emails did they send after someone made an appointment? What are people required to bring into a consult? What is a consult like? How does a consult make someone feel? Clients were always disappointed when I arrived for the in-person consult, but happy that my team and I were doing our research! Goal setting tips: Measurable Seems obvious, but it’s essential to stay on track and set benchmarks along the way. Be specific Don’t let vague marketing jargon find its way into your goals. Be specific. Share your goals A study performed by Psychology professor Dr. Gail Matthews found that writing down and sharing your goals boosts your chances of achieving them. Have a stretch goal \"Under-promise and over-deliver\" is a great rule of thumb for clients, but setting private stretch goals (nearly impossible to achieve) can actually help you achieve more. Research found that when people set specific, challenging goals it led to higher performance 90% of the time. #2 Identify important pages for conversions There are a couple ways you can do this in Google Analytics. Behavior Flow is a nice visualization for common page paths which deserve your attention, but it doesn’t display specific conversion paths very well. It’s interesting to click on page destination goals to get a better idea of where people come into that page from and where they abandon it to: Reverse Goal Paths are a great way to discover which page funnels are the most successful for conversions and which could use a little more love: If you want to know which pages have the most last-touch assists, create a Custom Report > Flat Table > Dimension: Goal Previous Step - 1 > Metric: Goal Completions > Save Then you’ll see the raw data for your top last-touch pages: Side note: If the Marketing Services page is driving the second most assists, it’s a great idea to see where else on the site you can naturally weave in Marketing Services Page CTAs. The idea here is to simply get an idea of which page funnels are working, which are not, and take these pages into high consideration when prioritizing SEO opportunities. If you really want to become a conversion funnel ninja, check out this awesome Google Analytics Conversion Funnel Survival Guide by Kissmetrics. #3 Crawl your site for issues While many of us audit parts of a website by hand, we nearly all rely on a site crawl tool (or two) to uncover sneaky technical issues. Some of my favorites: Moz Pro Screaming Frog DeepCrawl Raven I really like Moz Pro, DeepCrawl, and Raven for their automated re-crawling. I’m alerted anytime new issues arise (and they always do). Just last week, I got a Moz Pro email about these new pages that are now redirecting to a 4XX because we moved some Learning Center pages around and missed a few redirects (whoops!): An initial website crawl can be incredibly overwhelming and stressful. I get anxiety just thinking about a recent Moz site crawl: 54,995 pages with meta noindex, 60,995 pages without valid canonical, 41,234 without an <h1>... you get the idea. Ermahgerd!! Where do you start?! This is where a time management grid comes in handy. #4 Employ Covey's time management grid Time management and prioritization is hard, and many of us fall into \"Urgent\" traps. Putting out small, urgent SEO fires might feel effective in the short term, but you’ll often fall into productivity-killing rabbit holes. Don’t neglect the non-urgent important items! Prioritize and set time aside for those non-urgent yet important tasks, like writing short, helpful, unique, click-enticing title tags for all primary pages. Here’s an example of some SEO issues that fall into each of the above 4 categories: To help prioritize Not Urgent/Important issues for maximum effectiveness here at Moz, I’m scheduling time to address high-volume crawl errors. Moz.com’s largest issues (highlighted by Moz Pro) are meta noindex. However, most of these are intentional. You also want to consider prioritizing any issues on the primary page flows that we discovered earlier. You can also sort issues by shallow crawl depth (fewer clicks from homepage, which are often primary pages to focus on): #5 Reporting & communication Consistently reporting your efforts on increasing your client’s bottom line is critical for client longevity. Develop a custom SEO reporting system that’s aligned with your client’s KPIs for every stage of your campaign. A great place to start is with a basic Google Analytics Custom Report that you can customize further for your client: New Google Analytics User Starter Bundle Content Analysis Dashboard Content Efficiency Report Occam’s Razor Awesomeness While traffic, search visibility, engagement, conversions, etc. get all of the reporting love, don’t forget about the not-so-tangible metrics. Are customers less frustrated navigating the new website? How does the new site navigation make a user feel? This type of monitoring and reporting can also be done through kickass tools like Lucky Orange or Mechanical Turk. Lastly, reporting is really about communication and understanding people. Most of you have probably had a client who prefers a simple summary paragraph of your report, and that’s ok too. Hopefully these tips can help you work smarter, not harder. Don’t miss your site’s top technical SEO opportunities: Crawl your site with Moz Pro Already have an account? Log in here Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Prioritize SEO Tasks [+Worksheet]"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Prioritize SEO Tasks [+Worksheet]"
    },
    {
      "level": "H4",
      "text": "TLDR;"
    },
    {
      "level": "H2",
      "text": "How to prioritize SEO?"
    },
    {
      "level": "H2",
      "text": "#1 Start with the end in mind"
    },
    {
      "level": "H3",
      "text": "Goal setting tips:"
    },
    {
      "level": "H4",
      "text": "Measurable"
    },
    {
      "level": "H4",
      "text": "Be specific"
    },
    {
      "level": "H4",
      "text": "Share your goals"
    },
    {
      "level": "H4",
      "text": "Have a stretch goal"
    },
    {
      "level": "H2",
      "text": "#2 Identify important pages for conversions"
    },
    {
      "level": "H2",
      "text": "#3 Crawl your site for issues"
    },
    {
      "level": "H2",
      "text": "#4 Employ Covey's time management grid"
    },
    {
      "level": "H2",
      "text": "#5 Reporting & communication"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Britney Muller\n          \n            Britney Muller"
}