{
  "url": "https://moz.com/blog/prioritizing-technical-seo-fixes",
  "slug": "prioritizing-technical-seo-fixes",
  "title": "Prioritizing Technical SEO Fixes - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Today, Ola takes you through the technical SEO fixes that should be at the top of your SEO audit list.",
  "content": "Prioritizing Technical SEO Fixes Whiteboard Friday | Technical SEO By: Ola King October 8, 2021 Table of Contents Copied! By: Ola King October 8, 2021 Prioritizing Technical SEO Fixes Whiteboard Friday | Technical SEO Faced with so many SEO tasks to worry about, how do you know which ones to prioritize? In today's episode of Whiteboard Friday, Ola takes you through the important technical SEO fixes that should be a the top of your audit list. Click on the whiteboard image above to open a larger version in a new tab! Video Transcription Hi, Moz fans. I'm Ola King. I work here at Moz, and I'm excited to join you today for another edition of Whiteboard Friday. Today we'll be talking about prioritizing SEO fixes. By now, you are probably already familiar with the concept of technical SEO, and if you aren't, there are a bunch of resources out there, including the Moz blog and other sites that you can check out. But technical SEO is probably the most important part of SEO because if you have the best content on the web, you have the most backlinks, if your site is not technically sound, then you might not be able to get the best results from all of your efforts. So your technical SEO is really the foundation of everything else you do. There's a bunch of tools, like Sitebulb, Moz Pro, and Screaming Frog, that can allow you to analyze your technical SEO issues involved. But once you have the list of the issues, you might not always know how to prioritize your effort. So today's session is to help you have a better handle on that once you have a list of those issues. Indexing For your technical SEO, the first thing the search engines will do towards your website is really to crawl it. So you want to make sure that you have your sitemap set up correctly, and then you have to make sure that your robots.txt is set up correctly so that the search engines can crawl your most relevant pages on your site. Pages to index But once they've crawled your site, you want to ensure that the crawl budget is spent towards indexing the relevant pages on your site. So today we'll cover the pages that you should be indexing, and we'll also then talk about how you can fix those pages or how to prioritize your efforts towards fixing those pages. So the first thing, index. The pages that you should be indexing are really pages that are important towards your business. So what's your KPI, what's going to drive leads to your site, what's going to drive traffic, or are there strategic pages that you're trying to get more results from, start with that. Know what those are and those are the things that you want to make sure that are indexed. Of course, the larger your website, the more you have to pay attention to these. Maybe on your own, when it's a brand-new site, it's okay to index everything initially. But as your site grows, you might want to be more careful with that. Of course, you don't want to index all the private and sensitive pages. So think of your login page, privacy policy pages. They should exist on your site, of course, but they don't need to be indexed. So you want to ensure that meta no-index is set up for those pages, and you can do that from the source by setting up your robots.txt to ensure that those pages are not even crawled in the first place. So the pages that you should prioritize, in terms of indexing for your site, are the high traffic value pages. So these are pages that either you want to get more traffic towards or are already getting lots of traffic, and they could also be pages that might not be getting lots of traffic, but they are strategic in terms of they bring quality traffic to your website or you expect them to bring quality traffic to your site. Then high links value. You want to ensure that the pages that are positioned on your website to drive links are indexed. Or if they are already driving links, you don't want to mess up that aspect. You can use, once again, tools like Moz Pro to analyze pages that are getting links on your site. So you can use the Link Explorer for that. Make sure that you're not messing up pages that are driving value to other pages as well. So even if they don't have external links, if they are important in terms of internal links, they are important to you to index as well. High keyword value as well. If a page is getting a lot of your keywords, you want to ensure a page like that is indexed as well. The role in the user journey. Some pages might not have much SEO value, but they are still very useful to your user journey. So think of like your help pages. They probably won't rank for a lot of keywords, to be honest. However, if your customer goes to the search engine and searches for a solution to something, you want to direct them to those help pages, and you want to ensure that they are finding those easily. So not a lot of SEO value in the traditional sense, but it's still very useful towards your user journey. Also pages that are placed in a very prominent position on your site should be indexed as well, so your homepage. Most likely every link on your page should not lead to a dead end. It should lead customers towards the intended target, so no 404 errors on your homepage or other pages that are very important to your user journey. So a way to prevent that is you can set up a Google Analytics custom report so that any time there's an issue on a page like that, you are alerted quickly. So these are the pages that you should be indexing. If there's something that you think should be here, please let me know. This is not meant to be a perfect list. But this is based on my experience so far, what I've found, but you might know something that I don't. So please let me know. Prioritizing fixes So for the fixes, in terms of the fixes, this is how you should prioritize what you should fix. Prioritization factors So these are the prioritization factors. So once again: Page value: pages that are ranking, that are getting links, that are getting clicks, you should prioritize fixing those quicker than other pages.Pages that align with your priority or that would have impacts towards your KPI, you should probably prioritize those pages as well. Ranking potential: There are some pages that might not be doing quite well, but they have high ranking potential. So if a page is like on page 2 and you know that it's going after a keyword that is not so difficult, then you might want to prioritize fixing that page so that you can start getting results a lot quicker.Then by issue type as well. Some issues are worth going after and fixing quicker than other issues. The technical effort as well. Some issues are a lot easier to fix. If you're not technical, this is not for you to determine. You might want to talk to your developers and for them to estimate how hard or easy a page would be to fix. Prioritizing by issue type If you're technical, of course you can be the judge of that yourself. But in terms of the issues type, this is a list of the common issues and how to prioritize them: So you have the critical crawler issues. So you could have a server error or a broken page, so the 4XX pages or errors. Make sure you fix those immediately because they are impacting your user journey and potential rankings as well. The metadata issues as well. So things like missing descriptions, those are things you want to to fix next after the pages are already accessible. Redirect issues as well. No one wants a redirect chain. So make sure that's fixed after you fix your metadata issues. Content issues are minor tweaks here and there. So they are important, but they're very much low on your priority. So if you are finding like you don't have the right keyword, for example, in your URL, that might not always be very important to fix right away because the efforts to fix that might not be worth the result in the sense of just fixing a URL issue would actually result in doing an audit to make sure that you're not breaking anything else on your site. So for something that might not have a lot of impact, it is leading to a lot of work which is not super valuable to you. Conclusion So, yeah, these are the things that I consider when I'm fixing a site's technical issues. There are still many steps to this. We are not able to cover all of that due to the time constraint. But things like, for example, I mentioned the technical effort, so you might want to use things like T-shirt sizing, for example, to determine what issues are small, what are medium, large, extra large, and so on. Depending on your projects management tool, you might be able to set up a sorting function so that you are able to do this automatically. So once you upload your URLs, for example, into a Google Sheet, you can be able to set up a script that allows you, once you've selected the effort, the issue type, and the value to you, you should be able to sort that automatically as well, so this work is a lot quicker. But yeah, I would like to know what you think about this, and I would love to learn from you as well. All right. See you next time. Video transcription by Speechpad.com. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Prioritizing Technical SEO Fixes"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Prioritizing Technical SEO Fixes"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Indexing"
    },
    {
      "level": "H3",
      "text": "Pages to index"
    },
    {
      "level": "H2",
      "text": "Prioritizing fixes"
    },
    {
      "level": "H3",
      "text": "Prioritization factors"
    },
    {
      "level": "H3",
      "text": "Prioritizing by issue type"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    }
  ],
  "author": "Ola King\n          \n            Ola King\n          \n            Ola King"
}