{
  "url": "https://moz.com/blog/pro-seo-seminar-presentation-on-the-mayday-update",
  "slug": "pro-seo-seminar-presentation-on-the-mayday-update",
  "title": "PRO SEO Seminar Presentation on the MayDay Update - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The London SEO PRO seminar organised by our friends over at Distilled and SEOmoz was a fantastic success, all of the presentations were packed with helpful insights into both search, and the marketing industry as a whole.",
  "content": "PRO SEO Seminar Presentation on the MayDay Update SEO Events By: Martin Macdonald October 28, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Martin Macdonald October 28, 2010 PRO SEO Seminar Presentation on the MayDay Update SEO Events This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. The London SEO PRO seminar organised by our friends over at Distilled and SEOmoz was a fantastic success, all of the presentations were packed with helpful insights into both search, and the marketing industry as a whole.Particular thanks have to go out to Russell Smith from the BBC who made a great presentation on their digital marketing strategy, it was a real eye opener and its fantastic that the BBC attend events in our industry. My presentation was titled “SEO in competitive niches: Price Comparison”, with a particular slant towards the analysis that we carried out on the MayDay update. The slide deck is included below but I would like to mention a few things to put some context on the slides, as its tough to convey the message without the actual speech! The MayDay update was NOT in my view an overall algo update, rather it was a set of filters that have been applied to a specific subset of sites based on their architecture – and de-indexing any pages on those sites that were lacking in original content. After the presentation, check out my further insights: (you need to press play once to load the presentation – you will see a white screen first, then press play to go through the slides) Courtesy of MOGmartin’s SEO Forum.TO EMBED THIS PRESENTATION USE:<object id=”prezi_c238bc1c927364b27c1630c2c1a3fe9055d6c711″ name=”prezi_c238bc1c927364b27c1630c2c1a3fe9055d6c711″ classid=”clsid:D27CDB6E-AE6D-11cf-96B8-444553540000″ width=”550″ height=”400″><param name=”movie” value=”http://prezi.com/bin/preziloader.swf”/><param name=”allowfullscreen” value=”true”/><param name=”allowscriptaccess” value=”always”/><param name=”bgcolor” value=”#ffffff”/><param name=”flashvars” value=”prezi_id=c238bc1c927364b27c1630c2c1a3fe9055d6c711&amp;lock_to_path=0&amp;color=ffffff&amp;autoplay=no&amp;autohide_ctrls=0″/><embed id=”preziEmbed_c238bc1c927364b27c1630c2c1a3fe9055d6c711″ name=”preziEmbed_c238bc1c927364b27c1630c2c1a3fe9055d6c711″ src=”http://prezi.com/bin/preziloader.swf” type=”application/x-shockwave-flash” allowfullscreen=”true” allowscriptaccess=”always” width=”550″ height=”400″ bgcolor=”#ffffff” flashvars=”prezi_id=c238bc1c927364b27c1630c2c1a3fe9055d6c711&amp;lock_to_path=0&amp;color=ffffff&amp;autoplay=no&amp;autohide_ctrls=0″></embed></object><a href=”http://www.seoforums.org/”>Courtesy of MOGmartin’s SEO Forum</a> In a nutshell the presentation looks at the effects of including extra content on pages affected by the update, and measuring the success of each one of the groups. The massive take away from the testing that we performed was that content itself if simply no longer enough – you need to keep the content fresh on all of those pages to keep them in the index. One of the other key impacts of the update is that by losing the tens or hundreds of thousands of pages on your site that may have been affected, you lose rankings on the head tail as you have sacrificed massive amounts of internal link equity to those pages, so fixing the longtail by using revolving content also fixes the somewhat less pronounced, but just as important drop in the head tail terms. In our testing we discovered that the content you are publishing does not need to be totally unique, you can use content from other trusted sources to keep your pages fresh, as long as you splice it with unique content as well. One final piece of research that we conducted which is not mentioned in the deck is that you can negate a lot of the effects of the update by increasing your trustrank within google – so picking up some serious high value links can reverse the entire filtering effect on your website, so make sure you are getting those powerful brand links from the main trusted websites in your vertical. Any comments are appreciated on the topic, and I would like to extend my gratitude once more to the Distilled and SEOmoz teams for putting on this fantastic event. MOGmartin Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "PRO SEO Seminar Presentation on the MayDay Update"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "PRO SEO Seminar Presentation on the MayDay Update"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Martin Macdonald\n          \n            Martin Macdonald\n          \n            Martin Macdonald"
}