{
  "url": "https://moz.com/blog/product-marketing-without-a-product-team",
  "slug": "product-marketing-without-a-product-team",
  "title": "Product Marketing Without a Product Team - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Read about the great pre-launch questionnaire and workshop that Wistia uses for product launches.",
  "content": "Product Marketing Without a Product Team Content Marketing | SEO Tools | Branding By: Alyce Currier June 13, 2014 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Alyce Currier June 13, 2014 Product Marketing Without a Product Team Content Marketing | SEO Tools | Branding This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. When Wistia was small, everyone was involved in every launch. It was easy to know who was on board with any particular project, because, well, everyone was pretty much working on any given problem. When you’re working with 10-12 people total, you can gather around the lunch table and catch up on everything that’s going on at a given time. As we’ve grown to 15, 20, and soon 30 people, this kind of flat communication has become difficult. Multiple projects happen concurrently, and different people are focusing on different aspects of various initiatives in engineering, design, support, and marketing. Because we don’t have a traditional “product team” or “project managers,” everyone gets a chance to try their hand at project management in pieces. Because of that, everyone here has the power to influence the product and try their hand at project management.When should marketing get involved? My role most frequently culminates at the tail end of a product update: telling its story during the launch process. It can be challenging to be looped in towards the end of a lengthy project. While the quality of our written and video content is higher if we have more time to work on launch materials, there’s a delicate balance between allowing too much time or too little. If we get too involved too early in the process, we might craft an entire blog post or video around details that aren’t yet finalized. In these situations, we find ourselves scrambling to change everything at the last minute, and it’s a frustrating experience for everyone. This results in an otherwise exciting moment being weighed down by everyone’s stress, and the dampened enthusiasm affects the quality of the launch itself. On the other hand, if we get involved too late, it’s very difficult to figure out where everyone working on the project stands and what they want emphasized in the launch. Again, we find ourselves scrambling, and the end result is similar: someone has an epiphany an hour before launch as they read the draft, and I rush to make the necessary changes on schedule.The feature launch questionnaire I can’t blame anyone for in particular for these stressful moments, but it seemed like we could improve our processes. I thought it might help to get some words on digital paper a bit earlier so that any epiphanies could happen collaboratively, long before launch day. I worked with Ezra to create this feature launch questionnaire: Side note: \"Customer Happiness\" is what we call our support team, who also handle the documentation around product launches. Filling out a questionnaire in a Google doc wasn’t quite enough for me — it seemed equally important that we all spend some time hashing things out face-to-face. And so, the 30-minute pre-launch gathering was born.The pre-launch gathering The pre-launch gathering generally occurs two or three weeks before the estimated date of technical completion. Everyone who might have an opinion on the project, and everyone working on launch materials, gathers in a room to fill out the form together. We talk out our thoughts, and record the consensus in the questionnaire Google So far, we’ve managed to keep these meetings shorter than 30 minutes (thanks to the focus lent by the questionnaire), and it’s been insanely helpful for me.Workshopping the content After the pre-launch gathering, a few days before the launch itself, I’ve also begun to incorporate a blog post workshop.For a while, I've been leading a workshop for each \"feature\" blog post we publish: we define a \"feature\" as a high-effort post that we're going to email to our entire audience. It was about time we did something similar for our equally important product-related content, which we send to all of our customers, and often, to everyone in our email audience.In the workshop, the pre-launch group re-convenes to read through and collaboratively edit the launch blog post. We each bring a laptop to the workshop and live-edit the content as one person reads the post aloud. The workshops have been awesome for affirming that everyone has signed off on what’s going out the door and ensuring that there’ll be no last minute U-turns. One of the biggest challenges of product marketing for me is feeling like I might misrepresent something that someone else is super passionate about and has spent hours toiling over. Someone put a lot of effort into the story and technical details behind any feature, and I constantly worry about selling that short. Getting everyone together for these conversations and coming to a consensus does wonders for assuaging those worries.The result: smoother launches! It seems really simple, and for larger companies, having a system like this is probably a no-brainer and a necessity, but this has truly been (to get a little buzzword-y on you) a game-changer for me personally. A more ad-hoc way of working didn't keep our product launches from happening, but it left us with a lot more stress. It's been cool to see that a side effect of getting everyone in a room together at this stage is getting engineering, design, and support on the same page and identifying possible technical roadblocks for launch.The first launch that we executed using this new process felt so effortless that I was worried I’d forgotten something along the way. Actually, the process was just way easier! :) Next up: improving our post-launch processes!Here’s the questionnaire that we filled out for this launch. How do you ensure that everyone at your company is up-to-date and informed during product launches? What are some of the biggest challenges you've encountered with product marketing? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Product Marketing Without a Product Team"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Product Marketing Without a Product Team"
    },
    {
      "level": "H2",
      "text": "When should marketing get involved?"
    },
    {
      "level": "H2",
      "text": "The feature launch questionnaire"
    },
    {
      "level": "H2",
      "text": "The pre-launch gathering"
    },
    {
      "level": "H2",
      "text": "Workshopping the content"
    },
    {
      "level": "H2",
      "text": "The result: smoother launches!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Alyce Currier\n          \n            Alyce Currier\n          \n            Alyce Currier"
}