{
  "url": "https://moz.com/blog/programmatic-content-marketing",
  "slug": "programmatic-content-marketing",
  "title": "Programmatic Delivery: The Future of Content Marketing and Promotion? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Could programmatic delivery be the answer to the challenges of content distribution and promotion in the future? Simon Penson thinks so. Read on to discover how this new method of paid content delivery could help you.",
  "content": "Programmatic Delivery: The Future of Content Marketing and Promotion? Content Marketing | Online Advertising | Public Relations By: Simon Penson January 16, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Simon Penson January 16, 2017 Programmatic Delivery: The Future of Content Marketing and Promotion? Content Marketing | Online Advertising | Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Content promotion is hard. Disparate audiences and an ever-growing proliferation of channels to reach them through has made the life of a content marketer incredibly tough. What would you say, however, if there was a single solution to reaching EXACTLY the right people at exactly the right time, across any and every channel in real time? It may sound like a pie-in-the-sky opportunity but the reality is such an option is actually very, very close. In fact, for some it already exists. That option is ‘programmatic.’ Although still in its infancy from a content perspective, the technology and methodology behind it offers massive potential for the world of content marketing, and even SEO. So, what is programmatic? For those not fluent in the often complex and seemingly inaccessible world of programmatic and its associated buzzwords and acronyms, let’s go back to the basics for a second. Programmatic is a term used to describe the buying of advertising using software and algorithms. It’s something that is currently lighting up the world of advertising as it takes out the ponderous and inefficient human element, allowing advertisers to reach the right people when they are in exactly the right place. We can see below just how fast the uptake is expected to grow over the next couple of years: There's no escaping its grasp, so we ought to find out how it works, right? In the simplest terms here's what it looks like. At one end of the ‘system’ you have what is called a Demand-Side Platform: a place where all advertisers queue up and share what kinds of people they want to reach. On the other side we have the Supply-Side Platform: an inventory library where media owners, publishers, and so on tell the ‘machine’ what they have available to sell. So far, so simple! In the center lies the Ad Exchange, into which those publishers pour their available impressions and buyers use the tech in the Demand-Side Platforms to pick what they want to buy. This is usually done via an interface that allows you to target based on anything from demographics to recent purchase behavior and interests, and even intent. The process of buying and selling then happens REALLY fast, in the time it takes to load the page(s) being bid on. During that split second, an auction takes place, with the highest bid winning the right to show inventory in that spot. This is called Real-Time Bidding and is what many rightly believe is the future of programmatic and advertising in general. The platform we use to ‘play’ in this space is called Cadreon, but there are a plethora of different routes to market, either directly as a client or via an agency solution. Before we move on and talk about why this matters to marketers, it's worth mentioning that there is another version of programmatic known as Advanced Programmatic (or Programmatic Direct), where larger agencies pre-buy inventory at scale in order to obtain discounted pricing for buying in bulk or to secure premium and in-demand inventory. They can then use that ‘space’ as they wish, deploying it via the same system to take advantages of the audience targeting opportunity. To get a more detailed overview of programmatic, we've created this free guide as part of a 'beginners guide pack': So this is for advertising, right? By now you may well be thinking that I’ve lost my mind and gone all ‘advertising’ on you. But this is entirely the point. The world sees this as a pure-play advertising opportunity, but the reality could be quite different. Yes, it reinvents advertising. But if you think about those adverts as simply ‘holes in the Internet,’ then we can begin to bring content into the conversation. Holes in the Internet At risk of stating the obvious, advertising creative is not ‘content.’ At its worst it shouts to gain our attention, and at best it still tries too hard to connect directly to a brand, or direct response opportunity. Imagine, then, if we used those spaces to highlight an amazing piece of review content, like this fantastic ‘Which Macbook Should I Buy?’ guide by Wirecutter. Using programmatic, we could target that at people that have visited a retail store that stocks Apple within the last two weeks and have also been to the Apple site. Another example: a great video review like this by a prominent UK automotive media brand of the best sports car to buy to someone that has just test-driven an Audi R8. The opportunities are endless. Native advertising Some might say this is the natural extension of the currently rudimentary opportunities presented by the ‘native advertising’ world through platforms such as Outbrain and Taboola. This is, however, like comparing use of the Google Display network for ad creative distribution with using real-time programmatic: a walled garden restricted to just Google publisher websites versus a programmatic play that could reach out to almost every site on the web and across some really exciting other areas like TV, radio, and out-of-home, to boot. We’ll come to how they fit in shortly. While native advertising helps us position the opportunity in our heads (using space traditionally seen as for adverts for content), it is important to understand how much more powerful programmatic reach is. There is one really interesting player starting to make waves in this space, and that is a Florida-based company called Triple Lift. The model offered allows brands to buy native inventory using programmatic tech, offering advertisers a way into those ‘walled garden’ spots within content areas. This is grade-A real estate for content marketers as we look to blend the line between advertising and content further. Interestingly, however, and probably due to the tech only being sold into advertisers as opposed to content marketers, the examples show ad-based creative as opposed to engaging content. Below, however, we can see how an article looks placed through the platform on Digg: Adding in other channels While traditional digital advertising is either based on keyword targeting (Adwords, for example) or is more audience-focused but limited to a single network or small pot of ‘networks’ (see Google Display Network or Facebook Audience Network), the best programmatic platforms reach much, much further. Any good system will give you options across the following, for example: Doubleclick Bid Manager for access to the Google stackAmazonTube Mogul for video solutions across the web, including Facebook and InstagramAOL, including Microsoft and Yahoo propertiesPrivate large site marketplaces such as Pubmatic and Rubicon Project, proving access to the likes of Time Warner, Zoopla, and The TimesRadio channelsOut-of-home inventory – digital billboards, etc.TV advertising There are then a number of intermediaries whose job it is to specialize in connecting media opportunities together such as Drawbridge and Tapad for cross-device targeting. A quick overview guide of the players in the ecosystem can be seen below and should be explored as part of any strategy: The benefit of this whole-of-market approach was summed up brilliantly in an article for Marketing Week by Jonathan McCauley-Oliver, the online sales manager at National Rail Enquiries in the UK. They use programmatic to ensure that ads against the millions of page impressions its website receives each month are served smoothly and to their target audiences. He explained: “If I go to a marketer and say that I can deliver your message to the one person who is likely to buy your product, that is worth a lot. If I can do that in five seconds to 8 million users, they’ll bite my hand off. This one-to-one relationship is afforded by these advancements in technology.\" Imagine this as a central tool in your content distribution arsenal… How could this work in the wild? With a ‘full stack’ of Supply-Side options at your disposal, the world looks very, very exciting, especially when you start to think about how you can follow and interact with your audience, almost irrespective of where you are.The process starts with an understanding of where your audience can be found elsewhere on the web. We can use a number of tools and platforms that you may already be well aware of as part of the wider audience understanding work you do across marketing to do this.Audience understandingBefore you start any campaign, you MUST have a clear idea of where your target consumers are. To do this, I follow a basic process:1. At Zazzle we have access to a great tool called Global Web Index. It's something I've written and spoken about several times recently, as it's becoming a core cog in the overall strategic wheel. In this process we use it to tell us which channels our audience uses regularly, such as in the example below. Here we see three similar brands compared to the UK average (purple). It is clearly telling us that they use search and consumer review sites. This provides validation that our targeting will work.2. Next, we want to get more granular. To do this, we start with Comscore and Hitwise, a leading supplier of audience insight data. From within it we can extract information on everything from which sites our audiences go to before and after ours, as well as a broader view of interests and visit behavior. You can see below an example of what an upstream report looks like for the BBC website in the UK:Using these two tools, you can quickly build up an accurate picture of where your audience is hanging out, either by analyzing your own site or those of your competitors or industry leaders.For those that can't stretch to such enterprise tools, Alexa and Similarweb can give you similar information, albeit from smaller data sets.3. We can also layer over a multitude of other data here. These are usually segmented into the following pots:In reality, you would rarely need to worry about individual data providers. However, many of the programmatic platforms aggregate this into their systems to give you a one-stop solution to target correctly (we talk about example platforms a little later).CreativeIn creating this guide we are assuming that you already have the process of creating the right kind of content nailed. I've written previously about how to design content strategies and campaigns to maximize impact if there are any question marks over your approach, but the beauty of this delivery mechanism is that it's just as effective for articles and guides as it is for major campaigns. To understand what I mean, let's look at a couple of theoretical examples and how that could play out:Example 1: Video review content for a person buying a sports carImagine the scene: You’ve been thinking about buying a new car for several months and finally, after several attempts, you’ve got a weekend free to test out that car of your dreams.On Saturday you test three rival brand options and go away more confused than ever, as the car you thought you wanted wasn’t the best to drive.That night, as you ponder that decision, those brands want to be front-of-mind. The smartest of the three has deployed a programmatic ad content strategy. By collating geo-location data alongside information from its own test drive database and by looking at Google searches, YouTube viewership, etc, the brand can work out which cars are in the frame. This presents a unique opportunity.Rather than deliver a display banner, all the data within the setup could provide us the opportunity to deliver a richer content experience. If we know that a user lives in Brighton, currently drives a sports car that is 3 years old, and has been researching new cars, we could tailor his brand experience accordingly (e.g. content could provide local Brighton dealerships, knowing user already has sports car and lease could be expiring soon). Or, even smarter than that, it could serve up a YouTube-hosted video favorably comparing their car with that of the rivals. A call-to-action could then take that person to the brand site and onto a dynamically personalized page that presents the strongest argument for buying their car. I don’t know about you, but I would be pretty impressed by that experience. Example 2: A person buying a laptop It’s a similar story for businesses in the retail sector. Let’s say you run an ecommerce business and want to help add value at the critical point of the purchase funnel: when a potential customer is making their final decision on which product to buy. This could play out in any purchase process, but for the sake of this second example, let’s imagine it is for laptops. The decision is down to the last two options (Macbook Air and the Surface Pro). We know this as search behavior has included reading reviews and looking at comparisons. Imagine if we could place our own review slap-bang into the middle of that process, in real time. As they trawl the Internet for info, our in-depth comparison review follows them. The likelihood of interaction is huge and we can even include dynamic call-to-action creative within it, offering a personalized discount or incentive to ‘buy now’ and from our site.So how do I get involved? By this point, you should be thinking about how you may go about adding to your 2017 strategy but wondering where on earth to start. The choices, as explained earlier in the piece, are still relatively limited simply due to the relative immaturity of the market and tech. Things are changing fast, however. If your budgets are larger, then chances are you're already using the approach as part of your paid media mix. In this situation, the challenge is to reimagine the strategy with greater emphasis on content as opposed to commercial ad messaging. Think of it as softening the message and attempting to add value more. Talk to your agency or team and challenge them to test it.I'll almost guarantee they're not thinking about the distribution method as a platform for anything other than advertising message, so make it your mission to push them and help them understand that it may be more powerful as a delivery mechanism for value-adding articles, videos, and interactive assets.This switch in thinking represents a huge opportunity for those that are willing and able to try it first, and the good news is there are a number of easy-to-use tools out there allowing you to give it a go. Programmatic for smaller business If, like the majority, you are in charge of smaller budgets and don’t have the ability to onboard a global network agency with in-house proprietary tech like Cadreon, don’t think you're out of luck. There is an ever-growing pack of platforms designed specifically for this market. A personal favorite is Admedo, an easy-to-use system for those with little or no programmatic experience. With its own DSP (Demand-Side Platform), you can customize to your heart's content. We have seen some brilliant results from it. Others worth considering include: Zypmedia – Great for local advertising campaign work and for businesses where geo-location is critical.Pocketmath – Another great option for the small business owner wanting full control of targeting, creative, and delivery.Brandzooka – A good choice for those looking to focus campaigns on video creative. Next steps So, fancy giving programmatic a go? If you do, spend ten minutes reading our Simple Guide to Programmatic, available for free by clicking the button below. You can also download our Programmatic Planning Template to help make the planning process as easy as possible. Good luck! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "So, what is programmatic?"
    },
    {
      "level": "H2",
      "text": "So this is for advertising, right?"
    },
    {
      "level": "H2",
      "text": "Holes in the Internet"
    },
    {
      "level": "H2",
      "text": "Native advertising"
    },
    {
      "level": "H2",
      "text": "Adding in other channels"
    },
    {
      "level": "H2",
      "text": "How could this work in the wild?"
    },
    {
      "level": "H3",
      "text": "Audience understanding"
    },
    {
      "level": "H3",
      "text": "Creative"
    },
    {
      "level": "H4",
      "text": "Example 1: Video review content for a person buying a sports car"
    },
    {
      "level": "H4",
      "text": "Example 2: A person buying a laptop"
    },
    {
      "level": "H3",
      "text": "So how do I get involved?"
    },
    {
      "level": "H4",
      "text": "Programmatic for smaller business"
    },
    {
      "level": "H2",
      "text": "Next steps"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Simon Penson\n          \n            Simon Penson\n          \n            Simon Penson"
}