{
  "url": "https://moz.com/blog/project-management-for-seo",
  "slug": "project-management-for-seo",
  "title": "Project Management for SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Coming up with the right SEO answer is just one part of improving your website's performance online. The strategy you devise then needs implementation and, more often than not, project management. The purpose of this post is to share what I (and a few others) have learned about managing SEO…",
  "content": "Project Management for SEO SEO Basics L By: LucyLangdon August 25, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! L By: LucyLangdon August 25, 2009 Project Management for SEO SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Coming up with the right SEO answer is just one part of improving your website's performance online. The strategy you devise then needs implementation and, more often than not, project management. The purpose of this post is to share what I (and a few others) have learned about managing SEO strategies over the years. There isn't much hardcore SEO though- I suggest you take a look at this if you want some of that! Goals/Objectives If you're developing an SEO strategy for a website, you need to make sure you have some objectives in place. A simple, 'increase traffic' or 'rank better' is not specific enough but, having said that, creating goals that are so specific they exclude any recognition of improvement across the board are similarly limiting. Applied to SEO You're an in-house SEO for a website that sells cheese online. Your overall goal is to increase conversions on your site. Your strategy goals are threefold: reduce bounce rate by about x% increase the number of new visitors by about x% increase conversation rate by about x% It's a painfully obvious thing to say, but having aims in place like this will really increase your chances of creating a successful strategy; everything that goes into it has to have a motivation. Recommending a Twitter account? Is that because you think it'll increase the number of new visitors by x% or because you quite like Twittering? By giving every task you outline a definite purpose, you'll reduce the risk of wasting time on tactics that don't work. Getting everyone on board These goals and objectives need to be developed in partnership with whoever you're creating the strategy for, whether that's a client or your boss. It really helps if you can demonstrate to this person why you've chosen these goals and, once you've come up with the strategy, how you're going to achieve them. One of the main reasons for this is that you'll probably need their help at some point along the way. Applied to SEO SEO isn't rocket science but if your client's/boss's expertise lies elsewhere then it's really worth making sure they understand what you're trying to do and why you're trying to do it. Make sure someone (and it can be you) really believes in the strategy and can champion it to whoever needs convincing. It's important that this person can communicate the overall idea as well as go into the specifics. We've found powerpoint, graphs and the odd screenshot of a 'moz tool helps with this. (My post about using 'moz tools in the sales process talks a bit about this). In terms of implementation, if you can show (preferably with diagrams) how changing that title tag or contacting that partner site is crucial to the strategy then you've won half the battle. Develop Indicators If you're putting together a strategy that's going to last for more than a week or two, you want to be able to check up on it along the way. One of the characteristics of a 'holistic strategy' could well be that it won't start showing results until you're quite a way in (eg. if you start by making a load of techy changes to the website that will only affect rankings once you start linkbuilding), so you need to come up with a way to show the plan is working before it actually is! Sound challenging? It is, but it's definitely worth it. Applied to SEO \"Leading indicators and signature analytics\" are the buzz words of the moment. The idea is to think of the stuff you can spot that indicates something is working. For example, if your overall objective is to improve the performance of a certain few search terms and you decide that one of the ways to do that is to increase domain diversity, then your leading indicator is simply to monitor the number of domains linking to you. If your aim is to improve the longtail traffic to your site, then your signature analytics could be to monitor the number of 3 or more word keyphrases that are driving traffic to your site. Delegate tasks Once your strategy, goals and indicators are set up, it's time to start delegating some tasks! Personally, I love this bit, but I know lots of people find it hard to handover tasks that are intrinsic to the success of a strategy. Unless you personally have infinite time and resources, the project will probably suffer if you try and do everything yourself. Applied to SEO A nice spreadsheet with a list of tasks, due dates and who's responsible for what will do wonders here. Whatever works though, just make sure everyone's up to date and ready to go. Actions No matter how convincing and attractive a strategy might look, it really won't work unless it's actionable and then actioned. As long as all your tasks are created, handed out and acted upon from day one you can't fail. If only it was that easy.... Applied to SEO In reality, fitting your SEO strategy in alongside all the other challenges that the website you're working for faces can be really difficult. How can you decide between a bug fix or a new widget for your limited dev resource? This is where an ability to prioritize comes in very handy. There will be actions within your strategy that are more important and time-sensitive than others but spotting which they are is hard; you often have to make calls on the potential benefit of future actions. Your strategy must be grounded on solid SEO concepts that you can see working on other sites. If it is, then you should have no problem making a call on the potential benefit of one action over another. Reviews Regular catch ups with whoever the strategy is for are essential throughout the project. People forget things, the market changes, stuff doesn't work... this all needs to be discussed and accounted for. If your goals need to be tweaked half way through a strategy, for whatever reason, you need to be able to adapt quickly. It's also important to tweak the expected results and leading indicators accordingly. A regular review is also a really good time to check that all those tasks you delegated are being completed in the best possible way. Applied to SEO How you go about these reviews obviously varies hugely from case to case but put something in the diary and keep to it! I've found it's worth keeping this kind of catch up quite formal- sort out an agenda and try and stick to it. These catch ups are also an excellent opportunity to help keep you on track. Most folk would rather be building a Twitter network than digging through a list of niche directories to spot any missed opportunities. A good catch up that lets you check off what's been done and what still needs doing will remind you which actions will actually make your strategy work. Things to bear in mind Quick wins vs. diminishing returns - Implementing an SEO strategy often involves picking off the low-hanging fruit first. For example, if there are problems with the indexing of the site you're working for and your improvement of the navigation fixes these problems and suddenly allows new pages to rank, you're going to look pretty good in month one. However, this kind of quick win approach can't last forever; you should think about whether your client or boss will understand this. Two things will help with this: Work the concept of diminishing returns into your strategy as a positive thing- ie. make sure your boss or client understands that, although the value you'll be adding month on month will be worth the investment, the value you add in the first few months might well blow them away. A strategy is a cumulative project so make sure you always look at the progress the site has made from the day you started, not just from the previous catch up. Know your resources - As I mentioned above. an SEO strategy with no actions is terrible- as bad as a kitten in a box with no videophone on standby to capture the magic. However, an actionable strategy with no-one to actually do the work is so much worse. (If anyone can work out how to bring in Schrodinger here I think that would be great. Something along the lines off 'if an actionable strategy has no-one to action it, is it a strategy at all?). Know thy minions and what they are capable of and remember, if the rules change half way through the game, then you should rethink what a 'win' will look like. _________________________ Before I sign off, last week Will ran a popular conference call about how we use SEOmoz tools at Distilled. A recording of the call and the notes are now available online. If you would like to hear about future calls (and get future recordings) you can sign up on that page too. There was particular enthusiasm for one about advanced Excel (especially PivotTables) - watch out for that coming soon. (My thanks to Tom and Will Critchlow and Stephen Tallamy for their advice about Project Management for SEO) (Thanks to modenadude for the image). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Project Management for SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Project Management for SEO"
    },
    {
      "level": "H2",
      "text": "Goals/Objectives"
    },
    {
      "level": "H2",
      "text": "Getting everyone on board"
    },
    {
      "level": "H2",
      "text": "Develop Indicators"
    },
    {
      "level": "H2",
      "text": "Delegate tasks"
    },
    {
      "level": "H2",
      "text": "Actions"
    },
    {
      "level": "H2",
      "text": "Reviews"
    },
    {
      "level": "H2",
      "text": "Things to bear in mind"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "LucyLangdon\n          \n            LucyLangdon"
}