{
  "url": "https://moz.com/blog/project-pricing",
  "slug": "project-pricing",
  "title": "Project Pricing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I like this piece from Blue Favor on project pricing. Their attitude is very similar to mine when it comes to the subject of client / service provider relations:\n\nToday we are going to break an unwritten rule for agencies, we are going to reveal an important ...",
  "content": "Project Pricing Online Advertising By: Rand Fishkin April 28, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 28, 2006 Project Pricing Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I like this piece from Blue Favor on project pricing. Their attitude is very similar to mine when it comes to the subject of client / service provider relations: Today we are going to break an unwritten rule for agencies, we are going to reveal an important page from our playbook on how we price a project. What is somewhat ironic is that we think it's a pretty bad rule, that one of the last things we think anyone should hide from a potential client is how your pricing works. The pricing system they discuss isn't exactly what we use at SEOmoz, but it's a good starting point: When we price out a project we not only price out what we know about the project, but also detail what we don't know. We come up with worst-case scenarios, address risks, point out all the things we think could impact meeting the goals of the project. When we make an assumption, we call it out. And if this price is going to get you three comps and three iterations, then we try to set that expectation up front. To come up with a number try using the following formula: task x time(complexity x effort) x rate = price They're also using an hourly rate calculation system: So the formula for a low-level web designer might look like this:($20k expenses + $60k salary) ÷ 1,500 hrs + 10% margin = $58.66/hr As far as our pricing system works, it's largely based on the following factors: Who is working on the project (Rand, Matt, Kat, Rebecca, etc.) How many hours we expect to spend on the project Hard time vs. Easy time - many projects, tasks and clients are not enjoyable to spend time on, while others are a true pleasure - this heavily impacts pricing Profit margins & overhead - while these were once very small numbers, as with any growing business, they become larger over time in order to permit growth I'd love to hear from other folks about how you price SEO/M projects and what you believe to be the most valuable elements to include. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Project Pricing"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Project Pricing"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}