{
  "url": "https://moz.com/blog/protect-gbp-hours-of-operation",
  "slug": "protect-gbp-hours-of-operation",
  "title": "Protect the Hours of Operation on Your GBP from Unwanted Google Edits - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Over the next six months, Google is going to employ machine learning and AI to alter the hours of operation on 20 million Google Business Profiles. Google has good reason for pursuing accuracy in their local index, but local business owners have even better reason to proactively safeguard the…",
  "content": "Protect the Hours of Operation on Your GBP from Unwanted Google Edits By: Miriam Ellis May 9, 2022 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis May 9, 2022 Protect the Hours of Operation on Your GBP from Unwanted Google Edits The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Image credit: Bart Maguire Over the next six months, Google is going to employ machine learning and AI to alter the hours of operation on twenty million Google Business Profiles as part of their project of creating a “self-updating map”. Some experts estimate that this is roughly one-fifth to one-sixth of all GBP listings, meaning the chances are strong that you or one or more of your clients could experience these edits. Google has good reason for pursuing accuracy in their local index, but local business owners have even better reason to be on top of this announcement and proactively safeguard the validity of their own data. Today, we’ll show you what to do to take charge on these vital listings which, while they belong to Google, represent your business. Why is this happening and is this new? Google is right in observing that the chaos of COVID-19 has affected the accuracy of their local business index. Updating GBP hours to reflect changes may not be at the top of the to-do lists of business owners struggling with so many challenges. However, Google’s description of how they plan to alter business hours is raising some alarm, due to the peculiarity of their disclosed methods. Some processes are sound. For example, Google mentions use of Duplex to actually phone business owners directly to ask what their current open hours are, which makes excellent horse sense. Additionally, asking Local Guides to validate this information could also help if an owner is unreachable, for some reason, and the guides being tapped are civic-minded instead of just playing for points. All fine and good. Where we get into murkier waters is in Google saying they will use the hours of other related local businesses to “predict” what the hours should be for the business you are marketing. The example they use is determining what the hours of Liam’s Lemonade Shop should be by looking at the hours of other nearby lemonade shops. In other words, if Larry’s Lemonade Emporium is open from 9-5, Google assumes that Liam’s Lemonade Shop shop should be, too, which will come as a surprise to him if he runs a late night citrus spot. I’m not the only one finding Google’s logic less than exemplary on this. Another process Google mentions is that of deriving information from Street View, which I am dubious about, given that many places I visit via this service have not been updated in more than a year, and in some cases, in more than a decade: If Google’s thinking is that harried business owners have not had the free time necessary to keep their hours updated throughout the past two years, then trying to glean this information from random snapshots in time of whenever a Google vehicle last passed through town seems like a rather fuzzy solution. The hours of your business in 2022 may be quite different from what they were a year ago, or five years ago. If some of Google’s ways and means accompanying this big announcement have a familiar ring to them, it’s because what they are describing is not, in fact, totally new. Since the beginning of local search history, Google has crowdsourced information and implemented it in their listings, and all of that time, local SEOs and local business owners have been suggesting that this is not a good substitute for getting information directly from the companies Google is representing and monetizing via their system. We basically have to view this development from Google as an acknowledgement of three things: Your listings belong to Google.Google has never reached the level of direct local business owner engagement they actually need to maintain the quality of their index.In the absence of this, they substitute crowdsourcing and technology in hopes of achieving enough accuracy to maintain a certain degree of public trust necessary to be able to keep monetizing SERPs and having them seen and used. So, take a deep breath. This is the Google we already know, putting a high tech spin on a historic communications failure, but don’t overlook this announcement. It’s a strong message from the search engine that you have to stay on top of your own listings if you don’t want Google to completely take over and edit your data based on random information. Fortunately, there are specific things you can do to take charge! How to proactively protect your GBP hours Here’s a short list of your five best options for signaling to Google that, yes, you are staying on top of your own hours and don’t require assistance. Be sure the hours of operation on your website are accurate. Google says this is one of the places they investigate.Sorry for the pain-in-the-neck, but if you manage your listings manually, you now need to regularly check all of them to see if Google has altered their hours. I’d recommend checking at least every month (as if you don’t already have enough to do). Moz Local customers have a much easier option. Just check the Profile Suggestions section of your dashboard to see, at a glance, whether Google or anyone else is trying to edit your hours, even if you have hundreds of listings. Being alerted when data changes are suggested should provide so much peace of mind, and you can accept or reject edit suggestions. Whew!Thirdly, take some time this week to edit your hours, even if the edit is small. For example, you could go into your listings today to set special hours for the winter holidays in advance, proving to Google that you are well aware of your own schedule and that your hours of operation are not neglected. Remember our recent discussion of the QRG and how Google employs human quality raters to get a sense of your business from what others are saying about it? Be sure all of your local business listings across your local search ecosystem are up-to-date with correct hours (another thing Moz Local makes so much easier!) so that quality raters aren’t encountering complaints from customers who came to your business and found it closed when it was listed online as being open for business. Finally, for brick-and-mortar brands, do step outside today and be sure the hours displayed on your windows, doors, and street level signage are accurate, just in case a Google Maps Car or a local guide is heading your way. Google is telling us, yet again, that local business listings aren’t a set-and-forget asset A local SEO myth that I see surfacing frequently is that you can build out your listings and then forget about them. This is simply not true! Ongoing, active management of all of your listings has always been essential for three core reasons: Incorrect information on neglected listings has been proven to lead to negative reviews from inconvenienced customers, and negative reviews undermine conversions/transactions. If your real-world hours change and you don’t update your online listings across the local search ecosystem, customers will complain in reviews and the low-star rating they assign you will influence the impressions and actions of other potential customers. Meanwhile, remember that wrong hours in one place can then be distributed to multiple local business listing platforms and apps in the absence of active management. Customer care is the number one reason why you can’t neglect your listings.It isn’t just Google which can decide they know better than you about key fields of your listing. Any member of the public, including competitors and spammers, can suggest edits to your profiles that you will be unaware of if you are not paying attention. It’s an outdated perspective to view local business listings as static entities. Year-over-year, Google Business Profiles, in particular, are becoming increasingly interactive and transactional. Competitive local businesses must have a solid strategy for continuous management of photos, reviews, Q&A, messaging, bookings, shopping and more. Far from being a one-and-done scenario, listings management is central to local business operations. Given that Google shows no signs of ceding total control of listings to business owners, your best strategy is to take as much charge as you can and be as proactive as possible in publishing dynamic information to your listings. With Google’s latest announcement fresh in all our minds, today might be a good day to check out Moz Local to simplify your local to-do list. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Protect the Hours of Operation on Your GBP from Unwanted Google Edits"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Protect the Hours of Operation on Your GBP from Unwanted Google Edits"
    },
    {
      "level": "H2",
      "text": "Why is this happening and is this new?"
    },
    {
      "level": "H2",
      "text": "How to proactively protect your GBP hours"
    },
    {
      "level": "H2",
      "text": "Google is telling us, yet again, that local business listings aren’t a set-and-forget asset"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}