{
  "url": "https://moz.com/blog/proving-trust-on-the-web",
  "slug": "proving-trust-on-the-web",
  "title": "Proving Trust on the Web - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For those of us who've been deep in the trenches of online marketing for years, the question of who to trust may seem inane. We've all gravitated to sources of one variety or another, and probably built up a few favorites based on past experience. I've shared some of my selected sources in the ...",
  "content": "Proving Trust on the Web SEO Basics By: Rand Fishkin December 7, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 7, 2011 Proving Trust on the Web SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. For those of us who've been deep in the trenches of online marketing for years, the question of who to trust may seem inane. We've all gravitated to sources of one variety or another, and probably built up a few favorites based on past experience. I've shared some of my selected sources in the past and I (consciously and subconsciously) bias toward trusting news and advice from those over others. But for those new to the field of web analytics, social media marketing, SEO or a myriad of other practices, it's a true challenge. Case in point, a Q+A question from earlier today: How do you know what is junk information vs what is truly good SEO advice? Is it just simply trial and error? It seems to me that if people find truly good SEO information, they aren't going to be sharing it so easily. It's the whole, \"You get what you pay for\". I've observed and heard this perspective dozens of times. Like the assumption that the \"best SEO company in my city probably ranks first for cityname+SEO,\" it makes sense at first blush, but quickly loses any semblance of logic upon deeper analysis. The reason is fairly straightforward; SEO at its core is about great content combined with earning great references. Sharing openly, honestly and adding value with that content is far more likely to produce returns in the form of links, reputation, references and customers than staying closed and secretive. Participation in a professional ecosystem almost always yields more value than hoarding \"secret discoveries,\" particularly when those same secrets are being shared elsewhere on a gigantic, relatively level playing field (the web). But let's say you're completely unfamiliar with the field. You need secondary cues - signals that help you sort the wheat from the chaff. On the web, these follow fairly consistent patterns: When a piece of content (or an entire site) falls into the right-hand column of untrustworthiness, we tend to reject the information provided. When it falls into the left-hand, trusted column, our instincts are to assign credibility and all the positive associations that accompany it. There's a lot of boxes to tick to earn trust, but also an incredible amount of value to be had in establishing it. Conversion rates rise. Links, citations, references and social shares increase. The propensity for virality improves. The likelihood of earning a subscriber or a follower or a fan (in all senses of those words) improves. Building trust is like adding an extra percentage on top of every activity web marketers engage in. Thus, when an SEO reaches out for help earning top rankings or a social marketer wants to know how to get more Facebook fans or drive more traffic from Twitter on a site that looks like this: (no offense, but they're ticking box after box from the orange column above) I'm left wondering, why put the cart before the horse? Users of the web have been trained through experience (online and off) to seek out indications of trustworthiness. When we enter a new field on the web, we'll use these same signals to evaluate possible resources and channels. So why is it that when we put on our marketing hats, we sometimes revert to paying thousands of dollars for a link building campaign, yet shy away from investing in the foundation of our success - the trustworthiness of the site and brand? A wise man once said: \"Let's stop putting lipstick on pigs and trying to rank 'em.\" I couldn't agree more (and, I suspect, neither could most of our bottom lines). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Proving Trust on the Web"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Proving Trust on the Web"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}