{
  "url": "https://moz.com/blog/proximity-third-in-local-ranking-factors",
  "slug": "proximity-third-in-local-ranking-factors",
  "title": "Proximity Third: A Deeper Dive into a Local Ranking Factors Surprise - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In a break with tradition, participants in the Moz State of the Local SEO Industry 2020 Survey placed user-to-business proximity at a lowly third place in terms of influencing Google local pack rankings. Just a year ago, our respondents had voted it #1.",
  "content": "Proximity Third: A Deeper Dive into a Local Ranking Factors Surprise Local SEO By: Miriam Ellis July 22, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis July 22, 2020 Proximity Third: A Deeper Dive into a Local Ranking Factors Surprise Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Image credit: J.B. Hill What’s the good of a survey if it doesn’t result in at least a few surprises? I know my own eyebrows leapt skyward when the data first came in from the Moz State of the Local SEO Industry 2020 Survey and I saw that, in a break with tradition, participants had placed user-to-business proximity at a lowly third place in terms of influencing Google local pack rankings. Just a year ago, our respondents had voted it #1. If you’re feeling startled, too, here’s our chance to take a more granular look at the data and see if we can offer some useful theories for proximity’s drop in perceived dominance. First, a quick definition of user-to-business proximity What do local SEOs mean when they speak of user-to-business proximity? Imagine an Internet searcher is standing in Golden Gate Park in San Francisco, looking on their phone, laptop or other device for “pizza”. Local SEOs observe that it’s more typical for Google to show that person Pasquale’s Pizzeria, right next to the park, than to show them Yummy Pizza across town in the Glen Park neighborhood. Make an identical query as you move around your city and you’re likely to see the local pack and mapped results change a little or a lot, depending on the competitiveness, density and diversity of local commerce in your town, relative to where you are standing when you search. In 2014, the annual survey of world class local SEO experts known as the Local Search Ranking Factors survey rated proximity as having the 8th greatest influence on local pack rankings. By 2017 and in subsequent editions, proximity had hit #1. As mentioned, the 2019 Moz State of the Local SEO Industry report placed it first. But this year, something changed… Proximity third: the data Our large survey group of over 1,000 respondents ranked Google My Business elements (keywords in name, categories, etc.) and Google review elements (count, sentiment, owner responses, etc.) as having a greater influence on local pack rankings than does user-to-business proximity. Now, let’s take a closer look at which participants ordered ranking influence in this way. GMB elements ranked #1 It’s fascinating to see that, on average, agency workers rated Google My Business elements as having the most influence on local pack rankings. These would be practitioners who are presumably working directly with local clients on a day-to-day basis and continuously studying local packs. Google review elements ranked #2 Overall, Google review elements rank second, and within this statistic, it’s survey takers who market one small local business who rate the influence of reviews most highly, on average. These would presumably be independent business owners or their in-house marketing staff who are regularly eyeing the local packs to see what seems to move the needle. Proximity ranked #3 Overall, the proximity of the searcher to the place of business ranks third, and within this group, it’s agency workers who, on average, rate the influence of proximity most highly. So, again, it’s this group of marketing professionals who are contributing to the depiction of proximity being of less influence than GMB factors. Three theories for making sense of the proximity shift I was startled enough by the data to begin considering how to account for it. I came up with three different theories that helped make more sense of this to me, personally. 1. Could respondents just be wrong? Certainly, it’s fair to ask this. I’ll be honest — my first reaction to the data when it crossed my desk was, “Wait...this can’t be right. How can proximity be in third place?” I thought about how the long-running Local Search Ranking Factors project, which is confined to local SEO experts, has been placing proximity first for several years, and how our survey group is inclusive of every type of job title involved in marketing local businesses. Owners, creative directors, writers, in-house and agency SEOs, and many other types of practitioners contribute to marketing local businesses and participate in our initiative. Could it be that respondents who don’t do day-to-day SEO work swayed this result? But I stopped asking that question when I saw that it was, in fact, agency workers who had contributed most to this view of GMB factors outweighing proximity. Digital marketing brands offering local SEO as a service can’t be summarily written off as mistaken. So, next, I asked myself what these agency workers could be seeing that would make them rank proximity lower than two other factors. 2. Could \"it depends\" be making absolutes impossible? Here’s the thing: sophisticated local SEO practitioners know that there actually is no absolute #1 local ranking factor. What shows up in a local pack depends hugely on Google’s understanding of intent and its varied treatment of different industries and keywords. For example, Google can decide that for a query like “coffee near me”, the user wants the closest option, and will cluster results in a tight proximity to the searcher. Meanwhile, a customer in any location looking for “used car dealership” may see results skewed to a certain part of town where there’s an auto row filled with such businesses — a phenomenon long ago dubbed the “industry centroid” effect. But, for the user seeking something like “sports arena”, Google can believe there’s a willingness to drive further away and can make up a local pack of businesses all over a city, or even all over a state. So, the truth is, dubbing any factor #1 is an oversimplification we put up with for the sake of giving some order to the chaos of Google results. Proximity may be the dominant influence for some queries, but definitely not for all of them. Taking this into consideration, it could well be that our survey’s respondents who work at agencies are observing such a diversity of behavior from Google that they are losing confidence in pinning it all down to proximity as the leading factor. And this leads me to my third theory. 3. Could a desire for control be at play here? Proximity can be problematic. In a separate question in our survey in which we asked whether Google’s emphasis on proximity was always generating high quality results, only 38.6% of respondents felt satisfied. Most of us are frequently encountering local pack results that may be closest, but not best. This can leave agencies and business owners feeling a bit dubious about Google and even a bit helpless about acting in an environment that often ranks mere nearness over quality. Unless a business is willing to move to a different location which Google appears to be favoring for core search phrase targets, proximity isn’t really something you can optimize for. In this scenario, what is left to local business marketers that they can control? Of course — it’s GMB factors and reviews. You can control what you name your business, what categories you choose, your use of Google posts and Q&A, your photos, videos, and description. You can control your review acquisition campaigns and your rate and quality of owner responses. Seeing respondents weigh GMB elements above proximity made me wonder if the strong desire for being able to have some control over local pack outcomes might subconsciously cause subjects to give a slight bump to factors they can observably influence. I’m not a psychologist, but I know I’m always writing here at Moz about focusing on what you can control. It could be that this internal emphasis might cause me to give more importance to factors other than proximity. Just a theory, but one to consider, and I’d love to hear in the comments if you have different hypotheses! Can we know the truth? I was so intrigued by our survey’s results that I ran a very quick Twitter poll to take another snapshot of current sentiment about proximity. Most of my followers are interested in or involved with local SEO, so I was eager to see the outcome of this: While a robust 66% placed proximity first, an interesting 34% didn’t. In other words, there just isn’t total agreement about this topic. Most revealingly, more than one respected SEO tweeted back at me, “It depends.” This is why I believe that my second theory above is likely as close to the truth as we’re going to get. All surveys which aggregate anecdotal opinion must take into account the variety of respondents’ experiences. Consider: If my agency specializes in working with convenience stores or coffee shops, proximity may well be ruling my workday because Google draws such a tight net around users for my target keywords.If most of my clients operate tourist attractions or B2B brands, it could be that reviews or the names on Google Business profiles appear to shape my world much more than proximity does.Or, I may have such a wide array of clients, each experiencing different Google behavior, that my overall confidence in putting proximity first has simply eroded the more I observe the variations in the results. What we can say with certainty is that there has been a year-over-year shift in how participants in the Moz State of the Local SEO Industry 2020 survey rate the influence of proximity. They believe it’s less dominant than it was just a year ago. Knowing this may not change your local pack strategy, because as we’ve noted, you could never do much to influence proximity in the first place. What takeaway can we glean, then, if there is no absolute #1 local ranking factor upon which all parties agree? I’d boil it down to this: our survey shows that participants are heavily focused on GMB factors and reviews. In your competitive landscape, awareness of these elements is lively, and your ability to compete means taking an active approach to managing what you can control. Moz Local software offers one smart solution for taking maximum charge of your Google Business Profiles, and I’ll close here with my short list of links to assist you in marketing local businesses in Google’s competitive environment: 2020 Local SEO Success: How to Feed, Fight, and Flip GoogleSimple Spam Fighting: The Easiest Local Rankings You’ll Ever EarnI Want to Rank Beyond My Location: A Guide to How This WorksHow to Find Your True Local CompetitorsThe Ultimate Cheat Sheet for Taking Full Control of Your Google Business Profiles Curious about what other insights you’ll find in our survey? Download the full, free Moz State of the Local SEO Industry 2020 report. Get the Full Report To help us serve you better, please consider taking the 2020 Moz Blog Reader Survey, which asks about who you are, what challenges you face, and what you'd like to see more of on the Moz Blog. Take the Reader Survey Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Proximity Third: A Deeper Dive into a Local Ranking Factors Surprise"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Proximity Third: A Deeper Dive into a Local Ranking Factors Surprise"
    },
    {
      "level": "H2",
      "text": "First, a quick definition of user-to-business proximity"
    },
    {
      "level": "H2",
      "text": "Proximity third: the data"
    },
    {
      "level": "H3",
      "text": "GMB elements ranked #1"
    },
    {
      "level": "H3",
      "text": "Google review elements ranked #2"
    },
    {
      "level": "H3",
      "text": "Proximity ranked #3"
    },
    {
      "level": "H2",
      "text": "Three theories for making sense of the proximity shift"
    },
    {
      "level": "H3",
      "text": "1. Could respondents just be wrong?"
    },
    {
      "level": "H3",
      "text": "2. Could \"it depends\" be making absolutes impossible?"
    },
    {
      "level": "H3",
      "text": "3. Could a desire for control be at play here?"
    },
    {
      "level": "H2",
      "text": "Can we know the truth?"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}