{
  "url": "https://moz.com/blog/pubcon-next-week-sessions-party-werewolf-games-more",
  "slug": "pubcon-next-week-sessions-party-werewolf-games-more",
  "title": "Pubcon Next Week: Sessions, Parties, Werewolf Games and More - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Next Tuesday, Pubcon Las Vegas 2008 kicks off, and we're sending a big cadre of mozzers to the show. For the first time ever, SEOmoz will have a booth at Pubcon, so please stop by, check out Linkscape, Trifecta and our other PRO tools and get a special Pubcon show discount on SEOmoz PRO membership.…",
  "content": "Pubcon Next Week: Sessions, Parties, Werewolf Games and More SEO Events By: Rand Fishkin November 4, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 4, 2008 Pubcon Next Week: Sessions, Parties, Werewolf Games and More SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Next Tuesday, Pubcon Las Vegas 2008 kicks off, and we're sending a big cadre of mozzers to the show. For the first time ever, SEOmoz will have a booth at Pubcon, so please stop by, check out Linkscape, Trifecta and our other PRO tools and get a special Pubcon show discount on SEOmoz PRO membership. Mozzers in attendance will include: Rebecca Kelley Jane Copland Danny Dover Ben Hendrickson Gillian Muessig That one guy with the beard We've also got a special offer - that's good for only the next 36 hours - a 20% discount off Pubcon's standard pricing (make sure to go all the way through the checkout process to see the discount), saving you $180 on a full pass. Use sm-12220 before midnight Wednesday, November 5 on the register page to qualify. And, if you're attending, don't miss SEOmoz's 2nd annual Search Spam / Werewolf party on Wednesday night, November 11th, from 7-10pm. If you attend you'll get your very own Werewolf deck. There's only 144 tickets available (and shrinking), so email Gillian _at_ SEOmoz.org to get registered on the guest list. For parties on the other 4 nights of the conference, make sure you follow @josephmorin on Twitter to get daily/nightly updates on where to go. And, oh yeah, Pubcon also has great sessions to learn SEO/SEM/SMO/etc :-) I'm particularly looking forward to: Being an Effective SEO Within Your Organization on Tuesday at 11:30am (I think this is a really important topic that sometimes gets under-served) Is Social Media & Search a Love Story or a War Story on Tuesday at 2:50pm (Fight, fight, fight!) Discover Techniques Used by Enterprise-Level SEOs on Tuesday at 4:10pm (Since most of our consulting work these days is for big brands, this really caught my eye) Competitive Intelligence: Know Thy Competitor Well on Wednesday at 11:30am (I love competitive intel - in case you couldn't tell from all the competitive focused tools we build here) Interactive Site Reviews: Focus on Links on Wednesday at 2:50pm (Rebecca and Rae are both on the panel, so it's gotta be good) Five Bloggers and a Microphone on Wednesday at 4:10pm (I was on this panel last year, and it was tons of fun) Linkfluence: How to Buy Links with Maximum Juice and Minimum Risk on Thursday at 11:30am (Crossing my fingers that the search reps don't attend this one) Top Secret Tools of the Trade on Thursday at 1:30pm (Anyone who knows me knows I love tools) Community Hacking - 96 Baiting Strategies You Can Employ on Thursday at 2:50pm (I just want to see them try to describe 96 tactics in 75 minutes) The agenda is incredibly diverse and there's a large number of concurrent sessions. Please stop by the SEOmoz booth, or catch us in the halls, pubs, restaurants and casinos after hours. Hope to see you all there! p.s. Looking at Kayak.com, flights are still pretty darn cheap, and the conference hotel - Treasure Island - still has rooms from $89/night. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Pubcon Next Week: Sessions, Parties, Werewolf Games and More"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Pubcon Next Week: Sessions, Parties, Werewolf Games and More"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}