{
  "url": "https://moz.com/blog/pubcon-from-a-conversions-conscious-perspective",
  "slug": "pubcon-from-a-conversions-conscious-perspective",
  "title": "PubCon from a Conversions Conscious Perspective - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I've recently been tasked with managing our PPC campaign and working with Jeff on tweaking our landing pages in order to increase our Premium Membership conversions. This week at PubCon I attended as many conversions, PPC, and landing page-related sessions as I could to see if there were any tips…",
  "content": "PubCon from a Conversions Conscious Perspective SEO Events By: Rebecca Kelley December 10, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley December 10, 2007 PubCon from a Conversions Conscious Perspective SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I've recently been tasked with managing our PPC campaign and working with Jeff on tweaking our landing pages in order to increase our Premium Membership conversions. This week at PubCon I attended as many conversions, PPC, and landing page-related sessions as I could to see if there were any tips or tactics I could pick up. I'd classify myself as someone who knows more than the basics about PPC and conversions but is by no means an expert (otherwise, I'd be the one on the panel, right?), so I was hoping that the sessions I attended would cater to people like me, the \"middle of the road\" folks who don't need a 101, but rather some guidance about what they're doing wrong and how to improve their conversions. With that being said, I attended 4 sessions that were designed to help marketers and webmasters with their SEM campaign: PPC Marketing 101 I knew that this was a 101 course, but I attended anyway in hopes that there would be some hidden gems I could extract from the session. Christine Churchill, a friend, lovely human being, and president of KeyRelevance, started things off with 15 effective PPC ad writing tips. One of the tips that stuck out to me was to create a sense of urgency, such as include phrases like \"limited time,\" \"offer ends soon,\" \"today only,\" and \"the first 50 visitors.\" I wonder, however, if this sort of ad needs to be rotated or changed frequently because it's time sensitive, or if you can keep the ad up indefinitely because new eyeballs will constantly be seeing your ad and thus won't know that your \"offer ends soon\" really means \"offer never ends--we just want you to click on our ad.\" Friend and Lovely Lady #2, Mona Elesseily from Page Zero Media, who wrote the book on Yahoo! Search Marketing (uh, literally), talked about some differences between Google Adwords and Panama. At this point we're only running campaigns on Google, but we'll most likely expand to Yahoo and MSN after I get the hang of PPC and am able to garner some success with our current campaigns. I did find it interesting how YSM allows you to have 40 characters in your header vs Google's 25. I wonder if the extra characters makes a difference in clickthroughs, or if the limited characters forces marketers to craft their campaigns for optimal clickthroughs and thus extra characters wouldn't make much of a difference. I think I could be more creative with more characters--I can't tell you how many times I've come up with a headline I've wanted to use, only to get as far as \"12 SEO Tools That Kick As\" (kidding, though our tools do kick ass). Lastly, Andrew Beckman, president of SearchAdNetwork, talked about bidding on misspellings and having an ad that incorporates misspelled words because it's likely that you're the only one bidding on the misspellings; thus, your ad will be the only one showing. I asked him how effective this strategy is because I know that when I search for something and get a \"Did you mean blah blah blah?\" prompt, I go \"Oh yeah, I did,\" immediately click on the corrected search query, and don't even see the search results page long enough to notice any paid ads displayed. Andrew said that he gets clicks and conversions from misspellings as long as there aren't any competitors doing the same thing, so I guess it does work. Quality Score Management The second SEM session I attended was Quality Score Management. Mary Berk from MSN talked about some general quality score stuff, but the really interesting thing she touched on was that she wanted feedback from the audience and attendees about how much information MSN should share about their quality score formula. Currently, MSN displays information about your ad quality, your total quality on a numbered scale, your minimum bid, and your mainline reserve, but she said that MSN was mulling over the option of having a drilldown menu that provides the following information: ad text landing page ad performance consumer engagement keyword choice and bidding aggregate information Mary contended that the potential problem with the second route is that it leaves the system vulnerable to gamers/spammers, so she wants feedback on what type of quality score metrics to divulge/expand on. I personally think that more fleshed out QS metrics would be really valuable to marketers, as it leaves out the guesswork and helps marketers better tweak their campaigns to get better results faster. Geoff Price from Efficient Frontier talked about some common myths and misperceptions about quality score, including the following: There is only one QS. Geoff said that there are multiple math formulas, one for each of the following: ad position on search minimum bid eligibility and position on a content site other relevance factors The QS is updated daily. I'm not sure how often the QS is updated, but he did mention that the Adwords Blog said on September 18 that QS changes will no longer be pre-announced. You can 100% control your QS. At this point, a man in the audience disagreed with Geoff and said that you can completely control your quality score, but I'm inclined to agree with Geoff. The search engines can make changes to their QS formulas at any given moment, and you can't control what their metrics are, so one factor could take into account a metric that's completely beyond your control. Restructuring an account kills your QS history. This just doesn't make any sense--why would the search engines penalize you for tweaking your accounts? Nobody can strike gold on the first try, so it's silly to think that you'd get dinged for not having a perfect account from the get go. QS is about improving the quality of your ads and nothing else. Obviously, your QS is about a multitude of factors, such as your landing pages, your keywords, your account structure, etc. Also, your quality score isn't just good for the advertiser, but for the consumer and for Google as well. Lastly, Michael Stebbins, CEO and founder of Market Motive, suggested creating a \"Relevantastic Landing Page\" by making your landing page relevant to every ad. You can do this by making your home page dynamic in order to match the search query (do it server side with PHP). I got the gist of what he was saying, though the technical aspects were a bit over my head (CTO to the rescue if ever we decide to implement this). Landing Page Optimization Mona Elesseily was back in action, and this time she had some tips on catering ads to different buyers' needs. She recommended testing pricing on your ads, information that reassures your buyers (e.g., \"Official Site\" and \"24/7 Phone Support\"), and, like Christine Churchill recommended, time sensitivity (\"Offer Ends Soon,\" etc). Mona also mentioned that \"Get Thermal Oxidizers\" performed much better than \"Need Thermal Oxidizers?\" for her B2B client, which I found interesting because I wrote \"Need _______?\" for a few of our ads. I'll have to test a few \"Get ________\" and see how well they perform. Lily Chiu, senior strategist for Offermatica (which we're running on our landing pages), suggested analyzing your sources when altering your landing pages, such as your search queries and geolocation. She also recommended considering settings like screen resolution and language. Lastly, Janet Driscoll Miller, president and CEO of Search Mojo, gave the audience some landing page best practices. She recommended keeping information above the fold and to avoid scrolling if you can avoid it. I personally prefer shorter, more succinct landing pages, but conversely, our winning landing page for our Landing Page Contest was a long form that was ~25 pages long, so obviously scrolling converts for some people for some weird reason. Janet said that a simple landing page layout is a logo and headline followed by a \"hero\" shot (a graphic of some sort) on the left, a caption on the left, and the content and/or form on the right. Multivariate Testing and Conversion Tweaking Glenn Alsup, the president of Viewmark, said that one of his clients added a \"There are X matching accessories\" line at the top of his landing page, which correlated with the number of accessories the page displayed. This line acted as a continuation of the ad that advertised accessories, and the result was a 53% success rate and 400% less clicks (meaning that users were finding what they wanted quicker and easier). Jeff and I thought this tactic was really interesting, and we're thinking of testing the \"search result\" line on our landing pages. Tom Leung, product manager for Google, discussed Google Website Optimizer. He reminded us that your pages may lose more than half their visitors in mere seconds, and most of the people who do stay choose not to convert. This fact was supported by an interesting chart that showed the total number of visitors who enter onto a page and the sliver of those visitors who end up converting. Tom said that the industry average is around a 2-3% conversion rate, so if you're hitting those numbers you should be doing fairly well. Tom recommended testing a small number of variations and wait for about 100 conversions per combination. He also stressed testing big changes. If you can't see a difference between two combinations in 8 seconds, chances are that your visitors won't notice anything, either. Run the tests for around a month and don't jump to conclusions--instead, focus on an absolute conversion difference. The three biggest things to test are: The headline The image The call to action Tom also suggested testing trust seals (on/off), swapping testimonials, aspirational vs. fact-based pitches, implementing videos, and tweaking your navigation bar. Philippe Lang essentially talked about LivePerson's features, so check out the website and poke around if you feel so inclined. Lastly, Boss Man Rand Fishkin talked about SEOmoz's Landing Page competition (I'll add a link to his presentation once he gets it to me). Conclusion Overall, I'd say that I did get some nice takeaways from each of the sessions, despite most of them being fairly 101 in nature. I think that people like me who are either starting out in the sordid world of Conversions or have been tasked with being the Conversions Guru at their company have a nice selection of sessions to attend that flow logically and complement each other. Obviously, all of the tracks stressed basic information and highlighted the importance of your keywords, testing, and landing pages, but that just means that those facets are the most essential takeaways and thus should require most of your attention. The specific means and tips to tweak your keywords, testing, and landing pages is what truly interested me, and I hope that future panelists will keep that in mind and share their secret sauce with the audience. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "PubCon from a Conversions Conscious Perspective"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "PubCon from a Conversions Conscious Perspective"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}