{
  "url": "https://moz.com/blog/public-media-2007-conference-wrapup",
  "slug": "public-media-2007-conference-wrapup",
  "title": "Public Media 2007 Conference Wrap-Up - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The Public Media Conference in Boston proved to be one of the most unique audiences I've ever spoken to. Rather than webmasters and business owners, the crowd consisted primarily of reporters, station executives and public media contributors. These folks share the interests and goals of traffic,…",
  "content": "Public Media 2007 Conference Wrap-Up SEO Events By: Rand Fishkin February 25, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 25, 2007 Public Media 2007 Conference Wrap-Up SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The Public Media Conference in Boston proved to be one of the most unique audiences I've ever spoken to. Rather than webmasters and business owners, the crowd consisted primarily of reporters, station executives and public media contributors. These folks share the interests and goals of traffic, branding, influence and connection, despite the difference in focus (profit vs. relevance & funding opportunities). In addition to sharing some words on SEO, traffic building and blogging, I also learned quite a bit from sitting in some sessions. The first session I attended discussed election coverage and how several media organization have had success using non-traditional formats to make election coverage relevant and valuable to their audiences. I heard from a former political consultant to Gerald Ford about a movement called Unity '08 that seeks to draft a bi-partisan President/Vice-President combination for the White House in 2008. It's certainly a noble effort, and one that will be interesting to follow - the speaker himself, Doug Bailey, certainly had an exceptionally insightful view of politics and media, a rare quality. Possibly the most interesting session I saw was on \"Gaming the News\" - creating online games that would entice audiences and invite viral sharing - sounds a lot like linkbait :) There's a few examples that are worth mentioning - Games from the Gotham Gazette, the Airport Security game from Persuasive, Minnesota Public Radio's Fantasy Legislature - a great concept, well executed. Sadly, I didn't get to see more as I had to run to catch a plane shortly after my session. I did, however, make the acquaintance (and, I hope, made a friend) of Henry Copeland from Blogads.com. Henry's a very smart guy - someone who \"gets\" the web and is impressively self-effacing about his network's strengths and weaknesses, which makes him a very easy to like fellow. If I can get some of his time, I might ask him a few relevant questions for the blog in the near future. BTW - Many thanks to Kevin Dando of PBS for the invitation to speak; I hope that my participation was valuable. UPDATE: For those seeking a copy of my presentation, you can find it here - https://moz.com/2007/bostonseo.ppt (right click and \"save as\" to download). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Public Media 2007 Conference Wrap-Up"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Public Media 2007 Conference Wrap-Up"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}