{
  "url": "https://moz.com/blog/pulling-a-fast-one-a-clever-internet-marketer-is-trying-to-trademark-seo",
  "slug": "pulling-a-fast-one-a-clever-internet-marketer-is-trying-to-trademark-seo",
  "title": "An Internet Marketer Tries to Trademark \"SEO\" - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "May It Please the Mozzers,\n\nI was working on trademarking some SEOmoz marks the other day, when I noticed that someone is trying to register the trademark \"SEO.\" I was shocked. Apparently, the guy who's doing this has managaged to get all the way to the publication stage of the registration…",
  "content": "Pulling a Fast One: A Clever Internet Marketer Is Trying to Trademark \"SEO\" E-Commerce SEO By: Sarah Bird April 7, 2008 Table of Contents Copied! By: Sarah Bird April 7, 2008 Pulling a Fast One: A Clever Internet Marketer Is Trying to Trademark \"SEO\" E-Commerce SEO May It Please the Mozzers, I was working on trademarking some SEOmoz marks the other day, when I noticed that someone is trying to register \"SEO\" as a service mark. I was shocked. Apparently, the guy who's doing this has managaged to get all the way to the publication stage of the registration process. That means he has passed the preliminary review by the Trademark Office's (\"TMO\") reviewing attorney. Currently, the registration is in a sort of waiting period during which people who would be harmed by the registration can file an objection with the Trademark Office. In short, it appears that the applicant, Jason Gambert, managed to convince the TMO's reviewing attorney that SEO is a \"process\" involving manipulation of keywords, and not a \"marketing service.\" The reviewing attorney basically bought his incoherent argument that while \"SEO\" can't be trademarked when it refers to a generic process of manipulated keywords, it can be a service mark for providing \"marketing services...in the field of computers.\" The only thing left to do is to object and explain that \"SEO\" is more than a process to manipulate search engines using keywords. Further, someone needs to explain to the TMO that virtually every SEO could be said to provide \"marketing services...in the field of computers.\" If you want to review the relevant documents, they are all available to the public in the Trademark Application and Registration Retrieval system, TARRs. Simply plug in the application's serial number, 77171330, into the TARRs database, and you can view all of the documents by date. Note: I would deep link to the individual documents, but I'm not sophisticated enough to get around the session id timeout issues. Perhaps someday I'll be clever like Rebecca. In order to make sense of what's going on here, remember that in order to qualify as a trademark, it must be distinctive and you must be the first to use it in your industry/area. The TMO often rejects marks that are merely descriptive. They also reject marks when you're not the first to use it in your industry/are. I'm using \"Industry/Area\" because the concept includes both the goods and services you provide (do you sell kitchen products? Do you help people with your taxes? Do you provide internet marketing? etc etc) AND the geographic reach of your industry. (Is your market limited to your city? Your Region? Your Nation? The Globe?) When there are trademark contests, the TMO looks at both the kind of goods and services you provide as well as the market you serve. I review these things here so that you can understand why so much emphasis is placed on describing your \"goods and services\" in the trademark application. The TMO actually has a large list of pre-defined classes of goods and services to assist in describing and searching for conflicting marks. As you can see below, the TMO really struggles to define the appropriate description of \"goods and services\" for \"SEO.\" Let's take a look at the key dates and issues in the life of this absurd trademark application: Original Filing on May 2, 2007 Jason Gambert applied for registration of the mark \"SEO.\" He described the relevant goods and services as: \"Search Engine Optimization, Hosting, Webdesign, Software, Hosting, Domain Name, Software Development, All Computer Related Development and Marketing plus what is listed; Computer Software, Computer Hardware, \"SEO\" Letters to be trademarked in \"All\" Computer related areas.\" Does this sound like something you or anyone you know does for a living? Let's just come right out and say it. It's pretty clear what this man's intention was. He was trying to own SEO and he was trying to own it for search engine optimization and other related internet marketing strategies. Theoretically, if he had successfully registered SEO for this expansive area, he probably could have sent Cease and Desist letters to just about everyone who's likely to read this blog. (Now would he have successfully been able to defend this mark in a Court of law? Probably not. But can you imagine the panic, stress, lawyers, and nastygrams that would have been issued? <shudder>) It gets funnier. The application asks when the first use of the term ocurred anywhere. What does he say? \"At least as early as 02/14/2007.\" Ha! The Trademark Office Rejects the Application on August 15, 2007 At first, it appears that the fine folks at the Trademark Office are going to get this right. The reviewing attorney politely and firmly responds to Gambert with a long list of reasons for refusal and problems with the application. Likelihood of Confusion with Prior Pending Application. The TMO identifies two other trademark applications which were filed prior to Gambert's that may bar his registration. Those applications are for \"Titan SEO\" and \"Reno SEO.\" (Note: there are other combinations of SEO registered, I'm not sure why these aren't listed as a bar to Gambert's application.) Mark is Merely Descriptive. The TMO points out the obvious objection that the proposed mark merely describes a feature or characteristic of Gambert's Services. The reviewing attorney even attaches sample SERPS listing \"SEO\" in connection with computers and search engine optimization. She argues, \"The applicant's proposed mark, SEO, is merely descriptive of its computer related services. The acronym SEO stands for \"Search Engine Optimization.\" See attached evidence. The applicant's proposed mark is for \"search engine optimization\" services, among other computer related services. See application....In addition to being merely descriptive, the proposed mark appears to be generic in connection with the identified services and, therefore, incapable of functioning as a source-identifier for applicant’s services. The Identification of Goods and Services Is Overbroad. Gambert's application attempts to define the relevant Goods and Services with the broadest terms imaginable to that he can claim trademark on \"all computer related areas.\" The reviewing attorney counseled him to choose one of the pre-defined areas or classes of goods and services. Alternatively, if he wants the mark to apply for more than one of the pre-defined classes, then he needs to pay the multi-class fee. Gambert Amends His Application on September 19, 2007 to Narrow the Scope of the Relevant Goods and Services After reviewing the TMO's objections, Gambert amends his application. He writes, \"I have now removed any and all acronym qualities for the term \"SEO\" for search engine optimization.\" In addition, he attempts to narrow the scope of the relevant Goods and Services from \"all computer related areas\" to \"Direct marketing services for others in the field of computers. Search engine marketing. Domain name.\" Again, how is this different from the generic and widespread use of \"SEO\" in commerce? Notably, Gambert attempts to explain the mark's significance so that it doesn't look like the generic acronym for search engine optimization. He writes, \"SEO appearing in the mark means or signifies System Efficient Optimization in the relevant trade or industry or as applied to the goods/services listed in the application.\" Full points for creativity. But does that really get around the fact that people in the internet marketing industry use the term SEO widely and generically? Between September 22, 2007 and January, Gambert uses various online dictionaries to argue that the generic use of \"SEO\" refers to a process, and is therefore completely different from his unique use of the term \"SEO\" for direct marketing services. On September 22, 2007, Gambert sends a pdf of the Dictionary.com definition of SEO to the TMO. It states that search engine optimization is a noun that means \"the process of choosing targeted keywords and keyword phrases related to a Web site so the site will rank high when those terms are part of a Web search; abbr. SEO.\" He sends the TMO other online dictionary and encyclopedia sources that narrowly define SEO as a \"process\" involving \"keywords.\" It's not entirely clear what Gambert is getting at, but it appears that he is trying to convince the TMO that \"SEO\" in the specific context of search engine optimization is merely a process, and not a service. Therefore, he seems to argue, since he is using \"SEO\" to describe general marketing services, his use is unique from the common generic use of SEO as a process. He concludes \"The proposed mark, SEO, is for a service not a process.\" On January 2, 2008, the TMO again rejects the proposed Application. On January 2, 2008, the reviewing attorney follows up to Gambert's September and December communication. She informs him that the prior applications are no longer a bar because they were abandoned. However, she maintains that Gambert's application cannot be accepted because the proposed mark is merely descriptive: The applicant's proposed mark, SEO, is merely descriptive of its computer related services. The acronym SEO stands for \"Search Engine Optimization.\" See attached evidence. The applicant's amended services are \"Direct marketing services for others in the field of computers.\" See application. The proposed mark SEO is descriptive of the applicant's amended services because the subject matter of the applicant's marketing services is computer serach [sic] engine optimization....Therefore, the proposed mark, SEO, is refused because it is merely descriptive of a feature or characteristic of the applicant's services under Section 2(e)(1). Here again, it looks like the TMO is going to get this right. The reviewing attorney states the obvious that SEO stands for search engine optimization and that the applicant's \"direct marketing services\" seem to include SEO. Therefore, it cannot be used as a service mark. Not only did she nail him again, she gave him an additional reason for refusal. When applying for a trademark on the first-use-in-commerce basis, you need to give an example, or \"specimen,\" showing your use. This shows that you are in fact using the mark and helps to identify the context in which you are using it. The specimen Gambert submitted with his application didn't even have the expression \"SEO\" on it. Instead it was certification by the State of Arizona that he was using the trade name \"Modern Consulting Solutions.\" Note to would-be mark-holders: You have to show that you use the mark. Send them something that actually contains your mark in it. (Duh, right?) On January 3, 2008, Gambert shoots off a bitter and confusing response to the TMO's Refusal. Finally, Gambert does more than quote a sentence from a dictionary. You can see he loses his temper in the quote below. I realize that the quote is awfully long. But I wanted to include it so that you people who know your jobs better than I do can try to make sense of why this internet marketer thinks he should be able to hold the service mark for \"SEO.\" Also, rather than litter the quote with a \"[sic]\" after \"[sic],\" consider this a blanket [sic] for the whole thing. Gambert responds to the reviewing attorney's refusal thus: Mark is undeniably not merely descriptive--MAINTAINED and CONTINUED Registration should not be refused for the forgoing reason; the proposed mark does not merely describe a feature or characteristic of applicant's services. SEO is undeniably not a service; it is a process that is not a part of applicant's services. The applicant has considered attorneys arguments for refusal carefully and found the arguments are not congruent to the arguments of registration. The applicant has provided substantive evidence with simply the lack of it. There is no evidence that has any realistic credible value as “SEO” having anything to do with a service. SEO is the known acronym for “Search Engine Optimization and after a careful break down of the root words that SEO consist of, they do have realistic official English linguistic value. What they do not have however is any definition describing “Search Engine Optimization” as having anything to do with a service.” All previous arguments and evidence submitted of the official English linguistic value of “SEO” are maintained. Attached is the evidence of “Net lingo” to be discredited as having any “Official English linguistic value.” As you can see with the attached evidence Net lingo is hearsay, or modern day definitions of slang. Their opinions have no official English linguistic credibility. The benefit of the doubt is with the applicant therefore if proof of SEO having any realistic official English linguistic value of being a service is not found, registration should not be refused. The applicant’s proposed mark, SEO, is not descriptive of its computer related services because it is simply a process, not a service. SEO would lean more toward \"a process performed with a computer as a tool to perform the process\" \"SEO\" is a knowledgeable process really having nothing to do with computer services at all given the fact it is a process not a service. That is like calling a screwdriver a hammer! The acronym SEO stands for “Search Engine Optimization.” The applicant’s amended services are “Direct marketing services for others in the field of computers.” See application. The proposed mark SEO is not descriptive of the applicant’s amended services because the subject matter of the applicant’s marketing services undeniably is not a process. Search engine optimization is a process not a service. All attached evidence illustrating that SEO, is the known acronym for search engine optimization has no congruent value that should bar registration given the official definition. Therefore, the proposed mark, SEO, should not be refused because it is not merely descriptive of a feature or characteristic of the applicant’s services. “SEO” is a “process” not a service. In addition to being not merely descriptive, the proposed mark is exclusive because of the absence of any connection with being a service. Therefore it is wonderfully capable of functioning as a source identifier of applicants’ services. “SEO” is a process not a service. Specimen will be submitted when the term “Generic” is no longer used after reconsideration! In addition to the above mentioned “SEO” has been in use and affiliated with applicant for over 5 years acting for additional grounds for registration. Okay. I'll be honest. I have no idea what Gambert is talking about here. Whatever it is, he is clearly passionate about it. And he again appears to be arguing that the generic term \"SEO\" refers only to a process, and that his special use of \"SEO\" refers to a service??? And this in his mind is why he should be able to trademark SEO. But I'm not entirely certain. If you have special insight into this man's mind, please let me know. I get thrown off by phrases like \"congruent value,\" and \"realistic official English linguistic value,\" and \"SEO is a knowledgeable process really having nothing to do with computer services at all given the fact that it is a process and not a service.\" Huh. <scratches head> Pity the over-worked TMO attorney who has to deal with this response. The reviewing attorney AGAIN refuses the application on January 8, 2008. After considering Gambert's response, the examining attorney AGAIN found them unpersuasive because he has not supplied any evidence that SEO is not descriptive of his services. So here's this internet marketer who wants to use SEO in commerce to identify his business, but he has to state that the process of search engine optimization has nothing to do with his business. Gambert's application is so convoluted and unclear that the reviewing attorney has no clue what he really does. She basically responds that she is willing to allow the registration so long as Gambert is providing the services for someone other than himself and that the service he is providing is not search engine optimization. She states, [I]t appears from the arguments submitted by the applicant that [the applicant] is providing direct marketing of its own goods and services. In other words, if the applicant is providing direct marketing services for the benefit of others such that it is compiling advertising campaigns for its customers, then the applicant is providing a service. However, if the applicant is mailing advertising about computers that discuss its own search engine optimization (SEO) services, then the applicant is not providing a servcie thataht [sic] is distinct from its larger business.\" The reviewing attorney then asks Gambert to submit samples of advertisements or promotional materials so that it can determine whether the applicant's services are truly \"services\" as intended by the Trademark Act. Gambert's January 9th and 10th Responses Gambert follows the formula presented to him by the TMO attorney and refines his description of Goods and Services to read: \"Marketing services in the field of providing marketing services for the benifit [sic] of others in compiling advertising campaigns and promotional services for it customers.\" Doesn't this sound like an inarticulate way to say, \"I create link-bait\"? As further \"evidence\" to support his theory that the generic form of SEO refers to a process and not a service, he provides only the first two lines of a Wikipedia entry on SEO that describes SEO as \"the process of improving the volume and quality of traffic to a web site from search engines via \"natural\" (\"organic\" or \"algorithmic\") search results for targeted keywords.\" Well, if Wikipedia says it, it must be true! The TMO Accedes that \"SEO\" is a service mark on January 14, 2008. Apparently, the reviewing attorney's concerns that \"SEO\" can't function as a service mark were put to rest when Gambert clarified that he is providing advertising services to and for the benefit of others. Thus, she withdraws her objection to registration based on the mark's failure to act as a service mark. Apparently, she was also sufficiently convinced that SEO was a process about keywords and not a marketing service because she withdrew her objection that SEO was too generic and merely descriptive. I'm just speculating, but I think she basically gave up and said, \"Hey. If he says he's doing direct marketing and not SEO, then who am I to say otherwise?\" She does renew her request for an adequate specimen to demonstrate how the mark is actually used. Perhaps she was hoping the specimen would talk about search engine optimization or provide some other reason why the application should be refused. Oh yeah. She also requires him to add something about computers back into his description of Goods and Services because his original application related entirely to computer services. You can narrow your definition of Goods and Services in the application process, but you can't broaden it. Thus, she awkwardly recommends that Gambert amend his application (for the third or fourth time) to read \"Marketing services in the field of computer [sic] in the nature of providing marketing services for the benefit of others by compiling advertising campaigns and promotional services for it [sic] customers.\" January 15, 2008, Gambert Supplies an Alleged Specimen Things start looking up for Gambert, and he finally supplies an alleged specimen of his use of \"SEO.\" That basically looks like someone offering generic SEO services to me. What do you think? In addition to providing the above specimen, Gambert takes the reviewing attorney's advice and amends his description of the relevant goods and services to include something about computers: \"Marketing services in the field of computers in the nature of providing marketing servcies [sic] for the benefit of others by compiling advertising campaigns, promotional services, and consulting for its customers.\" Remember, when he began his application process, he was trying to claim the mark for \"Search Engine Optimization, Hosting, Webdesign, Software, Hosting, Domain Name, Software Development, All Computer Related Development and Marketing plus what is listed; Computer Software, Computer Hardware, \"SEO\" Letters to be trademarked in \"All\" Computer related areas.\" But apparently he \"misspoke\" since he later claims not to be involved in search engine optimization (\"the process\"). January 17, 2008, the Mark is Approved for Publication As of January 17, 2008, the TMO is apparently satisfied with the specimen and the description of the mark. Thus, the reviewing attorney approved the application to go to the next level, publication. March 5, 2008, Publication is Scheduled to Begin March 25, 2008. The TMO sends Gambert notice of publication.The mark of the application identified appears to be entitled to registration. The mark will, in accordance with Section 12(a) of the Trademark Act of 1946, as amended, be published in the Official Gazette on the date indicated above for the purpose of opposition by any person who believes he will be damaged by the registration of the mark. If no opposition is filed within the time specified by Section 13(a) of the Statute or by rules 2.101 or 2.102 of the Trademark Rules, the Commissioner of Patents and Trademarks may issue a certificate of registration. Where Are We Now? Well the only thing to do now is for those of us who use SEO in marketing for computers to explain to the TMO how we will be harmed if this service mark is granted. I suppose it's possible that Gambert wouldn't do something as foolish as send out Cease and Desist letters to all internet marketers using SEO in their titles... But if that were true then why would he try to register the mark in the first place? His first broad description of the goods and services he was trying to protect clearly indicates his intention to exclude others from using SEO for \"all computer related areas.\" I don't know about you, but I'll be filing a notice of objection to explain to the TMO that there's more to SEO than keywords. News flash! It's not just a process. It's a service, and I'm sure we all know someone who used SEO in connection with \"marketing services in the field of Computers\" prior to February 2007. On a final note, I could not find any trace of \"Jason Gambert\" on the web. Now, I didn't do an exhaustive search, but I tried some basic things like \"Jason Gambert,\" \"Gambert SEO,\" \"Gambert Arizona,\" and \"Gambert California.\" I think it's odd that the man claiming he was the first to use \"SEO\" in commerce for \"marketing services in the field of computers\" has virtually zero web visibility. His alleged specimen is devoid of a URL. His contact information is included in his application so one can find him that way, but you cannot find him on the web. I would be interested to go to his site and read how he is describing his services. Maybe someone knows of his company and would be willing to forward the link? Just goes to show you that people try and do the darndest things and that just because a company gets a mark registered doesn't mean that it's a valid mark. The potential for widespread grief if this guy registers \"SEO\" for \"marketing services in the field of computers\" is mind boggling. It's not too late to stop it, but people are going to have to speak up about it and let the TMO know they object. As always, I look forward to your comments and questions. If anyone has a better idea of who this guy is and what he's trying to say in his application, please share. Very truly yours, Sarah P.S. You can't open the entire case file on this page, but you can get a quick look at the status of the application for SEO here. REALLY LONG UPDATE ABOUT FILING A NOTICE OF OPPOSITION Before I describe the Notice of Opposition process, I would like to thank everyone who has taken an interest in this situation and who has helped to spread the word. It’s not too late to stop this proposed mark from being registered. If you are going to be harmed by registration of this proposed mark, please consider filing a Notice of Opposition. The $300 filing fee is a small price to pay to avoid the hassle this trademark could cause down the road. Important Disclaimer: This should not be construed as legal advice. I want to provide general information about filing a Notice of Opposition. Trademark law is complicated and each case has unique issues. There is no substitute for having a qualified trademark attorney review the specific facts of your case and assist you with the relevant legal issues. I encourage you to consult an attorney when filing a Notice of Opposition. It is possible and people do file Notices of Opposition without an attorney, but an attorney would make sure it gets done right. Opposition Proceedings Generally It is important to understand that by filing a Notice of Opposition, you are beginning a formal proceeding with the United States Patent & Trademark Office (USPTO). It is a contested proceeding, sort of like a lawsuit, but you’re not in a court of law. Instead, you’re bringing the proceeding before the Trademark Trial & Appeal Board. Filing a Notice of Opposition is a little bit like filing a Complaint in a civil lawsuit. It gets the proceeding started. Like in a civil lawsuit, sometimes all you need to do is file a Complaint and if the other party fails to respond, you win by default. Alternatively, if the other party decides to fight and actually Answers your Complaint, then you have to go through more stages, (like investigations, depositions, motions) and eventually a hearing on the merits. SEOmoz filed a Notice of Opposition today. You can review those filings here. You can download SEOmoz's complete Notice of Opposition and the TTAB's standard form letter regarding service and scheduling issues. Tips on Filing a Notice of Opposition Notices of Opposition must be filed within 30 days of publication. Thus, you should either file a Request for Extension or a Notice of Opposition by April 25, 2008. 1. Filing a Request for Time Extension If you don’t have time to work on a Notice of Opposition, or if you want to buy some time to consult a trademark attorney, it may be a good idea to file a Request for Extension. The Request for Extension is filed online with the ESTTA. It’s a fairly simple process. It buys you 30 additional days to put your thoughts together, and it sends the message that you’re not going to let the registration go down without a fight. 2. Filing a Notice of Opposition Has Online and Offline Components It’s useful to think of filing process for the Notice of Opposition as having two parts. The first part is all done online through the ESTTA. The online portion is mostly fill-in-the-blank. You’ll need to answer questions about who you are, the serial number of the application you are objecting to, and basic reasons why you are objecting. I suspect that most people will probably object based on the fact that the mark is “merely descriptive.” Some of you will also object because you believe that the proposed mark conflicts with your registered or common law mark. If you’re claiming that it conflicts with one of your current marks, you will also need to describe your current mark. Don’t forget, you can object on more than one basis. Most people do. The website provides a list of possible objections and you basically check some boxes. The offline part of the process requires you to create and upload “a short and plain statement” indicating why you would be harmed if the registration went through. You can see an example of the written NOO (Notice of Opposition) by looking at what I filed on behalf of SEOmoz, Inc. Please don’t be intimidated by the fancy-schmancy numbered paper and reference to specific laws in my NOO. It doesn’t have to be that fancy. Most people use a business letter format. Let’s take a closer look at what your NOO must include. A Notice of Opposition should include the following: The NOO should identify who you are and why you have a genuine interest in the proposed registration. Many of you would probably be filing on behalf of your business. You probably have an interest in the proposed registration because you commonly use “SEO” to describe your marketing services. In the legal world, you have must establish “standing” to start a formal proceeding, like an Opposition or a lawsuit. By explaining that you have something at stake in the matter, you are establishing “Standing.” A \"short and plain statement of the claim showing that you are entitled to relief.\" This basically means you have to explain, briefly, why a certificate of registration should not be granted. Tell the USPTO what your grounds are for objecting. Many of you would probably argue that the mark is merely descriptive, but there could be other grounds as well. You don’t have to reference the specific statute or case law. Here's a tip: when you're doing the online portion of the filing, you are presented a list of possible grounds and the statutory basis for them; whatever grounds you check on the list should also be included in your statement. The NOO must identify how you would be injured if the registration were granted. For many of you, the harm will be that you will be virtually gagged from talking about the marketing services you provide. The harm may also be the likelihood of customer confusion that would result from registration. Some of you may also have registered or common law trademarks that would be diluted by registration of “SEO.” You don’t have to prove the allegations at this time (that comes later), but you must have a good faith belief in their truth. Thus, you don’t need to stuff your Notice of Opposition with documents and proof. The purpose of the document is to give notice of what your allegations and arguments are; you do not have to provide evidence at this time. I included a few documents and websites in my NOO, but you don't have to provide your proof at this stage. The letter needs to include basic identifying information so that the USPTO can easily identify the case and who you are. The letter/statement should clearly reference the Serial Number of the challenged Application, the name of the parties (you and the Applicant), and label the document as a Notice of Opposition. The paragraphs should be numbered. Also, be sure and sign your document. As you can see, my example is very formal. However, you don’t need fancy pleading paper or headings. Conveying the information is more important than making it look lawyerly. After completing the online portion and uploading your statement, you must pay the $300 filing fee. You can do this online with a credit card. Once you’ve paid and everything is filed, you’ll get email confirmation that links to your complete Notice of Opposition (the online portion and the written portion). Go online and print out two copies. One for your records, and one to serve the Applicant. Mail a Copy of the Complete Notice of Opposition to the Applicant In addition to filing your paperwork online, you must “serve” a copy of the Notice of Opposition on the Applicant by mailing it to him. Use first class mail, and I highly recommend requesting a return receipt so that you have proof when he received it. Use the address provided by the Applicant in the application process. You can find this easily online. You're mailing what I call the \"Complete\" NOO because it includes the online printout and the pdf of your written statement. Don't just mail your written statement. The Applicant has 40 days to file an Answer to your Notice of Opposition. If he doesn’t Answer or file for a time extension, then the registration will most likely be denied by default. If he does file an Answer, then the Trademark Trial & Appeal Board will issue a schedule for further investigations, motions, and an eventual determination on the merits. Hopefully he’ll come to his senses and voluntarily withdraw the application. Again, I hope that this encourages you to protect your branding and your industry by filing a Notice of Opposition. Best of luck! P.S. I'd like to thank Venkat Balasubramani, a Seattle Trademark attorney, for his help an insight on the Notice of Opposition. UPDATE: Jason Gambert responds at JasonGambert.com. (Sorry. I'm not going to link to it.) Read for yourself what his stated intentions were in attempting to register the proposed mark. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Pulling a Fast One: A Clever Internet Marketer Is Trying to Trademark \"SEO\""
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Pulling a Fast One: A Clever Internet Marketer Is Trying to Trademark \"SEO\""
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Common Mistakes E-commerce Websites Make Using JavaScript"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sarah Bird\n          \n            Sarah Bird\n          \n            Sarah Bird"
}