{
  "url": "https://moz.com/blog/pump-up-the-bing-whiteboard-friday",
  "slug": "pump-up-the-bing-whiteboard-friday",
  "title": "Pump Up The Bing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This week Rand is joined by Duane Forester of Bing to talk about all thing Bing.  Rand and Duane will be talking about the shut down of Yahoo Site Explorer, early stages of social search, the return of the meta keyword tag as a spam signal, and some new features in Bing Webmaster Tools.",
  "content": "Pump Up The Bing Whiteboard Friday By: Casey Henry October 20, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Casey Henry October 20, 2011 Pump Up The Bing Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This week Rand is joined by Duane Forrester of Bing to talk about all things Bing. Rand and Duane will be talking about the shut down of Yahoo Site Explorer, the early stages of social search, the return of the meta keyword tag as a spam signal, and some new features in Bing Webmaster Tools. Speaking of Bing, there are a few great posts that came out this week talking about Bing. First, Slingshot SEO released a study on Google & Bing click-through rates which revealed some interesting information and is worth a read. Second, Yahoo announced that they have completed the algorithmic transition to Bing in all global markets. Enjoy and of course we look forward to hearing from you in the comments! Video Transcription Rand: Howdy SEOmoz fans. Welcome to another edition of Whiteboard Friday. This week I'm joined by my friend from Bing, Duane Forester. Duane, thank you for coming. Duane: Always a pleasure and thanks guys for your time. We'll try to use it wisely. Rand: We'll see about that. I've been known to spin all sorts of things. So, Duane, thrilled to have you back. Duane: Thank you. Rand: Thrilled to be talking about Bing. Some exciting news coming out of Bing. The first thing we're coving on our list, Bing now bigger than Italy? Duane: Yes, bigger than Italy. Bigger than Italy. Rand: Describe this for me. Bing, obviously, has way, way more users than 59 million, but you're talking about the pure ecosystem of Bing being of this particular size. Duane: Yeah. So, the actual ecosystem within Bing, the Yahoo and Bing ecosystem, essentially, we serve about 59 million people, 57 million, somewhere in that range of people. Now, what's important about these people is not that they comprise a group that is larger than Italy. That's kind of nice. Right? And it looks really good. But the reality is that these almost 60 million people only interact with the Bing ecosystem. They do not interact with any other search ecosystem. Rand: Interesting. So this is more of the exclusive. These are the Bing exclusive people. Duane: Exactly. Now, I'll through a couple more stats out there for you. 4% higher spend rate than other search engines. 23% more likely to make an online purchase. Rand: Okay. We've seen those stats previously. Duane: Exactly. So when you actually look at the value of those users, those 59 million people of that ecosystem, that has a net positive effect for a lot of businesses. So it really is something folks need to pay attention to. I mean, the search engine, we're 30% plus market share now. Rand: Yeah. Duane: I mean, I still meet people every day that are like, \"Oh, well, really? I didn't know.\" I'm like, \"You're doing your business a disservice. You have to pay attention.\" Rand: So what we should say to SEOs is, go tell all your competitors not to use Bing, so that you can use it and take advantage of the great customer base that they've got. Duane: And the higher conversion rates. Who doesn't want more money? I mean really? Who's got your back? Bing's got your back. Rand: And speaking of Bing having your back, Bing Webmaster Tools has some cool new stuff. Duane: Yes. Rand: You guys just completed this email alert integration over the last few months. Duane: We do. We have, right now, some integrated email alerts coming out for malware alerts. So, if we hit your website and find out that there's a problem, the net effect for the website is we block that in the search results and we alert the searcher that there's a problem there. They shouldn't go there, obviously. If it's an overt problem, we remove it completely from the index, so that somebody won't get hurt by going to the website. We also alert you in the Webmaster Tools. And, more importantly, now we're starting to send out email alerts to you. So you may not come into the tools today, but we'll get you an email alerting you that today we found a problem. Now that, that technology we're using is actually going to expand, and we're going to include other types of alerts. So, if there's a particular data point that you're looking at or information that we think is important to you -crawler went to an area, it's blocked, we can't get in, we think there's something valuable - maybe we'll send you an email and tell you, \"Hey, open that up for us.\" Rand: You can't call your own product database anymore. Interesting Duane: Exactly. Exactly. So, if there are things that you guys, data that you see inside Bing Webmaster Tools, and you think is really highly valuable and you want to get an update on it, get a hold of me. Okay? Ping us. Talk to us here through SEOmoz. Hit me up. Rand: @DuaneForester. Duane: @DuaneForester on Twitter. I am a real person. I'm only a bot half the time. The rest of the time it's me. I swear. And get that conversation going. Let us know what matters. Rand: Cool. And you guys have been trying to improve Webmaster Tools, as well, through some survey feedback. Duane: Absolutely. Rand: What are the early results from that? What are we going to see? Duane: I'm really impressed with it. First off, I want to say a thank you to everyone who took the time and was involved with the webmaster survey. I know that some of you guys watching out there, they will have been involved with this, and they would have given us our feedback. Thank you so much. I'm in the middle of going through it all right now. Right? So, I went through about almost 600 individual suggestions yesterday, of people saying, \"I want this tool. You need to do this. This feature needs a better UX on it.\" These kinds of things. And we're seeing everything, a broad range, from people saying, \"We want an organic keyword research tool,\" right down to some confusing things like people asking for a \"SERP view tool,\" which I'm not entirely sure how to interpret that. So, if you sent that in, ring-a-ding-ding, because I need a little more info. But, yeah. So, we're digging down on that. This week I'm pulling together the deck at work that actually informs our engineering team what we need to invest in. We go through triaging. We get to a stage where we do some cutting on it, so that we can actually fit it into the amount of work time we have available. Probably in the next two months or so we'll hit the green light stage. Then after that, it's build, build, build, and roll out new features. Rand: I really appreciate this about Bing, about what you guys are doing, that you not only take the time to collect feedback, but then you have a process. You'll tell us what that process is, and here's how the process goes. And then we'll get features out of Bing. Duane: Absolutely. Rand: Some of the crawling stuff and the linked data stuff that we requested, now it's in there. Some of the other stuff is out. Duane: Exactly. Rand: UX is better. Duane: Yup. Rand: It's very nice. Duane: This is kind of one of the benefits of having an SEO inside helping with this. I kind of know how to interpret what folks are looking for, but I'm only one mind. So we need this survey data to help me understand what's important now to businesses who are online, what they need. In fact, we're going to be running this survey again in another six months. To get included in it, open up a Bing Webmaster Tools account. That live ID you have, we capture those, and that's the email list that we send out to. Rand: Very cool. Duane: You get the benefit of the tools, and you're also included automatically. Rand: That's great. A bunch of reasons to sign up for that. Duane: Yes. Rand: So one of the things that I also appreciate about you guys is right now Google, in fact, this morning announced this change, so we're filming this a little earlier. But basically, right now, if I go to the Google search box, which I'm drawing in red for some reason . . . Duane: Primary color. Rand: . . . and type in a keyword like \"Duane from Bing,\" and I want to find you. I'm looking maybe for your Twitter account. If this goes to your personal website and I am logged into my account, so it will say RandFish@gmail logged in, which I actually don't check that account, so don't email me there. Rand@SEOmoz. But, if I'm logged into this account, Google will stop this keyword data from passing any information through the referral string, meaning that Google Analytics, Webtrends, whatever you're using, AW Stats, it doesn't matter the service you're using or your log files, you will not be able to capture the information that's being sent, that's passing in the search referrer's string. Is Bing also making this change? Duane: No. Rand: No. Duane: That's not on our radar at the moment. Rand: Bless you, sir. Bless you all. Duane: I'll be honest. I was surprised as everybody else when I heard about this. I was like, not really what I want, but I'm sure there's a good reason. I'm certain there is. Rand: I mean there's the top line reason given by Google, which I think is the privacy, user privacy is to get more personalization. But I think you guys do a great job with privacy and still pass this information. Duane: We're very keen on privacy. Absolutely. Rand: Certainly this hasn't come up as a problem in the past. I think the other, of course, there are folks on the Twitter suggesting that this is a change that could help boost AdWords' revenue, because people will be unable to see the organic search traffic and think. The only way that you can get this data is if someone clicks on the \"Search ads.\" Duane: Paid search ads. Rand: Right. The paid ads on the right or on the top. Even if I'm logged in, the paid search ads will still pass through. Duane: Shows up in AdWords and there are your metrics for it. Rand: Yeah. That's sad. Duane: I have no comment other than to say we're status quo right now. Bing's in here. Rand: Cool. Very cool. We appreciate that. Speaking of things that are not going to be status quo, we saw the announcements publicly that Yahoo Site Explorer is formally going away. Duane: Yes, it is. Rand: Do we have any more news on when exactly that's happening? Duane: We don't have a definitive deadline on it. But what people should be taking from this is, if this is the sort of thing that you have a high reliance on, now's the time to start finding another data source. Now, part of that data source will come through Webmaster Tools. We do consume part of the fee that comes directly from the Yahoo Site Explorer team, and the link data that we show inside Webmaster Tools is partially fueled by that data. Rand: Gotcha. So you're taking essentially Bing data and Yahoo index data, and then sort of combining those, and that's what I see in Bing Webmaster Tools. Duane: Exactly. Now, it's not a complete replacement. All right? I'm not going to lie to you guys. It is not a complete replacement. A big part of the reasons it's not a complete replacement is we believe in the one on one partnership that we have with webmasters, which essentially precludes us from sharing competitive data. So, I will tell you about what I have about your website, and you can have hundreds of websites and I'll tell you about all of those individually through the tool set. But I won't give you the facility to simply enter another domain of your choosing and get similar data back. Rand: So does this mean that even after Yahoo Site Explorer's demise, we should not plan on being able to go to Bing, either Webmaster Tools or another tool, and seeing competitive link data from you? Duane: Immediately, yes, but you guys get a vote in this. These surveys, contacting me, talking to me at the conferences, all of that data goes to inform how we build out tools. We may run into a wall, and I'm going to include myself with you guys in wanting that kind of data. Right? I run my own websites. I know what the value of this stuff is. But if we actually have a large enough voice, then I can take that, put my Bing hat back on, walk down the hall and go, \"Look guys. Here's why it matters. It is important. Here's how people are using it. This is what it allows them to do. So, how do we get them their competitive intelligence without giving away the farm, or creating other problems?\" We could hit a wall, and the answer is it's simply not possible. Rand: Okay. Duane: Or we may end up with some kind of split view that allows competitive information. So, for example, we feel these websites are related to you in some way, same topic, they rank near you, these kinds of things. We won't tell you the domains, but we will tell you the links that are pointing at them. Rand: Oh, interesting. That would be very useful. So something like, \"Here's links that point to sites like yours.\" Duane: Right. Exactly. And, ultimately, that's the type of competitive stuff that you're kind of after. Rand: Yeah, that would be very interesting to see, even anonymous. So let's move on to this other topic. You and I were exchanging some information about how you believe it's still very early in this transition from social data making its way into organic search and into SEO, and how Bing is trying to provide all of the relevancy involved in collecting multiple data sources and putting them together, with none of the creepy. Duane: Exactly. Rand: I appreciate that. I like a good slogan as much as the next guy. Duane: Yup. More relevancy, less creepy. This is a very real thing, because when you get into the social graph and pulling that information in, there's a lot of personalization that's happening. That's the whole reason for it. The story that I use, and this is a real story, I want new tires for my truck. I need the search engine to understand who I am in context of this search. So I have to be willing to explain more about myself, share who I am socially, what my interests are, what my hobbies are, so that the engine can go out and put together a view of who Duane is on the Internet to answer that question about the tires I want. Rand: As opposed to just here are things your friends liked. Duane: Right. Or here's an online web store that sells tires. Now go into their search functionality and go all over again and through it to find out what's in there. No, no, no. Get me out of that kludgy and get me to the point where I take out my phone and say, \"Tires for my truck. You know who I am. You know the make and model of my truck. You have the statistics on the vehicle, so you know what came with it. You also have a history that explains Duane likes to tinker. He doesn't leave anything alone, which means I'm going to modify. I don't want the stock tire. I want a big, meaty, aggressive tire that can take myself and Rand to the top of Mount Rainier.\" Rand: Whoa. Duane: That's what I'm after. Rand: I'm just going to draw this tire and try to illustrate how cool it's going to be. Duane: It's got to be bigger. Rand: See, look at those treads. Duane: Right? That right there is the future of search. Rand: That's just the top of your tire. Duane: That's the top of my tire? On the top of Mount Rainier. Rand: Oh, damn. Duane: Right? And you and me sucking on oxygen bottles so we don't pass out. Rand: Amazing. Duane: So anyway, the point behind it is that we're not quite at that stage yet. Right? All of these pieces, I've left this footprint out there. They're not being connected yet. Rand: I guess one of the things that webmasters want to know is, are we going to have to manually try and connect some of these things through formats like Schema.org? Duane: Yes. This is a large part of the move where the Web will evolve from a collection of links to a collection of objects. Rand: Yeah. Duane: Right now the objects are black holes. Pictures, videos, a person, or an object, like our tire, that isn't adequately defined. So if Schema.org, rich snippets of any kind, those things get implemented, they describe the objects, now suddenly the search engine understands not just the context of me but the context of the object. Now it can start bringing back relevant results to me. And not just, okay Duane, here's an aggressive tire to meet your needs, but your friends, their feedback, the communities you are involved in, that extended friendship, those start to influence the search results. Rand: So how much is Bing going to be doing things like adopting the rel=\"me\", and the author profiles, and the sort of references to where I can say, \"Hey, these are my profiles on the Web. So now go pull from these and learn more about me.\" Duane: Again, we are so early stages. We're not really committed to those, per se. So if people want to know what we're committed to and invested in, Schema.org. That's where it all lives. That's what we adhere to right now. Rand: You guys are on that right now. Okay. Duane: Additions to that can happen at any time. If we feel that the rel=\"author\" is going to make a substantial difference in relevancy to some degree, we're going to hop on board. Rand: Okay. Duane: Okay? Rand: Cool. Duane: There's no question about it. But it's, again, early and it hasn't been proven. Is it going to accomplish what it's intended to accomplish? Look back at sitemaps. Right? Sitemap's a great idea. Relevancy. Why is everybody a 0.9? Not everything is a 0.9. So these things evolve over time. Rand: Sure. Another question I guess is, today, right now, Bing is pulling in a ton of data from Facebook. Should we be anticipating that other networks may make their way in there? Duane: I think it would be fantastic. I have no official word on it. We, obviously, are very tightly aligned and happily aligned with Facebook. We get a lot of integrated data from them. Rand: They're obviously the largest by a long shot. Duane: Currently, yes. But, you know, at one time there was only Google, and now, 30% market share. Tada! So, it can happen, right? You get competitive forces in there and it makes a difference. So really what we want to be able to do is, we're asking ourselves, \"Have we done enough with the data we have? Have we maximized this data in a way that really improves relevancy, improves it broadly, but also on a personalized level? Take out the creepy, leave the relevancy.\" That type of thing. Rand: So let's go to our last thing. The Search Engine Land folks wrote a really interesting article where they cited some discussions with you, some sort of email back and forth, and a mention that you had had that, \"Oh well, we don't completely ignore the meta keywords.\" And suddenly, oh my god, all hell breaks loose. Duane: Yeah, it was an interesting day. Rand: Then there was this sort of indication from you that, hey, putting more keywords of the things that you're trying to rank for into your meta keywords, that is not a good use. That's not going to help you. But if we see some signals, and maybe you can explain those signals, we might view pages in a different way. The meta keywords is one of many things that we might even look at. Duane: Exactly. So meta keywords, in and of themselves, aren't going to suddenly boost your ranking. Let's get that clear right off the bat. Rand: He just said that. Duane: It's not like if I go and put words in there, and it's blank today, I will jump up in relevancy. Not going to happen. However, for people that are filling in their meta keywords, good for you. These are good things to do, and this is why they're good to do. If you're willing to take the time to get your meta keywords correct, you're paying a lot of attention to details. That is going to translate to everything you do, content creation, link building approaches, absolutely everything you do. Social will be picked up in the same way, because it's who you are. Rand: So, you're saying this is correlation but not causation. Duane: Right. Right. Now, let's say you're not filling in your meta keywords tag, and you're doing this for efficiency sake. You know there's no lift for it. You're not going to put the time into it. Again, not a problem. That is totally relevant. Just keep in mind though that there are services around the Internet that actually pull data from the meta keywords tags, that may take a cue from these things. So you want to be careful. Rand: These are things like internal search. Duane: Right. It could be internal search. I know that there are some contextual programs that will take a look at them. So you want to be careful and ask yourself, \"I'm skipping this. Am I hurting any of my other services in any way by not giving that signal?\" Now let's talk about the big one. You go in and you think to yourself, wow, I'm relevant for everything, including Viagra. You know what? Seriously guys, it is an old topic. But we see this all the time, still, today. My core search guy came to me on Friday and gave me an example of keyword stuffing that was implemented on Thursday on a brand new website. So people out there still think this is a valid tactic. Right? It's not. Although, as Danny points out in the article on Search Engine Land, if you're a spammer, by all means, please, stuff that keyword tag for us. Rand: Because we really want to know. Duane: It just makes it so easy to know to take another look. Rand: It's like putting on your black hat when you go out in public. Duane: Totally. Right? Absolutely. If you're going to use the keyword tag, follow the best practices. Get it right. Rand: Just to be clear, meta keywords is not the only place that you're going to be looking at spam signals. Duane: No, absolutely not. Rand: If you see that triggered in other places . . . Duane: Absolutely. So you can get your meta keywords tag right and spam in other areas. We'll still find out about it. We'll still give you the boot. Rand: Good to know. Duane, this has been fantastic. Thank you so much for coming. I hope we'll have you back again. Duane: Absolutely. Definitely. Rand: Congratulations on the growth with Bing and on the growth of Webmaster Tools. Duane: Thank you. Rand: And thanks everyone for watching. We'll see you again next week for another edition of Whiteboard Friday. Duane: Thanks for your time guys. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Pump Up The Bing"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Pump Up The Bing"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Casey Henry\n          \n            Casey Henry\n          \n            Casey Henry"
}