{
  "url": "https://moz.com/blog/put-your-tweets-on-autopilot",
  "slug": "put-your-tweets-on-autopilot",
  "title": "Put Your Tweets On Auto-Pilot - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Why we Tweet\nA good SEO strategist understands the importance of Social Media in everyday link building and branding techniques. But sometimes finding the time to do it can be a tough task in its self. \n\nYou may not have time to tweet, but you know that it is vital and also free.\n\nIn this article I…",
  "content": "Put Your Tweets On Auto-Pilot Social Media N By: Nathaniel Deal January 7, 2011 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! N By: Nathaniel Deal January 7, 2011 Put Your Tweets On Auto-Pilot Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Why we Tweet A good SEO strategist understands the importance of Social Media in everyday link building and branding techniques. But sometimes finding the time to do it can be a tough task in its self. You may not have time to tweet, but you know that it is vital and also free. In this article I am going to show you how to put your tweets on auto-pilot, to increase image branding, get more followers and even site traffic. Fact: User's that tweet often are more likely to gain more natural followers and drive more \"free\" traffic to their sites. And who wouldn't want that? What to Tweet Always tweet about whatever appeals to you. If you tweet with this in mind, you attract followers with similar interest and it will become much easier because it is exciting. Tweeting should not be a job, but a hobby that you really enjoy. Everyone is on the internet for a reason, talking to Facebook friends, reading articles, shopping or watching viral videos. And the truth is, everything you do on the internet could be turned into an interesting tweet. Creating Future Tweets Get into the mindset of future tweeting, take your day’s interactions and convert them into future conversation. Here are a few tips. Articles: If you find yourself reading an online articles, jot down interesting points and facts you learned while reading the article. Afterwards, take your notes and convert them in to tweets with 120 characters or less. Save them in a Word doc for future tweets, move on to the next article and repeat. This method can also be use to re-purpose existing content on your blog or article section. Read them again, and create 8 to 10 tweets based on the article. Facebook: People say interesting things on Facebook that never get tweeted. If your friend says some enlightened words of wisdom or comments on a popular social figure, quote them in a tweet. Add these to a Word doc and save them for future tweets. Followers love to be entertained and informed at the same time. Shopping: Okay so you love to shop, and maybe you're the best at finding the great deals. If you find some awesome coupons or websites that provide them (i.e. Groupon), add them to a word doc for future tweeting and share them with your followers. If you offer products or services, create some coupons or tweet about the benefits. Try not to self promote too much, but get it out there. Music & Videos: The next time you hear that new song on Myspace or see a cool viral video on Youtube, write it down and tweet it to your followers in the future. It’s a great way to show your style and give people a since of your interests. Believe me, people like to follow interesting people, and if you tweet the same old thing over and over, they will follow someone else. There are tons of other things you can turn into future tweets, including offline interactions with locals, family, work or whatever. Just write it down and tweet it later.Bonus: A few guidelines to proper tweeting.Beware of time-stamped tweets, if your tweet has an expiration date i.e. Christmas or current event, then manually post them.Be original, informative and witty with your tweets. Your followers will respond to you more often if you entertain them.Keep your tweets short and sweet, try to stay under 120 characters so that your followers can re-tweet your post and include your username.Don’t put links in every post! When you finally post a link, people are more likely to click on it. And make sure they count, (i.e. traffic to your site).Use #hash-tags and trending topics whenever possible, this will increase the rate of new followers finding you.Use popular URL shorteners. If you’ve never heard of it, then don’t use it. The most popular, and most clicked-on service is Bit.ly.Some people believe that you should re-post the same tweet 3-4 times a day so that you can reach your entire audience. I’m not a big fan of that method, but if you have some good content to share, then try to vary the wording of your tweets while conveying the same message. I could go on and on about what, and what not to do, but that is a whole other article. Okay, now that you know how to make future tweets, let’s find out the best times to tweet. When to Tweet According to HubSpots 3rd State Of The Twittersphere Report, the best times of day to tweet are 3 to 5 pm & 9 to 11pm Eastern Time. And clearly the best days to tweet are Thursday and Friday. These graphs represent the best day and times to reach the most active followers per tweet. So what times do you tweet most often? To find out, go to Tweet Stats and enter your username to see what times you are most active on Twitter. Now compare the times of your manual tweets with the best times of the day to tweet. Find your weak spots and note which days your not tweeting. Compose a list of the best times to auto-pilot your future tweets and the best days to do it on. Spend some time calculating these and it will pay off. Okay, so you have your Word doc full of future tweets, and you know the times and days you should be tweeting; let’s fill in the gaps, by scheduling them on auto-pilot. How to Schedule Tweets There are a lot of free tweet schedulers available to use today. And you may even have an account with one already. My top 3 picks are Tweet Deck, Hoot Suite & Social Oomph. I’m sure there are lots more available, so if you're uncomfortable with these choices you can Google “tweet scheduler” and find one more suitable for you. Spend an hour or two every week scheduling your tweets in the times that you don’t manually tweet. The services will allow you to pick times and dates for future tweets and when you schedule one, just remove it from your word doc. If you tweet regularly, you will see results. Personally, I’ve seen these steps increase traffic and dedicated followers by the hundreds. Auto-piloted tweets are a great way to stay in front of your followers but they are not the end all. You should continue to manually post tweets at the same time and days that are most convenient for you. Focus on replies and re-tweets during these times to gain the respect of your followers and seem more human like. Remember no-one likes to follow a robot. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Put Your Tweets On Auto-Pilot"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Put Your Tweets On Auto-Pilot"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Nathaniel Deal\n          \n            Nathaniel Deal\n          \n            Nathaniel Deal"
}