{
  "url": "https://moz.com/blog/putting-the-customer-back-in-acquisition",
  "slug": "putting-the-customer-back-in-acquisition",
  "title": "Putting the \"Customer\" Back in Acquisition - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I hope you all don't mind me straying from the usual a bit here today. Instead of a specifically SEO-related post, I instead want to tackle a related science, the art of \"acquiring\" and what that means in marketing.",
  "content": "Putting the \"Customer\" Back in Acquisition SEO Copywriting By: Joanna Lord August 3, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Joanna Lord August 3, 2011 Putting the \"Customer\" Back in Acquisition SEO Copywriting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I hope you all don't mind me straying from the usual a bit here today. Instead of a specifically SEO-related post, I instead want to tackle a related science, the art of \"acquiring\" and what that means in marketing. The Problem - An Outdated Approach Not too long ago, acquisition simply meant driving mad traffic to your site. We see this in SEO today, and for those of us who have been doing this a while, its a scary reality that we can't seem to shake. It's as though we have forgotten what we are acquiring all-together -- customers. A while back I read a great acquisition marketing post over on the Clickz blog in which one line really changed my fundamental approach to my job. It reads \"Acquisition is about customers not action.\" W.h.o.a. Think about that for a minute. When I think back to the most recent webinars I attended, the last books I read, and the tweets that fill my stream, I can quickly recall a lot of information that suggests the majority of advertisers have yet to evolve past \"driving traffic.\" I know this, because when it comes to acquisition marketing, a lot of the material out there addresses these actions: more clicks, more successful form completions, and more purchase conversions. A lot of today's tactics are stripped down to the action rather than perhaps the most powerful tool marketers have at our disposal -- intent. When it comes to the future of marketing we are all seeing a far more social, and customer-focused landscape. Guess what that means? You better start caring about the intent of your audience, and not just driving traffic into your funnel. I know what you are thinking, \"Well sure, but clearly the more we drive into the funnel, the better off we will be. I mean some of those have to convert, and if we keep a steady flow of opportunities coming in, some of them will shake out.\" Uhm. Yeah. No. While I think there are times that this sort of \"group hug\" approach might work (get as many people in there as you can), but in the long term you are going to have a lot of people in the hug that simply can't wait to get away. Let's be honest, that's a lot of wasted love. Okay maybe I took the hug analogy a little too far, but I couldn't help it. A completely fabricated example of the way acquisition marketing use to be viewed The Solution- A Change in Perspective This concept of \"customers before all else\", is a hard one for data-driven marketers to appreciate at times. It pokes holes in the metrics we report on, it questions the formulas we build our spreadsheets on, and it certainly posits some interesting questions around skill-sets, strategies, and staffing. My first few years in acquisition marketing revolved around three letter words-- CPC, CPM, CPA, VPV, and so on and so forth. More recently, I've focused my energy on measuring a broader outcome of my daily marketing efforts. I find myself asking questions like \"WHO am I reaching?\" and \"What do THEY want from this engagement?\" It really comes down to thinking less about what we need as a company, and more about what do we have to offer. That's where the fun part begins. When was the last time you looked at your acquisition efforts and graded them solely on the element of customer value? I'm willing to bet most of us are more focused on these words -- branded, informative, captive, trackable, scalable, effective, etc. While also super important, they are very hard to balance with the elements of a campaign that the customer needs. In a moment of personal transparency I'd like to note that it can sometimes be a challenge for me to manage paid acquisition channels here at SEOmoz. Here, we evangelize the value in moving your marketing efforts toward inbound marketing. What is important to remember is they aren't as polarized as we imagine at first glance. Keeping the customer experience in the forefront of our mind is the piece of string that ties it all together. So how do we put the customer back in acquisition? What sort of tactics can we lace into our more traditional acquisition efforts to improve the quality standard from \"leads\" to \"customers\" and hopefully to \"lifetime customers.\" Below are some questions I like to ask myself when I'm creating new campaigns (used in its broadest sense), to make sure I'm not just hoping to acquire leads, but that I am successful on a grander scale; Have I done my research to know who I really should be targeting with my acquisition spend? Have I utilized all available behavioral and demographic targeting options, as to ensure I only reach that who fit my product best? Have I customized the message to directly answer the need of this customer? Have I made the landing page as relevant as possible? These are a great place to start, and many would say they are the bare minimum you should be doing to make sure your customer acquisition campaigns are performing at their potential. But there is more than just the top funnel experience to consider. Here are a few other questions to ask when creating campaigns; Is there cohesion between the multiple campaigns I am running, as to tell a story through my active campaigns? Do I have the tracking in place to help me understand how they relate and play off each other? What followup sequence can I integrate into this campaign to assure we hold on to the quality leads we capture? What feedback loops have I laced into my campaigns to make sure I hear what people want along the way? What personal process do I have in place to assess the success of this campaign, to better guide my future decisions? A much better example of how acquisition marketing should be approached The Reality of Acquisition Marketing It's likely some of the latter questions you are less familiar with, and to be fair, it's not totally your fault. These are more difficult, because they involve collaborating with other teams, and additional work on everyone's plate. I mean that's no fun. I hear ya. But trust me, it makes all the difference. Making sure you have these in place keep you connected with customers, even after you've secured their money. They keep you pushing yourself to improve with your next campaign launch, and in my opinion, they keep us acquisition marketers connected to the larger goals of the company (not just the revenue ones). Let's be honest guys and gals -- acquiring leads isn't that hard. In fact, depending primarily on your budget, it can be quite easy. The problem is you can't build a sustainable business on leads. You need them to become customers. In fact, I'd go as far as to say, that every single lead I send SEOmoz should have the potential to become our best customer if I am doing my job right. This can be a lofty challenge, but with the right resources, and the right moves, it can also become the standard of which your acquisition team is built. I'd love to hear your thoughts on the above. Do you think as an industry we are closer or farther from \"putting the customer first?\" Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Putting the \"Customer\" Back in Acquisition"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Putting the \"Customer\" Back in Acquisition"
    },
    {
      "level": "H3",
      "text": "The Problem - An Outdated Approach"
    },
    {
      "level": "H3",
      "text": "The Solution- A Change in Perspective"
    },
    {
      "level": "H3",
      "text": "The Reality of Acquisition Marketing"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Anatomy of Addictive Content"
    },
    {
      "level": "H3",
      "text": "Humans vs. Robots: Picking the Best Audience for Your SEO Content"
    },
    {
      "level": "H3",
      "text": "How to Stay Creative With an SEO-Driven Content Strategy"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Joanna Lord\n          \n            Joanna Lord\n          \n            Joanna Lord"
}