{
  "url": "https://moz.com/blog/qampa-about-using-qampa-sites-to-build-your-business-amp-reputation",
  "slug": "qampa-about-using-qampa-sites-to-build-your-business-amp-reputation",
  "title": "Q & A About Using Q & A Sites to Build Your Business & Reputation - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Q&A sites are a great way to get your message across and to build your brand and reputation.How many people use Q&A sites? In a recent Business.com study, 49% of companies that use social media said they ask questions on Q&A sites. Only 29% said they use...",
  "content": "Q & A About Using Q & A Sites to Build Your Business & Reputation Social Media G By: Gil Reich January 19, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! G By: Gil Reich January 19, 2010 Q & A About Using Q & A Sites to Build Your Business & Reputation Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Q&A sites are a great way to get your message across and to build your brand and reputation. How many people use Q&A sites? In a recent Business.com study, 49% of companies that use social media said they ask questions on Q&A sites. Only 29% said they use Twitter to find business-related information. The 49% doesn't even include the many who get info from Q&A sites by Googling or Binging. Answers.com (where I work) is now ranked (by comScore) as the 17th most visited site in the US. The vast majority of Answers.com's traffic is to user generated Q&A pages. Yahoo! Answers gets even more traffic. Much of your potential market is already getting their answers from these sites. Source: Social Media Best Practices: Question & Answer Forums. Business.com, December 14, 2009, http://www.business.com/info/social-media-best-practices-q-and-a What's in it for me? Providing quality answers and links to relevant pages can help you in the following ways: Direct your customers (and potential customers) to accurate information about your product. Connect with people in your market, build your reputation, and generate leads. Provide links back to your site. Some of these links are Follow links, and thus also provide SEO value. How do I use these sites? The general rules of social media apply here too: Help others Build relationships Push your products and services when they answer somebody's question or request. Q&A sites work great for this, because people are already asking the questions. When I blog I hope my posts address questions that my readers want answered, but they may not. In Q&A sites, your starting point is that somebody asked the queston that you're answering. Specifically: Search the Q&A sites for questions about your subject, and browse the relevant categories. Answer questions fairly and accurately. If appropriate, mention your product or service, and / or link to a relevant page on your site. Follow up & interact where appropriate. Use these sites' message boards to see if you can be of further help, or to congratulate another contributor for a great answer. Fill in your User Profile, showing why people should like and trust you. You can also usually link to your site from your User Profile. In the example below, notice how the user provided a quality answer (much of which follows a template he uses in other answers as well) and adds a relevant link to his site. What are the leading sites and how do they differ? Yahoo! Answers: The biggest site in the industry, with 47 million US visits in November according to comScore (and that's probably a very conservative estimate). It's a broad horizontal site. Questions are open for 4 days. Users answer the question, and vote on the best answer. The best answer is selected by either the asker or by the community. Answers.com / WikiAnswers: Answers.com has 41 million monthly US visitors according to comScore, making it second to Yahoo! but far larger than the other Q&A sites. It's also a broad horizontal site. It's key differentiators are: It's connectd to a reference site, so if you ask \"What is the abstention doctrine?\" your answer will come from West's Law and the Oxford University Press. It's a wiki, so instead of multiple users providing multiple answers, users collaborate on one answer. In most cases Answers don't get closed, so you can find questions asked more than 4 days ago and still contribute to the answer. LinkedIn Answers & Business.com Answers: These sites are great for more targeted communication, lead generation, and reputation building. Think of Yahoo! Answers and Answers.com as more B2C, and these sites as more B2B. This is Q&A in the context of advanced professional networking sites. Stack Overflow and its siblings: Stack Overflow is a great Q&A site for programmers. If you're a software developer and you want to establish yourself as an expert and to network with your peers, this site's perfect. The same technology is now powering other niche sites, most notably serverfault.com (for system administrators) and Answers on Startups, which Rand Fishkin just named one of the 10 Sources I've Come to Love. Aardvark: Aardvark is more of a closed system where you ask questions to people in your network. This is great for well connected journalists and bloggers to get answers from their network, but may not be ideal for spreading your message beyond your social circle. How is using them like doing a guest post on SEOmoz? Answering questions on Q&A sites is exactly like doing a guest post on SEOmoz: Find the sites where the people you need are getting their information. Give them quality information that will benefit them. Get your own message across, with full disclosure of who you are. You can be self-serving, but not too self-serving. Build relationships, and establish your expertise. Ultimately you need a win-win here. You need to serve the needs of the community with whom you're interacting, in a way that also builds your business and reputation. Where can I get more information on Q&A sites? See the following excellent articles: Jason Falls: How to drive business leads with Q&A forums Using Yahoo! Answers to generate leads. Does it work? Lisa Barone: Finding Answers on Business.com Business.com's Study: Social Media best practices: Q&A forums Or contact me (Answers.com user: Gilr) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Q & A About Using Q & A Sites to Build Your Business & Reputation"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Q & A About Using Q & A Sites to Build Your Business & Reputation"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Gil Reich\n          \n            Gil Reich\n          \n            Gil Reich"
}