{
  "url": "https://moz.com/blog/quest-for-budget-seo-package-part-5-link-building",
  "slug": "quest-for-budget-seo-package-part-5-link-building",
  "title": "Quest for budget SEO package (part 5): link building - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Both Michael and Rand have recently blogged about basic level link building and visibility and I’m about to chime in. Below are my top 5 tips to make link building process cost and resource efficient if you are a SEO services provider ...",
  "content": "Quest for budget SEO package (part 5): link building Link Building M By: mozUser1469147917838 January 23, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! M By: mozUser1469147917838 January 23, 2006 Quest for budget SEO package (part 5): link building Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Both Michael and Rand have recently blogged about basic level link building and visibility and I’m about to chime in. Below are my top 5 tips to make link building process cost and resource efficient if you are a SEO services provider 1) Locate customers real-life business partnersMost small companies who require entry level SEO services are either subcontractors /resellers of bigger names, or in worse case they start-up companies with nothing in their hands. In both cases, the simplest and most efficient way to get links is helping them get started in traditional business-to-business networking. In case of a subcontractor or reseller, see if any of suppliers has a list of resellers / partners (most companies do). Also check out what search engines return for terms like “locate resellers” + keyword(s). New business is a more complex case, and sometimes relying on tip 2 and 3 (below) is the only option to get things started fast. 2) Utilize the power of free directories and other forms of social networkingDmoz is the most famous example here, but there are thousands of other smaller scale directories and links lists available in most languages. I would even put blogs, forums and other forms of social networking under this tip because in the end they all have same functionality: provide human edited list of links and opinions… Avoid all directories that either require fee or link exchange, because they are usually waste of time and money (with very, very few exceptions) For all “I can’t get listed in Dmoz”-complainers, I have two tips: a) Make your site of superb quality – both visually and contextually. It makes getting listed way easier. b) Editors look for sites that provide something additional value to sites already listed. If you fail to do this, it is also very likely you fail in getting listed. 3) Explore and utilize industry specific directories and networksThis is a combination of two above mixing business-to-business networking and web based visibility. I believe most SeoMoz readers are familiar with organizations / publications like SeoConsultans, SEMPO and SMA – these are good examples of industry specific networks that exist in most industries. Some are free, some require a annual fee, but common is that all provide visibility to members. Whether or not paying the fee is good business is really business sensitive – if customer sells services/products with high profit, then a single contact from a paid directory can pay off. However, if customer sells low volume products it means they need to get a high volume traffic to get even or make some profit. 4) Analyze the competitionCheck the backlink structure on business and industry level. Doing this manually is very time consuming (but also very rewarding) task, but luckily if in hurry or tight budget (as in this case) there are tools for automation (like HubFinder) 5) Recycle Resource warehousing is something even large companies do. Instead of re-inventing all the above, recycle the information gathered on other projects and on free time. Start with building a resource database that you maintain daily as you come across with new resources. It is only a question of days to gather a database with hundreds of resources and within a year you can gather a database with thousands of resources. In addition I thing using link baits is worth recommending if customer has necessary resources. Of course, when dealing with limited budget SEO and internet precense in general, the baits can’t afford to be nothing fancy (more important is that they match to customer group). One of the oldest and most efficient tricks in the book are monthly competitions with prizes - be it free iPod, web site design, budget SEO or any other service or product your customer can provide, this is a technique that works and collects more or less visibility (a classic example: v7n SEO contest – low money prizes, but nice presence in SEO news etc). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Quest for budget SEO package (part 5): link building"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Quest for budget SEO package (part 5): link building"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "mozUser1469147917838\n          \n            mozUser1469147917838"
}