{
  "url": "https://moz.com/blog/question-for-the-moz-community-seomozs-twitter-account",
  "slug": "question-for-the-moz-community-seomozs-twitter-account",
  "title": "Question for the Moz Community - SEOmoz's Twitter Account - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Disclaimer: This post doesn’t include any information about SEO. If you are looking for SEO related content, please read the normal search related posts on this blog.\n\nThe SEOmoz community has always been a fundamental driving force behind this company. All of you provide the motivation to keep us…",
  "content": "Question for the Moz Community - SEOmoz's Twitter Account Social Media By: Danny Dover August 15, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Danny Dover August 15, 2008 Question for the Moz Community - SEOmoz's Twitter Account Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Disclaimer: This post doesn’t include any information about SEO. If you are looking for SEO related content, please read the normal search related posts on this blog. The SEOmoz community has always been a fundamental driving force behind this company. All of you (Moz Community) provide the motivation to keep us (SEOmoz employees) working and you issue the guidance to keep us on the right track. When asked why I like my job so much, my first reply is always that I get to work with great people. This includes my co-workers but also extends to those of you that I have had the pleasure to meet online and in person. That said, I would like to get all of your feedback on how SEOmoz can serve you better. We recently gained control to the twitter usename seomoz which had been registered by a hijacker. Rand (@randfish), and I (@dannydover) each tried unsuccessfully to claim the username. Eventually, it was Jane (@coplandmj) with the help of @djpaisley that were able to claim what was rightfully ours. Now that we have the username, how can we use it to best serve all of you? Reply in the comments or hit us up @seomoz on twitter. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Question for the Moz Community - SEOmoz's Twitter Account"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Question for the Moz Community - SEOmoz's Twitter Account"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Danny Dover\n          \n            Danny Dover\n          \n            Danny Dover"
}