{
  "url": "https://moz.com/blog/quick-take-on-couk-vs-com",
  "slug": "quick-take-on-couk-vs-com",
  "title": "Quick Take on .co.uk vs. .com - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Lots of questions popping up lately about how to rank well on Google.co.uk vs. Google.com. Danny shared this nugget of gold at SEW today:\n\ngoogle uk is going to favor uk based sites by default, even if you don't use the pages from the uk option. you want to do well ...",
  "content": "Quick Take on .co.uk vs. .com Keyword Research By: Rand Fishkin January 25, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 25, 2006 Quick Take on .co.uk vs. .com Keyword Research The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Lots of questions popping up lately about how to rank well on Google.co.uk vs. Google.com. Danny shared this nugget of gold at SEW today: google uk is going to favor uk based sites by default, even if you don't use the pages from the uk option. you want to do well in google.com, you should be using .com. want to do well in co.uk, use co.uk. want to do well in both? i'd use .com hosted out of the uk. I'd add that links from UK hosted sites (whether .com or .co.uk) can help and worldwide links can help at .com. Any other suggestions? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Quick Take on .co.uk vs. .com"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Quick Take on .co.uk vs. .com"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}