{
  "url": "https://moz.com/blog/rands-on-video",
  "slug": "rands-on-video",
  "title": "Rand's on Video - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I was recently interviewed on video (in a t-shirt) at our offices here in Seattle by Payscale.com for their Salary Stories blog. I'm not sure if I'll ever be fully comfortable with how I look on video, but it might be something to experiment with.\n...",
  "content": "Rand's on Video Moz News By: Rand Fishkin September 13, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 13, 2006 Rand's on Video Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I was recently interviewed on video (in a t-shirt) at our offices here in Seattle by Payscale.com for their Salary Stories blog. I'm not sure if I'll ever be fully comfortable with how I look on video, but it might be something to experiment with. Don't worry - the video's short, but it is more personally focused on me and the business than on SEO in general, though I do try to guess at what G-man's earnings are like, which should be fun. And, yes, that's an Optimus Prime action figure in the background :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Rand's on Video"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Rand's on Video"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}