{
  "url": "https://moz.com/blog/rand-heads-to-munich-to-help-spread-the-word-on-linkbait-vorhanden-auf-deutsch",
  "slug": "rand-heads-to-munich-to-help-spread-the-word-on-linkbait-vorhanden-auf-deutsch",
  "title": "Rand Heads to Munich to Help Spread the Word on Linkbait (Vorhanden auf Deutsch) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "On March 26th, I'll be speaking on the Linkbaiting, Social Search Marketing & Blogging panel in Munich, Germany. My intention is to bring examples of the ideas and strategies that have been so effective in the English-language market to German SEOs & website marketers. However, I could use a bit of…",
  "content": "Rand Heads to Munich to Help Spread the Word on Linkbait (Vorhanden auf Deutsch) SEO Events By: Rand Fishkin March 5, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 5, 2007 Rand Heads to Munich to Help Spread the Word on Linkbait (Vorhanden auf Deutsch) SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. On March 26th, I'll be speaking on the Linkbaiting, Social Search Marketing & Blogging panel in Munich, Germany. My intention is to bring examples of the ideas and strategies that have been so effective in the English-language market to German SEOs & website marketers. However, I could use a bit of help - my German is rusty and my familiarity with German social media sites, popular blogs and UGC-portals is second-rate. If you're familiar with these sites in the German market, I'd greatly appreciate any information you can provide, particularly links, so I can bone up on as much of the local market as possible. My trip to Munich isn't all business, though. Mystery Guest, my new fiancée, will be joining me on the trip, as her father lives south of Munich, in the small town of Iffeldorf. We'll be celebrating our engagement with him and partying it up a bit before the conference with my excellent friend (and the person responsible for my trip to SES Munich), Thomas Bindl. I might even ask him to do a bit of English-to-German translation for me as my abilities limit me to asking for potato salad (kartoffelsalat), inquiring about the loo (Wo ist das WC?) and determining if there's an English-speaker around (Sprechen Sie Englisch?). I'm looking forward to seeing some familiar faces (Bill Hunt, Sara Andersson and Mike Grehan) and meeting lots of new people, too. If you're interested in registering for SES Munich, the cost is €995 until March 9 (€695 for one day). Many thanks to Thomas, who's translated this post to German: Rand fliegt nach München um das Wort zum Thema Linkbait zu verbreiten Am 26. März werde ich in der \"Linkbaiting, Social Search Marketing & Blogging\" Session auf der SES München sprechen. Mein Plan ist es ein paar der Ideen und Strategien, die im Englischen Markt erfolgreich waren, Deutschen SEOs und Seitenbetreibern nahe zu bringen. Nichtsdestotrotz könnte ich ein bisschen Hilfe gebrauchen - Mein deutsch ist angestaubt und meine Vertrautheit mit Deutschen Social Media Seiten, populären Blogs und UGC-Portalen ist eher zweitklassig. Falls du mit diesen Seiten im Deutschen Markt vertraut sein solltest, würde ich jegliche Information zu schätzen wissen. Besonders Links zu diesem Thema wären gut, damit ich den lokalen Markt möglichst gut verstehen kann. Mein Ausflug nach München ist nicht nur geschäftlich. Mystery Guest, meine neue Verlobte, wird mich dabei begleiten, da ihr Vater in Iffeldorf, einem kleinen Ort südlich von München wohnt. Wir werden unsere Verlobung mit ihm feiern. Ausserdem werden wir ein bisschen mit meinem guten Freund (und der Person, die für meinen Trip zur SES München verantwortlich ist), Thomas Bindl feiern. Ich werde ihn vielleicht sogar darum beten ein bisschen Englisch-Deutsch für mich zu übersetzen, da meine Fähigkeiten sehr begrenzt sind. Sie schränken mich darauf ein nach Kartoffelsalat zu fragen (potatoe salad), den Standort der Toiletten zu erfahren (Where is the loo?) oder ob jemand, der Englisch spricht (Do you speak English?) in der Nähe ist. Ich freue mich darauf ein paar bekannte Gesichter (Bill Hunt, Sara Andersson und Mike Grehan) zu sehen, sowie viele neue Leute zu treffen. Wenn du daran Interesse haben solltest dich anzumelden, es kostet bis zum 9. März €995 (€695 für einen Tag) . Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Rand Heads to Munich to Help Spread the Word on Linkbait (Vorhanden auf Deutsch)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Rand Heads to Munich to Help Spread the Word on Linkbait (Vorhanden auf Deutsch)"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}