{
  "url": "https://moz.com/blog/rand-to-move-into-advisory-role#comment-431688",
  "slug": "rand-to-move-into-advisory-role",
  "title": "Moz Transitions: Rand to Step Away from Operations and into Advisory Role in Early 2018 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We have some big news from the MozPlex: In early 2018, Rand will step away from day-to-day work at Moz and transition into an advisory role as a Moz Associate. Read on for more details.",
  "content": "Moz Transitions: Rand to Step Away from Operations and into Advisory Role in Early 2018 Moz News By: Sarah Bird July 13, 2017 Table of Contents Copied! By: Sarah Bird July 13, 2017 Moz Transitions: Rand to Step Away from Operations and into Advisory Role in Early 2018 Moz News I have some big news to share with you. As many of you know, three and a half years ago, Rand began to shift his role at Moz. He transitioned from CEO into a product architect role where he could focus his passion and have hands-on impact in evolving our tools. Now, over the next 6 to 9 months he will transition into a supporting role as a Moz Associate. He will continue to be a passionate speaker and evangelist, and you'll still see his enthusiastic face in Whiteboard Fridays, on the Moz Blog, and on various conference stages. And of course, he is one of our largest shareholders and will remain Chairman of the Board. This is hard. Rand started Moz (formerly seomoz.org) over 16 years ago as a blog to record what he was learning about this new field. He and his co-founder Gillian Muessig created a marketing agency that focused on helping websites get found in search. They launched their first SAAS software product in February 2007, and I joined the company nine months later as the 8th employee. We've come a long way. Today, we have over 36,000 customers, 160 team members, a strong values-based culture, great investors, over $42 million in annual revenue last year, and a large and growing community of marketers. So many people have helped us reach this point. What else is next for Rand? We're excited to find out. His book about the last 16 years at Moz comes out next year. When you see Rand, please show him gratitude and support. He is an incredibly talented, passionate, and productive individual with a commitment to helping others. I know he's going to continue to make marketing better and spread TAGFEE in all his future roles. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Moz Transitions: Rand to Step Away from Operations and into Advisory Role in Early 2018"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Moz Transitions: Rand to Step Away from Operations and into Advisory Role in Early 2018"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sarah Bird\n          \n            Sarah Bird\n          \n            Sarah Bird"
}