{
  "url": "https://moz.com/blog/rand-and-dharmesh-told-us-no-but-we-did-it-anyway",
  "slug": "rand-and-dharmesh-told-us-no-but-we-did-it-anyway",
  "title": "Rand and Dharmesh Told Us \"No\", But We Did It Anyway - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Learn how we were able to get Rand and Dharmesh to use our product and integrate into their Inbound.org community. Plus we give you 5 tips on getting buy-in from thought leaders on your product.",
  "content": "Rand and Dharmesh Told Us \"No\", But We Did It Anyway Marketing Industry By: Jon Hainstock August 8, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jon Hainstock August 8, 2012 Rand and Dharmesh Told Us \"No\", But We Did It Anyway Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The Inbound Jobs story with Five Tips on Getting Buy-in from Thought Leaders. In April, Ben and I attended LinkLove in Boston. It was a great experience for a number of reasons, and the best part was connecting with other awesome SEO’s. As a designer/developer team, we asked these thought leaders what we could create for them that would make their lives better. Tom Critchlow planted a seed with us that would eventually become the job board now found on Inbound.org. Tom helped us see that there was an urgent need for inbound marketing agencies to find, recruit, and keep great talent. He connected us with Rand who was very interested in having a job board on inbound.org–his side project with Dharmesh Shah. We were thrilled at the opportunity of working with Rand and Dharmesh and started planning out the site. Unfortunately at that time, the inbound.org team was too busy to put in the time and energy needed to move the project forward (we think it had something to do with the 18 million). So we pushed the project aside, realizing that the job board would only be successful with their community. As with most great ideas, the job board wouldn’t leave our minds (Tom must have planted the idea in a dream within a dream), so we scheduled some time to build it despite the fact that Rand and Dharmesh said they couldn’t support it. We figured at the very least Tom could use it for his presentation on hiring and training inbound marketers at Mozcon. After we built the job board, we contacted Rand again to see if our up front investment of time and energy would be enough to get Inbound.org’s backing. This time we got buy-in, and we partnered with the Inbound.org team to get the site ready for Mozcon. Rand introduced the job board during the Mozcon kickoff and gave us a generous mention. As you can imagine, it was a huge deal for us, mostly because of the connection. So what can be learned from all of this? I’ll try to explain why this worked from a content strategist’s perspective. As SEOs, we are always talking about creating great content and getting buy-in from thought leaders. In theory this seems doable, but how do we actually go about it? Here are 5 tips on getting buy-in from thought leaders, based on our experience building the job board: Make Real Connections by Showing Up. LinkLove is a niche conference, and on paper it was a stretch for a bootstrapped company, but we went for the networking. We went to meet people in the industry and find ways we could add value. Meeting Tom was pure luck, but we wouldn’t have even had the opportunity without showing up. Figure out where thought leaders hangout online and in real life and connect with them in a thoughtful and intentional way. Find How You Can Help. Most people approach thought leaders looking for what they can get out of the relationship, but it’s better to think about how you might be able to help them. Uncover opportunities by asking what would make their lives easier or better. Maybe you aren’t a designer or a developer but there are many other ways to provide value. Think about how you can help them with your knowledge, skills and relationships. Invest Up Front. There are different philosophies here, but our mentality is to invest up front. You don’t need to create the entire piece of content, but create something good enough to show your idea and prove that you can deliver. In our experience, the more you can provide up front, the more feedback you will get. There’s no question that this is a risky strategy, and we don’t recommend it for every piece of content, but buy-in is much more likely if you have something solid to start with. Think/Go Big. Thought leaders are extremely busy people and they are bombarded with others trying to get their buy-in and support. When you reach out to them, only go after your best ideas since you have a limited amount of time and small window of opportunity. Create Content You Believe In. We believed that the inbound job board was necessary for the community. This made it a lot easier for us to invest up front. Push ideas that you believe in, and create content that you can rally behind. Don’t build content for the links, do it for the value the content will provide and the relationships you will form. Conclusion These are some of the things we learned about getting buy-in through creating the job board for Rand and Dharmesh. We’d love to hear how you are getting buy-in from thought leaders in the comments below. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Rand and Dharmesh Told Us \"No\", But We Did It Anyway"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Rand and Dharmesh Told Us \"No\", But We Did It Anyway"
    },
    {
      "level": "H3",
      "text": "Here are 5 tips on getting buy-in from thought leaders, based on our experience building the job board:"
    },
    {
      "level": "H3",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jon Hainstock\n          \n            Jon Hainstock\n          \n            Jon Hainstock"
}