{
  "url": "https://moz.com/blog/ranking-number-one-for-the-best-customers",
  "slug": "ranking-number-one-for-the-best-customers",
  "title": "Ranking Number One for the Best Customers - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This might be odd and oversimplified, but .... There are two kinds of customers I've seen in six years of marketing my law firm on the web.One type is The Shopper, generally looking for the lowest price. The Shopper spends a lot of time looking at various websites and makes inquiries to several…",
  "content": "Ranking Number One for the Best Customers Online Advertising W By: Warren Redlich July 16, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! W By: Warren Redlich July 16, 2009 Ranking Number One for the Best Customers Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. This might be odd and oversimplified, but I've come across two kinds of customers in my six years of marketing my law firm on the web. One type is The Shopper, who is generally looking for the lowest price. The Shopper spends a lot of time looking at various websites and makes inquiries to several sellers. For those who talk to prospective customers on the phone, Shoppers can take a lot of your time, and many will not buy from you in the end. On the bright side, you don't have to be the number one search result for The Shopper to consider you. If you're in the top five relevant results, you have a shot. My writing skills fail me at naming the second type, so I'll just call this person The Non-Shopper. This person just wants to get it done. There are a variety of reasons for this. Maybe he's so rich that he just doesn't care about the price. Maybe he's in a rush, or his need is an emergency. The Non-Shopper is likely to buy from the first seller he finds who appears reliable. If you are the top search result, your site looks professional and you don't screw up the phone call, the Non-Shopper will probably buy from you. This impacts both organic search listings and pay-per-click ads. Consider two types of sellers: the Cheaps and the Boutiques. Since the expensive sellers make more money per transaction, they can spend more to try to rank high: better SEO, and/or higher PPC bids. What results? Assume a Boutique ranks number one, has a professional website and otherwise appears reliable. The Non-Shoppers click on the Boutique's top listing and buy without even looking at the Cheaps. The Shoppers look at a few sites and buy from a Cheap. From an economics perspective, this appears to be an equilibrium. The Boutiques won't lower prices because they would lose money from the Non-Shoppers and won't sell to Shoppers unless they go as low as the Cheaps. The Cheaps will tend to have roughly the same prices. They can't raise prices much without losing the Shoppers. But the Cheaps won't get any of the Non-Shoppers unless they spend a lot on SEO and/or PPC--money they don't have because they're not making enough from the Shoppers. The equilibrium persists in another way: Boutiques can afford to deliver better quality products and services, which appeals to the Non-Shoppers. The alternative scenario is not an equilibrium. If a Cheap ranks number one, he won't get as many of the Non-Shoppers because it's hard to make your site look professional and handle the volume of calls as well as the more expensive competition. The Cheap also doesn't make as much money on the Non-Shoppers because his price is much lower than the Boutique. The Cheap has a tough time justifying the cost of being number one. Meanwhile, the Boutique has an incentive to spend more to try to get top rankings. By ranking at the top, the Boutique will get more of the Non-Shoppers, and will make more money from them. One consequence may be a little perverse. Most of us picture Cheaps showing their prices prominently, while Boutiques do not. But on the web, the Boutique should make the price prominent, perhaps even in the PPC ad text. The Boutique knows that the Shoppers will not buy. A click, call or e-mail from a Shopper is a waste of the Boutique's time and money. By making the high price obvious, some of the Shoppers are scared off. Meanwhile, some Non-Shoppers will see the high price as an indicator of quality. A few years ago, my fees were a little above average. I got a call from a prospective speeding ticket client who was sophisticated--someone from a New Jersey trucking company. He hadn't seen the fees on my site and when I told him $300, he asked me why I was so cheap. One thing he said still stings my ears: \"It makes it seem like you don't know what you're doing.\" Now imagine that coming with a voice like Tony Soprano. He still hired me, but I raised my fee to $500 the next day. I figured I might lose a third of my clients but I'd make two-thirds more on the ones I didn't lose and that would be pretty good. I was wrong. I got more clients. There's certainly room in this model for more complexity. If there are a lot of Shoppers and few Non-Shoppers, there may not be enough business to sustain a Boutique. In some markets there may be enough variation in the Shoppers that sellers spread out on a spectrum from cheap through average to expensive. How does this apply in your area? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Ranking Number One for the Best Customers"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Ranking Number One for the Best Customers"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Warren Redlich\n          \n            Warren Redlich\n          \n            Warren Redlich"
}