{
  "url": "https://moz.com/blog/ranking-fluctuations",
  "slug": "ranking-fluctuations",
  "title": "Ranking Fluctuations: What to Expect + How to React - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Rankings fluctuations can be panic-inducing, but they happen to everyone. In this Whiteboard Friday, Rand discusses why ranking fluctuations occur, the importance of keeping your cool during those darker moments, and how to identify when you should actually be concerned.",
  "content": "Ranking Fluctuations: What to Expect + How to React SEO Basics | Whiteboard Friday By: Rand Fishkin June 2, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin June 2, 2017 Ranking Fluctuations: What to Expect + How to React SEO Basics | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Rankings fluctuations can be panic-inducing, but they happen to everyone. In this Whiteboard Friday, Rand discusses why ranking fluctuations occur, the importance of keeping your cool during those darker moments, and how to identify when you should actually be concerned. Click on the whiteboard image above to open a high-resolution version in a new tab! Video Transcription Howdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week we are chatting about rankings fluctuations. So many of you who monitor your rankings in Google might do so weekly or daily or monthly. For those of you who do it daily, you probably observe something like this. I made this up. This is not actually the keyword I tracked, but these are the numbers that I saw. So, basically, you might see that, over the course of four or five days, you hop around from number one, number two, one, one, one. But as you go down this list to the ranking position four or five or six, you're seeing things like oh number 5, and then I'm ranking number 21, number 19, 7, 8. Gosh, it's just going all over the place. This happens quite a bit actually. Many folks ask questions on the Moz Q&A platform and all over the web and to their SEO professionals like, \"Why are my rankings jumping around so much? Is this bad? Is there something I should do?\" The answer, generally speaking, is no. Rankings bounce around like this in most search results, especially in the sort of bottom half of page one and especially page two, three, four, or five quite a bit, a tremendous amount in fact. We see SERP fluctuation as being quite high, quite common and consistently so. It is rarely actually the case that you see that number one, number two, number three positions that stay that way for extended periods of time, many weeks or months without moving at all. Some random days you will check it and you will see some of these changes. Others you'll see them in their consistent positions. What to expect in rankings flux A few things to note: 1. There is obviously more fluctuation in the lower down results, on average, usually than there are in the higher results. So if I get my rankings up here, can I expect no flux? Not exactly. 2. When you first gain rankings in the top three, four, or five, let's say, you will usually see more fluctuation than after you've been there for a sustained period. So what's unusual is to see a ton of rankings fluctuation for a URL that's been ranking for a keyword in position one or two or three for two or three months in a row. That's pretty uncommon. You might see one or two position changes, but you usually don't see four or five or six. 3. You should also expect to see more fluctuation, even in the top results, when there's a highly temporal topic or result. That you can observe by looking at the search results and seeing if Google has got that gray text that says three hours ago or two days ago, or they give a specific date of when it came out, March 15th. When you see those and lots of them, you should expect more fluctuation. What to do What should you do about this? Well, first off, please, please, please, please... 1. Do not freak out. A lot of people just lose their cool with their SEOs or with their team or with themselves. They panic. I would urge you not to arbitrarily change your tactics. If you're observing rankings fluctuation like the kind I'm describing -- so down here in the five, six, seven positions, up here in the three, four, five positions from day to day -- that's okay. You are not doing something wrong or bad, at least not necessarily and not usually. 2. I would urge you to use weeks as your time period, not days, and measure at least four to six weeks of rankings before you start to freak out over, \"Hey, there's too much rankings fluctuation.\" 3. You should also compare your own fluctuation to your competitors. So if you see, hey, I'm ranking here and I'm fluctuating a bunch, oh, but it turns actually the positions around me are also fluctuating, guess what? It's not you. It's the SERP. It's Google. Don't blame yourself for this. 4. I would try and compare your rankings to traffic. So it can be the case that if you're hitting your rankings on a particular day or from a personalized device or a geographic area or something like that, that you could be getting different kinds of rankings than what's actually being seen by most people. Now, rank trackers, like Moz's or SEMrush's or Ahrefs or Searchmetrics or any of these folks who do rank tracking at scale, use a non-personalized, non-geo-biased system. I'll show you how to replicate it in the comments if you're interested. But you should expect that you might see some of that bias.So what I'd urge you to do is also look at your page traffic. So if you look at traffic to your pages and then organic search, if this is me over here with Healthfind, maybe I should check how many visits from organic search did this page get. Oh, actually it looks pretty consistent from day to day and week to week. Well, maybe I shouldn't panic then. Probably you shouldn't. 5. The thing to be concerned about is precipitous falls over many pages in a quick period of time. So if you see that you've got 20 pages on your site, 50 pages on your site, they all lost rankings yesterday and fairly significantly, okay, that's cause for real concern. Now I would go investigate. I'd see if you did something wrong, or if maybe Google caught something that they thought was sketchy that you were doing, or if they devalued some of your links, or you had some site problems, whatever. But normal flux, so two to four positions regularly at the top or more down at the bottom, that is to be expected. Don't panic. You're going to be okay. Google fluctuates all the time. And we'll see you again next week for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Ranking Fluctuations: What to Expect + How to React"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Ranking Fluctuations: What to Expect + How to React"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "What to expect in rankings flux"
    },
    {
      "level": "H2",
      "text": "What to do"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}