{
  "url": "https://moz.com/blog/ranking-for-keyword-cityname-in-multiple-geographies",
  "slug": "ranking-for-keyword-cityname-in-multiple-geographies",
  "title": "Ranking for Keyword + Cityname in Multiple Geographies for Local SEO - How to use SEO in Local Keyword Campaigns… - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I've been having a lot of conversations recently with websites in need of better rankings for keyword + cityname combinations in cities across the country (or around the world). This is one of the most challenging tasks in the SEO field, for four big reasons:      Maps Results Bias Against…",
  "content": "Ranking for Keyword + Cityname in Multiple Geographies Local SEO By: Rand Fishkin October 13, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 13, 2010 Ranking for Keyword + Cityname in Multiple Geographies Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I've been having a lot of conversations recently with websites in need of better rankings for keyword + cityname combinations in cities across the country (or around the world). This is one of the most challenging tasks in the SEO field, for four big reasons: Maps Results Bias Against Multi-City Domains Google's local/maps results are far more challenging to get into if you're not a business with a physical local presence. Opening field offices or leveraging local franchises are possibilities, but they take time and effort. _ Web Results are Getting More Geo-Sensitive Too The \"standard\" web results are seeing more and more leanings towards local results, even when the maps/local trigger isn't in place: At least 4 of the top results are showing based on my location alone (and I'm feeling really weird that I don't know anyone at any of these Seattle SEO companies - where are you guys? Come to a meetup!). _ Exact/Partial Keyword Match Domains Dominate In reviewing results for some friends and folks on PRO Q+A, it seems that exact match domains dominate results in local even more than in other verticals. This makes it even harder for single sites with landing pages to get into the results (and honestly, I question whether this is a smart algorithmic move on Google's part). _ Earning \"Local\" Links is Harder for Multi-City Sites If you live locally, run your business in an area and thus participate in that community, your liklihood of earning links from local businesses and with anchor text that includes your city name increases dramatically. This works against national sites seeking a presence in the local rankings. Before I continue, I'll first point out that it's not necessarily a bad thing that Google biases towards local sites ahead of national or multi-city ones. It's quite likely that doing so has actually improved relevance and searcher happiness from a few years ago (when national sites with multi-city listings dominated these types of queries). However, this post is here to help those of you who are aiming for those multiple city listings, so let's dive into strategy and tactics. Maps vs. Web Results There's two ways to get results from SEO in local keyword campaigns:Competing in one is hard - in both, harder still. Yet, given Google's propensity to make localization and geographic queries leverage Google Maps (and the announcement today that they're doubling down with former VP of Search, Marissa Mayer, moving from to local), it would seem this will grow in importance and reach. Best Practices & Resources for Maps/Local In Google Local & Maps, it's all about the listings (rather than the links). You need to:Optimize your own Maps listingCreate LOTS of consistent data across every resource Google might be usingBuild passion among online-savvy audiences who use your business (so they'll do the promotion for you)Need more? Read the Bible on Local SEO. Building the Right Content Content for local searchers is hard to fake and hard to make \"great,\" often because the intent of a local query can vary more than initial instincts might lead you to believe. In my experience, local searchers are seeking:Llists of the \"best\" businesses in this arena, or at least an endorsement they can trust of a select few (think of queries like \"San Diego sushi restaurants\" or \"Ocean Beach consignment shops\")A single, geographically close, convenient and \"good enough\" solution (e.g. \"bookstore near Balboa Park\" or \"La Jolla Apple Store\")Content-based answers or resources more than local businesses (e.g. \"San Diego neighborhoods\" or \"If you're going to stand out in the field, you need to identify the intent successfully and fulfill it exceptionally.This means you can't go the classic route of building a single page of content and simply replacing the geographic keywords with each city you're targeting. Content needs to be meaningfully unique and target the intents described above. My best advice is to follow these three steps:Leverage or build a unique source of data - that could come from your own deep experience in the field, from user/editorial data or from a technological solution you've constructed (think Zillow's home price values or SimplyHired's job + salary data).Hire the best writers you can find, the best designers you can get and mashup beautiful elegance with literary genius (NYmag has always impressed me on both fronts)Don't skimp on the depth and detail. Better to spend 40 hours of work for each city building the most amazing resource possible and earn top rankings than to put in a half-hearted effort and hit page 2 or 3. And, even if you can rank, how can you convert and win raving fans if you don't have the best material (e.g. see how Oyster reviews a hotel - Tripadvisor is a letdown in comparison).Content alone won't win the day (sadly, it's a myth that the best content earns top rankings), but it is critical to building the foundation for long term success. Keyword Targeting & On-Page Optimization The standard best practices for keyword targeting & on-page optimization apply, with a few twists.Keyword cannibalization can be a big problem, particularly if you're producing both broad and narrow categories and landing pages (like \"San Diego Restaurants\" and \"San Diego Kid-Friendly Restaurants\"). It's not impossible to win both, but you need to be careful about how you use keywords on the pages and be smart with internal (and external) anchor text. Recently, I've witnessed some cases where the wrong page ranked due to anchor text and keyword usage issues. This is an area where it pays to be cautious.It sometimes pays to target multiple keywords on the same page. When that's the case, be careful not to go overboard and get spammy or abusive. Often, I see sites repeating the city name far more often than is necessary. If I'm on the San Diego page, there's no need to go overboard with internal anchor text or repetitive phrases that include \"San Diego\" in front of every other noun.Keywords in the URL string seem, perplexingly, to be a stronger signal on these types of pages and queries than I'm accustomed to. I haven't invested in real research around a correlation study on this, but looking through hundreds of results, my sense is that writing good URLs that are keyword rich matters. That doesn't mean something like: site.com/san-diego/san-diego-restaurants/san-diego-kid-friendly-restaurants - in fact, I suspect many searchers are starting to learn that URLs like those often don't have what they want. But I would, for example, recommend at least: site.com/san-diego/restaurants/kid-friendlyAnother tough one to prove, but my instincts have been telling me that topic relevance matters quite a bit here too. The free LDA tool isn't perfect, but it's the best thing I know of in the SEO world to help evaluate a piece of content's relevance to a query. You can and should, of course, also use your intuition.Be careful not to get too addicted to a template approach, particularly if your template isn't a robust platform for nailing the user intents described above. It can be good to vary keyword usage based on demand - for example, some cities might have more searchers using \"Seattle Men's Suits\" while others use \"Mens Suits San Diego.\" Do the research and the testing before you commit - and be ready to change if the data shifts. Earning Links Link building in general is tough - in the local space, particularly when you need dozens of hundreds of links to hundreds or thousands of pages, it's nightmarishly challenging. But, that's what makes SEO a true competitive advantage (vs. PPC, for example).The tactics I've seen work best for those scaling out local pages include:Being a listing resource that promotes other sites/businesses and, in return, earns links from those sites thanks to the cognitive principle of reciprocity (and a desire to share one's accomplishments). Yelp's badges are a perfect example of this in action:Offer graphics or embeds that local businesses can use to promote themselves and you'll see plenty of links (so long as your site/brand has a reputation that impresses the business owners).Syndicating content with other relevant local content providers can earn lots of links to a wide range of your pages. The only weakness is that the diversity of sources is low, but if you can form a number of partnerships with big players, this can be overcome. Perhaps no one has had more success with this strategy than Trulia, whose link partnerships with newspapers and news sites across the country (powering their real estate sections) has meant rankings domination for the better part of 4 years. Sites like Superpages.com and Citysearch.com take advantage of this as well by \"powering\" the listings on may partner sites and earning links back in return.Participating in local community events and sponsoring in-person gatherings has long been a tactic we've recommended, but it works very nicely in the local keyword space because the links tend to come from local sites, feature cityname anchor text (or at least have that cityname plastered on the linking pages).Ingratiate yourself with local bloggers and reporters. Urbanspoon did this by promoting the posts and content of local food bloggers when they expanded to a new city. Techflash's expansions have been similarly successful because they reach out to the local tech, venture, startup and entrepreneur communities through coverage for their sites, blogs and events.As always, there are a plethora of link building tactics that can work, limited only by your creativity and willingness to experiment. Staying Ahead of \"Hyperlocal\" Competition For larger sites going head to head with local niche sites in the rankings, what seems like a struggle can actually be an opportunity. Try reaching out to indirectly competitive top rankers to see if affiliate deals, advertising, sponsorships or other partnerships could work. Sometimes you may not be able to earn a link, but you can buy some of that super-relevant traffic that's landing on someone else's pages.If there is a true head-to-head and you have the size/resources to pull it off, turning highly successful and rankings dominating sites into franchisees or buying them outright can make sense from a long-term business perspective. It can also be a great way to acquire \"boots on the ground\" if that's part of what your model needs to succeed.If none of these are available and you're facing 3-4 keyword match domains that are out-linking, out content-building and out-optimizing you, you might consider \"sneaking around\" the competition. Instead of targeting the cityname, try individual neighborhoods, outlying secondary regions (e.g. Bellevue, Tacoma, Renton, Redmond and Everett instead of \"Seattle\") or even states/counties. You can also approach the long tail demand in local by building more and better content around the topic, engaging with UGC and mining alternative sources for keyword data. Learn from the Best In a number of sectors, certain sites have had dramatic success over the years and maintained it. Looking at these domains and understanding their strategies is an excellent way to bolster your knowledge of how to play this competitive game. Some of the sites that have impressed me the most on this front include:Yelp & Urbanspoon in restaurantsTrulia, Zillow & Yahoo! Real Estate in real estateSuperpages in doctors and dentistsFreelancedesigners for programmersI'll leave it to you to run the queries, see the success they're having in local rankings and reverse engineer their strategy.Looking forward as always to your thoughts, ideas and questions on this. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Ranking for Keyword + Cityname in Multiple Geographies"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Ranking for Keyword + Cityname in Multiple Geographies"
    },
    {
      "level": "H2",
      "text": "Maps vs. Web Results"
    },
    {
      "level": "H2",
      "text": "Best Practices & Resources for Maps/Local"
    },
    {
      "level": "H2",
      "text": "Building the Right Content"
    },
    {
      "level": "H2",
      "text": "Keyword Targeting & On-Page Optimization"
    },
    {
      "level": "H2",
      "text": "Earning Links"
    },
    {
      "level": "H2",
      "text": "Staying Ahead of \"Hyperlocal\" Competition"
    },
    {
      "level": "H2",
      "text": "Learn from the Best"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}