{
  "url": "https://moz.com/blog/reach-and-influence-your-first-marketing-priority",
  "slug": "reach-and-influence-your-first-marketing-priority",
  "title": "Reach and Influence: Your First Marketing Priority - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The concept of the search box is likely to disappear in the next 5 years. Build a change-proof content strategy via a renewed focus on your reach and influence.",
  "content": "Reach and Influence: Your First Marketing Priority Content Marketing | Social Media By: Eric Enge December 14, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Eric Enge December 14, 2016 Reach and Influence: Your First Marketing Priority Content Marketing | Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. When you first start out with content marketing, you often have a very basic challenge: you have to build an audience for your content. Even if you're a large brand with lots of people who are passionate about you, they're not yet conditioned to see you as a publisher of valuable content. In other words, either way, you've got work to do.In today's post, I'm going to outline why you should focus on reach and influence, and how to do it so that your content marketing efforts can deliver the maximum ROI.Map your marketplaceThe first thing to realize is that number of potential customers in a marketplace is finite, and so are the number of major media sites and blogs that have any real audience. A typical audience reach for the bloggers and media in a marketplace might look something like this: Traditionally, SEOs have focused on trying to publish content on as many different domains as possible. In the early days of SEO, the theory was that getting links from as many different domains as you could was how you maximize overall rankings impact.This still has an element of truth to it today if you view the Google algorithm from a narrow perspective, but I believe it's best to take a more holistic view of the market. Frankly, I don't want the hard task of fighting for every link I get; I want people to give them to me because I've shown I deserve them.I don't want to fight for every link I get; I want to earn them because I've shown I deserve them.For that reason, we urge our clients to focus on building authority, reach, and influence. If you do this well, you establish a solid base for earning links organically. Consider the value of publishing content and having it get links with minimal effort on your part.While you all shudder at the concept of “build it and they will link to you,” if you implement a fully integrated campaign with an audience that is anxious to see what you have to say, the task of attracting links becomes significantly easier. To make that work for you, you'll need relationships with key influencers, bloggers, and media people, and you'll need to prioritize who are the people who can help you most.The catch is, the most influential players in a marketplace have assets to protect (their relationship with their audience), and they're not going to help you unless you find ways to help them bring even more value to their audience.That means you'll need to establish your business as a top source of content and ideas. You’ll also need to be seen by them as a partner, and that you support their goals, not just your own. So now, let's get to work!Identify your real audienceFirst, let's look at another map, this time looking at the makeup of the people in a given market:Who in this chart do you think might reshare your content or link to it? It's certainly not the laggards, or even the early or late majority. Generally speaking, these are not the people with large social media followings, or highly popular blogs or columns on your market. The people who do have these things are highlighted here:Innovators and Early Adopters are the ones that might share or link your content in a way that has a large impact. If your content is not good enough to interest them, then you've failed. Not only can they get more eyeballs on your content, but when they reshare it, it acts as an endorsement of its value.Cater to this audience. Even for a large brand, it's essential that you get good engagement here, as it helps give your content credibility.Go to where your target audience resides on the InterwebsYour target customer spends a lot of time in various places across the Internet. Consider engaging with them where they are.The reason for doing this is to accelerate the growth of your audience and their engagement with your content. I often refer to this as getting in front of OPA (\"Other People's Audiences\"). It's one of the most powerful ways to increase your own audience and loyalty. It also creates opportunities to build your own direct audience.That said, you need to do this with great care. If you dive willy-nilly into public forums with commercial messages you'll be seen as self-serving and overly aggressive. Better approaches include: Establish columns on high-authority media sites Share valuable info via your social media presences Interact with influencers online Participate in online and offline events (webinars, conferences) These are just a few ideas. Remember, you're there to add value, and adding value doesn't mean showing people all the great things they can do with your products. Create useful, non-commercial, content, or address questions without your products or services being the explicit answer.Adding value doesn't mean showing people all the great things they can do with your products.The role of columnsAs we've established, the top media sites have the most influence in a marketplace. Here's another way of looking at it:If you're looking for OPA, the top media sites that cover your market have plenty of it, and if you're allowed to publish on their sites without having to pay for it, they also provide an implied endorsement. Old-school SEO would tell us that columns are not that valuable because Google used to value visibility on a larger number of domains more than they valued repeat presence on the higher-authority sites, but digital marketing life is no longer that simple.You can argue about how far that pendulum at Google has swung, but you can't deny that it makes sense that an ongoing relationship with an authoritative site is a stronger indication of your authority than ten meaningless one-time relationships with sites no one, or almost no one, ever visits. If you don't think that Google gets this, you're definitely stuck far in the past.Other publishing effortsIt's great to get high-value columns, but not every major media site will grant you that opportunity. Let's say you manage to get a column on three of the top sites. This may expose you to this type of reach:There will also be major media sites where getting a column or publishing content is not an option. But, can you build relationships with their editors and writers? Will they reach out to you for fact checking or quotes when they write a related story? Are they interested in interviewing you?A deliberate program to build these relationships is a must in any reach and influence building strategy. Some of the key steps are: Build a list of the top relationships you should target Try to obtain info on their social accounts and email addresses Study what they're about, and what's most important to them Actively reshare their relevant stories via your social media Engage with them in ways that will add value, and that shows them why a relationship with you would be valuable for them Consider implementing targeted paid social campaigns that will expose them to your best content See if you can structure opportunities to meet them face-to-face. Use all of these tactics to map out your strategy and show yourself as a leader in your market, and to show your willingness help them with their needs.The role of influencersMedia people are influencers in their own right, but there are types of influencers as well. Their presence may be in other places, such as social media or streaming media, and there are usually many of these out there in any given market. With these types of influencers you can potentially leverage a few additional tactics, such as: Interview them and publish the result on your site Pay them to reshare your content on social Pay them to write for you (and ask them to share the article via their social) Engage them to help you more broadly as a spokesperson Find ways to collaborate on projects with them and then co-promote the resultsOr, try a more limited project-based engagementThe value here is very similar to that of major bloggers and media. Their engagement with you reinforces the quality and value of what you're doing online. As with the media, there are probably a small number of influencers with significant reach. The cool thing here is that the people they influence only overlap partially with the people reached by media. Let's look at how they overlap:If you are able to establish relationships with a few of the top ten (non-media) influencers, your reach and influence will go up yet one more notch.Organic social mediaSocial media is a great way to build relationships directly with bloggers, media, influencers, and to access your target customer base. Too many businesses view social media in a very tactical way. Either they focus on pushing commercial messages through their accounts, or they work towards shallow goals, such as increasing likes or followers.If you're looking to expand your true reach and influence, you should leverage the strengths that social media has to help you accomplish that. Even in a world where major social platforms such as Facebook are limiting organic reach, there is still much to be gained by posting high-value content on these platforms. First of all, not all of the social media platforms limit your organic visibility, and there are also many community opportunities on them as well. And second, you can use that content as a sort of “credibility calling card” as you try to build relationships on social with influencers. If they look at your profile, your content serves as a resume that says you’re worth engaging with.But nothing free lasts forever, so make a point of finding ways to migrate the relationships you create on social media sites onto other platforms.Make a point of finding ways to migrate your relationships on social media sites onto other platforms.One way to do that is to share great content published on your site, and then find ways to lure people into signing up for a newsletter, your app, or find some other way to get them connected with you going forward. By all means, don't abandon your connection with them on the social media platform where it started, but don't be wholly dependent on that platform either.Paid socialThere are tons of opportunities in the world of paid social, and they are worth exploring. Some of the platforms, such as Facebook, offer tremendous targeting options that allow you to get extremely granular with your campaigns. Have a mailing list of 10,000 people? Imagine targeting a Facebook ad campaign that runs solely in front of that audience. Sounds awesome, doesn't it?You can actually do this, but the only catch is that the email address you have for them has to be the one that's used for the user's Facebook account. In our experience, that may cut the actual list reached by half or so, but this type of campaign is still an enormous value add.There are other effective ways to target on paid social media platforms, but the big key is to invest the time to get your targeting right. So many companies dabble in social media advertising, try a few things, look for an instant return, and then give up. You need to have patience to figure out your best targeting options, and work to get it right.To do that, you'll need to invest some money with a not-so-great ROI for a while, in order to get enough data to get your targeting where it needs to be. If you're willing to do this, you can gain a nice market edge for yourself, especially since it’s very possible your competition isn’t willing to put in that effort.One approach to help with extending your reach and influence is to build a list of bloggers, media, and influencers, and do the hard work of building targeted ad campaigns just to that list. This is a great way to get your content in front of those that matter most.We've seen results in campaigns like this that deliver engagement (likes, clicks, reshares) for as little as $0.30 per action. Other campaigns we've run have shown action rates in the $1 range, but this is still a phenomenal value.SummaryKeep your focus on the goal of extending your reach and influence. No matter how large your brand is today, you're living in an uncertain world. If you're heavily dependent on organic search results in Google, know that the concept of the search box is likely to disappear in the next five years. Or, if you're heavily dependent on people walking in to your stores, you've already seen the massive shift of activity online. More change is guaranteed, and the exact shape it will take is not clear to anyone.Your best defense in a rapidly changing world is a passionate and engaged audience that feels loyalty directly to you, and that you have ways of connecting with directly. Build this. Cultivate this.Then, no matter what direction things go in the future, you'll be in a position to continue to grow and prosper. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Reach and Influence: Your First Marketing Priority"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Reach and Influence: Your First Marketing Priority"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Map your marketplace"
    },
    {
      "level": "H3",
      "text": "I don't want to fight for every link I get; I want to earn them because I've shown I deserve them."
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Identify your real audience"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Go to where your target audience resides on the Interwebs"
    },
    {
      "level": "H3",
      "text": "Adding value doesn't mean showing people all the great things they can do with your products."
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H2",
      "text": "The role of columns"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Other publishing efforts"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H2",
      "text": "The role of influencers"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Organic social media"
    },
    {
      "level": "H3",
      "text": "Make a point of finding ways to migrate your relationships on social media sites onto other platforms."
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Paid social"
    },
    {
      "level": "H2",
      "text": "Summary"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Eric Enge\n          \n            Eric Enge"
}