{
  "url": "https://moz.com/blog/read-but-learn-by-doing-an-approach-to-the-analysis-of-seo-issues-between-authorship-google-plus-and-snippets",
  "slug": "read-but-learn-by-doing-an-approach-to-the-analysis-of-seo-issues-between-authorship-google-plus-and-snippets",
  "title": "An In-depth Analysis of Authorship, Google+ and Snippets - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I am currently receiving more inquiries than ever about what factors into the comparisons and associations apparent in authorship, enabling a given listing to stand out from the crowd in the SERPs. People want to pinpoint a cause and effect scenario. People want answers. Here are a number of tests…",
  "content": "An In-depth Analysis of Authorship, Google+ and Snippets Technical SEO By: Andrea Pernici July 10, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Andrea Pernici July 10, 2012 An In-depth Analysis of Authorship, Google+ and Snippets Technical SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Read...but learn by doing! I am currently receiving more inquiries than ever about what factors into the comparisons and associations apparent in authorship, enabling a given listing to stand out from the crowd in the SERPs. People want to pinpoint a cause and effect scenario. People want answers. SEO is like life. We cannot always give an explanation or find a scientific solution to questions being asked of us. For some time, I have been studying the application of algorithms in respect to human behaviour, animals and nature. Seven years ago, my fascination in complex adaptive systems was born, and my particular interest has been in social behavior. I have studied scientists and scientific publications to find \"the most connected scientist\" considering the citations and links found in the papers. What I hadn't predicted was the explosion of interest in and application of complex adaptive systems that I am now witnessing, nor that tasks in this area would become part of my daily work as a scholar, increasing my fascination with search engines. Google and other search engines are trying to explore the relationship between man, his experience, and his contextual thought process in order to understand his reasons for taking certain actions. This tendency towards humanisation, and therefore to the unforeseeable nature of a complex system, generates countless theories, false positive and wrong analysis of the algorithms being studied. SEO: Curiosity, determination, research and particular attention to detail In this post, I want to clearly state that I am not here to criticise nor attack anyone. Using a scenario commonly confronted by SEOs, I want to demonstrate how it is possible to identify problems, to assess content being churned out daily by the international community, to verify a hypothesis, reach a conclusion and then formulate a correct opinion from what has been learned. Please bear in mind, an opinion is all we can strive for in the absence of facts. I believe that we often accept what we read, hear and analyse as solid fact. All too often, the analysis of specific SEO problems misses the target due to insufficient depth of study and because there are no isolated variables subjected to examination. The recent release of Penguin and Panda has created a great deal of uncertainty and many interesting case studies, but few studies have made a meticulous effort to identify the real motives for which the penalties are imposed. What I present here is a simplified approach to the analysis of updates such as Penguin and Panda, but it will allow you to identify what are the causes that often lead to conclusions because of the desire to obtain a justification for the same process used to reach those same conclusions. In addition to identifying possible problems during the analysis, I will also look into Authorship markup, Google+ and Rich Snippets. I would appreciate community feedback, particularly if you can point out other cases that contradict my findings. The case under consideration: \"Authorship\" \"Everything You Need To Know About Google Authorship in 8 Minutes\" is an interesting, investigative example which, unfortunately, fails to hit the target. All hypotheses and insights that Chris Countey expressed in the video can be abolished in a matter of minutes by analysing more cases, more SERPs, more data. An analysis of this type leads to superficial conclusions and a message that misleads readers or listeners, potentially causing future SEO disasters. Rel=Author, Rel=Me and HTML4 or 5 There is no evidence that doctype and use of rel or of ?rel affect attribution or non-attribution of Authorship. In the example below, you can see how a doctype HTML4 together with rel=author and rel=me all function normally. Judging by past history, Google is not prone to taking doctype into consideration. Rel=Author and Profile Images Here, too, there are various interpretations which have to be considered. I have made some tests, taking into consideration the following factors: Avatars with illustrated graphics Generic images and lack of focus on the face Images with more than one person Images without any person or face Images that are not sharp/clear Images that are of a low quality Authority of the profile Let's examine these details further. Avatar Image Illustration As we can see from the following two files, there is absolutely no evidence that a profile picture or cartoon-style illustration prevents the display of same in the SERPs. Negative case Positive case Generic images which do not focus on the face As clearly visible from the following images, there is absolutely no evidence that a profile picture that doesn't focus on a human face prevents the display of same in the SERPs. Famous positive case A less famous positive case Image with more than one person Here is a screenshot of an avatar with two faces. Positive case Image without face or persons This could be a plausible hypothesis, but evidence is to the contrary. Negative case Positive case Image is not sharp/clear and the image is of low quality If we followed Google's own advice about image quality, we might hypothesise that poor image quality could prevent display of an avatar in the SERPs. The following image, Keep Calm and Circle Me, renders even this hypothesis doubtful, however. Sharp image but not quality Quality image but lacks clarity Here we can see the same image as above (Image without face or persons - Positive case), which is very clear despite of its very low quality and not being sharp. Positive case Authority of the profile A possible factor which excludes the face could be related to the authority of the profile, but again, evidence is against such a hypothesis. Negative case Positive case NB: The case of John Mu could be dependent on the fact that more than one profile is open (which is a type of filtering of fake hypothesis?) but I think it's image related. This authorship is associated with a different profile from that shown above. https://profiles.google.com/johnmu.com/about https://plus.google.com/113006028898915385825/posts No firm conclusions, but a conclusion The above cases illustrate and validate a rule to detect possible instances of non-display, leading us to an important conclusion; namely, that if you search for your \"first and last name Google\" or even \"site: plus.google.com in url:TUO_ID_GOOGLE_PLUS \" and Google does not display your profile image on Google+ within the snippet in relation to your Google+ page, it will most likely never appear. Related to this we can say, without any doubt, that the image/photo of the profile is the main factor; something confirmed also by the following example here below (and by other tests I did as well). Change of image and attribution in SERP Authorship with or without implementation through email? When analysing other sites, it is always difficult to draw conclusions. A case that could be misleading is, for instance, the following example that does not use any markup on the page but gets authorship recognition in the SERP. A superficial judgment is to assume that Google is not interested in the rel=\"author\" implementation, whereas it is very probable that the email confirmation option has been used. So before jumping to conclusions, let's carefully evaluate each small possibility while moving forward. Authorship and rel=nofollow to Google+ profile Also in the video shown earlier in this post, it is noted that an author does not show in the SERPs despite everything being correctly associated. Specifically, Chris asked Rand why the link to his Google+ profile contained the rel=nofollow, imputing the missed authorship to this. To eliminate this theory takes very little effort and you can verify for yourself that using a url as the nofollow does not prevent attribution. Case of nofollow on link to g+ Possibly in the case described in the video, related to the article \"How Authorship (and Google+) Will Change Linkbuilding\", the missed authorship is not to be attribute to the use of the nofollow, as the screenshot shows. Related to the screenshot above (from the earlier video), among the possible reasons for the absence of Authorship in the SERPs may be: Search Plus Your World is active (in order to test the Authorship attribution, it is preferable to be logged out). Now Google shows the image of an Author only once per SERP, and probably in the example the second attribution prevails over the first (however this is not the case, because the \"by ...\" should remain visible). The type of search query realized (which is not reported in the video). Social search and therefore the sharing of our friends were considered more relevant than the author in this case. I am currently investigating the file robots.txt and I am unable to resolve or find anything. Authorship and meta robots noindex on the author page To verify the noindex case, I made a test with the result that the noindex in the author page is a big issue for the attribution even if the rich snippet testing tool returns an ok. In the image below I present three pages of the same site, where one is using the author page with noindex. Just with a look at the SERPs, we can confirm that a noindex tag on the author page is a real issue. Authorship and tab +1 on Google+ profile Forums and posts that I have read provide some advice on making public the tab +1 to ensure authorship works. Unfortunately, this is not actually one of the factors that should be taken into account. Authorship + snippet with number of circles Another element that we can observe is the number of circles in which an author is present. This element seems depending mainly on two factors: The total number of circles in which the author is added has to be >500 [BEFORE 13 June, 2012]; The association between the author and the search query. Here we can see some examples where it appears or does not appear snippet 'in XXX searches'. Comparison between the account with Circles number >500 and <500 with related search (first name and surname) Thanks to this research it is possible to understand the value of the number of circles in which a user is present and, therefore, if this data will appear in the Authorship snippets or not. Experiment with research and behaviours related to snippets Borderline case to verify that the limit is effectively >500 To accomplish this I was able to find an account with 490 searches and one with 515 searches, undertaking a related search to both. To swiftly identify users of around the 500 searches, I utilised this tool. With 490 circles, the number of circles is not displayed With 515 circles, the number of circles is displayed Relevance of search and number of circles In this case, if the other authors were circled by >500 people probably they would obtain the additional snippet as in my case. Case which shows the relevancy and the number of circles In the following case, however, you can see how the additional element may quite probably depend on the relevance of the search. In the case above, in fact, I show up with the circles number snippet, but if I search for a different name where I appear (case below), but I'm not so relevant, then the number circles snippet disappears. Case to which there is no relevance and therefore without snippets of circles Continuous changes Making the same search of 28 May on 6 June, I saw a big change that invalidates my first hypothesis. I'll show you what this was: Marginal factor or not? It is only a stupid meaningless number, or does it mean something more? Personally I consider that that \"little number\" may help us understanding the great complexity that lies behind Authorship and Search, because it clearly indicates how Google is able to associate, understand and contextualise people to searches. Authorship, YouTube and rich snippet mixed Many believe that Authorship in the SERPs consists merely of the visualisation of the face and description snippet, but this is not so. Authorship is expressed more specifically with the snippet \"by Firstname Lastname\". This allows us (as shown in the example below) to connect YouTube to Google+ and obtain the Authorship in SERPs merged with the video snippets. In the image we can see a rich snippet showing the video uploaded by Giorgiotave with the Authorship snippet below along with a smaller image. This allows us to see how the SERPs are becoming more and more expressive. In regard to the variety of snippets and their display, I consider very interesting reading this paper about social annotations and Web Search, which - on a macro level - describes in detail the study process implied with each small addition to the interface of a Search Engine, while - on a micro level - describes the effects that the social annotations have on the behaviour of the users and how it varies at any smallest change. Contains multi-author verified and unverified In the following examples, I've added more links of authorship (using ?Rel=author) comparative to a post with questionable content. I'm looking to understand what would happen in a scenario where pages with several authors including both profiles are unverified by 'contributor of' and others instead being verified. In the example shown, two profiles are verified while the remaining four are unverified. Test multi author with unverified and verified Google has apparently ruled out the authorship of the post due to the probability that the primary link of authorship does not confirm the association override and does not proceed to search for successive theory [hypothesis]. Let's evaluate what is effectively so and perform a test on the same post dismissing the authorship, by not confirming prior to firstly using the rich snippet testing tool to confirm and verifying revalidate. Multi author first verified and then unverified Apparently, the assumption seems to be founded, but to confirm the hypotheses we must obviously perform a similar test on a new post. This will enable us to see what happens in the SERPs. Here is a test with two authors verified. Contains multi author with two authors verified I carried out a test introducing an article with two verified authors. Unlike the day before, the rich snippets testing tool encountered an error identifying the rel=publisher as if the author were not verified, although no errors were implemented. Two authors and one page badge Contradicting the hypothesis above, but not as expected, the use of two verified authors using rel=author+ page author+ rel=me causes missing visualisation of the authorship in SERP even if the fault seems attributable due to the badge of the pages: Perhaps a bug in the rich snippet testing tool? That the rich snippets testing tool considers the first g+ URL before any other url? The search engine will have the same behaviour of the tool? This notification is absurd. This invalidated the test and so we had to perform a new test. Test with two verified authors: one via ?Rel=author and one via rel=\"author\"+page author+rel=\"me\" In this case, the rich snippets testing tool catches (and show) the first author that it finds in the html code of the page, but in the SERP there is no attribution, as evident in the image below (in the red part). More authors and no authorship At this stage, our examination of new test should be in place: Test with two authors verified via ?rel=author, Test with two authors verified via rel=\"autor\"+ page author+ rel=\"me\" and without URL plus present Google in the page. What response would Google provide in the case of failure to display? In this help article, Google suggests that there are alternative cases for which the author may not appear in the SERPs. Surely, one of the elements to observe is that of the relative \"on-page markup\" as well as \"profiles picture\" discussed above. The official support from Google What can we learn from this case? Regardless of the specific case and the assessments evaluated on rel=author, this case analysis shows us how we should act when we wish to obtain certain answers about the behaviour of the search engine. Therefore, we can define some key principles for the work we do every day: Collect information and cross examine it with a critical mind. Search for other opinions and experiments related to the information you've found and cross examine it with a critical eye. Read the official documentation, not to consider it as evidence, but simply as a starting point to define your hypothesis. Formulate one hypothesis at any one time and place it into question. Involve colleagues and friends to examine the case so that you are able to provide further views and more cases. When you obtain a large amount of data and tests that are consistent, try to demonstrate the accuracy with reality and specific testing. Urgency is not an issue; if something does not or cannot prove your hypothesis due to the lack of feedback, begin again until your hypothesis is not refuted by the facts. If you can prove your hypothesis, make it public and prepare to be disproven. SEO is a more than words. SEO is a common sense approach to the problems of everyday life. And here's a present for you... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "An In-depth Analysis of Authorship, Google+ and Snippets"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "An In-depth Analysis of Authorship, Google+ and Snippets"
    },
    {
      "level": "H2",
      "text": "Read...but learn by doing!"
    },
    {
      "level": "H2",
      "text": "SEO: Curiosity, determination, research and particular attention to detail"
    },
    {
      "level": "H2",
      "text": "The case under consideration: \"Authorship\""
    },
    {
      "level": "H2",
      "text": "Rel=Author, Rel=Me and HTML4 or 5"
    },
    {
      "level": "H2",
      "text": "Rel=Author and Profile Images"
    },
    {
      "level": "H3",
      "text": "Avatar Image Illustration"
    },
    {
      "level": "H3",
      "text": "Generic images which do not focus on the face"
    },
    {
      "level": "H3",
      "text": "Image with more than one person"
    },
    {
      "level": "H3",
      "text": "Image without face or persons"
    },
    {
      "level": "H3",
      "text": "Image is not sharp/clear and the image is of low quality"
    },
    {
      "level": "H3",
      "text": "Authority of the profile"
    },
    {
      "level": "H3",
      "text": "No firm conclusions, but a conclusion"
    },
    {
      "level": "H2",
      "text": "Authorship with or without implementation through email?"
    },
    {
      "level": "H2",
      "text": "Authorship and rel=nofollow to Google+ profile"
    },
    {
      "level": "H2",
      "text": "Authorship and meta robots noindex on the author page"
    },
    {
      "level": "H2",
      "text": "Authorship and tab +1 on Google+ profile"
    },
    {
      "level": "H2",
      "text": "Authorship + snippet with number of circles"
    },
    {
      "level": "H3",
      "text": "Comparison between the account with Circles number >500 and <500 with related search (first name and surname)"
    },
    {
      "level": "H3",
      "text": "Borderline case to verify that the limit is effectively >500"
    },
    {
      "level": "H3",
      "text": "Relevance of search and number of circles"
    },
    {
      "level": "H3",
      "text": "Continuous changes"
    },
    {
      "level": "H3",
      "text": "Marginal factor or not?"
    },
    {
      "level": "H2",
      "text": "Authorship, YouTube and rich snippet mixed"
    },
    {
      "level": "H2",
      "text": "Contains multi-author verified and unverified"
    },
    {
      "level": "H2",
      "text": "Contains multi author with two authors verified"
    },
    {
      "level": "H3",
      "text": "Test with two verified authors: one via ?Rel=author and one via rel=\"author\"+page author+rel=\"me\""
    },
    {
      "level": "H2",
      "text": "What response would Google provide in the case of failure to display?"
    },
    {
      "level": "H2",
      "text": "What can we learn from this case?"
    },
    {
      "level": "H2",
      "text": "And here's a present for you..."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Andrea Pernici\n          \n            Andrea Pernici"
}