{
  "url": "https://moz.com/blog/reading-blogs-via-rss",
  "slug": "reading-blogs-via-rss",
  "title": "Reading Blogs via RSS - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I've got almost 50 blogs I like to read every day and another 100 or so that I like to see at least once a week. But, I'm sorely behind the times. I actually go and visit every blog in my browser to get the content, rather than using a feedreader. Why?\nBecause I can't find a reader that I like...…",
  "content": "Reading Blogs via RSS Design By: Rand Fishkin December 14, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 14, 2005 Reading Blogs via RSS Design The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I've got almost 50 blogs I like to read every day and another 100 or so that I like to see at least once a week. But, I'm sorely behind the times. I actually go and visit every blog in my browser to get the content, rather than using a feedreader. Why? Because I can't find a reader that I like... I've tried several (bloglines, google's web version, start.com) and never been satisfied. Any recommendations? There has to be a good program for this stuff out there. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Reading Blogs via RSS"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Reading Blogs via RSS"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}