{
  "url": "https://moz.com/blog/reasons-why-corporate-blogging-fails",
  "slug": "reasons-why-corporate-blogging-fails",
  "title": "Reasons Why Corporate Blogging Fails - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The task of corporate blogging encapsulates a plethora of pitfalls. Recently, my consulting work and a number of colleagues have illustrated some of the worst problems plaguing...",
  "content": "Reasons Why Corporate Blogging Fails Content Marketing By: Rand Fishkin February 27, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 27, 2007 Reasons Why Corporate Blogging Fails Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The task of corporate blogging encapsulates a plethora of pitfalls. Recently, my consulting work and a number of colleagues have illustrated some of the worst problems plaguing companies who attempt to enter the world of blogging. WIth a little luck, pointing out some of these threats can help to alleviate issues for those who might attempt the endeavor in the future. Blogs vs. Corporate Culture In many cases, a blog is NOT right for your company. Some companies simply don't have the flexibility to tolerate a human voice - their rigidity is a closely guarded asset and one they're unwilling or unable to loosen. In these instances, it's not wise to pursue a corporate, rigidly structured, dispassionate, impersonal blog. Instead, concentrate on your existing formal website and use other tactics to communicate. A blog's unique characteristics don't match with every organization, and it's better to recognize this than to force voice, personality and tech-savviness where it doesn't exist. Editorial Control Issues A blog must have a unique, personal, compelling voice - one that evokes passion, incites connection with the readership and doesn't back down from tough issues or reek of political correctness. In this way, a blog can be thought of as a novel - when too many editors or layers of editing interfere, the qualities that made the writing worthy die out. If your company can't find someone it trusts to be both writer and content editor (the rules on editing don't necessarily apply to proofreading and fact checking), an ugly struggle between writer and editor (or, worse, editors) may severely hamper the blog's quality. Unfamiliarity with a Blog's Structure Blogs contain, at a minimum, several unique components that make them recognizable to web audiences as blogs. Though there's always some degree of flexibility, you should be creating easily digestable content on a semi-weekly basis that offers comments, permalinks, categories and clear information about the writer (or writers). Using blog software CMS' makes this process a bit easier, but blogs can certainly be built from the ground up and integrated into already existing platforms (SEOmoz is a perfect example). When companies mistake blogs for newsletters, bulletin-style announcements or simply a news feed, both the user and the publish suffer. Misunderstanding Your Audience Repeat after me - \"the blog audience is not the same as your typical customer base.\" Blog readers are universally more tech-savvy, more passionate about your products or your organization. They're up-to-date on industry news, they almost always read other, related, blogs in your industry (which means you should be reading those, too). Blog readers are more often connectors and influencers (for those who enjoy Gladwell) and they're also likely to be highly critical of dishonesty or insincerity. Crafting a Corporate Voice, Rather than a Personal One I've mentioned this in several of the points above, but it's definitely worthy of its own bullet point. A blog's tone - the style in which content is crafted - can't be too impersonal or corporate-babble-y. The best blogs connect with people through their writing by creating a human bond - that's basically the entire purpose behind blogging, rather than just issuing daily press releases on a website. If you want to call it a blog, give it a voice that has the power to compel, connect and engage. Attempting to \"Sell\" or \"Market\" This might be the worst sin of all, simply for its popularity. I can't count the number of blogs I've seen, from companies large and small, that are basically three paragraph ads for one product or another - no voice, no humanity, no connection, and essentially a waste of time for writers and readers. Let's get this straight - blogs are NOT ad copy, and any blog written as such belongs in the same category as splogs. I'm forced to ask - why bother? Domain & URL Issues A great number of corporate blogs don't exist on the company's domain. Some clever SEOs think that by having a separate site, they can gain link popularity by linking to their normal domain - hint, hint, it's far better to get the value from all those external links pointing to your blog helping the credibility and global link popularity of your primary domain. Many marketing and public relations executives keep blogs on separate domains (and bury or obscure links to them on the main domain) because they're worried about the association of the blog and the corporate website. If that's a real concern for you - that your official bloggers can't be seen as part of your company's site, then you need to go back to my first rule and decide if blogging is really the right thing for your firm. Just as the link love to a blog on the proper domain will spread good things to the rest of the domain's pages, so too will the positive branding of a blog spread goodwill to an entire company (or, at the least, its website). If you've got experience providing services or working on a corporate blog gone wrong, I'd love to hear about it - please do share. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Reasons Why Corporate Blogging Fails"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Reasons Why Corporate Blogging Fails"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}