{
  "url": "https://moz.com/blog/rebuilding-avatar-financial-in-cakephp",
  "slug": "rebuilding-avatar-financial-in-cakephp",
  "title": "Rebuilding Avatar Financial in CakePHP - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Unless you've been living under a rock for the past couple of years, you may have heard about Ruby on Rails.  It's the latest greatest web development platform that has become immensely popula...",
  "content": "Rebuilding Avatar Financial in CakePHP Design O By: Oatmeal September 18, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! O By: Oatmeal September 18, 2006 Rebuilding Avatar Financial in CakePHP Design The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Unless you've been living under a rock for the past couple of years, you may have heard about Ruby on Rails. It's the latest greatest web development platform that has become immensely popular due to its use of convention over configuration (resulting in exceptionally clean code). Cake is the PHP equivalent of Ruby on Rails. It's ideal for someone who wants to utilize the MVC design pattern but doesn't necessarily have the time to learn Ruby. Avatar Financial is one of our oldest clients, and when I was tasked with re-designing and rebuilding their site I figured it would be an opportune time to switch to CakePHP away from the home-brew framework I used on SEOmoz and many other sites. CakePHP is very new, so the documentation is a bit sparse in areas, particularly when you get past the basics. While developing the site I took a lot of notes and decided to create a list to share with others, so without further ado: 21 things I learned about CakePHP Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Rebuilding Avatar Financial in CakePHP"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Rebuilding Avatar Financial in CakePHP"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Oatmeal\n          \n            Oatmeal"
}