{
  "url": "https://moz.com/blog/recovering-from-google-penalties-a-small-business-tells-its-story",
  "slug": "recovering-from-google-penalties-a-small-business-tells-its-story",
  "title": "Recovering from Google Algorithmic Penalties: A Small Business Tells Its Story - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Getting dinged by Google penalties doesn't have to be an entirely painful process, provided business owners accept the occurrences as opportunities for meaningful change.",
  "content": "Recovering from Google Algorithmic Penalties: A Small Business Tells Its Story SEO Basics | Conversion Rate Optimization (CRO) By: Stephen Nelson February 27, 2015 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Stephen Nelson February 27, 2015 Recovering from Google Algorithmic Penalties: A Small Business Tells Its Story SEO Basics | Conversion Rate Optimization (CRO) This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Maybe the best place to start this story is April 2012. At that point, my little collection of websites (a couple of topical niche sites, www.llcsexplained.com and www.scorporationsexplained.com) enjoyed about 800,000 unique visitors a year. To monetize that traffic—we did pretty nicely, thank you—we sold $40 e-books. Late in April 2012, Google brought the hammer down on sites like ours. Overnight, organic traffic from Google dropped by, gosh, 90-95%. Then things got worse. Google introduced new algorithmic filters that hurt our site or updated the same ones. My principal “crime” was article marketing. As a writer by trade, I comfortably churned out dozens and dozens of articles and let article directories syndicate these babies to hundreds of low quality sites. I need to put this out there, front and center: The articles used links with anchor text that was stuffed with keywords. In the end, the sites probably had 5,000 or so links each. Maybe 4,000 of each site's links were junky. They were bad links. With the \"algorithmic penalties\", our e-book business seemed impossible to fix. In fact, sometime during the summer of 2014, being ever-so-quick to open my mouth, I wrote a lengthy post in the Google Webmaster Tools forum that said the right way to think about all of this was to use the “Five Stages of Grief” model. What one wanted to do, I wrote, was to quickly get to the final stage of grief, which is acceptance. Despite what I wrote in the forum, we ended up not taking our huge setbacks lying down. We proactively made the needed changes on our sites, and we worked hard to recover. By the fall of 2014, we did it. We recovered. Now I am going to share the four steps we took that made recovery possible. Much of this information will look very familiar, and some of it will surprise you. Step 1: Clean up the links Obviously, we had to clean up the unnatural links pointing to our sites if, as we assumed, we were getting hit with Penguin, Panda and similar penalties. Our first steps, therefore, were to delete all of the articles we’d posted at popular article sites. (In many cases this amounted to paying directories to remove articles.) This probably erased 1,000 to 2,000 links. We also begged or paid other sites to edit the anchor text in the links they had pointing to our sites. In retrospect, this “fine-tuning” seems quaint and naive. But at the time, some people thought the unnatural anchor text was the problem. When the first updates of the Penguin penalty didn’t reward us with any positive change, we then did pretty much everything else people say you should do. I’m not going to list out everything we did, but if I could point to one important task we completed in this area, though, it is that the we either deleted or disavowed all of the junky links we’d accumulated (and which we continued to accumulate oddly enough). Google, for the record, only sees the best and most natural thousand or so links to our sites. Step 2: Create a new site A quick point, and one I wish we’d implemented earlier: One of things we did (and should have done way sooner) was start from scratch with a new site. Roughly 18 months ago, we started a blog, http://evergreensmallbusiness.com. That site now gets as much daily traffic as our topical niche sites used “pre-Penguin.” You probably don’t need me to tell you that we have done no formal link building for this site. We try to acquire links naturally by promoting the site and its content. Combining the effects of Step 1 and Step 2 (a digression) A quick caveat: We actually never received all the traffic we used to get, pre-penalty. Let me share some rough numbers with you. It would not be unusual for us, pre-penalty, to get 1,000 visitors a day to a site, with maybe 90% of this traffic coming from Google. That equates to 100 visitors a day from Bing or referring sites, and 900 visitors a day from Google. After the penalties, that 900 visitors a day stream slowed by about 95%. Instead of getting 900 visitors from Google, the site enjoyed, say, 45 visitors on any given day. And then things actually got worse. When we cleaned up the junky links, we also cut back on the traffic from other sources. (We actually used to get pretty good traffic from some of the article sites.) Maybe the link pruning, then, cut the non-Google traffic in half to 50 visitors so that after all this, a site that used to get maybe 1,000 unique visitors a day (nearly 30,000 a month) squeaks along with just 95 visitors a day. Ouch.Nevertheless, we saw a nice bump in Google traffic with the July 2014 and October 2014 updates. Across our heavily hit sites (those mentioned above), we saw maybe a five-fold jump in traffic. That sounded great. At first. But when you do the math, given that you're coming off of a really low base value, you never get close to what you once enjoyed. In other words, if Google is pouring say 40 or 50 visitors a day into a site and then quintuples this, you’re now looking at 200 to 250 visitors a day. Add to that the maybe 50 visitors coming from other sites, and you’re at 250 or 300 people a day—way less than we used to enjoy. My point is that you can’t fully recover from a penalty or penalties simply through SEO auditing and general fiddle-faddling. But, in one sense, you don’t actually care about recovering the traffic. You care about recovering the revenue. In that regard, a few basic fixes helped. Step 3: Optimize conversion rates The embarrassing thing about all that free traffic from Google was we didn’t really need to be very smart about optimizing our conversion rates or on-page usability.Even if we did a crappy job in these areas, all we needed to do was compensate with more SEO-induced traffic. Obviously, these days one can’t think that way. And so optimizing for conversion rates and improving on-page usability became part of the solution. We’ve done all the standard things to our principal sites: adding excellent copy, making pages scannable, and tweaking the design of certain pages. Though measuring the improvement gets tricky, we feel like we probably nearly doubled our conversion rate. (Honestly, we attribute improvement to the poor job we did with the pre-penalty websites. It was pretty easy to make big improvements to sites that were so inefficient and crudely constructed.) Step 4: Improve the product mix The final thing we did—and this thing was the cherry on the cake—was to get smarter about the products we sold and cross-sold. Again, this is embarrassing to admit, but in our pre-penalty phase when we had all of that free traffic, we didn’t care if we only made one-time, relatively small dollar sales to a tiny percentage of our visitors. (Our do-it-yourself incorporation kits sold for about $40.)Our mindset is totally different now. We use the sites to sell CPA firm services. And because we serve a high-end niche, that means we’re really looking for individual taxpayers who become clients paying $1,000, or small business tax clients paying maybe $2,000 year. And the goal is for these clients to return year after year. The product mix improvements, in the end, changed the game. In fact, we didn’t even need to recover from Google's algorithmic penalties once we fixed the product mix. However, improving our conversion rates and dramatically bumping up our web traffic certainly makes growing easier. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Recovering from Google Algorithmic Penalties: A Small Business Tells Its Story"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Recovering from Google Algorithmic Penalties: A Small Business Tells Its Story"
    },
    {
      "level": "H2",
      "text": "Step 1: Clean up the links"
    },
    {
      "level": "H2",
      "text": "Step 2: Create a new site"
    },
    {
      "level": "H2",
      "text": "Combining the effects of Step 1 and Step 2 (a digression)"
    },
    {
      "level": "H2",
      "text": "Step 3: Optimize conversion rates"
    },
    {
      "level": "H2",
      "text": "Step 4: Improve the product mix"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Stephen Nelson\n          \n            Stephen Nelson"
}