{
  "url": "https://moz.com/blog/recovering-from-the-penguin-update-a-true-story",
  "slug": "recovering-from-the-penguin-update-a-true-story",
  "title": "Recovering from an Over Optimization Penalty - A True Story - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As almost anyone reading this post already knows, April 24, 2012 marked a big day in the search industry. Once the initial Penguin update was rolled out (please believe me this is only the beginning and there is much more to come) the SEO industry as we know it exploded in a flurry of fear and…",
  "content": "Recovering from an Over Optimization Penalty - A True Story Advanced SEO By: Nicholas Eubanks May 30, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Nicholas Eubanks May 30, 2012 Recovering from an Over Optimization Penalty - A True Story Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As almost anyone reading this post already knows, April 24, 2012 marked a big day in the search industry. Once the initial Penguin update was rolled out (please believe me this is only the beginning and there is much more to come) the SEO industry, as we know it exploded in a flurry of fear and satisfaction. For those of us that had sites get hit (I'll admit I had several sites dinged by this update) what started out as anger quickly turned to fear and curiosity. Many industry publications jumped the gun and, in my opinion, began publishing tips and processes on how to 'recover from Penguin,' when the truth is, as mentioned by Ian Howells in his recent SEO Podcast, it's really too soon to tell the full effects of these algorithm updates and anyone out there preaching is really just speculating. The best information I have seen thus far is from The HOTH, and that is DON'T PANIC, and BE PATIENT. I did, however, have a real life experience where one of my sites, my own personal blog, got hit for what I am now almost sure was over optimization, and I was able to recover. What's really interesting to me is that my site, nickeubanks.com, got hit at all... let me explain. My personal site is low traffic, low importance. I do not build links to it, I do not monetize it, it really just exists to serve as my digital resume and a place for me to openly ramble or rant when I feel like it. The Penguin Smack Here is a screen shot of Google on Friday May 18, 2012. After a friend of mine reached out to me to ask if I had taken my site down (of course he didn't just go and check the domain :P) I asked him what he was searching for. He mentioned he had typed in some words in the title from what he could remember and my name - which should be more than sufficient to generate a SERP with my post(s). It did not. Instead this is what he was seeing: With Inbound.org starting off the list, it was page after page of places that linked to my post - but not the post itself. My immediate reaction was fear that somehow my site was sandboxed. So to check I did a quick search for the full post title in quotes and there it was... what does this mean? That my site was penalized... but for what? As I mentioned before I don't do any active linking, advertising, and the site has slim to no traffic. My first thought was that I might have been a victim of Negative SEO. I logged into Webmaster Tools and pulled down my indexed Google back-link profile, which I have put into a public Google Doc here so you can see it. Upon review you'll see this is a pretty natural back-link profile, even with some links from some pretty authoritative websites... at this point I am scrambling for answers... What The Hell is Going On!? I was racking my brain to think of what it could possibly be that was causing my site to be buried in the SERP's, especially for posts that have a lot of natural links, social signals, and are full of unique, well written content (note: I didn't write most of the content in these posts). I reached out to my buddy Mark Kennedy, as among the Philly SEO crowd he is certainly one of the most passionate SEO's I have ever met. He had the same line of thinking that I did and immediately hit up ahref's looking for spam-links or clues. Nothing. His next suggestion was to pour over any recent changes I made to the website. I reviewed some of the CSS changes and couldn't find any messy code or mistakes that may have warranted the site to be dinged (Did I mess up my headers? Did I botch a declarations statement?) Nothing. The only thing I could think of was to really take a closer look at my links, so I started inspecting each of the sites that was linking to me. During this process I stumbled across my old blog from college, 23Run.com. Here are the Google indexed links from 23Run. As you can see there are 77 of them, which out of my total indexed link profile, is roughly 11%. I went to 23Run.com to take a closer look at how my site was linked: I Had to Change This And there it was... right in line with the Pengiun post from Microsite Masters showing sample data from their analysis, I had over 10% of my links over-optimized for anchor text. So I made this quick change: How Long Will I Have to Wait? And then needed to gauge about how long it would take for Google to crawl my site and index these changes, so I took a quick peak at my average crawl rate in Webmaster Tools: and seeing that my average crawl rate was 59 pages, but my low was 24, I decided to give it the weekend and check back on Monday May 21, 2012. When Monday's production activity calmed down, sometime in the early afternoon, I decided to run the query again and alas; Resurrection! It is still ranking underneath Inbound.org, which is a bit strange, but it's back! Furthermore, the post is back to ranking for more broad terms, such as 'fresh insights nick eubanks' as you can see below: Conclusion & Takeaways Plain and simple, over-optimized anchor text can be dangerous. What was once the holy grail of SEO, getting links with your target keywords in the anchor text, is now something that requires careful planning and attention. My advice is to develop your link profile to not look natural, but to be natural. If your anchor text is 'over optimized', you run the risk of being penalized, so make the effort and put in the time to naturalize your links. Try to replace anchor text links with naked URL's or at the very least more natural anchor text - try to think about these links in the same sense of someone who doesn't know you, finding your page or post and creating a link organically; most likely it won't be your target keywords but your name, page/post title, or a more generic link text such as read more, learn more, etc. I hope my real-life example proves useful and helps, in any small way, to dispel some of the speculation out there. Thanks for reading. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Recovering from an Over Optimization Penalty - A True Story"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Recovering from an Over Optimization Penalty - A True Story"
    },
    {
      "level": "H2",
      "text": "The Penguin Smack"
    },
    {
      "level": "H2",
      "text": "What The Hell is Going On!?"
    },
    {
      "level": "H2",
      "text": "I Had to Change This"
    },
    {
      "level": "H2",
      "text": "How Long Will I Have to Wait?"
    },
    {
      "level": "H2",
      "text": "Resurrection!"
    },
    {
      "level": "H2",
      "text": "Conclusion & Takeaways"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Nicholas Eubanks\n          \n            Nicholas Eubanks\n          \n            Nicholas Eubanks"
}