{
  "url": "https://moz.com/blog/redesigning-seomoz",
  "slug": "redesigning-seomoz",
  "title": "Re-designing SEOmoz - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The re-design of SEOmoz has proven itself to be a very difficult and time consuming task, as you can see I'm still working on the header. Rand suggested I write a blog entry so you can all see how things are coming along and share in my turmoil. :) \n Some of the designs turned out okay, others are…",
  "content": "Re-designing SEOmoz Moz News O By: Oatmeal January 19, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! O By: Oatmeal January 19, 2006 Re-designing SEOmoz Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The re-design of SEOmoz has proven itself to be a very difficult and time consuming task, as you can see I'm still working on the header. Rand suggested I write a blog entry so you can all see how things are coming along and share in my turmoil. :) Some of the designs turned out okay, others are just plain horrible. I've found my best work comes by accident, so I often just tinker around until I start to like what I'm seeing rather than having some kind of plan and sticking to it. This tinker-until-you-get-it process often yields some pretty freaky stuff. I'm pretty sure none of these designs are going to make it into the site, but if I had to pick one it'd be one of the following three: The rest of these aren't very good. I went for some pretty awful color schemes on some of them and you can definitely see I'm fond of gradients. The quest to make a web 2.0 site is difficult. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Re-designing SEOmoz"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Re-designing SEOmoz"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Oatmeal\n          \n            Oatmeal"
}