{
  "url": "https://moz.com/blog/regulating-online-identity-theft",
  "slug": "regulating-online-identity-theft",
  "title": "Regulating Online \"Identity Theft\" - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Reputation management problems are delicate enough when a company or an individual discovers negative press in search results for its name or common keywords. The situation becomes even worse when undesirable results are not the work of a disgruntled person writing about another, but of someone…",
  "content": "Regulating Online \"Identity Theft\" E-Commerce SEO By: Jane Copland July 16, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jane Copland July 16, 2008 Regulating Online \"Identity Theft\" E-Commerce SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Reputation management problems are delicate enough when a company or an individual discovers negative press in search results for its name or common keywords. The situation becomes even worse when undesirable results are not the work of a disgruntled person writing about another, but of someone pretending to be the other person. With the growth of social media and, specifically, social networking, this problem only seems to be getting worse and I wonder whether it's time for this sort of behaviour to be better regulated. The potential for this type of abuse has been around for quite a while and I'm not sure why it has recently escalated. Those in the SEO / affiliate marketing world who use Twitter may have noticed the @shoemoney / @shoemoneymedia incident involving Jeremy Schoemaker and a very odd \"fan\" who created an opportunistic Twitter account after Shoe's was disabled. The account said and linked to some rather strange things. Similar episodes involve a British man whose former friend created a fake Facebook profile in his name, and a school administrator whose name was used to set up a Facebook account that sends inappropriate messages to students. Pretending to be someone else online is hardly new, but every new and popular social network brings with it a rush to register user names. The instant popularity of Plurk resulted in bigger rush than usual. Somebody pointed out that Plurk's terms of service include the following statement, which hopefully prevents corporate usernames from being registered and / or abused: You agree that we may reclaim usernames on the Service on behalf of businesses or individuals who hold legal claim or trademark on those usernames. Upon visiting Plurk for the first time, more than one person found that their recognisable moniker or company name was unavailable. Being infuriated that someone's life is sad enough that they take pleasure in registering other people's identities is only made worse by the idea that people may do so for malicious purposes. Take a look at this SERP. Scroll down. Edit: of course it shows up on Page 2 now. I wouldn't want this to be accurate, would I? Firefox and Internet Explorer (at the least) will make you override their security in order to view the explore.twitter.com subdomain, but this is indeed looks a lot like SEOmoz's Twitter account. The problem is that an SEOmoz employee didn't created it and its only two (identical) updates are offensive and unflattering. Rand's attempts to gain control of the account were unsuccessful, which is quite a different customer service experience than that encountered by Shoemoney after his account was disabled. At the time of writing, sixty-five people follow this account. Its two updates are hardly damaging, but the account's creator obviously doesn't have our best interests at heart and could begin posting again at any time. It's disappointing that Twitter has never responded to Rand about the issue. I am not sure how much of a legal difference it makes, but the account is also impersonating Rand by using his image and his full name. I'm also not swayed by the argument that the account looks obviously fake. The account will fool some people who'll subsequently think that Rand talks like that in public and about his company. It would also be pretty easy to include more believable updates alongside offensive content. Social media abuses like those cited about should be easy to fix. Facebook has shown responsibility in disabling fake accounts. Luckily, Plurk pages don't seem to rank nearly as well as Twitter profiles for user names. MySpace has a process in place to deal with fraudulent accounts and I've never heard of anyone having difficulties in having an account removed from their site, even if the verification process is a bit unconventional. Where we are running into difficulties is when a service won't act upon accounts that misrepresent their creators' identities. What is a person's next step if they don't receive a response from the hosts of the fake accounts? Some people have resorted to suing the company involved, but should there not be an intermediate step? It seems that we could write to Twitter until we're blue in the face without a reply. Additionally, it's not worth our while to make a legal fuss about the account (we have enough real work to do at the moment), but we'd rather gain control of something that pretends to be our work and ranks on the first page of Google for our company's name. And this whole discussion doesn't even get into misrepresentation on relatively anonymous blogs, such as those hosted by Blogger or Wordpress. Due to user-name squatting, it's becoming increasingly important to pay attention to new trends in social media. We even thought we were quite quick off the mark when it came to Plurk, but we were still beaten to it. How would we be able to regulate online misrepresentation without creating the elephant-in-the-room web standards for content? Or is it really just a case of hoping social media companies take responsibility (despite a lack of legal implications)? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Regulating Online \"Identity Theft\""
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Regulating Online \"Identity Theft\""
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Common Mistakes E-commerce Websites Make Using JavaScript"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jane Copland\n          \n            Jane Copland"
}