{
  "url": "https://moz.com/blog/rel-canonical-is-just-a-bandaid",
  "slug": "rel-canonical-is-just-a-bandaid",
  "title": "Rel Canonical: Impact on Analytics - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There is one topic that relates to the canonical tag that no one is talking about yet.\n\nIt's impact on Google Analytics.\n\nI'm a numbers guy by nature. I check various stats in Analytics every day. I'm always looking for new ways to look at the numbers and new ways to figure out what they're telling…",
  "content": "Rel Canonical: Impact on Analytics On-page SEO M By: Matthias Hager November 17, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! M By: Matthias Hager November 17, 2010 Rel Canonical: Impact on Analytics On-page SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Ever since Google, Bing, and Yahoo! joined forces to implement the canonical tag as a bandage for duplicate content issues, there has been a lot of debate in the SEO world about its usage. Many experts feel that it is too easy to be used improperly, so much so that webmasters are going to screw up entire websites with it. While I have not yet been convinced that it should be shunned, banned, and outcast - I feel that it is hardly ever the best solution. At best, it is a Band-Aid. It won't heal wounds. It won't prevent wounds from occurring. But it is a quick fix that can certainly help some situations. Lindsay Wassell wrote a Complete Guide to Rel Canonical that covers nearly everything you need to know about the canonical tag. There is one topic that relates to the canonical tag that no one is talking about yet. It's impact on Google Analytics. I'm a numbers guy by nature. I check various stats in Analytics every day. I'm always looking for new ways to look at the numbers and new ways to figure out what they're telling me. Yes, they talk to me on occasion. The rel canonical tag screws up your Analytics data in a big way. Let's start at the basics. You clearly have issues with duplicate content. On large sites, that is nearly impossible to avoid. Even the best of Content Management Systems doesn't solve every issue. At some point either you or some other website links to a page that exists in two places. For all the reasons pointed out in articles above, you need to fix this. Should I use a 301 redirect, or the rel canonical tag? Using the canonical tag is a Band-Aid, remember? It doesn't fix the issue. Sure, the search engines might use it to figure out that they are the same page and rank only 1 of them so you're not competing with yourself. You stopped the bleeding. Even though you used the tag, two distinct pages still exist. Since both are linked to from somewhere on the Internet, visitors will be visiting two different pages. This means your Analytics data is splitting the data between pages. It doesn't realize that they are the same page. It can't read the canonical tag. Let's take a look at it. I work on e-commerce websites. This is where duplicate content has been a huge issue for years. Sometimes a product sits in two different categories, like a tomato being both a fruit and a vegetable. (What's the consensus these days?) Ecommerce platforms like to know how visitors found the content, so that leads to: myfreshproducestore.com/vegetables/tomato.html and myfreshproducestore.com/fruits/tomato.html The tomato.html page is the same, just found in two different URLs. It should be noted that many of the most popular e-commerce platforms have solved this issue by not using URL path tracking. The custom platform all of our clients live on is still a little antiquated and hasn't fixed this issue yet. Out of 11 different sites on the platform that I checked, roughly 35% of the pages are duplicates. On 1 ecommerce shoe store, 78% of the pages were duplicates. Yep, that means on average each page has 5 different instances. So why does rel canonical fall short? Each of our product pages has a specific system number. In this case, p2 sits at 37 different URLs! Obviously, this is an extreme case, but it's equally important in the tomato situation where it resides at only 2 locations. When I want to go look at page specific data, I can't just look at 1 URL. In this case, I have to look at 37. With the tomatoes, I have to look at 2 still. I can't take a quick gander at p2 and say, \"oh, I need to do this…\" Of Long Tails and Landing Pages One of the ways I look at long-tail traffic is through total number of keywords bringing traffic and total number of landing pages. Rand has also at times recommended this approach for discovering better indexation numbers. The problem with that 2,792 number? There are only 500 products on the site and fewer than 100 category pages. How do I know which products are actually being indexed? Is Google indexing the same 400 products 7 times each and ignoring 100 of them? If I dig down deep enough, crunch enough numbers, and dig through enough data I might be able to figure this out. If we had this duplicate content issue fixed it would be easy as pumpkin pie to tell if there is a problem. In this case, canonical tags have not solved the problem. We started using them 3 months ago (after a lot of schmoozing of the tech department), and our landing page numbers are still absurdly high. This means Google is still not entirely able to figure out whether or not a tomato is a fruit or a vegetable or both. Clearly, in our case the root of the problem is with our platform. Implementing canonical tags has seemingly reduced the number of indexed pages by about 25%. Whoever thought we'd be hoping for fewer pages indexed? Dr. Pete's case study shows that the canonical tag does work, at least when you don't want it to. It is a temporary fix, a band-aid. To solve our duplicate content problems we need to fix our platform and use 301 redirects on all the duplicate pages. That would mean no more looking at 37 unique URLs to figure out the bounce rate of 1 product page. No more spreading out short and long-tail keywords over 2800 pages instead of 600. The rel canonical tag creates major issues with Google Analytics. It should not be your solution to duplicate content issues. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Rel Canonical: Impact on Analytics"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Rel Canonical: Impact on Analytics"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Matthias Hager\n          \n            Matthias Hager\n          \n            Matthias Hager"
}