{
  "url": "https://moz.com/blog/relationship-seo",
  "slug": "relationship-seo",
  "title": "Relationships and Reputation: Important For SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We see a lot out there on cutting-edge search engine optimziation in terms of technology, methodology, and strategy.  And there is no doubt that those are all essential aspects to successful SEO.  However, there's a lot less about some good old-fashion concepts that also work great in the world of…",
  "content": "Relationships and Reputation: Important For SEO Online Advertising By: Gyi Tsakalakis October 8, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Gyi Tsakalakis October 8, 2010 Relationships and Reputation: Important For SEO Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. We see a lot out there on cutting-edge search engine optimziation in terms of technology, methodology, and strategy. And there is no doubt that those are all essential aspects to successful seo. However, there's a lot less about some good old-fashion concepts that also work great in the world of search. While SEO is many parts technical, some parts creativity, and a bunch strategy, it's also a bit relationships and reputation. Relationships As anyone in the SEO business knows, establishing quality relationships with other seo professionals is vital to success. Whether it be access to information, tools, or simply links, having quality relationships within the seo professional community can have a huge impact on your success in this business. Relationship building is the ultimate link-bait strategy. I can't count the number of times that a professional relationship has led to new links for us and our clients. And it really shouldn't come as any surprise. After all, a link is nothing but an online endorsement. And what better way to get an endorsement than to establish a new professional connection. Furthermore, in addition to the SEO's relationships, the relatioships of the seo's clients are equally important. For example, I work with legal professionals. Established legal professionals that have relationships within their community can have much faster seo results than their less-established or isolationist competitors. No matter the industry in which you work, establishing and leveraging your professional relationships should be a core part of your SEOstrategy. Reputation Relationships alone aren't enough. You have to have reputation. After all, if you're known as incompetent or an a**hole, you probably won't reap the SEO benefits of relationships (unless of course you're controversy marketing). When an SEO has a bad reputation, it is not only likely to impair his/her ability to get new clients, it can also impede their ability to produce results. Again, SEOs with bad reputations are less likely to have access to the benefits of their good-reputation counterparts. That is not to say that having a \"bad rep\" means you can't be a good SEO. Let's face it, there are plenty of successful bad-reputation SEOs. However, imagine how much more potential they may have with a good reputation. With regard to the client's reputation, the same applies. We have found that our attorney clients that have excellent reputations within their communities have much more success with seo, as well as, social media and networking. Which also makes sense. Relationship Strategies Here are a couple relationship building strategies that have had an impact on our SEO: Attend Industry Events - However, don't just sit there and watch. Meet people. Discuss relevant issues. Share ideas. Sponsor Events - Sponsoring events will help you meet a lot of folks. It will also probably produce some links directly too. Attend Meetups - While this might be more or less effective based on your location, we have found Meetups.com to be a great place for meeting new people interested in the things that interest us. Commenting On Blog Posts - Yep, commenting is still a great way to meet people. Twitter Replies - Instead of \"lead tweeting\" try replying. As you can see, there is a natural overlap between relationship building and search engine optimization. While relationship building takes time and effort, it will be well worth the investment. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Relationships and Reputation: Important For SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Relationships and Reputation: Important For SEO"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Gyi Tsakalakis\n          \n            Gyi Tsakalakis"
}