{
  "url": "https://moz.com/blog/remember-the-back-to-work-button",
  "slug": "remember-the-back-to-work-button",
  "title": "Remember the \"Back to Work\" Button? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Back in the days before the web, many of the MS Windows bundles games had \"back to work\" buttons that would open up a blank spreadsheet document on top of the game in order to \"hide\" a worker's activities from perusing bosses doing their walk around.\nHilarious...",
  "content": "Remember the \"Back to Work\" Button? Moz News By: Rand Fishkin January 27, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 27, 2006 Remember the \"Back to Work\" Button? Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Back in the days before the web, many of the MS Windows bundles games had \"back to work\" buttons that would open up a blank spreadsheet document on top of the game in order to \"hide\" a worker's activities from perusing bosses doing their walk around. Hilariously enough, while checking sites for entry into our directory, Kat stumbled across a new form of the \"back to work\" button - a floating dominatrix icon on the right hand side of a sex shopping site in the UK. It's a brilliant little addition to the site and it re-directs right to Google's homepage (presumably indicating the person is hard at work). This is the kind of post we all need on a Friday afternoon :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Remember the \"Back to Work\" Button?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Remember the \"Back to Work\" Button?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}