{
  "url": "https://moz.com/blog/remove-unnecessary-steps-and-win-more-links-shares-and-conversions-whiteboard-friday",
  "slug": "remove-unnecessary-steps-and-win-more-links-shares-and-conversions-whiteboard-friday",
  "title": "Remove Unnecessary Steps & Win More Links, Shares, and Conversions - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The more you simplify your user experience, the more likely users are to accomplish the goals you've set for the product, website, or communication at hand. In this week's Whiteboard Friday, Rand walks us through user experience and the actions that we can remove from our processes in order to…",
  "content": "Remove Unnecessary Steps & Win More Links, Shares, and Conversions Whiteboard Friday By: Rand Fishkin April 12, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 12, 2013 Remove Unnecessary Steps & Win More Links, Shares, and Conversions Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. When creating a product, website, or communication, including a simple user experience is key to success. The easier you make the A to Z process for a user, the more likely they'll be to accomplish the plan you spent time and resources putting together piece by piece. In this week's Whiteboard Friday, Rand walks us through user experience and the actions that we can remove from our processes in order to drive more conversions, earn more links, get more social shares. Simplicity, FTW! This week, we've added a still image of the whiteboard for easier viewing. Do you find this addition helpful? Let us know in the comments! Video Transcription \"Howdy, SEOmoz fans, and welcome to another edition of Whiteboard Friday. This week I want to talk a little bit about user experience and the actions that we can remove from our processes in order to drive more conversions, earn more links, get more social shares. Let me show you what I'm talking about. In this first example, embed codes, a lot of websites use embed codes all over the place. SlideShare is a good example. When you get to SlideShare, you find a particular presentation, and then you can copy and embed that onto your page. Bitly is another good example. When you go to Bitly, they've got a little copy and paste sector. You paste in a link. It turns into the short Bitly link. You grab that out. All sorts of things do this. YouTube does it. Vimeo does it. Any type of infographic that's embeddable, they all have these embed codes. Embed codes are a phenomenal way to drive links, especially to content that people are likely to put on their own sites. The problem becomes when you make that a multi-step process. In fact, we've seen research and data from several sources now, saying that if you can make this a single click on here, and it says \"copy to clipboard\"' automatically, as opposed to popping something up like Bitly has started to do, or having to grab the entire embed code, Ctrl A, Ctrl C. I have to copy it myself, that actually will drive more embeds, meaning more links to the places you want with the anchor text that you want. We remove an unnecessary step, that secondary piece, and make it so one click right in here with you cursor gets you copied to clipboard, a transitional message or a temporal message that pops up that says, \"Copy to clipboard,\" or says below here, \"Copy to clipboard.\" Now, all I have to do is paste, and I'm done. Very, very simple. Very easy. Number two: Shorter, more action-oriented emails. We send a lot of emails. We send emails for outreach. We send emails that are in newsletter format that are trying to drive actions back to our websites. We send emails to try and get shares from our friends or our network, those kinds of things. All of these can be made more concise and more actionable. I see a lot of challenges when we sort of go, \"Oh, I'm going to start with some nice fluffy introduction. Here's who I am. Here's more about my company. Oh, and now here, here is the final action. This is what I was actually trying to get you to do. I felt like for some reason I had to do all of this.\" Email is a medium where heavy communication is great between people you already know, where there are lots of things to say, and you need to have that more complex dialogue. When it's between new people, between strangers, between someone you're reaching out to, I find that the most effective emails I ever get from an outreach perspective are, \"Hey, Rand. Love what you're doing over there at Moz. Would you send this over to someone on your product team or someone on your marketing team?\" Or, \"Hey, we have this app that we think would be great for your events folks. Could you make an intro?\" That is something I'm likely to do very, very quickly. Or, \"Just check out this new app. It does this.\" Great. Really quick. All the press release ones I get are like, \"Such and such is a this type of company, and here's all of this. Here's their latest press release. They raised this round of funding. Would you be interested in writing about them or talking to their CEO on the phone?\" Dude, all you have to do is have that CEO email me and be like, \"Hey, man. I want to connect.\" I'll be like, \"Hey, let's chat. Sounds good. Sounds interesting,\"' if it actually does sound interesting. Shorter, more action-oriented emails. Number three: Simpler sign-up forms. Oh, my goodness. You do not need to collect all of this data all at once. I need name. I need first name and last name. I've got to get this person's address, or at least the city and state they're in, because of this. You can collect so much of this data in the application later, as they're using it, if they're actually using it. You can collect some of that from IP address, location sensitive IPs, those type of things. You can tell the type of device they're on. The thing is, as people browse the web more and more with mobile devices, this guy right here, when I'm on here, I absolutely hate filling out forms. The most I can ever do is an email and password field. A confirm password field really gets me going. It's just infuriating because it's a pain to type those extra letters, especially on something that doesn't have a full keyboard. If you can remove those and ask for that later, remember even if they get their password wrong and they forget it, you have still emailed them. You've got their email address, and you've sent them an email. It says, \"Hey, click here to confirm.\" If they log back in, oh now the password is wrong or they forgot, great, you can fix that later, but you've gotten that initial essential sign-up. That's what you're looking for. Number four: I know HTTP is a common protocol. So is GTTP, or at least I'd like to make it one. Get to the point with your content. Get to the point. A lot of the time, I see this stuff tweeted and shared on social networks, put on Inbound.org or Hacker News, where it says, \"Hey, conversion rate testing shows that this performs better than that.\" Cool. Then, I have to scroll and scroll. Where is that? Oh, there's the test. There's that test they were talking about. It's way down deep in the content. I'm not exactly sure why, but a lot of times with blog content, with even infographics, with videos, with stuff that we should be sharing on the web and is good content, we're trying to say, \"Here's what I want to tell you, and I'm prioritizing that for some reason above what you actually care about.\" What you actually care about should be the primary and potentially only thing on that page. If you really have stuff that you want to tell me, I will go investigate. I'll check out your About page. I'll check out your product pages. I want to see what your company does because it sounds interesting. You've got a cool brand, and you've got a great blog post and that kind of thing. If you really must, you can put it down here below the stuff that I actually care about. I came to your site to watch a video I was told was awesome, to check out an infographic, to see, to learn something about a test, to figure out something, solve some problem. Deliver that to me upfront, please. That will not only make me more likely to come back to your site in the future. I'll have a positive brand association. I'll be more likely to share that content. Just a beautiful thing. Number five: You actually see this a lot, and I see tremendous effectiveness when this is done, which is socially sharing links directly to what matters on the page or on an individual site. A lot of times, there will be a product tour section. Then, there's a video, a really interesting video or a demo. I'll see the social shares that are most effective are the ones that point directly. Sometimes, they have a JavaScript field in the URL that has a hash in it or a hash bang system or whatever it is. Those people who share direct do better than the ones who share the broad page. They've gotten into the process and dug around enough to share directly that piece that I care about. You can do this too. In fact, I have recently seen a test where I essentially had been tweeting a link to something like where we were competing against another company for which company is better at this particular thing. I had been tweeting links to the page. Then you had to scroll down the page quite a ways, and then there was a little voting widget. Then I saw from the voting widget itself, there was actually some hash URL that would link directly to the voting widget on that page. When I tweeted that, it drove way more actions. In fact, like four or five times as many actions. I think something over 100 votes, whereas previously I had shared it a couple times and gotten like 15 or 20 votes from it. That is definitely a way to show that tweeting directly to the thing you want people to do, great way to socially share and to make those shares go further. Last one, maintaining logged in state. Zappos, Amazon, all do this brilliantly well. Google actually does a pretty solid job of it as well. They maintain a logged in experience for as long as possible. Do you remember back in the day with Twitter? You used to get logged out all the time. They just weren't maintaining cookies and session variables and all that kind of stuff. You were losing your log in. You'd have to log into Twitter, even though you clicked that Remember Me button, you'd have to log in many, many times, every time you came back. If you have this \"Please log in\" system here, and it does it even though you clicked \"Yes. Please, remember me\" down here, remember, please remember. Check. You're killing your conversions. I don't just mean conversions in terms of someone who makes a purchase. I mean someone who might have left a comment, someone who might have participated in your community, someone who might have shared something, someone who might have reached content they otherwise wouldn't have, someone who might have been a lead for you. Moz actually did this. We have this as a conversion killer, and we can show the data. It was about 18 months ago, I think, that Casey and the inbound engineering team did a bunch of work to make sure, that most of the time, you're logged into your account. You wouldn't be logged out as quickly. I still find some challenges with it, but it's way better than it used to be. The data shows. You can see more comments per post view. You can see more people checking out and filling out their accounts. All that type of activity, that UGC that's driving long tail traffic, just a beautiful thing by maintaining this logged in state. All of these are specific examples. The big takeaway message here is you don't need unnecessary steps. You don't need to be taking actions and requiring things of your visitors that they don't need to do, especially with the rise in mobile browsing and with the advantages that we've seen from web page speed increasing. We know, as web users and as people who build for the web, that visitors care tremendously about accomplishing tasks quickly. They're getting more and more used to it on their phones, on their desktops, on their laptops, on their tablets. We need to deliver that in order to be successful at marketing as well. All right, everyone. Hope you've enjoyed this edition of Whiteboard Friday. We'll see you again next week. Take care.\" Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Remove Unnecessary Steps & Win More Links, Shares, and Conversions"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Remove Unnecessary Steps & Win More Links, Shares, and Conversions"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}