{
  "url": "https://moz.com/blog/reporting-live-from-ses-london",
  "slug": "reporting-live-from-ses-london",
  "title": "Reporting Live from SES London - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "London's been a bit of whirlwind for all of the mozzers. My first two nights here featured the same thrilling insomnia that characterized my last visit to London - remember these? Luckily, at this point, I'm well rested and able to cognitiv...",
  "content": "Reporting Live from SES London SEO Events By: Rand Fishkin February 14, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 14, 2007 Reporting Live from SES London SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. London's been a bit of whirlwind for all of the mozzers. My first two nights here featured the same thrilling insomnia that characterized my last visit to London - remember these? Luckily, at this point, I'm well rested and able to cognitively process most of the information I'm taking in. There's no doubt that after a dozen SES conferences over the past 3 years, there's a bit of diminishing returns. Certainly, there's a lack of motivation to attend as many seminars as I should, particularly since I've seen many of them several times and this combines with the increase in online coverage of the industry and the sheer number of events to make for a less discovery-intensive journey. However, for first timers, or even second timers, my feeling is that the value here has increased since last year. There's a higher concentration of people, and the conference is less spread out. There's also a confluence of a lot of great minds - yesterday's organic listings forum (of which I was the white-hat of the bunch) brought a lot of terrific questions, both high level and basic. On the social front, the parties in London are a bit smaller and more intimate, but no less enjoyable. Scott & Rebecca have been out until 2-3am at the hotel bar, carousing with London's finest (and drunkest). Last night featured my first-ever bottle of Dom Perignon (an engagement present from that chap who makes clawfoot tubs), a drunken arm wrestling contest, a lot of congratulatory handshakes, and plenty of needling about creating the most \"linkbaity\" wedding proposal in history (it will be many conferences before Messrs Naylor & Boser stop giving me a hard time). I admit to getting a wee bit pissed off by the folks who think it was a \"marketing scheme\" or \"fake,\" but I suppose that comes with the territory. On the SEO tactics front, I've had a couple discussions with folks here that have provided some value. Last night, Frank (Aussiewebmaster) and I got to chatting about the GoogleBomb prevention algo and we've got a fairly good idea of how it works (at least, a good theory). It goes something like this: If lots of links pointing to a page all contain the same anchor text, run it through this filter If the links contain anchor text that does not appear on the page, continue this process If the correlation between the relevancy of the terms contained on the page and the anchor text links are low, continue this process (obviously, we're not sure what the exact limit might be) Remove the anchor text influence of the links with \"bombing-pattern\" terms (we're not sure, but we think the other link factors - PageRank, trust, et al remain in place) This could help explain why nearly every Google-Bomb is gone, but a few, like click here, homepage and will you still have results that show pages without the text on the page near the top. In addition, I had some conversations about how universally applicable linkbait could be, particularly for industries that have absolutely no tech-focus whatsoever. Of course, when I saw this on the top of Digg, I figured I can rest my case. There's nothing less Digg-centric than Lobster fishing, but this guy's bait doesn't just include chum. More goodies? MSN has a booth at the exhibition hall, but for the first time in recent memory, neither Google nor Yahoo! have booths. Richard Zwicky tracked more than 200 million search queries through Enquisite, and the oddest trend emerged - Yahoo! has been slowly gaining market share since December. The British have a sense of humor that I'm unable to penetrate, but I am considering throwing some of these into my presentation to help out. The ghost of Danny Sullivan was in the keynote this morning - during Chris Sherman's talk with Matt Cutts, two of the banners fell off the wall - one for Incisive Media and another for SearchEngineWatch. It felt eerily ominous. More from London to come - Rebecca's working on her patented comics, which promise to entertain. Tomorrow I'm speaking on Analytics, but, oddly, I couldn't get on the linkbait panel. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Reporting Live from SES London"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Reporting Live from SES London"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}