{
  "url": "https://moz.com/blog/repurpose-old-content-whiteboard-friday",
  "slug": "repurpose-old-content-whiteboard-friday",
  "title": "How to Repurpose Your Old Content – Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Breathe new life into your existing content. Join Ross Simmonds in this Whiteboard Friday as he shares strategies to transform your old content into valuable assets that drive results and boost brand authority.",
  "content": "How to Repurpose Your Old Content – Whiteboard Friday Whiteboard Friday | Content Marketing By: Ross Simmonds September 15, 2023 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Ross Simmonds September 15, 2023 How to Repurpose Your Old Content – Whiteboard Friday Whiteboard Friday | Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Edited by Emilie Martin Breathe new life into your existing content. Join Ross Simmonds in this Whiteboard Friday as he shares strategies to transform your old content into valuable assets that drive results and boost brand authority. Click on the whiteboard image above to open a high resolution version in a new tab! Video Transcription Howdy, Moz fans. Howdy, \"Whiteboard Friday\" fans. I am super excited to chat with you today about how to take something that we all have, you might smell it, you might smell it, it is content that is burning money in your pocket, content that you actually invested in that is collecting dust, content that no longer drives results, no longer does anything for your business, but you wish, you wish it could bring some type of life for your business, some type of joy to your business, some type of ROI for your business. And in today's \"Whiteboard Friday,\" that's exactly what we're gonna be diving into. Your old content is burning money Were gonna be talking about how that content that is just burning money, just sitting on your site, not collecting any revenue, not driving any sales, driving no links, driving no results for your business, can be brought back to life. That's right, we're going to go to town on that old content, give it new life, bring it back, and ultimately give you the ability to unlock new levels of growth for content that you thought was dead. Let's jump into it. So we're all there. We have all had content that we've invested in. We've all heard a guru speak onstage at a conference and say, \"Content is king. Write more content. Create more content.\" And we've listened. We've developed tons of content as business owners, as marketers, as CMOs. We've invested in these assets, but the ROI of some of them has started to deprecate. It's started to go down. At one point, it was up and to the right and everything looked beautiful, but now, eh, it's starting to tank. It is starting to tank. It's no longer driving results. The traffic is no longer there. It's no longer on page one of the SERP. You are starting to see that content that at one point was a cash cow is no longer driving the results that you and your business wants. How can you bring these pieces back to life? We're gonna talk about it. In addition, you might've had a few pieces that were a one-hit wonder. When they hit the internet, when they went live, the internet went wild. The leads were flowing. The revenue was flowing. The links were flowing. Everything was flowing in the right direction. But time went on and those pieces that were at one point a hit, that resonated with people, that people embraced, that people shared, that people talked about, those pieces are no longer generating any buzz for you. They're no longer generating any results for you. We're gonna talk about how to bring those one-hit wonders back to life. And finally, there might be a piece that you, your team, your organization created early on that really communicated some of the key messages that you want your audience to hear, some of the key stories, some of the key ideas, some of the key concepts that truly understand and communicate the value that you bring to the market, the pain points that your customers are having. And these key messages are messages that you want to get back out there. It's a key message that at one point resonated so closely with your audience that you feel like your team may have lost the way and have lost sight of the key message that you wanted to articulate. How do you bring all of these pieces back to life? Things that are currently just getting zzzs, people are sleeping on them, they're not reading them, they're not engaging with them. It's essentially money just being burned because you invested time or energy in them. How do you bring 'em back to life? That's what we're gonna talk about. We're gonna talk about how you can do that with text content, with video content, and with audio content. So these are the three primary types of content that you can repurpose, that you can repackage, on the internet. Text content falls into the category of things like blog posts, of white papers, of e-books, resources that you created that, again, were very valuable at the time that they went live, but maybe got crickets, maybe were a one-hit wonder, or maybe they were ranking number one and now they're starting to tank. How do you bring those pieces back to life? There's a few things that you can do with text content that will let you win. Similarly with video content. One of my favorite formats is video content because it's so versatile. That's exactly what you're looking at now. Kinda meta, but you're looking at a video asset. These video assets can be used still today. A webinar that you might've created, a actually just talking head video where you set up a camera and you talked into the screen. All of these types of assets can be repurposed. They can be remixed, and they can be reshared on your various channels. We're gonna talk about that. Audio content is the exact same thing. There is less versatility with audio content, but audio content is powerful. But it's oftentimes misunderstood that these podcasts that you might've created two years ago, three years ago, can be repackaged even today. How to bring your text content back to life So let's start with text-based content. Text-based content is one of the fundamentals of the internet. When you were thinking about text-based content, let's say you have a blog post. Do you just press publish and call it a day? No, you need to take that old blog post that you created two years ago and then start to share it on social. And you do that with social media posts. So you are going to start putting up posts on social directly on your various channels, whether it's LinkedIn, whether it's X, whether it's Facebook, you name it. Whatever channel it is that you're using, you're going to take that asset and you're gonna promote it. You're gonna amplify it. You're gonna share it on those channels. Then, we have things like carousels. Carousels are a very engaging way to tell a story about a piece of content that you created but tell it in a way that the user, the audience, the people who are on these channels, might actually get value from. What do I mean by that? So let's say, for example, you have a blog post that are five simple things that every SEO needs to know to succeed. Every single one of those slides in a carousel could represent one of those five ideas. So as someone scrolls and they start to swipe their thumb, as they go from one carousel screen to the next, they're reading a summarized version of that blog post that you created. And when you start to share those on social and use hashtags that are relevant to your ICP, it gives you the ability to now take an old asset that was burning hole in your pocket, not generating results, but give it the ability to reach new people, to reach an audience that might not have been online at the same time when you first published that piece, but also have a personal connection to more interactive content and they want to engage via a carousel. You can use tools like Canva to be able to do this, and it is an amazing tool that I strongly recommend that you check out. Email content. All those old blog posts, a lot of brands make the mistake of pressing publish on these pieces, and then, they just call it a day. They don't go anywhere. You have people who are currently on your site probably downloading things, signing up for things. Use your email sequences to reshare these old blog posts that you created that are so important to you. Because by doing that, you're able to connect with people who are meeting you and interacting with you for the very first time. And you can bring that old content, especially if it's a one-hit wonder, and bring it back to life for your audience to love, care about, and see again. How to bring your video content back to life Now, another type of asset is video content. If you have blog posts, if you have e-books, if you have content that you've developed from the text lens, why don't you take that same text and turn it into a script? Turn it into a script that you can read on camera. Turn it into a script that is worth reading, worth talking about, and if you are personally not like in the whole idea of wanting to be on camera and that kind of weirds you out, then instead, maybe you do a faceless video where it's just your audio with animations in the background. But video content is an amazing play for you to repurpose, repackage some of those old text pieces that you developed and then bring them back to life. What do you think the second most popular search engine in the world is? It's YouTube. YouTube is going to give you the ability to now take those blog posts that you created, that you hoped would rank in Google, and now rank in the second most popular search engine in the world. And it just so happens that Google owns YouTube, so eh, you can win on both sites. That is the play. Now, that's text content. When you get that video asset created, if you create it and you develop it, now you're into a trifecta of situation. Because you can now take that video content that you developed and you can turn it into a whole bunch of new content as well. What do I mean? So that video content asset that you just created, a new video, new script that you just recorded, it's amazing. Take the audio file, extract it out of the video, and start to upload that thing to Apple Podcasts, upload it to Spotify, upload it to all of the various podcasting platforms, and let it sing. Let it reach new audiences. Optimize that for search on the podcast platform and let more people hear the audio that was in your video on these different channels. Now, you now have two different assets. You have a podcast episode. You have that, and you have the video. Take these assets and embed them into blog posts that you have produced. That same blog post that you wrote a few years ago, update the dates, add new info, and now embed either the YouTube video that you created or the podcast audio that you created directly into that piece. And now, you have a more interactive experience for the user and the reader who is consuming that content, right? Then, once you've done that, you should be looking at pages on your site that are already ranking high. If you have pieces of content that are ranking well, that are generating organic traffic, take these video assets, take these podcasts, embed them in these pieces so those pieces get additional reach, get additional eyeballs. And it ultimately will influence your ranking in the Spotifys, in the Apples, and in YouTube itself. Now, if you've got video content and you are starting from ground zero with video, let's say you did not embrace the idea of going from text to video, you just happen to have video content, because over the years, again, prior to it being set on fire with just like no results, you were investing in YouTube. Let's say you were investing in webinars. A lot of brands create webinars. They put them behind a gate. They get a bunch of signups and then, they never actually use them again. Take those video assets that you've created and run this exact same playbook, folks. Run the exact same playbook. Take those old webinars, turn them into podcasts, start embedding them into blog posts, or write long-form content based off of the material within that video. Take that, an export of the transcript from the video that you just created or that you created years ago, and start to transcribe it. Rewrite all of that into content in a way that is human, friendly, people would love, people would adore, and get them to consume it. Then, the next thing you wanna do is start chopping up that video. You wanna look for key moments within the video that you developed years ago, or basically, right off of that text, you wanna take certain clips from that and start to repackage and repurpose them. Identify a few key moments where you're saying something special, saying something impactful and important, and then clip it and then start sharing that on social. And the whole cycle begins again. How to bring your audio content back to life Now, another type of content that comes out of this that we talked about was podcasts, audio content. Take clips of those audio, those parts of your video, and start to chop them up into audiograms. An audiogram is essentially a visual that shows the voice wave. So again, if you're not somebody who likes to be on camera, it's a great alternative. And start distributing those on social. Share them on all of your platforms. Share them out, hashtag, let people consume them, engage. Also, turn those podcasts into long-form text, and then, again, embed them into your blog posts. Folks, this is the playbook you need to apply to these pieces of content that you invested so much time and energy into. And if you can, run through these sequences and bring them back to life, update them, improve them, and start to repurpose them. Gain greater return on investment, increase your brand authority, and skyrocket You will be able to see new ROI, new revenue, new results from content that you created decades ago. And when you start to see this, you're ultimately going to start to see an increase in the amount of people talking about your brand. You're gonna see an increase in the amount of people interested in buying your solution, your product, your service, whatever it may be. And from this, by having a content engine that doesn't let content just collect dust and get on fire, you're also gonna have the ability to increase your BA. Your brand authority in the market is going to have the ability to start to rise, right? That is the ultimate goal. You want to increase your brand authority, because if you can do that, then you are ultimately going to have net new leads, net new opportunities, and you're gonna set yourself up for long-term success, which is the game that all of us should be playing. And when you do that, you're gonna essentially set yourself up as a rocket ship. You're gonna be heading to the Moon. You are no longer going to be trying to grab scraps, and you will no longer be in the rat race of always trying to figure out what content you should create next. Because the content that you should be optimizing, the content that you should be producing has already probably been created. The next step is simple: go back, do an audit, identify your one-hit wonders, identify the depreciating ROI assets that you invested in before, identify the key messages that you wanna reiterate to your audience. And once you have those, start to run them through this engine and give your content new life. I'm Ross Simmonds. Thank you so much for checking out my \"Whiteboard Friday.\" I hope you enjoyed it and I will see you on the internet. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Repurpose Your Old Content – Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Repurpose Your Old Content – Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Your old content is burning money"
    },
    {
      "level": "H2",
      "text": "How to bring your text content back to life"
    },
    {
      "level": "H2",
      "text": "How to bring your video content back to life"
    },
    {
      "level": "H2",
      "text": "How to bring your audio content back to life"
    },
    {
      "level": "H2",
      "text": "Gain greater return on investment, increase your brand authority, and skyrocket"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    }
  ],
  "author": "Ross Simmonds\n          \n            Ross Simmonds"
}