{
  "url": "https://moz.com/blog/retargeting-basics-what-it-is-how-to-use-it",
  "slug": "retargeting-basics-what-it-is-how-to-use-it",
  "title": "Retargeting: What It Is & How to Use It - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I've wanted to write this post for a couple weeks now. The topic of retargeting and remarketing is hot, hot, hot. As more blog posts get written and more resources get pushed out, there still seems to be quite a bit of confusion around what it actually  is, and how it is different from regular…",
  "content": "Retargeting: What It Is & How to Use It Paid Search Marketing (PPC) By: Joanna Lord April 5, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Joanna Lord April 5, 2011 Retargeting: What It Is & How to Use It Paid Search Marketing (PPC) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I've wanted to write this post for a couple weeks now, knowing that the topic of retargeting is hot, hot, hot. I noticed that as more marketers hear of retargeting there still seems to be quite a bit of confusion around what it actually is, and how it is different from regular display media buys. This post is meant to help with that confusion and hopefully leave everyone with a solid understanding of retargeting basics as well as some actionable ways you can utilize it. Let's start with some common questions... So what is retargeting? How is this different than regular display ad buys? With retargeting you only target users that have visited your site and already had an experience with your brand. You can choose to target users that went to a specific part of your site, or open it up to your whole site, but either way you are guaranteeing that you only spend ad dollars on people who have previously visited your site. Normal display media buys tend to target users in the first stages of the buying funnel. With those ad buys you are tasked with introducing yourself, establishing trust, branding effectively, etc. all while going after an action. How is it tracked? You place a retargeting pixel on either (a) certain sections of your site or (b) across your entire site. As visitors visit the pages you have the pixel on they are added to what is called an \"audience.\" This audience is cookied and as they visit other sites in the display networks you are running retargeting ads on, they are shown your ads. The size of your audience greatly affects the success of your retargeting campaigns. Even if you aren't ready to start testing retargeting, I highly suggest you start building your audience. The larger this qualified group of past visitors, the better! If a person in your audience converts then a \"burn pixel\" will fire, which takes them out of the audience. You can also choose to add different pixels if you wish to show converting visitors different ads. You can get quite complex regarding the sequence of pixels you cookie these users with. You can also control the sites that show your ads, just like on typical display network buys. You can decide that a site isn't cutting it, and cut them from the list. You have quite a bit of control around who sees your ad and who doesn't. Whether you decide to start out with a smaller audience (maybe you decide to JUST cookie those users that made it a cart page but didn't complete a purchase) or whether you decide to put every possible visitor to your site into the audience, this tracking method is incredibly effective. At SEOmoz we have started passing back a unique conversion ID on our end, as to double and triple check conversions with the agency we are running our retargeting efforts through. This sort of granular tracking can be very powerful, and very robust, as we will explore in greater detail in a bit. Below is an image of the general process: * Please note you don't have to be named Casey for retargeting to be effective How is it measured? Unlike typical display advertising measurement, retargeting actually gives credit to both click-though, and view-through conversions. Often times if you work with an agency they will report both to you, as well as a total, and you will have to decide how you want to navigate the performance formula. Click-through conversions are any conversions that happen as a direct result of someone clicking a retargeting ad they were served. View-through conversions would be like assists. They are conversions that are attributed to another channel (on last click attribution tracking) but these conversions were at one point served a retargeting ad. As you can imagine there is a lot to be learned about your ads and landing pages as these numbers change in ratio throughout your testing. We were very interested to find that our purely branded ads (just Roger and our logo) were incredibly effective for both buckets. This has helped us optimize our display strategy across the board. Wait, so what is remarketing? Google Adwords launched a form of retargeting in their display network about a year ago, and they call it \"remarketing,\" which has caused nothing but confusion for most marketers. So Remarketing is specific to the Google Adwords display network, and Retargeting is the marketing approach behind Remarketing. ** Since Remarketing really is a beast all it's own, I have decided to focus this post on just retargeting. If you want me to write a post on how to set up Remarketing, and how to use it effectively, let me know in the comments below and I'll get on it! So how can you use retargeting? Now that you have the gist of how it works, let's talk about practical applications for this marketing channel. The simplest answer to this would be to say that remarketing gets previous visits back to your site. We all know there are lots of conversions that can happen when you get a previous visit to return. Remarketing can be effective at every step of the funnel. You know what? I hate that we always call it a funnel. So today I'm calling it the buying ice cream cone. Retargeting banners can be effective at each step of the buying ice cream cone (see below). This is just a taste, the ideas are literally limitless. The truth is retargeting is one of the most effective ways to target a user at a given time with a given message. You know how as a marketer we are always trying to gauge where a user is in the buying funnel so we can better understand if our buys are failing, or if our messages are? Well retargeting takes a lot of the guesswork and replaces it with data and quite a bit of control, its a win-win. Is this all too good to be true? Well the short answer is yes. There are quite a few things to keep in mind when testing out retargeting as part of your digital marketing strategy. Here are just a few bigger challenges to keep in mind: #1 Retargeting is a channel all its own It is tempting to apply past display ad truths to your retargeting efforts, but this isn't your best decision Retargeting demands unique banner ads, custom landing pages, and ongoing optimization. So unless you have the time to truly research, learn, build-out, and measure another channel, you might want to hold off on retargeting. Like every other marketing opportunity out there, you can lose money if you don't put the time in. #2 Banners can be more creative, less official Not sure if \"official\" is the right word, but banner ads that are a bit more out there have huge potential on retargeting. These ads can be more personal, quirky or humorous. They need to catch a person's eye and trigger a memory of their last visit. Logos and brand names are still important, but retargeting ads are an opportunity to push your creative messaging. This is a chance to tell a story to a user that will continue to see you and interact with your site. #3 Too much retargeting can work against you Retargeting specialists believe that having a user see 7 to 12 of your ads in the course of a 30-day period is ideal, but seeing the same ad every time, or seeing more than that can have a negative effect. We learned this the hard way at SEOmoz. I was so excited when we first started running tests that I increased my budget to get some serious volume data, and quickly our help team as well as our Twitter stream was bombarded with users complaining that they were being followed by SEOmoz ads. It was clear that many of them wanted to see less of us on their favorite sites. There is a fine balance between targeting users, and bombarding them, so tread lightly. #4 Retargeting is a commitment I already mentioned that it requires a great deal of attention, but retargeting is also most effective after it is up and running for some time. First off, your audience grows larger, which only works to your benefit. Secondly, retargeting specialists agree that three months of seeing about a dozen ad impressions is more effective than just one month. There is a lot of power in staying front of mind. So for those of you all excited about retargeting possibilities, just remember it could take a few months to find your retargeting groove. Those are the biggest challenges we have faced here at SEOmoz. When we first started testing retargeting we were starry eyed with the initial results, and since then we have continued to be impressed by its performance. However, we have also made a whole lot of mistakes along the way. Our latest mistake was actually firing the conversion pixel on the wrong page (resulting in about 8x more conversions being recorded)-- yeah that really happened. So just keep in mind, this channel isn't a \"set it and forget it\" answer to your marketing prayers. Retargeting takeaways I don't want to scare you off. Retargeting can be incredibly effective for advertisers that put the time in to manage and optimize spend effectively. I should mention that last month alone we saw 4X the number of free trial signups from retargeting than we did from a similar stand-alone site sponsorship. We actually ran identical banner ads for those two buys as well. The differences came in having a prequalified audience, and staying in front of our target audience. So take it or leave it, but the marketing team over at SEOmoz is definitely excited to play around with retargeting and see how creative we can get with the sequences of our ad buys and landing pages (I hope to get some follow-up posts with case studies for all of you soon enough). The results make it worth the time, and in my opinion, it's like the Wild West in there right now. You don't have to worry about competition like with many other channels, you control every piece of this channel, and you have unlimited options on how to utilize it. I would love to hear if any of you have been using it, and if so, what are you seeing? As an added bonus, I thought I'd share my PubCon South Presentation on Retargeting & Remarketing. Here you go friends! Unleashing the Power of Retargeting View more presentations from Joanna Lord. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Retargeting: What It Is & How to Use It"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Retargeting: What It Is & How to Use It"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Joanna Lord\n          \n            Joanna Lord\n          \n            Joanna Lord"
}