{
  "url": "https://moz.com/blog/return-of-the-cpm-ad-model",
  "slug": "return-of-the-cpm-ad-model",
  "title": "Return of the CPM Ad Model - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "To many, the CPM (Cost-per-Thousand impressions) model is what kindled over-valued companies in the late '90's and created the dot-com crash. The savior, conversely, was Overture's cost-per-click model that resulted in greater accountability and profitability across the web. So, why would Rand be…",
  "content": "Return of the CPM Ad Model Online Advertising By: Rand Fishkin June 21, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin June 21, 2006 Return of the CPM Ad Model Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. To many, the CPM (Cost-per-Thousand impressions) model is what kindled over-valued companies in the late '90's and created the dot-com crash. The savior, conversely, was Overture's cost-per-click model that resulted in greater accountability and profitability across the web. So, why would Rand be proposing a comeback of the tried-and-failed CPM model? Because it has value and a purpose. CPM is an ad model that relies on brand visibility and brand awareness. It's not the kind of campaign that Joe's Custom Electronics should run, but it is the kind of campaign that Motorola, Dell, HP, Compaq and Apple should run. The problems these big advertisers encounter with TV, radio and print media include overpriced material, un-trackable predictions and fewer and fewer \"influencers\" paying attention. In the traditional media world, ad space is almost universally overpriced due to market ineffeciences. Ad agencies' 15%, ad re-sellers and demand based on pride/image rather than ROI are just a few of the impacting factors. Having media where impressions aren't tracked doesn't help either (How many people skip commercials with Tivo - what about folks who mute them? What about channel surfing during ads?). The Internet CPM model solves many of these. With big media buyers finding bargains online for branding themselves to a tech-savvy, young, wealthy demographic and having real numbers to show for it, is it any wonder that the CPM model is making a comeback? For those who are interested, some great sources for seeing CPM buys in action are at Federated Media and BlogAds. I think a post on the stats they provide is just around the corner... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Return of the CPM Ad Model"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Return of the CPM Ad Model"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}