{
  "url": "https://moz.com/blog/review-of-the-thumb-updown-judicial-system-w-suggestions",
  "slug": "review-of-the-thumb-updown-judicial-system-w-suggestions",
  "title": "Review of the Thumb Up/Down Judicial System w/ Suggestions - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It's pretty easy to thumb someone's comments up or down here at SEOmoz. You just register and away you go. Notice: Reading a post or its comments is NOT a requirement for contributing your opinion via thumb. This is not a situation that is unique to SEOmoz, nor is it something that they can do much…",
  "content": "Review of the Thumb Up/Down Judicial System w/ Suggestions Content Marketing T By: TimStaines March 11, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! T By: TimStaines March 11, 2009 Review of the Thumb Up/Down Judicial System w/ Suggestions Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. It's pretty easy to thumb someone's comments up or down here at SEOmoz. You just register and away you go. Notice: Reading a post or its comments is NOT a requirement for contributing your opinion via thumb. This is not a situation that is unique to SEOmoz, nor is it something that they can do much about. There’s just no way to enforce the “reading before thumbing rule,” at least not now, but don’t be surprised if some offshoot of iris scanning makes this possible in the future. It’s already scalable to the mobile device level. Combine that with a webcam and the technology they used in this study that tracked eye movements and you’ve got the power to verify that someone reads something before they contribute their thumb. Not to mention a built in identity verification tool that would eliminate login screens forever, but I digress. This post is about the thumbing system here at SEOmoz and a suggestion for changing it without the need to acquire additional venture capital funding. I know that this is something that the staff has had exhaustive conversations about, but hopefully one of the following ideas will be something they haven’t pondered and decided against in the course of their implementation of the current system. Attach a user name to all thumb-ups This doesn’t have to be Sphinn style (I couldn't find one with de-sphinns in the first 10 that I checked, but trust me, they exist) where you can see who endorsed the post or comment right there within the post page – I’m sure SEOmoz has already decided against that for whatever reason. Put a list of thumb-ups on the user’s profile page so we can find the people we respect and go back and see what they’ve read and liked recently (maybe a two-month period) Attach a user name to all thumb-downs and require an explanation comment We don’t need an explanation comment on the thumb-up because it’s fairly obvious that the person agrees, and if s/he wants to add more s/he can add a comment like normal We do need an explanation comment on the thumb-down for the following reasons: It will limit thumb-downs: Reducing the work associated with monitoring excessive thumb-downs (I know you like this one, Rebecca) Reducing thumb-downs from people that aren’t currently willing to engage in debate on a topic Removing the anonymity from the one part of SEOmoz that still encourages baseless negativity from unidentified sources (drive-by thumb-downs are lamesauce) It will protect potential victims of anonymous drive-by thumb-downing Thumb-ups are a part of your user profile – great people like and agree with you, no need to defend yourself against that Thumb-downs are on your user profile, most are anonymous and leave the victim with no recourse – in this case, the opportunity for educated discussion should be facilitated instead of the current policy which encourages anonymous drive-by thumb-downs without any burden of proof. It will mandate constructive conversation between users with dissenting views which is an integral part of the value that exists here at SEOmoz. Some of the best comments are those made in opposition to someone else’s statement because they often bring new insight to a conversation. One thing that didn't fit into the outline above is the idea that thumbing up someone's contrary viewpoint might replace the lazy thumb-down on the original viewpoint. What are your thoughts on this system? What did I miss? Please feel free to thumb me up or down, but if it’s a drive-by thumb-downing, be warned: your lamesauce-filled, anonymous negativity contributing days might be numbered! Cheers! P.S. I used “lamesauce” several times in this post because of a conversation @mattcutts & @streko were having. I would really like to know what they are talking about because I didn’t see much at lamesauce.com, .net, or .org . . . maybe it’s #lamesauce? Anyway, let me know if you know. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Review of the Thumb Up/Down Judicial System w/ Suggestions"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Review of the Thumb Up/Down Judicial System w/ Suggestions"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "TimStaines\n          \n            TimStaines"
}