{
  "url": "https://moz.com/blog/rewriting-the-beginners-guide-part-4-continued-keyword-usage",
  "slug": "rewriting-the-beginners-guide-part-4-continued-keyword-usage",
  "title": "Rewriting the Beginner's Guide: Part 4 Continued - Keyword Usage & Targeting - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For the next few weeks, my blog posts will primarily consist of re-authoring and re-building the Beginner's Guide to Search Engine Optimization, section by section. You can read more about this project here.\n\nTitles, URLs, Meta Data and Semantic...",
  "content": "Rewriting the Beginner's Guide: Part 4 Continued - Keyword Usage & Targeting Moz News By: Rand Fishkin December 17, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 17, 2007 Rewriting the Beginner's Guide: Part 4 Continued - Keyword Usage & Targeting Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. For the next few weeks, I'm working on re-authoring and re-building the Beginner's Guide to Search Engine Optimization, section by section. You can read more about this project here. Keyword Usage & Targeting Keywords are fundamental to the search process - they are the building blocks of language and of search. In fact, the entire science of information retrieval (including web-based search engines like Google) is based on keywords. As the engines crawl and index the contents of pages around the web, they keep track of those pages in keyword-based indices. Thus, rather than storing 25 billion web pages all in one database (which would get pretty big), the engines have millions and millions of smaller databases, each centered on a particular keyword term or phrase. This makes it much faster for the engines to retrieve the data they need in a mere fraction of a second. Obviously, if you want your page to have a chance of being listed in the search results for \"dog,\" it's extremely wise to make sure the word \"dog\" is part of the indexable content of your document. Keywords also dominate our search intent and interaction with the engines. For example, a common search query pattern might go something like this: When a search is performed, the engine knows which pages to retrieve based on the words entered into the search box. Other data, such as the order of the words (\"running shoes\" vs. \"shoes running\"), spelling, punctuation, and capitalization of those terms provide additional information that the engines can use to help retrieve the right pages and rank them. For obvious reasons, search engines measure the ways keywords are used on pages to help determine the \"relevance\" of a particular document to a query. One of the best ways to \"optimize\" a page's rankings is, therefore, to ensure that keywords are prominently used in titles, text, and meta data. The Myth of Keyword Density Whenever the topic of keyword usage and search engines come together, a natural tendency to use the phrase \"keyword density\" seems to arise. This is tragic. Keyword density is, without question, NOT a part of modern web search engine ranking algorithms for the simple reason that it provides far worse results than many other, more advanced methods of keyword analysis. Rather than cover this logical fallacy in depth in this guide, I'll simply reference Dr. Edel Garcia's seminal work on the topic - The Keyword Density of Non-Sense. The notion of keyword density values predates all commercial search engines and the Internet and can hardly be considered an IR concept. What is worse, KD plays no role on how commercial search engines process text, index documents, or assign weights to terms. Why then do many optimizers still believe in KD values? The answer is simple: misinformation. If two documents, D1 and D2, consist of 1000 terms (l = 1000) and repeat a term 20 times (tf = 20), then a keyword density analyzer will tell you that for both documents KD = 20/1000 = 0.020 (or 2%) for that term. Identical values are obtained when tf = 10 and l = 500. Evidently, a keyword density analyzer does not establish which document is more relevant. A density analysis or KD ratio tells us nothing about: the relative distance between keywords in documents (proximity) where in a document the terms occur (distribution) the co-citation frequency between terms (co-occurrence) the main theme, topic, and sub-topics (on-topic issues) of the documents Thus, KD is divorced from content quality, semantics, and relevancy. Dr. Garcia's background in information retrieval and his mathematical proofs should debunk any notion that keyword density can be used to help \"optimize\" a page for better rankings. However, this same document illustrates the unfortunate truth about keyword optimization - without access to a global index of web pages (to calculate term weight) and a representative corpus of the Internet's collected documents (to help build a semantic library), we have little chance to create formulas that would be helpful for true optimization. However, keyword usage and targeting are only a small part of the search engines' ranking algorithms (as we've discussed in Section I: Retrieval & Rankings), and we can still leverage some effective \"best practices\" for keyword usage to help make pages that are very close to \"optimized.\" Here at SEOmoz, we engage in a lot of testing and get to see a huge number of search results and shifts based on keyword usage tactics. When we work with our clients, this is the process we recommend: Use the keyword in the title tag at least once, and possibly twice (or as a variation) if it makes sense and sounds good (this is subjective, but necessary). Try to keep the keyword as close to the beginning of the title tag as possible. More detail on title tags follows later in this section. Once in the H1 header tag of the page. At least 3X in the body copy on the page (sometimes a few more times if there's a lot of text content). You may find additional value in adding the keyword more than 3X, but in our experience, adding more instances of a term or phrase tends to have little to no impact on rankings. At least once in bold. You can use either the <strong> or <b> tag, as search engines consider them equivalent (note: at this time we've only actually tested Google for the <b> vs. <strong> equivalency). At least once in the alt attribute of an image on the page. This not only helps with web search, but also image search, which can sometimes bring valuable traffic. Once in the URL. Additional rules for URLs and keywords are discussed later on in this section. At least once (sometimes 2X when it makes sense) in the meta description tag. Note that the meta description tag does NOT get used by the engines for rankings, but rather helps to attract clicks by searchers from the results page (as it is the \"snippet\" of text used by the search engines). Generally not in link anchor text on the page itself that points to other pages on your site or different domains (this is a bit complex - see this blog post for details). An optimal page for the phrase \"running shoes\" would thus look something like: Keyword usage is NOT an exact science, and it is certainly valuable to engage in testing, tweaking, and experimentation on your own sites and pages. Just keep in mind that user experience should never be sacrificed for the sake of optimization - search engines want the same things as humans, and generally speaking, if your page can earn one or two extra links by providing great content, this will far outweigh any benefit from stuffing an extra keyword repetition. SEOmoz's Term Targeting tool is designed to help accomplish precisely this feat and provides a grade to indicate how well (or poorly) a particular page is following the above suggestions. As you perform keyword targeting, remember that search engines have advanced semantic analysis abilities - this means that they can not only detect whether your page has the right keywords on it, but whether that page is actually targeting the proper subject(s). Thus, embedding keywords as we've described above with perfect precision on a page that's actually about laser hair removal is going to be immediately apparent to the search engines. Instead of merely inserting keywords on a page and expecting rankings, make sure that the document itself contains high quality content describing or on the topic of your keyword of choice. In the next installment, I'll finish up the basics of search-engine friendly design and cover: Titles, URLs, Meta Data, and Semantic Markup Information Architecture Canonicalization and Duplicate Versions of Content Redirection, Hosting, & Server Issues Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Rewriting the Beginner's Guide: Part 4 Continued - Keyword Usage & Targeting"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Rewriting the Beginner's Guide: Part 4 Continued - Keyword Usage & Targeting"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}