{
  "url": "https://moz.com/blog/risk-averse-link-building",
  "slug": "risk-averse-link-building",
  "title": "Risk-Averse Link Building - Best of Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Agencies and consultants who are asked to build links for their clients need to have a sense for what works and what's risky. In this classic episode of Whiteboard Friday, Russ Jones charts a path forward.",
  "content": "Risk-Averse Link Building - Best of Whiteboard Friday Link Building | Whiteboard Friday By: Russ Jones May 15, 2020 Table of Contents Copied! By: Russ Jones May 15, 2020 Risk-Averse Link Building - Best of Whiteboard Friday Link Building | Whiteboard Friday Building links is an incredibly common request of agencies and consultants, and some ways to go about it are far more advisable than others. Whether you're likely to be asked for this work or you're looking to hire someone for it, it's a good idea to have a few rules of thumb. In this classic Whiteboard Friday chock full of evergreen advice, Russ Jones breaks things down. Click on the whiteboard image above to open a high-resolution version in a new tab! Video Transcription Hey, folks, welcome to another great Whiteboard Friday. I am Russ Jones, Principal Search Scientist here at Moz. I get to do a lot of great research, but I'll tell you, my first love in SEO is link building. The 10 years I spent before joining Moz, I worked at an agency and we did a lot of it, and I'll tell you, there's nothing more exciting than getting that great link.Now, today I'm going to focus a little bit more on the agency and consultant side. But one takeaway before we get started, for anybody out there who's using agencies or who's looking to use a consultant for link building, is kind of flip this whole presentation on its head. When I'm giving advice to agencies, you should use that as rules of thumb for judging whether or not you want to use an agency in the future. So let me jump right in and we'll get going.What I'm going to talk about today is risk-averse link building. So the vast majority of agencies out there really want to provide good links for their customers, but they just don't know how. Let's admit it. The majority of SEO agencies and consultants don't do their own link building, or if they do, it's either guest posting or maybe known placements in popular magazines or online websites where you can get links. There's like a list that will go around of how much it costs to get an article on, well, Forbes doesn't even count anymore because they've no-followed their links, but that's about it. It's nothing special.So today I want to talk through how you can actually build really good links for your customers and what really the framework is that you need to be looking into to make sure you're risk averse so that your customers can come out of this picture with a stronger link profile and without actually adopting much risk. 1. Never build a link you can't remove! So we're going to touch on a couple of maxims or truisms. The first one is never build a link you can't remove. I didn't come upon this one until after Penguin, but it just occurred to me it is such a nightmare to get rid of links. Even with disavow, often it feels better that you can just get the link pulled from the web. Now, with negative SEO as being potentially an issue, admittedly Google is trying to devalue links as opposed to penalize, but still the rule holds strong. Never build a link that you can't remove. But how do you do that? I mean you don't have necessarily control over it. Well, first off, there's a difference between earnings links and building links. So if you get a link out there that you didn't do anything for, you just got it because you wrote great content, don't worry about it. But if you're actually going to actively link build, you need to follow this rule, and there are actually some interesting ways that we can go about it. Canonical \"burn\" pages The first one is the methodology that I call canonical burn pages. I'm sure that sounds a little dark. But it actually is essentially just an insurance policy on your links. The idea is don't put all of your content value and link value into the same bucket. It works like this. Let's say this article or this Whiteboard Friday goes up at the URL risk-averse-links and Moz decided to do some outreach-based link building. Well, then I might make another version, risk-averse-linkbuilding, and then in my out linking actually request that people link to that version of the page. That page will be identical, and it will have a canonical tag so that all of the link value should pass back to the original. Now, I'm not asking you to build a thousand doorway pages or anything of that sort, but here's the reason for the separation. Let's say you reach out to one of these webmasters and they're like, \"This is great,\" and they throw it up on a blog post, and what they don't tell you is, \"Oh yeah, I've got 100 other blogs in my link farm, and I'm just going to syndicate this out.\" Now you've got a ton of link spam pointing to the page. Well, you don't want that pointing to your site. The chances this guy is going to go remove his link from those hundreds if not thousands of pages are very low. Well, the worst case scenario here is that you've lost this page, the link page, and you drop it and you create a new one of these burn pages and keep going.Or what if the opposite happens? When you actually start ranking because of this great content that you've produced and you've done great link building and somebody gets upset and decides to spam the page that's ranking with a ton of links, we saw this all the time in the legal sector, which was shocking to me. You would think you would never spam a lawyer, but apparently lawyers aren't afraid of another lawyer.But regardless, what we could do in those situations is simply get rid of the original page and leave the canonical page that has all the links. So what you've done is sort of divided your eggs into different baskets without actually losing the ranking potential. So we call these canonical burn pages. If you have questions about this, I can talk more about it in the comments. Know thy link provider The other thing that's just stupidly obvious is you should know thy link provider. If you are getting your links from a website that says pay $50 for so and so package and you'll get x-links from these sources on Tier 2, you're never going to be able to remove those links once you get them unless you're using something like a canonical burn page. But in those cases where you're trying to get good links, actually build a relationship where the person understands that you might need to remove this link in the future. It's going to mean you lose some links, but in the long run, it's going to protect you and your customers. That's where the selling point becomes really strong. Imagine you're on a client call, sales call and someone comes to you and they say they want link building. They've been burned before. They know what it's like to get a penalty. They know what it's like to have somebody tell them, \"I just don't know how to do it.\"Well, what if you can tell them, hey, we can link build for you and we are so confident in the quality of our offering that we can promise you, guarantee that we can remove the links we build for you within 7 days, 14 days, whatever number it ends up taking your team to actually do? That kind of insurance policy that you just put on top of your product is priceless to a customer who's worried about the potential harm that links might bring. 2. You can't trade anything for a link (except user value)! Now this leads me to number two. This is the simplest way to describe following Google's guidelines, which is you can't trade anything for a link except user value. Now, I'm going to admit something here. A lot of folks who are watching this who know me know this, but my old company years and years and years ago did a lot of link buying. At the time, I justified it because I frankly thought that was the only way to do it. We had a fantastic link builder who worked for us, and he wanted to move up in the company. We just didn't have the space for him. We said to him, \"Look, it's probably better for you to just go on your own.\" Within a year of leaving, he had made over a million dollars selling a site that he ranked only using white hat link building tactics because he was a master of outreach. From that day on, just everything changed. You don't have to cheat to get good links. It's just true. You have to work, but you don't have to cheat. So just do it already. There are tons of ways to justify outreach to a website to say it's worth getting a link. So, for example, you could Build some tools and reach out to websites that might want to link to those tools. You can offer data or images. Accessibility. Find great content out there that's inaccessible or isn't useful for individuals who might need screen readers. Just recreate the content and follow the guidelines for accessibility and reach out to everybody who links to that site. Now you've got a reason to say, \"Look, it's a great web page, but unfortunately a certain percentage of the population can't use it. Why don't you offer, as well as the existing link, one to your accessible version?\" Broken link replacement. Skyscraper content, which is where you just create fantastic content. Brian Dean over at Backlinko has a fantastic guide to that. There are just so many ways to get good links. Let me put it just a different way. You should be embarrassed if you cannot create content that is worth outreach. In fact, that word \"embarrassment,\" if you are embarrassed to email someone about your content, then it means you haven't created good enough content. As an SEO, that's your responsibility. So just sit down and spend some more time thinking about this. You can do it. I've seen it happen thousands of times, and you can end up building much better links than you ever would otherwise. 3. Tool up! The last thing I would say is tool up. Look, better metrics and better workflows come from tools. There are lots of different ways to do this. First off, you need a good backlink tool. Our new Link Explorer is 29 trillion links strong and it's fantastic. There's also Fresh Web Explorer for doing mentions. So you can find websites that talk about you but don't link. You're also going to want some tools that might do more specific link prospecting, like LinkProspector.com or Ontolo or BrokenLinkBuilding.com, and then some outreach tools like Pitchbox and BuzzStream. But once you figure out those stacks, your link building stack, you're going to be able to produce links reliably for customers. I'm going to tell you, there is nothing that will improve your street cred and your brand reputation than link building. Link building is street cred in our industry. There is nothing more powerful than saying, \"Yeah, we built a couple thousand links last year for our customers,\" and you don't have to say, \"Oh, we bought,\" or, \"We outsourced.\" It's just, \"We just do link building, and we're good at it.\" So I guess my takeaway from all of this is that it's really not as terrible as you think it is. At the end of the day, if you can master this process of link building, your agency will be going from a dime a dozen, where there are 100 in an averaged-sized city in the United States, to being a leading provider in the country just by simply mastering link building. If you follow the first two rules and properly tool up, you're well on your way. So I hope to talk more to you in the comments below. If you have any questions, I can refer you to some other guides out there, including some former Whiteboard Fridays that will give you some great link building tips. Hope to talk to you soon. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Risk-Averse Link Building - Best of Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Risk-Averse Link Building - Best of Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "1. Never build a link you can't remove!"
    },
    {
      "level": "H3",
      "text": "Canonical \"burn\" pages"
    },
    {
      "level": "H3",
      "text": "Know thy link provider"
    },
    {
      "level": "H2",
      "text": "2. You can't trade anything for a link (except user value)!"
    },
    {
      "level": "H2",
      "text": "3. Tool up!"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Russ Jones\n          \n            Russ Jones\n          \n            Russ Jones"
}