{
  "url": "https://moz.com/blog/risks-of-sitewide-links",
  "slug": "risks-of-sitewide-links",
  "title": "Risks of Sitewide Links - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The measurable risk of any particular SEO tactic is very hard to measure. After all, experimentation with successful sites in the SERPs is not only dangerous, but also expensive and time-consuming, while avoiding risks by using precautionary measures is virtually costless.Si...",
  "content": "Risks of Sitewide Links Blogging By: Rand Fishkin March 31, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 31, 2005 Risks of Sitewide Links Blogging The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The measurable risk of any particular SEO tactic is very hard to measure. After all, experimentation with successful sites in the SERPs is not only dangerous, but also expensive and time-consuming, while avoiding risks by using precautionary measures is virtually costless.Sitewide links are part of an ongoing discussion at SEW, while link building systems like DigitalPoint's Co-Op tool are also under scrutiny. If the search engines do decide to penalize these methodologies or if they already do when they are detected, is it worthwhile to attempt them, or is caution the better part of valor, and online success?I personally don't try any known risky tactics (other than the occassional large scale link purchase). My view is generally that such tactics are not immoral or improper, but simply dangerous and therefore, should be avoided unless there is a good reason to risk your ranking success. I also am of the opinion that it is much easier to sleep at night, knowing you've earned your ranking position success, than to worry that your tactics could, at any moment, cost you your business... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Risks of Sitewide Links"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Risks of Sitewide Links"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}