{
  "url": "https://moz.com/blog/roi-of-digital-accessibility",
  "slug": "roi-of-digital-accessibility",
  "title": "The ROI of Digital Accessibility - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The perception of digital accessibility having a high cost is one of the reasons that just 3% of the internet is accessible to people with disabilities, despite the 1.3 billion people globally who live with a disability. In this post, Alisa discusses three benefits of digital accessibility, and…",
  "content": "The ROI of Digital Accessibility Marketing Industry By: Alisa Smith March 22, 2023 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Alisa Smith March 22, 2023 The ROI of Digital Accessibility Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In a recent AudioEye survey of 500 business leaders and web professionals, 70% said that “cost” was their main concern when it came to digital accessibility. Many of the respondents also thought they would have to rebuild their website from the ground up in order to deliver an accessible browsing experience. This perception of digital accessibility as a cost center without an easy remedy is one of the reasons that just 3% of the internet is accessible to people with disabilities, despite the 1.3 billion people globally who live with a disability. In this post, I discuss three benefits of digital accessibility — and hopefully, make a case for why inclusion isn’t just the right thing to do, but a huge business opportunity. Three reasons to prioritize digital accessibility Many business leaders are aware of the risk of non-compliance with the Americans with Disabilities Act (ADA) and other accessibility legislation. Over the last few years, there has been a record number of digital accessibility lawsuits. More companies are receiving demand letters or being taken to court over alleged violations under the ADA. And when that happens, other business leaders pay attention. What business leaders don’t always consider is the opportunity that digital accessibility represents, whether it’s reaching more potential customers, building a more inclusive organization, or improving the browsing experience for all users — not to mention search engines and voice assistants. 1. Digital accessibility is not an edge case One of the biggest misconceptions about digital accessibility is that it’s some sort of edge case. In fact, people with disabilities are the largest minority in the United States. In the United States, one in four adults lives with some type of disability. That number goes even higher when you include temporary disabilities, like broken limbs or short-term impairments following surgery or medical treatments. According to the Global Economics of Disability 2020 report, people with disabilities control $1.9 trillion in disposable income, globally. That number reaches over $10 trillion when their friends and family are included. By designing for accessibility, you can make your website and digital experiences work better for everyone. 2. Accessible design is good for everyone At its core, digital accessibility is all about eliminating barriers that can prevent people from browsing your website. By following the best practices of accessible design, you can help ensure that everyone can interact with your digital content — regardless of age, disability, or any other factor. For example, the World Wide Web Consortium’s (W3C) Supplemental Guidance to WCAG 2 includes best practices for clear and understandable content, such as: Avoiding double negatives, such as “Time is not unlimited.”Using short sentences with one point per sentence.Putting the key takeaway or objective at the start of a paragraph.When possible, using bulleted or numbered lists. The goal of these recommendations is to remove confusion for people with dyslexia and other learning disabilities. But it could just as easily be a general writing best practice. Every user can benefit from simple, direct language that removes friction and gives them a clear next step. It’s the foundation of any conversion-optimized website — and it just happens to overlap with the best practices of accessible design. 3. Digital accessibility supports discoverability There’s also a clear overlap between accessibility and discoverability. For example, sites with clear, descriptive headings — the same kinds of headings that make navigation and comprehension easier for people with disabilities — are also easier for search engines like Google to crawl. Because of this, there’s strong evidence that Google rewards accessibility when ranking websites. In fact, its Webmaster Guidelines — which outline the best practices that help Google to find, index, and rank your site — read like accessibility guidelines — and often correlate directly with WCAG. Accessible websites are also beneficial to users who access websites with voice search. According to the Google Mobile Voice Study, 41% of US adults and 55% of teens use voice search daily. Businesses with websites that are optimized for voice search, have a better chance of being discovered and used by potential customers. Making the business case for digital accessibility The first goal of any digital accessibility initiative should be to deliver an inclusive experience to everyone who visits your website. Not only is it the right thing to do, but it can help you reach a market that’s traditionally been underserved. However, it’s important to note the other benefit of building an accessible website: greater conformance with accessibility standards like the Web Content Accessibility Guidelines (WCAG), which are used to assess a site’s compliance with the ADA. Based on recent guidance from the Department of Justice, it’s clear that businesses of all sizes are expected to meet accessibility standards like WCAG in order to comply with the ADA. When you calculate the ROI of digital accessibility, you should factor in that the cost of defending a digital accessibility lawsuit — or even settling a demand letter — can often surpass the cost of making your website accessible. By taking a more proactive approach to digital accessibility, you can comply with the law while also turning a requirement into an opportunity to grow your business and deliver an inclusive experience to every customer. As you invest in digital accessibility, it’s worth measuring your progress over time. To get started, you can use a free accessibility checker to assess your website’s accessibility — and then see how it improves as you implement accessibility best practices. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The ROI of Digital Accessibility"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The ROI of Digital Accessibility"
    },
    {
      "level": "H2",
      "text": "Three reasons to prioritize digital accessibility"
    },
    {
      "level": "H3",
      "text": "1. Digital accessibility is not an edge case"
    },
    {
      "level": "H3",
      "text": "2. Accessible design is good for everyone"
    },
    {
      "level": "H3",
      "text": "3. Digital accessibility supports discoverability"
    },
    {
      "level": "H2",
      "text": "Making the business case for digital accessibility"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    }
  ],
  "author": "Alisa Smith\n          \n            Alisa Smith\n          \n            Alisa Smith"
}