{
  "url": "https://moz.com/blog/roi-local-seo",
  "slug": "roi-local-seo",
  "title": "How to Show ROI from Local SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Showing the value of your SEO efforts to non-marketers can be difficult, and can even lose you customers if not done right. Google Top Contributor Joy Hawkins shares 5 of her own best tips for proving ROI in the language of SMBs.",
  "content": "5 Tips to Help Show ROI from Local SEO Local SEO By: Joy Hawkins August 15, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Joy Hawkins August 15, 2017 5 Tips to Help Show ROI from Local SEO Local SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Earlier this year, when I was first writing my advanced local SEO training, I reached out to some users who work for local SEO agencies and asked them what they'd like more training on. The biggest topic I got as a result was related to tracking and reporting value to small business owners. My clients will often forward me reports from their prior SEO company, expressing that they have no idea what they were getting for their money. Some of the most common complaints I see with these reports are: Too much use of marketing lingo (\"Bounce Rate,\" \"CTR,\" etc.) Way too much data No representation of what impact the work done had on the business itself (did it get them more customers?) If a small business owner is giving you hundreds or thousands of dollars every month, how do you prove to them they're getting value from it? There's a lot to dig into with this topic — I included a full six pages on it in my training. Today I wanted to share some of the most successful tips that I use with my own clients. 1. Stop sending automated Google Analytics reports If the goal is to show the customer what they're getting from their investment, you probably won't achieve it by simply sending them an Analytics report each month. Google Analytics is a powerful tool, but it only looks awesome to you because you're a marketer. Over the past year, I've looked at many monthly reports that made my head spin — it's just too much data. The average SMB isn't going to be able to look at those reports and figure out how their bounce rate decreasing somehow means you’re doing a great job at SEO. 2. Make conversions the focus of your reportWhat does the business owner care about? Hint: it’s not how you increased the ranking for one of their 50 tracked keywords this month. No, what they care about is how much additional business you drove to their business. This should be the focus of the report you send them. 3. Use dynamic number insertion to track callsIf you’re not already doing this, you're really killing your ability to show value. I don’t have a single SEO or SEM client that isn’t using call tracking. I use Call Tracking Metrics, but CallRail is another one that works well, too. This allows you to see the sources of incoming calls. Unlike slapping a call tracking number on your website, dynamic number insertion won’t mess up NAP consistency. The bonus here is that you can set up these calls as goals in Google Analytics. Using the Landing Page report, you can see which pages on the site were responsible for getting that call. Instead of saying, \"Hey customer, a few months ago I created this awesome page of content for you,\" you can say \"Hey customer, a few months ago, I added this page to your site and as a result, it’s got you 5 more calls.\" 4. Estimate revenue I remember sitting in a session a couple years ago when Dev Basu from Powered by Search told me about this tactic. I had a lightbulb moment, wondering why the heck I didn’t think to do this before. The concept is simple: Ask the client what the average lifetime value of their customer is. Next, ask them what their average closing ratio is on Internet leads. Take those numbers and, based on the number of conversions, you can calculate their estimated revenue. Formula: Lifetime Value of a Customer x Closing Ratio (%) x Number of Conversions = Estimated Revenue Bonus tip: Take this a step further and show them that for every dollar they pay you, you make them $X. Obviously, if the lifetime value of the customer is high, these numbers look a lot better. For example, an attorney could look like this:Whereas an insurance agent would look like this: 5. Show before/after screenshots, not a ranking tracker. I seriously love ranking trackers. I spend a ton of time every week looking at reports in Bright Local for my clients. However, I really believe ranking trackers are best used for marketers, not business owners. How many times have you had a client call you freaking out because they noticed a drop in ranking for one keyword? I chose to help stop this trend by not including ranking reports in my monthly reporting and have never regretted that decision. Instead, if I want to highlight a significant ranking increase that happened as a result of SEO, I can do that by showing the business owner a visual — something they will actually understand. This is where I use Bright Local's screenshots; I can see historically how a SERP used to look versus how it looks now. At the end of the day, to show ROI you need to think like a business owner, not a marketer. If your goals match the goals of the business owner (which is usually to increase calls), make sure that's what you’re conveying in your monthly reporting. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "5 Tips to Help Show ROI from Local SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "5 Tips to Help Show ROI from Local SEO"
    },
    {
      "level": "H2",
      "text": "1. Stop sending automated Google Analytics reports"
    },
    {
      "level": "H2",
      "text": "2. Make conversions the focus of your report"
    },
    {
      "level": "H2",
      "text": "3. Use dynamic number insertion to track calls"
    },
    {
      "level": "H2",
      "text": "4. Estimate revenue"
    },
    {
      "level": "H2",
      "text": "5. Show before/after screenshots, not a ranking tracker."
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Joy Hawkins\n          \n            Joy Hawkins\n          \n            Joy Hawkins"
}