{
  "url": "https://moz.com/blog/roles-responsibilites-of-a-web-marketing-team-whiteboard-friday",
  "slug": "roles-responsibilites-of-a-web-marketing-team-whiteboard-friday",
  "title": "Roles & Responsibilities of a Web Marketing Team - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This week we talk about how the different roles and responsibilities of a web marketing team. What does it take to have a successful marketing team that will take your brand to the next level? What metrics should your team measure? Your marketing team will go through a few different stages while…",
  "content": "Roles & Responsibilities of a Web Marketing Team Whiteboard Friday By: Rand Fishkin February 16, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 16, 2012 Roles & Responsibilities of a Web Marketing Team Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This week we talk about the different roles and responsibilities of a web marketing team. What does it take to have a successful marketing team that will take your brand to the next level? What metrics should your team measure? Your marketing team will go through a few different stages while your company grows and this video walks you through those steps. Some notes about this video, we shot this a few weeks ago and as with the other video we experienced some quality issues. Please bear with us while we work out the kinks of our new equipment. I also mention that we are looking for another web dev for our marketing team, but I am happy to mention that our new web dev Devin started on Monday! Don't worry we are looking to fill other positions which can be found here. Video Transcription Howdy SEOmoz fans. Welcome to another edition of Whiteboard Friday. This week we're talking about some of the roles and responsibilities of a web marketing team and really how to design a successful web marketing team that can accomplish all of the goals that you've got on the Web. The place that I like to start is with the metrics you care about. The metrics almost always start with customers or with revenue. Customers or revenue. From customers and revenue you can get down to the metrics that matter, the sources from which those people come externally on your site, the internal sources, the funnel, the marketing funnel itself, how far people make it down the funnel, if you're attracting customers, or the quality of those visitors that you're getting, if we're talking about a site that's driven by ad revenue. The key metrics usually come from places like visits, visit quality, conversions, brand awareness, competitive intelligence, and the quality of customers being acquired. Those are very, very high level, but they typically filter down into deeper ones. When you look at visits, you might be looking at visit sources. You might be looking at the time that people are spending on the site and the number of pages browsed. You might be looking, when you're looking at conversions, at the quality of those conversions, how many of those people come back, what the customer lifetime value is, what the word-of-mouth spread is, you know, for every one customer, how many new customers do we acquire based on some viral co- efficient, etc., etc. You'll know these for your business, and you'll dig down into them. These metrics map over to the right sort of team format. The teams that I like to build really come in stages. Those stages are natural evolutions and progressions. If you're extremely early stage, what I really like . . . by super early stage, what I mean is maybe there are three of you, four of you, five of you, up to maybe ten people in a business that's trying to do considerable marketing on the Web. I like having someone with a title at the very junior level. The most junior level I would have is a web marketing manager or a director of marketing or VP of marketing. It's certainly fine to have someone very senior so long as they're willing to get their hands dirty. They're responsible for all of this. They're responsible for where do customers and revenue come from, what are the sources from which we can generate those. I'm going to personally build a funnel, personally build out how we execute on all the sources, focus on the right ones, figure out what the channels are that work, etc. In a mid-stage I like to extrapolate a little more. Have that VP of marketing who's responsible for the key metrics and for setting the goals and responsibilities and then start to break things out into two worlds. One is the inbound, organic world. This can also be organic or non-paid or free marketing or earned media, whatever you like to call this. Those inbound marketers worry about things like SEO, social, content marketing, blogging, videos, etc., all the things that you do on the Web that earn your customers, that earn visits, rather than buying them or interrupting them. The other side is performance marketers. These are people who do things like paid acquisition, conversion rate optimization. I like having the person who's responsible for paid acquisition also run the CRO and the marketing funnel. The reason why is because these visitors usually are extremely high ROI and cost less. Hopefully, 60 to 80 percent of your traffic is coming through here. This is where you're going to get a ton of your direct conversions. These people will be paying some cost to acquire those visitors. So owning the funnel makes a lot of sense for them. That way they can say, \"Okay, customer lifetime value is $500. We will pay up to $150 to acquire a customer through these five channels. We'll pay up to $250 to acquire a customer through these channels because we know it's worth more. We're going to keep optimizing the funnel and improving the conversion rate.\" Then, naturally, the stuff from organic will flow into those paid channels and into that same funnel. The ROI is usually higher, but the directness and ability to increase that takes longer. It takes more effort and more time, more energy expended. You'll have more things where you throw stuff against the wall to see if it sticks versus paid where, hopefully, you learn that very, very quickly. We bid on this keyword, it didn't work. We put an ad on this site, it didn't work. Fine, we take those down. In terms of who you should assign to these teams, I would say start with one person responsible for each. This person up here, maybe they move into that VP marketing role. If they don't, maybe they move into one of these roles because they're particularly good at performance or at inbound. Then, the VP of marketing comes in and you hire someone more senior to take over those roles. Then you could get specialized inside those. If you see that SEO is an amazing channel for us and we have a ton of content and ton of material that needs SEO'ing, we need to bring in a full-time technical and content SEO to worry about those types of things. Outreach is huge for us. We need a full-time link builder. Social is huge for us. We need a full-time community and social manager. Great, those are fine things, and that leads you naturally into the next stage, the later stage or more mature stage where you usually have . . . I actually like to have at this point something like a CMO, someone who's a chief officer and has a higher purview of roles, of responsibility around that. This also means that people who have progressed in the organization from inbound or from performance channels can move into those VP roles: VP of inbound, VP of performance. Then you can have people under them who are very specialized in each of the requirements of that role. So it could be we have someone who just does PR. We have someone who just does technical SEO. I cannot recommend this enough, have web developers or software engineers who work on each of these teams because it means that someone who's working on performance marketing doesn't need to wait for engineering to get projects done. They have someone who works on the team full-time. This is absolutely amazing here at SEOmoz. We have Casey Henry who works as a full-time web developer, and we're hiring another developer - if you know any great people, please send them our way - to actually work on our marketing team and worry about the www site and the marketing funnel and all the stuff that exists around the inbound and performance side. Obviously, with time, I'd like to see that become two or three or four people. These people's roles really depend on the channels that are working for you and the channels into which you want to invest. You might have a full-time person who just does video content. You might have a full-time person who just does blogging and they do very little else. That could be a content marketer. You might have multiple people who are managing your community because you have so many people following you and interacting with you on Twitter, Facebook, Google+, LinkedIn, through your own social sources on your site if you have a social platform, a high level of community contributions, user generated content, those types of things. This segmentation and role specialization is excellent too because people can move up and have opportunities as one of these channels takes off and becomes amazing. An even later stage might be that we've got SEO as an entire department and it has its own director. Underneath the director are people who are responsible for specific parts. This person is responsible for UGC SEO. This person is responsible for video. This person is responsible for technical SEO. All those kinds of roles can get even more specialized, and you can move into a bigger division. The nice thing about how this whole platform works is that it can organically grow. It can build off itself, and you develop strengths in all the areas without ignoring any channels. Early on in your stages, these people and then these people are going to be experimenting with all types of different channels. As you get here, you have specialists who can perform in those channels, leaving the CMO, the VP, the director free to explore new channels and find places where they might want additional specialists. For an in-house team, this is how I personally like to do it. I am, of course, looking forward to your comments, seeing how you guys do this, seeing where I might be right or wrong here And I hope you will join us again next week for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Roles & Responsibilities of a Web Marketing Team"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Roles & Responsibilities of a Web Marketing Team"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}