{
  "url": "https://moz.com/blog/role-of-directories-in-link-building",
  "slug": "role-of-directories-in-link-building",
  "title": "Role of Directories in Link Building - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Directories can provide a rapid way to get new links to a site.  Opinions on how to approach this range from submitting to every directory in site, to being highly selective.  This post will discuss what's happening under the covers to provide some perspective on how you might choose to approach…",
  "content": "Role of Directories in Link Building Link Building By: Eric Enge March 4, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Eric Enge March 4, 2008 Role of Directories in Link Building Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Directories can provide a rapid way to get new links to a site. Opinions on how to approach this range from submitting to every directory in site, to being highly selective. This post will discuss what's happening under the covers to provide some perspective on how you might choose to approach it. The Basics - Yahoo The key things that search engines look for in determining whether a directory will pass link juice are pretty basic. They are: A submission policy that states that you are paying for an editor to review your listing, not to get a listing. The key subtlety here is that they can review your proposed listing and decide that they don't like it, and then keep your money without listing you. The importance of this is that it means that there is real editorial judgment implied by the policy. Evidence that the policy is enforced. Ultimately, \"Anything for a buck\" directories do not enforce editorial judgment, and therefore the listings do not convey value to the search engines. To take a closer look at this, let's examine some of the key statements from Yahoo's directory submission terms: For web sites that do not feature adult content or services, the Yahoo! Directory Submit service costs US$299 (nonrefundable) for each Directory listing that is submitted. I understand that there is no guarantee my site will be added to the Yahoo! Directory. I understand that Yahoo! reserves the right to edit my suggestion and category placement; movement or removal of my site will be done at Yahoo!'s sole discretion. The key thing to understand here is that you pay your money, and you have no guarantee of getting a listing at all, and your listing can be changed at will by Yahoo's editors. You can pay your $299 and receive essentially nothing in return for it. From a legal perspective, what you pay for is the review by Yahoo's editors. Now here is the key point that you won't find in print on Yahoo's page. Google trusts Yahoo's editors, and Google believes that Yahoo does in fact attempt to turn away all the poor quality sites that get submitted to it. Of course, mistakes do happen. Sometimes relatively poor quality sites do get in when they should not. That's a shame when that does happen, but in general, the editorial policies are real and enforced. Other Directories Do search engines respect other directories? Yes, they do. Here is a small sampling of some that we believe do pass link juice, courtesy of The Professional's Guide to Link Building on SEOmoz (within the PRO Content section): DMOZ Starting Point Business.com ExactSeek Best of The Web Librarians' Internet Index The guide shows a much longer list of directories that SEOmoz believes have value. Note that the search engines do try to use an innocent until proven guilty approach. Directory sites will most likely pass PageRank, regardless of their editorial policy until someone reports them, or a human review is initiated on the directory for some other reason. Steps for Analyzing Directory Value for Yourself Now you have a directory that you are interested in contacting. What do you do? You should attempt to make a determination whether or not the directory is truly serious about the quality of their listings. Directories that currently pass link juice may not later on, so you want to be careful about investing in those. Of course, if you are able to get the sense that a directory currently passes link juice, but is a poor quality directory, the only real downside to buying into it now is that eventually that link will not pass value any more. But, let's press on with trying to find the higher value directories. You need to look for clues that they will stand the test of time. Here are some things that you can look for: Was it funded by a serious VC firm, or a major company in a given vertical space? If so, they are more likely to care about the quality of what they are building. Has it already been around for a long time? If so, it is more likely to be around for a while yet. How are the commercializing their business? Assuming they are selling editorial reviews, is AdSense plastered all over the place too? If it is, they are most likely not a serious player. Are there lots of unrelated links on pages that look like purchased text links? If so, it's a sure clue that someone will turn them in eventually. Related to the prior two points, anything that makes the site look spammy is a clue that they are not a serious player. Does their backlink profile includes lots of purchased links? If they publish other content on the categories they cover, is it pretty cheesy or truly authoritative? Do most of the categories they offer appear to have a significant number of listings in them? And, of course, do they have a clear published editorial policy that makes it clear that you are paying for a review? Examples of Good Directories Of course, I should emphasize that based on our examination, these directories appear to be of good quality and likely to last over the long haul, but there is no guarantee. Example 1: Itrain Online. This has a PR 6 home page, and its topic is computer and Internet training resources for development and social change. Here are some key thing we like about this directory: The site has a strong editorial policy. There is no fee, so money does not bias the acceptance of listings. Advertising on the site is minimal, and the advertising is clearly labeled. Even though the depth of listings is not always that deep, the overall design and structure of the directory is so clean that it seems likely to be OK. Here is a quick look at the home page of the site: Example 2: New Zealand Tourism Online. The home page is a PR 6, and the listing pages are PR 4. Here are some key observations about the directory: The site is advertising supported Listings are not paid for, but are editorially selected Listing quantity per category is high The ad revenue for the site depends on the quality of their listings, which creates a big disincentive to let any bad sites in. Here is a quick screen shot of the site: Example 3: The Internet TESL Journal. This site has a PR7 home page. The content is highly academic in nature, and features the best new educational ideas direct from practitioners. The home page looks like this: Here are a few key points about the site: There is no overt link back to the author's site. This site does not pass PageRank, but read on. Articles do contain the author's email address. You can cite references in your articles. Getting on this site is about reaching influencers. You can gain exposure to an audience of educators. You will only value this if you are in the education business in some fashion, but if you are, you may attract the attention of some interesting people by getting your article posted here. You can also leverage getting posted here in marketing the value of your site to others (it's an endorsement). Bad Directory Examples I am not going to list URLs for the risky directories, as the purpose of this post is not to out anybody in particular. Example 1: It's a PR7 site with a PR7 directory home page. The overall content is authoritative in nature, so this is good. The PageRank is also great. However, there is no clearly published editorial policy on the site. A deeper look at the site, and it looks a lot like the policy really is pay your money, and you are in. It's quite possible that this site currently does pass link juice. However, over the longer term it seems likely that the ability of this directory to pass link juice will get pulled. Example 2: This one is a PR4 site that has PR4 links pages. There is a little bit of AdSense advertising up top, but not in an overwhelming fashion. Unfortunately, the links go through a redirect, so they may not pass PageRank. However, there are lots of unrelated links on pages at the bottom, which clearly are ads. Those ads do pass link juice. Pay Per Post Why don't these links count? The short answer is that it has already been proven guilty. Pay per post services were marketed as a way to get link juice, which did not help. But the bigger issue is that the basic test of paying money to get an editorial review, which might not result in a link, is not met by these types of services. Pay per post services pay you for providing the link, and as a result, the link is treated like any other purchased link. Summary With our clients, we actively recommend directories as a part of their link building strategy. This includes the major general purpose directories, such as the ones we cited from The Professional's Guide to Link Building on SEOmoz. These are trusted directories and provide valuable links. In addition to these, we look for vertical directories specific to the industry of our client. Nearly every business or market space has one or more high quality directories that are really worth getting into. You can also pursue some other \"edgier\" directories if you like. If you do this in limited quantity, you will probably be OK, and possibly get some additional link juice. Just don't be surprised if they stop adding value some day. However, make sure you stay away from obviously sleazy directories, and keep the quantity of edgy directories your pursue to a minimum. If you are in a lot of edgy directories, and a search engine sees that you have been doing so, you may become flagged for a human review. Nothing good can come out of an requested human review by a search engine. We don't even consider these types of directories with our clients. We spend the same time and energy we would searching for those in searching for high quality natural links. Learn how to locate quality directory links for your site (or client's sites) and you will be able to quickly pick up a bunch of quality links. Then stay away from the riff-raff so this strategy won't cost you at a later time. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Role of Directories in Link Building"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Role of Directories in Link Building"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Eric Enge\n          \n            Eric Enge"
}