{
  "url": "https://moz.com/blog/romanians-are-smart-or-how-to-change-the-google-autocomplete-suggestions",
  "slug": "romanians-are-smart-or-how-to-change-the-google-autocomplete-suggestions",
  "title": "Romanians are Smart or How to Change the Google Autocomplete Suggestions - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I am a Romanian. I am proud of it, despite of what the world thinks about Romanians. What people think about Romanians could be influenced by Google. Google is a voice in the world, which influence in a positive or negative way, even if we do not like it.",
  "content": "Romanians are Smart or How to Change the Google Autocomplete Suggestions SEO Tools By: gabi andrei March 27, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: gabi andrei March 27, 2012 Romanians are Smart or How to Change the Google Autocomplete Suggestions SEO Tools The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I am a Romanian. I am proud of it, despite of what the world thinks about Romanians. What people think about Romanians could be influenced by Google. Google is a voice in the world, which influence in a positive or negative way, even if we do not like it. But let me start with the beginning. In November 2011, someone noticed that if he typed in Google romanians are (English), romanii sunt (Romanian), les roumains sont (French), los romanos son (Spanish), i rumeni sono (Italian), rumanen sind intelligent (German) the Autocomplete gave only negative suggestions. Trying to find out what's going on, he understood that the suggestions are determined based on a number of purely objective factors (including popularity of search terms) without human intervention. If you would like to find out more details about it, Danny Sullivan wrote a really nice article on How Google Instant's Autocomplete suggestions work. Starting from this, one of the most well knows Romanian brands, ROM, launches a campaign to change the Romania's image on Google. They build a website: Romanians are smart (with a Romanian version on Romanii sunt destepti), where they persuade Romanians to search on Google on specific terms, so they will change the Google Autocomplete suggestions. The campaign's call to action is \"Change with a click\"; users get the option to search directly from the website in six languages: Romanian, English, German, French, Spanish, Italian with the final goal of changing the Romania's image on Internet: On Youtube they uploaded a tutorial that helps users to understand why and what they are supposed to do: At the launching date, in November, there were very few searches, and they were only on negative terms. As you can see in Insights for search the number of searches increased quickly, the positive terms having a higher volume than the negative ones. Of course, some negative searches were still in use, probably a lot of users wanted to see how the results look like. One month later, on December 21 st 2011, a Romanian blogger piticu.ro shows for the first time that positive suggestions started to appear next to negative ones. On the website we can see live how many searches have been made in all languages (and different websites too). Today there have been already made on the website over 600000 searches: 163,779 searches for romanii sunt destepti (Romanian) 133,892 searches for les roumains sont intelligents (French) 137,782 searches for romanians are smart (English) 62,948 searches for rumanen sind intelligent (German) 79,628 searches for i rumeni sono intelligenti (Italian) 78,829 searches for los romanos son inteligentes (Spanish) For some languages, the suggestions are completely changed, and only positive terms appear: For some languages, there's still work to do. For French for example, where the positive searches appears next to the negative ones. Google gives bad suggestions about your name or brand? With a bit of work this can be fixed. Romanians are smart, aren't they? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Romanians are Smart or How to Change the Google Autocomplete Suggestions"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Romanians are Smart or How to Change the Google Autocomplete Suggestions"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "gabi andrei\n          \n            gabi andrei\n          \n            gabi andrei"
}