{
  "url": "https://moz.com/blog/ron-paul-is-the-snakes-on-a-plane-of-2008",
  "slug": "ron-paul-is-the-snakes-on-a-plane-of-2008",
  "title": "Ron Paul is the Snakes on a Plane of 2008 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "http://www.seomoz.org/blog/the-internet-the-ultimate-focus-group...",
  "content": "Ron Paul is the Snakes on a Plane of 2008 Online Advertising By: Rebecca Kelley January 16, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley January 16, 2008 Ron Paul is the Snakes on a Plane of 2008 Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Up until now, if you had been reading reddit and other social media sites fairly regularly you would have thought that Republican presidential candidate Ron Paul was the second coming. He had a ton of online exposure, support, and young followers. We even wrote about the \"Ron Paul effect\" on numerous occasions. After being inundated with all things RP for months on end, it was only natural to think that the guy stood a fightin' chance of winning the presidency. Then the Iowa and New Hampshire primaries came and went, and Ron Paul did surprisingly poor. In Iowa he came in 5th with 10% of votes, while in New Hampshire he fared worse with only 8% of the vote. Last night in Michigan he received 6% of votes. What happened? I couldn't even open my Netvibes without the \"Technology/News\" section displaying at least one headline about Ron Paul being the future of America, Ron Paul having magic healing powers, and Ron Paul being a built-in Swiffer duster and mop. The explanation is easy, folks. Ron Paul is the Snakes on a Plane of 2008. Think about the explosion of Internet hype when Snakes on a Plane was being filmed. The mere idea of Samuel L. Jackson starring in a movie with a title as absurd (yet to the point) as \"Snakes on a Plane\" had Internet-savvy, Digg-frequenting, blog-reading and writing users foaming at the mouth. There were posts. There were mock posters. There were spoof videos. There was a viral marketing campaign where you could plug in a friend's phone number and have them receive a call from Jules Winnfield himself, urging him or her to go see Snakes on a Plane. People online (including me) had snakes on the brain, and everyone thought it would do monstrously well its opening weekend at the box office. It didn't. The movie made a little under $14 million its opening weekend and ended up grossing only $62 million worldwide (in comparison, 300, also rated R, made $70 million its opening weekend). It was considered to be a disappointment through and through (though I still enjoyed it in all its campy glory), and yet, like with Ron Paul, you'd have thought that with all the Internet buzz it had created, the movie would have been a resounding success. Both Snakes on a Plane and Ron Paul have taught us a valuable lesson: Internet buzz doesn't resonate as much as you think. Since I literally work on the Internet and am online at least 10 hours a day, it's easy for me and other 'net savvy folks to think since the online masses are obsessed about something, that must mean that it's going to be equally popular offline. Not true. I doubt that most of my relatives were aware of the massive online campaign behind Snakes on a Plane, nor would they consider Ron Paul to be a major contender in the Republican race. Even though more people are online today than ever, that doesn't mean they're hitting places like reddit and other sites that are spreading viral and social media marketing like wildfire. Most people still use the Internet for email and little else--maybe some Yahoo! games and basic searches. These people aren't seeing scores and scores of stories about the \"next big\" movie, political candidate, viral video, etc. How many of the people that you know have seen the Chronicles of Narnia video? If I were to narrow down my choices to people I know that aren't SEOs and that I don't work with, I'd say that my answer is probably less than 20, maybe even less than 10. This sounds absurd, given how obscenely viral it was, but it's true. The point I'm making translates directly to any viral marketing campaign you have up your sleeve. It's absolutely crucial to understand that viral or guerrilla marketing doesn't always translate smoothly from online to offline (the Aqua Teen Hunger Force promotion comes to mind). At this point, we are still a minority of Internet sponges that soak up information and readily retain it. We're a little-discovered species that don't necessarily represent consumers as a whole. Keep that in mind the next time you see an online campaign crash and burn offline, and you're confused as to what went wrong. Don't think that you can just release something online and expect it to snowball into an avalanche--in many cases, offline marketing and awareness is just as important, if not more, than online marketing. Marketing is a comprehensive effort, and it's often easy to get caught up in the craziness happening online and overlook the even bigger audience that isn't logging on. Now, if you'll excuse me, I think I'll go watch Samuel L. dispatch of some serpents... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Ron Paul is the Snakes on a Plane of 2008"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Ron Paul is the Snakes on a Plane of 2008"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}