{
  "url": "https://moz.com/blog/roundup-thursday-for-the-week-of-7608",
  "slug": "roundup-thursday-for-the-week-of-7608",
  "title": "Roundup Thursday for the Week of 7/6/08 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Stories, news, and other notable items from the past week:\n\nThree star links:\n\n    * The best SEO training money can buy (hey, we do have to wade through a lot of shit in order to achieve top rankings...).\n    * Apparently Yelp is shutting down accounts it thinks are \"trading glowing reviews with…",
  "content": "Roundup Thursday for the Week of 7/6/08 SEO Events By: Rebecca Kelley July 10, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley July 10, 2008 Roundup Thursday for the Week of 7/6/08 SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Stories, news, and other notable items from the past week: Three star links: The best SEO training money can buy (hey, we do have to wade through a lot of shit in order to achieve top rankings...). Apparently Yelp is shutting down accounts it thinks are \"trading glowing reviews with other business owners.\" It's a tricky situation for Yelp since they obviously want to keep the quality and sincerity of reviews up, but they don't want to mistakenly witch hunt innocent people. Finally, a video of search engine spiders crawling the web. Is Flash indexing actually going to be damaging for websites? Some interesting repercussions are possible... Seems logical enough: the NY Times says that if you're more open to growth, you're more likely to grow and succeed. I guess my new little Chia Monkey isn't open to growth, then. Poor little bald guy... MindValleyLabs provides some helpful advice on how many keywords to add per ad group. Whoa, Yahoo patented anchor text relevance? Does that mean anything for Google? Four star links: Tamar interviews a ton of SEO professionals (including moi) and asks them what traits defines a social media marketer. The responses are really interesting, so if you're looking to become an SMM and want to know what it takes, I highly recommend reading this post. Speaking of social media, this study finds that social networks \"play an important role in document recommendation.\" It's a long study, but pretty interesting nonetheless. Eric Enge has a great interview of Yahoo's director of product management, Priyank Garg. Alex Poole does an interesting study of serif vs. sans serif typefaces in an effort to determine if one is more readable and legible than the other. Graywolf lays the smackdown on Google for ranking virtually empty Wikipedia pages as #1 for various searches. I don't have much of a beef with Wikipedia, but even I think that's excessive. Yahoo introduces BOSS (Build your Own Search Service), a service that provides search-related resources to developers. Five star links: The Google AdWords Keyword Tool has been updated to provide search volume data. It's probably not entirely accurate, but still, it's much better than a wimpy little green bar. YOUmoz entries: Linkbuilding Tips for Small Business - Linkbuild Your Way to Success Before You've Even Started. RichardBaxterSEO shares an innovative and interesting link building strategy that small business can execute when starting a web site. SEO Myths That Persist: Keyword Density. Scotie talks about how overrated keyword density is and how we should instead focus on semantics. The Best Adwords Report You Don't Use. Mike Piper talks about the Search Query Performance report in Google AdWords. Small Business Link Building: Part B - Grabbing the Bull By the Horns. Rishil continues with his small business link building series by establishing different types of contacts with link prospects. Paid Search: Detaching from an Agency. Kate gives some great paid search tips for those of you who come from an agency or are thinking of working with one. Marketing to the IPod Generation. Sanjay Bhatia shares some insight about Generation Y (aka the \"iPod Generation,\" as he puts it) and how to effectively market to them. Prevent Project Creep. Webwordslinger identifies ways to avoid the dreaded Bloated Project Syndrome, and how to deal with clients who try to milk more work out of you than they paid for. Go(d)ogle Forgives Everyone... Mert talks about some penalties he experienced and laments about Google's \"slap on the wrist\" policy for certain sites. Best of YOUmoz: The PageRank Hierarchy, As Defined By Celebrities. Mitch Turk wrote a very creative and amusing post that explains PageRank using various celebrities. I insta-promoted it to the front page based on its awesomeness. Way to go, Mitch! New events added to the Events Calendar: SMX Sao Paulo August 7-8 in Sao Paulo, Brazil (Hmm, the conference is a day after my birthday. Whaddya say you send me and Jane as a birthday gift to me, eh Rand? I know how to say \"thank you\" in Portuguese!) PPC Summit Leading Internet Marketing Workshop September 25-26 in Los Angeles, CA Upcoming events: Social Networking Conference July 10-11 at the Mission Bay Conference Center in San Francisco, CA SEM for SMB July 16-17 at the Hilton Austin Downtown in Austin, TX SMX Local & Mobile July 24-25 in San Francisco, CA New additions to the SEOmoz Marketplace: Featured job postings: Online marketing channel manager in Chicago, IL Contracted SEO/link builder in Stavanger, RO, Norway SEM specialist for Stone Interactive Group in Ann Arbor, MI (Go Wolverines!) SEO/search marketing associate for High Rankings in Framingham, MA. This will undoubtedly be a great learning experience and good opportunity for the new hire, as he or she will get to work with one of the original rock stars of SEO, Jill Whalen. Featured companies: United States/North America: Bottom Line Copywriters in Atlanta, GA Top Floor Technologies in New Berlin, WI A SEO Pro in Washington (shouldn't it be \"An SEO Pro\"?) Kneoteric eSolutions in Midvale, UT HelpDocuments.com in Nashua, NH UK/Europe: Kronik Media in London, UK SEO Consult in Timisoara, TM, Romania BULL marketing in Rheine, Germany Digital Base in Belgium Asia: Toputop in Hyderabad, AP, India Featured resumes: Currently looking: Dan Brotman has over 5 years of search marketing, SEO, and affiliate management experience. He is also well versed in web analytics and is a certified Google AdWords, Yahoo Ambassador, and MSN AdExcellence professional. Matthew Woods Gordon is an SEO copywriter who has previous experience working for Viewpoints.com. Sunday Oliver is an SEO copywriter who specializes in natural HABA, supplements, and nutrition. He also has a background in efficient energy and green construction. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Roundup Thursday for the Week of 7/6/08"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Roundup Thursday for the Week of 7/6/08"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}