{
  "url": "https://moz.com/blog/roundup-thursday-for-the-week-of-81008",
  "slug": "roundup-thursday-for-the-week-of-81008",
  "title": "Roundup Thursday for the Week of 8/10/08 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Stories, news, and other notable items from the past week:\n\nThree star links:\n\n    * Soxialize came out with Tweet Pro, a service that allows you to quickly and easily find Twitter users who share your same interest by searching through posted messages and profiles using keywords you enter.\n    *…",
  "content": "Roundup Thursday for the Week of 8/10/08 SEO Events By: Rebecca Kelley August 15, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley August 15, 2008 Roundup Thursday for the Week of 8/10/08 SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Stories, news, and other notable items from the past week: Three star links: Soxialize came out with Tweet Pro, a service that allows you to quickly and easily find Twitter users who share your same interest by searching through posted messages and profiles using keywords you enter. Richard Baxter teaches us how to create a new page template in Wordpress for social media targeting. Lately he's been providing some solid tips and posts on his blog, so check it out if you haven't already. Meet GWEI.org, which, of course, stands for Google Will Eat Itself. I'd eat myself if I were made out of delicious, delicious cheese. A Salon.com article examines the Amazon Mechanical Turk, which is \"artificial artificial intelligence,\" or people who make a few cents per extremely simple task (such as identifying the colors of products). Ladies and gentlemen, we have reached faster-than-light information transfer. Rand adds, \"Even if we can't get to alien planets, at least we can email them (this also makes Star Trek and Star Wars style communication much more believable, so that's nice).\" For those of you who were wondering, Google is still kicking ass and taking names in search engine market share. Free rent in San Francisco?! You could buy a lot of Rice-a-Roni with the money saved! Michael Gray says that Page Rank will never die, though he recommends using a multitude of metrics in addition to PR to gauge the trustworthiness and value of a page for link building. Salon.com debuted a social media section. It's generated a lot of buzz in the tech news sphere, so we'll see how well the section does... Derek Sivers interviews Tim Ferriss, the author of The 4-Hour Workweek. The Wall Street Journal says that for most people, college is a waste of time. I agree that college isn't for everybody. I think generally people understand that the point of most degrees (aside from medical-related specialties, law, and other necessary degrees for highly specialized careers) is to basically prove that you have the discipline to stick with something and work hard for X years in order to attain a goal. It's lame that you have to pay tens of thousands of dollars for a little sheet of paper that assures job prospects of this, but them's the breaks, right? Four star links: This guy fooled Google News. Because Google News has no human editors, it \"cannot tell the difference between real news stories and spoofs, especially when both the real news and the spoof are ostensibly about the same topic.\" Hmmm, I wonder how the big G plans to fix this... Slate Magazine discusses the \"Google black hole,\" which is when Google buys a company and then shuts it down or lets it sit stagnant. It's an interesting read that gets you to think how the company founders feel when they sell their baby to a big company, only to see the fruits of their labor get abandoned and their staff dispersed to other projects. The Colbert Bump refers to a politician's surge in popularity following an appearance on Comedy Central's The Colbert Report. It turns out that the bump is real...for Democrats. Republicans, on the other hand, experience a post-show slump. Matt McGee asks us if we're promoting the great content we have. Matt is so smart. And he wrote a book about U2! Brent assures us that even boring products and services can benefit from social media marketing, and he has a few prime examples to prove his point. Five star links: Andrew Chen uses Google Insights to see which websites are used more heavily in certain parts of the US. The breakdown is quite fascinating--who knew that Digg's not big in Wyoming? (Well, actually, that doesn't seem too surprising...) YOUmoz entries: All That is Wrong with SEO in the UK. Mrpurple's post wasn't warmly received, as it alleges that most UK sites commonly use link spam in their SEO efforts. The discussion in the comments is valuable, though--it's nice to see a community band together and argue their counterpoint. 4 Reasons to Have Your blog Free-Hosted, From an SEM Perspective. Mitch Turk shares some advice on why you would want to have your blog hosted on a free platform. How Worldwide SEO Benefits Your Business. King discusses how you can bring worldwide traffic to your site for low cost, quick rankings, and increased conversions. Some Thoughts on S&M. Michael Regan gets kinky and talks about S&M...sales and marketing for SEM, that is. ;) Best of YOUmoz: New Reality: Google Follows Links in Javascript. FirstStop shares with us his discovery that Google was following links on his site that were in Javascript. Nice sleuthing, buddy! Posts like these are always quite fascinating. How to Deal with the Problem Child in Your Adwords Campaign. I'd have said to put him in tae kwon do, which is what we did with my brother, but HannahS has a better solution. She provides some great tips on what to do with your \"problem child\" keyword in your PPC campaign. Paid search posts are always extremely valuable to see on YOUmoz, so thanks for your professional insight, Hannah! New events added to the Events Calendar: SES San Jose August 18-22 in San Jose, CA SMX East October 6-8 in New York, NY. SEOmoz members get a 20% discount if they use discount code SEOmoz@SMX while registering. This discount can be applied to all access passes (full and one day) only. Upcoming events: SES San Jose August 18-22 at the San Jose Convention Center in San Jose, CA SEOmoz Expert Training Seminar August 19-20 at the University of Washington in Seattle, WA New additions to the SEOmoz Marketplace: Featured job postings: Search engine marketer for Schipul SEM in Houston, TX Director of SEO/SEM for MySpace(!) in San Francisco, CA. Yes, THE MySpace. Your boss will probably be Tom. Oh, and also, the job description calls for someone with a \"minimum of 8-10 years of prior experience in SEO/SEM,\" which pretty much narrows the field down to Danny Sullivan. Good luck hiring him! Featured companies: United States/North America: Direct Online Marketing in Wheeling, WV Searching Solutions in Denver, CO Galaxy Spectrum in New York, NY TMA E-Marketing in Minneapolis, MN Lightburn in Milwaukee, WI The Factory Interactive in Miami, FL Levert Marketing in Hamilton, ON, Canada Asia: Karmyogi Solutions in Ahmedabad, India Redon Solutions in Mumbai, India Featured resumes: Currently looking: Jack Kelly Garrett in Atlanta, GA, is an Internet marketer who has over 15 years of experience in business development and two years of experience in directing Internet marketing. He also has experience with marketing, sales, IT, copywriting, landing page design, PPC, and more. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Roundup Thursday for the Week of 8/10/08"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Roundup Thursday for the Week of 8/10/08"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}