{
  "url": "https://moz.com/blog/roundup-thursday-for-the-week-of-81708",
  "slug": "roundup-thursday-for-the-week-of-81708",
  "title": "Roundup Thursday for the Week of 8/17/08 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Stories, news, and other notable items from the past week:\n\nThree star links:\n\n    * Royal Pingdom shares the best interview questions from Google and Microsoft (and they throw in a cheeky IKEA interview question, too). Warning: the questions are uber-geeky and pretty quantitative/logic-heavy.\n   …",
  "content": "Roundup Thursday for the Week of 8/17/08 SEO Events By: Rebecca Kelley August 21, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley August 21, 2008 Roundup Thursday for the Week of 8/17/08 SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Stories, news, and other notable items from the past week: Three star links: Royal Pingdom shares the best interview questions from Google and Microsoft (and they throw in a cheeky IKEA interview question, too). Warning: the questions are uber-geeky and pretty quantitative/logic-heavy. Speaking of nerd alert, here's the linear algebra behind search engines. Geez, my head hurt just typing that. The O'Reilly Radar asks if linking to yourself is the future of the web. The post has two good recommendations for self-linkers, so be sure to check 'em out. Yahoo! Buzz has opened up, so now content from any publisher on the web can be \"buzzed up.\" The Scientific American highlights the problems with e-voting. Good information to have, especially with an extremely important election looming in the US. What the frak?! 29% of Internet users have purchased from spam! I can't believe anyone's seriously stupid enough to--ooh, wait a second, a window just popped up on my screen telling me I've won a free iPod! Sweet! Hold on, I gotta input my credit card info to cover the shipping and handling... Psychology Today dissects the creative personality trait. I don't see \"copious amounts of body odor\" on the list. Hmm... Not only is stress bad for your mind, it can harm your body, too! Stress: the silent killer. Find out more tonight at 10! Four star links: Sure, people poke fun at Rand's coinage of the term \"linkerati,\" but this chart proves that frequent social readers are more likely to link to/share viral content. SEMI came up with 24 amusing ways for SEO detractors to prove their point. I like the \"Use the same title tag for every page\" tip. :) ReadWriteWeb has some good tips on how Technorati can become useful again. Chris Brogan has 50 ideas on how to use Twitter for business. Five star links: Condomunity has a great article on the importance of crafting great headlines for your blog posts. Definitely check it out and start training your brain to come up with catchy titles and headlines that capture your readers' attention and suck them in. YOUmoz entries: Even Kanye Can't Make Twitter Mainstream. Ciaran talks about how Twitter seems to be struggling with becoming widely popular. Why Google Hates Links. Moleskin contributes his first ever YOUmoz post and discusses how directories are a great addition to a website for link building purposes. Social Media is People. Feedthebot talks about the motivation behind social media and reminds us that it's more important and more valuable to have an interaction and a relationship with your audience than it is to build links. Best of YOUmoz: We had a lot of great YOUmoz entries this week! I'll share the top 3: Learning SEO: A List of SEO Audio. For his first YOUmoz post, Flying Monkeys shares a list of some great SEO interviews and tips that appeal to our aural learners. Way to think outside the box and offer up some nice audio resources! Small Business SEO: Content Strategies. Rishil is at it again--this time he shares some questions to ask your client in order to come up with some content strategies for small businesses. He's certainly building up an arsenal of valuable SEO posts--thanks, Rishil! Google Refuses to Penalize Me for Keyword Stuffing. Darren Slatten shares an interesting experiment he conducted. Basically, he tried to spam the crap out of his SEOmoz profile in an attempt to drop it down from the #1 spot on a search for \"world's greatest seo.\" It didn't work, but the case study is both amusing and quite valuable. Thanks for spamming us, Darren! New events added to the Events Calendar: No new events added this week. Upcoming events: Webdagene September 18-19 in Norway Social Networking Conference at the Millennium Gloucester Hotel Kensington and Conference Center September 22-23 in London, UK PPC Summit September 25-26 in Los Angeles, CA New additions to the SEOmoz Marketplace: Featured job postings: Ongoing SEO work for Modern Eco Homes in New York, NY Digital marketing expert for Green Mountain Energy Company in Austin, TX SEO manager for FXCM in New York, NY SEO team lead for Blue Moon Works in Denver, CO Featured companies: United States/North America: DragonSearch Marketing in New York, NY EcommerceRecruiter.com in the US Blue Moon Works in Denver, CO Myers Media Group in San Diego, CA SalesonlineWorld in San Francisco, CA PG1 Search in Portland, OR UK/Europe: Searchlight Digital in Newport, Gwent, UK Featured resumes: Currently looking: Katherine Watier in Maryland is an integrated marketing and communications professional with experience in SEO/SEM optimization, web 2.0 campaigns, web analytics, direct mail, email, public relations, and online marketing and media training. Happily employed: Paul Bradish (I'm not sure where he lives) is an Internet markter and SEO/SEM consultant who focuses on e-commerce. He currently works as president of IslandSupplements.com and MMAOverload.com. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Roundup Thursday for the Week of 8/17/08"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Roundup Thursday for the Week of 8/17/08"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}