{
  "url": "https://moz.com/blog/roundup-thursday-for-the-week-of-21008",
  "slug": "roundup-thursday-for-the-week-of-21008",
  "title": "Roundup Thursday for the Week of 2/10/08 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Stories, news, and other notable items from the past week:\n\nThree star links:\n\n\n    Happy Valentine's Day, everybody!\n    Okay, I apologize for the above link,...",
  "content": "Roundup Thursday for the Week of 2/10/08 SEO Events By: Rebecca Kelley February 14, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley February 14, 2008 Roundup Thursday for the Week of 2/10/08 SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Stories, news, and other notable items from the past week: Three star links: Happy Valentine's Day, everybody! Okay, I apologize for the above link, but I couldn't help myself. Here are some fun facts about Valentine's Day to cleanse your palate. TechCrunch discusses how FastCompany has rebranded itself as a business social network. Rand and I are especially pleased to see FastCompany's positive press because they are one of SEOmoz's clients and he and I worked on their wireframe and tested their site before its relaunch. Will Critchlow and gang put together a mobile search quiz over at Distilled. Cast your vote on who you think is most likely to win the mobile search race. Not only is Google displaying ads for MySpace spam software (link removed as domain was lost), it's also allowing them to use Google Checkout. For shame, Google. For shame. As penance, I sentence you to slap the monkey in the banner ad no fewer than 30 times. Apparently the Internet helps Americans save more energy every year. If we could power the world's energy from lolcatz, we would solve the planet's energy crisis in about 72 hours. I can has hybrid car? The Scientific American asks if all companies have to be evil and cites Google as an example of a corporation trying to do good. I read bits of the article but didn't get through the whole thing because (and this could just be me) when I open up an article online and see an endless sea of blocks of text, my eyes glaze over and I go into \"skim\" mode. How sad. The Internet has ruined my reading ability. Problogger brings us some handy tips on how to write StumbleUpon-friendly posts. It's pretty intuitive stuff, but a handy guide nonetheless. At Search Engine Journal Rhea Drysdale asks if SEO is becoming less open and transparent as it once was. Her post sparks an interesting discussion in the comments. Four star links: This new Googlebot design could easily kick Rand's Googlebot's ass. I call for a battle royale, with the loser bot forced to take the winning bot to see WALL-E. The NY Times has an interesting article about how \"immediate social bonding between strangers is highly dependent on mimicry, a synchronized and usually unconscious give and take of words and gestures that creates a current of good will between two people.\" Ugh, so that's how the stupid Macarena got so popular. Shoemoney offers up a great guide to link cloaking, masking, and URL redirection. He does a good job of defining and explaining what each one is. Thanks for the 101, Shoe! Matt McGee talks about how you can use your Flickr photos to get a lil' link love and branding to your site. Fun fact: Matt's U2 fan site was ranked by Entertainment Weekly as one of the best music fan sites. How cool is that? Five star links: This Paid Search 101 video had me sheepishly grinning like a big nerdy idiot. I'm sure all you dorky SEOs will find it as amusing (and catchy!) as I did. Hitwise has a really cool study about the effects of your site getting \"blacklisted\" by Google. The effect of getting penalized is graphed, and the results aren't pretty. Part 3 of the \"Understanding Google Maps & Yahoo Local Search\" posts is up. The flow chart alone is extremely valuable information on how Google Maps generates their category information. The rest of the post (and parts 1 and 2) is very comprehensive stuff. YOUmoz entries: Moz Community News. Bookworm-seo has some community news for us SEOmoz members, and he invites any of us attending SMX West to get together for a drink and a chat. The Sheer Complexity of Social Trends. JustFred talks about his earlier experiment and how difficult it is to understand the search engines which are really just trying to understand us. Boy, it sure is difficult to understand ourselves... The Ten Commandments Revised. Paz authors a cheeky draft of SEO Commandments. How Does a Company Hire the Right SEO? Milan asks the community how to find the right candidate that you can trust with your website. The responses are encouraging and offer a lot of advice and insight. MozLovin in Time for Valentine's Day. SEO Columbus came up with a totally scientific formula to determine one's \"MozLove\" Score. Crash is the only member to have a 100% MozLov score. What a feat! Putting the Tipping Point to Work. Vingold talks about Malcolm Gladwell's book, The Tipping Point, and how you can make the book's message work for you and your business. The Problems Faced by SEOs from the Outsourcing Hub of the World. Mani Karthik talks about SEO from an outsourcing perspective and calls for a universal quality of SEO services, regardless of the location. Who's Tedster? If You're an SEO, You Should Know. Huge1102 interviews Tedster, aka Ted Ulle, an administrator and SEO guru at WebmasterWorld. Best of YOUmoz: Esteban Panzera's 11 Tips for Appearing at Google Definitions is a very handy step by step on how to get your website to appear as a result for a \"define: \" search at Google; so handy, in fact, that I promoted his post to the main blog. Well done, Esteban! As for the rest of you, be sure to follow these tips and in no time you can rank for terms like this! New events added to the Events Calendar: No new events added. New additions to the SEOmoz Marketplace: Featured job postings: SEO professional in Newport Beach, CA SEO expert for a poker portal in Toronto, Canada Featured companies: United States/North America: WebBizNetworks in Minnesota Web Wise Media in Los Angeles, CA Zunch Worldwide in Dallas, TX, the US, China, Germany, Italy, and Taiwan. Worldwide, indeed! Text Link Brokers in Phoenix, AZ SEO Design Solutions in the US Bloom Marketing in Vancouver, BC, Canada UK/Europe: Specialist Online Marketing in Harrogate, UK Asia: SEMGURU in Gurgaon, India Pigmata Media in the Philippines Featured resumes: Nakul Goyal is a happily employed individual who \"lives and breathes\" SEO. Good for him! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Roundup Thursday for the Week of 2/10/08"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Roundup Thursday for the Week of 2/10/08"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}