{
  "url": "https://moz.com/blog/rounding-out-the-week",
  "slug": "rounding-out-the-week",
  "title": "Rounding Out the Week - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Just the links, folks:\n\n    The folks over at DowJones Marketwatch are so clueless about social media, it hurts. Just read their take on Scott's blog entry from last week (scroll to the 3rd article). \n    More on ...",
  "content": "Rounding Out the Week Moz News By: Rand Fishkin January 19, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 19, 2007 Rounding Out the Week Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Just the links, folks: The folks over at DowJones Marketwatch are so clueless about social media, it hurts. Just read their take on Scott's blog entry from last week (scroll to the 3rd article). More on leveraging linkbait from the YPN blog, courtesy of yours truly Sadly, email spam isn't going away, it's getting more sophisticated and more prevalent Royal Pingdom has a genius heat map overlay of dangerous weather areas to help identify the best places for a datacenter. Eric Enge interviewed Google Analytics' Brett Crosby; definitely worth a read, but be aware that it's long and very in-depth (nice work, Eric). Werty explains why Netflix's online marketing will help them edge out Blockbuster. 2006 marked the end of Washington state's mini-recession after the dot-com bust. Michael Gray points out the value of data gathering from blog widgets and why the MyBlogLog acquisition from Yahoo! was so wise. One piece of advice we didn't take from Andy - Why Marketing Agencies Shouldn't Publish their Fees. New acronym - MFD (Made for Digg). Cameron talks about it, Ethan Kaplan coined it. Donna notes that Google seems to have changed the way they handle subdomains in site commands (and posits that more changes may result from this). Brian Clark has a few link building strategies that have worked well for him. Guy Kawasaki (I refuse to mention the name of his inappropriately titled blog) has then top ten marketing podcasts (sadly, no Danny, no Shoemoney, no SEO Rockstars) Vanessa posted a terrific year-in-review of Webmaster Central. Congratulations, WMC team - I admire nearly everything you do and love the way you do it (now, just blog more and my enamor will be complete). Mr. Boykin is itching for a fight with his Linkbait won't do it, you need link ninjas. Actually, I think you need both and it can depend on your site and your targets as to which is the better choice. Jon Mendez is touching on a question I get asked by client quite a bit - Should you purchase your branded keywords? The MindValley guys have a terrific post about one Adwords headline outperforming another... by 195%. Those guys have a great blog. Andrew's right - 30% year-over-year growth in searches is phenomenal. Dr. Garcia says - SEO is not and will never be a science. I agree with the statement, but his reasons aren't the ones I would have chosen. What did I miss this week? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Rounding Out the Week"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Rounding Out the Week"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}