{
  "url": "https://moz.com/blog/roundup-thursday-for-the-week-of-61508",
  "slug": "roundup-thursday-for-the-week-of-61508",
  "title": "Roundup Thursday for the Week of 6/15/08 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Stories, news, and other notable items from the past week: \n\nTwo star links:\n\n\n    I'm getting tired of this \"Google is evil! Wait, no they're not! But it was their motto and now it's not!...",
  "content": "Roundup Thursday for the Week of 6/15/08 SEO Events By: Rebecca Kelley June 19, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley June 19, 2008 Roundup Thursday for the Week of 6/15/08 SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Stories, news, and other notable items from the past week: Three star links: Our buddy Jeffrey Rohrs is touring the country doing ExactTarget eMarketing seminars. He's coming to our backyard of Seattle next week (June 24), so if you're interested in attending, you can receive $20 off the $99 registration fee by entering the following code at checkout: R1T1JKR1 Over at Techipedia, Samir Balwani guest blogged about Plutter Kite, the \"official roadmap for the best micro-blogging platform.\" He goes through Plurk, Twitter, and Brite Kite's services and features, and it's a handy drilldown of each site's offerings. Speaking of Plurk and Samir, over at Leftthebox.com he brings us 5 reasons why we should be using Plurk. I actually am using Plurk, and I kind of like it. (I'm still the last marketer alive who's not on Twitter.) Our CTO Jeff showed me this list of top 10 home cooking mistakes. You trying to hint at something, Jeff? I told you, it's not my fault the chicken was undercooked--it's your girlfriend's fault for having a weak stomach! ;) The Yahoo! Search Marketing Blog offers up 5 steps to ensure you're bidding for the right place when working on your paid listings campaigns. #1 used to be \"If you're on Google, you're in the wrong place,\" but I think that's changed after the partnership. :) Um, Japan's latest booming sex niche is old people porn. I'm not kidding. (The link goes to a Time.com article, so don't worry about seeing any wrinkly boobies or anything.) Four star links: The Web Hosting Database compiled a list of 100 webmaster blogs by and for women. I was fortunate to make the list along with many other excellent women in our industry. It's a great resource and a fantastic way to discover new blogs. Frequent SEOmoz member Richard Baxter wrote a useful recruitment SEO guide. In his words, his \"Guide to Recruitment SEO is aimed at the beginner to intermediate SEO consultant or in house marketers tasked with buying a new recruitment website from a web design agency.\" ViperChill came out with the Definitive Guide to Fark and Getting Mass Traffic. I love seeing posts that highlight how to leverage less popular social media/web 2.0 sites. Fark is a great site, and it's cool to see ways in which you can try and get a link or a mention from them. Chris Winfield built a presentation exclusively via Twitter. What better way to show how Twitter works and highlight its benefits than by using it to craft your entire presentation? Clever work, Chris. Five star links: David Mihm's Local Search Ranking Factors is an invaluable resource for anyone doing local and small business SEO. Much like our Search Engine Ranking Factors, David's guide pings 20 local search experts on various local search ranking factors and has them weigh in on whether they feel these factors have much of an impact in rankings. I highly recommend checking it out--a lot of time and effort went into this guide, and it's a great reference for anyone looking to optimize for local search. YOUmoz entries: Call Tracking is Missing from the UK. Steve Witt identifies a gap in the market for analytics within the UK and the rest of Europe. How to Talk to Your Copywriter. Webwordslinger shares some questions a copywriter should ask himself before beginning work for a client. Toolbar PR of SEOmoz Users Profile Pages: A Case Study. Carfeu does some sleuthing to figure out why some SEOmoz members' profile pages have PR and some don't. A Few Things That Irk Me About Plurk. Ciaran fuels up on haterade to talk about why he doesn't like Plurk, a new microblogging and social networking site. The Acceptance of User Experience Optimization (UEO) Will Pave the Future for SEO. Jamersan believes that SEO will evolve into UEO, resulting in our industry receiving the acceptance we have so desperately been seeking. Trulia's Web Ranking Strategies Come Under Fire. Florida hones in on Trulia's shady link building and SEO strategies. Best of YOUmoz: The Rookie: First Thoughts of an SEO Beginner. LGTim offers a well-written glimpse into his new and growing career as an SEO and provides some takeaways he's noticed during his first few weeks. New events added to the Events Calendar: London SEO Drinks Night June 19 (today) at the Ship Tavern in Holburn, London, UK ExactTarget Seminar June 24 in Seattle, WA SMX Local and Mobile July 24-25 in San Francisco, CA Upcoming events: London SEO Drinks Night June 19 (today) at the Ship Tavern in Holburn, London, UK ExactTarget Seminar June 24 in Seattle, WA. Register now and receive $20 off the $99 registration fee using the following checkout code: R1T1JKR1 New additions to the SEOmoz Marketplace: Featured job postings: 2 SEO consultants and 4 search marketing managers are needed at Outrider (formerly 24/7 Real Media) in Sydney, Australia Web research intern needed for 10-15 hours a week at Brick Marketing in Medford, MA In-house PPC, in-house SEO, in-house analytics expert, for Ice.com in Montreal, QC, Canada Associate SEO engineer for SMG Search in Chicago, Boston, or Detroit Associate search director of global search for SMG Search in Detroit, MI (my old stompin' grounds! Go Wings!) Associate search director for SMG Search in New York, NY Associate SEO director and search program manager for SMG Search in Chicago, IL Search program manager for SMG Search in Miami, FL Web analytics manager, SEM manager, and online account executive for OMP Strategic in Washington, D.C. Featured companies: United States/North America: Brick Marketing in Medford, MA Pixelgroove in Massachusetts Bump Networks in Hawaii Sweeney Marketing in Reston, VA Prime Visibility in Melville, NY OMP Strategic in Washington, D.C. Podium Digital in Canada The Status Bureau in Vancouver, BC, Canada UK/Europe: e_make in Madrid, Spain MOGmedia in London, UK Bony Toad Online Marketing in Oxford, UK Firm SEO in the UK Carpe Diem Websites in Chester, UK Exevior Technologies in Cyprus be4you Design in Algarve, Portugal Asia: SEO4china.com in Shanghai, SH, China Featured resumes: Currently looking: Ryan Nagy is a web marketer who prides himself on staying on top of all cutting edge solutions, implementing them effectively, and watching as his clients climb to the top of the rankings in their industries. Happily employed: Deepak Jadev is an SEO and data entry operator at Alak-Malak Technologies. Angel Exevior is an SEO and the owner of Exevior Technologies in Cyprus. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Roundup Thursday for the Week of 6/15/08"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Roundup Thursday for the Week of 6/15/08"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}