{
  "url": "https://moz.com/blog/roundup-thursday-for-the-week-of-82408",
  "slug": "roundup-thursday-for-the-week-of-82408",
  "title": "Roundup Thursday for the Week of 8/24/08 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Stories, news, and other notable items from the past week:\n\nThree star links:\n \n\nOver on Graywolf's blog, Joe Hall talks about web 2.0 real estate innovators foreclosing some pain on old school real estate brands. Sites like Zillow and Trulia.com are having an open house of ass whooping, and Remax…",
  "content": "Roundup Thursday for the Week of 8/24/08 SEO Events By: Rebecca Kelley August 28, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley August 28, 2008 Roundup Thursday for the Week of 8/24/08 SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Stories, news, and other notable items from the past week: Three star links: Over on Graywolf's blog, Joe Hall talks about web 2.0 real estate innovators foreclosing some pain on old school real estate brands. Sites like Zillow and Trulia.com are having an open house of ass whooping, and Remax and Century 21 are invited! (If I think of any other real estate-related puns, I'll let you know.) The Google Webmaster Central blog answers your burning questions about 404s. I actually picture people being kept awake at night because they don't know how Google treats a 410 status code. That's sad. Speaking of Webmaster Central, Maile Ohye is interviewed by Eric Enge over at Stone Temple Consulting. Not as pretty as Maile but (probably) better looking in a beard, Rand is also interviewed over at MindValley Labs. The Blog Herald lists five ways you can imitate the 10 most popular blogs. The advice is pretty standard, but it's a nice refresher nonetheless. Google has a great map of the Island nation of Niue. ;) ...man, all of the resources it took to find Niue must have meant that the Big G had to scale back on their employees' food perks. And, of course, Google scaling back food perks must mean that they've lost their mojo. It's all related! All of it! My pals at 10e20 crafted up a helpful list that can help you determine if you're a Digg spammer. You might be a Digg spammer if your porch collapses and kills five dogs. A Digg spammer or a redneck. I forget which... Four star links: ClickTale has some interesting web habits of global web surfers. Fun fact: page load time has a tenfold effect on time spent on the site. That's pretty huge, so remember to make sure that your page loads as quickly as possible. Apparently images of pretty women can boost conversion rates. This may be news to you, but Rand's known this for years, which is why he uses pictures of pretty ladies on our site to fill in for me, Jane, Sarah, and Christine. In reality we all look like this. Don't tell anyone! We need more PRO signups! Small Business Trends has a list of 8 pricing strategies you can try out for your products and services. It's a good list of tips--it's not every day you receive advice on how to optimize your pricing structure. Ian Lurie analyzes each political party's convention website and crowns the RNC site the winner. Damnit... Rae Hoffman has a great post detailing how you can pimp your Wordpress theme for your users. Top Rank SEO has an archive of Google's Beijing Olympics logos--check them out if you missed any! Five star links: Oh, Matt McGee. You're so smart and useful. This time around, Matt hypothesizes what Google does with the click-thru data they acquire whenever you click on a link. Smart thinking as usual. ;) Audette Media came out with a free SEO diagnostics tool. It's a log file parsing script, and it allows you to quickly parse out key criteria from log files using simple commands. YOUmoz entries: Everything You Never Wanted to Know About Google Maps' Parameters. Pete Wailes breaks down Google Maps' parameters in crazy thorough detail. Collaborative Web Development: Early Input for Success. Andrew Mottaz talks about ProtoShare, a tool that enables real-time collaboration with clickable wire framing. How Accurate Are the Numbers in Google's Keyword Tool? HunterW tests Google's keyword tool estimates with his analytics data to see how Google's numbers compare with his metrics. An Intro to VSEO (Video Search Optimization). G-Forces looks into VSEO and tries out Tubemogul.com, a free service that provides \"a single point for deploying uploads to the top video sharing sites,\" plus analytics on the videos. Indians are Spammers: Really! Kamanashish talks about how everyone thinks that Indians are spammers and gives us a glimpse into what it's like to be an Indian SEO receiving work outsourced from the US, UK, and Australia. Typosquatting: Why Registering Your Common Misspell Domains is Essential. Robbothan reminds us to register misspelled variations of our domain names and shares some potential negative consequences of not doing so. Blinking (Blogging + Linking). Stuartpt shares some tips on how to acquire links to your blog, and he highlights the benefits of this particular link acquisition strategy. Best of YOUmoz: Getting Comparative Intelligence, Analytics, and Business Strategy the Sneaky Way. Robbothan shares a great business strategy/competitive intelligence tip with us: take advantage of the Freedom of Information Act and request information from your government about your industry (e.g., ask the Tourism Boards for travel data). SEO from a Client Perspective. RichF tells us how frustrated he gets when he works with an SEO company and they disregard how his website is handled and the time it takes to implement changes. This post is a great reminder to all of us consultants that sometimes our clients need extra time to implement the changes we recommend, so we shouldn't get impatient or have unrealistic expectations. Networking at the SEOmoz Expert Training Seminar. Sly-grrr attended our training seminar and gives some shout outs to all of the great people he met. New events added to the Events Calendar: Internet Marketing Conference September 11-12 at the Coast Plaza Hotel & Suites in Vancouver, BC, Canada Melbourne SEO Meetup September 13 at The Palms Food Court in Mt. Waverley/Syndal, Australia Scary SEO October 24-25 at the Hilton Deerfield Beach in Boca Raton, FL Upcoming events: Internet Marketing Conference September 11-12 at the Coast Plaza Hotel & Suites in Vancouver, BC, Canada Melbourne SEO Meetup September 13 at The Palms Food Court in Mt. Waverley/Syndal, Australia Webdagene September 18-19 in Norway Social Networking Conference at the Millennium Gloucester Hotel Kensington and Conference Center September 22-23 in London, UK PPC Summit September 25-26 in Los Angeles, CA New additions to the SEOmoz Marketplace: Featured job postings: Online marketing manager for GO Outdoors in Sheffield, UK SEO for Allsportspeople.com in Stockholm, Sweden Junior SEO analyst for Native Remedies in Boca Raton, FL Director of search marketing for Teleflora in Los Angeles, CA SEO specialist for SmartSearch Marketing in Boulder, CO Featured companies: United States/North America: VRoooom Technology in Columbus, GA Galaxy Spectrum in New York iSearch Media in San Francisco, CA Ask2link.com in Redwood City, CA Search & Social in Salt Lake City, UT Lure Interactive in Raleigh, NC Develop Daly in Dallas, TX UK/Europe: Studio Cappello in Padoue, Italy Asia: The SEO Traffic in Hyderabad, India Actv-tec in Ramat-Gan, Israel Australia: ThinkProspect in Australia Site Metrics in Australia Featured resumes: Happily employed: Patrick Daly in Dallas/Ft. Worth, TX, is a web designer, SEO, and \"Wordpress fanatic\" who works for Lead Maverick in Addison, TX. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Roundup Thursday for the Week of 8/24/08"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Roundup Thursday for the Week of 8/24/08"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}