{
  "url": "https://moz.com/blog/roundup-thursday-for-the-week-of-62908",
  "slug": "roundup-thursday-for-the-week-of-62908",
  "title": "Roundup Thursday for the Week of 6/29/08 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Stories, news, and other notable items from the past week:\n\nOne star link:\n\n    * Hacker News started a thread asking why hackers hate SEO. Most of the answers are frustrating, though some folks chime in to defend our industry.",
  "content": "Roundup Thursday for the Week of 6/29/08 SEO Events By: Rebecca Kelley July 3, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley July 3, 2008 Roundup Thursday for the Week of 6/29/08 SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Stories, news, and other notable items from the past week: One star link: Hacker News started a thread asking why hackers hate SEO. Most of the answers are frustrating, though some folks chime in to defend our industry. Three star links: The fellas at Nordic eMarketing went duck herding in SEOmoz t-shirts. Glad to see our shirts were put to good use! Aaron Wall thinks that the best way for Microsoft to compete with Google is to buy some big brands/sites that dominate Google's organic rankings, such as Expedia, Monster.com, WebMD, the NY Times, etc. Online purchases are becoming more diverse, according to an eMarketer survey. However, buyers still have privacy and security concerns, which is unsurprising. Search Engine Roundtable reports that Google thinks blocking countries outside of the US is considered cloaking and would be against Google's guidelines. However, they've since retracted their stance and now say that it would be geolocation. Stop messing with our heads, Google! Speaking of cloaking, Danny Sullivan weighs in on the \"white hat cloaking\" debate. Onward Search put together a handy checklist that can help prepare you for an SEO interview. I like how they added \"wash and dress\" to the list--it's a pretty important step, all right! Four star links: Blue Hat SEO teaches us how to break a captcha. How very James Bond...if James Bond were a computer geek. Google has announced that they've improved Flash indexing. Now if only they can improve Flashdance indexing... Five star links: Over at SEO Scoop, James Duthie examines the traffic quality between SEO and SMO and concluded that \"search engines generate superior quality traffic.\" It's important to keep in mind that while social media marketing is still a great tactic to leverage, it's not a replacement for natural search engine traffic. YOUmoz entries: Advanced White Hat SEO is All About Deception. Darren Slatten writes an open letter to Matt Cutts and expresses his frustration over the lack of actual advanced white hat SEO tactics. SEO Defense: 8 Habits to Protect Your Rankings. ElegantSEO shares his daily routine to help keep his SEO strategy \"clean, solid, and less vulnerable to questionable competitor activities.\" Metrics That the CEO Needs to Know. Stuart McIlreavy shares three key metrics you can tell your CEO without bogging him/her down with excessive details and data. The Unofficial Google Widget Bait Guidelines. Darren Slatten gives us an introduction to widgets and explains the difference between white hat, legit widgets and questionable or spammy widgets. Understanding Google AdWords Quality Score. Matthew John authors a comprehensive post about the AdWords Quality Score and what metrics affect the score. Does Pownce Deserve a Second Look? KatFrench shares with us the benefits of Pownce and why she likes it better than Twitter. Crossing the PR4 Threshold. Petrosianii gives his opinion on how to increase a page's PR from 4 to 5. SEO and the Semantic Web. John Clarke Mills opines that the semantic web will never make SEO obsolete. The Short Tail of Search. Scotie discusses keyword research and how to identify long tail search terms. Best of YOUmoz: Finding Your Broad Match Key Phrases. Kate (Mary Anne) writes a great post to help us identify broad match search terms and phrases. New events added to the Events Calendar: SEM for SMB July 16-17 in Austin, TX The SEOmoz Expert Training Seminar August 19-20 in Seattle, WA SMX London November 4-5 in London, UK Upcoming events: Mobile Social Networks & UGC July 2-4 at the Moevenpic Hotel in Amsterdam, Netherlands Social Networking Conference July 10-11 at the Mission Bay Conference Center in San Francisco, CA SEM for SMB July 16-17 at the Hilton Austin Downtown in Austin, TX SMX Local & Mobile July 24-25 in San Francisco, CA New additions to the SEOmoz Marketplace: Featured job postings: Online marketing/PPC executive for Altogether Digital in London, UK Web marketing programs manager for I-ology in Scottsdale, AZ SEM analyst for Cool Site of the Day SEO director for Vividseats.com in Chicago, IL PPC marketing specialist for Stone Street Capital Bethesda, MD Featured companies: United States/North America: Brafton Custom News Feeds in Boston, MA Louisville Web Design in Louisville, KY SEO Marketing Consultants in Valrico, FL Cool Site of the Day in Chappaqua, NY UK/Europe: Siti Ottimizzati in Vicenza, Italy Overalia in Donostia - San Sebastian, Guipu, Spain Ebizproduction in France, Jordan, Lebanon, Syria, Tunisia, and the United Arab Emirates Australia: JaeWeb Internet Services in Sydney, Australia SEO Services in Australia Featured resumes: Currently looking: Austin Wisner is an SEO and PPC marketer who also has extensive writing experience. David Arrington is the founder and CEO of Blue Fusion Marketing and has expertise in running a successful online marketing company. Joe Williams is seeking an organic SEO position with an SEO/marketing firm or long-term contract work with an organization interested in moving to the top of major search engines. He has experience with building SEO-optimized websites and integrating e-commerce packages, as well as SEO knowledge. Babul Paul is an SEO/SEM manager who is looking to leverage his experience of Internet marketing, web development, and email marketing. Happily employed: Samual is an SEM expert with over two years' experience in Internet marketing and SEO. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Roundup Thursday for the Week of 6/29/08"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Roundup Thursday for the Week of 6/29/08"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}