{
  "url": "https://moz.com/blog/roundup-thursday-is-good-for-what-ails-ya",
  "slug": "roundup-thursday-is-good-for-what-ails-ya",
  "title": "Roundup Thursday is Good for What Ails Ya - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "And now, to finish off your Thursday, here's a roundup of various news tidbits that I found interesting:\n\n    Scoreboard Media Group has an encouraging post called \"If At First You Don't Succeed, Quit!\" Though it's rife with baseball metaphors, Brian Provost makes a fantastic point--that some...",
  "content": "Roundup Thursday is Good for What Ails Ya SEO Events By: Rebecca Kelley May 17, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley May 17, 2007 Roundup Thursday is Good for What Ails Ya SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. And now, to finish off your Thursday, here's a roundup of various news tidbits that I found interesting: Scoreboard Media Group has an encouraging post called \"If At First You Don't Succeed, Quit!\" Though it's rife with baseball metaphors, Brian Provost makes a fantastic point--that sometimes the smartest thing to do is to quit a project. There's nothing worse than running a venture into the ground for months and refusing to acknowledge that maybe it wasn't meant to be. Problogger wrote a little gem of a post titled \"How Not to Become a Grumpy Old Blogger.\" It's easy to believe that people love to read about your rants and bitchings, but you run the risk of sounding like an unhappy, unlikeable one-trick pony. Thicken up that skin! My advice is to grow up with two older brothers who coined affectionate nicknames for you (like Turd) and pounced on every insecurity you made the mistake of exposing. It works wonders, and the requisite therapy as an adult is totally worth it (Hi Dr. Gladstein! I'm sharing my feelings!). My mother land has been quite newsworthy lately. First Barry reports over at Search Engine Land that by September 1st, Koreans will be required to enter their name and resident registration number in order to view unfiltered \"adult\" search queries. What if you're a teenager in Korea and you want to look up information about safe sex? Will that get caught by the filter? I'm a bit worried about what Korea will determine to be \"adult in nature.\" On a more positive note, test trains crossed between North and South Korea for the first time in 56 years. For some reason I have \"Why Can't We Be Friends\" stuck in my head now... Ciaran pointed out on YOUmoz that journalist Alan Johnston (whose birthday is today) may have been kidnapped in Gaza, where he was reporting. The BBC is urging bloggers to add a badge to their site in order to spread awareness of his disappearance. SMX Advanced in Seattle is only 17 days away, so buy your pass if you haven't already! Rand, of course, will be speaking on a social media marketing panel, Jane and I will provide extensive coverage of the conference, and Matt, Jeff, and Scott will be waiting in the wings to crash any event parties in the evenings. Congratulations to the five finalists in Andy Beal's SEM Scholarship competition, Keri Morgret and Cavan Moon, who took the grand prize and the runner's up honors in Bruce Clay's SEO Charity Contest, and Patrick Sexton, who won a free pass to SMX from Aaron Wall. Man, everyone's having contest nowadays. SEOmoz should have one. How about whoever designs the most kick-ass SEOmoz t-shirt gets to spend a day with our delightful programmers, Matt and Jeff, as they tell you why your design sucks and doesn't incorporate enough vectors and swirls. Dave Rigotti from Virtual Marketing Blog has an interview with Rand, so check that out. If you can think of any other stories that you'd like to share, then feel free to do so in the comments. In the meantime, look forward to my crappy Whiteboard Friday video tomorrow, where I spend zero minutes talking about SEO and a few minutes making fun of Rand Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Roundup Thursday is Good for What Ails Ya"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Roundup Thursday is Good for What Ails Ya"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}