{
  "url": "https://moz.com/blog/sales-research-with-true-competitor",
  "slug": "sales-research-with-true-competitor",
  "title": "10-Minute Sales Research with True Competitor - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Last month, Moz launched our True Competitor beta to help you reveal your search rivals. Today, Dr. Pete shows you how to use this new tool to quickly understand your brand’s competitive landscape when researching a prospect.",
  "content": "10-Minute Sales Research with True Competitor Competitive Research | Moz Tools By: Dr. Peter J. Meyers October 18, 2021 Table of Contents Copied! By: Dr. Peter J. Meyers October 18, 2021 10-Minute Sales Research with True Competitor Competitive Research | Moz Tools Your sales team has just asked you to hop on a call in 30 minutes with a new prospect, ClowdFyre. Not wanting to sound like an idiot, you pull up ClowdFyre.com and see the following: “ClowdFyre leverages the cloud to ignite blockchain synergies.” Cool, cool… hold on, there’s some sort of diagram. Surely, this will give you some insights: Or maybe not. I’m exaggerating, of course, but having lived through Web 1.0, Web 2.0, and whatever it is we’re doing now, sometimes this feels a little too close to the truth. Maybe the simpler truth is that we’re just running out of names and the world is changing too fast. So, how can you hope to quickly figure out what ClowdFyre is all about and sound like you did your homework? I’m going to present two real-world examples of how you can use Moz’s True Competitor research tool to solve this problem in under 10 minutes. Case #1: From Xero to hero Xero is a good example of a perfectly nice company with a perfectly uninformative name. Their tagline is: “Accounting software to do your to-do.” Okay, I’m not exactly sure what that means, but I understand what accounting software is. Let’s see what I can learn from their competitive landscape. I plug them into True Competitor... …and quickly get back something like this (edited down to the top 10): For reference, we’ve got the Domain Authority (DA) of Xero.com and the DA, keyword Overlap, and Rivalry (a Moz metric that balances three factors, including DA and Overlap) of each of the top 10 organic search competitors. I can quickly spot a couple of things: FreshBooks and QuickBooks immediately stand out as familiar brands in the accounting software space, and FreshBooks is in a very similar DA range. These are very likely product competitors and give us a talking point during the call. In addition, note these competitors: These are content competitors that have significant overlap with Xero and are competing for organic traffic. Our prospect may not think of NerdWallet (just to pick one) as a competitor, but their content could provide key insights into questions potential buyers are asking. If any are unfamiliar, I can click on them to visit the site. For example, I see that Wave (waveapps.com) is an up-and-coming competitor in the space. I could even feed a couple of these competitors back into True Competitor to paint a more complex picture. In just a few minutes, I’ve got a sense of Xero’s product competitors, content competitors, and a couple of talking points. At the very least, I hopefully won’t sound like an idiot. Case #2: A Missguided example You might not know it from the name, but Missguided is a fashion brand focused on Gen-Z and Millennial women. Let’s put them into True Competitor and see what we can learn. I’ll skip right to the insights (note that MissguidedUS.com has a DA of 64). I can see right away that Missguided is up against some big players in the retail space, including high-end department stores and Amazon. These competitors are aspirational and might not be a realistic focus, but this is a great topic for conversation. Who do they aspire to compete against and how do they face the reality of being in a market with these big players? Let’s look at a somewhat different set of competitors: I don’t know anything about these sites/brands, but my immediate sense is that they’re smaller brands (a sense that’s bolstered by their DA scores) and are trying to evoke an edgier vibe. That raises an interesting talking point — who are the most relevant competitors in this target market of Millennial and Gen-Z women, and what unique challenges does that market pose? With a couple of clicks through to their sites (and less than a minute of work), I can also see that Aritzia and Tobi seem to be targeting a similar demographic and are likely direct competitors (they’re also much more realistic competitors than Macy’s or Amazon). Glancing at my watch, I’ve still got a couple of minutes before the meeting, so let’s try something fun (well, I think it’s fun, anyway) — let’s click on those two “edgy” brands and use the [+ Analyze Competitors] feature. I’ll request the full keyword intersect… … and I can immediately get a quick view of what keywords these sites share: Obviously, five keywords (or even 500) is just a piece of the puzzle, but in a few minutes I’ve gathered enough pieces to have an intelligent conversation and help seal the deal. Data-assisted human intelligence From a product perspective, I believe that the most powerful thing we can do is to assist your human intelligence and help drive insights. Tools like True Competitor are never going to replace your own (or the client’s) industry knowledge, but I hope that — as they continue to evolve — we can empower faster and better decisions that help you do what you’re best at.Ultimately, you’re not going to be able to spend hours researching every sales call — even if you want to. But by using True Competitor, you can make the little time you do have more productive. Start your research with True Competitor I’d love to hear from anyone who puts this to work in their sales pitches (hit me up on Twitter @dr_pete) or about any ways that research tools help make your SEO prospecting easier. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "10-Minute Sales Research with True Competitor"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "10-Minute Sales Research with True Competitor"
    },
    {
      "level": "H2",
      "text": "Case #1: From Xero to hero"
    },
    {
      "level": "H2",
      "text": "Case #2: A Missguided example"
    },
    {
      "level": "H2",
      "text": "Data-assisted human intelligence"
    },
    {
      "level": "H2",
      "text": "Try our SEO Competitive Analysis tool"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Actually Be Better Than Your Competitors in the Eyes of Choosy Customers"
    },
    {
      "level": "H3",
      "text": "SEO Gap Analysis — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Daily SEO Fix: Competitive Link Research"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}