{
  "url": "https://moz.com/blog/sample-seo-contract",
  "slug": "sample-seo-contract",
  "title": "Sample SEO Contract - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "DazzlinDonna has a pre-made SEO contract that might be useful for those who run smaller operations and need a hand getting started in contract design. It's by no means over-arching, but it's an excellent place to start and it's free. She also has a good, basic description of the specific tasks that…",
  "content": "Sample SEO Contract Public Relations By: Rand Fishkin August 23, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 23, 2005 Sample SEO Contract Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. DazzlinDonna has a pre-made SEO contract that might be useful for those who run smaller operations and need a hand getting started in contract design. It's by no means over-arching, but it's an excellent place to start and it's free. She also has a good, basic description of the specific tasks that fit into SEO work: (1.1). Keyword research and analysis for a maximum of (n) keywords or phrases. (1.2). Competitive analysis for main keywords/keyphrases. (1.3). Analysis of site architecture and linking structure. (1.4). Analysis of HTML and page design structure. (1.5). Recommendations for 1.1 through 1.4, above, as well as for necessary modifications to essential page text elements for achieving satisfactory search engine placement. (1.6). Recommendations for improvement of page titles and meta tags for (n) site pages. (1.7). Hand submission of web site to major search engines and/or directories. (1.8). Analysis and recommendations for external links to site. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Sample SEO Contract"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Sample SEO Contract"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}