{
  "url": "https://moz.com/blog/scalable-link-building-using-social-media-whiteboard-friday",
  "slug": "scalable-link-building-using-social-media-whiteboard-friday",
  "title": "Scalable Link Building Using Social Media - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This week we are thrilled to have Mike King join us again for another amazing Whiteboard Friday. As marketers and SEOs we all have asked our selves at one time or another how we can use Social Media to build links.  Mike lays out a very scalable way to build links for just about any business.",
  "content": "Scalable Link Building Using Social Media Whiteboard Friday By: Casey Henry November 10, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Casey Henry November 10, 2011 Scalable Link Building Using Social Media Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This week we are thrilled to have Mike King join us again for another amazing Whiteboard Friday. As marketers and SEOs we all have asked our selves at one time or another how we can use Social Media to build links. Mike lays out a very scalable way to build links for just about any business. Enjoy and share your thoughts below in the comments. Video Transcription Greetings and salutations, SEOmoz fans. My name is Michael King, and we're going to talk about scalable link building using social media. Follow me on Twitter, iPullRank. So the first thing you want to do is identify your audience, and you're going to use industry demographic data from sources like comScore, QuantCast, and Compete. These are paid tools, but they do give you a lot of stuff for free. So just play around with them until you can figure out what you can get. From there, you also want to use social listening tools. There are a couple of free ones, and there are some paid ones as well. So, the free ones are Social Mention and Amplicate. Basically, what you are going to do is you put in a keyword, and it's going to give you back all the people talking about that keyword. You can use that to figure out who your audience is because what we're going to ultimately do is get to the personas. I'm going to get to that in a second. There are some paid tools, such as Radian6, Scout Labs, and Alterian SM2. They're really extensive, but they're also kind of expensive. So you may not be able to use those. If you can't, you can get a lot of stuff out of Social Mention and Amplicate. With all that information, what we're going to do is create four core groups, and these are our personas. They're a representation of the four groups of people in your audience. So, in this case, we have Music Moms, Happy Hobbyists, Raging Rock Stars, and Involved Instructors. So what we've identified, we're talking about a guitar company and these are their audience. What we have identified are these four groups of people. Music Moms are people that typically have children that are Happy Hobbyists. They're the hip mom who wants to buy the guitar for their son. They're trying to figure out which guitar is best. Then, you have the Happy Hobbyists. These are the people that make the most content in this space. They've learned all of these cool things from their Involved Instructors, and they're at home on YouTube practicing, showing you their favorite song and they're playing it. They're typically, like I said, learning how to play an instrument. Raging Rock Stars are typically independent musicians or even celebrity musicians. We would reach out to these people as influencers and for guest posts, things of that nature. Involved Instructors are the people that are teaching your Happy Hobbyists how to play an instrument, and they're also involved in the conversation, talking about which guitars are the best, which piano should I get my Happy Hobbyist student to buy. Once we have these people, we figured out what words go with these people, and we can go to Follower Wonk with these keywords and identify them. In the case of Music Moms, you can type in \"music mom\" and you get a whole list of moms that are into music and may have children that are Happy Hobbyists. Happy Hobbyists, you could type in \"guitar student,\" and you're going to get a whole bunch of kids that are guitar students. So, what you want to do is use that in concert with the Scraper Tool for Chrome. It's a plug-in, and you can right click one of the names, and it will give you all these people in Google Docs so then you can export them to Excel or whatever it is. From there, what you want to do is use Knowem.com, and you can put in people's user names and see where they are on the different places throughout social media, because most people use the same user name for all their different social media profiles. For example, Rand Fish, if you put it in Knowem, you see that he has YouTube, SlideShare, MySpace, Squidoo, Foursquare. You can look at all of these things together and figure out what that person is into and create a mental model and use that for context when you contact them. From there, what you also want to do is create an industry specific persona for yourself. The reason you want to do that is because, let's say you did your link building through Twitter using your SEO Twitter. Then someone came back to your profile and they're looking at all of this stuff about link building. They're not going to believe you. They know that you're just trying to get a link. It's the same thing as if you were a pickup artist and then you gave your girlfriend a copy of Neil Strauss' book. It's not going to work. No, don't do that. So, create a persona for yourself with all types of information and posts and content about your industry, and that way when people see that, they're like, \"Oh, this person is an authority. They're genuine.\" Then, what you want to do is make sure that your messaging stands out. If you're going with email, make sure your subjects are short. Make sure your subjects are natural. Don't use link requests in your subject because nobody will ever open it. The whole point of making these messages stand out in the inbox is that they actually open the message. So, you want to send email as a person, not as a company, not as a web theme. You want to send it as an actual person. Then you also want to include a natural citation because that's what shows up on the bar in Gmail, and they're going to get that preview. If it's like \"Dear Sir or Madam,\" they're not going to open it. Now, Twitter is actually better for outreach link building because people are expecting to be hit up with inane conversation and unsolicited conversation. What you want to make sure you do is converse with context. If they've mention guitars, respond to their question if they had a question or say, \"Hey, I saw something that goes with what you're talking about.\" Don't spam them. Don't just send them a link and be like, \"Hey, here's my link. Link to me.\" No, it doesn't work. Nobody likes spam. You don't like spam. Escalate quickly. You want to also, as soon as you're in that conversation say, \"Hey, follow me so that I can DM you.\" Then you can take that conversation offline. Then you can get the email easily, stuff like that. You just want to be able to talk to them privately. Then, you need to continually participate. That goes back to this point of create an industry specific persona because that way, if you're participating, you're constantly putting up content related to that thing, and people are like, \"Hey, I'm going to follow this guy.\" Also, write relevant hashtags. So if it's something about music or something about guitars, post your content, your information with those hashtags, and people will find you, and then it's easier to develop that rapport and then get a link. From there, you also want to continue to offer value. When I say offer value, I don't mean necessarily give them an incentive. If you have something that's entertaining, that they might be into, send them a funny YouTube video. Or if you have a resource that they may not know about, send them that. If it's an infographic, whatever it is. It doesn't even have to be something that's on your site, just something that's relevant to the topic. Send it to them so that you're a valuable resource to them, somebody they might follow on Twitter. Then, if you do have incentives, you want to dangle the carrot. You don't want to just be like, \"Hey, we have free guitars. I can give you a guitar for a link.\" No, it doesn't work like that. What you want to do is create some sort of contest or campaign around that and invite them to join it. For example, let's says I have 50 guitars to give away. I would just give them away to 50 people. What I do is I set up a contest where they write a blog post about guitars and link back to our site in question. Then, that way, it becomes a one-to-many thing rather than a one-to-one thing. When it's one-to-one, you get one link per guitar. I don't think that's really worthwhile. But if you can get 100 links per guitar, then it's worth a lot more. Then, once you've actually closed a link prospect, maintain the rapport, and the best way to do that is just follow them on Twitter with a private list or make a link building circle on Google+. Make it private and just hit them up every once in a while just to maintain that rapport and send them some new content or just keep it going so when you have something else that you want to get a link from, you can easily just contact them, or they may even naturally just link to you again because they've seen that you continue to make awesome content. So, with that, that's scalable link building using social media. My name is Michael King. Thank you again. Please follow me on Twitter, iPullRank. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Scalable Link Building Using Social Media"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Scalable Link Building Using Social Media"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Casey Henry\n          \n            Casey Henry\n          \n            Casey Henry"
}