{
  "url": "https://moz.com/blog/scary-sources-of-information-and-by-scary-i-mean-scary-good",
  "slug": "scary-sources-of-information-and-by-scary-i-mean-scary-good",
  "title": "Scary Sources of Information (and by Scary, I mean Scary Good) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I had a chat late last night with Gary Price of ResourceShelf. He shared some sites that provide information that will make your spine shiver and your blood turn cold. Just look at what's available:\nFirst off, there's the relatively innocuous, but fun, FlightAware, which enables you to track the…",
  "content": "Scary Sources of Information (and by Scary, I mean Scary Good) Mobile SEO By: Rand Fishkin March 29, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 29, 2006 Scary Sources of Information (and by Scary, I mean Scary Good) Mobile SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I had a chat late last night with Gary Price of ResourceShelf. He shared some sites that provide information that will make your spine shiver and your blood turn cold. Just look at what's available: First off, there's the relatively innocuous, but fun, FlightAware, which enables you to track the comings and goings of every flight in the United States (Canada and the rest of the world aren't available). For flight junkies (of which there are more than a few); this is essential to the addiction. Next, he showed me how there's no longer a need to sit in the car, late at night, ala Mr. Incredible & Frozone (you've all seen that film, right?) and listen to the police scanner in the hopes of picking up a crime. At least in Seattle, where I live, you can get it delivered in instand updates over the web. You can even track historical crimes and see what the original response and situation was presumed to be. The service is Real Time 911 Dispatch and you can watch a daily chart of events in real time. I also discovered just how deep you could drill into a human beings existence with services like SearchSystems.net, which keeps track of public records and allows direct, free searching of those records (and a close inpection). The US Census service's search tool may seem a bit obvious, but it's an impressive system. You can search by name or address and get a massive amount of information about a person, property or region. Gary was able to tell me exactly the demographic and age range break down of my apartment building, including the single Alaskan native neighbor who's a friend of mine. For demographic detail, MelissaData is also particularly amazing. They were able to tell me all sorts of information about our office building, including a demographic profile of the inhabitants according to the prizm codes. Apparently, we're a very multi-cultural group with a high achievement potential. For the browser plug-in side, Gary showed me Loki, which rellies on wifi calculations to pinpoint your location and show you geographically close restaurants, retail shops or other locations. I tried on my home machine and the location was way off, but Gary said it works great for Wifi connections on laptops (which is when you'd be most likely to want that info). And last, but probably of greatest interest to the SEO crowd, is the super-scary whois.sc service. Using it, Gary was able to tell me every domain name I had registered over the past few years, their IP addresses, hosts, etc. He even receives updates whenever someone registers a new site with certain terms in the name. If you're worried about Alexa sniffing out your network, get ready to be truly spooked by this guy. There can be little doubt that the search engines have even more data than this, and they're putting it all to good use. Well, that's enough information sourcing for one day. I'm looking forward to talking to Gary again soon. If you're interested in learning more about him, he's been interviewed on Library Journal and had some cool stuff to say there, too (particularly about his new job with Ask). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Scary Sources of Information (and by Scary, I mean Scary Good)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Scary Sources of Information (and by Scary, I mean Scary Good)"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too"
    },
    {
      "level": "H3",
      "text": "Internal Linking for Mobile-First & Mobile-Only Indexing"
    },
    {
      "level": "H3",
      "text": "All About Fraggles (Fragment + Handle)"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}