{
  "url": "https://moz.com/blog/schools-in-session",
  "slug": "schools-in-session",
  "title": "School's in Session at Moz Academy - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Enjoy a ton of terrific instructors at Moz Academy for free, and in the process soak up so much SEO knowledge that you'll be able to spread the love and teach others!",
  "content": "School's in Session at Moz Academy Technical SEO | Moz Tools | SEO Basics By: Nick Sayers September 10, 2014 Table of Contents Copied! By: Nick Sayers September 10, 2014 School's in Session at Moz Academy Technical SEO | Moz Tools | SEO Basics The onset of fall sharpens the air. Kids laboriously lug stacks of books and binders to class. Teachers puzzle over their lesson plans for the year. Lockers that were once empty now overflow with paper, and quiet hallways fill with the chatter of eager minds. School is finally back in session. In the spirit of fall and the start of school, we think it's a perfect time to open up Moz Academy to our community! If you've never heard of Moz Academy, let me give you an earful! At Moz, we really want people to be awesome marketers so they can use our products in fun ways and make the Internet way cooler, with less spam and garbage content. We've got a ton of terrific instructors at Moz, but Moz Academy has so much SEO knowledge that it'll make teachers out of all of you! Over the past year we've added more than 30 videos to Moz Academy. One of my favorite lesson plans shows off how you can use Moz Pro to help with your day-to-day marketing. We're also proud to offer a comprehensive Local SEO section that we built with our good friends over at LocalU. To give you a sense for what we've got, we wanted to show you some of our favorite Academy lectures! First up: Listen to Steve Martin look-alike Cyrus Shepard tell you how to size up your competition in Moz Pro—like a pro. Next, listen to the mustached master of SEO, Rand Fishkin, instruct us on how to correctly implement redirects. If you're into advanced filtering in Google Analytics, listen to Tim Resnik's explanation of how to segment your search traffic into verticals by pulling a parameter from the URLs in the SERPS. Our own Jen \"Don't call me J-LO\" Lopez, gives us a crash course on measuring your social media efforts. Finally, Mike Ramsey from Nifty Marketing can help you get a handle on creating local content. Now that school is back in session we hope you're excited to start learning again. Please enjoy Moz Academy and share the lessons with folks learning SEO or trying to get a nice refresh. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "School's in Session at Moz Academy"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "School's in Session at Moz Academy"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Nick Sayers\n          \n            Nick Sayers\n          \n            Nick Sayers"
}