{
  "url": "https://moz.com/blog/screen-resolution-data",
  "slug": "screen-resolution-data",
  "title": "Screen Resolution Data - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Just a short post to note that OneStat has released figures about worldwide and country specific screen resolutions of Internet users. Here's the global averages:\n\n\n    \n        \n            1.\n            1024 x 768...",
  "content": "Screen Resolution Data Design By: Rand Fishkin June 25, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin June 25, 2006 Screen Resolution Data Design The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Just a short post to note that OneStat has released figures about worldwide and country specific screen resolutions of Internet users. Here's the global averages: 1. 1024 x 768 56.15% 2. 1280 x 1024 15.79% 3. 800 x 600 12.04% 4. 1280 x 800 4.09% 5. 1152 x 864 3.90% And data for just the US: 1. 1024 x 768 52.22% 2. 800 x 600 13.81% 3. 1280 x 1024 16.91% 4. 1280 x 800 5.05% 5. 1152 x 864 3.63% In my opinion, it's still advisable to design to 760pixels wide (for fixed width layouts), as 12% of the world and 14% of the US are on these resolutions. Once those numbers drop below 5%, it will be more practical for websites to feature fixed layouts tailored to 1024 pixels. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Screen Resolution Data"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Screen Resolution Data"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}