{
  "url": "https://moz.com/blog/screw-the-sandbox-the-jim-boykin-way",
  "slug": "screw-the-sandbox-the-jim-boykin-way",
  "title": "Screw the Sandbox the Jim Boykin Way - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Google has been asking for this. SEO has a new angle and Jim (of Webuilpages) is the pioneer. No longer is domain registration part of smart SEO - it's all about buying an old domain and changing as little whois info as possible - preferrably just getting the login info for the registrar.\nJim's got…",
  "content": "Screw the Sandbox the Jim Boykin Way Blogging By: Rand Fishkin November 9, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 9, 2005 Screw the Sandbox the Jim Boykin Way Blogging The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Google has been asking for this. SEO has a new angle and Jim (of Webuilpages) is the pioneer. No longer is domain registration part of smart SEO - it's all about buying an old domain and changing as little whois info as possible - preferrably just getting the login info for the registrar. Jim's got a post on the buying of old sites and, in typical brilliant business fashion, offers his services to find old sites in your niche for a paltry $500 here. Guess what I'm doing next time we have a new client... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Screw the Sandbox the Jim Boykin Way"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Screw the Sandbox the Jim Boykin Way"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}