{
  "url": "https://moz.com/blog/sculpting-with-nofollow-works-pretty-darn-well",
  "slug": "sculpting-with-nofollow-works-pretty-darn-well",
  "title": "Sculpting with Nofollow Works Pretty Darn Well - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Back in mid-December, SEOmoz made a number of changes to our use of the rel=\"nofollow\" tag on the internal link structure of this site. We nofollowed dozens of links on many of our template pages to help control the flow of link juice through to our more important pages - the content in the Blog,…",
  "content": "Sculpting with Nofollow Works Pretty Darn Well Moz News By: Rand Fishkin January 28, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 28, 2008 Sculpting with Nofollow Works Pretty Darn Well Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Back in mid-December, SEOmoz made a number of changes to our use of the rel=\"nofollow\" tag on the internal link structure of this site. We nofollowed dozens of links on many of our template pages to help control the flow of link juice through to our more important pages - the content in the Blog, YOUmoz, Marketplace, and Articles. SEOmoz's Blog with Nofollow Links Highlighted As you can see, we used quite a few nofollows to help draw juice away from unnecessary pages. The results? _ A resounding success! While you can see that search referrals were particularly slow at the end of December and into January (as was overall site traffic), once the holidays passed, the search traffic came rolling in. The bump is approximately 20%, quite a substantial rise from the addition of a tag on some less important links. While others have certainly reported seeing success with the use of nofollow to control the flow of link juice, I figured this quick example might help serve as a catalyst for anyone who's skeptical about the potential value. BTW - I do certainly realize that many other factors could have affected increased search referral numbers, and thus this test isn't entirely scientific. However, our search traffic going all the way back to May of 2007 was increasing at an infintessimal rate (Weeks 20, 21, and 22 of 2007 [May-June] had an average of 12,000 search referrals) and this is the only structural change we've made since that time. Thus, don't take this data as gospel truth, but rather as another nudge that nofollow sculpting can have high potential rewards. p.s. We have done used this same thing on projects for clients with mixed results - several have seen increases of 20-25% in 2-4 weeks, but one of our clients stayed virtually level after implementation. p.p.s. For more on how sculpting PageRank with nofollow works and why it can be effective, see Si's excellent post on the subject . Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Sculpting with Nofollow Works Pretty Darn Well"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Sculpting with Nofollow Works Pretty Darn Well"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}