{
  "url": "https://moz.com/blog/seattles-wong-doody-needs-web-site-help",
  "slug": "seattles-wong-doody-needs-web-site-help",
  "title": "Seattle's Wong Doody needs Web Site Help - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I just joined the Ad Club of Seattle in the hopes of meeting some good people I can recruit away from the tradtional ad business into our nefarious circle (insert devious grin icon). As I was checking out u...",
  "content": "Seattle's Wong Doody needs Web Site Help Mobile SEO By: Rand Fishkin October 18, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 18, 2005 Seattle's Wong Doody needs Web Site Help Mobile SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I just joined the Ad Club of Seattle in the hopes of meeting some good people I can recruit away from the tradtional ad business into our nefarious circle (insert devious grin icon). As I was checking out upcoming events, I noted a seminar next week with Seattle ad executives Tracy Wong & Pat Doody. Pat & Tracy own the well respected local ad agency Wong Doody, whose work had been an inspiration to me back in my graphic and web design days (in the late '90's). Upon taking a visit over to their website, I was shocked and dismayed to find it in tatters. Not only is the front splash page useless; it leads only to a second splash page offering entry to either their public relations or marketing and advertising (brilliantly put on separate domains to help spread link pop). Both of these sites are poorly designed and offer no real content... I hope that Pat & Tracy are doing a better job for their clients then they are for themselves in this arena. With a client list like this, they must be doing something right... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Seattle's Wong Doody needs Web Site Help"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Seattle's Wong Doody needs Web Site Help"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too"
    },
    {
      "level": "H3",
      "text": "Internal Linking for Mobile-First & Mobile-Only Indexing"
    },
    {
      "level": "H3",
      "text": "All About Fraggles (Fragment + Handle)"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}