{
  "url": "https://moz.com/blog/secondary-data-the-information-your-adwords-account-is-missing",
  "slug": "secondary-data-the-information-your-adwords-account-is-missing",
  "title": "Secondary Data: The Information Your AdWords Account is Missing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The use of Secondary Data in an AdWords campaign can lead to a significant improvement in outcomes for the client. The PPC manager can use this data to make informed decisions about where to take an AdWords campaign.",
  "content": "Secondary Data: The Information Your AdWords Account is Missing Paid Search Marketing (PPC) By: Ashleigh Betvardeh October 15, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Ashleigh Betvardeh October 15, 2013 Secondary Data: The Information Your AdWords Account is Missing Paid Search Marketing (PPC) This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. The use of Secondary Data in an AdWords campaign can lead to a significant improvement in outcomes for the client. The PPC manager can use this data to make informed decisions about where to take an AdWords campaign. As Campaign Statistician with Click Click Media, Ashleigh Betvardeh has been able to combine knowledge gained from a Master’s Degree in Marketing, a Social Science degree and experience working in market research to realise the importance of utilising secondary data in her campaigns. Here she explains what it is and how, by integrating it into a campaign, you can improve the effectiveness of your AdWords campaigns. When looking at research, the process of gathering data is one of the most important steps of any research process. Think about it: If the data you have gathered is unreliable, insufficient or flawed, then your analysis will be incorrect and your decision/s based on the data will be unsustained and can lead you to make bad choices. If we are only to look at your data from your AdWords account, then you are looking at half the story. But by using secondary data effectively, it can lead to measuring the right variables and making evidence-based recommendations for your clients. This article will show you the missing half of your AdWords account – that being secondary data. In this article you will: Learn why data collection is important Understand what and how secondary data can be applied to your AdWords account Learn to evaluate secondary data and; Find examples of secondary sources that can be used (beyond Google Analytics) Defining Primary Data A researcher would define primary data is that is obtained first-hand. This means you are involved in collecting the data. When developing an AdWords account, as PPC managers, we chose the keywords, create the adverts and set the landing page, thus we have control over the type of data collected by our AdWords accounts because we develop the campaign. Undeniably, we are limited to the amount of data we gather due to our client’s budget. In saying this, we can adapt the definition from primary data, and view our AdWords account as primary data because we are involved in how the data is being collecting. As PPC managers, we look at the variables from our AdWords campaigns and attempt to make decision based on this data, and forget that there are often other sources with information that we can use to improve the chance of success of an account – this is where secondary data comes into the picture. Defining Secondary Data Secondary data is defined as any source collected that does not involve the researcher – this means the research has been already collected for you. For example reading journals, market research articles and analysing your client’s website. These factors all affect your AdWords account, especially your client’s landing page, and whether it is optimised for conversions. “By expanding on the differences between primary and secondary data, we can view our AdWords data as primary, and every other source used as secondary; which is can be viewed below (Exhibit 1A)” Secondary Data can Make or Break your AdWords Account When looking at the data on your AdWords account, you could have set up your account structure correctly, researched the keywords thoughtfully, and made completing adverts using the client’s unique selling proposition, but your account may not being as good as you thought. Why? This is where secondary information can be utilised. You can research your client’s product or services. During this time you may develop a research question, which you can test using A/B split testing to monitor your results, you can see whether or not the results were positive for your AdWords account. By integrating findings from secondary data, it is possible to create campaigns that are responsive to seasonal changes, are appropriate to customer demographics and optimise keyword selection. “Secondary data can reduce costs and improve outcomes for your client.” Secondary data can be used: To ensure your AdWords account will be able to advertise in another country (is there a market for your client in another country?). To keep up to date with technological advances (Secondary data can tell you the latest trends, especially when it comes to technology). To respond to seasonal or economic changes (Are you focusing on the right product for each season?). To understand trends that may affect your client in different ways (Keeping up to date with information relating to your client’s products). To understand the reasoning behind impression rates and assess campaigns from the customer’s viewpoint (Research what your client’s customers are saying about their product or service). To put the PPC marketer in the information stage of research. (Research what benefits will appeal to the client’s market and go through the process of their client’s customer). To design a landing page (Research your competitor’s landing pages and layout). Here are a few examples of secondary data and variables from AdWords Secondary data and relevant keywords: Using secondary data can open up new key terms that you may not have been aware of, allowing you to focus on keywords that your competitors may not be bidding on. Each industry has its own jargon, and many words and/or phrases can refer to the same thing. This is particularly important in industries that have complexity within their buying cycle, and where the consumer requires specific information before making a decision. The customer will be searching using terms they are accustomed to using and will come prepared to assess benefits and costs! Regardless, it is not the number of keywords you are bidding on that is the issue; it is the quality of them. Secondary research can open up new keywords for an industry you are targeting. Example: I conducted research on “key-man” insurance for an AdWords account. Without researching the topic, I would have not known that buy/sell insurance, debt protection, shareholder insurance, revenue protection and key-person insurance were other terms used for key-man insurance. Thus, if I had not researched this topic, I would have missed a substantial number of potential clicks and, therefore, quality leads. This was further clarified in a journal article I found in Google Scholar that showed that forty-three per cent of Australians have never heard of the term “key-man insurance”, (Fabris, The Australian Journal of Finance, 2008). Clearly this would have meant that I would have lost potential leads because I had not used other phrases for the client’s preferred term. Secondary data and impression rate: Your impression rate is the number of potential clicks you can obtain in an AdWords campaign – this is heavily influenced by your budget. Whether your budget is large or small, it is important that you understand where your potential consumer is. Example: I was managing an account which had a really high impression rate and expensive cost per click (CPC) that was eating through the relatively small budget. As you can guess, the click through rate (CTR) was quite low, which affected the positioning of the adverts negatively. By using secondary data, and understanding the client’s servicing ability; I was able to research areas that had a high demand for her offer of bond cleaning. I was able to make a radius target, which decreased her impression rate, increased her CTR and advert’s positioning. She was able to gain four times as many leads for the same budget and run longer with a higher advert positioning. Secondary data and experiments: All good AdWords Managers run experiments and adjust their campaigns in response to their findings. If you know your subject well, having researched your secondary data widely it is easy to formulate research questions worth testing. Example: Should a customer offer something for free? Are people deterred from clicking on an advert that uses the word ‘free’? I researched the topic and found a couple of studies that showed that people were reluctant to take free things because they did not consider that the product would be a quality one, because if it was worth something, they should be expected to pay. Research shows that pricing is very important – if something is offered for free, most people will think “what’s the catch?” A/B testing was used to create this theory. Secondary data and the customer: When developing an AdWords campaign we often consider of the demographic characteristics of the potential consumer. There is an abundance of secondary data that can help you profile that customer demographic, and your actual and potential market share. Example: We have been running a radius geo-targeted campaign on one of my AdWords campaigns. Looking through the search terms, I found a couple of suburbs were appearing frequently. I decided to look up and see the area in Google Map. I found that these suburbs were all close to each other, so I decided to bid on keywords with these suburbs and found a significant market that was missed by client. As you can see secondary data can give you a wealth of information that can be used to improve your AdWords Campaigns. Secondary data also helps you to build credibility when talking to clients; it shows that you have taken the time to learn about their industry even if you have not had any experience in making an AdWords campaign for that sector before. Case Study: Secondary Data for Driving School Account Background The research problem: My client wanted to know which areas of Sydney he should extend his driving school advertising coverage to. The target market: Students aged between 16 and 17 years and their parents. Prior knowledge: Many parents arrange driving lessons that have pick-ups or drop-offs before or after school. From the background information, I decided to use high/senior schools as a focus for my secondary data research and to begin my information gathering in Google Maps and then move on to other online information directories. I typed ‘driving school Sydney’ into Google maps, assuming that most companies will have registered their businesses there, although as a researcher, I know that some may not be on Google maps and there may be missing data. From this query I could see where the driving schools were located and by looking at the clusters it was obvious that there were a couple of areas in the Blue Mountains and the Hills district that did not have much coverage. Armed with information on the potential areas to extend into I went to the Australian Schools Directory where I found that there were over 27 high/senior schools in The Hills District. I then returned to Google Maps and focused in on driving schools in the Castle Hill area (the commercial centre of The Hills District) which returned the results below: As can be seen from the Google Map result there are not many companies offering driving school services in the Castle Hill area. By researching their prices and offers, a competitor could easily penetrate this market, especially if they focussed on nearby suburbs with Senior/High schools, for instance only one competitor came up when I typed in ‘driving school Dural’, which is approximately10 minutes away from the central business district in the Hills. Just to check to see if the above was accurate, I typed in ‘driving schools Dural’ in Yellow Pages (on-line telephone directory) with this result: Conclusion By using the two directories: Yellow Pages and the Australian Schools Directory, I was able to figure out that there were only a few driving schools targeting the Dural area. By integrating secondary information from different sources I was able to demonstrate to my client which suburbs in Sydney to target and why. Subsequently he implemented this advice, we added appropriate keywords and adverts and the campaign was very successful – he achieved a 20% increase in conversion rate. Useful Secondary Resources Available for Free As you begin to work with secondary data; you will accumulate a set of reliable “go to” resources that you should book mark. Do not limit yourself to these but they can often provide a quick overview or “jumping off” point to further information. The following is a good starting point: Google Scholar: Google Scholar has an abundance of information. Research journals provide studies and recent information on many topics. The overviews are particularly useful enabling you to refine the search without having to read the entire article. Example: I was running a display campaign that required me to focus on wealthy businessmen. I found a study that used data collected Australia wide that concluded that the higher the education level, the more likely the men were to be in a managerial position, thus I was able to profile my client’s potential customers. Google Images: Google Images can be used with your AdWords campaigns to collect secondary data. If you are managing a company that sells products that you are not familiar with you can easily view a pictures of items in the customers suggested search terms. Example: I manage an engineering company and use Google Images to view the search terms coming through so I know what the product looks like and even use it to find alternate descriptions of the products that can also be used as keywords. In this instance “a picture may be worth a thousand words”. Statistics (e.g. ABS - The Australian Bureau of Statistics): The ABS provides statistics about Australia but where ever you are in the world, there is usually a government agency that collects and publishes statistics. In Australia you can even pinpoint results to specific suburbs. This is a useful resource when working with local businesses. The brilliant thing about the statistics from the ABS is that their data has high external validity, meaning that, due to their large sample size, you can make reliable generalisations and assumptions based on the data. Information Directories: there is an abundance of information lists and directories available on the Internet, depending on what information you are looking for, you can usually easily find a directory. Example: Recently I needed to find out which are the best universities in Australia for some targeted advertising. I found an independent study using information directories and was able to compare several other sites to validate the result. Google Maps: Google Maps is a very useful tool for determining the number of a client’s competitors in an area, what search terms they are appearing under and whether they are really direct competitors. Example: As AdWords account managers part of our role is to advise our clients. One of my clients did not want to advertise in her suburb because she thought there was no point, however, it is important that when offering a service, the local area should be the beginning point for advertising – as property managers say: “location, location, location”. I was able to show her how many of her competitors were advertising in her area by using Google Maps. She then agreed to advertise in her own area after reflecting on the fact that most of her customer base was from her own suburb. Evaluating the Reliability of Secondary Data When reading a research article the first things I consider are the author and institution, the sample size and make-up, and then the research method used. An article has to be determined as reliable before we can make assumptions using the data. The author, the institution and motives Look at the author, their qualifications and possible conflicts of interest in the outcomes. In most cases, independent studies and institutions are generally reliable sources of quality research, because they seldom have any commercial motives for carrying out the study and no pecuniary interest in the outcome. Sample Size and Make-up The size and make-up of the population studied can affect the results. The number of people that make the population is paramount before begin able to generalise a decision based on the data. Example: I want to know which car Australian’s trust and I find a study that says 80% of Australians trust BMW. If the sample size was four people and all of these were middle-aged men from the city of Sydney would this reflect the whole of Australia? The answer is obviously no. Firstly, what about regional areas and the other States of Australia, the female population and other age groups? Secondly with only four people out of a population of over 23 million the sample size is clearly not adequate. If we used this study to generalise for our AdWords campaign, the decision would be flawed. As we can see, the quality of secondary resource will need to be determined before we can use it for our AdWords campaign. Qualitative or Quantitative Research Methodology Generally, if you were to ask a researcher which is the best research methodology, most would prefer a mixed-methods approach that is a combination of qualitative and quantitative research methods. Qualitative research Is usually text or verbally based, using techniques such as one on one interview or focus groups. Quantitative research Utilises numerical data, such as surveys or collected data, and is usually conducted over a large sample size. In research, quantitative studies are often designed and developed using the information researchers find in qualitative studies. When these research methods are used together, the numerical data from the quantitative research can be used to determine the degree of reliability of the qualitative results. Going Forward with Secondary Data Do not limit yourself to primary data when working on an AdWords account. Regardless of how much data you already have for an AdWords campaign; you should not disregard the knowledge that can be gained by using secondary data. It is our responsibility as PPC marketers to improve outcomes for our clients by doing a small amount of research into the secondary data available and using the findings to make informed decisions about where to take an AdWords campaign. Initially it will take time before you can assess the quality of your secondary sources, but by reading widely; you will soon be able to make conclusive decisions on whether or not a source is useful and reliable. When developing an AdWords campaign, we all start off with who our target market is and ask ourselves questions from there. The target market heavily affects where we should seek data, and the type of data we need. This profile you develop can be found using secondary data, and backing up the decisions you make, rather than going off a “gut feeling” which is every researcher’s nightmare. Overall, the more resources you use, the better will be the quality of the information that you use to base your decisions on. In turn, we gain a better understanding of our client’s consumer. This will not only allow us to make evidence based decisions, but arm us to teach our client how to think about their customers, especially if they do not know much about how to market their product or service. Hopefully this article has given you an understanding of how, by using secondary data, you can broaden your knowledge of your client, their products and/or services, and utilise this information to improve the effectiveness of your AdWords accounts. I hope you have enjoyed my fist post to Moz, feel free to ask any questions below and I'd love to hear your feedback :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Secondary Data: The Information Your AdWords Account is Missing"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Secondary Data: The Information Your AdWords Account is Missing"
    },
    {
      "level": "H2",
      "text": "Defining Primary Data"
    },
    {
      "level": "H2",
      "text": "Defining Secondary Data"
    },
    {
      "level": "H2",
      "text": "Secondary Data can Make or Break your AdWords Account"
    },
    {
      "level": "H3",
      "text": "Here are a few examples of secondary data and variables from AdWords"
    },
    {
      "level": "H2",
      "text": "Case Study: Secondary Data for Driving School Account"
    },
    {
      "level": "H3",
      "text": "Background"
    },
    {
      "level": "H3",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "Useful Secondary Resources Available for Free"
    },
    {
      "level": "H2",
      "text": "Evaluating the Reliability of Secondary Data"
    },
    {
      "level": "H3",
      "text": "Qualitative research"
    },
    {
      "level": "H3",
      "text": "Quantitative research"
    },
    {
      "level": "H2",
      "text": "Going Forward with Secondary Data"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ashleigh Betvardeh\n          \n            Ashleigh Betvardeh\n          \n            Ashleigh Betvardeh"
}