{
  "url": "https://moz.com/blog/seeking-a-steamy-romance-between-seo-and-cro-9071",
  "slug": "seeking-a-steamy-romance-between-seo-and-cro-9071",
  "title": "Seeking a Steamy Romance Between SEO and CRO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": " In many ways, SEO has always been entwined with conversion optimization. Rankings and traffic metrics may often be in the foreground, but the implicit understanding is that SEO is all about winning more customers.But a funny thing happened on the way to the checkout—or lead acquisition, as the…",
  "content": "Seeking a Steamy Romance Between SEO and CRO Online Advertising S By: sjbrinker March 22, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! S By: sjbrinker March 22, 2010 Seeking a Steamy Romance Between SEO and CRO Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. In many ways, SEO has always been entwined with conversion optimization. Rankings and traffic metrics may often be in the foreground, but the implicit understanding is that SEO is all about winning more customers. But a funny thing happened on the way to the checkout—or lead acquisition, as the case may be. Two disciplines evolved independently, SEO and conversion rate optimization (CRO). To appreciate the differences between the two, browse through the leading books in each field: The Art of SEO by Enge, Spencer, Fishkin, and Stricchiola contrasted with, say, Landing Page Optimization by Tim Ash or Always Be Testing by Eisenberg and Quarto-vonTivadar. (I'd humbly mention Honest Seduction, the post-click marketing book I co-authored. There's tremendous insight in each—but not a lot of overlap. Over the past several years, CRO specialists have rapidly developed their trade. CRO is more than simply tagging pages for A/B or multivariate testing (MVT) experiments. There's a complex mix of science and creative in deciding what to test, segmenting audiences into different test groups, coordinating upstream and downstream experiences around those tests, and attributing conversions across multiple touchpoints. All that is to say that CRO deserves respect as a field of expertise unto itself. But as SEO and CRO each advance, there's need for renewed collaboration between them. These two power professions are aching to rendezvous in a steamy industry romance. As SEO and CRO spend more quality time together, I might suggest a few shared interests to explore: Honing the system dynamics of audience segmentation SEO and CRO each have their strengths in this mission. Use SEO analysis to identify emerging Long Tail niches. Use PPC and matched landing pages to test those niches in controlled experiments. Use behavioral segmentation on those landing pages to further distinguish respondent motivations. Measure their relative value by conversions. And use the results to inspire new SEO content with extended reach. This can be a beautiful, multi-discipline, virtuous cycle—yet few companies today have the SEO and CRO collaboration to pull it off. Managing the interaction effects between testing and SEO Because different testing technologies have different relationships with search engine crawlers—for instance, client-side testing solutions such as Google Website Optimizer effectively hide test content from any search bot that isn't willing to execute Javascript—it's important to ensure that a page's SEO representation and its range of A/B or MVT experiments don't diverge too far. Aside from potential cloaking issues, it can lead to mismatched expectations for respondents who arrive via an organic summary. Deciding when CRO tactics should be in or out of SEO To be sure, not all landing pages should be indexed. In particular, pages that promote limited-time offers—or offers applicable only to a specific segment of your audience—may be best not being indexed (or at least not archived) on the search engines. (Exploring ways to use real-time search for boosting traffic to these short lifespan pages is a worthy topic of its own.) On the other hand, if a landing page is compatible with a longer-term organic footprint, make sure that it gets added to the sitemap in a timely fashion. The point is to have CRO tactics adopt the most appropriate SEO participation strategy consciously, and not leave it up to chance. Balancing the trade-offs between link bait and conversion bait When it comes to content strategy, particularly in businesses that use the web for lead generation, there's often a tension between using something—white papers, webinars, case studies—as link bait versus conversion bait. For maximum link bait effect, you'd make the complete content publicly available. For optimal conversion bait, you might make a teaser publicly available, but require a registration to access the real goods. There's no single best answer to this dilemma, but it's an important issue for SEO and CRO professionals to balance together in context. And I'm just scratching the surface of intriguing intersections. I know that Gillian Muessig is scheduled to speak at the Conversion Conference on May 4 on the topic of Spiders vs. People—SEO & Conversion, which should be a great venue for this discussion. In addition, a number of us in the conversion optimization community have been meeting regularly on Twitter, every Thursday from 1-2pm EST, for a #CROchat. We'd love to have you join in. At least metaphorically, romance is in the air. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Seeking a Steamy Romance Between SEO and CRO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Seeking a Steamy Romance Between SEO and CRO"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "sjbrinker\n          \n            sjbrinker"
}