{
  "url": "https://moz.com/blog/selling-services-and-shoes-some-copywriting-tips",
  "slug": "selling-services-and-shoes-some-copywriting-tips",
  "title": "Selling Services and Shoes: Some Copywriting Tips - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I was looking at snow blowers last week, reading through the literature and trying to compare specs of different models. I don’t know squat about the tech specs of snow blowers, but tell me “this model can shred a big block Chevy” and I’m sold. Not specs. Benefits of snow blower A over snow blower…",
  "content": "Selling Services and Shoes: Some Copywriting Tips Content Marketing By: Paul Lalley September 24, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Paul Lalley September 24, 2008 Selling Services and Shoes: Some Copywriting Tips Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I was looking at snow blowers last week, reading through the literature and trying to compare specs of different models. I don’t know squat about the tech specs of snow blowers, but tell me that “this model can shred a big block Chevy” and I’m sold. Not specs. Benefits of snow blower A over snow blower B. That’s what the unknowing (i.e., me) want. For example… …all of my snow-blower options come with an emergency STOP feature. Good. Very good. Ummm, why? Well, it turns out that the automatic stop feature prevents the machine from starting accidentally while you’re unclogging the blades. Not having your arm ripped off is a benefit anyone can understand. So, instead of just providing the feature, be sure to cover the benefit. Two arms. A good thing. I get to see a lot of really bad web sites – sites that are struggling under the weight of too many keywords in too short a body of text, headlines with keywords crammed in with a shoe horn and completely botimized text – boring. But even today, there are website owners (and I assume designers) who develop sites that employ ineffective marketing text, leading to microscopic conversion ratios. The reason? There’s a big difference in writing copy that sells products versus copy that sells services. Let’s talk about shoes. Selling Products. Selling Shoes. Often, all you need are some product pictures, and you can cover the products’ features in a 30-word block of text, pointing out what a wonderful shoe it is. The reason? People understand shoes at the molecular level. No explanation necessary. When selling products, a bullet list of features or tech specs usually does the job because the site visitor already has some interest in the product, an assumption based on the means by which search engines catalog sites. In other words, you don’t have to start at square one when selling products. It’s reasonable to assume that the prospect knows what a k187-h45 re-heater valve is if she’s ordering one. Of course, this isn’t always the case. A first-time webcam buyer might require an explanation of benefits and features, so this is anything but a hard and fast rule when it comes to selling products. No so with services. The owner of an outsourcing administration service for medical professionals might well require a little explanation and a lot more detail, not just about features of a service, but benefits of those features as well. Buyers must understand the service and the underlying concept behind the service offering, and that’s not always straight-line thinking so, as copywriters, we have to provide features and benefits of service offerings. Selling Services Service providers – every business from accounting services to chiropractors – require more benefits and more-detailed benefits simply because the service may be unknown. The business strategists at Advantotex, who stage a two-day seminar on business ethics, must demonstrate actual benefits – cost savings, client retention and so on. If space is at a premium, a simple bullet list of benefits gets the message across. Consider the following: After completion of the Advantotex Best Practices Seminar, you will see: an immediate drop in absenteeism fewer expensive turnovers of C-level managers improved communication and cooperation between departments fewer client care calls and lowered service costs Sure, you’d include a syllabus, target audience and other useful information that demonstrates your value – quantifies it if possible: average 198% increase in productivity within six months of implementation. Sweet. Verifiable results also sell well. A humble suggestion: list features and specs; highlight benefits. You just can’t assume the reader will make that critical connection between service offering/feature and “What’s in it for me?” Sell the benefits and let those who need to understand the tech specs figure out if this is a good purchase or not. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Selling Services and Shoes: Some Copywriting Tips"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Selling Services and Shoes: Some Copywriting Tips"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Paul Lalley\n          \n            Paul Lalley\n          \n            Paul Lalley"
}