{
  "url": "https://moz.com/blog/sempdx-searchfest-07-in-the-hizzy",
  "slug": "sempdx-searchfest-07-in-the-hizzy",
  "title": "SEMpdx SearchFest '07 in the Hizzy - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In about a week and a half, Rand and I will be road-tripping to Portland to attend SEMpdx's day conference, SearchFest. Rand has reached a near-godlike status in the conference sphere, in that he was asked to speak at the conference and is allowed to pick a topic of his choosing. As a result, Rand…",
  "content": "SEMpdx SearchFest '07 in the Hizzy SEO Events By: Rebecca Kelley February 22, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley February 22, 2007 SEMpdx SearchFest '07 in the Hizzy SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In about a week and a half (March 7, to be exact), Rand and I will be road-tripping to Portland to attend SEMpdx's day conference, SearchFest. Rand has reached a near-godlike status in the conference sphere, in that he was asked to speak at the conference and is allowed to pick a topic of his choosing. As a result, Rand will be performing his one-man show, \"Fishkin: Whitehat, Hopeless Romantic, and Hobo Stabber.\" There will, of course, be a 15-minute Q&A following his performance, but you can only ask a question when he's thrown you a Koosh ball. Seriously though, Rand will be on a panel with Small Business SEM extraordinaire Matt McGee and some dude (dudette?) with a seriously wicked name (Stoney deGeyter) to discuss Advanced SEO Topics (check out the SearchFest agenda for a complete schedule of sessions being offered). So, why am I attending the conference with Rand? It's not because I am his lackey, the Tattoo to his Mr. Roarke...okay, well maybe that's partly why. Actually, I'll also be there for my very first speaking engagement. I'll be on the Link Development panel with Scott Fish and Benjamin Lloyd. And holy crap, I have to have a 15-minute presentation. With, like, slides. And I have to present first. And there's a 15-minute Q&A afterwards. Basically, I'm doing a presentation twice as long as anything I ever did in college, and it'll be in front of roughly 2-10x the audience. Hmmm, I wonder if I can get that SES London plague that had been circulating the conference... Also, apparently there are still some exhibitor spots available for the conference. It costs $500 to exhibit ($350 if you're an SEMpdx member), or you can join SEMpdx for $100, exhibit for $350, and get a free admission pass in the process, thus saving you fifty bucks. That's some crazy math right there (but what do I know, I'm a liberal arts alum). If you're interested in exhibiting, then get on it because the spots are filling up! Also, if you're a fervent fan of the blog and are planning on attending the conference, be sure to go on a coffee break between 2:00 and 3:00 pm so you won't be subjected to seeing me standing at the podium drenched in sweat sporting a look of sheer terror. Don't say I didn't warn ya. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEMpdx SearchFest '07 in the Hizzy"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEMpdx SearchFest '07 in the Hizzy"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}