{
  "url": "https://moz.com/blog/sempdx-searchfest-2007",
  "slug": "sempdx-searchfest-2007",
  "title": "SEMpdx Searchfest 2007 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "On Tuesday afternoon, Rebecca and I drove the 3 hours down to Portland, OR for our first SEMpdx Searchfest. We arrived at the hotel around 6pm and had drinks with many of the conference organizers. I also had a chance to meet and chat with Jeffrey Pruit from iCrossing, who gave the keynote the next…",
  "content": "SEMpdx Searchfest 2007 SEO Events By: Rand Fishkin March 8, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 8, 2007 SEMpdx Searchfest 2007 SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. On Tuesday afternoon, Rebecca and I drove the 3 hours down to Portland, OR for our first SEMpdx Searchfest. We arrived at the hotel around 6pm and had drinks with many of the conference organizers. I also had a chance to meet and chat with Jeffrey Pruitt from iCrossing (and VP of SEMPO), who gave the keynote the next morning. Rebecca and I dined with Matt McGee, Darcy Hill, Scott Orth & Scott Fish at Oba!, a terrific Spanish restaurant before retiring early so Rebecca could work on her presentation. The next morning, we met early in the lobby to leave in time to make the 8am keynote speech. I asked Rebecca how she slept and I believe her response was something like \"I woke up every hour, sweating that I'd missed the alarm.\" Ah, the joys of speaking on your first panel. :) We actually got completely lost on the way to the World Forestry Center (which has a gorgeous campus), where the conference was held. As much as I'd love to blame Rebecca, who was driving, the fault is 100% my own. I relied on the mobile Google Maps application I downloaded to my phone the day before, but didn't count on losing reception somewhere in Terwilliger Park (I love how everything in the Simpsons is named after a place in Portland--it makes street sign watchin' incredibly entertaining). Eventually, we did reach the conference, and were shocked by the massive turnout. We had been told by the organizers to expect 100-150 attendees, but SEMpdx was mobbed! Nearly 300 people turned out, some even asking if they could pay for the event upon arrival. Although the event ran out of information packets, they did have enough food to keep everyone happy - my compliments to the caterers; they handily beat off the SES and Pubcon breakfasts and lunches. I'm thrilled that so many folks are interested in search here in the Northwest - it's a great sign that the Internet marketing world in our region has grown up quickly. My presentation - Six Delicious Morsels from the World of Search Marketing - covered a variety of topics: The Impact of Personalization Why Wikipedia is so Successful (and how to duplicate those results) The Anger towards SEO in the Social Media World The Power of the Widget The Biggest Mistake in Linkbaiting The Freemium Revenue Model It was one of the most enjoyable presentations I've done (at least for me) and the crowd was terrificly engaged. Another major difference from SES and Pubcon - not a single person walked out of my presentation. I'd like to think it was me, but I actually noticed that in general there was a much smaller abandonment rate for all the speakers. And now, the part you've all been waiting for... Rebecca's presentation: Her first words as she took the microphone - \"I'm going to stand behind this podium so none of you will be able to see my piss myself.\" Followed shortly by, \"If you applaud loudly at the end of my presentation, Rand says I don't have to ride in the trunk on the drive back to Seattle.\" You gotta love her, right? Rebecca's presentation, cheesily named - Through the Linking Glass - covered the basic tactics, values and pitfalls in a link building campaign. It was well geared to small businesses, and despite some nervousness on her part, was well-delivered, especially for a first-time speaker. I have confidence that she'll get even better over time. It's my hope that SEMpdx becomes SEMpsdx (the extra \"s\" for Seattle). I'd love to see the organization put together a conference here in the Seattle Metro area sometime in the fall - there's a few folks in search in the area who'd certainly appreciate a get-together and plenty of businesses who are desperate for search marketing assistance. I'd also much rather leverage the structure and strength of the SEMpdx organization and grow it, rather than launch a competitive organization here in Seattle. It's a natural fit, and one that I'd be proud to support. Congrats to all the organizers and speakers at the show - you've got a lot to be proud of. p.s. I promised that I'd make my alternate presentation available (on linkbaiting) - 7 Steps to Linkbait Success. The conference pamphlet had incorrectly listed this as my presentation, despite the website being accurate. I put it to a vote at the beginning of the session and the Morsels presentation was the clear winner, so I gave that one. p.p.s. I've heard that a DVD of the presentations will be available from SEMpdx in the next few days - I'll get a link up when that happens. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEMpdx Searchfest 2007"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEMpdx Searchfest 2007"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}