{
  "url": "https://moz.com/blog/seo-reports-google-analytics",
  "slug": "seo-reports-google-analytics",
  "title": "New SEO Reports in Google Analytics Now Here - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This week we noticed a new feature in our Google Analytics account – a  set of reports called “Search Engine Optimization.” Google announced that these reports are out of beta and now available to...",
  "content": "New SEO Reports in Google Analytics Now Here SEO Analytics By: Cyrus Shepard October 4, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Cyrus Shepard October 4, 2011 New SEO Reports in Google Analytics Now Here SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This week we noticed a new feature in our Google Analytics account – a set of reports called “Search Engine Optimization.” Google announced that these reports are out of beta and now available to all users. Is Google really going to help us with our SEO? The reports are found in the new interface, under the “Traffic Sources” section. Setup requires a Google Webmaster account. After you connect your accounts, the data sharing is almost instant, although metrics from the past two days aren’t available. 1. Query Reports The query report lists the top 1000 queries along with number of impressions, clicks, average position and click-through rate (CTR). Users familiar with Webmaster Tools will recognize the layout, although it feels cleaner in Google Analytics. One thing that looks out of place is “average position.” Most people think of average position in Google’s search results to mean “rank”, but this is not the same thing. For example, our Queries report shows SEOmoz’s average position for the word “seomoz” is 3.5. Huh? You don’t need to be the SEO of SEOmoz to know that we rank #1 for our brand term. Even if we saw advertisements above our name (we don’t) or odd vertical results, any reasonable person could tell you we rank #1. But Google doesn't display rank. Instead, they record the position of each impression. With a 6 Pack of results, SEOmoz appears 7 times for each query. This means the average position is 4 for this particular result. From Google’s Webmaster Help. “To calculate average position, we take into account the ranking of your site for a particular query (for example, if a query returns your site as the #1 and #2 result, then the average position would be 1.5).” Is this useful? I’d rather Google display the highest position when showing us this data, which would present a more actionable metric to webmasters. PRO Tip – Finding Opportunities in the Queries Report To discover optimizing opportunities, you can use advanced filters to find keyword queries that: Send you a good amount of traffic You rank for, but... ...you don’t rank #1 (or 2 or 3) These are \"golden\" keywords. Since these queries already send you visits, a small gain in rankings could lead to big gains in traffic. Not all keywords should be optimized – it’s important to know your conversion data here. For example, the report tells us that SEOmoz receives a lot of accidental traffic for the phrase “cute pictures'. This is not a keyword we need to optimize for. The only problem is the query report does not tell you what page these queries are landing on, so you have to perform extra work to find this information out. That, and the “average position” metric isn’t as useful as rank. Not to tout our own products, but you can also find these keywords with the SEOmoz PRO platform, which displays your actual keyword ranking and the URLs that rank for the keyword phrase. It's easy and saves me a ton of time. 2. Landing Pages Report The Landing Pages report shows how many times your top landing pages were shown in search results, again along with average position and CTR. Average position isn’t as useful in this report, as you don’t know the exact search query, but it does paint a picture of your search visibility. PRO Tip – Optimize for CTR Again you can use advanced filters to find landing pages with: High number of impressions High average position Low click-through rates. Look at these URLs for title tags and meta descriptions. Is there anywhere you could improve how the results display in the SERPS? Often, there is a very good reason for low CTR outside your control, especially when search engines show search results that don’t match user intent. My biggest wish for this report would be for it to display landing pages and queries together. You can find these in other parts of GA, but right here would be ideal. 3. Geographical Summary The Geographical report shows you impressions and click-through by country – great for international SEO where you target other countries. For example, we can see that although SEOmoz gets more impressions in India, we actually get more clicks from the UK. More interesting is the Google Properties Report, inexplicably hidden in the Geographical Summary. There’s not a ton of actionable data, but you can see how your site performs among different search results, including Image, Mobile and Video. Does the Search Engine Optimization Report Help Your SEO? Google's SEO reports are still rough around the edges. Every metric requires extra work on your part to make it actionable. How much will Google share? Nowhere near what Blekko gives SEOs. That said, the reports are a welcome addition and a win for transparency, which Google desperately needs.If you use the data correctly, the reports reveal insight into not only into how your website performs, but also the strange ways Google’s search results operate in the real world. Strange indeed. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "New SEO Reports in Google Analytics Now Here"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "New SEO Reports in Google Analytics Now Here"
    },
    {
      "level": "H2",
      "text": "1. Query Reports"
    },
    {
      "level": "H3",
      "text": "PRO Tip – Finding Opportunities in the Queries Report"
    },
    {
      "level": "H2",
      "text": "2. Landing Pages Report"
    },
    {
      "level": "H3",
      "text": "PRO Tip – Optimize for CTR"
    },
    {
      "level": "H2",
      "text": "3. Geographical Summary"
    },
    {
      "level": "H2",
      "text": "Does the Search Engine Optimization Report Help Your SEO?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Cyrus Shepard\n          \n            Cyrus Shepard\n          \n            Cyrus Shepard"
}