{
  "url": "https://moz.com/blog/seo-for-startups-top-7-lessons",
  "slug": "seo-for-startups-top-7-lessons",
  "title": "SEO for Startups: Top 7 Lessons + A Trip to YCombinator - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Last week, while in London, I received an email from Paul Graham, whom I've long admired, possibly even idolized a bit. He asked if I was available to come speak at a YCombinator SEO event in Mountain View. Tonight, I presented at that evented and thought I'd share my experiences, recommendations…",
  "content": "SEO for Startups: Top 7 Lessons + A Trip to YCombinator Marketing Industry By: Rand Fishkin February 23, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 23, 2010 SEO for Startups: Top 7 Lessons + A Trip to YCombinator Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Last week, while in London, I received an email from Paul Graham, whom I've long admired, possibly even idolized a bit. He asked if I was available to come speak at a YCombinator SEO event in Mountain View. Tonight, I presented at that evented and thought I'd share my experiences, recommendations and yes, my presentation. Not everything that was discussed is public, in fact, much of it is \"classified\" at YC's request. However, there's so much good material that it would be criminal not to share. First up, my presentation from the YCombinator SEO for Startups event (naturally, hosted on YC company and prior SEOmoz consulting client, Scribd): SEO for Startups: YCombinator February 2010 Next, since it's hard to do any slide deck justice with just the slides, a list of top advice and recommendations, not just from the slide deck, but from many years of interactions, consulting and Q+A help for startups: SEO as a Strategy, not a Tactic Yelp uses SEO as a strategy. When their community finds something new in the neighborhood, content is created. They are limited in scale only by the physical world's local businesses. Plus, it's only natural that local businesses with good rankings will want to share those via a badge and a link; it's only natural that their top contributors will want to share the reviews they've given. SEO is a strategy - it's part of what makes them the business they are. If you're just thinking in terms of keywords in the title and submitting to some directories, you're going to get lapped by someone who understands how to make content, links, sharing & search demand an integral part of how users interact with their website. Start SEO in the Concept Phase, Not After the Site is Built It's hard to do, particularly when you spend your first two years as a founder thinking SEO is a cross between black magic and BS, but SEO works best when it's architected alongside a businesses marketing plan. I've mentioned in the past that I think VCs and angel investors should be asking about SEO in the first meeting - startups should be three steps ahead of that. Build Accessibility First & Foremost I come back time and time again to the SEO Pyramid. It all starts with unique content that engines can find and users find valuable. I'm now the proud owner of a Y Combinator t-shirt bearing the tagline \"Make Something People Want.\" All I'm asking is that you also make something Google (and Bing) can find, too. And, in concert with this advice, check out Perfecting Keyword Targeting & On-Page Optimization to help solve that puzzle. SEO is NOT a One Time Event Fire and forget works with smartbombs (or maybe not - scroll to section 5), but it doesn't work with SEO. This is a constantly evolving field, and not so much because Google's algorithm is changing all the time, but more so because 300 (or 30,000) competitors are constantly trying to produce better content and market it more effectively while the engines are constantly experimenting with new kinds of results and information. No product is good enough to survive without marketing - even Google itself just ran a Super Bowl ad. SEO is marketing, and as such demands the same attention. Ignore it, and you will fall by the wayside. Analytics are a Religion An ad salesman comes to you and tells you that 20% of your exact target market is reading a particular magazine. By putting in a full-page ad every month for the next year, you can ensure that they'll all know your name and many will buy from you. But wait... How many saw it? How many took the desired action? How many heard about it from a friend or read a loaner copy on a flight? You'll never know. With SEO, it's the complete opposite - every action has a trackable reaction. If you ignore the data, use last-touch attribution or neglect to build serious models that track the value of your campaigns, you may as well blow the money on a giant billboard on the 101. Who knows? Maybe the right investor will drive by and decide to invest... Just don't count on it. Clever Tricks Aren't that Clever (or New) I promise that no hairbrained scheme to manipulate the search rankings by registering thousands of sites or scraping the web for open places to link or contacting 6,000 \"friends\" for a link exchange are either A) new or B) going to work. Apply your creativity in white hat ways and make sure it passes the Google web spam litmus test. And no, that doesn't just mean it passes Google's Quality Guidelines, it means you would happily show it to any engineer on the webspam team content in the knowledge that they'd actually WANT it to help your site rank better. Don't Let Search Dominate Your Traffic Sources If Google sends 90% of your traffic, your business has real danger associated with it. Why aren't people coming directly to your site, being passed links in email, getting Tweets and Facebook mentions that send traffic? Why is no one blogging about you, writing about you in the press, commenting in forums with links to your content? These \"natural\" signs tell a story of a real business providing real value. The 90-95% Google trafficked site says something strange is going on, and Google themselves are likely to figure that out sooner or later. And last, but not least, I'd like to recognize some of the brilliant people and companies represented. It was humbling to receive such kind praise and attentitive ears from companies like: Apartment Rentals Site - AirBnB (whose founders were kind enough to give me a ride back to my hotel at SFO!) Dead Simple Publishing Site - Posterous (I learned the official way to pronounce it - \"pastarus\") Concerts & Tour Dates Startup - Songkick Time Management Software Provider - RescueTime ( a local Seattle startup, and host of the Feb. 25 event) Gift Card Exchange Marketplace - Cardpool Real Time Search Startup - Scoopler Live Video & Chat Hub - Justin.tv Tragically, the following brief set of photos from the event were taken on my new Android camera phone (yes, I'm such a Hacker News/Paul Graham geek that I had to pull it out): YCombinator Founders Eating Dinner (noticeably absent in the photo was the single female founder - but they do have one!) Luckily, there was plenty of Coke to help keep me hydrated (and caffeinated) during the event The rush for pizza (apparently, The Flash is one of the founders they funded!) Paul and Rand in the Anybots lab - thanks again, Paul; it was a fantastic experience There were more than 40 companies in attendance, so there's no way to name them all here, but the above represent some of the most active on the SEO panel and during the lengthy, but phenomenal Q+A. Later this week, SEOmoz's own Danny Dover will be attending the Y Combinator meetup in Seattle, and he'd love to say hi and chat with folks there, and hopefully help to bring a good name to SEO. p.s. At the end of the presentation, Paul noted that the startups owed me a debt for sharing information about SEO. I disagree, but who am I to pass up such a wonderful opportunity. My only request to the attendees was that, if they should see SEO being badmouthed on Hacker News to kindly step in and help others realize the power and legitimacy of this marketing channel. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO for Startups: Top 7 Lessons + A Trip to YCombinator"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO for Startups: Top 7 Lessons + A Trip to YCombinator"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}