{
  "url": "https://moz.com/blog/seo-only-half-the-battle",
  "slug": "seo-only-half-the-battle",
  "title": "SEO - Only Half the Battle - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "     Over the past years I’ve come to love SEO and all that encompasses the skill set needed to be a knowledgeable and productive internet marketer.  I’ve read the books, scrolled through the blogs, created test sites, monkey’d around on many different tools and created my own Excel Super…",
  "content": "SEO - Only Half the Battle Marketing Psychology R By: rorycarlyle September 10, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! R By: rorycarlyle September 10, 2009 SEO - Only Half the Battle Marketing Psychology This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Over the past years I’ve come to love SEO and all that encompasses the skill set needed to be a knowledgeable and productive internet marketer. I’ve read the books, scrolled through the blogs, created test sites, monkey’d around on many different tools and created my own Excel Super Spreadsheet for analytics and data analysis. My desktop has learned to hate my fixation for keeping it up all night processing spreadsheets and FTP’ing my new fangled changes to my clients' websites. Day after day I obsessed on SERPs and how I could dominate each one, showing each client the success rate of my work and the 200% increase in their traffic. My analytics were through the roof with, “improvements” as I would say. “Look at all the new traffic and page views you’re getting!” “WOW!” was the usual response or an occasional, “That’s amazing!” I was filled with pride – I did it, victory was mine! NOPE – think again. Sure, the SERPs were teaming with my clients' pages, traffic was through the roof, page views climbed up steadily for weeks and overall revenue was getting better, but I missed the bus – BIG TIME. I was only half way there, success was in reach but not yet attained. I had just discovered that my one-track mind had focused solely on SEO, neglecting the ever important Conversion Rate Optimization. I had opened the SEO/SEM visitor floodgates on these websites like Niagara Falls without considering if I had a large enough bucket to catch them in. I had visitors sloshing all over the place. One specific website went from 5k to 15k unique visitors a month, with an increase in page views from around 2 to a little over 3 pages per visit, and our conversion rate stayed at around 10% of those visitors who entered into a goal funnel. So, I got the first part right. Traffic was up, page views were climbing and customers where happy with those results. But do you see what I missed? The majority of people who began to wander down our goal paths didn’t convert. I increased the visits which in turn increased the amount of conversions being made, but I totally neglected to optimize our goal paths for conversions. It was like a piñata of delicious visitors exploded all over our website and only a fraction of them ended up in our salivating sales cycle. DAMMIT! So, I did what any SEO worth his salt would do and set up A/B testing for each goal path with Website Optimizer. We saw immediate results. Within two weeks we had upped our conversions by 20%, granted that’s a whopping 12% conversion for our goals, but it was a step in the right direction. And given the fact we’d already increased traffic this was even sweeter. Our next steps included: Shortening the clicks to conversion. (Got it down to three) Increasing the visibility of the offers. Offering a “freemium” to prequalify the majority of the conversions, therefore; increasing conversions (onsite), lowering barriers to purchase and increasing sales overall with a trial download of the product. With these changes in place I should have retired on top. Our overall onsite conversion rate soared to 28% and our online sale revenue was up 130%. We’re still optimizing, but this was a phenomenal change for my client and a life lesson learned for me. To conclude, CRO is a far greater skill to achieve as an internet marketer. While SEO is also pivotal to online success in today’s world; you can’t expect to open the floodgates and achieve stardom. There are tons of free usability tools out on the web that can improve overall website performance and conversions. i.e. - Crazyegg.com , Google Analytics (Site Overlay), Kampyle, etc. (There are more – Go find them yourself!) So, I would recommend to all you SEOers out there; use Conversion optimization in parallel to your SEO, maybe even before. Make sure the website is capable of converting and handling the traffic you’ll be bringing to it. Traffic is only half the battle my friends, don’t forget that conversions are what pays you in the end. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO - Only Half the Battle"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO - Only Half the Battle"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Turn Marketing Into Meaningful Relationships — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Catering to User Behavior Shifts During Times of Economic Turbulence — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Close More Sales With Emotion-Driven SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "rorycarlyle\n          \n            rorycarlyle"
}