{
  "url": "https://moz.com/blog/seo-from-a-newbs-perspective",
  "slug": "seo-from-a-newbs-perspective",
  "title": "SEO from a Newb's Perspective - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Sometimes it’s fun to temporarily place yourself back in the mindset of a beginner. You probably can’t remember the day before you understood SEO backwards and forwards, can you? Well, I’m still there. (Yes, thank you for the supportive smiles and knowing looks.) I still don’t understand it all;…",
  "content": "SEO from a Newb's Perspective Marketing Industry By: Brooke McDonald April 1, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Brooke McDonald April 1, 2013 SEO from a Newb's Perspective Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Author’s note: I’m new to the SEOmoz community and super excited to be contributing – but frankly, I’m a little intimidated by all the expertise on this blog. Gulp. Read and critique with love and understanding for my beginner status, please. Here we go! For all of you search engine optimization gurus out there, I hope my perspective is a fresh one for you. Sometimes it’s fun to temporarily place yourself back in the mindset of an ignorant beginner. You probably can’t remember the day before you understood SEO backwards and forwards, can you? Well, I’m still there. (Yes, thank you for the supportive smiles and knowing looks.) I still don’t understand it all – BUT I’m on my way, and I’m making progress. Stereotypes about SEO In college, my understanding of “search engine optimization” was that it was for “techie” people, a hybrid hobby of computer science and math. Where I gained this impression, I don’t remember, but I truly thought SEO could only be done by the guys who knew JavaScript and wrote code. That person wasn’t me. As an English creative writing major, I spent my time writing sonnets, short stories, and articles for the school newspaper. I loved the blogosphere, but beyond blogging and typical Internet usage, I never considered learning more about the inner workings of the web. To me, SEO seemed like a highly complex field easily comprehended only if you’d successfully hacked into something in your lifetime – which, as you can probably guess, I hadn’t. When I graduated in 2012, I realized: The journalism market was shutting like a Venus flytrap, I would suffer daily psychotic breakdowns if I had to teach English to adolescents, and I didn’t want to dish out money for grad school. So I started applying for every kind of job that involved words – techie or otherwise. I still thought careers in SEO were for people who solve Rubik’s cubes for fun, take computers apart and put them back together, and keep their scientific calculators in their back pockets – people who live in a programmed, digital world of computer gibberish, glowing screens, and Internet forums. Then, as luck would have it, I got hired to do SEO. At first, I was bewildered. Why would anybody want me to do SEO? However, my boss told me that my present skill set as a writer would actually be a good fit for the role. Besides, he made SEO sound really exciting. As I started to research and gain a more accurate impression of SEO, I was pleasantly surprised to learn I could actually like this. Yes, I was unaware of how fascinating the field of SEO is today. This new era of content creation and ethical linking has my head spinning. Now that I’m doing SEO, I’m so excited about all the possibilities SEO has to offer anyone who goes about it! Conversion from skeptic to supporter The first thing I did after I interviewed for my online marketing job at Happy Dog Web Productions was to download the SEOMoz Pro’s “Free Beginner’s Guide to SEO” (THANK YOU, GUYS). I took copious notes. I looked things up. I read it slow. Then I went hunting around the Internet for more information about this strange new acronym. As a frequent “Googler” myself, it was not news to me that people flock to the Internet like children to the candy aisle. The idea that Google is a diamond mine for marketing departments is completely logical. I already understood that traditional advertising and marketing efforts are no longer “how we do things” after reading books like Paul Arden’s It’s Not How Good You Are, It’s How Good You Want To Be, and Seth Godin’s Purple Cow, among others. The way we reach audiences has changed. Everybody is on the Internet, looking for answers, information, reviews, e-commerce, you name it. With the short patience of the average search engine user, companies have to be easy to find and rank for the right search queries – otherwise, well, tough luck! I began to understand the necessity of SEO in giving companies online credibility. Visibility and respect is a hard thing to achieve when the Internet is overstuffed with information, and even if you have an amazing, relevant website, Google or Bing or Yahoo! may not see it that way, making it impossible for people to find you. But optimizing your online presence for the search engines and the user alike, both off-site and on-site, will eventually, over time, convince the search engines to reward your quality website with a higher ranking. (Whew! See how much I’ve learned?!) The part of SEO I’m still coming to terms with is how Google figures out rankings – with its rules and algorithms and valuing certain practices over others. Thankfully, I’m not the only one trying to understand –even the most seasoned professionals are constantly hopping trying to keep up with rapid-fire change in the way search engines compile rankings. News alert: You, too, can join the fun Overall, I understand now that good, ethical SEO concepts are not too complicated to grasp - and good, ethical SEO concepts are vital in helping companies get noticed, marketing their brand, and encouraging conversions. If your website content is online but nobody can find it, why even have it? You don’t have to be a brilliant computer hacker to grasp SEO and how to go about it – one of my most valuable takeaways to date. Yes, you have to be able to follow Google’s algorithmic updates and understand statistics, and having a solid research and analysis process is crucial, but there's more to SEO than the numbers. SEO professionals should be fairly Techie, Internet savvy, and Marketing-minded. But the surprising job qualifications for the SEO person? Have outstanding social skills. All this guest blogging and link earning requires respect, a polite demeanor, and the ability to connect with people. Be strategic. Strategy goes a long way with SEO – like setting attainable goals for keyword optimization, creating pages for SEO purposes, and brainstorming what users will want to read and find. Think creatively. SEO is about attracting people with great content. I never realized before how user-geared current SEO practices are, which means the SEO expert juggles marketing, public relations, and advertising hats, too! Write well. You don’t have to be at a Pulitzer level, but you do have to express ideas logically and write effectively for your intended audience. When I learned that today’s great SEO has a lot to do with creating awesome content for the user, I immediately realized that this field was a good fit for me because I like words, and I’m a writer. Yay! I know I have a ways to go with the analytics and research, but I really enjoy my current role on the SEO team. It’ll be a slow trek to reach the level of some of you Mozzers! But I’m excited about SEO and hope you enjoyed hearing from my perspective as a newb. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO from a Newb's Perspective"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO from a Newb's Perspective"
    },
    {
      "level": "H2",
      "text": "Stereotypes about SEO"
    },
    {
      "level": "H2",
      "text": "Conversion from skeptic to supporter"
    },
    {
      "level": "H2",
      "text": "News alert: You, too, can join the fun"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Brooke McDonald\n          \n            Brooke McDonald\n          \n            Brooke McDonald"
}