{
  "url": "https://moz.com/blog/seo-gender-gap",
  "slug": "seo-gender-gap",
  "title": "How Big Is the Gender Gap Between Men and Women in SEO? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Just how big is the gender gap in the SEO industry, and how does it translate to tangible things like pay and job titles? To find out, the team at North Star Inbound mined the data from their State of SEO 2020 survey. Here are some of the things they learned.",
  "content": "How Big Is the Gender Gap Between Men and Women in SEO? Marketing Industry By: Nicole DeLeon August 24, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Nicole DeLeon August 24, 2020 How Big Is the Gender Gap Between Men and Women in SEO? Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. To anyone working in SEO, it’s fairly evident that this is a male-dominated industry. Although there are powerful women SEOs in the field (like Moz CEO Sarah Bird, for example), if you glance at a conference speaker lineup or peruse the bylines on search-related blogs, you’ll see that those who identify as female are few and far between. A recent list of the 140 most influential SEOs featured 104 men and just 36 women. So how big is the gender gap? And how does it translate to tangible things like pay and job titles? To find out, we mined the data from our State of SEO 2020 survey, which featured 652 SEOs in 51 countries. Here are some of the things we learned. But first, a mea culpa. If SEOs who identify as women have an uphill climb in this industry, there’s no doubt that female-identifying SEOs of color have a hill that is steeper still. I deeply regret not asking demographic questions on race and ethnicity which would have allowed us to analyze the disparate impacts that bias plays on BIPOC women SEOs. It was a missed opportunity. That said, we are currently running a survey on BIPOC in SEO that aims to cover those issues and more as we continue to take an introspective view of our industry. Men outnumber women by more than 2 to 1 in SEO Of the 652 SEOs who participated in the study, 191 identified as women (29.3%) and 446 identified as men (68.4%). Additionally, one identified as non-binary and 14 preferred not to say. Data was collected on a SurveyMonkey form. We reached out to our own database, purchased lists of SEOs around the world, and promoted the survey on social channels for respondents. We offered no compensation or reward for participating. Non-binary, persons who chose not to identify a gender by choosing “preferred not to say”, and SEOs from the African continent were underrepresented mostly due to the outreach database itself. Finally, respondents selecting non-binary and “preferred not to say” were not calculated in the men/women percentages. A voluntary survey is not a scientific sampling, but those percentages mesh with previous studies by Moz that found those who identified as women made up 22.7% of SEOs in 2012, 28.2% in 2013, and 30.1% in 2015. In all four studies, men outnumbered women by more than 2 to 1. Importantly, the new results suggest the gap hasn’t narrowed over the past five years. This was not a surprise to many female-identifying SEOs who participated in the study. “I started out in the SEO industry about 10 years ago. Compared to that, I do see more women at conferences, on online platforms, and in the day-to-day work with clients,” one said. However, she added that she hasn’t seen much progress in the last 5 years. “It’s like we are kind of stuck. I suspect it’s at least partly a visibility issue: Men have been there forever, building their reputation and expertise. It is hard to keep up with that if you had a late start.” We interviewed more than a dozen female-identifying SEOs, most of whom asked not to be named. Although a few had supportive bosses, clients, colleagues, and mentors along the way, many shared experiences of being passed over for promotions, having to fight to be heard in meetings and, in some cases, being paid less than men for the same work. “I think you can sum up the SEO industry by looking at speaker panels of all the major conferences. There is no equality. Are you a white male and 50+? You must be an expert! Are you a woman, 40, who’s been doing this since 2004? Oh, honey, go sit down. We have an expert already,” said one woman. She said she spent 13 years at a website development company being “constantly overlooked” before moving to a digital marketing agency where she is respected and valued. The gender gap is widest in Latin America Global internet usage has boomed over the past two decades, with more than 59% of the world’s population now online. Although internet penetration is highest in Europe and North America, more than three-quarters of global users live elsewhere. These growing markets are served by robust communities of SEO professionals on every continent. Our study reached SEOs in 51 countries, which we grouped into 11 large regions. Participation was highest in the U.S. with 269 SEOs responding, but we also surveyed 113 SEOs in Western Europe, 85 in the U.K., 43 in the Eastern Europe/Balkans region, 39 in Australia and New Zealand, 30 in Asia, 21 in Canada, 18 in Scandinavia, 16 in the Middle East, 12 in Central and South America, and 6 in Africa. We found that the gender gap is most pronounced in Latin America (83.3% who identified as men to 16.7% who identified as women) and Australia/New Zealand (82.1% who identified as men to 17.9% who identified as women). The gender gap is least significant in Africa (although with an admittedly very small sample size due to the small number of African SEOs in our database) and Canada (52.6% who identified as men to 47.4% who identified as women). Under Prime Minister Justin Trudeau, a self-professed feminist who appointed a gender-balanced cabinet, Canada has made gender equality a priority, but progress has been uneven at times. When it comes to gender diversity in SEO, the U.S., Asia, and the U.K. all trail behind Europe, Scandinavia, and the Middle East. Female-identifying SEOs are more likely to freelance and specialize in content Generally, the three most common career environments for SEOs are serving as an in-house expert at a single company, working in an agency setting, or operating independently as a consultant or freelancer. Each path has its own pros and cons. We found some interesting gender differences in where SEOs are working. Male-identifying and female-identifying SEOs are equally likely to work in-house, with about 40% of both genders working inside a single business. And as we discuss below, both genders reported being satisfied with the working conditions and level of support they received in their roles. Among those who practice their craft externally, men are slightly more likely to work in agencies than women (49.7% vs. 42.5%). The biggest gap was among freelancers. Female-identifying SEOs are almost twice as likely to be contractors or freelancers as those who identify as men (17.7% vs. 10.6%). However, it’s unclear if female-identifying SEOs are heading out on their own because they don’t feel they can get a fair shake working for others, or if they're drawn to the freedom and flexibility of freelance work. Full-time freelancing has grown steadily across the economic landscape in recent years. It also tends to draw more women than men. Part of the appeal may be flexibility around childcare, but control over income was also a factor for some of the SEOs we interviewed. “I think a lot of women choose to do freelance because they want to be paid what they deserve, frankly,” said one 25-year-old female SEO in East Anglia, U.K. However, another woman who works as an in-house SEO said, “When I got my start in marketing, most of the jobs offered to me were contractor roles, and it wasn’t clear how to become full time. It wasn’t by choice; it was what was available to me.” Many female-identifying SEOs said it was hard for them to get hired or promoted, even with stellar track records. “I’ve seen loudmouth, no-record, no-proof men be hired. It’s absolutely aggravating. At my old company, I was skipped by two men who had half the knowledge for supervisor positions. Each man left within months to different companies to the next title,” said a 41-year-old female SEO in Minnesota. She subsequently changed companies and found a much more welcoming environment. In addition to career paths, there are noteworthy differences in the areas of the industry that male-identifying and female-identifying SEOs are most likely to specialize in. Most SEOs consider themselves generalists, but among those who profess a specialty, women are twice as likely to be content experts (17.6% to 7.7%).On the other hand, male-identifying SEOs are nearly twice as likely to be technical experts (21.5% to 12.6%). It’s unclear if this is a result of choice, fallout from the gender gap in STEM occupations generally, or if those who identify as women feel unwelcome among tech SEOs. Among the female-identifying SEOs we interviewed, several said they think early gender stereotyping played a role, from the toys little boys and girls are given to what each gender is encouraged to pursue as a career. “It’s similar to why women are not often involved in engineering jobs. Technical roles are historically associated with developer training, and women are more likely to transition from the marketing side than the programming side,” one said. Several women also said technical SEO, in particular, is a “boys club.” “I participate in online forums for general Tech SEO and Women in Tech SEO, and the vibes are much different,” one woman said. “The male-dominated general forums are competitive. The female groups are more supportive, but again, we are trying to bring along and encourage women in the field.” Another tech SEO who worked at an agency and in-house before going out on her own as a contractor said the culture can be intimidating: “I find that men are quicker to hop on and attack people about technical knowledge than women.” Female-identifying SEOs generally charge less than men for their services To find out more about the dollars and cents of SEO, we asked the agency and contract SEOs who participated in our study about their pricing models. In all, 261 SEOs were willing to share how they price their services and how much they charge. The three most common pricing models are monthly retainers, per-project pricing, and hourly rates. Although there was a wide range of rates among male-identifyng and female-identifying SEOs, the medians were consistently lower for those who identified as women. Among agency and contract SEOs, men are more likely to price their services with monthly retainers (59.1% of men vs. 39.4% of women). Women are more likely to charge per project (31.8% of women vs. 18.2% of men). About a quarter of both groups use hourly pricing. But before we talk about prices... Before we get into the details of how much male- and female-identifying SEOs earn, it’s important to note that we didn’t ask who actually set the prices. Depending on the size of an agency, SEOs who work there may have very little control over the pricing structure. The agency’s rates might be standard, or they might vary depending on who does the work. One can assume that freelancers choose their own rates, although they might be responding to signals about what the market will bear and what clients are willing to pay. Some studies have suggested that a variety of psychosocial factors lead female-identifying freelancers to charge less than their male counterparts. For instance, a Hewlett-Packard study identified a confidence gap in which women tended not to apply for a promotion unless they met all the qualifications, but men would go for it if they met 60 percent of the job requirements. Conventional wisdom holds that women are more cooperative and men are more competitive. Whether or not that’s true, men initiate negotiations more readily than women and tend to ask for higher compensation. In a future study, we will certainly ask who determined the service pricing. For now, we can only report what male-identifying and female-identifying SEOs told us they charge. Retainers for those who identify as male are 28.6% higher than for those identifying as female Our respondents included 138 agency and contract SEOs who use monthly retainers as their primary pricing model. These retainers ranged from less than $250 a month to more than $25,000 a month, but overall they were higher for men. At the midpoint of the ranges on our survey, those identifying as male charge a median retainer of $2,250 a month while those identifying as female charge a median of $1,750. When we looked at agency SEOs and freelancers separately, the median for freelancers was much lower, but it was the same for both genders: $750 a month. However, the sample size was quite small. There were only 19 freelancers in the study who primarily use retainers. Among the 119 agency SEOs who use retainer pricing, the median retainer was $2,250 for those identifying as male and $1,750 for those identifying as female. Project prices for men are 66.7% higher than for women Our respondents included 54 agency and contract SEOs who typically charge on a per-project basis. The scope and cost of projects varied greatly, from less than $250 to more than $100,000. But the data showed that overall, men charge more per project — a median of $5,000 vs. $3,000 for female-identifying SEOs. We decided to dig deeper and found an interesting exception when we looked at agency SEOs and freelancers separately. The price gap was more than three times as wide among those who work in agencies. Our sample included 36 agency SEOs who use per-project pricing. Male-identifying SEOs reported that their agencies charge a median of $8,750 per project while those who identify as women said their agencies charge a median project fee of $2,250. The reverse was true among independent SEOs. The sample size was small, so we’re not sure what to make of it, but among the 18 freelance or contract SEOs we polled who charge by the project, women had the edge. Female-identifying freelancers charge a median fee of $3,750 per project to $1,750 for male freelancers. One contractor in her 50s hypothesized: “I think women may be more detail-oriented and spend more time with their project. Maybe men may charge less because they have more clients?” Median hourly rates for male-identifying SEOs are 16.8% higher than for female-identifying SEOs Our respondents included 57 agency and contract SEOs who typically bill by the hour. Among this group, the median rate is $125 for male-identifying SEOs vs. $107 for female-identifying SEOs. In this case, the difference is largely attributable to more women working as freelancers. The median rate for men and women SEOs at agencies was $125 an hour, and the median rate for both who work as contract or freelance SEOs was $88 an hour. Many of the female-identifying SEOs we interviewed said women tend to undervalue themselves and need to be more assertive in negotiating prices. “I think confidence and not being scared to charge what you’re worth comes into play for the higher rates,” said digital marketing and content specialist Kristine Strange. Both men and women feel equally supported as in-house SEOs Some good news for in-house SEOs: When asked about working conditions, frustrations, and pain points, both men and women had very similar responses. Both reported strong levels of interdepartmental cooperation and support for SEO priorities. Female-identifying SEOs are slightly more satisfied than male-identifying SEOs with in-house SEO resources The resources available to in-house SEOs are largely dependent on the size and fiscal health of the company that employs them. Among in-house SEOs, women are as likely as men to work for enterprise-level companies. We found that 27.1% of male-identifying in-house SEOs and 24.8% of female-identifying in-house SEOs work for companies with more than 250 employees. And 72.9% of male-identifying and 75.2% of female-identifying SEOs work for companies with 250 or fewer employees. In-house SEOs across the board rated engineering support as their biggest challenge. Female-identifying SEOs were generally more satisfied than their male peers with the expertise of their teams and their staffing levels. They were equally satisfied with other elements of their SEO programs. Conclusion Although there are some very prominent and talented female-identifying SEOs, they are still underrepresented. And when they do enter the field, they are often compensated at lower rates than men. There is no single solution to broadening the talent pool, but we have a few thoughts. Welcoming industry: The overwhelming number of women who spoke to us about these findings wished to remain anonymous. We can only assume that means female-identifying SEOs do not feel safe openly discussing issues of gender within an SEO workplace. Silence only serves to bolster the status quo. We must foster an industry culture that does not punish the whistleblower but instead seeks to listen, understand, grow, and improve opportunities for all its members.Training and mentoring: More than in many other industries, there isn’t one clear path to becoming an SEO. The STEM fields are one training ground, but many other SEOs learn the craft from mentors. To achieve more diversity, which is good for the industry and outcomes, it’s important for girls and those who identify as girls to be supported and welcomed into STEM classes during their student years. As an industry, we need to take the job of mentorship seriously. Experienced SEOs can do more to mentor young talent, particularly those who identify as women. Agencies can do more to recruit and hire people with different backgrounds. Several women whom we interviewed mentioned the importance of mentors and allies: \"I sit in countless calls where I say something and until my CTO repeats what I say, some clients don’t hear me. My CTO is so supportive and wonderful, and he will literally say, 'She’s right when she says, ‘Blah.’ She’s got 20 years under her belt… .' Then their light turns on.\" \"I’m good at learning complex software and doing complex technical tasks but wasn’t encouraged in this until my recent job — and even then, it wasn’t until I got a female manager that I was recognized for this ability and assigned those kinds of tasks on a regular basis.\" \"I spent the first two years double- and triple-checking all my work, backing everything with links from male experts in the industry. One day the CTO told me I didn’t need to do that. He trusted me. I found myself in the bathroom in tears. It took me a long time to stop sending links. (Sometimes I still send links, but only if I think he needs to read them to keep up with me!)\" Transparency about pay and pricing: The taboo about discussing fees and compensation keeps inequities hidden. It’s time to shatter that norm. Independent SEOs should run their pricing plans by mentors of all genders for perspective. Agencies should be sure that skill and experience, not gender, is the driving factor in pay and pricing. Don’t undersell yourself: If negotiation doesn’t come naturally to you, spend extra time preparing proposals. Research your competitors and talk with mentors. Focus on the value you’re adding. Be sure to factor in your skill level and experience as it grows. Don’t fall into the confidence gap trap. Even if you don’t tick all of the boxes, if you have most of the qualifications, forge ahead to apply or submit a proposal. I want to acknowledge the important role that several female-identifying SEOs played in the making of this article. First, I have the privilege of working with some amazing women every day in my SEO agency. Thanks to Cindy Glover, without whom I could not have produced this study. I also want to thank Areej AbuAli whose work in creating the Women in Tech SEO community has been an invaluable resource to the SEO industry and in particular, SEOs who identify as women. Women in Tech SEO not only helps to amplify the voices of those identifying as women within the community, but also helps connect them to each other. If you wish to explore your own possible implicit bias around issues of gender and career, check out Harvard’s Gender-Career implicit bias test. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Big Is the Gender Gap Between Men and Women in SEO?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Big Is the Gender Gap Between Men and Women in SEO?"
    },
    {
      "level": "H2",
      "text": "Men outnumber women by more than 2 to 1 in SEO"
    },
    {
      "level": "H2",
      "text": "The gender gap is widest in Latin America"
    },
    {
      "level": "H2",
      "text": "Female-identifying SEOs are more likely to freelance and specialize in content"
    },
    {
      "level": "H2",
      "text": "Female-identifying SEOs generally charge less than men for their services"
    },
    {
      "level": "H2",
      "text": "But before we talk about prices..."
    },
    {
      "level": "H2",
      "text": "Retainers for those who identify as male are 28.6% higher than for those identifying as female"
    },
    {
      "level": "H2",
      "text": "Project prices for men are 66.7% higher than for women"
    },
    {
      "level": "H2",
      "text": "Median hourly rates for male-identifying SEOs are 16.8% higher than for female-identifying SEOs"
    },
    {
      "level": "H2",
      "text": "Both men and women feel equally supported as in-house SEOs"
    },
    {
      "level": "H2",
      "text": "Female-identifying SEOs are slightly more satisfied than male-identifying SEOs with in-house SEO resources"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Nicole DeLeon\n          \n            Nicole DeLeon\n          \n            Nicole DeLeon"
}