{
  "url": "https://moz.com/blog/seo-is-all-about-you",
  "slug": "seo-is-all-about-you",
  "title": "SEO is all about you - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The customer is always right and should be the focus of any business or organization -- on-line or not.  Good SEOs know that.     I've been in SEO for about a year now.  As someone whose only Internet experience -- beyond websurfing, e-mail, and buying and selling stuff -- was an itty bit of…",
  "content": "SEO is all about you Content Marketing S By: stevenp February 6, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! S By: stevenp February 6, 2007 SEO is all about you Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. The customer is always right and should be the focus of any business or organization -- online or not. Good SEOs know that. I've been in SEO for about a year now. As someone whose only Internet experience -- beyond websurfing, e-mail, and buying and selling stuff -- was an itty bit of blogging and a short beginning HTML course coupled with no marketing or advertising expertise, I came in with a blank slate. If I had to sum up what I've learned about SEO in one maxim, I would say, \"SEO is all about you, the web surfer.\" True, black hat SEOs have and continue to find ways to game the system by cloaking content and the like, but their methods aren't sustainable as search engines -- or other SEOs and related ethicists -- eventually condemn such dodgy methods. Black hats only care about themselves, their clients, and egos, but not you. White hat SEOs, on the other hand, care about you. They want to know who you are. Where would you look for information? How do you suss out the relevancy of a website? What are you interested in? For example, how would you search for a restaurant in New York City? Or should I say NYC, the Big Apple, Queens, Broadway, or Central Park? Do you use words like \"deli,\" \"restaurant,\" \"eatery,\" or \"dining locale?\" How do you spell these words? Further, what do you expect on a web site of your ideal eatery? Do you want to read about the restaurant's history, detailed descriptions of menu items, tips for matching wines with specific courses, directions to the location, etc.? Should a site dazzle your senses with some pictures or fancy bells and whistles like AJAX? If you were to buy something from a diner online (ok, why would ya since food is typically the most yummy when it's fresh and straight out of the kitchen?), how would you want to order and pay for it? Answers vary depending on who you are and what you're looking for. While black hats may spend hours developing content that you won't see -- or even care to see -- and plotting ways to trick search engines, white hats take on a much harder task. They try to get to know who you and your buddies are, and that's tough since quality \"face time\" is hard to come by when we're only looking at a computer screen with various data. As picky and fickle search spiders can be, you're so much more nuanced and harder to decipher. That's a compliment. Search engines also focus on you. Their existence depends upon pointing you to the best information sources for whatever you desire as quickly as possible. You're the most important part of the online equation. If it wasn't for you -- including you erudite computer geeks from decades past, why would the Internet even exist? Unfortunately, black hat SEOs usually ignore you. That's a shame. So SEOmozzers, what is the hardest thing to learn about you as a person who just happens to surf the Information Superhighway? What about your fellow human beings? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO is all about you"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO is all about you"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "stevenp\n          \n            stevenp"
}