{
  "url": "https://moz.com/blog/seo-training-series-first-day-wrap-up",
  "slug": "seo-training-series-first-day-wrap-up",
  "title": "SEO Training Series - First Day Wrap up - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We just wrapped up the first day of our Pro Training Series 2009, and what a day it was! I think most people would agree with me when I say that the speaker line-up was absolutely amazing!",
  "content": "SEO Training Series - First Day Wrap up SEO Events By: Jennifer Sable Lopez August 24, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jennifer Sable Lopez August 24, 2009 SEO Training Series - First Day Wrap up SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. We just wrapped up the first day of our Pro Training Series 2009, and what a day it was! I think most people would agree with me when I say that the speaker line-up was absolutely amazing! Every single one of them brought their A-game and provided attendees with wickedly awesome information. I know, I know I'm a little biased eh? But I've seriously been in awe all day long, watching some of the best presentations I've ever seen. Throughout the day I've had my eye on the Twitter stream, responding, retweeting and keeping people up to date one what's coming next. Almost every single tweet has been positive except for the fact that it's freezing in here (but really, what conference isn't cold?? I freeze at every single conference I go to). As with SES San Jose, I've put together a compilation of all the amazing information that attendees have been coming away with and tweeting. The sessions and tweets are listed in descending order, in other words: select * from session order by session.time desc. Also you may be wondering where the Q & A session is... I felt it needed a post of it's own, so stay tuned! (Please excuse my horrible images, I had to use my cell phone.) Good Vs. Great: Why Some Startups Make the Leap and Others Don't Dharmesh Shah fabioricotta this was the best \"startup\" presentation I've ever seen... congratz @dharmesh and @seomoz fabioricotta we (SEOs) are web ninjas and maniacal about data - said @dharmesh xD #seomoz davidmihm @dharmesh \"successful entrepreneurs try things and fail very rapidly\" iterate CONSTANTLY #seomoz barbjacobucci @dharmesh has our attention at #seomoz. talkin' startups. barbjacobucci if you aren't completely embarrassed by your new product,you waited too long - @dharmesh #seomoz timpoindexter an entrepreneur's goal is to take their awful idea and make it suck progressively less over time, says @dharmesh at #seomoz conradsaam \"You will have many chances to screw things up.\" #seomoz cassy82 Financial Risk: 100% of $20 million VS 10% of $200 million (by @dharmesh) #seomoz MCrites @dharmesh the best feedback 4 startups is when people start paying you money. The second best feedback is when they STOP paying you. #seomoz conradsaam @dharmesh \"Write a blog, not a business plan\". #seomoz carriehinkle Listening to a great presentation from @dharmesh about building a successful tech startup @ #seomoz. \"Recruit superheros in the making\" PPCSummit From @dharmesh, the best startups grab the customers that are sitting on the sidelines and not yet in the game to sell to. #seomoz The Pacman Chunk of the Piechart: Getting Links Tom Critchlow SEOmom #SEOmoz Seminar. Tom Critchlow covers link bldg w/your Unique Selling Proposition... + pic of Rand as Dr Evil. fabioricotta Good points on how small brands can beat big brands - by @tomcritchlow at #seomoz seminar fabioricotta good point by @tomcritchlow - \"identify successfull strategies\" - you can begin by using SEOmoz Top Pages tool! #seomoz cassy82 Competitor Analysis: There are basic links in each niche Get them all. Reverse Engineer your competitors! #seomoz cassy82 Great Phrase \"Competitors are people who rank\" by @tomcritchlow #seomoz fabioricotta Good tip by @tomcritchlow - Investigate the links to sites already listed in niche directories #seomoz Ed_Reese Just realized Will and Tom Critchlow are not the same person. Thought Will reverse aged somehow since last year. #seomoz MCrites @tomcritchlow is killing it with linkbuilding tips... love the idea of broadening link sources across niches #seomoz fabioricotta @tomcritchlow is blowing my mind with all fast tips he is giving at #seomoz seminar Ed_Reese Use Google's Content Network to find companies open to linking back to you. Great tip from @tomcritchlow #seomoz cassy82 Linkbuilding Requires Resource: Business Development Managers, Community Managers, Developers #seomoz MidiaDigital uma das melhores palestras de seo que eu já vi. Estratégias avançadas de lkb em inglês britanico e em 45min hehehe #seo, #seomoz Sustain Verticality for 3 Rounds David Mihm - Local Search SEOBoy Google local business center (LBC) best to approve listing manually to maximize Google's trust. By David Mihm at #seomoz. Ed_Reese @davidmihm & Google Local. Check out his incredible Local Ranking Factors for the complete details: http://bit.ly/HQPPF #seomoz fabioricotta you should use microformats to improve your local search rankings - by @davidmihm #seomoz cassy82 Location Page Optimization Tips-> Submit your location page for each location as your LBC Url, use geographic kwd in Titles #seomoz Ed_Reese Per @davidmihm Link out from your contact page to main citation sources and YouTube videos to increase rankings & reviews. #seomoz MidiaDigital David Mihm e Matt Brown falando sobre busca local e universal search: ambos falam da importância dos microformats. #seo, #seomoz Matt Brown - Image & News Search Ack! twitter glitch... no tweets coming through. Matt's giving us awesome information! Tips for optimizing news - which is easier than image optimization. How do you get image search to turn into money? Alt attribute is the highest ranking factor. Keyword in the filename Differentiate alt text - don't want all the pictures on a page with the same alt text Ed_Reese Arrrgh. Twitter down right in the middle of the #seomoz conference. ThunderSEO Optimizing your image alt tags can help your search engine rankings #seomoz (via @matthewjbrown) cassy82 News search mistakes to avoid: registration walls, changing URLs, changing headlines to update story, bad relateds #seomoz Make SEO Tools Work for You Nick Gerner - Linkscape and other SEOmoz tools dharmesh At the #seomoz seminar. @gerner totally rocks. He's one smart freakin' dude. seomoz Woot! @gerner talks about the value of #seomoz Q & A and how to find answers to questions already answered plus get specific answers cassy82 You Want to Be here ->mR = mT! #seomoz fabioricotta @dannydover citou o bit.ly como ferramenta para monitorar links de competidores... #seomoz Tools from Across the Web Danny Dover davidmihm @dannydover presenting @seomoz 'how to make seo reporting sexy' obviously step one is to grow KILLER facial hair #mozinar Ed_Reese Add a \"+\" to the end of any bit.ly link to get almost real time analytics. \"Sweeeeeet!\" #seomoz SEOBoy SEOs need to better understand the web developer world to improve overall campaigns from @DannyDover at #seomoz First you Get the Keywords, Then you Get the Money Ken Jurina Enquisite Linkscape Ed_Reese Enquisite mentioned as tool for long-tail keyword research. It's a good anlaytics tool. Worth checking out. #SEOmoz #mozinar ThunderSEO Use Google Insights, Trends, and AdWords tool & IceRocket, ScoutLabs and Twitter to find low-competition keywords #seomoz cassy82 Usando O Google Keyword Tool, Volume alto de busca, e pouca competicao, eh hora de atacar! #seomoz SEO is Nothing without Content Structurally Sound: SEO for Site Architecture Jeremy Dearringer @Rand at @seomoz training \"Links, Links, Links!\" http://yfrog.com/4zqa7j MCrites SEOmoz Pro Training Seminar Word of the Day: \"automagically\" cassy82 Se o nofollow esta funcionando em seu site, para que remove-los? #seomoz grav At SEOmoz training - let your privacy policy get crawled - don't block in robots.txt, use rel=\"noindex, follow\" instead. mpvanwinkle SEOMOZ Rand Fishkin notes that for content-driven sites, sharing is your most important call-to-action. make is a priority in your design cassy82 How to earn links to UGC -Make it Easy to Share -Reward Links with Trackbacks -Make Sharing functions a Call To Action #seomoz briancarter SEOmoz 2009 Tips & Tricks Seminar Kicks Off http://bit.ly/9wP6L #seomoz See you all tomorrow for more great tips, tricks and information! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Training Series - First Day Wrap up"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO Training Series - First Day Wrap up"
    },
    {
      "level": "H2",
      "text": "Good Vs. Great: Why Some Startups Make the Leap and Others Don't"
    },
    {
      "level": "H2",
      "text": "The Pacman Chunk of the Piechart: Getting Links"
    },
    {
      "level": "H2",
      "text": "Sustain Verticality for 3 Rounds"
    },
    {
      "level": "H2",
      "text": "Make SEO Tools Work for You"
    },
    {
      "level": "H2",
      "text": "Tools from Across the Web"
    },
    {
      "level": "H2",
      "text": "First you Get the Keywords, Then you Get the Money"
    },
    {
      "level": "H2",
      "text": "SEO is Nothing without Content"
    },
    {
      "level": "H2",
      "text": "Structurally Sound: SEO for Site Architecture"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez"
}