{
  "url": "https://moz.com/blog/seo-kpis-to-track-with-google-analytics",
  "slug": "seo-kpis-to-track-with-google-analytics",
  "title": "SEO KPIs to Track with Google Analytics - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In my previous post titled \"Top 15 Web Metrics\" I wanted to share with you some useful web metrics which should be tracked for a classified (e-commerce) site with a free analytics tool such as Google Analytics. This time, I'd like to fo...",
  "content": "SEO KPIs to Track with Google Analytics SEO Analytics M By: Maciej Gałecki December 9, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! M By: Maciej Gałecki December 9, 2009 SEO KPIs to Track with Google Analytics SEO Analytics This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. In my previous post titled \"Top 15 Web Metrics\" I wanted to share with you some useful web metrics which should be tracked for a classified (e-commerce) site with a free analytics tool such as Google Analytics. This time, I'd like to focus more on tracking KPIs related to SEO. Why? You'll all probably agree with me that: SEO is always a long-term process which never really ends, SEO is always about a lot of resources and efforts put to gain maximum profits which are visible after some time. These two reasons are important enough to take a very close eye on efficiency of SEO in order to have a clear picture if the process is on the right track. Below you'll find my list of favourite SEO KPIs which we are able to track with Google Analytics and therefore quite often deliver to our clients. Please note I am always referring to \"organic search\" traffic data and the order of KPIs is completely random. CRITICAL SEO KPIs (these are my favourites and give the most valuable information) 1. Number of landing pages It is a good general insight into a website's exposure in search engine listings - you can see how many pages rank well enough to be found by search engine users. 2. List of landing pages Defining a list of web pages that deliver the highest number of visits is valuable, too. These \"gates\" may be then optimized to improve e.g. the quality of traffic (you can see a bounce rate of the Top 2 pages which is over 75% while the bounce rate of the homepage is significantly lower - but still needs improvement). 3. Most popular templates of landing pages For most of the database driven websites, URLs are based on specific patterns. Thanks to this you may be able to use regular expressions in the list of landing pages to define groups of pages built on the same template (e.g. product card / product category page / search results page). Analyzing traffic volume and its changes for every type of page separately brings a valuable input on SEO friendliness level. Finally, it helps to define required SEO improvements to be applied to a template. 4. Average number of keywords per landing page This helps to understand how well developed your \"long tail\" area of search is. The more unique keywords which drive traffic, the better - it also means that your target group uses a really sophisticated language to find the content of your website and that the search engines are able to understand the content quite well rewarding you with a lot of top rankings for different key phrases. However you need to remember that this metric strongly relies on the amount of content available at each web page - if there's no keyword-rich text available it's very difficult to obtain high numbers here. Alternate way to collect the same data is through \"Custom Reports\" > \"Pivots\": 5. Conversion rate per keyword Apart from possessing knowledge on top keywords with the highest conversion, it's sometimes worth doing a more advanced analysis (again using regular expressions) to define the most popular common words included in key phrases and calculate the conversion rate of phrases they are a part of (see table below). Being aware of the fact that e.g. all phrases with \"free\" word generate a higher conversion rate may be very valuable to further SEO improvements on site. 6. Number of unique keywords that drive traffic Top organic keywords seem to be obvious but are definitely worth taking into consideration. This KPI allows to better understand popularity of topics and informational needs of users interested in the content of the website. 7. Total organic traffic Also an obvious one - presents aggregated info on traffic changes. Optionally can be split by search engine (see 1st important KPI below for more details). 8. Number of unique branding keywords that generate traffic While branded keywords drive the most valuable traffic, it's important to know how many unique keywords are used by people. This allows you to discover brand mistypings as well as all brand associations to generic keywords like [brand widgets] (see 'bluerank certificates' in the example above). Having this information helps to optimize other online marketing activities, e.g. PPC campaigns. From the SEO point of view this is an interesting input to plan content optimization of particular sections of the website. 9. Keywords used in first / last visit in the purchasing process We all know that users often make several visits on the same website before they make a decision and complete a purchase online (see SEOmoz's \"Path for Conversion\" video on more details). Because of that measuring conversion rate in different ways may bring completely different conclusions. Google Analytics assigns conversion to the last visit by default but with some additional configuration of user defined values and cookies (see examples here and here) you can easily track conversion rate for keywords used in previous visits at the same time as well. Both information will help to define most valuable (profitable) keywords to focus on in the SEO process. 10. Top profitable / popular keywords in different search engines Search engine algorithms are unique, that is why your website may get top rankings for different keywords in each search engine (see results for 'bluerank' above). Collecting this information from one search engine may help you to find out new keyword opportunities and ideas for your main (the most popular) search engine you put the most SEO efforts on. 11. ROI of the SEO process I think this KPI doesn't require a more detailed explanation, too. We usually calculate it in relation to growth of traffic (where each visit is expressed by some CPC rate) or sales driven by organic traffic. 12. Branded to non-branded traffic As I said before - if there is little non-branded traffic it means that the website is unable to rank well for generic keywords. The low volume of branded traffic clearly shows that brand awareness needs a strong support – users do not even make navigational queries to reach the website. Furthermore, this metrics is in close correlation with number of landing pages (see point 1 above) - branded traffic typically drives visits to a very limited number of brand-related pages (homepage + few other key pages) while non-branded traffic covers all \"searchable\" web documents. IMPORTANT SEO KPIs (valuable to have, may be useful on less regular basis than critical KPIs) 1. Organic traffic per search engine It gives a nice insight into the general exposure across different search engines. Any significant differences between the observed traffic share and the market share of specific search engine may prove lack of performance in SEO for it. 2. Length of queries By knowing the average number of words per query it helps to understand the characteristics of the traffic. If more complex phrases bring more visits then we can assume that performance of the Long Tail SEO is good. Both generic, short keywords and the Long Tail are quite different (e.g. are used differently in specific phases of the purchase process) that is why having the information on performance of particular groups of words helps to plan future improvements in the SEO process. 3. Most commonly used words in key phrases Similarly to unique keywords these are definitely worth to be analyzed as well. Performance of the most commonly used words defines necessary improvements in the content particularly in the Long Tail area. For example, in one of the classified websites we found out that most visits were coming from key phrases containing: \"for sale\", \"used\", \"second hand\", \"buy\", \"ads\", \"in [CITY]\". This enabled us to put more keyword rich text which - when used on thousands of ad details pages - brought a significant amount of new traffic. 4. Relative growth of organic traffic SEO performance can be evaluated by finding an answer to these questions: Do we grow faster than our niche / competitors? Do we grow faster than the size of our target group (which expands naturally along with the internet penetration in country?) What are the areas of the biggest growth? Is it because of more content online / seasonal popularity? 5. Bounce rate per search engine / keyword Search engines sometimes have a slightly different user profile (I am now referring to the demographic criteria). Taking this into consideration when analyzing bounce rate may help to understand how the website content is perceived by different segments of people. On the other hand bounce rates on keyword level tell a lot about the quality and performance of the keyword analysis phase in the SEO process (do we focus on right keywords?). 6. Average length of visit / visit duration Similarly to the bounce rate, duration or the length of visit are good quality benchmarks of the organic traffic channel. The picture above (point 5 of important KPIs) clearly shows that the quality of traffic driven by Bing.com is much higher than for other search engines. SEO results achieved there are definitely worth investigation in more details regarding keywords, etc. As a result it may be valuable to introduce conclusions in the Google & Yahoo! part of SEO to improve the overall performance. Please note that the visit duration may sometimes be misleading as time spent on the last page (ie. exit page) in the visit is always ignored by web statistics (= cannot be tracked). 7. Volume of traffic coming from \"Universal Search\" By applying filters or other more advanced configuration of Google Analytics you can easily track number of visits coming from \"Universal Search\" related sources such as Google Images (nice example here), Google Base (example here), Google News (example here), etc. Not only it gives the possibility to examine how well exposed particular resources of your site are but it gives a valuable feedback on effectiveness of SEO process in different search services. 8. Traffic growth for keywords related to the one you focus on Even if you limit your SEO efforts to one keyword (let's say \"widgets\") you are most likely to see its impact on rankings of phrases that contain this keyword (e.g. \"blue widgets\"). Tracking traffic changes of such a \"side effect\" provides an insight on competitiveness of the group of keywords and helps to determine the effectiveness as well as resources needed for further SEO improvements. 9. Relative / absolute traffic growth for specific keywords Helps to monitor what's currently \"hot\" and popular (e.g. because of seasonal trends). When keyword rankings are also tracked in Google Analytics (see example on how to do this) it's also possible to measure the influence of rankings on the volume of driven traffic. Finally it helps to calculate the effectiveness of the SEO process. 10. Branded keywords with low ranking If you identify any branded keywords with a ranking below Top3 it means you experience an unused potential and probably a source of highly relevant traffic is partly lost. It's for sure a \"must have\" improvement to be taken into account in future steps of the SEO process. \"GOOD TO KNOW\" SEO KPIs (I find this KPIs as a nice addition that can sometimes help to make more useful conclusions, particularly when one of the above mentioned KPIs is being investigated) 1. Average number of visits per keyword This value itself does not explain anything (keywords have different popularity, etc.) but tracking it over time - especially if the keyword rankings are the same - enables to verify users' interest and attention to links listed in search results. If growing, this means people are clicking more frequently and they like your website entry in SERPs more. 2. Users' loyalty This is another traffic quality factor that provides information on the characteristics of the organic traffic. It's particularly important for community based websites while it clearly shows if SEO fulfills business goals. In addition to that I recommend you analyze keywords by visitor type (see table below) so that loyalty of users is also examined on keyword level: 3. Conversion rate per search results page / keyword ranking As you can collect the information on keyword position and the number of search results page (see point 9 of important KPIs), it's sometimes valuable to verify conversion rates between Top3 keywords and the ones that are ranked at the 2nd page of results. It helps to see whether people are converting more frequently because: your website is their first choice (e.g. Top3 link)? they do more detailed research (and find your site in the second page)? Whatever is the answer, it helps to allocate resources and put more focus on gaining better exposure in particular areas where the conversion rates may be slightly higher. 4. Keyword rankings I have already mentioned twice that you can track keyword rankings with Google Analytics. However due to the personalization of search results I don't think it's a relevant and useful KPI anymore. Nevertheless keyword rankings can be particularly interesting e.g. to identify areas and regions where your website doesn't rank well enough so that further improvements in local SEO can be done. I hope you'll find this list of KPIs useful though I am looking forward to hearing your comments and opinions related to your experience on determining efficiency of the SEO process. Can you find any other interesting reports that should be taken into account to measure the performance of SEO? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO KPIs to Track with Google Analytics"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO KPIs to Track with Google Analytics"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Maciej Gałecki\n          \n            Maciej Gałecki\n          \n            Maciej Gałecki"
}