{
  "url": "https://moz.com/blog/seo-myths-a-list-and-discussion",
  "slug": "seo-myths-a-list-and-discussion",
  "title": "SEO Myths - A List and Discussion - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Bill Slawski starts an SEO Myths thread at Cre8asite that's a true gem. I've excerpted some of my favorite myths he's covered, but it's the evidence and explanations that contain the meat of this post, so take a visit:\nMYTHS of SEO:\n\nSEO copywriting means writing strong copy, then inserting…",
  "content": "SEO Myths - A List and Discussion Public Relations By: Rand Fishkin November 29, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 29, 2005 SEO Myths - A List and Discussion Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Bill Slawski starts an SEO Myths thread at Cre8asite that's a true gem. I've excerpted some of my favorite myths he's covered, but it's the evidence and explanations that contain the meat of this post, so take a visit: MYTHS of SEO: SEO copywriting means writing strong copy, then inserting keywords within the copy a number of times. Keyword density is important, and you don't want too much or too little. You should place content above menus to have it \"crawled first\" Meta tags are the key to high rankings The more links the better Pagerank is dead There are thousands of search engines to submit your site to You need to submit your site to the major search engines. Resubmitting sites to search engines helps your site get crawled more frequently Appearing in DMOZ is essential to high rankings High rankings are the aim of SEO (I love this one) Optimizing for specific keyword phrases is the goal of SEO (this one too) Software, which compares your use of keyword phrases in titles, headlines, meta tags, etc., with pages that rank highly for those terms can help you rank highly for those phrases. Participating in pay-per-click or paid impression programs on the search engines can help or harm your search rankings. Search engines don't index dynamic sites Brilliant work, Bill. I'm waiting for the print edition. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Myths - A List and Discussion"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO Myths - A List and Discussion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}