{
  "url": "https://moz.com/blog/seo-conference-preparation",
  "slug": "seo-conference-preparation",
  "title": "How to Prepare for an SEO Conference, Including MozCon - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Looking to make the most out of your SEO conference experience? Discover how the right preparation can boost your team's strength, energy, and enthusiasm during and after events like MozCon. Whether you're a seasoned attendee or a first-timer, our guide will ensure you maximize the rewards and make…",
  "content": "How to Prepare for an SEO Conference, Including MozCon SEO Events | Moz News By: Jo Cameron Edited By: Emilie Martin May 16, 2024 Table of Contents Copied! By: Jo Cameron Edited By: Emilie Martin May 16, 2024 How to Prepare for an SEO Conference, Including MozCon SEO Events | Moz News This blog was originally published July 12, 2023, and has been updated with new information for MozCon 2024. Conferences are a whirlwind experience. Regardless of your industry, conferences give you the chance to step out of your home office and into a dynamic environment filled with valuable talks from industry experts, vendor booths offering swag and software solutions, networking opportunities galore, and unforgettable after-parties. This year we're back at the iconic Garage for food, drinks, pool, and of course Karaoke. SEO conferences, like MozCon, are more important than ever as more teams are distributed across countries and time zones. With the right preparation, you can use conferences to boost your energy, strengthen your team, and enhance your enthusiasm for work during and after the event. This guide will equip you with essential tips to make the most of SEO conferences, in-person or virtual. Get ready to dive into the world of SEO conferences and virtual experiences. In-person tickets are 95% sold out; grab yours now while you can! Before you arrive So you've secured your ticket to an industry event—lucky you! It's time to gear up and make the most of this experience. Whether you're attending in person or via a remote-friendly livestream option, preparation is key to getting the most value. Follow these essential steps to maximize your experience and ensure you're fully equipped for any conference, including our very own MozCon. Define your goals and objectives Knowing what you want to achieve will help you make the most of your time and focus on the sessions and activities that align with your interests. Think about what you want to have achieved once MozCon wraps. What do you want to feel? Aside from more than a little bit spent. Do you want to feel more connected? Do you want to have an answer to a burning question? Do you want to meet someone IRL? Do you want to have a stash of valuable notes to take away and share with your team? Sing Karaoke for the first time? MozCon gives you the ability to achieve all these things. At MozCon, in addition to learning from incredible speakers, you will have the chance to mingle with like-minded people at our Birds of a Feather tables. Drop by vendor booths to explore a new solution to a problem. Connect with SEO experts at the Moz Pro booth, and much more! So pack your comfy shoes, as well as your party shoes and your best Karaoke jam at the after party. Clear your calendar That meeting can wait! While I don't want to leave you in a jam, if your virtual sync can wait, and we know it can, then block it out of your calendar in advance. Too often I see folks hunched up in conference corridor corners taking calls during events. While there are lots of conferences going on throughout the year, your company, or if you're freelance, YOU, have funded your ticket, meals, and travel to this event. Be present, be engaged, and be ready to learn. “If you want to meet someone specific, talk to a speaker, or organize dinner with friends, plan in advance. Conferences move quickly, and nothing is more disappointing than trying to connect with someone on the last day only to realize they had to catch an early flight. Most speakers are happy to meet new people and talk about our topics and interests.” — Dr Pete Meyers Familiarize yourself with the agenda For multi-track conferences in particularly it's important to know what sessions you want to attend. Take a peak at the speaker lineup and bookmark your favs. For the hyper-organised, or disorganised depending on how you look at it, you can add events to your calendar so you don't forget (I pretty much do what my calender tells me to do anyway.) For those who attended Brighton SEO recently you'll know that the smaller rooms tends to fill up quickly. I like to turn up early to the session and snag a chair so I don't miss out. MozCon is a single track event, so I definitely advise planning to attending every talk. There is plenty of time in the breaks to pick up swag, get a picture with your team and all that other good fun stuff. Take a closer look at the MozCon minute-by-minute agenda to identify the topics that align with your learning goals. Even if a particular topic seems unrelated to your work, it can still provide valuable insights. “Because I work in local SEO, I attend MozCon's livestream with my ears tuned to pick up any great tips that can be applied to local business marketing. Even if the main topic of a talk isn't local search, I can come away with half a dozen tips that are relevant to my own area of marketing because organic and local SEO have so much overlap.” — Miriam Ellis Book affiliated and non-affiliated side events There are usually a lot of great events going on locally around conferences which give you more changes to meet with folks in your industry giving you another friendly face to connect with during the event. In Brighton I particularly enjoyed the SEO Mindset podcast recording and the inaugoral Green SEO meet up. This year at MozCon the unofficial Sunday night bash is worth snagging a ticket to, hosted by the fabulous Noah Learner and Nick LeRoy. If you don't want to just do SEO things, we have a great Seattle field guide with something for everyone, where you're a sightseers, foodie, museum lover, nature lover, sporting type or want to try something totally new. Gather your note-taking tool of choice Make sure you have all the necessary tools at hand. Charge your laptop or tablet or choose any other preferred method for note-taking. If you plan on sharing takeaways with your team, well, unfortunately, telepathy won't work, but you can still find ways to communicate effectively. “At the end of each day, take five minutes, go through your notes, and turn them into a few bullet points and ONE action item. If you have one action item per day at the end of an event, that's great. Otherwise, if you're like me, you'll come home to a page of notes like \"SEO! AI!! INTERSECTION OF FUTURE!\" and have no idea what you were talking about.” — Dr Pete Meyers MozCon includes tables and power outlets so you can stay plugged in and switched on for all your note-taking needs. Bring your note-taking tools of choice! Connect with the speakers before the event Check out our impressive lineup of speakers, perhaps there is someone speaking you’ve not yet connected with? Take some time to understand their specialty. Even if you’re not currently working within that field, it may be a new learning opportunity for you, or it may help you gain a better understanding of the challenges your colleagues are facing. Ultimately, conferences are a great opportunity to develop a more well-rounded understanding of the entire search industry, what’s on the horizon, and what to pay attention to in search. Ramp up your SEO learning Define what you want to achieve and create a plan to maximize your experience. Having clear goals will help you stay focused and make the most of the event. Subscribe to the Moz blog or sign up for a Moz Academy course—don't forget you can bundles certifications with your MozCon ticket. These will give you access to a wealth of content to boost your knowledge in advance of the big event. From basic SEO to local search and technical details, there's something for everyone. Additionally, the blog will provide conference recaps after each day, so you won't miss out on any important updates. Prepare to network and engage MozCon, and many other SEO conferences, offer you ample opportunities to meet new people and expand your professional network. Maximize your networking opportunities before you get there. Before you arrive in Seattle, get familiar with the digital landscape by following the #mozcon hashtag on Twitter. Join the LinkedIn group, and while you're there, follow us on Twitter, LinkedIn, Instagram, Facebook, and Threads, because why not? If you are in the Women in Tech SEO, or Noah Learner's SEO Community you can join the #MozCon channel in these slack communities. This will keep you updated on MozCon fellow attendees’ plans and movements and allow you to engage with speakers and ask questions. “MozCon doesn't do Q&A after talks — it's difficult to manage for an event of this size, with a packed schedule and a single stage. But, if you have a question that is actually about a speaker's talk, they'd almost certainly love to hear it. It's implicitly great feedback to know that someone was engaged and interested in what I was saying, even (especially!) if they don't entirely agree.” — Tom Capper Feeling overwhelmed when it comes to meeting people IRL? Don't worry. You're not the only one. Listen to Ross Simmonds's Podcast, Create Like the Greats episode: Networking for Introverts, for tips on overcoming networking challenges. During the conference It's the day of the event! If you've followed all the tips above then you know exactly what you're wanting to achieve and maybe even made some connections with other attendees or speakers. But if not, no problem! You can still maximize your SEO conference experience, and avoid running yourself into the ground. Whether you’re attending online or in person, we’ve got some tips from seasoned MozCon speakers and attendees to keep you engaged during the event. What to bring on the day Your ultimate packing list doesn't have to be a mile long, you can pack light and still be well prepared. Just don't forget to pack: A water bottle to stay hydratedLong sleeves, cardigan or blazer — opt for comfort, if you tend to get a bit chilly in office buildings and conference centersYour comfy shoes — you might be on your feet quite a bit in SeattleA power supply for your laptop — stay charged so you don't miss a thing!Your business cards — yes they are still a thing, but if you're so inclined you can also create a digital business card with a QR code. Either way don't lose touch with the folks you meet and chat with. Register early When attending any conference, it’s helpful to get the lay of the land prior to the event so you can float on through to the action uninterrupted. At MozCon, we offer early registration on the Sunday before the event. If you are arriving early and want to get a jump on badge collection and a sneak peek at the new venue, drop by registration to check in and pick up your badge. Unable to make it to early registration? No problem. Set your alarm and arrive at the conference bright and early so you're not rushing your morning cuppa and missing the opening remarks! Attend every session Controversial perhaps? And, of course, impossible for multi-track events. But for single track events, like MozCon, I would advise making the most out of the conference experience by attending every.single.session, consider the gauntlet thrown! This also means you have the chance to network with every speaker if you bump into them in the conference hall or after-party. Luckily MozCon is a single-track event, so you don’t need to make any difficult decisions. You can find your spot in the auditorium, set up camp, and let the inspiration absorption begin! Hydrate Even if you’re solely powered by caffeine and SEO insights no one can deny the boost a bit of H2O provides (especially if you’re jet-lagged.) Folks travel to MozCon from near and far, as the below attendee pin-map attests. Make sure you're able to be your best self despite the impact of travel on your energy levels. “Make sure you have a water bottle and snacks in your bag - nothing hinders memory and productivity like hunger and dehydration!” — Meghan Pahinui No matter where you have traveled from remember to stay hydrated — and caffeinated! Jot down hot tips immediately You've been following these steps diligently, haven’t you? If so, you have already prepared your note-taking tool of choice. Whether it’s a giant Gdoc filled with links and screenshots, the notes app on your tablet, the twitter app loaded up filtered by the #mozcon hashtag and a finger poised and ready to hit fav, or a trusty notepad and pen. Even if you’re not a massive note-taker there is nothing more valuable than jotting down a few lines as your grey-matter is percolating. Light bulb moments happen in a flash. If your boss or colleague asks you what you learned, you’ll be pleased you thought of your future self and kept a few bullet points for yourself and anyone else who asks. “Write down ideas as soon as you have them. As you’re listening to talks and interacting with conference-goers, you’re bound to get ideas for your own strategy. Be sure to write them down ASAP - with so much information flying around, you’re bound to forget them if you don’t. It can be as simple as using the notes app on your phone or slacking yourself a quick reminder note. That way, when you get home from the conference, you’ll already have a list of ideas to springboard off of.” — Meghan Pahinui If, like me, you like to grab a picture or two of the slides, my hot tip is to enable live mode on your iPhone. That way, if the speaker toggles away from your slide of choice you can edit the key photo to the previous slide. “I make a live list of everything I hear that could be of value to local brands. Then, if I want to revisit a particular tip later, I re-watch the presentation via the video bundle. It's helped me write some really good blog posts!” — Miriam Ellis Let yourself think Thinking and doing are two very different things. If, like many of us, you're busy executing projects five days a week/52 weeks a year, this may be the time you need to let thoughts enter your brain and connect with other thoughts in order to, in some abstract way, find a solution. “Let your mind wander. It's ok. I don't know why, but when I'm planted in a seat at a conference, and my mind is fully on SEO, I get more quality thinking done than just about anywhere else. If you solve a few difficult work problems by ignoring three minutes of my presentation, I'll get over it. You can watch the video later.” — Dr Pete Meyers Mingle in-between sessions “Talk to Strangers - The most rewarding part of MozCon, IMO, is meeting new people that you may know for years after. Sit down at an unfamiliar lunch table, strike up a conversation over breaks, visit the sponsor booths, and work up your courage at events. You don't need any special networking skills — simply asking people where they are from is often enough to get started.” — Cyrus Shepard Network network network! There is one experience that isn’t replicable outside of a conference event, and that’s the opportunity to connect with people in real life. Maybe you know them through LinkedIn, maybe you follow each other on Twitter. Nothing cements a professional connection more than chatting over breakfast, grabbing a much-needed coffee. “Don't be afraid to walk up to a table at lunch and ask if you can sit with them! MozCon is a really welcoming place, and making new friends and connections can be as easy as having the confidence to say hello!” — Hannah Waye Plan to mingle between sessions, don't forget to drop by the vendor booths! MozCon 2018 attendees sharing stories at a 'birds of a feather' table. Grab a selfie with Roger Roger is Moz's SEO robot who recently underwent an AI transformation and is somewhat partial to taking selfies with MozCon attendees. Perhaps this is the first time you've seen your team in a while. Why not take this as the perfect opportunity to grab a group picture together?! Whether you're a MozCon veteran or a first-timer, you won't want to miss the iconic MozCon photo op with Roger! - Melissa Rae Brown Grab a snap with your team at MozCon! Tips for attending virtual events Many of our tips are translatable to attending virtual events, like the MozCon livestream option. You just need to get creative about how you network and stay engaged. To get the most out of any virtual event you will still want to arrange how you will take notes, connect with speakers on social media, and set your team up to get the most out of the talks. Treat it like an IRL event We still recommend booking out your calendar when attending virtual events. It’s so easy to get distracted, and as much as we tell ourselves we are capable of multitasking, how much are we really absorbing? Clear your calendar and your headspace, take as many notes as you feel would be helpful to you, and filter your Twitter feed by #mozcon to stay in the fold and be part of the fun. Set up a watch party Book out your office conference space and order some snacks so you can watch MozCon live from whichever city you are located in. If your team is distributed, set up a lunchtime sync to check in and chat about what you’ve learned so far. If you are all in different time zones, create a new Slack channel to share insights with your teammates. Why are conferences more important than ever? With so many teams moving towards partial or fully distributed setups, finding time to get together is more valuable than ever. Conference attendees have the unique opportunity to connect with industry contacts, ask questions, and establish genuine professional relationships with experts in search marketing and SEO. And remember: “No one is truly a stranger at MozCon. You may never attend another event where so many people have so much in common with you.” — Cyrus Shepard Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Prepare for an SEO Conference, Including MozCon"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Prepare for an SEO Conference, Including MozCon"
    },
    {
      "level": "H2",
      "text": "Before you arrive"
    },
    {
      "level": "H3",
      "text": "Define your goals and objectives"
    },
    {
      "level": "H3",
      "text": "Clear your calendar"
    },
    {
      "level": "H3",
      "text": "Familiarize yourself with the agenda"
    },
    {
      "level": "H3",
      "text": "Book affiliated and non-affiliated side events"
    },
    {
      "level": "H3",
      "text": "Gather your note-taking tool of choice"
    },
    {
      "level": "H3",
      "text": "Connect with the speakers before the event"
    },
    {
      "level": "H3",
      "text": "Ramp up your SEO learning"
    },
    {
      "level": "H3",
      "text": "Prepare to network and engage"
    },
    {
      "level": "H2",
      "text": "During the conference"
    },
    {
      "level": "H3",
      "text": "What to bring on the day"
    },
    {
      "level": "H3",
      "text": "Register early"
    },
    {
      "level": "H3",
      "text": "Attend every session"
    },
    {
      "level": "H3",
      "text": "Hydrate"
    },
    {
      "level": "H3",
      "text": "Jot down hot tips immediately"
    },
    {
      "level": "H3",
      "text": "Let yourself think"
    },
    {
      "level": "H3",
      "text": "Mingle in-between sessions"
    },
    {
      "level": "H3",
      "text": "Grab a selfie with Roger"
    },
    {
      "level": "H2",
      "text": "Tips for attending virtual events"
    },
    {
      "level": "H3",
      "text": "Treat it like an IRL event"
    },
    {
      "level": "H3",
      "text": "Set up a watch party"
    },
    {
      "level": "H2",
      "text": "Why are conferences more important than ever?"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    }
  ],
  "author": "Jo Cameron\n          \n            Jo Cameron\n          \n            Jo Cameron"
}