{
  "url": "https://moz.com/blog/seo-quick-fix",
  "slug": "seo-quick-fix",
  "title": "Find Competitor Keywords, Fix Redirect Chains, and Find Duplicate Content with Moz Pro - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "From finding the keywords your competitors rank for to identifying redirect chains that impede crawlers, we've highlighted 4 common SEO issues that Moz Pro can help solve. Check out four quick videos designed to help level up your skills and get the most out of the tools.",
  "content": "The SEO Quick Fix: Competitor Keywords, Redirect Chains, and Duplicate Content, Oh My! Moz Tools | Technical SEO | Keyword Research By: Erin McCaul April 24, 2018 Table of Contents Copied! By: Erin McCaul April 24, 2018 The SEO Quick Fix: Competitor Keywords, Redirect Chains, and Duplicate Content, Oh My! Moz Tools | Technical SEO | Keyword Research I have an eight-month-old baby. As a mom, my time is at a premium, and I’ve come to appreciate functionalities I didn’t know existed in things I already pay for. My HBONow subscription has Game of Thrones AND Sesame Street? Fantastic! Overnight diapers can save me a trip to the tiny airplane bathroom on a quick flight? Sweet! Oxiclean keeps my towels fluffy and vanquishes baby poop stains? Flip my pancakes! Moz Pro isn’t just a tool for link building, or keyword research, or on-page SEO, or crawling your site. It does all those things and a little bit more, simplifying your SEO work and saving time. And if you’ve run into an SEO task you’re not sure how to tackle, it’s possible that a tool you need is right here just waiting to be found! It’s in this spirit that we’ve revived our SEO Quick Fix videos. These 2–3 minute Mozzer-led tutorials are meant to help you get the most out of our tools, and offer simple solutions to common SEO problems. Take Moz Pro for a spin! Today we’ll focus on a few Keyword Explorer and Site Crawl tips. I hope these knowledge nuggets bring you the joy I experienced the moment I realized my son doesn’t care whether I read him The Name of the Wind or Goodnight Moon. Let’s dive in! Fix #1 - Keyword Explorer: Finding keyword suggestions that are questions Search queries all have intent (“when to give my baby water” was a hot Google search at my house recently). Here’s the good news: Research shows that if you’re already ranking in the top ten positions, providing the best answers to specific questions can earn you a coveted Featured Snippet! In this video, April from our Customer Success Team will show you how to pull a list of keyword phrases that cover the who, what, where, when, why, and how of all the related topics for keywords you’re already ranking for. Here’s the rub. Different questions call for different Featured Snippet formats. For example, “how” and “have” questions tend to result in list-based snippets, while “which” questions often result in tables. When you’re crafting your content, be mindful of the type of question you’re targeting and format accordingly. Looking for more resources? Once you’ve got your list, check out AJ Ghergich’s article on the Moz Blog for some in-depth insight on formatting and optimizing your snippets. High five! Fix #2 - Site Crawl: Optimize the content on your site Sometimes if I find a really good pair of pants, I buy two (I mean, it’s really hard to find good pants). In this case, duplicates are good, but the rules of pants don’t always apply to content. Chiaryn is here to teach you how to use Site Crawl to identify duplicate content and titles, and uncover opportunities to help customers and bots find more relevant content on your site. When reviewing your duplicate content, keep a few things in mind: Does this page provide value to visitors? Title tags are meant to give searchers a taste of what your content is about, and meant to help bots understand and categorize your content. You want your title tags to be relevant and unique to your content. If pages with different content have the same title tag, re-write your tags to make them more relevant to your page content. Use our Title Tag Preview tool to help out. Thin content isn’t always a bad thing, but it’s still a good opportunity to make sure your page is performing as expected — and update it as necessary with meaningful content. Check out Jo Cameron’s post about How to Turn Low-Value Content Into Neatly Organized Opportunities for more snazzy tips on duplicate content and Site Crawl! Fix #3 - Keyword Explorer: Identify your competitors’ top keywords Cozily nestled under a few clicks, Keyword Explorer holds the keys to a competitive research sweet spot. By isolating the ranking keywords you have in common with your competitors, you can pinpoint their weak spots and discover keywords that are low-hanging fruit — phrases you have the content and authority to rank for that, with a little attention, could do even better. In this video, Janisha shows you how targeting a competitor’s low-ranking keywords can earn you a top spot in the SERPS. Check out all that overlapped opportunity! For a few more tips along this line, check out Hayley Sherman’s post, How to Use Keyword Explorer to Identify Competitive Keyword Opportunities. Fix #4 - Site Crawl: Identify and fix redirect chains Redirects are a handy way to get a visitor from a page they try to land on, to the page you want them to land on. Redirect chains, however, are redirects gone wrong. They look something like this: URL A redirects to URL B, URL B redirects to URL C… and so on and so forth. These redirect chains can negatively impact your rankings, slow your site load times, and make it hard for crawlers to properly index your site. Meghan from our Help team is here to show you how to find redirect chains, understand where they currently exist, and help you cut a few of those pesky middle redirects. Looking for a few other redirect resources? I’ve got you covered: Moz's Learning Center: Redirection 301 Redirects – How to Redirect Your Website Search Console Help: Change page URLs with 301 redirects Alright friends, that’s a wrap! Like the end of The Last Jedi, you might not be ready for this post to be over. Fear not! Our blog editor liked my jokes so much that she's promised to harp on me to write more blog posts. So, I need your help! Find yourself facing an SEO snafu that doesn’t seem to have a straightforward fix? Let me know in the comments. I might know a Moz tool that can help, and you might inspire another Quick Fix post! Get a free month of Moz Pro If you’re still interested in checking out more solutions, here’s a list of some of my favorite resources: The SEO Learning Center: If you need a refresher on SEO basics or need to do a gut-check, the Learning Center has your back. Moz SEO Training: Whether you need to master your next skill or get your team ramped up on the basics, live training courses can help. Our Next Level blog series, focused on helping you solve SEO problems with Moz Pro. We cover lots of topics: How to Target Multiple Keywords with One Page I've Optimized My Site, But I'm Still Not Ranking—Help! Geomodified Searches, Localized Results, and How to Track the Right Keywords and Locations for Your Business Diving for Pearls: A Guide to Long-Tail Keywords Presenting Your Findings: How to Create Relevant and Engaging SEO Reports Stay cool! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The SEO Quick Fix: Competitor Keywords, Redirect Chains, and Duplicate Content, Oh My!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The SEO Quick Fix: Competitor Keywords, Redirect Chains, and Duplicate Content, Oh My!"
    },
    {
      "level": "H2",
      "text": "Fix #1 - Keyword Explorer: Finding keyword suggestions that are questions"
    },
    {
      "level": "H2",
      "text": "Fix #2 - Site Crawl: Optimize the content on your site"
    },
    {
      "level": "H2",
      "text": "Fix #3 - Keyword Explorer: Identify your competitors’ top keywords"
    },
    {
      "level": "H2",
      "text": "Fix #4 - Site Crawl: Identify and fix redirect chains"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "Moz AI: Introducing Augmented Intelligence"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Erin McCaul\n          \n            Erin McCaul\n          \n            Erin McCaul"
}