{
  "url": "https://moz.com/blog/seo-ppc-content-marketing-smm-which-services-sell-best",
  "slug": "seo-ppc-content-marketing-smm-which-services-sell-best",
  "title": "SEO, PPC, Content Marketing, or SMM: Which Services Sell Best? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Are you selling the digital marketing services people actually want to buy? Alex Tachalova shares her insights from researching the searchability and salability of the top four digital marketing niches: SEO, PPC, SMM, and content marketing.",
  "content": "SEO, PPC, Content Marketing, or SMM: Which Services Sell Best? SEO Basics | Marketing Industry By: Alexandra Tachalova March 10, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Alexandra Tachalova March 10, 2016 SEO, PPC, Content Marketing, or SMM: Which Services Sell Best? SEO Basics | Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. [Estimated read time: 12 minutes] Each search query in Google is a demand signal for us digital marketers. If you know exactly what users are looking for, you can easily spot what they’re likely to buy. From a common sense point of view, it’s quite logical to say that if users search for something more, they are able (and likely) to buy more. As it turns out, this correlation doesn't work within digital marketing niches. The commercial potential of a certain digital marketing service is not in direct proportion to the search volume it receives. In other words: In the digital marketing industry, popularity doesn’t influence salability. In the four digital marketing niches analyzed, I discovered: SEO is still the most desirable service and it has the highest chance of leading to conversion. Users want to know more about social media and content marketing, but they’re not ready to pay for it. Users who are searching for PPC are the most likely to be converted. After digging further into this article, you’ll discover which digital marketing services are the best to sell and why. Armed with this data, you'll inform your strategy and have a leg up on your competitors. Are the digital marketing services you’re selling the ones users are ready to buy? Nowadays, we see how the digital marketing sphere is moving more and more towards content marketing and social media marketing (SMM). Everybody talks about these services — I'm no exception here. Moreover, there are plenty of digital marketers who are confident that without social media you can't rank properly in Google (I'm not one of them). However, it's true that SMM and content marketing are now more important than ever. I was recently browsing through some BrightonSEO speeches and noticed that a substantial proportion of those talks were about content, SMM, copywriting, and even PR. I noticed the same situation with SMX events and many others. SEO seems like it's becoming less important. But what about market demand? “What are our potential clients really interested in purchasing?” I asked myself. I conducted a study to find out. User search behavior in SEO, PPC, SMM, and content marketing niches I analyzed 4 digital marketing niches: SEO, PPC, content marketing, and SMM. Why did I choose these niches? They represent the top four services offered in the US digital marketing industry. Recently, I conducted a survey regarding the current state of digital marketing agencies’ services, costs, and payment models. Among the insights that I gained, I determined the most and least popular digital marketing services that agencies are selling today. Top digital agency services offered in the US market. However, this data was gathered solely from service providers, including agencies and freelancers. After considering these results further, I came to the conclusion that they don't necessarily correlate with what clients want to buy. This all-important factor is completely missing from the data. It was time to do some research on market demand via the most accessible information I could get: search queries. Over 112,800 search queries were analyzed. Because I’m experienced in keyword research, it was an easy task for me. I took the top four services offered in the US and created lists of keywords that are related to SEO, SMM, PPC, and content marketing. These keywords were mostly collected with the help of Serpstat and SEMrush. After I created a final list, I used Google Keyword Planner, which provided me with the most accurate cost-per-click and search volume metrics. In the following graphic, you can see sums of search volumes of queries concerning these niches: To figure out how the popularity of a niche influences its commercial potential, I divided all queries related to these four niches into two groups – general queries and those that are agency-related. I put search queries in the “agency-related” category if they had any kind of commercial interest, e.g. if they included words like “fees,” “costs,” “prices,” “consultant,” “service,” “company,” “agency,” etc. Agency-related queries spot the cases when users are ready to buy a service, while general queries are simply informational queries. This distribution reflects the balance between what users are looking for versus what they are ready to buy, so here are my top hints: 1. SEO is still the most desirable service and it has the highest chance of leading to conversion. SEO is a leading niche that attracts the highest search interest, as well as the most potentially commercial queries. If you're already selling SEO services, don't stop. And if you aren’t, perhaps you should start. 2. Users want to know more about social media and content marketing, but they’re not ready to pay for it. The social media niche attracts a lot of searchers, but they're less likely to pay for it. Although content marketing generates quite high search volumes, users aren't likely to pay for it, either, as only four percent of queries are commercial. 3. Users who are searching for PPC are the most likely to be converted. PPC, on the contrary, attracts less searchers; as we can judge from the sum of its search volumes, PPC is 10 times less popular than SEO. Nevertheless, it enjoys a higher frequency of agency-related keywords than the content marketing niche, and about 10 percent of its agency-related queries are likely to result in the purchase of PPC management services. I also took a look at the most searchable and the most expensive keywords connected with these four niches and compared them. I assumed that they wouldn't correlate. Market demand is represented by search volumes, which means that the most searchable keywords are the queries a lot of people use. However, the most expensive keywords mirror the most competitive niches, which have a really limited audience of potential clients. In order to determine if I was correct, I compared the top five most searchable and most expensive keywords in each of the four niches. The most expensive keywords show low search volumes. By looking at the table below, you can see that my hypothesis was absolutely correct. The higher the suggested bid, the lower the number of searchers. The average search volumes of the top five most expensive keywords for each investigated niche do not exceed 100 searches. Average Suggested Bid Average Search Volume SEO $91.5 100 PPC $87.74 40 Content Marketing $84.96 36 Social Media $107.4 28 Average search volume and suggested bid for the top 5 most expensive keywords The opposite trend was revealed for the most searchable keywords, where the average suggested bid is less than $20 USD, but the average search volume exceeds 5,000 searchers. Average Suggested Bid Average Search Volume SEO $16 27,460 PPC $18.2 5,340 Content Marketing $15.2 26,640 Social Media $6.8 27,980 Average search volumes and suggested bids for the top 5 most searchable keywords Based on this data, it’s obvious that you'll pay less for keywords that have a larger search volume. Those keywords are informational search terms, rather than commercial ones. 8 facts about the most searchable and most expensive keywords In the following diagrams you can see the top five most popular keywords and their search volumes in Google US, as well as the top five most expensive keywords and suggested bids. SEO niche Fact 1: A lot of people choose to deal with SEO issues themselves — at least, they try to with the help of special tools. In the SEO niche, the most searchable keywords are general queries like “SEO” and “search engine optimization.” Also, a lot of users search for “SEO tools,” which is the fourth most searchable query. The search volumes of these keywords indicate that a lot of users would rather deal with SEO issues on their own, and that they’re looking for professional SEO tools. It's no secret that new analytic tools are released every day to compete for rule of their respective marketing niches. On the other hand, quite a lot of users search Google for “SEO company,” which is the fifth most searchable query, and that indicates they're eager to delegate SEO problems to paid professionals. Fact 2: \"SEO strategy template,\" with a CPC of $120.28, is used by Google to promote AdWords. As for the top five most expensive SEO keywords, I found they're quite a curious set. The most expensive SEO-related keyword is “SEO strategy template,” which costs $120.28. This is a consulting query, so why has it become so expensive? To find it out, I analyzed this query with the help of SEMrush’s Keywords Analytics tool. The results were eye-popping to me. The most mind-blowing thing here is Google’s actions. It turns out that Google itself is paying for this keyword to appear in paid search. What’s even more interesting: Google is also paying for “SEO strategy template” to show the Adwords page in paid results. This would seem to prove that not all rules apply to everyone: we have to maintain the relevancy of landing pages and keywords for pages appearing in Google ads... but Google may not be subject to those restrictions. A campaign's quality score is based on CTR, ad relevance, and landing page experience. It's obvious that users searching for \"SEO strategy template\" have no interest in using Google AdWords! Keyword ads history for \"SEO strategy template\" PPC niche Fact 1: Users don't want to deal with PPC on their own. It's worth noting that the top five most expensive keywords are agency related. They are “PPC management agency,” “top PPC companies,” and “pay per click management service.” Fact 2: The majority of the top five most expensive PPC keywords are agency-related search terms. As we've already discovered, the PPC niche isn't the most searchable digital marketing topic; remember, it receives 10 times less searchers than SEO. Nevertheless, it receives a rather large proportion of agency-related queries. Ironically, people are ready to spend their time running SEO on their own in order to make it “free.\" But when it comes to ads campaigns, they prefer to find an agency or consultant. Social media marketing niche Fact 1: SMM education is getting popular. In the social media marketing niche, all of the most searchable keywords are also general queries, like “social media” or “social media definition.” Also, almost all of the top five most expensive keywords for SMM are connected with education in the SMM sphere, namely obtaining a masters degree and online courses: “MBA in social media marketing,” “social media masters,” “masters in social media marketing,” and “online social media marketing course.” Fact 2: Users have realized that managing social media also requires a strategy. The query “What is social media strategy” appeared in the top five most expensive SMM-related keywords. I'm sure we can qualify this query as consultancy-related. There's a high probability that users who are searching for an SMM strategy are willing to hire an expert to master their SMM channels. Content marketing niche Fact 1: Contently is the ultimate leader. In the content marketing niche, there's a brand search query in the top five most searchable keywords — “Contently\" — which is a great example of how a company that provides content marketing software can achieve a wide presence in their niche. Also, one of the most searchable queries is “content management system.” I would say that such queries are likely to lead users to purchase professional content marketing services. Fact 2: The most expensive keywords are related to content management tools. The content marketing niche, unlike the other digital marketing niches I’ve analyzed, has a strong correlation between market demand and PPC rates. All of the most expensive keywords are also connected with content management systems: “content management system database,” “Drupal content management system,” “what does a content management system do,” and the niche query “healthcare content management.” Obviously, many people are struggling to organize their content strategies and processes and are looking for a proper management system. The high prices for these keywords are in direct response to market demand. Best SEO and PPC companies according to Google US “That’s all interesting,” I thought, “but how does the situation look from the point of view of a potential client who's unaware of what’s going on in the market?” Let’s suppose that this potential client is a perfectionist and they want to buy services from the very best company. They would ask Google \"what are the best SEO and PPC companies?\", so I did as well. Hint: I bet you've never heard of a majority of them. I analyzed Google’s SERPs for the queries “best SEO company” and “best PPC company” and chose agency domains that appeared in the first 10 results for each of these SERPs. You can see the results in the following graphics. For the query “best SEO company,” agency domains that appeared in the first 10 results were Highervisibility.com, Boostability.com, Pagetraffic.com, and Outspokenmedia.com. I used SEMrush to analyze the organic search visibility these domains received from December 2013 to October 2015. Because SEMrush only reports on traffic based on keywords, I decided to add Similarweb and watch organic search visits for these domains for the year 2015. Actually, I discovered absolutely non-positive trends — you can see this in the graphic below. The following digital agencies appeared in the first 10 results in Google’s SERP for the query “best PPC company”: Jumfly.com, Wordstream.com, and Straightnorth.com. For these domains, I analyzed data concerning their paid search visibility with the help of SEMrush. In the following graphic, you can see the results: For more detailed data for 2015, I created a Paid Search Visits report for these domains with the help of SimilarWeb. As you can see, the majority of the best SEO and PPC companies according to Google are not the ones you might expect. Google’s ranking algorithms, despite constantly being improved and moving increasingly towards human-centered logic, are still far from perfect. View the complete infographic here. SEO, PPC, content marketing, and SMM thrashed out Now that we've discovered the current market demand for the most popular digital agency services, you can use this data to better understand your potential clients and create more effective strategies. Here's a short recap to help kick off the conversation in the comments. The major findings are as follows: High search volumes for certain topics don't always mirror high-converting niches. You should always further investigate this correlation. (Note: You can easily apply this to any market’s landscape research, not just the digital marketing industry.) SMM and content marketing are relatively new spheres, and they enjoy very high search volumes compared to PPC and SEO. But be aware that SMM and content marketing receive less commercial queries that are likely to be converted. I have no idea why, but SMM education has become an extremely competitive niche. In fact, there are more experts who are ready to provide SMM courses than those who want to receive SMM education. If you want to sell SMM training courses, be prepared to enter into a highly competitive market! As for content marketing, content management services are now competing against content management systems; so far, Contently is winning this battle. Do you have any other thoughts, questions, or ideas? I'm super excited to hear them — sound off in the comments! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO, PPC, Content Marketing, or SMM: Which Services Sell Best?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO, PPC, Content Marketing, or SMM: Which Services Sell Best?"
    },
    {
      "level": "H2",
      "text": "Are the digital marketing services you’re selling the ones users are ready to buy?"
    },
    {
      "level": "H2",
      "text": "User search behavior in SEO, PPC, SMM, and content marketing niches"
    },
    {
      "level": "H3",
      "text": "I analyzed 4 digital marketing niches: SEO, PPC, content marketing, and SMM."
    },
    {
      "level": "H3",
      "text": "Over 112,800 search queries were analyzed."
    },
    {
      "level": "H4",
      "text": "1. SEO is still the most desirable service and it has the highest chance of leading to conversion."
    },
    {
      "level": "H4",
      "text": "2. Users want to know more about social media and content marketing, but they’re not ready to pay for it."
    },
    {
      "level": "H4",
      "text": "3. Users who are searching for PPC are the most likely to be converted."
    },
    {
      "level": "H4",
      "text": "The most expensive keywords show low search volumes."
    },
    {
      "level": "H4",
      "text": "The average search volumes of the top five most expensive keywords for each investigated niche do not exceed 100 searches."
    },
    {
      "level": "H2",
      "text": "8 facts about the most searchable and most expensive keywords"
    },
    {
      "level": "H3",
      "text": "SEO niche"
    },
    {
      "level": "H4",
      "text": "Fact 1: A lot of people choose to deal with SEO issues themselves — at least, they try to with the help of special tools."
    },
    {
      "level": "H4",
      "text": "Fact 2: \"SEO strategy template,\" with a CPC of $120.28, is used by Google to promote AdWords."
    },
    {
      "level": "H3",
      "text": "PPC niche"
    },
    {
      "level": "H4",
      "text": "Fact 1: Users don't want to deal with PPC on their own."
    },
    {
      "level": "H4",
      "text": "Fact 2: The majority of the top five most expensive PPC keywords are agency-related search terms."
    },
    {
      "level": "H3",
      "text": "Social media marketing niche"
    },
    {
      "level": "H4",
      "text": "Fact 1: SMM education is getting popular."
    },
    {
      "level": "H4",
      "text": "Fact 2: Users have realized that managing social media also requires a strategy."
    },
    {
      "level": "H3",
      "text": "Content marketing niche"
    },
    {
      "level": "H4",
      "text": "Fact 1: Contently is the ultimate leader."
    },
    {
      "level": "H4",
      "text": "Fact 2: The most expensive keywords are related to content management tools."
    },
    {
      "level": "H2",
      "text": "Best SEO and PPC companies according to Google US"
    },
    {
      "level": "H2",
      "text": "SEO, PPC, content marketing, and SMM thrashed out"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Alexandra Tachalova\n          \n            Alexandra Tachalova\n          \n            Alexandra Tachalova"
}