{
  "url": "https://moz.com/blog/seo-for-journalists-introduction-keywords-part-1-of-5",
  "slug": "seo-for-journalists-introduction-keywords-part-1-of-5",
  "title": "SEO For Journalists: Introduction & Keywords (Part 1 of 5) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Introduction When told that writing for the Web is different to writing for print publications, the understandable reaction of many journalists is that it shouldn’t make any difference; we’re writing for people, not machines, they say.        But there is a need to write differently for the Web and…",
  "content": "SEO For Journalists: Introduction & Keywords (Part 1 of 5) Keyword Research C By: Ciaran Norris April 13, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! C By: Ciaran Norris April 13, 2007 SEO For Journalists: Introduction & Keywords (Part 1 of 5) Keyword Research This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Introduction When told that writing for the Web is different to writing for print publications, the understandable reaction of many journalists is that it shouldn’t make any difference; we’re writing for people, not machines, they say. But there is a need to write differently for the Web, and the reasons for this are quite simple: the way that people use the internet and, in particular, search engines to find and consume content is very different to the way that they find it in print publications - and search engines have certain guidelines as to what makes for useful, well presented content online. In this article and the ones that follow it, we explore not only how you can write more effectively for web users, but also what you need to do to make sure what you write is read and can be found easily. Keyword Research When writing online, it is very important to be mindful of the exact words that are used in an article. To put it simply, search engines assume that an article which contains the same words or exact phrase that a searcher has entered is likely to be more relevant than an article which does not (there are obviously other factors as well, but we’ll look at those in later articles). Where this most often affects journalists who are used to writing for print, is that in a magazine people will recognise a word or phrase even if it's not one they would use themselves. But if they don’t use the same phrase or word as the journalist when they’re searching for information on that subject, our article may not rank. To give an example, a topic that crops up all the time in Farmers Weekly is the single farm payment plan (it's an agricultural subsidy). As it’s quite an unwieldy phrase, the abbreviation SFP is commonly used when referring to it in the magazine and, as it's one that is generally understood by the readership, it causes no problems. However, when people search for information on this topic, we find that they tend to use the full version rather than the abbreviation: By using the abbreviation rather than the full version when writing for the web, there is the potential to miss out on a large amount of traffic. Once the journalists on Farmers Weekly found out about this, they changed their use of the words. If you’re not sure why people would use a longer version of a word, phrase, or abbreviation, a quick way to find out is by searching on that phrase – if results matching the content type don’t come up at the top of the 1st page, they are likely to search again. As an example, we could take the abbreviation app, which stands for application and is frequently used in the IT titles like Computer Weekly. But if you search for app you actually get a lot of sites with nothing to do with that sector. Again, in this case people are more likely to search with the full length word in order to find the content they require. So, to recap the basics of keyword research & usage: Think about the words & phrases that people are likely to be using when searching for information on a subject (this will often mean avoiding acronyms, abbreviations, in-house jargon, etc..) Check which version of a phrase gets more searches (using the free keyword tools provided by Google or Yahoo!) See what kind of information the engines return on a particular search term – if it’s not the same as the content you’re creating, don’t use that phrase. Next: Why your headlines matter. Note: This article was originally written as part of a training programme for the journalists at UK B2B publisher Reed Business Information. Ciarán Norris is now the SEO Director at UK search marketing agency eyefall. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO For Journalists: Introduction & Keywords (Part 1 of 5)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO For Journalists: Introduction & Keywords (Part 1 of 5)"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ciaran Norris\n          \n            Ciaran Norris"
}