{
  "url": "https://moz.com/blog/seo-auditing-success-whiteboard-friday",
  "slug": "seo-auditing-success-whiteboard-friday",
  "title": "SEO Auditing Success – Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Discover five actionable tips to improve your approach to SEO auditing for greater success in this Whiteboard Friday.",
  "content": "SEO Auditing Success – Whiteboard Friday Whiteboard Friday | Marketing Industry By: Aleyda Solis October 27, 2023 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Aleyda Solis October 27, 2023 SEO Auditing Success – Whiteboard Friday Whiteboard Friday | Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Edited by Emilie Martin Discover five actionable tips to improve your approach to SEO auditing for greater success in this Whiteboard Friday. Click on the whiteboard image above to open a high resolution version in a new tab! Let's talk about SEO auditing success nowadays. We can agree that as an SEO, we audit websites in order to identify challenges and opportunities, in order to establish an action plan to execute and achieve our goals. However, the sad reality is that only 20% of SEOs have recommendations implemented more than 90% of the time. On the other hand, this ends up causing only 17% of SEOs to achieve SEO goals more than 90% of the time. So, in the end, I'm afraid that we have a little bit of a challenge in the core area of our activities, right? 5 tips for SEO auditing success So in order to tackle this, I have five tips that I expect that you can start playing around, testing, and, let's say, introducing a little bit in your SEO execution in order to achieve different types of goals that we are getting at the moment. Prioritize a high-impact action plan First tip, a radical top 10, high-impact action plan prioritization while using storytelling, a little bit leveraging that storytelling to connect better with stakeholders and decision makers who are going to reach our recommendations, right? And you might say, Aleyda, I already prioritize my recommendations. We all tend to do, let's say, low-effort, high-impact prioritization, and that's true. The issue is when we document our recommendations, we end up more or less, I will say, most of the times, including too much still, right, because we want to show that we have assessed everything, that we haven't left anything else and we end up documenting whatever format of 30 pages, 40 pages, more than 50 pages. Who is going to read that? It's very challenging, very difficult. Like, we don't have time for that. Also, even if we have time and understanding to go through it with stakeholders, resources are limited most of the time. So we need to simplify things. We need to actually select those top 10 high-impact actions that are doable, are feasible to implement this iteration right now, right, like not in six months, not in a year, right now, to eliminate noise, to show that we are not recommending whatever doesn't work on the website, but those particular areas that we know that if we tackle, we are going to achieve results, the goals that we have set for our process, right? And for this, it is important that we explain the what. What is the issue, the challenge, the opportunity about this, what we can achieve with it in a way that decision-makers that are non-technical also understand, the why is this so critical, important towards the achievement of our goals and the how to do it, providing a couple of ways to achieve it. So those collaborating with us in the development or content team have a little bit of room for exploring options here. But as you can see with this, we'll be able to better communicate those different aspects and elements that are really, really, really key for the achievement of our goals. Develop a low-hanging fruit framework The second tip, develop a low-hanging fruit framework. And I'm not going to get too much in deep in this particular case because I already did a Whiteboard Friday some months ago about this particular topic. But let's say if you go on take a look a little bit at this Whiteboard Friday that I talk about how you shouldn't spend a month doing or analyzing, going through the audit, gathering information just for a month later, after we start with the SEO process, to send, like, again, a 100-page recommendation that nobody's going to execute anyway. So by developing a low-hanging fruit framework, we'll be able to already start sending some actions after the first week because there are different scenarios that will tend to exist across any SEO process anyway. Like for example, improving the click-through rate of those already well-ranked pages that might need a little bit of tweaking and title descriptions, for example, optimizing the features a little bit for features, and a little bit more internal linking too of those already almost well-ranked pages that have no internal links or those pages that used to get a lot of traffic and have been decreasing lately that partially, many times, because they have lost their freshness, they need to be updated, et cetera, right? So with this low-hanging fruit framework, we can tackle these very prevalent issues right away, and establish this connection with the client also so they can see results faster. That eliminates a lot of this, let's say, weight that doesn't necessarily help SEO because of its long-term nature, right? Set an SEO quality framework The third aspect here, set an SEO quality framework to educate, validate, and monitor when there are any issues or boxes. The problem is that a lot of our SEO execution is held back by those prevalent boxes that arise once second and third time that we're implementing something, right? So rather than building, we end up only fixing what already exists. And realistically, most of the time, building is how we achieve results, right? So I highly, highly, highly recommend that when you develop your recommendations, you also establish this education program. You do webinars with the tech, with the content team, and with the digital PR team, using, and leveraging the insights that you have identified from the website directly. So these are very, very, very relevant to what you actually want and need. Then you establish a validation framework with the developers especially. So there is not only a checklist that, of course, needs to be used across team members, but also whatever is doable to implement, and integrate directly with the CMS that you're using, you can do it. And then, of course, before and after releasing anything, there should be this acknowledgment and this workflow of what-if scenarios. What if you launch something that it's not how you expect it to be done, right? Like should it be reverted right away? Should it be fixed after it's launched? What should happen? There should be an acknowledgment within the team. And then, of course, a really good real-time monetization system. There are many tools out there nowadays that will allow you to do this with not only technical configurations but also content elements. What is important here is that you configure those very specific alerts that will be very meaningful for you. So you are not receiving whatever alerts every single day, so it becomes noise, and you don't really pay attention after a while. So this needs to be very, very relevant. Forecast and test to stop ambiguity Fourth tip, forecast and testing to kill ambiguity and \"it depends.\" This is very funny because we all know how we love, say it depends in SEO. The problem is that if we are asked by decision-makers about when are we going to achieve X or if it is viable to achieve Y, and the only thing that we answer is \"it depends,\" of course, that doesn't necessarily establish reliability. It generates ambiguity. At the end of the day, they will prefer to allocate those resources to other areas rather than SEO. So that doesn't necessarily help us to avoid, or eliminate this, we can establish forecasts and pilot projects. We can say, okay, if we are able to execute X and Y based on these scenarios, we can expect that after six months or after a year based on this forecast at this click-to-rate curve, this search volume, the seasonality, we are able to get X or Y too. But if you are not able to execute X, only Y, well, we won't be able to achieve all that, but only this. Like this, they will be able to see and like the clarity, in a much more straightforward way, how our actions and implementations and resources that they give to us connect with the goals, right? So I will say that this is particularly critical, especially when they are asking about what is doable, what is not, what is achievable, and what is not. And then to test if still like that, we don't get the buy-in to do stuff, let's say, okay, allow me to place to develop a few tests with this particular categories or with this particular areas to implement what we are recommending in a much smaller scenario so we don't need that much of many resources, in general, right, that much support. And like that, we can prove value right away, much faster, and get the buy-in later on for the full implementation. Communicate no execution trade-off The fifth tip is about communicating no execution trade-off. And this is important, right? Hey, you're not giving me the resources. You're not giving me flexibility. Perfect, but you know, what are the consequences of this? There's always a trade-off, and it should be fundamental that we communicate this trade-off. The trade-off is that we will be losing market share versus our competitors if our competitors are doing X or Y instead of us. And you can develop a little bit of a forecast with data that you can get from third-party tools. They're all current ranking data, and what will happen if they achieve X or Y, too, if they do X or Y. Or what will it cost if you will end up getting this type of traffic and conversions with other channels, like by search rather than SEO? Many, many times, they will end up perceiving that the cost of SEO is much lower actually, and it's not as expensive as they think it is if we show how much this same traffic will cost with other channels. So I expect with all of these tips, it will be much more flexible, doable, and viable for you to start executing those SEO audit recommendations. And at the end of the day, achieve results, which is what we want here. Thank you very much. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Auditing Success – Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO Auditing Success – Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "5 tips for SEO auditing success"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    }
  ],
  "author": "Aleyda Solis\n          \n            Aleyda Solis\n          \n            Aleyda Solis"
}