{
  "url": "https://moz.com/blog/seo-rankings-drop-guide",
  "slug": "seo-rankings-drop-guide",
  "title": "SEO Rankings Drop: A Step-by-Step Guide to Recovery - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There are hundreds of things that could cause your Google organic rankings to drop. Follow this handy guide to figure out what went wrong, and what you can do about it.",
  "content": "SEO Rankings Drop: A Step-by-Step Guide to Recovery Advanced SEO | Search Engines By: Kristina Kledzik March 8, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Kristina Kledzik March 8, 2017 SEO Rankings Drop: A Step-by-Step Guide to Recovery Advanced SEO | Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. A few weeks ago, rankings for pages on a key section of my site dropped an average of a full position in one day. I’ve been an SEO for 7 years now, but I still ran around like a chicken with my head cut off, panicked that I wouldn’t be able to figure out my mistake. There are so many things that could’ve gone wrong: Did I or my team unintentionally mess with internal link equity? Did we lose links? Did one of Google’s now-constant algorithm updates screw me over? Since the drop happened to a group of pages, I made the assumption it had to do with our site or page structure (it didn't). I wasted a good day focused on technical SEO. Once I realized my error, I decided to put together a guide to make sure that next time, I’ll do my research effectively. And you, my friends, will reap the rewards. First, make sure there’s actually a rankings change Okay, I have to start with this: before you go down this rabbit hole of rankings changes, make sure there was actually a rankings change. Your rankings tracker may not have localized properly, or have picked up on one of Google’s rankings experiments or personalization. Find out: Has organic traffic dropped to the affected page(s)? We’re starting here because this is the most reliable data you have about your site. Google Search Console and rankings trackers are trying to look at what Google’s doing; your web analytics tool is just tracking user counts. Compare organic traffic to the affected page(s) week-over-week both before and after the drop, making sure to compare similar days of the week. Is the drop more significant than most week-over-week changes? Is the drop over a holiday weekend? Is there any reason search volume could’ve dropped? Does Google Search Console show a similar rankings drop? Use the Search Analytics section to see clicks, impressions, and average position for a given keyword, page, or combo. Does GSC show a similar rankings drop to what you saw in your rankings tracker? (Make sure to run the report with the selected keyword(s).) Does your rankings tracker show a sustained rankings drop? I recommend tracking rankings daily for your important keywords, so you’ll know if the rankings drop is sustained within a few days. If you're looking for a tool recommendation, I'm loving Stat. If you’ve just seen a drop in your rankings tool and your traffic and GSC clicks are still up, keep an eye on things and try not to panic. I’ve seen too many natural fluctuations to go to my boss as soon as I see an issue. But if you’re seeing that there’s a rankings change, start going through this guide. Figure out what went wrong 1. Did Google update their algorithm? Google rolls out a new algorithm update at least every day, most silently. Good news is, there are leagues of SEOs dedicated to documenting those changes. Are there any SEO articles or blogs talking about a change around the date you saw the change? Check out:MozCastSearch Engine LandSearch Engine WatchDo you have any SEO friends who have seen a change? Pro tip: Make friends with SEOs who run sites similar to yours, or in your industry. I can’t tell you how helpful it’s been to talk frankly about tests I’d like to run with SEOs who’ve run similar tests. If this is your issue... The bad news here is that if Google’s updated their algorithm, you're going to have to change your approach to SEO in one way or another. Make sure you understand: What is Google penalizing, exactly?Why did Google make the change?Not to plug my own work, but the best way to avoid algorithmic penalties is to make SEO strategies with what Google wants in mind. Your next move is to put together a strategy to either pull yourself out of this penalty, or at the very least to protect your site from the next one. 2. Did your site lose links? Pull the lost links report from Ahrefs or Majestic. They’re the most reputable link counters out there, and their indexes are updated daily. Has there been a noticeable site-wide link drop?Has there been a noticeable link drop to the page or group of pages you’ve seen a rankings change for?Has there been a noticeable link drop to pages on your site that link to the page or group of pages you’ve seen a rankings change for?Run Screaming Frog on your site to find which pages link internally to the affected pages. Check internal link counts for pages one link away from affected pages.Has there been a noticeable link drop to inbound links to the page or group of pages you’ve seen a rankings change for?Use Ahrefs or Majestic to find the sites that link to your affected pages. Have any of them suffered recent link drops?Have they recently updated their site? Did that change their URLs, navigation structure, or on-page content? If this is your issue... The key here is to figure out who you lost links from and why, so you can try to regain or replace them. Can you get the links back?Do you have a relationship with the site owner who provided the links? Reaching out may help.Were the links removed during a site update? Maybe it was accidental. Reach out and see if you can convince them to replace them.Were the links removed and replaced with links to a different source? Investigate the new source — how can you make your links more appealing than theirs? Update your content and reach out to the linking site owner.Can you convince your internal team to invest in new links to quickly replace the old ones?Show your manager(s) how much a drop in link count affected your rankings and ask for the resources it’ll take to replace them.This will be tricky if you were the one to build the now-lost links in the first place, so if you did, make sure you’ve put together a strategy to build longer-term ones next time. 3. Did you change the affected page(s)? If you or your team changed the affected pages recently, Google may not think that they’re as relevant to the target keyword as they used to be. Did you change the URL? DO NOT CHANGE URLS. URLs act as unique identifiers for Google; a new URL means a new page, even if the content is the same. Has the target keyword been removed from the page title, H1, or H2s?Is the keyword density for the target keyword lower than it used to be?Can Google read all of the content on the page? Look at Google’s cache by searching for cache:www.yourdomain.com/your-page to see what Google sees.Can Google access your site? Check Google Search Console for server and crawl reports. If this is your issue… Good news! You can probably revert your site and regain the traffic you’ve lost. If you changed the URL, see if you can change it back. If not, make sure the old URL is 301 redirecting to the new URL. If you changed the text on the page, try reverting it back to the old text. Wait until your rankings are back up, then try changing the text again, this time keeping keyword density in mind. If Google can’t read all of the content on your page, THIS IS A BIG DEAL. Communicate that to your dev team. (I’ve found dev teams often undervalue the impact of SEO, but “Googlebot can’t read the page” is a pretty understandable, impactful problem.) 4. Did you change internal links to the affected page(s)? If you or your team added or removed internal links, that could change the way link equity flows through your site, changing Google’s perceived value of the pages on your site. Did you or your team recently update site navigation anywhere? Some common locations to check:Top navigationSide navigationFooter navigationSuggested productsSuggested blog postsDid you or your team recently update key pages on your site that link to target pages? Some pages to check:HomepageTop category pagesLinkbait blog posts or articlesDid you or your team recently update anchor text on links to target pages? Does it still include the target keyword? If this is your issue… Figure out how many internal links have been removed from pointing to your affected pages. If you have access to the old version of your site, run Screaming Frog (or a similar crawler) on the new and old versions of your site so you can compare inbound link counts (referred to as inlinks in SF). If you don’t have access to the old version of your site, take a couple of hours to compare navigation changes and mark down wherever the new layout may have hurt the affected pages. How you fix the problem depends on how much impact you have on the site structure. It’s best to fix the issue in the navigational structure of the site, but many of us SEOs are overruled by the UX team when it comes to primary navigation. If that’s the case for you, think about systematic ways to add links where you can control the content. Some common options: In the product descriptionIn blog postsIn the footer (since UX will generally admit, few people use the footer) Keep in mind that removing links and adding them back later, or from different places on the site, may not have the same effect as the original internal links. You’ll want to keep an eye on your rankings, and add more internal links than the affected pages lost, to make sure you regain your Google rankings. 5. Google’s user feedback says you should rank differently. Google is using machine learning to determine rankings. That means they’re at least in part measuring the value of your pages based on their click-through rate from SERPs and how long visitors stay on your page before returning to Google. Did you recently add a popup that is increasing bounce rate?Is the page taking longer to load?Check server response time. People are likely to give up if nothing happens for a few seconds.Check full page load. Have you added something that takes forever to load and is causing visitors to give up quickly?Have you changed your page titles? Is that lowering CTR? (I optimized page titles in late November, and that one change moved the average rank of 500 pages up from 12 to 9. One would assume things can go in reverse.) If this is your issue… If the issue is a new popup, do your best to convince your marketing team to test a different type of popup. Some options:Scroll popupsTimed popupsExit popupsStable banners at the top or bottom of the page (with a big CLICK ME button!)If your page is taking longer to load, you’ll need the dev team. Put together the lost value from fewer SEO conversions now that you’ve lost some rankings and you'll have a pretty strong case for dev time.If you’ve changed your page titles, change them back, quick! Mark this test as a dud, and make sure you learn from it before you run your next test. 6. Your competition made a change. You may have changed rank not because you did anything, but because your competition got stronger or weaker. Use your ranking tool to identify competitors that gained or lost the most from your rankings change. Use a tool like Versionista (paid, but worth it) or Wayback Machine (free, but spotty data) to find changes in your competitors’ sites. Which competitors gained or lost the most as your site’s rankings changed?Has that competition gained or lost inbound links? (Refer to #2 for detailed questions)Has that competition changed their competing page? (Refer to #3 for detailed questions)Has that competition changed their internal link structure? (Refer to #4 for detailed questions)Has that competition started getting better click-through rates or dwell time to their pages from SERPs? (Refer to #5 for detailed questions) If this is your issue… You’re probably fuming, and your managers are probably fuming at you. But there’s a benefit to this: you can learn about what works from your competitors. They did the research and tested a change, and it paid off for them. Now you know the value! Imitate your competitor, but try to do it better than them this time — otherwise you’ll always be playing catch up. Now you know what to do You may still be panicking, but hopefully this post can guide you to some constructive solutions. I find that the best response to a drop in rankings is a good explanation and a plan. And, to the Moz community of other brilliant SEOs: comment below if you see something I’ve missed! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Rankings Drop: A Step-by-Step Guide to Recovery"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO Rankings Drop: A Step-by-Step Guide to Recovery"
    },
    {
      "level": "H2",
      "text": "First, make sure there’s actually a rankings change"
    },
    {
      "level": "H2",
      "text": "Figure out what went wrong"
    },
    {
      "level": "H3",
      "text": "1. Did Google update their algorithm?"
    },
    {
      "level": "H4",
      "text": "If this is your issue..."
    },
    {
      "level": "H3",
      "text": "2. Did your site lose links?"
    },
    {
      "level": "H4",
      "text": "If this is your issue..."
    },
    {
      "level": "H3",
      "text": "3. Did you change the affected page(s)?"
    },
    {
      "level": "H4",
      "text": "If this is your issue…"
    },
    {
      "level": "H3",
      "text": "4. Did you change internal links to the affected page(s)?"
    },
    {
      "level": "H4",
      "text": "If this is your issue…"
    },
    {
      "level": "H3",
      "text": "5. Google’s user feedback says you should rank differently."
    },
    {
      "level": "H4",
      "text": "If this is your issue…"
    },
    {
      "level": "H3",
      "text": "6. Your competition made a change."
    },
    {
      "level": "H4",
      "text": "If this is your issue…"
    },
    {
      "level": "H2",
      "text": "Now you know what to do"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kristina Kledzik\n          \n            Kristina Kledzik"
}