{
  "url": "https://moz.com/blog/seo-training-from-moz",
  "slug": "seo-training-from-moz",
  "title": "Accelerate Your SEO Knowledge: New SEO Bootcamps and In-House Training from Moz - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We're now offering more targeted, in-depth SEO classes for beginner and intermediate marketers. If you need a leg up learning the rules of the SEO game, be sure to check out our revamped courses.",
  "content": "Accelerate Your SEO Knowledge: New SEO Bootcamps and In-House Training from Moz SEO Basics | Moz Tools | Advanced SEO By: Brian Childs February 15, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Brian Childs February 15, 2017 Accelerate Your SEO Knowledge: New SEO Bootcamps and In-House Training from Moz SEO Basics | Moz Tools | Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. SEO training classes provide a smart, accessible way to accelerate your knowledge of our industry's best practices, tools, and processes. For several months we've offered three workshops on our SEO Training page that focused on core SEO capabilities like keyword research, competitor research, and site audits. Starting now in February 2017, we're expanding these classes to include more topics and more opportunities to help your team deliver value faster. See upcoming classes What's changed about our SEO training classes?There are two major changes we’ve made to our SEO training solutions that you can see today: We've redesigned, renamed, and expanded our workshops We now offer custom in-house SEO training Workshops = SEO bootcampsPreviously, our workshops were focused on a few essential topics that every online marketer could benefit from. We're now expanding these into a six-part series of classes that cover not only essential topics, but also the process of implementing a search engine optimization strategy. Each SEO bootcamp can be taken separately or together as a series, and are geared for beginner to intermediate marketers. The topics we’re starting with are as follows: Intro to SEO Keyword and competitor research How to conduct an SEO site audit On-page optimization best practices Off-page optimization best practices How to report on SEO performance What is in-house SEO training, exactly?I used to be the VP of a marketing agency and like many agencies, we were pulled into the world of SEO by our clients. Many web designers are asked by their clients to provide SEO and subsequently need to learn how to scale up their capability fast. In-house SEO training is a way to help agencies and marketing services firms add SEO to their portfolio quickly to meet the needs of their proposal commitments. Another common use case for custom in-house SEO training: those in-house marketing teams that want to grow their online marketing capability. In-house training can help advance your new team members' knowledge, so they can start delivering value to your organization right off the bat. Interactive SEO training solutions allow businesses to quickly accelerate their skills. Different learning options for different learning stylesThe main thing that will remain unchanged is our commitment to helping you do better SEO. We recognize that people have different learning styles and different time commitments. I'm a great example of someone who learns by doing and values the ability to ask questions during class from a professional instructor. When I was training to be a commercial pilot, I spent most of my time doing hands-on learning in a very structured class environment. That experience aligned well with my learning style. Some people learn by reading. Some learn by videos alone. And others value live, interactive experiences. Here at Moz, we're building an ecosystem of learning solutions to meet every type of learning style. Sign up for a class! And this is just the beginning. We'll continue to invest in your skills. Check back often to the moz.com/training page to see new SEO classes as they launch! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Accelerate Your SEO Knowledge: New SEO Bootcamps and In-House Training from Moz"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Accelerate Your SEO Knowledge: New SEO Bootcamps and In-House Training from Moz"
    },
    {
      "level": "H3",
      "text": "What's changed about our SEO training classes?"
    },
    {
      "level": "H3",
      "text": "Workshops = SEO bootcamps"
    },
    {
      "level": "H3",
      "text": "What is in-house SEO training, exactly?"
    },
    {
      "level": "H3",
      "text": "Different learning options for different learning styles"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Brian Childs\n          \n            Brian Childs\n          \n            Brian Childs"
}