{
  "url": "https://moz.com/blog/seo-friendly-flex-websites",
  "slug": "seo-friendly-flex-websites",
  "title": "SEO-Friendly FLEX Websites - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When building a FLEX( Flash ) application that must be available to the user via Internet, always comes the next question : Will the website containing the application be SEO friendly?And the answer is NO. Google and other search engines cannot see inside your FLEX( Flash ) website/application and…",
  "content": "SEO-Friendly FLEX Websites Technical SEO V By: Valentin Vieriu April 10, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! V By: Valentin Vieriu April 10, 2008 SEO-Friendly FLEX Websites Technical SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. When building a FLEX( Flash ) application that must be available to the user via the Internet, this question always comes up: Will the website containing the application be SEO friendly? And the answer is NO. Google and other search engines cannot see inside your FLEX ( Flash ) website/application and and index your pages. If SEO is important to you, and it should be important, you will try to search for other technical solutions. Being in a situation similar to this one, an idea came to my mind. FLEX( Flash ) uses XML as a primary source of content, and XHTML is just a custom XML. The idea is to to use the HTML pages as XML content for the FLEX( Flash ) application. The XML can be read and indexed by the search engines, and it's also the ideal content source for your FLEX( Flash ) application. How this can be done from technical point of view? Well, it's pretty simple: Your HTML pages will be just simple the XML files that will contain the content necessary for your FLEX( Flash ) application. The content of the page will be available to the search engines. Create a XSLT file that will transform, on the user machine, the XML content of the page into a normal html page and also add the Flash component necessary to run the FLEX( Flash ) application. Point the FLEX( Flash ) application to get its information from the current page itself. Remember that if the XSLT is not applied, the current page is nothing but an XML file The user will see a rich internet application created in FLEX and the search engines will see a nice XML page that is easy to index, and both worlds will be very happy. This is just an idea that should work. I will test this on my current project and will keep you posted regarding the success of this technique. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO-Friendly FLEX Websites"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO-Friendly FLEX Websites"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Valentin Vieriu\n          \n            Valentin Vieriu"
}