{
  "url": "https://moz.com/blog/seo-value-for-clients",
  "slug": "seo-value-for-clients",
  "title": "SEO Is a Means to an End: How Do You Prove Your Value to Clients? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Learn the 10 tips for showing your clients the value of your SEO work in this article by seasoned agency SEO Kameron Jenkins.",
  "content": "SEO Is a Means to an End: How Do You Prove Your Value to Clients? Advanced SEO | SEO Consulting By: Kameron Jenkins March 21, 2019 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Kameron Jenkins March 21, 2019 SEO Is a Means to an End: How Do You Prove Your Value to Clients? Advanced SEO | SEO Consulting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. “Prove it” is pretty much the name of the game at this point. As SEOs, we invest so much effort into finding opportunities for our clients, executing strategies, and on the best days, getting the results we set out to achieve. That’s why it feels so deflating (not to mention mind-boggling) when, after all those increases in rankings, traffic, and conversions our work produced, our clients still aren’t satisfied. Where’s the disconnect? The value of SEO in today’s search landscape You don’t have to convince SEOs that their work is valuable. We know full well how our work benefits our clients’ websites. Our attention on crawling and indexing ensures that search engine bots crawl all our clients’ important pages, that they’re not wasting time on any unimportant pages, and that only the important, valuable pages are in the index. Because we understand how Googlebot and other crawlers work, we’re cognizant of how to ensure that search engines understand our pages as they’re intended to be understood, as well as able to eliminate any barriers to that understanding (ex: adding appropriate structured data, diagnosing JavaScript issues, etc.)We spend our time improving speed, ensuring appropriate language targeting, looking into UX issues, ensuring accessibility, and more because we know the high price that Google places on the searcher experience. We research the words and phrases that our clients’ ideal customers use to search for solutions to their problems and help create content that satisfies those needs. In turn, Google rewards our clients with high rankings that capture clicks. Over time, this can lower our clients’ customer acquisition costs. Time spent on earning links for our clients earns them the authority needed to earn trust and perform well in search results. There are so many other SEO activities that drive real, measurable impact for our clients, even in a search landscape that is more crowded and getting less clicks than ever before. Despite those results, we’ll still fall short if we fail to connect the dots for our clients. Rankings, traffic, conversions… what’s missing? What’s a keyword ranking worth without clicks? What’s organic traffic worth without conversions? What are conversions worth without booking/signing the lead? Rankings, traffic, and conversions are all critical SEO metrics to track if you want to prove the success of your efforts, but they are all means to an end. At the end of the day, what your client truly cares about is their return on investment (ROI). In other words, if they can’t mentally make the connection between your SEO results and their revenue, then the client might not keep you around for long. From searcher to customer: I made this diagram for a past client to help demonstrate how they get revenue from SEO. But how can you do that? 10 tips for attaching value to organic success If you want to help your clients get a clearer picture of the real value of your efforts, try some of the following methods. 1. Know what constitutes a conversion What’s the main action your client wants people to take on their website? This is usually something like a form fill, a phone call, or an on-site purchase (e-commerce). Knowing how your client uses their website to make money is key. 2. Ask your clients what their highest value jobs are Know what types of jobs/purchases your client is prioritizing so you can prioritize them too. It’s common for clients to want to balance their “cash flow” jobs (usually lower value but higher volume) with their “big time” jobs (higher value but lower volume). You can pay special attention to performance and conversions on these pages. 3. Know your client’s close rate How many of the leads your campaigns generate end up becoming customers? This will help you assign values to goals (tip #6). 4. Know your client’s average customer value This can get tricky if your client offers different services that all have different values, but you can combine average customer value with close rate to come up with a monetary value to attach to goals (tip #6). 5. Set up goals in Google Analytics Once you know what constitutes a conversion on your client’s website (tip #1), you can set up a goal in Google Analytics. If you’re not sure how to do this, read up on Google’s documentation. 6. Assign goal values Knowing that the organic channel led to a conversion is great, but knowing the estimated value of that conversion is even better! For example, if you know that your client closes 10% of the leads that come through contact forms, and the average value of their customers is $500, you could assign a value of $50 per goal completion. 7. Consider having an Organic-only view in Google Analytics For the purpose of clarity, it could be valuable to set up an additional Google Analytics view just for your client’s organic traffic. That way, when you’re looking at your goal report, you know you’re checking organic conversions and value only. 8. Calculate how much you would have had to pay for that traffic in Google Ads I like to use the Keywords Everywhere plugin when viewing Google Search Console performance reports because it adds a cost per click (CPC) column next to your clicks column. This screenshot is from a personal blog website that I admittedly don’t do much with, hence the scant metrics, but you can see how easy this makes it to calculate how much you would have had to pay for the clicks you got your client for “free” (organically). 9. Use Multi-Channel Funnels Organic has value beyond last-click! Even when it’s not the channel your client’s customer came through, organic may have assisted in that conversion. Go to Google Analytics > Conversions > Multi-Channel Funnels. 10. Bring all your data together How you communicate all this data is just as important as the data itself. Use smart visualizations and helpful explanations to drive home the impact your work had on your client’s bottom line. As many possibilities as we have for proving our value, doing so can be difficult and time-consuming. Additional factors can even complicate this further, such as: Client is using multiple methods for customer acquisition, each with its own platform, metrics, and reportingClient has low SEO maturity Client is somewhat disorganized and doesn’t have a good grasp of things like average customer value or close rate Learn more strategies at my upcoming webinar The challenges can seem endless, but there are ways to make this easier. I’ll be co-hosting a webinar on March 28th that focuses on this very topic. If you’re looking for ways to not only add value as an SEO but also prove it, check it out: Save my spot! And let’s not forget, we’re in this together! If you have any tips for showing your value to your SEO clients, share them in the comments below. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Is a Means to an End: How Do You Prove Your Value to Clients?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO Is a Means to an End: How Do You Prove Your Value to Clients?"
    },
    {
      "level": "H2",
      "text": "The value of SEO in today’s search landscape"
    },
    {
      "level": "H2",
      "text": "Rankings, traffic, conversions… what’s missing?"
    },
    {
      "level": "H2",
      "text": "10 tips for attaching value to organic success"
    },
    {
      "level": "H3",
      "text": "1. Know what constitutes a conversion"
    },
    {
      "level": "H3",
      "text": "2. Ask your clients what their highest value jobs are"
    },
    {
      "level": "H3",
      "text": "3. Know your client’s close rate"
    },
    {
      "level": "H3",
      "text": "4. Know your client’s average customer value"
    },
    {
      "level": "H3",
      "text": "5. Set up goals in Google Analytics"
    },
    {
      "level": "H3",
      "text": "6. Assign goal values"
    },
    {
      "level": "H3",
      "text": "7. Consider having an Organic-only view in Google Analytics"
    },
    {
      "level": "H3",
      "text": "8. Calculate how much you would have had to pay for that traffic in Google Ads"
    },
    {
      "level": "H3",
      "text": "9. Use Multi-Channel Funnels"
    },
    {
      "level": "H3",
      "text": "10. Bring all your data together"
    },
    {
      "level": "H2",
      "text": "Learn more strategies at my upcoming webinar"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kameron Jenkins\n          \n            Kameron Jenkins\n          \n            Kameron Jenkins"
}