{
  "url": "https://moz.com/blog/seo-for-journalists-landing-pages-part-5-of-5",
  "slug": "seo-for-journalists-landing-pages-part-5-of-5",
  "title": "SEO For Journalists: Landing Pages (Part 5 of 5) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Due to the nature of search engines, and the weight that they put on the authority of a site or page, a simple news article, with few if any links pointing at it, will often struggle to rank against some of the high traffic phrases which RBI are aiming to take ownership of.   A landing page (which…",
  "content": "SEO For Journalists: Landing Pages (Part 5 of 5) Content Marketing C By: Ciaran Norris May 2, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! C By: Ciaran Norris May 2, 2007 SEO For Journalists: Landing Pages (Part 5 of 5) Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Due to the nature of search engines, and the weight that they put on the authority of a site or page, a simple news article, with few if any links pointing at it, will often struggle to rank against some of the high traffic phrases which RBI are aiming to take ownership of. A landing page (which is in many ways the online equivalent of a print feature) allows you to aggregate content from a variety of sources, mix it with unique analysis and reporting, and build links into it from your own pages as well as external sources. These pages then have a much better chance of ranking highly against competitive search terms. See below for some whys & hows of landing page creation. The objective of landing pages is to establish a series of content pages that rank consistently for high-traffic key phrases on the major search engines by providing valuable content and a useful experience for the user. This will result in increased targeted traffic from the major search engines. By creating landing pages you can also encourage users to consume even more of your content by instantly exposing all that we have on a specific topic and therefore becoming an authority on that subject. By providing this to a person, as soon as they arrive at the site, you have more chance of converting them in to a regular user rather than a one off visitor. A landing page should include some static text which summarises the issues surrounding the phrase that you are targeting, and uses the keywords on several occasions. This could include analysis, timelines, and effects on the readers’ businesses. Link to the latest stories on your site on that issue – having a specially built landing page creation tool as part of your CMS will make this easier You could also include links to relevant jobs, classified ads, or any other relevant content And don’t be afraid to link out – to relevant blogs, videos, photo galleries, or official websites (of unions, associations, govt. departments, etc..): as we saw in the article on linking out, it’s a great way to get links in to your site This mix of keyword optimised static text and links to frequently updated dynamic content is what makes the landing page such a powerful tool – in some ways, it’s what makes Wikipedia so successful Once you have your landing page, you can then drive links to it from every article or job on the site that is on that topic – taking care to use link text which includes the keywords And by submitting it to social bookmarking sites you can drive even more links And if it’s really good (which of course it will be), why not put it on the relevant page on Wikipedia – it may have no link value, but traffic can be huge; use this guide if you’re not sure how to put stuff on Wikipedia. To give you an idea of what you can expect, a landing page on CatererSearch in Jan 07 on the Michelin Guides lead to the highest ever traffic for the site with the landing page alone attracting 20,000 impressions – who wouldn’t want that? Note: This article was originally written as part of a training programme for the journalists at UK B2B publisher Reed Business Information. Ciarán Norris is now the SEO Director at UK search marketing agency eyefall. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO For Journalists: Landing Pages (Part 5 of 5)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO For Journalists: Landing Pages (Part 5 of 5)"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ciaran Norris\n          \n            Ciaran Norris"
}