{
  "url": "https://moz.com/blog/seo-is-one-of-the-hot-up-coming-jobs",
  "slug": "seo-is-one-of-the-hot-up-coming-jobs",
  "title": "SEO is One of the Hot, Up & Coming Jobs - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Thanks to Ryan McCann, who pointed me to this article from MSN Careers - Four Jobs on the Cutting Edge...",
  "content": "SEO is One of the Hot, Up &amp; Coming Jobs User Experience (UX) By: Rand Fishkin August 4, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 4, 2006 SEO is One of the Hot, Up &amp; Coming Jobs User Experience (UX) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Thanks to Ryan McCann, who pointed me to this article from MSN Careers - Four Jobs on the Cutting Edge. From the article: Search engine optimizers (SEOs) increase a firm's Web site traffic by improving its search-engine page rankings. This is an especially important task in today's Internet-driven world, where many customers first learn of an organization and its products or services through the Web. Because of a shortage of experts in this relatively new area, many top SEOs receive multiple job offers. SEOs typically supplement their knowledge of how various search engines operate and determine page rankings with strong marketing skills, as well as the ability to communicate effectively and program using HTML. Most are self-taught, learning the trade by researching trends, attending conferences and seminars, participating in discussion forums, and experimenting with their own sites. Courses and certifications in this specialty are being offered by an increasing number of organizations; however, consensus on the value of these programs does not yet exist. This looks like a remarkably accurate description of the profession, actually. I'm quite impressed with Robert Half, International (who authored the piece). As far as SEO for a job choice, I know I wouldn't have it any other way. Thanks to the people who blazed the trail in our industry, this is one of the most fun, engaging, dynamic and profitable professions I've ever seen, heard or read about. And, I gotta tell you, Intellectual Property Litigator sounds like one of the most despicable vocations you can have - it may be in demand, but it sounds like going to work for the villains of the tech world. Do you think the secret's almost out? Will universities start to offer classes? Are we in for a huge influx of CareerBuilder readers gone wild? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO is One of the Hot, Up &amp; Coming Jobs"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO is One of the Hot, Up &amp; Coming Jobs"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Unlock Your B2B SEO Content with Structured Resource Sections"
    },
    {
      "level": "H3",
      "text": "The ROI of Accessibility in SEO"
    },
    {
      "level": "H3",
      "text": "How SEOs and UX Designers Can Work Better Together — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}