{
  "url": "https://moz.com/blog/seo-chrome-toolbar-download-the-mozbar",
  "slug": "seo-chrome-toolbar-download-the-mozbar",
  "title": "MozBar SEO Chrome Extension Is Here! Download the Toolbar Today - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Use Google Chrome? Download the SEO Toolbar Extension from SEOmoz for Chrome! Get quick access to a SERP overlay, many On-Page SEO factors, plus Domain & Page Authority.",
  "content": "SEO Chrome Toolbar is Here! Download the Mozbar for Chrome Today SEO Tools By: Danny Dover July 27, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Danny Dover July 27, 2010 SEO Chrome Toolbar is Here! Download the Mozbar for Chrome Today SEO Tools The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Well folks, this may be the biggest tool introduction since Ryan Seacrest started hosting American Idol. ;-) Today we are launching our SEO toolbar for Google's Chrome browser. This sexy beast is full to the brim with SEO insight and time-saving SEO goodness. This free add-on is ripe for picking and available for download right this second. Ask and Ye Shall Receive Whether it's from Twitter, Facebook, email or comments here on the blog, almost every day we get some sort of request for a Chrome Toolbar. We knew there was a high need for it, and wanted to make sure that we didn't rush and put together something unmozworthy. The new toolbar is pretty baller if I do say so myself (which I just did). It works very similarly to a toolbar in Firefox where it displays across the top of the screen, but with the ability to easily drop it down to the bottom of the page as well. The new Chrome toolbar has most of the same features as the Firefox edition, but if you want to learn more... please keep reading. :) So How Does This Help Me? 1. Search Results Overlay This new Search Engine Results Page overlay was designed to offer the most relevant link data without getting in the way. You can now use our toolbar to see which search results are getting the most links, and click Explore to run a full analysis in Open Site Explorer. To turn on this overlay, click the settings button on the toolbar, and select SERP Overlay. \"I get the best 'feel' for abstract metrics by seeing them in familiar places. I find it easiest to understand the new metrics by seeing them on search results I'm familiar with; as an added bonus, this is one of the most helpful analyses you can do when looking at a new SERP for the first time.\" --Will Critchlow 2. Quickly find important SEO information with the Analyze Page Overlay Our analyze page overlay provides quick access to useful data points which include: On-page Optimization Elements – All of the essential SEO on-page elements (title tag, meta description, meta robots, rel canonical) are in one place. Location Data – As local search becomes more important, the value of information like server location increase. Google cache – Want to see exactly what Google saw when it's bot crawled a given site. The link to Google's cache will get you there. \"The overlay is still the most valuable thing for me. I must use it 5+ times every day to get quick info about how many links are on a page, whether it's using rel=\"canonical\" or whether the keywords are properly included in the right page elements. I hate using 'view source' and searching through code; overlay FTW!\" --Rand Fishkin 3. Quick Access to Tools from SEOmoz and Third Parties The tools dropdown has been expanded to include fast access to the latest SEOmoz tools as well as a wealth of other helpful resources, including traffic data, Twitter tools, and domain information. What if I find a bug? Reporting Bugs The best way to report bugs is to e-mail us at customerservice(at symbol)seomoz.org. This is the quickest way to get into our development queue. Known Issues 1. The toolbar overlays some of the page content. We attempted to inject the CSS into the page and push down the page content, but this ended up breaking some useful sites (like Twitter) so we overlay the page instead , but do now offer the ability to display the toolbar at the bottom of the page, which should hopefully help, when you've just got to see the Facebook nav. :) 2. Because of the way the toolbar is rendered as part of the page, it only shows up when the page loads, so if the toolbar is turned on while other windows already have loaded content, you will need to click refresh to see the toolbar. Unfortunately, this is also the case when you open a new chrome window, since chrome shows cached content on open to appear faster. We hope you enjoy the new toolbar. Please give it a try, and be sure to post feedback in the comments below. Not yet a Chrome fan? Still plugging away in good ol' Firefox? Well we haven't forgotten about you! You were our first love, and can still be downloaded here. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Chrome Toolbar is Here! Download the Mozbar for Chrome Today"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO Chrome Toolbar is Here! Download the Mozbar for Chrome Today"
    },
    {
      "level": "H2",
      "text": "Ask and Ye Shall Receive"
    },
    {
      "level": "H2",
      "text": "So How Does This Help Me?"
    },
    {
      "level": "H3",
      "text": "1. Search Results Overlay"
    },
    {
      "level": "H3",
      "text": "2. Quickly find important SEO information with the Analyze Page Overlay"
    },
    {
      "level": "H3",
      "text": "3. Quick Access to Tools from SEOmoz and Third Parties"
    },
    {
      "level": "H2",
      "text": "What if I find a bug?"
    },
    {
      "level": "H3",
      "text": "Reporting Bugs"
    },
    {
      "level": "H3",
      "text": "Known Issues"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Danny Dover\n          \n            Danny Dover\n          \n            Danny Dover"
}