{
  "url": "https://moz.com/blog/seo-clean-up-strategy",
  "slug": "seo-clean-up-strategy",
  "title": "6 Steps to Executing an Efficient SEO Clean-Up Strategy - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In this article, learn how to successfully execute an SEO clean-up strategy to ensure your site aligns with your business goals, keeps you in Google’s good books, and yields an excellent user experience for visitors and customers.",
  "content": "6 Steps to Executing an Efficient SEO Clean-Up Strategy SEO Basics | On-page SEO | Link Building By: John Allen April 27, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: John Allen April 27, 2021 6 Steps to Executing an Efficient SEO Clean-Up Strategy SEO Basics | On-page SEO | Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. If you own a successful business, you’ve probably come to realize that your website is growing just as quickly as your business. Blog posts, product pages, e-commerce listings, contact pages — it all adds up. Before you know it, you’ve got hundreds upon hundreds of pages, each with their own set of SEO problems to worry about. With so many pages to manage, things can quickly go awry. Bad links can go unnoticed, website structure gets messy, and content can quickly become de-optimized. All of this can affect the experience of your visitors and have tangible consequences like increased bounce and browse abandonment rates. That’s why periodical site clean-ups are crucial to maintaining website coherence, relevance, and usability. In this article, we’ll explain how to successfully execute an SEO clean-up strategy to ensure your site aligns with your business goals, keeps you in Google’s good books, and yields an excellent user experience for visitors and customers. Let’s get started! 6 steps to execute your SEO clean-up strategy Before you get started with your SEO clean-up, you’ll need to get an overview of your website. How? Inspect your site with a site audit. This will enable you to evaluate how your website looks through the eyes of a search engine. You’ll get a better understanding of how search engines discover, crawl, and index your site. A site audit will provide you with a starting point for your clean-up. There are plenty of things a comprehensive site audit might unearth and identify. From repeated meta descriptions to broken links, a site audit will reveal the good, the bad, and the ugly when it comes to your website SEO. With Moz Pro, you can conduct site audits to identify technical SEO issues and crawl issues, as well as recommend ways to improve and fix any issues. This is a good starting place, and once you know where to start, you can follow these six actionable steps to cleaning up your website. 1. Clean up your site structure The structure of your site can make a huge difference in search engine ranking and the way customers interact with your site. Site menu The first structural element visitors are likely to interact with is your site menu. Ideally, your site menu should feature a limited number of top-level items to keep it focused and easy to navigate. You don’t want to overwhelm first-time visitors with a complicated and cluttered site menu! Content Another important thing to consider is your content. Does it currently align with your business or website goals? Is your website exhibiting the content that’s most important to your mission? Is it easy to find? Create an overview of the content you do have, so you can get a comprehensive birds-eye view of your website’s content. You can likely split your pages into categories like your blog, services, contact, and product pages. Splitting your web pages into relevant categories enables visitors to easily find the content they’re seeking, and adds some organization to your site, making it easier to crawl — which is great for SEO! Source Another idea is to connect with other relevant stakeholders or departments in your company. Ask for their feedback on current content. Ask for their opinions and suggestions for improvement. You’d be surprised at the valuable insights that can crop up, especially from those viewing your site from an outsider’s perspective. What does the data reveal? As with all things marketing, ensure your site structure clean-up is data-driven. Dig into your performance data to gather revealing insights about your website. Look at how much traffic pages are getting, where this traffic is coming from, and how that traffic is behaving when the visitors access your website. Consider where people are likely to be in their journey when they land on your homepage and curate it accordingly. Also be sure to analyze how people interact with your homepage by tracking key metrics like time on page, bounce rate, and scroll depth, to see if visitors are actually reaching your most important content in the first place. Now start cleaning up that content! Armed with these insights and information, you can start breathing new life into your site structure. A good idea is to sort your web pages and content into categories and organize them based on relevance, importance, and performance. Ensure that the webpages at the top of the hierarchy are accessible via your homepage, so visitors don’t have to look hard to find them. Decide what your website is missing, what existing content can be improved, and what can be deleted altogether. Understanding how visitors are navigating your homepage and interacting with individual web pages provides insight into how you can better serve visitors and — hopefully — customers. Not to mention, Google! Remember that in today’s world, when many organizations are transforming digitally, customers have an unlimited amount of resources at their fingertips. You need to ensure your website stands out from the crowd. This means effective content should be valuable, relevant, and as optimized as possible. 2. Identify and remove bad links What are bad links? Before we delve into how to remove them, let’s understand what exactly makes a link “bad”. The “link schemes” section of Google’s Quality Guidelines states: “Any links intended to manipulate PageRank or a site’s ranking in Google search results may be considered part of a link scheme and a violation of Google’s Webmaster Guidelines. This includes any behavior that manipulates links to your site or outgoing links from your site.” Put simply, a bad link is one that violates Google’s guidelines. There are some things that Google just doesn’t like, and bad links to your site is one of them. A bad link can result in penalties from Google that’ll affect your rankings in the search engine results pages (SERPs) and, consequently, your entire website performance. When link building, it’s important to stay on top of sites that are linking to yours, and understand what signifies whether or not a link is good. Some kinds of links will get you into trouble, including those from press releases, private blog networks, link farms, etc. A good link, on the other hand, will do wonders for your SEO and website authority. Examples of good links include links from high-ranking sites, links from sites in your industry, and non-spammy links that aren’t solicited. Sure, there are good links and bad links. But it’s important to remember that links aren’t all about SEO. They should — first and foremost — be about providing your website visitors with valuable information to improve their user experience. How to remove bad links Once you’ve identified the bad links that are harming your website, there are a few steps you’ll need to take to get rid of them. First, try searching for the websites that are hosting those links to find their contact information. You can then ask for the links to be removed directly. If you don’t receive a reply agreeing to remove a link or see that the link remains active, it’s time to take further action. If you’ve done everything in your power to remove the links to no avail, you can disavow the URLs of the pages or domains that are linking to your site. Disavow? Sounds complicated, right? Don’t worry, we’ll take you through it. When you disavow links, you are essentially making a request for Google to ignore those links to your website domain. If your request is successful, these links won’t be counted against you. Remember: Google’s pretty savvy when it comes to third-party actions affecting websites, so disavowing links should be a last resort. If you determine you do need to disavow bad links, head on over to the Google Disavow Tool to get started. The process is as follows: Define the links you want to disavow. Create your disavow list and ensure entries are separated by URL or domain. Upload the list as a .txt file to Google’s disavow tool. According to Google Search Console guidelines, you should only disavow backlinks if there are a considerable number of bad links to your site and the links have or will likely cause manual action to be taken on your site. 3. Remove or redirect broken links A broken link refers to a link on your website that leads to a page that doesn’t exist. Linked pages could lead to non-existent or out of date pages on your own or external websites. Clicking on them results in a 404 error message, like this one: If you’ve done a site audit, it’s likely revealed some broken links on your site. It happens! You can easily find these broken links with the Crawl Errors report in Google Search Console or the site crawl feature of Moz Pro. These tools will tell you which links are returning 404 messages. Broken links can occur for several reasons: The URL of the link you entered was incorrectThe linked page has been deletedThe external website that was linked to has been deletedA firewall is restricting access to the linked website or page Whatever the reason, broken links don’t do your site any favors. Broken links can detract from your website authority, frustrate visitors, and thus affect your search engine ranking. Luckily, fixing them is simple. There are a few things you can do: Un-link the text Correct the link if there was a mistake when entering itReplace the link if the destination still exists but has been changedCreate a redirect for recurring broken links to pages on your site (eg. you changed the URL of your contact page, and now all links to that page are broken) 4. Optimize images To appeal to visitors, your website needs images. The visual aspect of a website is sometimes just as important as the information being shared, so your images must be displayed properly. Images are also a great way to further boost the SEO of your site! First of all, compress the images on your pages to improve the load speed. Load speed can make a huge difference in how people interact with your site. When page load time increases from one second to three seconds, the bounce probability increases by a whopping 32%! Pages that take longer to load result in a higher bounce rate, especially for people browsing on mobile devices. So, ensuring your website loads as quickly as possible is crucial to attracting and maintaining visitors. There are several plug-ins for WordPress that allow you to compress images in various file types. If you’re using an external compressor tool, you might need to download, compress, and re-upload the images. Photo by cottonbro Once you’ve successfully done this, you should also take some time to update the image alt text. Alt text is a great way to incorporate keywords into the page and improve your website’s SEO. If you use a website like Shopify for product management, you can easily add alt text to your product images or other media. This means that if the image can’t load for any reason, the alt text is shown instead. It’s also a tool used to improve the experience of visually impaired people. 5. Eliminate duplicate metadata Each title tag and meta description should be unique, as these are what appear in the search engine results. As you add more and more pages to your website, it’s easy to end up repeating metadata. You might have the same title tags, or too-similar meta descriptions affecting your site quality, without you even realizing it. When cleaning up your website SEO, eliminating any duplicate metadata will help to boost your rankings and get you on Google’s good side. If you’ve audited your site, your crawl data will reveal which pages feature duplicate metadata. Set up a spreadsheet with all of these duplicates, and find some time to come up with unique title tags and meta descriptions. It might be a tedious job for whoever lands it, but the SEO rewards will make it all worth it! Title tags are arguably the most important element of on-page SEO, so pay careful attention to them! Each title tag should be original, using up to 65 characters. It should also begin with your keyword themes (to reflect search intent), and end with your website or brand name. Meta descriptions don’t necessarily affect your ranking, but they do affect the click-through rates to your site — which is just as important in our books! After all, if people aren’t actually clicking through to your site, what does it matter if you’re on the first page? Meta descriptions should feature your keyword themes and provide a succinct overview of the page in about 155 characters. 6. Check that it all works Okay, this one may seem obvious, but you’d be surprised at just how often we assume everything works. Ensuring each element of your website is fully functional is vital to ensuring your visitors have a good (great!) experience when they land on your site. If parts of your website aren’t working as effectively as they should, it could result in increased bounce rates as visitors become frustrated and leave before taking a desired action. This won’t go down well with Google, and your rankings will suffer as a result. Go through each page to ensure it works. Use a cobrowsing tool with a colleague or friend to understand how customers experience your site. Test the functionality of contact forms, signups, e-commerce shopping carts, checkouts, etc. Doing this will allow you to identify elements that aren’t working, or could use improvement. Make your SEO clean-up strategy a regular occurrence Think of your website as your home. You wouldn’t just clean it once a year, would you? We hope not! Your website requires constant maintenance to stay on top of updates to the algorithm, shifting consumer demands, and developments in your business goals. Make site cleanups a regular occurrence. Schedule monthly clean-ups (project scheduling tools can help!), so your marketing team can stay on top of the dynamic practice of SEO and keep your website at peak performance. Tools like Google Analytics and Moz provide accurate data that reflects site performance, and can be used to inform future strategies. If you make this a part of your routine, you’ll see the benefits of SEO through quality links, increased organic traffic, and a more satisfied audience. Sounds pretty good, doesn’t it? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "6 Steps to Executing an Efficient SEO Clean-Up Strategy"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "6 Steps to Executing an Efficient SEO Clean-Up Strategy"
    },
    {
      "level": "H2",
      "text": "6 steps to execute your SEO clean-up strategy"
    },
    {
      "level": "H3",
      "text": "1. Clean up your site structure"
    },
    {
      "level": "H4",
      "text": "Site menu"
    },
    {
      "level": "H4",
      "text": "Content"
    },
    {
      "level": "H4",
      "text": "What does the data reveal?"
    },
    {
      "level": "H4",
      "text": "Now start cleaning up that content!"
    },
    {
      "level": "H3",
      "text": "2. Identify and remove bad links"
    },
    {
      "level": "H4",
      "text": "What are bad links?"
    },
    {
      "level": "H4",
      "text": "How to remove bad links"
    },
    {
      "level": "H3",
      "text": "3. Remove or redirect broken links"
    },
    {
      "level": "H3",
      "text": "4. Optimize images"
    },
    {
      "level": "H3",
      "text": "5. Eliminate duplicate metadata"
    },
    {
      "level": "H3",
      "text": "6. Check that it all works"
    },
    {
      "level": "H2",
      "text": "Make your SEO clean-up strategy a regular occurrence"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "John Allen\n          \n            John Allen\n          \n            John Allen"
}