{
  "url": "https://moz.com/blog/seo-professional-experiment",
  "slug": "seo-professional-experiment",
  "title": "\"SEO Professional\" - An Experiment - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The SEO professional experiment is a project I started (today) to do SEO testing. My goal is to use ethical search engine optimization to get it ranked in Google SERPs. SEO professional is the domain. It's also a good domain for a personal branding site. That's why I used ...",
  "content": "\"SEO Professional\" - An Experiment Online Advertising G By: Geir Ellefsen September 14, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! G By: Geir Ellefsen September 14, 2009 \"SEO Professional\" - An Experiment Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. The SEO professional experiment is a project I started (today) to do SEO testing. My goal is to use ethical search engine optimization to get it ranked in Google SERPs. SEO professional is the domain. It's also a good domain for a personal branding site. That's why I used Danny Dover's excellent personal branding platform. This is my first blog post on SEOmoz, I hope you like it. About the experiment Domain: seoprofessional.info CMS: The Layman's Personal Branding Platform Exact match domain: Check Internal links: Check External links: Work in progress SEO Myth busters Here are some myths I hope to bust with this experiment. .info domains is worthless for SEO. The value of exact match domains. Anchortext in links effect on rankings. Geo targeting in Google Webmaster tools helps your ranking. Keyword research I used Google keyword tool with exact match to find which country had the most searches for SEO professional. It turns out it's Australia. So we will go with Australia in Google Webmaster tools. Predictions \"I think it will be pretty easy to rank for seo professional\" - Geir Ellefsen I don't think we need many external links with good anchor text to get this site ranked. The competition I think is, http://www.seoprofessional.com.au/ which is ranking number 1 in google.com.au. This supports my theory that exact match domains are very helpful in SEO. It will be interesting to see the ranking in google.com and google.co.uk as well. Your thoughts? Do have any tips for this experiment? How well do you think it will rank? After I have tested this for a few months I will make another follow up post about with results and analysis. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "\"SEO Professional\" - An Experiment"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "\"SEO Professional\" - An Experiment"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Geir Ellefsen\n          \n            Geir Ellefsen\n          \n            Geir Ellefsen"
}