{
  "url": "https://moz.com/blog/seo-for-copywriters-next-level",
  "slug": "seo-for-copywriters-next-level",
  "title": "SEO for Copywriters: Tips on Measuring SEO Impact - Next Level - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Learn how to use Google Analytics to track and measure the SEO impact of your content efforts.",
  "content": "SEO for Copywriters: Tips on Measuring SEO Impact - Next Level Content Marketing | SEO Analytics | SEO Basics By: Brian Childs July 17, 2017 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Brian Childs July 17, 2017 SEO for Copywriters: Tips on Measuring SEO Impact - Next Level Content Marketing | SEO Analytics | SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Welcome to the newest installment of our educational Next Level series! In our last episode, Brian Childs shared a few handy shortcuts for targeting multiple keywords with one page. Today, he's back to share how to use Google Analytics to measure the SEO impact of your content. Read on and level up! Understanding how to write web content for SEO is important. But equally important is knowing how to measure the SEO impact of your content after it's published. In this article I’ll describe how to use Google Analytics to create reports that evaluate the performance of articles or the writers creating those articles. Let’s start with some definitions. What is SEO content? Search engine optimized content is the strategic process of researching and writing website copy with the goal of maximizing its impact in the SERPs. This requires having a keyword strategy, the ability to conduct competitive analyses, and knowledge of current ranking factors. If you're a copywriter, you've likely already been asked by your clients to create content “written for SEO.” Translating this into action often means the writer needs to have a greater role in both strategy and research. Words matter in SEO, and spending the time to get them right is a big part of creating content effectively. Adding SEO research and analysis to the process of researching content often fits nicely. So the question is: How do I measure the effectiveness of my content team? We go in greater depth on the research and reporting processes during the Moz seminar SEO for Content Writers, but I’ll explain a few useful concepts here. What should I measure? Well-defined goals are at the heart of any good digital marketing strategy, whether you're doing SEO or PPC. Goals will differ by client and I've found that part of my role as a digital marketer is to help the client understand how to articulate the business goals into measurable actions taken by visitors on their site. Ideally, goals have a few essential traits. They should: Have measurable value (revenue, leads generated, event registrations) Be identifiable on the site (PDF downloads, button clicks, confirmation page views) Lead to business growth (part of an online campaign, useful to sales team, etc.) Broad goals such as “increase organic sessions on site” are rarely specific enough for clients to want to invest in after the first 3–6 months of a relationship. One tool you can use to measure goals is Google Analytics (GA). The nice part about GA is that almost everyone has an account (even if they don’t know how to use it) and it integrates nicely with almost all major SEO software platforms. Lay the foundation for your SEO research by taking a free trial of Moz Pro. After you've researched your content strategy and competition with Keyword Explorer and Open Site Explorer, you can begin measuring the content you create in Google Analytics. Let me show you how I set this up. How to measure SEO content using Google Analytics Step 1: Review conversion actions on site As I mentioned before, your SEO goals should tie to a business outcome. We discuss setting up goals, including a worksheet that shows monthly performance, during the Reporting on SEO Bootcamp. During the launch phase of a new project, locate the on-site actions that contribute to your client’s business and then consider how your content can drive traffic to those pages. Some articles have CTAs pointing to a whitepaper; others may suggest setting up a consultation. When interviewing your client about these potential conversion locations (contact us page, whitepaper download, etc), ask them about the value of a new customer or lead. For nonprofits, maybe the objective is to increase awareness of events or increase donations. Regardless of the goal, it's important that you define a value for each conversion before creating goals in Google Analytics. Step 2: Navigate to the Admin panel in Google Analytics Once you have goals identified and have settled on an acceptable value for that goal, open up Google Analytics and navigate to the admin panel. At the time of writing this, you can find the Admin panel by clicking on a little gear icon at the bottom-left corner of the screen. Step 3: Create a goal (including dollar value) There are three columns in the Admin view: Account, Property, and View. In the “View” column, you will see a section marked “Goals.” Once you are in Goals, select “+New Goal.” I usually select “Custom” rather than the pre-filled templates. It’s up to you. I’d give the Custom option a spin just to familiarize yourself with the selectors. Now fill out the goal based on the analysis conducted in step #1. One goal should be filled out for each conversion action you’ve identified. The most important factor is filling out a value. This is the dollar amount for this goal. The Google description of how to create goals is located here: Create or Edit Goals Step 4: Create and apply a “Segment” for Organic Traffic Once you have your goals set up, you’ll want to set up and automate reporting. Since we’re analyzing traffic from search engines, we want to isolate only traffic coming from the Organic Channel. Organic traffic = people who arrive on your site after clicking on a link from a search engine results page. An easy way to isolate traffic of a certain type or from a certain source is to create a segment. Navigate to any Google Analytics page in the reports section. You will see some boxes near the top of the page, one of them labeled “All Users” (assuming segments haven’t been configured in the past). Select the box that says \"All Users” and it will open up a list with checkboxes. Scroll down until you find the checkbox that says “Organic Traffic,” then select and apply that. Now no matter what reports you look at In Google Analytics, you’ll only be viewing the traffic from search engines. Step 5: Review the Google Analytics Landing Page Report Now that we’ve isolated only traffic from search engines using a Google Analytics Segment, we can view our content performance and assess what is delivering the most favorable metrics. There are several reports you can use, but I prefer the “Landing Pages” report. It shows you the page where a visitor begins their session. If I want to measure blog writers, I want to know whose writing is generating the most traffic for me. The Landing Pages report will help do that. To get to the Landing Pages report in Google Analytics, select this sequence of subheadings on the left sidebar: Behavior > Site Content > Landing Pages This report will show you, for any period of time, which pages are delivering the most visits. I suggest going deeper and sorting the content by the columns “Pages per session” and “Session Duration.” Identify the articles that are generating the highest average page depth and longest average session duration. Google will see these behaviors and signal that you’re delivering value to your visitors. That is good for SEO. Step 6: Review the conversion value of your writers Remember those goals we created? In the far right columns of the Landing Pages report, you will find the value being delivered by each page on your site. This is where you can help answer the question, “Which article topics or writers are consistently delivering the most business value?” If you want to share this report with your team to help increase transparency, I recommend navigating up to the top of the page and, just beneath the name of the report, you’ll see a link called “Email.” Automate your reporting by setting up an email that delivers either a .csv file or PDF on a monthly basis. It’s super easy and will save you a ton of time. Want to learn more SEO content tips? If you find this kind of step-by-step process helpful, consider joining Moz for our online training course focused on SEO for copywriters. You can find the upcoming class schedule here: See upcoming schedule Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO for Copywriters: Tips on Measuring SEO Impact - Next Level"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO for Copywriters: Tips on Measuring SEO Impact - Next Level"
    },
    {
      "level": "H2",
      "text": "What is SEO content?"
    },
    {
      "level": "H2",
      "text": "What should I measure?"
    },
    {
      "level": "H2",
      "text": "How to measure SEO content using Google Analytics"
    },
    {
      "level": "H3",
      "text": "Step 1: Review conversion actions on site"
    },
    {
      "level": "H3",
      "text": "Step 2: Navigate to the Admin panel in Google Analytics"
    },
    {
      "level": "H3",
      "text": "Step 3: Create a goal (including dollar value)"
    },
    {
      "level": "H3",
      "text": "Step 4: Create and apply a “Segment” for Organic Traffic"
    },
    {
      "level": "H3",
      "text": "Step 5: Review the Google Analytics Landing Page Report"
    },
    {
      "level": "H3",
      "text": "Step 6: Review the conversion value of your writers"
    },
    {
      "level": "H3",
      "text": "Want to learn more SEO content tips?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Brian Childs\n          \n            Brian Childs\n          \n            Brian Childs"
}