{
  "url": "https://moz.com/blog/seo-website-analytics",
  "slug": "seo-website-analytics",
  "title": "SEO Website Analytics: Going One Step Deeper Into GA - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We rely heavily on analytics for reporting. But did you know that Google Analytics provides data that can be used as a strategy tool? This post offers a quick look at three very specific, very actionable Google Analytics views for uncovering SEO opportunities: tracking Core Web Vitals, finding and…",
  "content": "SEO Website Analytics: Going One Step Deeper Into GA SEO Analytics | SEO Reporting By: Brie E Anderson March 24, 2021 Table of Contents Copied! By: Brie E Anderson March 24, 2021 SEO Website Analytics: Going One Step Deeper Into GA SEO Analytics | SEO Reporting Website analytics can tell us a lot about our audience and how they interact with our site. Oftentimes, we rely heavily on these analytics for reporting. But what if I told you that Google Analytics provides data that can be used as a strategy tool? In this post, we are going to quickly look at three very specific, very actionable Google Analytics views for uncovering SEO opportunities. Track Core Web Vitals Google has verified that Largest Contentful Paint (LCP), First Input Delay (FID), and Cumulative Layout Shift (CLS) are now part of the Page Experience ranking factor. These metrics together make up Core Web Vitals. This topic has already been covered many times in the SEO industry, and Google itself has covered the topic along with how to measure the metrics, so we won’t dive too deep into the metrics themselves. In the documentation provided by Google, they break down how you can pull LCP, FID, and CLS in data into Google Analytics. This can be done by setting up custom events using the code found on GitHub. Upon setting up those events, you’ll be able to see all of the Core Web Vital metrics in Google Analytics. They will show up when you go to Google Analytics > Behavior > Events > Top Events and toggle over to Event Action. To get further insight into how each page is performing in each category, use a secondary dimension of Page. Source: Noise to Signal To find the underperforming pages, use advanced filters to look for pages that fall under the “good” benchmark according to Google. Using this data, you can tackle Core Web Vitals head-on and keep a close eye on performance as you make changes. Find and fix 404s The last thing you want is for people to finally come to your site just to be sent to an “Oops” page. This can happen for a variety of reasons: a mis-shared link, a forgotten redirect, a misspelled word in the URL, etc. It’s important to find these pages early and set up a fix right away to create the best possible experience for users. The easiest way I’ve found to identify these URLs is to navigate to a page I know doesn’t exist on my website. For example, you may type in example.com/roger-rocks, then, when the page loads a 404, grab the title tag. Now you can navigate to Google Analytics > Behavior > All Pages and toggle over to Page Title. Once here, do a search using the title tag of your 404 page. You’ll be shown one row with all of the stats for your 404 page. If you click on the title name, you’ll be presented with a new screen with all of the URLs that resulted in a 404 page. These are the URLs you need to research, determine why people are going to them, and then decide what you need to fix. Again, those fixes may require creating or fixing a redirect, fixing a link (internal or external), creating content for that URL, and so on. Find and capitalize on easy traffic opportunities Search Console is a great tool for SEOs, as it gives us insights into how we’re performing in the search engine result pages. The downfall of Search Console is that the filtering options make it tough to manipulate the data — this isn’t the case with Google Analytics. In Google Analytics, under Acquisition, you’ll find Search Console. If you have correctly connected your Google Analytics account with Search Console, your position, CTR, query, and landing page data should all be there. So, if you go to Google Analytics > Acquisition > Search Console > Query, you can use the advanced search bar to help you find the data you want. In this case, let’s include Average Position less than 10, include Average Position greater than 3, and include CTR of less than 5%. After applying this search filter, you'll find a list of keywords you currently rank well enough for, but that could use just a little boost. Increasing the CTR may be as simple as testing new title tags and meta descriptions. A higher CTR may lead to an increase in rankings, but even if it doesn’t, it will lead to an increase in traffic. Pro tip: track your changes The only way to know what is affecting your traffic is to track your changes. If you update a page, fix a link, or add a new resource, it may be enough to change your rankings. I find that tracking my changes in the annotations section in Google Analytics allows me to deduce potential effects at a glance. When a date has an annotation, there is a small icon on the timeline to let you know a change was made. If you see a bigger (or smaller) than usual peak after the icon, it could be a hint that your change had an impact. But remember, correlation does not always equal causation! As Dr. Pete would say, run your own tests. This is just meant to be a quick reference check. In conclusion Google Analytics is often used for reporting and tracking. But, that same data should be used to put a strategy into action. By taking your analytics just a step further, you can unlock serious opportunities. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Website Analytics: Going One Step Deeper Into GA"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO Website Analytics: Going One Step Deeper Into GA"
    },
    {
      "level": "H2",
      "text": "Track Core Web Vitals"
    },
    {
      "level": "H2",
      "text": "Find and fix 404s"
    },
    {
      "level": "H2",
      "text": "Find and capitalize on easy traffic opportunities"
    },
    {
      "level": "H2",
      "text": "Pro tip: track your changes"
    },
    {
      "level": "H2",
      "text": "In conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Brie E Anderson\n          \n            Brie E Anderson\n          \n            Brie E Anderson"
}