{
  "url": "https://moz.com/blog/seo-myths",
  "slug": "seo-myths",
  "title": "10 SEO Myths that Friggin' Tick Me Off - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Most non-SEO folk you talk to are generally very nice people. Then, though, there's the non-SEO \"expert\" (loosely defined as someone who has a cousin in marketing). Well intentioned but misinformed, they believe SEO is urban legend, no better than a Ponzi scheme. In this post are a few of the worst…",
  "content": "10 SEO Myths that Friggin' Tick Me Off SEO Basics By: Cyrus Shepard March 9, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Cyrus Shepard March 9, 2015 10 SEO Myths that Friggin' Tick Me Off SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I love SEO. I love talking about SEO. Most non-SEO folk you talk to are generally very nice people. They may not understand everything you say, but they often nod their head and smile. The open-minded may even ask you to look at their site. On the other hand, there's the non-SEO \"expert\" (loosely defined as someone who has a cousin in marketing) who represents a different beast altogether. Well intentioned but misinformed, they believe SEO is urban legend, no better than a Ponzi scheme. Here's what I have to say to a few of the worst offenders. 1. SEO is a scam What the friggin' what? The above screenshot of organic traffic to Moz's own website shows the kind of success many strive for, but it is neither unusual or unattainable for folks that consistently invest in SEO as a marketing strategy. Sadly, many business owners have been approached by less-than-ethical marketing vendors who promise SEO services but basically deliver nothing. If you are paying $49/month to a service that promises you top rankings in Google, it is almost certainly a scam. That's not SEO. Perhaps this most harmful of myths stems from those seeking quick and easy wins with little effort. Indeed, there are cases of SEO wins that meet these criteria, typically when a site has easily correctable technical problems. In other cases, SEO involves real effort and commitment which often pays additional rewards beyond the increase in traffic. 2. Google will figure it out No. No they friggin' won't. Here's what many webmasters see far too often when they trust search engines to do their SEO for them. The temptation of many website owners and developers is to throw as many URLs as possible—sometimes millions—at Google's crawlers and pray that their mysterious algorithms will magically deliver these pages to valuable users. Alternatively, even sites with a handful of pages expect search engines to do all the heavy lifting. Google is smart, but not magic. What's forgotten in this equation is that Google and other search engines strive to mimic human behavior in evaluating content (and no human wants to sort through a million near-duplicate pages) and use human generated signals (such as links and engagement metrics) to crawl and rank results. Every page delivered in search results should be unique, valuable, and more often than not contain technical clues to help search engines sort them from the billions of possible pages on the web. Without these qualities, search marketing is a game of chance that almost always loses. 3. We did SEO once Congratulations. Buy yourself a cookie. It's sad to see organic search traffic fall over time, but all too often that's exactly what happens when no effort is applied. Continually maintaining your SEO efforts is essential because of: Link degradation (a.k.a. link rot) Publishing new pages Evolving search engine algorithms The competition moving ahead of you Outdated content ...and more For a small minority of sites, SEO doesn't need continual investment. My father-in-law's auto shop is a perfect example. He has more business than he needs, and as long as folks find him when searching for \"Helfer Auto\" he's happy. In this case, simply monitoring your SEO with the addition of a deeper dive 2-3 times per year may be sufficient. For the rest of us, one-and-done SEO falls short. 4. Link building is dead (again) Sigh. Recently the SEO world got worked up when Google's John Mueller stated link building is something he'd \"try to avoid.\" Many misinterpreted this to mean that link building is bad, against the rules, and Google will penalize you for it. In fact, nothing has changed that the fact that search engines use link authority and anchor text signals heavily in their search ranking algorithms. Or that white-hat link building is a completely legitimate and time-tested marketing practice. Weighting the Clusters of Ranking Factors in Google's Algorithm by Rand Fishkin I'm certain John was referring to the more manipulative type of link building, no doubt encountered frequently at Google. To be fair, this type of non-relevant, scaled approach to links should be avoided at all costs, and search engines have taken great strides to algorithmically detect and punish this behavior. Marketers build links in a number of natural ways, and attracting links to your website remains darn-near essential for any successful SEO undertaking. If you need help, we write about it frequently. 5. I want to rank #1 for \"magic keyword\" No. No you friggin' don't. Look, here's a personal example. I really want to rank #1 for \"SEO\" because Moz offers SEO software. Because of our Beginner's Guide to SEO. Because SEO is our lifeblood. But we don't, and it doesn't matter. Moz typically ranks #2-3 for \"SEO\". It sends good traffic, but not nearly as good as the thousands of long-tail keywords with more focused intent. In fact, if you went through our entire keyword set, you would find that \"SEO\" by itself only sends a tiny fraction of our entire traffic, and we could easily survive without it. The truth is, when you create solid content focused around topics, you almost always receive far more (and oftentimes better) traffic from long-tail keywords that you didn't try to rank for. The magic happens when visits reach your site because the content matched thier needs, but not necessarily when you matched the right keywords. 6. Google hates SEO Some days, it feels that way. In truth, Google's relationship with SEO is much more nuanced. Google readily states that SEO can \"potentially improve your site and save time\" and that many SEO agencies \"provide useful services.\" Google even advises \"If you're thinking about hiring an SEO, the earlier the better.\" Google published their own SEO Starter Guide. While a bit out of date, it certainly encourages people to take advantage of SEO techniques to improve search visibility. Google Analytics offers a series of SEO Reports. Keep in mind, these are almost laughably unusable due to the handicapped data quality. While Google seems to encourage search engine optimization, it almost certainly hates manipulative SEO. The type of SEO meant to trick search engines into believing false popularity and relevancy signals in order to rank content higher. In fact, many of the myths in the post boil down to some folks' inability to distinguish between hard-working SEO and search engine spam. Which leads us to: 7. SEO is dead, because Google Answers It's scary for SEOs when we ask Google a question and see an actual answer instead of a link, as in the example below. It's even more frightening when Google takes over entire verticals such as the weather, mortgage calculators, or song lyrics. With the flip of a button, it seems Google can wipe out entire business models. Screenshot hat tip to Dan Barker In reality, search growth and traffic continues to grow for most industries. Consider the following: World Internet and search activity continues to rise, particularly in the mobile sector. This generally indicates that more users are performing more searches on a greater number of devices. MozCast reports only 4.9% of Google searches result in an answer box. A recent study by Stone Temple showed that 74.3% of Google answer boxes contained linked attribution, while the rest was public domain knowledge. Anecdotal evidence further suggests that even when presented with answer boxes, a large number of users click through to the cited website. People want answers, but at least for now they also want their websites. 8. SEO is all tricks Really? This is plain sad. Somebody make me a sad salad. \"Tricks\" is what professionals call bad, manipulative SEO that gets you penalized. The problem, I believe, is the first thing any developer or marketing manager hears about SEO is something close to \"put more keywords in the title tag.\" If that's all SEO is, it does sound like tricks. Real SEO makes every part of content organization and the browsing experience better. This includes: Creating content that reverse engineers user needs Making content more discoverable, both for humans and search engine crawlers Improving accessibility through site architecture and user experience Structuring data for unambiguous understanding Optimizing for social sharing standards Improving search presence by understanding how search engines generate snippets Technical standards to help search engines categorize and serve content to the right audience Improving website performance through optimizations such as site speed Sharing content with the right audiences, increasing exposure and traffic through links and mentions Each of these actions is valuable by itself. By optimizing your web content from every angle, you may not even realize you're doing SEO, but you'll reap many times the rewards. 9. PageRank Actually, I like PageRank. But it's still a flippin' myth. PageRank was an incredibly innovative solution allowing Google to gauge the popularity of a webpage to the point that they could build the world's best search engine on the concept. Despite what people say, PageRank is very likely still a part of Google's algorithm (although with severely reduced influence). More than that, PageRank gave Google the ability to build more advanced algorithms on top of the basic system. Consider concepts like Topic Sensitive Page Rank or even this recent paper on entity salience from Google Research which highlights the use of a PageRank-like system. The source of many bad myths So why is PageRank such a bad myth? Toolbar PageRank, the PageRank most SEOs talk about, will likely never be updated again. PageRank correlates poorly with search engine rankings, to the point that we quit studying it long ago. PageRank is easy to manipulate. Fortunately, Google has moved away from talking about PageRank or supporting it in a public-facing way. This will hopefully lead to an end of people using PageRank for manipulative purposes, such as selling links and shady services. If you're interested, several companies have developed far more useful link metrics including Majestic's Citation Flow, Ahrefs Rank, and Moz's Page and Domain Authority. 10. Social activity doesn't affect SEO At this point, I barely have strength left to argue. Explaining this myth could take an entire post, so I'll boil it down the bare facts. The basic argument goes like this: \"Google says they don't use Facebook likes or Tweet counts to rank websites. Therefore, social activity doesn't matter to SEO.\" This statement is half right, but can you guess which half? It's true that Google does not use metrics such as Facebook shares or Twitter Followers directly in search rankings. On the other hand, successful social activity can have significant secondary effects on your SEO efforts. Social activity helps address two of the major tasks facing SEOs: Search engine discovery and indexation Content distribution, which leads to links and shares Perhaps no one explains it better than AJ Kohn, in his excellent Social Signals and SEO. Stolen with permission from AJ Kohn Successful social activity puts your content in front of the right group of users, increasing visits, engagement, and brand signals like the number of users searching for your site. Finally, the simple act of more influencers visiting your content can lead to more links and further sharing, and the cycle repeats itself. All of these secondary effects can significantly boost your SEO efforts. More myths from SEOs We asked several folks on Twitter about their least favorite SEO myths. Here are a few favorite replies. @CyrusShepard That Google doesn't use any visit/engagement/traffic data in any way in their search quality systems— Rand Fishkin (@randfish) February 20, 2015 @CyrusShepard the one that still bugs me the most is PageRank— Barry Schwartz (@rustybrick) February 20, 2015 @CyrusShepard The disavow tool is useless. :)— Marie Haynes (@Marie_Haynes) February 20, 2015 @dan_shure @CyrusShepard How about \"you can absolutely, unequivocally rely on the canonical tag... even when set up perfect\" :(— Bill Sebald (@billsebald) February 20, 2015 @CyrusShepard you should have x number of keywords in your keywords meta tag, you know, the tag you don't need.— Chris McElroy (@SEOpn) February 20, 2015 @CyrusShepard That SEO is something that can be done once and then your site is magically all-good for rankings nirvana for the rest of days— Christian Bullock (@ChristianBk) February 20, 2015 @CyrusShepard that there is no point getting more than one link from the same domain as it doesn't pass anymore value.— Tim Grice (@Tim_Grice) February 20, 2015 @CyrusShepard That you can pay an agency $100/month and “rank #1 for everything!”— Brandon Hassler (@BrandonHassler) February 20, 2015 @CyrusShepard That it's easy. If it's that damn easy, how come Google invest huge amounts in providing *relevancy* (algos, patents, tech)?— Tony Dimmock (@Tony_DWM) February 20, 2015 @CyrusShepard Google favors pages that run AdWords. I roll my eye whenever I heard this from a \"subject expert\" and they've died in my mind.— victorpan (@victorpan) February 20, 2015 @CyrusShepard Bonus myth, SEO is dead! :)— Hardik Oza (@Ozaemotion) February 20, 2015 @CyrusShepard That everything out of Google’s PR mouth about SEO is truth— Erica McGillivray (@emcgillivray) February 20, 2015 @CyrusShepard I don't stand a cliche that has become a myth for having being so badly used (also by Google: content is king cc: @randfish— Gianluca Fiorelli (@gfiorelli1) February 21, 2015 @CyrusShepard PPC plays a role in SEO ie if you pay to play, google rewards organically. Sad how often I run into this.— Damon Gochneaur (@DamonGochneaur) February 20, 2015 @CyrusShepard JSON-LD / Microdata / http://t.co/9u0ueDBJF3 / Rich Snippets automatically add your listings to SERP / Knowledge Graph— Simo Ahava (@SimoAhava) February 20, 2015 What SEO myth drives you nuts? Let us know in the comments below! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "10 SEO Myths that Friggin' Tick Me Off"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "10 SEO Myths that Friggin' Tick Me Off"
    },
    {
      "level": "H2",
      "text": "1. SEO is a scam"
    },
    {
      "level": "H2",
      "text": "2. Google will figure it out"
    },
    {
      "level": "H2",
      "text": "3. We did SEO once"
    },
    {
      "level": "H2",
      "text": "4. Link building is dead (again)"
    },
    {
      "level": "H2",
      "text": "5. I want to rank #1 for \"magic keyword\""
    },
    {
      "level": "H2",
      "text": "6. Google hates SEO"
    },
    {
      "level": "H2",
      "text": "7. SEO is dead, because Google Answers"
    },
    {
      "level": "H2",
      "text": "8. SEO is all tricks"
    },
    {
      "level": "H2",
      "text": "9. PageRank"
    },
    {
      "level": "H2",
      "text": "10. Social activity doesn't affect SEO"
    },
    {
      "level": "H2",
      "text": "More myths from SEOs"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Cyrus Shepard\n          \n            Cyrus Shepard\n          \n            Cyrus Shepard"
}