{
  "url": "https://moz.com/blog/seo-standards-debate-is-back-but-somethings-missing",
  "slug": "seo-standards-debate-is-back-but-somethings-missing",
  "title": "SEO Standards Debate is Back - But Something's Missing... - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In case you haven't seen the litany of content around the search marketing world regarding SEO Standards, here's a short re-cap.\n\n    The issue arose (this time around) when Danny Sullivan made Is it Time for Search Marketing Standards? a panel at SMX West in February. You can see the ...",
  "content": "SEO Standards Debate is Back - But Something's Missing... Public Relations By: Rand Fishkin April 7, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 7, 2008 SEO Standards Debate is Back - But Something's Missing... Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In case you haven't seen the litany of content around the search marketing world regarding SEO standards, here's a short re-cap. The issue arose (this time around) when Danny Sullivan made Is it Time for Search Marketing Standards? a panel at SMX West in February. You can see the SERoundtable coverage here. In late March, Jill Whalen wrote what I personally felt was a very good post about why We Don't Need SEO Standards! Ian McAnerin chimed in on his blog with some fairly good refutation of Jill's points - Search Standards Part 1 and Part 2. Lisa Barone added her $0.03, saying We Do Need SEO Standards. Jessica Bowman took a bit of a different stance and suggested SEO standards on a company-wide, not industry-wide basis in her post Do You Need SEO Standards for Your Company? Various Sphinn discussion threads on the topic - here, here and here - have been fairly heated. Since it's a royal pain to try to read all of that (even though I know those of you addicted to the drama of the search world surely will), I've excerpted some of my favorite arguments and quotes: From Jill Whalen: Every industry has their share of bad guys and good guys. Industry market forces and the search engines themselves will eventually dictate what best practices are and are not... ...For those who just don't get it, all the definitions and rules in the world won't change them. Market forces will either require them to change their ways, or they'll simply end up out of business. From Ian McAnerin: I disagree. Although it's all well and good to approach things with a completely laizzes faire, buyer beware attitude, in practice standards are not about SEO's. They are about the public. SEO's don't need protection from other SEO's. Neither do search engines. Why do lawyers and doctors and firemen and engineers and almost every other industry have standards? Do lawyers need protection from other lawyers? Is there a big concern that by implementing standards your lawyer will not be able to help you sell your house or write your will? Or that shady lawyers would take advantage of those poor, unsuspecting judges? Bah. The standards are there so that the non-legally trained public has the right to be informed about their rights and obligations, and has a reasonable expectation of a certain level of service and professionalism. From Lisa Barone: For search engine optimization to become a legitimate industry, we need to start treating ourselves as one. Ian McAnerin actually brought up a great point during the Is It Time For Search Marketing Standards panel reminding us that search engine optimization is a form of advertising. It’s not a matter of should it be regulated, advertising MUST be regulated. If we don’t do it, someone else is going to come in and do it for us. I’d rather see us create our own guidebook. From Jessica Bowman: The debate on the need for SEO standards continues, with no clear industry-wide consensus. Without a doubt, however, your company should have SEO standards and guidelines that convey your company's stance on SEO—namely, clearly spelling out acceptable practices and perhaps even more importantly, definitely drawing boundaries that cannot be breached regardless of whether they may increase traffic to your site. From Chris Boggs: The sky is falling. As marketers become more aware of the power of SEO, they're also becoming increasingly victimized by unscrupulous practitioners of SEO. Any marketing executive can search Google or other search engines to find a number of horror stories related to SEO experiences... ...There are many comments out there in a number of discussions related to this topic that advocate the \"we don't need 'em\" stance, but the majority of those arguments are based on the premise that we \"have been doing fine without them for years.\" Balderdash! Again, I counter that we've evolved into an industry that needs \"standards.\" Without them, there's too much confusion out there as to what works and what's an acceptable risk to take. Some SEOs must not like this idea because it could mean they'll actually have to provide more assurance and clearer goals in their statements of work. God forbid that SEOs should be held to standards like the rest of the world. I just have to comment on this post, which aroused my ire a bit. I think Chris makes some great points, and he's also a good friend, but the sky is most certainly not falling, and I think you need to have some statistics to back up the point that the public is \"increasingly victimized by unscrupulous practitioners of SEO.\" To be honest, my personal anecdotal experiences suggest that it's actually falling from a height in 2004-5, but without data to back it up, it seems like a fallacy to claim that \"fact\" to help bolster your argument. And, honestly, suggesting that SEOs are too lazy to embrace standards isn't a very positive way to go about things, either. OK, You're pretty much as caught up as you need to be. Now I'm going to share my personal opinions - take them with as much or as little salt as you'd like. Let me just first say that in general, I'm with Jill on this - we don't NEED search marketing or SEO standards, and it's hard to discount the fact that some of those suggesting that we need standards stand to gain personally from that stance (though I choose to believe that's not influencing their decisions). We NEED clients and we NEED engines and we all probably NEED to get out and exercise a bit more. Standards are an option, and we should weigh them the way we do any other business decision. With that in mind, I will say that I'm certainly open to the idea that standards might have some positives to offer, but probably some negatives, too. As I see it: Benefits of Search Marketing Standards: May generate positive press/media about SEO and through it, more business Potentially useful as a defense against lawsuits or legal issues (Sarah, you'll have to tell us to what degree this could actually be the case) Possibly creates more trust between clients and service providers Could stop outside bodies (governmental or otherwise) from creating standards/regulations first Potential Negatives of Standards: Standards would create boundaries outside of which member companies could not operate (limiting experimentation and innovation) Standards would need constant updating and revising as the industry and its tactics shift every 3-6 months Conflicts/struggles may arise between those who want standards one way vs. another A small group of individuals would eventually need to make the final decisions, possibly resulting in industry-insider antagonism (and feelings of outsider-ism as well) Those who do/don't ascribe to the standards might have hostility towards one another Clients of companies who uphold the standards (or even rival companies) would have the ability to get companies banned or sanctioned, and this could create some nasty infighting Money and effort would go towards promoting members of the \"standards-compliant\" set of companies, rather than the SEO industry as a whole SEO discussion forums would be covered in posts claiming companies or sites that violated the SEO guidelines (even though there would technically be no recourse or punishment unless those companies were members of the standards body) Some SEO companies would almost certainly market their non-membership as a sign that they were more creative and potentially more effective than those \"toeing the party line\" I think the potential positives here are currently outweighed by the negatives, with one potential exception - the last point on creating the standards ourselves before someone else does. I'm a bit concerned that there's some fearmongering going on, as I've yet to hear even the faintest of distant rumbles that regulation of any kind could be coming to the search industry, but I'd certainly much rather have Chris Boggs or Ian McAnerin creating SEO standards than Uncle Sam (or his non-US equivalents). To be honest, I'm not particularly opposed to standards and if I personally agreed with them, I'd probably be willing to join a standards organization as long as it wasn't too costly, too time-intensive, or fraught with political issues (and I genuinely fear it could be all three). The big problem I see is that no individual or organization has actually put forward even an outline of what these standards might look like. Ian noted in his post that some of Jill's arguments against SEO standards were weak, but I'd say that until I can look at an actual document with the proposed standards, it's a pretty tough concept to get behind. Arguing over whether or not to take a theoretical stab at something seems pretty silly to me. So let me just end this post with something that might help out - a relevant poll, not about whether we need standards, but about what you would personally do if they existed. If a Search Marketing Organization Created Industry Standards Would You... ( polls) I have concerns that, just like in the realm of politics, a theoretical standards list is something far more people will be open to than the real thing once they read it. I'm also worried that there isn't currently an organization in the search world that wields the authority to create these standards. Danny Sullivan and Chris Sherman could probably pull it off, but I have serious doubts as to their interest in such a project. SEMPO has said publicly that they're not a standards body. In the session at SMX, it was suggested that search marketers should approach the Interactive Advertising Bureau (IAB) and the Direct Marketer's Association (DMA) to help create the standards, but these seem like even less influential voices in search than SEMPO. My position here remains - show me a roadmap, show me who's creating the standards, and show me the actual document before we start arguing over whether we'll accept it or not. I'd also like to hear from someone intimately familiar with the law and industry regulation about whether search marketing is in danger of getting outside regulation if we fail to do so ourselves. Any volunteers for either of these tasks? :) P.S. I'm leaving for Sydney today and will be traveling for almost 50 of the next 60 days, so expect my posting to be sparse (and off normal schedule) until SMX Advanced in June. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Standards Debate is Back - But Something's Missing..."
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO Standards Debate is Back - But Something's Missing..."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}