{
  "url": "https://moz.com/blog/seo-beyond-the-instant",
  "slug": "seo-beyond-the-instant",
  "title": "SEO Beyond the Instant - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": " \nThere's been a lot of discussion about the effects, or lack thereof, of Google Instant on SEO. Initial reactions seem to have polarized users, and while it's probably too soon to predict Instant's impact on search behavior, this may be a good time to raise some questions I've been dwelling on…",
  "content": "SEO Beyond the Instant Public Relations K By: KenSpeckle-138545 November 25, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! K By: KenSpeckle-138545 November 25, 2010 SEO Beyond the Instant Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. There's been a lot of discussion about the effects, or lack thereof, of Google Instant on SEO. Initial reactions seem to have polarized users, and while it's probably too soon to predict Instant's impact on search behavior, this may be a good time to raise some questions I've been dwelling on recently regarding the state of optimization. I've been a search enthusiast for a few years now, a cross-over from the design side, and have found it challenging and interesting enough to officially switch careers earlier this year. Google Instant's been a bit of a surprise, though - not because of what's changed but because of what hasn't: we still have to defend the legitimacy of SEO! The very notion that search engine optimization could 'die' before search engines do is ridiculous, but the number of posts I've read in my RSS these past few weeks insisting (nay, proving) that it hasn't are enough to make any professional cringe. So I've been wondering... Why are we so defensive? By the end of the year, SEM is set to become a $16 billion dollar industry in the US. Search professionals know what good SEO can do and has done for their clients. Unlike other aspects of online business such as social media and web design, search engine optimization is data-driven and measurable. So why do we feel compelled to prove that SEO is alive and okay? The following are some reasons I can think of: SEO is reactive by definition. The O follows the SE, you know? Our strategies and methods are developed in response to those of search engines, so we have a lot invested in how they work. On the one hand this means that our campaigns can be unsettled by change; on the other, it can keep us from developing a truly proactive approach to optimization. So any time Google changes, conditions are ripe for some poorly-informed, opportunistic or trigger-happy blogger to revive the rumor that the ‘old’ knowledge no longer applies. Our identity is in crisis. Measuring ROI may be the biggest challenge facing search engine marketing, but that’s a challenge inherent in marketing itself and is not specific to SEM. A bigger problem, at least for small SEOs like me, is to define the role and scope of my job and manage different budgets, expectations and goals – not only across but within specific projects. Many small business clients either don’t know what to expect from hiring an SEO or, more often, expect everything from it. There are numerous reasons for this, including the fact that SEOs come from all kinds of backgrounds – copywriting, programming, design, data analysis and marketing, to name a few – which makes SEO an umbrella term for all kinds of search engine-related activities aimed at increasing visibility and profit. Also, do-it-yourself search optimization, while great and ideally suited for small websites and blogs, perpetuates the notion that SEO is formulaic – so whenever the search ‘formula’ changes, our methods come into question. All this murkiness, in my view, is keeping the search industry from getting the legitimacy it deserves, and makes SEOs trip over each other when it comes to educating clients. And as long as our clients are uneducated, they will continue to serve as targets for rumors regarding the death of SEO. We don’t have adequate search intelligence. I’m not impugning our smarts, but rather suggesting that the broader SEO conversation tends to focus much more on techniques and analytics than the insights that data can provide into our market and its search behavior/needs. Search engine and SEO tools give us keyword analysis, and our own analytics reveal a lot about user behavior, but what those insights are and how they can be used to fine-tune the larger SEM strategy is a crucial part of increasing conversions, and ultimately, will help to move SEO beyond the realm of keyword research and metrics into true marketing intelligence. We service behind the scenes. Why do people outside the industry know so little about how SEO works? Part of it may be the fact that we’re a client servicing industry for web-site owners, but have little to no interaction with or visible impact on user experience. So other than our clients, no one knows how much or what kind of credit to give to optimizers (beyond landing a web site on the First Page of Google, a perception which leads to its fair share of headaches, too). On the internet, you can either be a developer/builder behind the scenes, or a front-end service provider. The former makes things work for everyone, while the latter makes things look and feel good (for the client and the user). SEOs... are caught in the middle. We work behind the scenes to improve, fine tune and enhance numerous things, but the value of those things is known and limited to our clients only. This may also be why a UI Google update like Instant has prompted a lot more SEO-related anxiety than, say, the May update, even though the latter had much more immediate consequences for traffic and SEO. Our goals are considered \"at odds\" with search engines. Finally, maybe people think SEO is dead because search engines are actively trying to kill it. Some of the funereal views proposed over the last few weeks reveal that many people still think that the goals of SEO are in conflict with the goals of search engines, or that Google is trying to weed it out, like spam. This is a perception which, in my view, rests on two assumptions already mentioned above – that SEO is reactive and that it is formulaic -- combined with the notion that SEOs are out to sabotage organic results in favor of commercial, artificially popularized content. My intent is not to throw a pity party for SEOs. In fact, as a relatively new SEO, I am gung-go about finding ways to tackle the problems that can be fixed and quickly making peace with the ones that are beyond my control. But as a newbie I also find myself perhaps a bit more sensitive than the more experienced hats about the problematic perceptions plaguing our industry, not to mention a little confused about how to go about dealing with them. The following are some thoughts on the subject – and I invite the knowledgeable SEO community to give me feedback and alternatives for approaching these issues. Is it Time to Get Over Google’s Algorithm? If we don’t want to die at the mercy of Google’s algorithm or user controls, surely have to stop living by them, first. And maybe that means looking beyond the rankings, as an Atlanta Search Engine Optimization firm recently demonstrated by running a campaign to influence Search Suggest rankings for a prominent political figure. SEO techniques are guided not by search engines but by the goal of increasing conversions – that’s the only thing anyone is or should be willing to pay for, ultimately. SEO best practices are aimed at targeted traffic, and the way to provide that is through great content targeted at that traffic. We use the insights provided by search tools and analytics to reach our market, or rather, to make it as easy as possible for our market to come to us. In that scheme of things, search engines are tools and mediums for content-providers and consumers to come together -- not the dictators of SEO! Optimizing Our Own Skills As time goes on, users and clients will hopefully become more knowledgeable about SEO. But maybe we can help the process along by optimizing our search-related skills in the way that provides the most clarity and greatest benefit to our customers. We need to not only understand how the various elements of a web site interact with each other, with search engines and with users, but also capitalize on our individual search-related USPs in tandem with that understanding. I have a design and marketing background, so for me this means learning more about analytics and programming in a way that informs and improves my core skills. For an analyst, it might mean learning more about marketing. And so on. Thinking about search behavior All SEO techniques are guides by Insight into user needs can help an SEO move from numbers-based keyword research and metrics to SEO solutions that are more tailored, more feasible and ultimately more effective. The recent discussions about Google Instant have led some SEOs to the opinion that the top three ranks are going to become more important than ever before, but what about all the suggestions that the user is bombarded with before they even settle on a query? Google Instant, in addition to making search faster and more dynamic for users, also makes it more suggestive. On his blog, Matt Cutts mentions how Instant will make users spend more time on Google, clicking suggestions instead of hyperlinks. This should move us to learn more from our data about what users are looking for when they come to our site, and how we can target it more towards successful experiences and away from problems like bouncing. Map with marketing, drive on data I solicit your feedback on my opinion that search is going to get simpler, faster, more personalized and more commercial (which is to say, more competitive). Getting on the first page of Google means getting on the same page with Google – but that page doesn’t have the Google algorithm on it. Google is an advertising company, and what it likes, understands and responds to is effective marketing. The idea that their search results are being improved purely for users is part of Google’s own marketing message; the reality, as Rand mentioned and Aaron illustrated, is that organic results are being increasingly marginalized. Be it the Mayday update, the recent changes to the Suggest feature or the brand update – the future of search optimization is not in development or design, it’s in knowing how to get search engines to market your message and reflect the effectiveness of your marketing message. And the value of data in that scenario will not lie in metrics but in intelligence that will help to improve the message and inform offline communication and strategy as well. The rest is getting both easier and more supplemental. About the Author: A former web designer, Rebecca Amor now heads up the online marketing and search department of Premiere Tree Services of Charlotte. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Beyond the Instant"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO Beyond the Instant"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "KenSpeckle-138545\n          \n            KenSpeckle-138545"
}