{
  "url": "https://moz.com/blog/seo-principles-to-launch-by",
  "slug": "seo-principles-to-launch-by",
  "title": "SEO Principles to Launch By - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In preparation for a new project i'm starting, i've been reading mounds of information about web design and aesthetics.  You all know the drill, blog after blog, sifting through the duplicate content and article after article separating the useful information from corporate fluff.It was in this…",
  "content": "SEO Principles to Launch By Mobile SEO G By: George Davis February 15, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! G By: George Davis February 15, 2008 SEO Principles to Launch By Mobile SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. In preparation for a new project I'm starting, I've been reading mounds of information about web design and aesthetics. You all know the drill, blog after blog, sifting through the duplicate content, and article after article separating the useful information from corporate fluff. It was in this that I realized my big mistake: reading information for the sake of reading information. One of the books in the Ender's Game series (I can't for the life of me remember) talked about the amount of information that we amass in our minds and never do anything with--we forget it or lose track of it. If only we could remember EVERYTHING we ever heard or read, how much more successful would we be? With that, I decided that I will be starting this project with the following do's and don'ts strongly highlighted in my mind. Please understand this is by no means an exhaustive list, simply concepts that I feel are very important and should be given high priority. Everyone is of course free to disagree with me, and I even encourage that, because it gives me a chance to recognize the errors. 1. Do - Design with a strong SEO foundation. I'm a child of the Fishkin School of SEO. I learned my foundation from the SEOmoz guides. Unfortunately, by the time I got my hands on our corporate site, there were some key mistakes and shortcomings, EVEN though we already had an outside SEO provider. Always keep the principles of SEO and apply them in fresh and productive ways. 2. Do - Provide extensive content (content IS king). As much as everyone argues about it, in the long run, content always wins. The key here is to provide more than you think you need. SEOmoz in itself is a great example. There is enough free content here to keep you busy for weeks implementing it all, but that content is what motivates people to go premium. It adds legitimacy and establishes authority on the subject. 3. Do - Read and implement ideas from some of the well known sources in the SEO Sphere. SEOmoz, Search Engine Land, SEO Book, YOUmoz, etc. Some of the greatest tips and insights I've gotten are from blogs and SEO articles. Tip: don't waste time - read the important stuff, allow Sphinn and social media to do the work for you. I'm not discouraging participation, but there is a season to keep yourself disciplined... a product launch is probably a more worthy season than any. The Don'ts : 1. Don't - Have outrageous expectations of your site. You should have strong, crazy goals, and work hard to achieve them, but don't scrap your project just because it doesn't have the strength of sites that have been around forever. 2. Don't - Lose your zeal for the project. Continually remind yourself of the project's potential and why you started it in the first place. I'm not encouraging unrealistic optimism, but YOU have to be the biggest believer of your idea. If your idea doesn't motivate you, it's not going to motivate others. If you look at some of the successful figures in the SEO sphere, they all believe strongly in their product and its ability to benefit. 3. Don't - Give in to the temptation to swamp your project with every possible monetization opportunity that comes by. Be smart about your business, choose your calls to action wisely. Ann Smarty wrote an article about crafting your calls to action that I found to be very helpful. From this I think among anything you can do, it is supremely unwise to confuse your readers with too many possible doors. Just as you sculpt your PageRank and content, you should your reader's attention. Remember that every ad on your page is a call to action; your advertisers are certainly hoping they will, too, REGARDLESS of the content on the page. For example, I was reading a post on a blog on design decisions that annoy readers. One of his points is : Then you find this little gem a little further down the page : Remember guys, these are basic principles to having a successful project launch. Adapt them and fit them to your purpose. I look forward to hearing your opinions! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Principles to Launch By"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO Principles to Launch By"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too"
    },
    {
      "level": "H3",
      "text": "Internal Linking for Mobile-First & Mobile-Only Indexing"
    },
    {
      "level": "H3",
      "text": "All About Fraggles (Fragment + Handle)"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "George Davis\n          \n            George Davis"
}