{
  "url": "https://moz.com/blog/seo-target-keywords",
  "slug": "seo-target-keywords",
  "title": "How to Select Meaningful B2B SEO Keywords - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It’s no secret that B2B marketing is different than B2C. The sales cycle is longer, there are multiple stakeholders involved, and it’s usually more expensive. To market effectively, you need to create content that helps, educates, and informs your clientele. The best way to do that is to identify…",
  "content": "How to Select Meaningful B2B SEO Keywords Keyword Research | On-page SEO | Whiteboard Friday By: Cody McDaniel March 12, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Cody McDaniel March 12, 2021 How to Select Meaningful B2B SEO Keywords Keyword Research | On-page SEO | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. It’s no secret that B2B marketing is different than B2C. The sales cycle is longer, there are multiple stakeholders involved, and it’s usually more expensive. To market effectively, you need to create content that helps, educates, and informs your clientele. The best way to do that is to identify the keywords that matter most to them, and build out content accordingly. To find out how, watch this week's episode of Whiteboard Friday! Click on the whiteboard image above to open a high resolution version in a new tab! Video Transcription Hi and welcome to another Whiteboard Friday. My name is Cody McDaniel, and I'm an SEO manager at Obility. We are a B2B digital marketing agency, and today I want to talk about selecting meaningful B2B SEO keyword targets and the process and steps you can take in your own keyword research. So B2B is a little bit different than you would see in your normal B2C types of marketing, right? The sales cycle or the length of time it takes to actually make a purchasing decision is usually a lot longer than you would see just buying something off Amazon, right? It's going to take multiple stakeholders. Individuals are going to be involved in that process. It's going to be usually a lot more expensive. So in order to do that, they're going to want to be informed about their decision. They're going to have to look up content and information across the web to help inform that decision and make sure that they're doing the right thing for their own business. So in order to do that, we have to create content that helps, educates, and informs these users, and the way to do that is finding keywords that matter and building content around them. 1. Gather seed list So when we're developing keyword research for our own clientele, the first thing that we do is gather a seed list. So usually we'll talk with our client contact and speak to them about what they care about. But it also helps to get a few other stakeholders involved, right, so the product marketing team or the sales team, individuals that will eventually want to use that information for their clients, and talk with them about what they care about, what do they want to show up for, what's important to them. That will sort of help frame the conversation you want to be having and give you an understanding or an idea of where eventually you want to take this keyword research. It shouldn't be very long. It's a seed list. It should eventually grow, right? 2. Review your content So once you've done that and you have a baseline understanding of where you want to go, the next thing you can do is review the content that you have on your own website, and that can start with your homepage. What's the way that you describe yourselves to the greater masses? What's the flagship page have to say about what you offer? You can go a little bit deeper into some of your other top-level pages and About Us. But try to generate an understanding of how you speak to your product, especially in relation to your clients in the industry that you're in. You can use that, and from there you can go a little bit further. Go through your blog posts to see how you speak to the industry and to educate and inform individuals. Go to newsletters. Just try to get an understanding of what exists currently on the website, where your efficiencies may be, and of course where your deficiencies are or your lack of content. That will help you generate ideas on where you need to look for more keywords or modifications in the keywords you have. 3. Determine your rankings Speaking of which, with the keywords that you currently have, it's important to know how you stand. So at this point, I try to look to see how we're ranking in the greater scheme of things, and there are a lot of different tools that you can use for that. Search Console is a great way to see how potential users across the web are going to your website currently. That can help you filter by page or by query. You can get an understanding of what's getting clicks and generating interest. But you can also use other tools — SEMrush, SpyFu, Ahrefs, and Moz, of course. They'll all give you a keyword list that can help you determine what users are searching for in order to find your website and where they currently rank in the search engine results page. Now usually these lists are pretty extensive. I mean, they can be anything from a few hundred to a few thousand terms. So it helps to parse it down a little bit. I like to filter it by things like if it has no search volume, nix it. If it's a branded term, I don't like to include it because you should be showing up for your branded terms already. Maybe if it's outside the top 50 in rankings, things like that, I don't want that information here right now. 4. Competitive research I want to understand how we're showing up, where our competencies are, and how we can leverage that in our keyword research. So that should help the list to be a little bit more condensed. But one of the things you can also look at is not just internal but external, right? So you can look at your competition and see how we're ranking or comparing at least on the web. What do they use? What sort of content do they have on their website? What are they promoting? How are they framing that conversation? Are they using blog posts? All that information is going to be useful for maybe developing your own strategies or maybe finding a niche where, if you have particularly stiff competition, you can find areas they're not discussing. But use that competition as a framework for identifying areas and potential opportunities and how the general public or industry speaks to some of the content that you're interested in writing about. So once you have that list, it should be pretty big, good idea of the ecosystem you're working with, it's important to gather metrics. 5. Gather metrics This is going to contextualize the information that you have, right? You want to make informed decisions on the keywords that you have, so this metric gathering will be important. There are a lot of different ways you can do it. Here at Obility, we might categorize them by different topic types so we can make sure that we're touching on all the different levels of keyword usage for the different topics that we discuss in our content. You can look at things like search volume. There a lot of different tools that do that, the same ones I mentioned earlier — Moz, SpyFu, SEMrush. There's a great tool we use called Keyword Keg, that kind of sort of aggregates all of them. But that will give you an idea search volume on a monthly basis. But you can also use other metrics, things like difficulty, like how hard it is to rank compared to some of the other people on the web, or organic click-through rate, like what's the level of competition you're going to be going up against in terms of ads or videos or carousels or other sort of Google snippets. Moz does a great job of that. So use these metrics, and what they should help you do is contextualize the information so that maybe if you're pretty close on two or three keywords, that metric gathering should help you identify which one is maybe the easiest, it has the most potential, so on and so forth. So once you have that, you should be getting a good understanding of where each of those keywords lives and you should be selecting your targets. 6. Select target keywords Now I've run through a ton of clients who former agencies have sent them a list of 300 to 400 keywords that they're trying to rank for, and I cannot stand it. There's no value to be had, because how can you possibly try and optimize and rank for hundreds and hundreds of different variations of keywords. It would take too long, right? You could spend years in that rabbit hole. What we try to do is focus on maybe 30 or 40 keywords and really narrow down what sort of content is going to be created for it, what you need to optimize. Does it exist on your website? If not, what do we need to make? Having that list makes a much more compartmentalized marketing strategy, and you can actually look at that and weigh it against how you're currently deploying content internally. You can look at success metrics and KPIs. It just helps to have something a little bit more tangible to bite down on. Of course, you can grow from there, right? You start ranking well for those 20 or 30 terms, and you can add a few more on at the end of it. But again, I think it's really important to focus on a very select number, categorizing them by the importance of which ones you want to go first, and start there because this process in content creation takes a long time. 7. Consider intent But once you've selected those, it's also important to consider intent. You can see I've outlined intent here a little bit more in depth. What do I mean by that? Well, the best way that I've seen intent described online is as an equation. So every query is made up of two parts, the implicit and the explicit. What are you saying, and what do you mean when you're saying it? So when I think of that and trying to relate it to keywords, it's really important to use that framework to develop the strategy that you have. An example that I have here is \"email marketing.\" So what's the implicit and explicit nature of that? Well, \"email marketing\" is a pretty broad term. So implicitly they're probably looking to educate themselves on the topic, learn a little bit more about what it's about. You'll see, when you search for that, it's usually a lot more educational related content that helps the user understand it better. They're not ready to buy yet. They just want to know a little bit more. But what happens when I add a modifier on it? What if I add \"software\"? Well, now that you would have intent, it may mean the same thing as email marketing in some context, but software implies that they're looking for a solution. We've now gone down the funnel and are starting to identify terms in which a user is more interested in purchasing. So that type of content is going to be significantly different, and it's going to be more heavily implied on features and benefits than just the email marketing. So that intent is important to frame your keywords, and it's important to make sure that you have them in every step of your purchasing funnel. The way that I like to usually look at that, and you see it everywhere, it's an upside down triangle. You have your top, middle, and bottom level pieces of content. Usually the top is going to be things like blogs and other sorts of informational content that you're going to be having to use to inform users of the types of topics and things in the industry you care about. That's probably where something like \"email marketing\" would exist. But \"email marketing software\" is probably going to be sitting right here in the middle, where somebody is going to want to make an informed decision, relate it to other pieces of content on competitor websites, check those features, and determine if it's a useful product for them, right? From there, you can go a little bit further and move them into different types of content, maybe email marketing software for small business. That's far more nuanced and specific, and maybe you'll have a white paper or a demo that's specifically tailored to businesses that are looking for email marketing in the small business space. So having content in three separate spaces and three different modifications will help you identify where your content gaps are and make sure that users can move throughout your website and throughout the funnel and inform themselves on the decision they're trying to make. Conclusion So with that, this should give you some idea of how we develop keyword research here at our own agency, and I hope that you guys can utilize some of these strategies in your own keyword research wherever you are out in the world. So thanks again for listening. Happy New Year. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Select Meaningful B2B SEO Keywords"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Select Meaningful B2B SEO Keywords"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "1. Gather seed list"
    },
    {
      "level": "H2",
      "text": "2. Review your content"
    },
    {
      "level": "H2",
      "text": "3. Determine your rankings"
    },
    {
      "level": "H2",
      "text": "4. Competitive research"
    },
    {
      "level": "H2",
      "text": "5. Gather metrics"
    },
    {
      "level": "H2",
      "text": "6. Select target keywords"
    },
    {
      "level": "H2",
      "text": "7. Consider intent"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Cody McDaniel\n          \n            Cody McDaniel\n          \n            Cody McDaniel"
}