{
  "url": "https://moz.com/blog/seo-concepts-people-still-think-are-reality",
  "slug": "seo-concepts-people-still-think-are-reality",
  "title": "Outdated SEO Concepts People Still Think are Reality - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The bane of the existence of all search marketers is old or incorrect information given to clients at any point in time. This is a call to educate with a look at those concepts that make us do a serious facepalm.",
  "content": "Outdated SEO Concepts People Still Think are Reality On-page SEO | SEO Basics | SEO Consulting K By: Kate Morris September 18, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! K By: Kate Morris September 18, 2014 Outdated SEO Concepts People Still Think are Reality On-page SEO | SEO Basics | SEO Consulting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. It's on the internet, so it's true. The bane of the existence of all search marketers is old or incorrect information given to clients at any point in time that they still hang on to. This post was inspired by an interaction with a client's co-workers, people that are not thinking about SEO on a regular basis. This is not to knock them, but to bring to the attention of everyone that there is a continual need for education. These concepts have a way of hanging around. And this isn't about just clients either. This is about friends, parents, and partners. Does anyone else still get asked if they make pop-up ads when they try to explain what they do? (Just me? Crap.) Doing research for this post, I noticed there are a ton of SEO misconceptions out there, and people are talking about them regularly, but many are related to content marketing or online marketing overall. I'm not covering all misconceptions, but those concepts that seem to be stuck to the idea of SEO and will not let go. Then I'll give you resources to help educate the people that believe these misconceptions and alternate solutions to give them. Putting text behind an image The inspiration. The client is struggling with balancing revenue and content on the page. There is a large image on the page now and we suggested editing the page to add content about the product. The question was asked if we could just put the content behind the image and solve both problems. My client stepped in and answered the question wonderfully, but it brought to mind how many times I've seen overstuffed alt text attributes and content in a noscript tag that doesn't match what's in the Flash.Additional resource A Comprehensive Guide to Hidden Text Alternate solution In this instance, we recommended putting text below the fold for the users that wanted the information and keeping the current image for returning users. Balance that satisfies both user needs and the business goals.Copying a competitor's actions This isn't as obvious as hiding text, but it's something that companies refuse to stop doing. It's the concept that if a competitor is doing something, it must be worth doing. This goes for competitors ranking above a business, but it also covers competitors that the business just dislikes. We all have those competitors we want to \"beat\" and sometimes that makes us do things that are not fully researched and planned. Amazon.com is my biggest annoyance. I can't count how many times I've heard the reasoning \"but Amazon does it\" by major brands that other businesses look up to. Amazon, like most major companies, tests many things, and there is a different person behind each test. If you work for a large company, you understand what I mean. Additional resource Stop Copying Your Competitors, They Don't Know What They are Doing Either Alternate solution Everyone is on the hunt for the best results and bringing in new customers, retaining current customers, and making other stakeholders happy. The way you beat competitors is to listen to your stakeholders (customers, clients, partners, employees, investors) and make decisions based on their feedback as well as what is going on in the market.Sheer number of links equals ranking This has been debunked so many times it makes my head swim. That doesn't change how many people still think that the total number of links (as reported by a third party tool like Moz, Majestic, or AHREFs) is the sole factor in ranking. Want to do better in SERPs? Well, we need to hire someone to build us some links! I'm going to leave one screen shot here (Search: \"insurance\") and then we'll get into resources and solutions for when you have to face this. Additional resource Moz Search Ranking Factors Alternate solution This is more of an \"additional solution,\" as links and mentions are still very important, but as seen above, it's far from the only factor in ranking. It's best to explain the different ranking factors like content relevance to the query, some social data, query deserves freshness, local, news, personalization, and all of the other things that can impact ranking. Focus on a marketing strategy that will not only result in links, but also send new customers through those links and engage the customers into lifelong evangelists.A loss in traffic means you've been penalized The next two are focused on the issue of penalties. So many people are afraid of being penalized. I think this goes back to the days of black marks in your school record. That or people are worried about losing revenue. Maybe that. The media gets involved with SEO when there is a penalty and so that is what most people hear about. FTD and Overstock types of situations. Then disaster strikes and revenue falls unexpectedly. After some digging, they find that website traffic is down. This paired with emails business owners get at least once a quarter (in a good year) from fly by night SEO companies telling them they can help with SEO, promise the moon and warn of penalties. The only logical conclusion is a penalty! We have all seen it and most reputable agencies pipelines are filled with leads from companies in this exact situation. The thing is that we never know if there is a penalty unless we dive into the situation, but I have seen times where there is no penalty. Many things could have happened including: A developer added a noindex tag to a section of the site when meaning to add it to one page or they disallowed that section. The site was redesigned with URL changes that can drop the traffic coming into many sites if not done correctly. PPC traffic stopped due to a corporate card expiring and not being updated. Additional resource Guide to Common SEO Penalties and How to Recover From Them Alternate solution Rather than paying the first person that will call you back, first look into what part of the site lost traffic and where that traffic was coming from in the past few months. Did you lose traffic from organic search, paid search, referral traffic, or social media? Try to narrow down what happened and figure it out from there. If you're sure it was organic search, look into the date and ask your developers if anything changed about the site. If nothing did, check Google Webmaster Tools for any messages from Google about a penalty. If you're sure it's organic search and there are no messages, that's a good time to contact a reputable agency. Duplicate content can incur a penalty I did a talk on this very topic a few years back at Pubcon. So many people don't take the time to understand what duplicate content is and how to fix it. More importantly, there is a misunderstanding that duplicate content can cause or is a penalty. Most clients assume that having duplicate content will incur the \"search engine gods' \" wrath, and that just isn't true (for the most part; I mean, if your whole site is a copy of someone else's site ...). Duplicate content is a hindrance to site performance most of the time, but most likely not the cause for a substantial drop in traffic and definitely not a penalty from the search engines. Additional resource Google's Guidelines for Duplicate Content Alternate solution Don't fret. Take the time to visit Webmaster Tools regularly and check out your duplicated title tags and meta descriptions for an easy look into what might be causing duplicate content or crawling issues on your site. Maintenance is the best medicine!A call to educate We sometimes live in a bubble where we think people know everything we do and take for granted information like everything above. If someone asked you how to create a P&L Statement, could you? Maybe, maybe not, but you get what I mean. Take the time to answer questions, whether from clients or colleagues if you are in-house. You would be amazed how much more YOU can learn from teaching others. So what are your horror stories? Let me know in the comments below! Photo credits (all images are linked): Internet Open by Blaise Alleyne Hiding Cat by Aftab Uzzaman Penalty by Daniele Zanni Educate by Sean MacEntee Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Outdated SEO Concepts People Still Think are Reality"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Outdated SEO Concepts People Still Think are Reality"
    },
    {
      "level": "H3",
      "text": "Putting text behind an image"
    },
    {
      "level": "H4",
      "text": "Additional resource"
    },
    {
      "level": "H4",
      "text": "Alternate solution"
    },
    {
      "level": "H3",
      "text": "Copying a competitor's actions"
    },
    {
      "level": "H4",
      "text": "Additional resource"
    },
    {
      "level": "H4",
      "text": "Alternate solution"
    },
    {
      "level": "H3",
      "text": "Sheer number of links equals ranking"
    },
    {
      "level": "H4",
      "text": "Additional resource"
    },
    {
      "level": "H4",
      "text": "Alternate solution"
    },
    {
      "level": "H3",
      "text": "A loss in traffic means you've been penalized"
    },
    {
      "level": "H4",
      "text": "Additional resource"
    },
    {
      "level": "H4",
      "text": "Alternate solution"
    },
    {
      "level": "H3",
      "text": "Duplicate content can incur a penalty"
    },
    {
      "level": "H4",
      "text": "Additional resource"
    },
    {
      "level": "H4",
      "text": "Alternate solution"
    },
    {
      "level": "H2",
      "text": "A call to educate"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kate Morris\n          \n            Kate Morris\n          \n            Kate Morris"
}