{
  "url": "https://moz.com/blog/seo-for-journalists-linking-out-part-3-of-5",
  "slug": "seo-for-journalists-linking-out-part-3-of-5",
  "title": "SEO For Journalists: Linking Out (Part 3 of 5) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Sir Tim Berners Lee, the man who invented the World Wide Web, once said of writing online without offering links to other related content that it:    [is] like speaking but with a paper bag over your head...",
  "content": "SEO For Journalists: Linking Out (Part 3 of 5) Content Marketing C By: Ciaran Norris April 19, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! C By: Ciaran Norris April 19, 2007 SEO For Journalists: Linking Out (Part 3 of 5) Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Sir Tim Berners Lee, the man who invented the World Wide Web, once said of writing online without offering links to other related content that it: [is] like speaking but with a paper bag over your head So if the guy who invented the medium on which we now find ourselves writing a great deal of our content for thinks that linking is essential, we should probably pay attention. Here are a few reasons why…. Users expect to be able to follow links from a story for more information – the rise in blogs, and the way that this has affected online journalism, means that to many people, a story without links looks incomplete. If we can provide a user with all the information on a topic or issue, both in the article and by linking out to other relevant sources, we make it more likely that our article or site will be selected as the most relevant by the search engines With the archives of RBI sites (such as Computer Weekly), journalists should always be able to link to at least one of their own stories – if what they’re writing is a follow up to something that happened last week, link to last week’s story And links into a webpage or site have a very positive impact on search engine rankings – so this means that linking out of one of your stories to another means that both benefit But we mustn’t be scared to link out to external web pages too – if they’re on the same topic, and will add benefit to the user, then do it! Linking out to external websites & blogs is a great way to ‘get on their radar’: by sending a bit of traffic to an influential blog, we make it much more likely that they will link back. And it’s a much better way of getting a link than bombarding someone with emails. The words you use in your link to another relevant page help the engines decide whether your page is relevant to the searcher’s query. So don’t let them think you’re writing about click here; use your keywords in your links. It allows you to save time & aggregate content via links, whilst spending more time on your specialty of giving expert analysis You’re expecting a 10th, aren’t you? Have a look at this instead to get an idea of what the next article will be about Note: This article was originally written as part of a training programme for the journalists at UK B2B publisher Reed Business Information. Ciarán Norris is now the SEO Director at UK search marketing agency eyefall. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO For Journalists: Linking Out (Part 3 of 5)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO For Journalists: Linking Out (Part 3 of 5)"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ciaran Norris\n          \n            Ciaran Norris"
}