{
  "url": "https://moz.com/blog/seo-basics-choosing-the-right-seo-company",
  "slug": "seo-basics-choosing-the-right-seo-company",
  "title": "SEO Basics: Choosing the right SEO Company - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This video is about choosing the right SEO Company to do the job, and do the job well.\nI still think this industry is in a sorry state of affairs especially here in the UK and I believe it’s down to two things; 1) broken promises and 2) not being realistic with potential customers.\n95% of calls and…",
  "content": "SEO Basics: Choosing the right SEO Company SEO Events By: Jen Wiss-Carline May 12, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Jen Wiss-Carline May 12, 2010 SEO Basics: Choosing the right SEO Company SEO Events This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. This video is about choosing the right SEO Company to do the job, and do the job well. I still think this industry is in a sorry state of affairs especially here in the UK and I believe it’s down to two things; 1) broken promises and 2) not being realistic with potential customers. 95% of calls and emails we get here at Angel SEO are customers that have been with other SEO companies and have been left disappointed or disgruntled (on one occasion I had a business owner crying!). For me it’s not about winning business, it’s about helping others and educating people about the industry and SEO (something which SEOmoz does an excellent job of). Anything else after that is a bonus! Anyway, have a watch of the video, its really simple and short (unfortunately it’s not up to Rand’s quality presenting but we’ll get there soon). And hopefully even if it helps just one person chooses the right SEO Company for there business, that’s good news all round. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Basics: Choosing the right SEO Company"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO Basics: Choosing the right SEO Company"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jen Wiss-Carline\n          \n            Jen Wiss-Carline"
}