{
  "url": "https://moz.com/blog/seo-day-to-day-work-whiteboard-friday",
  "slug": "seo-day-to-day-work-whiteboard-friday",
  "title": "What Does an SEO Do In Their Day-to-Day Work - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There's far more to SEO than an initial audit and fix for a site. In today's Whiteboard Friday, Rand offers a window into the ongoing day-to-day work of keeping a site in optimal shape in the eyes of the search engines.",
  "content": "What Does an SEO Do In Their Day-to-Day Work SEO Basics | Whiteboard Friday By: Rand Fishkin March 27, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 27, 2015 What Does an SEO Do In Their Day-to-Day Work SEO Basics | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. There's a common misconception that SEO is a \"one and done\" task -- that you clean up and optimize a site, and once that's done, you can focus your efforts elsewhere. There's so much more to the day-to-day work of an SEO, though, and in today's Whiteboard Friday, Rand walks us through those ongoing parts of the job. For reference, here's a still of this week's whiteboard! Video Transcription Howdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week I want to tackle a question I get sometimes about the day-to-day activities of an SEO and what should you do after you've completed that first site audit, sort of fixed the problems, what does the day-to-day work look like? A lot of SEOs, especially those coming from consulting backgrounds or who've joined companies as in-house SEOs who've had kind of this big project based SEO work to do, find themselves struggling after that's done. Typically, that process is pretty straightforward. You kind of do an audit. You look at all the things on the site. You figure out what's wrong, what's missing, where are opportunities that we could execute on. Maybe you do some competitive analysis, some market analysis. You identify those fixes. You work with teams to make those changes, validate the results have been completed, and then you're sort of in this, \"Well, do I go back and audit again and try to iterate and improve again?\" That doesn't feel quite right, but it also doesn't necessarily feel quite right to go to the very, very old-school SEO model of like, \"All right, we've got these keywords we're trying to rank for. Let's optimize our content, get some links, check our rankings for them, and then try to rinse and repeat and keep improving.\" This model's pretty broken I'd say and just not reflective of the reality of opportunities that are in SEO or the reality of the tactics that work today. So the way that I like to think about this is the SEO audit, an SEO focused audit -- which is trying to say, \"What traffic could we get? What's missing? What's broken and wrong?\" -- only works at the low level and the very tactical trenches of a marketing process or a business process. What you really need to do is you want to be more incrementally based, but you need to be informed by and you need to be evolving your tactics and your work based on what is the business need right now. So this process is about saying, \"What are the top level company and marketing goals overall? For everyone in the company, what are we trying to accomplish this year, this quarter, the next three year plan? What are we trying to achieve?\" Then figure out areas where SEO can best contribute to that work, and then from there you're creating tactical lists of projects that maybe you're going to positively move the right needles, the ones that you've identified, and then you're going to evaluate and prioritize which ones you want to implement first, second, and third in what order, and test implement those. So, hey we've figured out that we think that a new blog section for this particular piece of content, or we think that getting some user generated content, building up some community around this section would be terrific, or we think outreach to these kinds of publications or building up our social stats in these worlds will expose us to the right people who can earn us the amplification we'll need to rank better, etc., etc. Okay, this is a fine process, and you're going to want to do this, I would say, at least annually and maybe even think about it quarterly. All this work is essentially centered on a customer profile universe, a universe of people. I've got my person X, Y, and Z here, but your customer universe may involve many different personas. It may involve just one type of person you're targeting that you're always trying to reach over and over again, but it probably involves also the people who influence that direct subsection of your market. From there, you can take the, \"Hey, you know what, person Z is really interested in and consumes and searches for these types of content topics and these kinds of keywords, so we're going to start by taking keyword set A or content set A and figure out our keyword list and our content list. We're going to create, launch, and promote work that supports that.\" It could be content pieces, could be video, could be some combination of those things in social media, all forms of content. It could be tools, whatever you want, an application. We're going to launch that, promote it, and then work on some amplification, and then we're going to measure and learn, which is a critical part of that process. I want to not only see what are my results, but what can I learn from what we just did and hopefully I'll get better and better at iterating on this process. This process will work iteratively, kind of similar to our broken process over here or to our site audit process there. It will work iteratively, and then every now and then you should pop back up and go, \"Hey, you know what, I feel like we've exhausted the easiest 80% of value that we're going to get from 20% of the work on keyword set A. Let's move on and go visit keyword set B now, and then let's go visit content set C.\" Occasionally, you're even going to want to move one step up and say, \"Hey, you know what, maybe our personas or our market is changing a little bit. We want to try targeting some new customers. We're going to look at these folks over here or this guy over here and see if we can reach them and their influencers with new kinds of content and topics and keywords, and that sort of thing.\" If your site is rocking and rolling, if you've completed your audit, things are just smooth sailing, then this kind of a process is going to work much better, so long as it's tied to real business objectives. Then when you achieve results here, you can point back to, \"Hey, remember I told you these are the areas SEO can contribute to our overall goals, and now I can connect these up directly. The metrics that I get from all this SEO stuff can tie directly to those areas, can tie directly to the business goals.\" Everyone from the CEO on down is going to love what you're doing for the company. All right everyone, I hope you'll join me again next week for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What Does an SEO Do In Their Day-to-Day Work"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What Does an SEO Do In Their Day-to-Day Work"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}