{
  "url": "https://moz.com/blog/seo-reports-next-level",
  "slug": "seo-reports-next-level",
  "title": "How to Create SEO Reports - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "[SEO Reports] Learn how to do SEO reporting for clients. Monthly SEO reports are easy when you understand the basics. Learn the right way to approach creating SEO reports for clients.",
  "content": "Presenting Your Findings: How to Create Relevant and Engaging SEO Reports - Next Level SEO Reporting | Moz Tools | SEO Basics By: Meghan Pahinui March 27, 2018 Table of Contents Copied! By: Meghan Pahinui March 27, 2018 Presenting Your Findings: How to Create Relevant and Engaging SEO Reports - Next Level SEO Reporting | Moz Tools | SEO Basics Welcome to the newest installment of our educational Next Level series! Our last episodes covered how to transform low-value content and how to track the right keywords for your local business. Today, Meghan is here to share all the juicy details to include in a truly persuasive SEO report for your clients and how you can create your own with Moz Pro. Read on and level up! When it comes to creating useful SEO reports for clients and members of your team, it can be tough to balance the best, most relevant information to include with what they actually want to see. Essentially, you should show your clients that what you’re doing is working and getting results that positively impact their business. That being said, though, you’ll need to ask yourself what they consider progress: Are they trying to generate more traffic to their site? Increase overall sales? Improve their rankings? Are they hoping to start ranking for a specific set of keywords or break into a new market which will provide more revenue? Regardless of their specific business goal, you’ll need to create reports which are concise, straightforward, and easy to digest to remind your clients why they're investing in SEO and your services. If a report is too long, your client may lose interest. If a report is too short or doesn’t include the data they find most relevant, they may wonder what the heck they're paying for! I like to think about creating SEO reports as if I’m writing up an experiment: I have an objective or problem that I’m trying to solve, a hypothesis about what will get me to that goal and solve my problem, and a procedure to follow, all of which leads to observations that will help me benchmark my progress and set up a new goal. In this installation of Next Level, we’ll talk about what information you should include in your SEO reports and show you what modules you can add to your Custom Report in Moz Pro to illustrate that data. If you don't have Moz Pro but want to try out Custom Reports, you can check them out in a month-long free trial: Grab my free trial now 1. Determine your objective What's the current SEO goal and how does it align with your client’s business objectives? The first step in any endeavor is determining what you’re setting out to achieve. You’ll want to make sure to outline your current SEO goals clearly for your client. For example, your goal may be to increase rankings for select keywords, to increase overall Search Visibility, or to generate more inbound links. Perhaps even more importantly, you’ll want to explain how these SEO goals will impact your client’s business overall. Include tangible business objectives, such as “increase monthly revenue” or “drive more traffic to your online shop,” but don’t forget to explain why you’ve chosen these as your objectives. Simply telling a client that you’re planning to work on increasing their keyword rankings won’t help them to understand why that’s important. By outlining what you’re working towards and why, you'll not only give direction to your report but also set your client’s expectations. 2. Form your hypothesis Where should your efforts be focused to meet this goal? How you plan to accomplish your client’s business goals through SEO is something that you’ll definitely want to think about when putting your SEO report together. What do you think needs to happen in order to make sure your client’s expectations and business goals are met? For example, if your client wants to increase the overall organic search traffic that comes to their site, you'll want to focus on improving their keyword rankings. “Okay, but how are you going to do that?” asks your client. Here’s where you can outline your plan of attack and what you think will have the most impact, like making sure that all pages have meta descriptions that are the right length, or that all pages have title tags. Asking yourself these types of “how” questions in advance will set you up for success when you go to create your report. A clear idea of your procedure — your way forward — will make sure the most relevant information is included and doesn’t get lost among a bunch of data irrelevant to your current goal. Taking the time early on to outline your next steps will help you stay on track and create concise, easy-to-digest reports. SEO can be confusing, which is probably why your client hired you! Make sure you explain what you’re planning to do, how you plan to do it, and why. This will keep your client from feeling out of the loop and asking themselves questions like “What am I looking at? Is this really helping me?” A transparent, informative explanation can be as simple as this: “I’m working on making sure all your pages have relevant meta descriptions so searchers are better able to determine if your site is what they’re looking for in SERPs. This will help improve your overall click-through rate, which should help increase traffic to your site.” If you can weave your goals directly into the explanation of what you're doing and how, all the better! 3. Outline your procedure What have you already done to work towards meeting this goal? Time to show off what you’ve completed so far! Here, you'll include SEO goals you’ve already achieved, like fixed missing descriptions, resolved issues with 404 pages on the site, pages which have been optimized for target keywords, etc. People like to see evidence that their investments are paying off, so take care to remind your client what they're paying you to do, and create a detailed report to show just how effective you’ve been already. The Moz Pro Custom Report tool comes in handy for this type of reporting, as well as the “Observations” portion we’ll talk about in just a bit. You can use the handy visuals in Custom Reports modules to illustrate what you’ve been working on and outline what you plan to attack next. 4. Record your observations The “Observations” portion of your report is your place to show real, tangible data to your client. You’ve outlined what you’re doing to help them achieve their current SEO goal, and now it’s time to show them the results of your labor. Keyword performance The idea here is pretty straightforward: show your client which of their keywords have improved in the rankings, and how their Search Visibility has changed since the last report. For transparency, you may also want to include some info about the keywords that didn’t do as well — now would be a good time to tell your client how you plan to tackle those low-performing keywords! You may also want to display how your client is ranking compared to their main competitors and call out specific instances of improvement. Here's an example: “Although the rank dropped for 5 of your target keywords, your overall Search Visibility is up by 7%, and you’re ranking higher than your competitors for all 5 of those keywords.” It's important to keep your client’s expectations grounded by reminding them that fluctuation in keyword rankings from week to week is pretty normal, and comparing rankings over a longer period of time is often more representative of true performance. Page optimization A great way to add in more detail about keyword rankings to your Custom Report is with Page Optimization modules. The Page Optimization tool allows you to pair a specific page on the site you’re tracking with a target keyword to see a report of how well-optimized that page is for that keyword. This is especially useful if your client has a specific set of keywords they need to be ranking for. The Page Optimization tool makes suggestions as to what you can do to improve your chances of ranking, and will show you what you’re already doing that’s helping your client rank where they are now! When you add Page Optimization modules to your report, they can illustrate not only improvements you’ve made to certain pages and how rankings have changed for those keyword/URL pairs, but they can also highlight pages you’re not already working on that may be good opportunities for optimization. Inbound traffic Showing your client that more people are heading to their site is a straightforward way to show off the progress you’ve made. If you can, be sure to point out where you think the increase in traffic is coming from, whether it’s from higher keyword rankings, new backlink generation, or other factors related to the work you've done. Link generation If one of your goals is to generate more backlinks for your client, you’ll want to show them what you’ve accomplished. Be honest about the types of links you’re looking to acquire. For example, if you’re interested in quality over quantity and are focusing your efforts on acquiring links from sites with high MozRank and MozTrust, make sure you let your client know that, and explain what effect it could have on their backlink profile. Will your strategy earn them more links overall, or higher quality links — and which is better for their business? Explain why your goal is the best plan of attack for achieving their overall business goals. Site crawl Adding in Site Crawl modules to your Custom Report can effectively illustrate what you’ve been working on with regards to your client’s site specifically. For example, if you’ve focused on redirecting 404 pages to live, active pages, you could show them a graph illustrating the decrease over time in pages returning this type of error. Perhaps you have been working on cleaning up redirect chains, reviewing meta noindex tags, or editing pages with thin content. All of these things can be outlined so you can demonstrate your progress in your Custom Report using Site Crawl modules. You can also use these modules to show your client how their site has improved — e.g., by showing them a steady number of pages crawled each week alongside declining rates of on-site issues like 404 pages and thin content — and highlight areas of their site you think may still need some work. 5. Draw your conclusions What’s next? Once you’ve laid out what you’re working on, why, and how it’s impacting your client’s business so far, you’ll want to outline what they can expect to see next. Let them know what your next course of action is and what you think is working (or not working) so they can be prepared for your next report. If you’re planning to work on optimizing pages for keywords that aren’t ranking currently, or if you’re planning to go after some link-building opportunities, make sure they're aware! Perform a final review Finally, before sending your brand-new report out to your client, make sure to review it one last time to confirm that it’s telling the right story. Does it properly illustrate what you’re working on and how that's positively impacting their overall business goals? Does it use language which is easy to understand and that your client will care about? Not everyone is an SEO wiz, so it’s important to make sure the report you’re presenting is easily comprehended. For example, if you’ve illustrated that their overall search visibility has gone up, will they understand that jargon and what it means? If not, have you made sure to explain what it is and why it’s important? Try to view the report from your client’s point of view and see if you’re able to find the true value in the data you’re presenting. Taking this extra step can really help solidify your report and make sure it’s the best representation of your work. Schedule your report to auto-send Within the Custom Reports section of Moz Pro, you can set up your shiny new report to be emailed weekly or monthly to help keep your clients up-to-date on how things are going. You can also choose to email the report directly to anyone who might have a stake in seeing the results of your SEO efforts, such as colleagues or stakeholders. The most important thing is to make sure your clients know what they are paying for! They want to see tangible results that are applicable to their business specifically. A well-crafted, intentional SEO report will both make your job easier and help your client rest easy knowing their investment is paying off. If you’re ready to dive in and start creating your own shiny new Custom Report, be sure to sign up for a 30-day free trial of Moz Pro: Start your free month now! If you find you need more help getting started with your own report, be sure to check out our page all about Custom Reports on the Help Hub. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Presenting Your Findings: How to Create Relevant and Engaging SEO Reports - Next Level"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Presenting Your Findings: How to Create Relevant and Engaging SEO Reports - Next Level"
    },
    {
      "level": "H2",
      "text": "1. Determine your objective"
    },
    {
      "level": "H3",
      "text": "What's the current SEO goal and how does it align with your client’s business objectives?"
    },
    {
      "level": "H2",
      "text": "2. Form your hypothesis"
    },
    {
      "level": "H4",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Where should your efforts be focused to meet this goal?"
    },
    {
      "level": "H2",
      "text": "3. Outline your procedure"
    },
    {
      "level": "H4",
      "text": ""
    },
    {
      "level": "H3",
      "text": "What have you already done to work towards meeting this goal?"
    },
    {
      "level": "H2",
      "text": "4. Record your observations"
    },
    {
      "level": "H4",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Keyword performance"
    },
    {
      "level": "H3",
      "text": "Page optimization"
    },
    {
      "level": "H3",
      "text": "Inbound traffic"
    },
    {
      "level": "H3",
      "text": "Link generation"
    },
    {
      "level": "H3",
      "text": "Site crawl"
    },
    {
      "level": "H2",
      "text": "5. Draw your conclusions"
    },
    {
      "level": "H3",
      "text": "What’s next?"
    },
    {
      "level": "H3",
      "text": "Perform a final review"
    },
    {
      "level": "H3",
      "text": "Schedule your report to auto-send"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Value of SEO Beyond Traffic and Leads — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Ensure a Flawless GA4 Setup and Ongoing Tracking Functionality"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Meghan Pahinui\n          \n            Meghan Pahinui\n          \n            Meghan Pahinui"
}