{
  "url": "https://moz.com/blog/seo-101-for-travel-bloggers",
  "slug": "seo-101-for-travel-bloggers",
  "title": "SEO 101 for Travel Bloggers - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Several weekends ago, for the first time, I accompanied my wife, Geraldine (aka Everywhereist, whose blog was just placed on Time.com's Top 25 Blogs of 2011 and then on Forbes' Top 10 Lifestyle Sites; woo hoo!), to Vancouver, BC for a professional conference focused on her career rather than mine…",
  "content": "SEO 101 for Travel Bloggers Content Marketing By: Rand Fishkin July 5, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 5, 2011 SEO 101 for Travel Bloggers Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Several weekends ago, for the first time, I accompanied my wife, Geraldine (aka Everywhereist, whose blog was just placed on Time.com's Top 25 Blogs of 2011 and then on Forbes' Top 10 Lifestyle Sites; woo hoo!), to Vancouver, BC for a professional conference focused on her career rather than mine (TBEX - the Travel Bloggers Exchange). Given that she's attended countless sessions on SEO, analytics, tech startups and scalable SaaS models, I figured it was the least I could do. I only attended a few sessions, but one of the most crowded and exciting (for me) was a discussion on SEO run by Jennifer Miner of Vacation Gals (pictured above). I was amazed by the large percentage of the attendees who chose the SEO session over several others that sounded quite tempting and could only conclude that SEO was, indeed, of interest and importance to these tech-savvy travel writers. Honestly, Jen rocked it. She didn't have slides, but she gave a genuine, heartwarming and information-packed session. For me, it was a wonderful opportunity to empathize with her audience and remember what it's like to look at the SEO world with a mixture of fear, awe and confusion, and I want to pay it forward by sharing my advice and experience with SEO, specifically geared to travel bloggers (though possibly of interest to lots of others relatively new to the field). SEO 101 for Travel Bloggers: Topics Setting Up Your Site for Success What's a Keyword? And Why Do I Need to Worry About Them? I Don't Want to Write for SEO; I Want to Write Great Stories! What's the Deal with Links? Are Twitter, Facebook and All the Social Stuff Worthwhile? Setting Up Your Site for Success One of the first choices you have as a blogger is where to start writing. There are lots of options, but nearly everyone agrees that if you want to take your blog seriously, you should follow a process like this: Get your own domain name through a certified registrar. I like Dreamhost or BulkRegister personally (just $11/year for .com domains), but there's loads of good options. Host the site yourself. Folks like Dreamhost, Page.ly, Squarespace and Laughing Squid are worth checking out. One I've not tried, but heard amazing things about is WP Engine. They'd probably get my vote if you've got the $49/month to spend and are more serious about your blog's growth. Get a great designer or learn to make something beautiful yourself. Good places to find designers include Dribbble, Forrst, Sortfolio, ElegantThemes, ThemeForest and 99Designs (Note: there's some controversy in the design community about the crowdsourced model of 99 Designs, but you should make up your own mind). Choose a blog platform (aka the software that powers your blog). Wordpress, Posterous and Tumblr are all worth looking into - if you're a bit more adventurous, B2Evolution is interesting, too. I wouldn't choose Blogger/Blogspot for a variety of reasons too lengthy to go into here. Alternatively, you could setup a site in 3 minutes flat on a subdomain of Wordpress (e.g. mytravelblog.wordpress.com), choose an pre-existing theme, don't customize the design/look and just start writing. But, that minimal effort also costs you many of the benefits - flexibility, the possibility to grow, optimization potential, monetization opportunities, etc - that come with a little more elbow grease. If travel blogging is something you want to do not only as a personal endeavor, but as a professional one as well (whether you hope to eventually have ads, make money, or you simply wish to move beyond a hobby-site that is technically owned by another company), you'll need your own domain. That may sound a bit daunting, but all of the above can be done in less than a day, even if you're completely non-technical. If you're feeling overwhelmed, Page.ly might be the easiest of the bunch to handle 90%+ of this. From here, you just need one more critical thing - analytics (aka a way to measure how much traffic you get, where it comes from and what people do on your site). Fortunately, there's an easy answer: Google Analytics. It's free, it's simple to install (one-click or plugin with most of the blog platforms I noted above) and it works wonderfully. If you're looking to get much more serious about tracking + improving everything around your site, read this post - Launching a New Website: 18 Steps to Successful Metrics + Marketing. What's a Keyword? And Why Do I Need to Worry About Them? When people go to Google, they search for things. As of June 2011, more than 3 billion searches happen every day on Google (and lots happen on Bing + Yahoo!, too). A good portion of those people are searching for information about travel, and if you build your site right and do a bit of what SEOs call \"keyword research\" (figuring out what people search for and how) along with \"keyword targeting\" (using those words and phrases in smart places on your pages), you can earn positions in the search rankings and get lots of high quality, valuable visitors coming to your site. For example, in the search I've done above, you can see that Geraldine's post - The Shops of Covent Garden, London - is ranking in position 5. On average, about 5% of searchers for that query will likely click on her page. If there's 100 searches for that phrase each month, Geraldine will get 5 extra visits to her site every month. If she wrote 5 blog posts every day that performed like this, in a few years she'd have some pretty amazing traffic. And, of course, if she got to ranking #1 or #2 for some of those keywords or ranked #5 for things people search for 1,000 times each month, that could be even more exciting. In the SEO world, we call the search words and phrases that people type into Google and Bing \"keywords,\" and we do our best to understand what people are searching for, build great pages that would make those searchers happy and try to rank high in the results to earn as many of those clicks as possible. The first part of that - understanding what people are searching for, is the critical part of \"keyword research.\" Here's how you do that: (sadly, this isn't the best example, because there's so few searches for the phrase, but you get the idea) The screenshot above comes from Google's AdWords Keyword Tool. It's the best known keyword research tool on the web, and is likely the only one you'll need as a travel blogger unless you become very advanced at SEO. There's a few important things to understand about the tool, so I've made some notations with red numbers: This is where you enter the words to describe what you're writing about. You can use one or two words or try to be more specific. The words Google suggests will be based on what you enter here. For travel bloggers, I generally would recommend that you use the language you'll be writing in, but don't exclude any countries. Travelers search from all over the world! Don't just limit your keyword research to the United States. This is very important, even if it seems a bit complex at first. The \"match type\" refers to the suggestions Google will give you, and if you're not careful, this can really throw you for a loop. Basically, \"exact match\" is what you want most of the time (but it's not checked by default, so be sure to do that!). Exact match means that Google will only show you the keywords and search volume for that particular keyword phrase. If you use broad match or phrase match, you'll often see a much higher volume of searches, but it doesn't mean that this quantity of people actually performed that search. You can learn more about match types here. Here's your data! Looking at these keyword \"suggestions\" you can see what Google knows about that people search for around these keywords and how many people are performing those searches globally. The \"competition\" column doesn't matter too much for you here - it refers to the number of advertisers who bid against a keyword and how much they pay, but since you'll be targeting the \"free\" or \"organic\" searches, you don't need to worry about these. Google will also give some keyword \"ideas\" that relate to your search terms, but don't match them exactly. This can be handy for finding opportunities of things to write about or what to title your posts. When it comes to the AdWords Keyword Tool, I recommend you play around with it - experiment, have fun, see what different clicks and buttons do, the works! Just remember - the numbers Google reports are, relatively speaking, accurate, but not precise. So, if Google says that keyword 1 has 100 searches/month and keyword 2 has 200/month, that doesn't mean that precisely that many people search each month for those words. But, it does probably mean that keyword 2 gets about twice as many searches as keyword 1. OK. You know how to see what people search for and now you're ready to start writing some posts to earn some of those rankings and get some visitors. But, what do you actually do with those keywords? Use them smartly in your blog posts! I've got an entire post dedicated to best practices for using keywords in your pages, but the simple rule of thumb is: Make the important keyword phrase the first words in your blog post's title (if possible) Use other relevant, important and/or identifying keywords in the title (for example, Geraldine's post on this topic was wisely labeled, The Shops of Covent Garden, London - both to indicate its location and because people might search for \"covent garden shops, london\") Make the headline of the piece/page match the title (searchers don't like to click on one thing and get another!) Use the keyword phrase and other important keywords in the content of the post - don't stuff or spam them in unnaturally, just try to include them where relevant and appropriate If you can, make your URLs (this thing - http://www.everywhereist.com/the-shops-of-covent-garden-london/) use the keyword as well. This is pretty easy to do in Wordpress and most other blog platforms That's it! That's really all you need to do on the keyword front. If you need it in once sentence, it's this: Find the words and phrases people use to search and include them prominently in the blog posts you write. If you've done that, you're well on your way to good SEO. I Don't Want to Write for SEO; I Want to Write Great Stories! You should! SEO, done right, should never interfere with great writing. In fact, hopefully, it can help, by giving you a spark of imagination or inspiration about what readers want, how they think and where the core of their quest to discover new things begins. I've heard some SEOs and even some travel bloggers tell others that writing for SEO is different than writing for an audience. They'll say you need to stuff keywords in and write \"on-topic\" rather than rambling off on tangents and telling funny anecdotes. I disagree. Great writing and great content of all kinds is at the heart of great SEO. I'll illustrate: The same things that make for \"great\" writing and a \"great\" blog are the things that will propel you to success in the SEO world. Perhaps the only ingredients you wouldn't normally be aware of as a fantastic writer are the ideas of keyword research and an accessible site (which we covered above). That said, there are a couple issues to think about when it comes to travel writing, blogs and SEO. The first is how to make SEO work with narrative vs. non-narrative writing. For this, I'll use Geraldine's blog again as a good example, since her work is primarily narrative - it tells a story - rather than non-narrative like a travel guide to a specific location. The post (An SF Experiment: Leaving My Bag Behind) isn't particularly good for SEO. And THAT'S OK! Not every post needs to be carefully targeted toward perfect keywords in an effort to drive additional traffic. If you can do it with 2/3 or even 1/3 blog posts, that's terrific. And it's pretty much how Geraldine does it, too (though I only recently convinced her to even try keyword research at all). This post (New York's Eataly Market, Reviewed), although it does technically review the market, goes off on long tangents, includes humorous anecdotes and generally has a fun time with the subject matter. It's not a list of recommendations or an expository, tightly written review with facts and data - it's a narrative review. And yet... You most certainly CAN use a narrative voice and still rank quite well, even for fairly competitive searches. The second issue is a thorny one - how to deal with \"Evergreen\" vs. \"Temporal\" content. Evergreen content is stuff that doesn't go stale (or at least, that you don't want to go stale). It's intended to be relevant for years, maybe even decades. Think Hemingway on Spain or Bill Bryson on Britain. Temporal content, on the other hand, is best when it's just released and gets less useful over time (e.g. most technology news reporting is this way). When you're blogging, posts naturally have a date/timestamp of when they're released. After that, they begin to go stale and readers looking at a post on a particular restaurant, tourist location or even a city may wonder how much is still relevant 6 months or years later. This is a good reason to consider, potentially, creating \"pages\" or \"articles\" or \"guides\" that live on as evergreen content and sit separately from your main blog. For example, Karen Brown's Italy Travel Guide is an evergreen resource while the Vacation Gals' Best Romantic Honeymoon Destinations page is temporal... But, it could be evergreen if they changed it from a blog post to a standalone page and updated it annually (and then changed the title to include the year, e.g. Best Romantic Honeymoon Destinations 2011). What's the Deal with Links? Search engines don't just rely on the text content and keywords you put in your pages (although, back in the mid-late 1990's they used to). They also care about what other people say about you. Hence, they look at all the sites and pages on the Internet to see who might be linking to your site and your individual posts. A blog with lots of other sites linking to it is likely to be considered more important and more worthy of ranking well than a blog few others have recognized and referenced. For this reason, earning good links from other good sites is a critical part of SEO - but, of course, it's not just good for SEO, it's great for your traffic, growing your brand and building awareness amongst non-readers. There's a few key concepts to understand about links that I'll walk through. The first of these is something called \"anchor text.\" It refers to the words/phrases that web pages use when linking to one another. For example, if I link to this photo of a sunset with an ant holding a twig, I've just helped to tell Google + Bing what the photo on that page is about. It's now more likely that if someone searches for \"sunset with ant and twig,\" that page might appear in the results. It would, of course, be much better if the page also had text on it that the engines could read, but that's not the point here. I'm merely trying to illustrate that how we link - in particular, the words we use in links, matters for search engines, so we should think carefully about them. The big takeaway for most travel bloggers is that getting links that include words describing your post are often better than links that just have your blog's name or say something generic like \"click here.\" There's also an issue that came up quite a lot at the TBEX conference around \"homepage vs. deep links.\" I think there might be some misconceptions here, so I'll try to illustrate what this means: The link to the \"home page\" is certainly a good thing, and travel bloggers shouldn't be worried if their homepages earn lots of links. Often, the vast majority of a site's links will point to this page, and that's fine. However, it can be quite valuable to earn \"deep links\" like the one to the \"Driving in Manhattan\" post above. These links help pass good signals about individual pages, as well as the site, to the search engines. One isn't necessarily \"better\" though deep links are often less common and therefore more prized. But, it really depends on the quality of the linking source (is it a good site?) and whether it's doing other good things like sending traffic and good anchor text. Finally, let's talk about \"Followed\" vs. \"Nofollowed\" links: The basic concept is that some links exist on the web that search engines don't want to trust (especially spam in comments, forums or other open areas of websites). There's a special tag called rel=\"nofollow\" that can be applied to the HTML code of any link to make search engines ignore it for ranking purposes. I highly recommend you use this in your blog's comments (or they can be overrun by spam that might even make Google/Bing frown on you). By default, most blogging platforms already do. Oh! And last, but not least, if you're looking for some great ideas around building links, check out the link building category on this blog, and read the Beginner's Guide to SEO section on Link Building as well as Yoast.com's Link Building 101. Are Twitter, Facebook and All the Social Stuff Worthwhile? Almost certainly and almost always, the answer is \"yes!\" Classifying exactly how and precisely how much is a more challenging question, but search engines like Google and Bing do access some forms of data from Twitter, Facebook, LinkedIn and Google's new Google+ (to be honest, Google doesn't use too much directly from Facebook and Bing probably isn't using much from Google+, but you get the idea). Sharing links on Twitter may have a direct positive impact, and an indirect one, too. But, even if/when the search engines aren't directly taking signals from Twitter, Facebook, LinkedIn, Google+, etc. these networks are helping to spread the word about your site and your content. Using them to promote your posts in organic, natural, useful ways is a great thing, and you should almost certainly invest some effort trying out these networks and discovering whether your blog is a fit. Twitter in particular has been a huge driver of traffic for Geraldine's blog, so I suspect there's value there for many other travel blogs. Facebook has been good, too. LinkedIn, less so, but this is likely because it's geared toward a business + career focused audience. If your site caters to business travelers, you could well have a great match there. I know I'm biased due to my marriage, but I also love to travel, meet new people and read great expository and narrative writing (both of which I'm terrible at). I hope this post can help some aspiring travel bloggers to grow their audiences and bring more visits to the amazing world of travel writing. If you have questions, feel free to post them in the comments below and I'll do my best to help out! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO 101 for Travel Bloggers"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO 101 for Travel Bloggers"
    },
    {
      "level": "H2",
      "text": "SEO 101 for Travel Bloggers: Topics"
    },
    {
      "level": "H2",
      "text": "Setting Up Your Site for Success"
    },
    {
      "level": "H2",
      "text": "What's a Keyword? And Why Do I Need to Worry About Them?"
    },
    {
      "level": "H2",
      "text": "I Don't Want to Write for SEO; I Want to Write Great Stories!"
    },
    {
      "level": "H2",
      "text": "What's the Deal with Links?"
    },
    {
      "level": "H2",
      "text": "Are Twitter, Facebook and All the Social Stuff Worthwhile?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}