{
  "url": "https://moz.com/blog/seo-site-audits-getting-started",
  "slug": "seo-site-audits-getting-started",
  "title": "SEO Site Audits: Getting Started - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A typical SEO site audit takes me around 50 hours to complete. If it is a small site (<1000 pages), I am working efficiently, and the client hasn't requested a lot of extra pieces, this estimate can come in as low as 35 hours. If the site is large and has a lot of issues to document, the time…",
  "content": "SEO Site Audits: Getting Started SEO Basics By: Lindsay Wassell June 2, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Lindsay Wassell June 2, 2010 SEO Site Audits: Getting Started SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Editors Note: We've created an entire updated audit for SEOs, and it includes a free downloadable template. Download Moz's new Technical SEO Site Audit Checklist. A typical SEO site audit takes me around 50 hours to complete. If it is a small site (<1000 pages), I am working efficiently, and the client hasn't requested a lot of extra pieces, this figure can come in as low as 35 hours. If the site is large and has a lot of issues to document, the time investment inches closer to 70 hours. At SEOmoz, we usually asked for a project time-line of six weeks to complete a full site audit. You need the extended schedule for resource coordination, editing for uniform voice and additional considerations when a team is involved. Even working on my own I prefer a six week time-line because it allows me to juggle several projects simultaneously and to put-down and pick-up various pieces as the mood strikes. Regardless of how much time I spend on an audit, the best stuff is usually revealed in the first day. At the beginning of a project you're excited, the client is excited and there is so much undiscovered opportunity! In this post, I'll outline my recommendations for making the most of day one on a new SEO audit project. I've organized it by retro digital clock time stamp for your visual pleasure. Template Preparation You have a 9:00 client call, so you better get cracking! Take the time upfront to get your documents ready. The first thing I do once I've received a signature on the dotted line is prepare two files; my Excel scorecard and the Word audit document. The audits I've worked on have always been extremely custom. Even so, the base document without client content is around 20 pages. This may sound like a lot, but once you prepare a cover sheet, table of contents, the appropriate headings and sub-headings for all the important SEO factors, and short (reusable) descriptions about each factor... it adds up to a hearty file. I recommend that you create the base Word and Excel files and save them. Try not to work backwards off of an existing audit that you have on hand. Before I was an SEO myself, I was an SEO client of several smart folks. More than once the deliverables I received included other client names. It happens! 'CTRL+F' is not fool proof. The Client Call Whether you closed the deal yourself or you are lucky enough to have a fleet of salespeople doing that type of leg-work for you, a client kick-off call once the deal has been signed is important. Spend an hour getting to know your primary contacts. Hopefully this includes a senior stakeholder, a marketing lead, and a development lead. More often then not, these meetings are over the phone with the assitance of a web conferencing tool like GoToMeeting. A sample agenda is as follows; Introductions (all) Site Tour (client) Past & Present SEO Initiatives (client) Key Areas of Concern (client) What is Required to Get Things Implemented (client) Review of Statement of Work & Deliverables Schedule (you) When you come out of this meeting, you should have an excellent understanding of the website, business needs, and key pain points from the client. You'll also have had an opportunity to set expectations. Bonus Tip: If you are working with an in-house SEO person, find out about the projects they have been trying to push through. You may be able to help them get that SEO enhancement moved up the development pipeline and make them look good in the process. Coffee Break! Use this time to recharge your caffeine and make notes about the call. Leverage Your Coworkers If you are part of a consulting team, like we had at SEOmoz, ping the other SEOs. This is expecially true if you will be tackling this particular project solo. Send them an email and request that they conduct a quick 15 minute assessment of the site. We did this with great success at SEOmoz. With a dream team that included Rand, Jen and Danny the output of 45 combined quick assessment minutes was incredible. If you are an indepenent SEO, you can still use a system like this. Form a group of trusted SEOs and provide this support for each other. Be mindful of NDAs and potential conflicts of interest (see Sarah's post on consulting contracts for more great details). Free Form Exploration I'm pretty structured in my approach to SEO auditing, but there is nothing structured about my process during the free form exploration phase. I'm all about creating efficiencies through discipline and a deliberate work plan. That is what gets the project done and brings home the bacon. However, I always set aside at least three hours for unstructured play and exploration.SEO is part art and part science. The actions I'm attempting to describe here are definitely more Pablo Picasso than Marie Curie. I fire up all of my FireFox Plugins and browse the site, start GSiteCrawler, hit-up Google with a flurry of search operators, run LinkScape/Open Site Explorer, have a grand ol' time in SEOmoz Labs, and check out the keyphrase landscape with Quintura and SEMrush. One find leads to another and I never know where I'll end up. No two sites are alike and I'm still coming across things I've never seen with each new audit. Analyze Page via the mozBar showing a less-than-fantastic title tag I'd say I find 80% of a site's issues and opportunities during this brief free form exploration. Most of the remaining 45+ hours of a project are spent elaborating on the findings and detailing the action plan to support my original finds. Be sure to take notes and screen shots as you go. Bonus points if you manage to input them directly into your master Word file. Huge time saver. Lunch Try to step away from the laptop, but bring a notepad with you. No doubt your brain will still be working as your hands work to fill your belly. Client Email Based on the morning's kick-off call and your findings in the free form exploration process you no doubt have a few questions for the client. If you don't already have access to Webmaster Tools and analytics, now is a good time to ask. I usually have questions for the client about things that aren't always apparent from an external view of the site such as how their expiring content policies work. This follow-up email keeps the communication lines open, impresses the client because you've uncovered so much opportunity already, and gives them a chance to ask additional questions or provide more info. Populate Some Data At the end of a busy day I like to shift my focus to something that requires less brain power and benefits from simple funcitons like copy & paste. I usually wrap up my day by populating things like the current robots.txt file (for analysis later), top 25 links from Open Site Explorer, etc. Top Pages via OSE - Yikes! They need to fix those 404s... Action Items Take the time to set-up your templates first. Schedule a call with the to kick off the project. Ping your coworkers or a small private SEO network to give a quick assessment. Give yourself time to play and explore freely. Get key follow-up questions into the client early. Choose something easy for the end of the day. Thanks for giving me a read! I'm working on a bi-weekly series that covers all things audit. If you liked this, you might also like 4 Ways to Improve your SEO Site Audit. You can find me in SEOmoz's PRO Q&A and on Twitter as @Lindzie. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Site Audits: Getting Started"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO Site Audits: Getting Started"
    },
    {
      "level": "H2",
      "text": "Template Preparation"
    },
    {
      "level": "H2",
      "text": "The Client Call"
    },
    {
      "level": "H2",
      "text": "Coffee Break!"
    },
    {
      "level": "H2",
      "text": "Leverage Your Coworkers"
    },
    {
      "level": "H2",
      "text": "Free Form Exploration"
    },
    {
      "level": "H2",
      "text": "Lunch"
    },
    {
      "level": "H2",
      "text": "Client Email"
    },
    {
      "level": "H2",
      "text": "Populate Some Data"
    },
    {
      "level": "H2",
      "text": "Action Items"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Lindsay Wassell\n          \n            Lindsay Wassell\n          \n            Lindsay Wassell"
}