{
  "url": "https://moz.com/blog/seo-tools-to-qualify-sites-before-pitch",
  "slug": "seo-tools-to-qualify-sites-before-pitch",
  "title": "How to Use SEO Tools to Qualify Sites Before the Pitch (for Non-Link Builders) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Learn how link building tools help you find quality sites and weed out low-quality ones, so that you can focus on outreach to help your site grow!",
  "content": "How to Use SEO Tools to Qualify Sites Before the Pitch (for Non-Link Builders) SEO Tools | Link Building By: Chris Giarratana May 10, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Chris Giarratana May 10, 2021 How to Use SEO Tools to Qualify Sites Before the Pitch (for Non-Link Builders) SEO Tools | Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As a self-taught SEO, I struggled (and failed) for years to understand how to build links to my site and the sites of my clients. I've built my agency on writing quality content that ranks in search engines and drives sales, but the one piece of the puzzle I was missing was how to build powerful links to that content. Like most SEO consultants who don’t focus on link building as a central business offering, for a long time, the entire process of link building at scale seemed overwhelming, and every link building campaign I launched failed to generate the results I needed. I would spend hours writing content, testing numerous tools to discover link opportunities, validating each site, and finally reaching out to site owners in a desperate attempt to secure high-quality backlinks. But nothing seemed to work, and as my success rates dropped, so did my confidence in myself as an SEO. It wasn’t until I started to look through my entire link building process that I realized I needed to spend more time qualifying sites to ensure I didn’t waste time on low-quality sites or irrelevant content. Over the course of a few years, I slowly started to develop a system to help me discover, prospect, and secure powerful links for myself and my clients. This process was made around me being the only person doing the work, so I had to find ways to minimize wasted time or resources along the way. A quick note for readers I’m not a professional link builder, and I’ve found that this process to qualify potential sites works for me and my needs. Since link building is a powerful SEO tactic, you should be sure to do thorough research to determine the best approach for your specific needs. What works for me might not work for you, so, I highly recommend you look at resources like Moz’s Beginner’s Guide to Link Building, or pick up The Ultimate Guide To Link Building by Garrett French and Eric Ward. So again, before we go through my qualifying process in the pre-pitch phase of link building, I just want to reiterate that this process is not perfect, it won’t work for all types of link building campaigns, and it will continue to be improved upon. I created this process based on my needs and goals, and it works on a few assumptions: You are a solo or small team, and need to maximize your time throughout the process. You are looking for broken link building and guest post opportunities. This will not work for local link building or other related strategies. You have access to various tools like Moz, Ahrefs, and Majestic, and you know how to pull data from those resources. You are more concerned with maximizing your time than you are about finding every site available. With that said, I hope it helps other SEOs shave some time off their link building process and combine it with other approaches for the best results possible! Qualification & audit in the pre-pitch phase No one will deny that link building is one of the most important pieces of any SEO strategy. While you may have an impeccable technical setup and the best content on the internet, the truth is that Google will not reward your efforts if you don’t have the types of links to your site that signal authority. Since all link building boils down to outreach, I needed to have amazing content to offer the right people to land links from the right sites. Whether I was performing broken link building, resource page link building, or reaching out to powerful sites for guest posting, I needed to make sure I limited the amount of time and resources wasted on irrelevant sites. The first step of any successful link building campaign is to make sure that you have the right content for the desired audience. At this point, let's assume that you have a great piece of content that’s relevant for a long list of potential sites. For me, the most important aspect to consider is my time, so this is where pre-qualifying sites is crucial. I have to cut out as many sites as possible as quickly as possible, and focus on the sites out there with the best fit. Step 1: Bulk disqualifications Once you know that your content will solve a problem, you can run various footprints through a tool like Scrapebox, NinjaOutreach, or Pitchbox to develop a large group of potential sites to reach out to. Depending on the industry and footprints used in the discovery phase, you might end up with a list of a few thousand potential sites. While it’s exciting to see that many, you can also lose a lot of time by reaching out to sites that are irrelevant or low-quality. Disqualify various URL parameters Before I look at metrics or other aspects of a site, I'll prune my initial list of sites based on specific words in their URL that I think will yield poor results for my outreach efforts. I do this with simple commands in Excel or a Google Sheets document to search for and remove each row with a URL that includes footprints like “wiki”, “forum”, and “news”. While this process isn’t perfect, I’ve found that these types of sites usually offer a low-quality link on a generic page buried deep in their content archive. Remove blatant guest posting sites Now that we removed sites with specific parameters in the URL, I like to remove sites that are obviously made for guest bloggers. While guest blogging has been a good strategy for me, sites that appear to be built around guest posts are usually unscrupulous sites that I don’t want a link from. While not always the case, I've found that these sites are likely part of a Private Blog Network (PBN) and could yield low impact for my link building efforts. To prune out these types of sites, I will pre-qualify sites like I did in the previous step by taking out sites with “submit”, “write for us”, or “guest post” in the URL and move them to my “junk” spreadsheet that I keep and examine later on. Step 2: Use tools to identify powerful sites At this stage, I’ve removed quite a few sites from the initial list based on their URL. Now I can assume that the sites I have in my list aren’t trying to generate guest posts, and my efforts won’t result in a link buried deep within a wiki page. It’s important to note that the exact metrics I consider acceptable will vary based on industry, client goals, and if I’m performing local link building campaigns vs. national outreach efforts. But to simplify things, I’ll use the general baseline with the metrics below when evaluating a typical client for authoritative outreach campaigns. Obviously, not all sites are disqualified, but if a site has high metrics but upon further examination I find the site is low quality, then I know that site was only built for rankings and I will disqualify that site from my target list. Majestic website metrics The most important factor to consider in any outreach campaign is the topical relevance and authority of a site based on the industry that you’re working in. It’s important to ensure that all backlinks are relevant to the target page from a topical and contextual perspective. Since topical authority and relevance are so important for outreach efforts, I run my list of sites through Majestic SEO so my spreadsheet of prospective sites are all related by topic and context to the piece of content I want to point links to. Once I have a list of topically relevant sites, I will run that list through Majestic and only keep those sites that return CF/TF of 12 or above. I may adjust this baseline depending on the number of results, but I have found that sites with CF/TF below 12 tend to be weaker sites that won't move the needle. It should also be noted that I only keep sites where the CF and TF scores are at least 50% of each other. For example, I will not consider a site with CF 50, but a TF 10 score. This step will whittle down my initial list and usually leave me with about 20-30% of it. I take all sites that aren’t relevant to the destination site and place them in a separate spreadsheet to review later. Ahrefs website metrics Now that I have a list of topically relevant sites that also meet a minimum threshold in Majestic SEO, I will move on to Ahrefs. I copy/paste the remaining sites into the Build Analyze tool to find sites with at least 500 monthly traffic and a DR of 15 or above. This step helps me identify “real” sites that generate traffic before I manually review the site. Moz website metrics Finally, I take the list of sites that are topically relevant and have strong baseline metrics through the Moz Pro tool. Since I can’t justify the cost of Moz API for my small team and limited use case, I need to do URL checks manually at this stage, so it’s important to do everything I can in previous steps to ensure I only work with sites that show good potential. I check my list of sites in Moz through their Link Research tool to understand the strength of a root domain and quickly identify any spam sites that might have survived previous steps. I also look at the Moz Spam Score to determine whether a site requires more manual review. Depending on the scope of my link building campaign, the industry I'm targeting, and geographic region (among other factors), I usually only reach out to sites with a DA of 10 or above. I’ve found the Moz DA tool is pretty accurate when evaluating the “realness” factor of a site, and anything below a 10 DA is likely a PBN site. My final step to evaluate a site through SEO tools is to look at the Spam Score to catch any leftover low-quality sites that may have passed the other checks: Like with most tools, you can get false positives as it’s pretty easy to stand a site up just to generate “good” SEO metrics. For this reason, I like to take the final step of a manual review before I reach out to website owners. Step 3: Manual review Now that I have a small list (usually 10-20% of the original list that I started with) of sites that meet benchmarks set in each tool, I'll begin the manual process of reviewing the remaining sites. I think it’s important to manually check sites before reaching out to them, because I can usually find sites that are part of a PBN, or those sites that were built just to sell links, based on their design and functionality. As I review these sites, I keep an eye out for obvious signals of a poor site. I almost always disqualify a site at this stage that has excessive advertising on it, because I can assume it was only built to increase their sales commissions and not the quality of content for real people. Use SEO tools to save time during the link prospecting phase No matter the scope of your outreach or the industry you work in, all outreach campaigns take a lot of time and resources. Most SEOs know that bad link building can result in a whole host of problems, and as the only person in our agency who performs outreach, I need to protect my time. The balance between scalability, quality, and efficiency is made or broken during the prospecting phase of any link building campaign. I use various SEO tools to help me save time and determine the best sites for my outreach efforts. Not only does this stack of SEO tools help me identify those sites, it also means that I'm more likely to successfully communicate with a real person at a real site to build links with. Feel free to test out this process for yourself, and I’d love your thoughts on how to improve it in the comments below! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Use SEO Tools to Qualify Sites Before the Pitch (for Non-Link Builders)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Use SEO Tools to Qualify Sites Before the Pitch (for Non-Link Builders)"
    },
    {
      "level": "H2",
      "text": "A quick note for readers"
    },
    {
      "level": "H2",
      "text": "Qualification & audit in the pre-pitch phase"
    },
    {
      "level": "H3",
      "text": "Step 1: Bulk disqualifications"
    },
    {
      "level": "H4",
      "text": "Disqualify various URL parameters"
    },
    {
      "level": "H4",
      "text": "Remove blatant guest posting sites"
    },
    {
      "level": "H3",
      "text": "Step 2: Use tools to identify powerful sites"
    },
    {
      "level": "H4",
      "text": "Majestic website metrics"
    },
    {
      "level": "H4",
      "text": "Ahrefs website metrics"
    },
    {
      "level": "H4",
      "text": "Moz website metrics"
    },
    {
      "level": "H3",
      "text": "Step 3: Manual review"
    },
    {
      "level": "H2",
      "text": "Use SEO tools to save time during the link prospecting phase"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Chris Giarratana\n          \n            Chris Giarratana\n          \n            Chris Giarratana"
}