{
  "url": "https://moz.com/blog/seo-salary-mythbuster",
  "slug": "seo-salary-mythbuster",
  "title": "SEO salary mythbuster! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Rand's post about SEW Live Seattle 2006 (below) got me thinking (and ranting) about SEO salaries. Below is an quote from what Rand said: Apparently, the lowest entry level SEO position ranges from $40-60K per year...The highest offer he recorded was $315,000 ...",
  "content": "SEO salary mythbuster! Public Relations M By: mozUser1469147917838 May 21, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! M By: mozUser1469147917838 May 21, 2006 SEO salary mythbuster! Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Rand's post about SEW Live Seattle 2006 (below) got me thinking (and ranting) about SEO salaries. Below is an quote from what Rand said: Apparently, the lowest entry level SEO position ranges from $40-60K per year...The highest offer he recorded was $315,000 as an annual salarysigh... I read this kind of notes about SEO salaries pretty often, and one thing that most miss is that these salary levels apply only in specific US (and some areas of Canada, GB & Germany )markets. Elsewhere huge SEO/M salaries are just a myth that should be busted... So how to test this..., if anybody is willing to offer me an 6 figure net salary with 3 year fixed contract & accepts the fact I work from Finland (in Europe), I'd be ready to seriously consider to sell/close my business and start working for pay... Seriously... This is one time only, real offer to get an pro-level SEO with nearly 10 years experience. If I get any bids (e-mail to sales@2kmediat.com with subject \"Seomoz SEO Salary MythBuster!\"), I'll let you know... ;) However, I would be seriously amazed if I received even one offer..Ps. Please note that In many European countries, including Finland, the employeer needs to pay various social fees in addition to salary.PS2. And yes, Digg this beyond anything you've seen. I want to either get filthy rich or prove this myth busted! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO salary mythbuster!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO salary mythbuster!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "mozUser1469147917838\n          \n            mozUser1469147917838"
}