{
  "url": "https://moz.com/blog/seo-tactics-die-but-seo-never-will",
  "slug": "seo-tactics-die-but-seo-never-will",
  "title": "SEO Tactics Die, But SEO Never Will - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "SEO has died a thousand deaths, but somehow it never seems to take. This is a post about why I think we underestimate what search is, and how SEO will continue to evolve long into our future.",
  "content": "SEO Tactics Die, But SEO Never Will Marketing Industry By: Dr. Peter J. Meyers June 13, 2013 Table of Contents Copied! By: Dr. Peter J. Meyers June 13, 2013 SEO Tactics Die, But SEO Never Will Marketing Industry This is a post that has been gnawing at the edges of my brain for years, and I think the time has finally come to write it. Our recent Moz re-brand launched the inevitable 4,789th wave (and that’s just this year) of \"SEO Is Dead\" posts. This isn't a post about our reasons for broadening our brand (Rand has talked extensively about that) – it’s a post about why I think every declaration of SEO's demise misses something fundamental about our future. This is going to get philosophical, so if you’d rather go make a sandwich, I won’t stop you. The Essence of Search Let’s start with a deceptively simple question – How big is the internet? I’ll attempt to answer that by creating a graph that borders on being silly: The internet is so big that even Google got tired of counting, and it's growing exponentially. Five years have passed since they announced the trillion mark, and the article suggests that URL variations now make the potential indexed page count theoretically infinite. We can't just print out the internet and read it at our leisure. We need a filter – a way to sift and sort our collected content – and that's essentially all that search is. However search evolves or whatever happens to Google, the expansion of human knowledge is accelerating. Unless we suffer a technological cataclysm, we will need search, in some form, for the rest of human history. Searchers and Searchees As long as search exists, it also stands to reason that there will be two groups of people: (1) People who want to find things, and (2) People who want to be found. On any given day, we may each be both (1) and (2), and the \"people\" who want to be found could be businesses, governments, etc., but for every search there will be some entity who wants to have a prominent position in that search result. The desire to be found isn't new or unique to online search – just ask Melvil Dewey or call up \"AAA Aardvark Plumbing\" in the Yellow Pages. What's unique to online search is that the system has become so complex that automated technology governs who gets found, and as the scope of information grows, that's not about to change. Ultimately, whenever a system controls who will be found, then there will be a need for people who understand that system well enough to help entities end up on the short list. This goes beyond manipulative, \"black hat\" practices – data needs to be structured, rules complied with, and many pieces put into place to make sure that the information we put out there is generally friendly with the systems that catalog and filter it. Over time, these systems will get more sophisticated, but they will never be perfect. As long as search exists, there will be a need for experts who can optimize information so that it can be easily found. SEO Is Not One Tactic When we say \"SEO Is Dead!\", we’re usually reacting to the latest tactical fad or announcement from Google. Ultimately, though, SEO is not one tactic and even though Google currently dominates the market, SEO doesn't live and die with Google. I'm 42 years old, and the public internet as we know it now hasn't existed for even half of my life. Google is a teenager, and I strongly suspect I'll outlive them (or at least their dominance). There's no doubt that search is changing, and our industry is barely out of its infancy. In the broad sense, though, the need for people who can help construct findable information and attract people to that information will outlive any single tactic, any individual SEO expert, and even any search engine. The Construct: Search in 2063 Sergei had spent his entire adult life learning how to manipulate The Construct. Fifteen years earlier, the unthinkable had happened – the collected knowledge of humanity had grown so quickly that there was no longer enough space in the accessible universe to store it in. The internet became The Construct, and it now spanned both space and time. Since no human could adequately comprehend 4-dimensional data (early attempts at neural interfaces drove a few pioneers to insanity), The Construct had to be projected onto a 3-dimensional orb suspended in a vacuum, affectionately known as the “space egg.” With more than a decade of practice, Sergei manipulated the egg like an omelette chef at a 5-star brunch, and what his clients paid him made their $37 mimosas look reasonable. This morning was worse than most. The Construct’s AI had detected an unacceptable level of manipulation and was adjusting the Core Algo. Sergei could already see the surface of the egg being rewritten, and the change was costing his clients millions with every passing minute. Luckily, his defensive bots were already at work, rewriting semantic data to conform to the ripples in the Algo. One thing was certain: the life of a Space Egg Optimizer was never dull. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Tactics Die, But SEO Never Will"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO Tactics Die, But SEO Never Will"
    },
    {
      "level": "H3",
      "text": "The Essence of\r\nSearch"
    },
    {
      "level": "H3",
      "text": "Searchers and\r\nSearchees"
    },
    {
      "level": "H3",
      "text": "SEO Is Not One\r\nTactic"
    },
    {
      "level": "H3",
      "text": "The Construct: Search\r\nin 2063"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}