{
  "url": "https://moz.com/blog/seo-strategy-predicting-yearly-site-traffic%20%20",
  "slug": "seo-strategy-predicting-yearly-site-trafficpercent20percent20",
  "title": "SEO Strategy: Predicting Yearly Site Traffic - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As a consultant, I work with many In-House SEO teams with strategy and other issues that arise throughout the course of the year. One of the trends that we are seeing is that these In-House teams are having a hard time coming up with accurate traffic centered goals. Traffic is the base for many…",
  "content": "SEO Strategy: Predicting Yearly Site Traffic SEO Analytics K By: Kate Morris September 13, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! K By: Kate Morris September 13, 2010 SEO Strategy: Predicting Yearly Site Traffic SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As a consultant, I work with many In-House SEO teams with strategy and other issues that arise throughout the course of the year. One trend we are seeing is that these In-House teams are having a hard time coming up with accurate traffic-centered goals. Traffic is the base for many metrics measurements, so being able to semi-accurately predict that number in the coming year is important for every business. I can hear you all now, \"Well there is the Google Keyword Tool ... use that.\" Typically, that is my answer too, but there have been major questions about the accuracy of Google's keyword tools and others available to webmasters, marketers, and search engine optimization teams. (If you will comment with your favorite keyword tool other than those I mention, I'll happily test and add it here!) The Google Keyword Tools (yes, plural) There was a shift recently with the Google Keyword Tool. The Legacy/API version is showing different numbers than the newest Beta interface. David Whitehouse and Richard Baxter both noticed this shift as well and did a few tests on accuracy. The jury is still out as to which version is more accurate, the legacy or the new keyword tool. But I believe like Mr. Whitehouse that the newer tool is the updated one, but that does not make it more accurate. To be clear, when I speak of the Legacy, API, and Beta tools, I do mean different versions of the Google Keyword Tool. First, from what I can see using the SEOmoz Keyword Difficulty tool, the Google API pulls from the Legacy tool, so they are one and the same. The Legacy tool is the prior interface for the current Beta version of the Keyword Tool. We had previously assumed that these pulled the same numbers, but my research and that of others proves otherwise. But wait! *infomercial voice* There is more! There is also the Search-based Keyword Tool that aids AdWords advertiser's in choosing relevant keywords based on search behavior and a specified website. This tool is explained by Google here and gives more in depth information on account organization and cost. But even this tool is not on par with the other two when it comes to impressions. A random query in the Search-based tool returned a suggestion for the keyword \"maragogi.\" The Search-Based tool says there should be 12,000 monthly searches. The Legacy tool returns 110 Local Exact match searches, 33,100 Global Exact match, and 201,000 Global Broad match. The new tool returns information only for a global setting (all countries, all languages). That returns 74,000 searches broad and phrase match, and 12,100 for exact match. It seems like the Search-based tool is more like the exact global match in this one instance. But what is a business supposed to do with all of these numbers?!?!? (hint: always use exact match) Back to Strategy If these tools are possibly inaccurate, how do our clients go about setting their yearly strategy goals? Put simply, in search, you never want to rely on one set of results or one ranking report. Data over time and from many sources is best. But with the lack of tools out there and Google bringing in at least 65% of traffic organically for most sites, how do you get the best numbers? Impressions First, you need to start out by figuring out how many impressions a keyword or set of keywords can bring in on average for a specific month. If you are in a cyclical industry, this will have to be done per month of the calendar year. 1. Pull from both Google Tools and other Keyword Tools The idea here is that if you take into account all of the numbers out there, you might see a trend that you can use for estimating future traffic. If there is no trend, then a median of the numbers can be used as your metric. A few other tools that you might look into include Word Tracker and Keyword Spy. You can see that the numbers are all over the place, but looking at these figures, I'd guess that the keyword might bring in around 6,500 impressions a month in the UK. The downside is that WordTracker and KeywordSpy don't allow you to look at exact match information versus broad match. When performing keyword research, you always want to look at the local (target to your country) exact match information. Too many people pull keyword information use broad match and get inflated numbers for all phrases related to that key phrase. 2. Run a PPC campaign if possible. The absolute best way to get accurate numbers about traffic over time is to run a PPC campaign. I pulled some numbers from a few campaigns (for our client's sake we have masked a number of the actual key phrases) in attempts to see if the new keyword tool is accurate to actual trafffic in August. The keywords pulled were all exact match in the campaign and the information pulled from the keyword tool was Local Exact and set to the country that the campaign was targeting. Some of these are higher and some lower. What I found that there really is no definitive answer of if the Google Keyword Tool is accurate. Take a look at the results for the example I used before, curtain fabric. The campaign saw 11,389 impressions, much higher than the new keyword tool, and lower than some other keyword tools. This is why a well run PPC campaign is important if you want to get a more accurate look at impression numbers. Please note that I didn't get a chance to ensure that these accounts were all showing at all times during the month, but they were all accurately geo-targeted and all showed on the top of the first page on average. Finding Traffic Based on Rank After getting a good idea of the number of impressions, you then need to take into account where you are showing for that keyword on average organically (aka your rank). While we cannot know specific click through numbers for every search done on the web, there have been some studies done on how much of those impressions the top organic result gets, the second and so on. The one I used the most often is from Chitika. Using the percent of the traffic and the impression numbers, you should be able to get a good idea of the visitors you can expect per month organically for a specific key phrase. So using the \"curtain fabric\" example, assuming that the site I am working on has maintained an average ranking over the last few months of #3 organically, I could expect about 1300 visits from Google for the keyword in a month (11.42% of 11,389 impressions). Past Metrics Once you get everything figured out, keep in mind that your past metrics are another good way of seeing how close you are to getting the traffic about right. Assuming that no major changes have occurred (like lack of metrics data in the last year), a look back is the most accurate way to understand traffic flow and trending on your site. Pull the unique visitors for every month of the last year and do some analysis on percent increase month over month. This can be done on any level in most analytics programs - overall traffic trends all the way down to the keyword level. Educated Guesses In the end though, making predictions are just that, educated guesses. Pulling data from all available sources and using your own historical data can assist in making an educated prediction for the next year. Keep in mind though that things never stay the same. Google Instant just proved that with one of the biggest changes we have seen in a while. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Strategy: Predicting Yearly Site Traffic"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO Strategy: Predicting Yearly Site Traffic"
    },
    {
      "level": "H2",
      "text": "The Google Keyword Tools (yes, plural)"
    },
    {
      "level": "H3",
      "text": "Back to Strategy"
    },
    {
      "level": "H2",
      "text": "Impressions"
    },
    {
      "level": "H3",
      "text": "1. Pull from both Google Tools and other Keyword Tools"
    },
    {
      "level": "H3",
      "text": "2. Run a PPC campaign if possible."
    },
    {
      "level": "H2",
      "text": "Finding Traffic Based on Rank"
    },
    {
      "level": "H2",
      "text": "Past Metrics"
    },
    {
      "level": "H2",
      "text": "Educated Guesses"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kate Morris\n          \n            Kate Morris\n          \n            Kate Morris"
}