{
  "url": "https://moz.com/blog/seomoz-welcomes-jane-copland",
  "slug": "seomoz-welcomes-jane-copland",
  "title": "SEOmoz Welcomes Jane Copland! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It's with great pleasure that I introduce our newest SEOmoz team member, the incredibly talented Jane Copland. Jane's tenure at SEOmoz has only been a week, but she's already a valuable addition to our team - poring through tomes of websites, blogs and books to catch up on the fast-moving world of…",
  "content": "SEOmoz Welcomes Jane Copland! Moz News By: Rand Fishkin September 27, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 27, 2006 SEOmoz Welcomes Jane Copland! Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. It's with great pleasure that I introduce our newest SEOmoz team member, the incredibly talented Jane Copland. Jane's tenure at SEOmoz has only been a week, but she's already a valuable addition to our team - poring through tomes of websites, blogs and books to catch up on the fast-moving world of search. Rebecca & Jane Jane's first major contribution to the SEOmoz website will be an article on the in-depth practice of Social Media Marketing; an area in which she has shown terrific talent and passion. Jane is already delving into keyword research and sent out her first few link building email requests. If all goes well, look for Jane to be contributing blog entries to the site within the next 3-4 weeks. I'm hoping she becomes as addicted to the SEO world as the rest of us. p.s. Since Jane is SEOmoz's first international hire (she's originally from Wellington, NZ), we've taken to asking her to say words like \"crikey\" and \"cheeky\" on a daily basis, just to hear the accent, a cross between Maori, Scottish and Colonial British. We'll have to get her on a podcast sometime soon to share the fun :) Edit from Rebecca: Jane was also an NCAA Division I swimmer, which is what brought her to the United States. (Jeff and I will pretend that she did not swim for Washington State University, so way to go, Jane!) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEOmoz Welcomes Jane Copland!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEOmoz Welcomes Jane Copland!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}