{
  "url": "https://moz.com/blog/seomoz-has-a-pen-pal",
  "slug": "seomoz-has-a-pen-pal",
  "title": "SEOmoz Has a Pen Pal! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Snail mail is dead, right? Apparently not! Recently SEOmoz received a written letter from a well-meaning entrepreneur at a federal correctional institution, asking us if we could send him any information about SEOmoz's services. \n...",
  "content": "SEOmoz Has a Pen Pal! Moz News By: Rebecca Kelley September 14, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley September 14, 2006 SEOmoz Has a Pen Pal! Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Snail mail is dead, right? Apparently not! Recently SEOmoz received a written letter from a well-meaning entrepreneur at a federal correctional institution, asking us if we could send him any information about SEOmoz's services. Happy to oblige (and surprised to receive a written request in the mail that wasn't a ransom note for Michael Martinez's kidnapping [we would pay the ransom to free him, but we're too lazy]), we printed out our Beginner's Guide and mailed it to our newfound fan. Lo and behold, he sent a thank you note scrawled on the letter we sent with the guide: We asked if we could post his letters on our site, which he happily gave us permission to do so. (Click on the snippets to read the letters in their entirety.)What did we learn from the exchange? Two things: It's always fun to receive letters in the mail SEOmoz has fans in all sorts of places Big thanks to Korey for making our day a little more interesting :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEOmoz Has a Pen Pal!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEOmoz Has a Pen Pal!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}