{
  "url": "https://moz.com/blog/seomozs-2006-financial-statements",
  "slug": "seomozs-2006-financial-statements",
  "title": "SEOmoz's 2006 Financial Statements - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I think this is, without question, one of the most anticipated posts I've authored. Since I announced back in September to several friends that I'd be posting SEOmoz's financial records on the blog, people have generally responded with shock and amazement. While public companies are forced by law…",
  "content": "SEOmoz's 2006 Financial Statements Moz News By: Rand Fishkin December 29, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 29, 2006 SEOmoz's 2006 Financial Statements Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I think this is, without question, one of the most anticipated posts I've authored. Since I announced back in September to several friends that I'd be posting SEOmoz's financial records on the blog, people have generally responded with shock and amazement. While public companies are forced by law to issue their balance sheets & earning statements, for private companies, financial information has always been thought of as competitive data. It is, to private firms, the most precious part of their secretive information, and yet we're laying it bare... why? Primarily because it fits with our philosophy and with our goals - to be as open as possible about everything that we do. There's certain information we're bound not to reveal (like a full client list or the exact amount each client/project earned us), and there's other pieces of data that would make for a negative experience if they were revealed (like exactly how much each SEOmozzer earns). But, with those exceptions, it's my opinion that we have nothing to lose from revealing our finances and everything to gain. There's no competitive information contained here that our competitors could use against us and nothing that would hurt our reputation (at least, in my opinion). I believe that honesty and transparency are the greatest ways that we can give back to a community that has so warmly welcomed us. Hopefully, you'll all get some great value (and satisfy your curiousities) by reviewing what we've done this year. Without further ado: NOTE: For those who would take these numbers literally, be forewarned that these are estimates, and slightly rounded ones at that. Our books haven't been audited - this is simply an accounting done by Gillian in Excel for our own internal calculations. When we finish up with a professional accountant before submitting taxes in April, I wouldn't be surprised to find some significant discrepencies. So, Mr. IRS guy who reads the SEOmoz blog, please forgive our crudeness with numbers. And everyone else, please pretend there's a big ~ symbol in front of every figure. Comparing Years January 1, 2006: Cash in the Bank: $3,500 (Gillian couldn't sleep) Full time Employees: 4 Clients Served in 2005: 12 January 1, 2007: Cash in the Bank: $64,000 (barring a weekend shopping spree by Rebecca ) Full time Employees: 9 Clients Served in 2006: 25 Pitches Made in 2006: 30 Clients Referred to Recommended List: ~300 (using my email as an estimate) Earnings from Referring Clients: $0.00 Breakdown of Earnings: (I had to remove the month-by-month earnings, as they were incomplete - we're still working on them due to different accounts receiving different funds; sorry!) New Clients: $390,000 Clients from pre-2006: $171,000 In-house Projects: $36,000 Total Earnings (2006) - $600,000 Breakdown of Expenses: 35.52% - Salaries & Bonuses 24.34% - Startup Finance Repayment (aka debt) 9.98% - Outsourcing 7.67% - Rent 6.91% - Travel (oh those SES shows) 2.73% - Utilities (incl. hosting & analytics) 2.33% - Medical 2.01% - Hardware & Software 1.35% - Taxes (I'm sure this number will be higher soon) 1.30% - Education 1.26% - Legal 0.99% - Consultant (Hi Andy!) 0.90% - Office Supplies 0.71% - Furniture 0.28% - Marketing (that's why we love word-of-mouth) 0.20% - L&I Insurance 0.14% - Business Insurance 0.11% - Shipping 0.0002% - Bank Fees Addtional Notes: Accounts Receivable (owed in contracts, but not yet paid): $220,000 Oustanding Debt: $20,000 Rand's Total Personal Earnings (including bonuses): $38,000 Rand's Total Personal Earnings last year: $26,000 Takeaways: I'm guessing that a lot of people assumed we'd be a much more profitable company than we are. Our rates are among the top 10-20% in the industry and the clients we work with include a pair of Fortune 500s (though neither is willing to reveal their identity). We've got a fairly solid reputation, a big industry presence and a good deal of branding, but this has yet to be translated into solid earnings. For me, personally, (and for Gillian as well) the last 18 months have been transformative, in an almost religious way. Gillian and I used to take shit (yes, that may be one of the only times I'll use that word on this blog, but it's the only appropriate one I know) all the time from family members about our business - why don't we quit this crazy dream and get real jobs? what the hell are we doing with our lives? when are we going to make some money out of this? Not surprisingly, after the Newsweek article came out last December, those criticisms faded away (thank you Brad). The pure joy I feel about coming through near-bankruptcy, times when Gillian told Matt and I to choose between who would take home a paycheck, and emerging with a solid financial footing is exceptional. I know that I lack the \"killer instinct\" in business. I know that a savvier, more experienced businessman probably could have turned many of the hundreds of potential clients who've contacted us over the past year into profits. I know that growing this company, in ability, in personnel and earnings have been a struggle. But, I also know that we've built something special with SEOmoz - a brand and identity that's unique in the corporate world (in my experience). I do want to be more profitable, and I want SEOmoz's staff to earn what they deserve, which is a far cry from what they're making now. To that end, this blog post is also serving as our official announcement that we'll be offering paid content and paid membership to this site in the next 30-40 days. Matt & I will have more to announce about this in the near future, but our intent is to make the SEOmoz website, which, to date hasn't produced any (direct) income (apart from ~$2,000 in ad revenue from when we used to run paid ads), into a revenue source for the company. We'll NEVER shut down the free material we provide via the blog, the many articles and the tools (in fact, we intend to expand all of these), but we are going to be wrapping some of our best advice into comprehensive, digestable packages and providing some special features on the site to paid members. Our goal is to eventually become self-sufficient with income from internal projects - we love working on them, we're almost always more successful with them than with clients (with a few notable exceptions) and they have a greater long-term potential. From that position, we can take on those clients we know we can make a difference for and continue to refer out many others, while serving as a hub for resources, discussion and community in the search marketing world. It's not the grandest business plan, but it fits our passions - and that's what matters most. Happy New Year to all - may you be blessed with the same success that we've experienced (and hopefully more). If you have thoughts to contribute or share about these numbers or your own business experiences, please do so in the comments. I'll be out of town Sunday and Monday with Mystery Guest (snowshoeing!), but we'll all be back to our usual schedule and full-time blogging next Tuesday. p.s. For those seeking some more meat-y content, I answered a lot of questions about hosting and SEO over at Lunarpages' blog today. p.p.s. If you haven't already, you really should read Danny's interview with Jimmy Wales about Wikia search - Danny doesn't pull any punches. p.p.p.s. Don't forget to put that ~ in front of all the numbers as you read through UPDATE in 2008: I've now posted our 2007 financials for those who are interested. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEOmoz's 2006 Financial Statements"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEOmoz's 2006 Financial Statements"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}