{
  "url": "https://moz.com/blog/seomoz-unleashing-the-fury-on-keyword-research-tools",
  "slug": "seomoz-unleashing-the-fury-on-keyword-research-tools",
  "title": "SEOmoz: Unleashing the Fury on Keyword Research Tools - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "...fury meaning me, of course :)Yesterday Rand and I were checking out KeyCompete, a fairly new keyword research site. \n\nWhat is KeyCompete? Well, in the site's own words:\"KeyCompe...",
  "content": "SEOmoz: Unleashing the Fury on Keyword Research Tools Keyword Research By: Rebecca Kelley December 20, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley December 20, 2006 SEOmoz: Unleashing the Fury on Keyword Research Tools Keyword Research The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. ...fury meaning me, of course :)Yesterday Rand and I were checking out KeyCompete, a fairly new keyword research site. What is KeyCompete? Well, in the site's own words:\"KeyCompete is an online keyword research tool that identifies the keywords your competitors are using in their pay-per-click campaigns. KeyCompete also identifies the competition that is bidding on your keywords.\"Needless to say, Rand and I were all \"What the?! How do they do that? Where do they get their data?!\" We scoured the site in hopes of finding out more information, but to our dismay there was nothing about where the company was located, who was behind KeyCompete, when the site launched, or how they acquire their data. Heck, we couldn't even find any contact phone numbers or names.Not willing to throw in the towel, Rand wanted answers, damnit! He sicced me onto KeyCompete and told me to shoot them an email and raise hell about their site's lack of trustworthiness. In Rand's words, \"Rebecca, you're probably the only one here who can get away with telling them that their site's shady and eliciting some sort of response.\" Uh, thanks, Rand! Anyway, I shot an email to support@keycompete.com. Much to my surprise, about a half hour later I got a response from a man named Jim Stracka. He told me that he'd be happy to chat with me over the phone about KeyCompete. After a few emails and a forty minute phone call, I got some answers.Basically, KeyCompete is owned by Tiger Technologies, a company based in Houston, Texas. 11 people work for Tiger Technologies, 7 of whom work specifically for KeyCompete. Jim is KeyCompete's CEO. The keyword research tool launched around April 2006, and they currently have had thousands of users and a little under 500 customers. What can you do with KeyCompete? Well, say you want to search for the term \"seo\": The results estimate about 200,000 searches for the term \"seo\" per month. It also shows you a list of domains that are advertising for that term. The color bar shows which sites have greater visibility for the keyword.Built into this report are a number of other reports, including: Watch Reports – Add a domain and you'll receive weekly updates on what's going on with that domain (what keywords they're bidding on, what's moving up and down in rank, the domain's top keywords) Keyword monitoring – You can watch keywords on a regular basis (what domains are bidding on it, receive more detailed reports) Competition Reports – See the domains that you're competing with and what keywords they're using Long Tail Reports – Examines the keywords that both you and your competitors are using/targeting, and based on this list will suggest less costly keyword combinations When I asked Jim about how he obtains his data, he acknowledged that he doesn't want to give away his competitive advantage, but he did admit to some scraping. Combined with their many data sources (including their own servers), they have over 150 million keywords in their database from three million websites. I then asked Jim about the tool's accuracy, and he told me that the accuracy varies. For certain domains the tool is very accurate, but for others someone will come along and say, \"You only have half of my keywords.\" In that type of situation, when someone approaches them and says \"You're not accurate about my domain,\" they'll analyze keywords from the long tail report and work to improve the accuracy.When I shared my concerns about the lack of credibility and trustworthiness on the site, he did agree that it would be good for the site to have more accessible information about the company, ways to contact them, and some more specific information about how they collect data. (Although he did say that he doesn't get many emails like the one he received from me, so maybe I'm just a Suspicious Sally. Way to train me to look at sites with a critical eye, Rand!) The last thing Jim wants is to give the impression that the company's trying to be secretive, so he thanked me for my suggestions and said he'd talk to their tech guy about implementing some changes to the site. I was really impressed with how promptly Jim responded to my email inquiry and his willingness to chat with me over the phone. He was very helpful and also seemed genuinely appreciative of my recommendations.And wouldn't you know it, about twenty minutes after we wrapped up our phone call I returned to KeyCompete to get a snapshot for this blog entry, and they already made a change: Hey, a live support and chat option! I also got an email from Jim saying they added more information to their FAQs regarding how they obtain their data. Needless to say, Rand and I were very impressed that they valued our suggestions and took us seriously. And, we got a lot of the answers we were looking for. All it took was a bit of sleuthing, a stubborn boss, and a tenacious young SEO. Look out, Overture! You're on notice! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEOmoz: Unleashing the Fury on Keyword Research Tools"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEOmoz: Unleashing the Fury on Keyword Research Tools"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}