{
  "url": "https://moz.com/blog/seomoz-best-of-may-2009",
  "slug": "seomoz-best-of-may-2009",
  "title": "SEOmoz Best of May 2009 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Happy June, evvabody! Here's what happened last month in case you were bedridden with swine flu: \n\nBest Blog Posts in May 2009\n\n    If I Could Go Back In Time & Give Myself Some Advice, This Would Be It. If Rand could turn back tiiiiiime......",
  "content": "SEOmoz Best of May 2009 SEO Events By: Rebecca Kelley June 9, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley June 9, 2009 SEOmoz Best of May 2009 SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Happy June, evvabody! Here's what happened last month in case you were bedridden with swine flu: Best Blog Posts in May 2009 If I Could Go Back In Time & Give Myself Some Advice, This Would Be It. If Rand could turn back tiiiiiime...if he could find a wayyyyyyyyy...Rand hops into his DeLorean and gives his 2007 self some advice, including \"Use email marketing,\" \"Invest in your affiliate program,\" and \"Don't try to rip off the Libyans.\" 10 Resources That Changed How I View the Internet. Danny shares some stuff that's substantially changed his view of the Internet. (Spoiler alert: his view of the Internet largely consists of porn.) URL Rewrites and 301 Redirects - How Does It All Work? New hire Jen gets all Mr. Wizard on us and gives us a handy step-by-step of how URL rewrites and 301 redirects work, complete with lovely visual aids. Rewriting the Beginner's Guide Part X: Measuring and Tracking Success. Rand has finally completed the Beginner's Guide series of blog posts. Now all we have to do is slap that beeyotch together and add an appendix and Bob's your uncle. Whiteboard Friday - Link Farming. Rand talks about why link farming is bad, m'kay. Best YOUmoz Posts in May 2009: The Real Power of Twitter. Dr. Pete knows what the REAL power of Twitter is, and he shares it with all of us. (It's people! Twitter is peeeeeee-ple!) Weapons-Grade SEO Part 1: Laying the Foundation. Colewhitelaw teaches us how to create a \"profoundly optimized\" site that's largely self-sustaining. Utilizing Twitter in a Link Building Campaign. Nicchenet shares some link building tips the ol' Twitter way. The Seven Deadly Sins of Company Blogging. Chris Lister debuts a sinfully good list about common blogging missteps, and he tops it all off with Gwyneth Paltrow's head in a box. (Okay, maybe not that last part.) Lost in the Ocean of Ghost Writers. SEMWarrior shares his struggle to find a quality ghost writer. I know what he means, what with them always spontaneously bursting into flames and turning into skeletons and whatnot...wait, that's Ghost Rider. Oh. That explains a lot, actually. Tool Updates and Launches in May 2009: We beefed up our Rank Checker tool into a new Rank Tracker, which allows you to track the rankings of various URLs over time. You can download previous rankings into CSV and receive rank alerts via email. Huzzah! We had some issues with the Linkscape API as well as some server issues this month. Sorry about that--things should be more stable now (we're now giving Timmy 5 Red Bulls a day, so that human-powered hamster wheel should spin more continuously from now on). This isn't a tool, but last month we contacted various people in the search industry about what they think are Google's most crucial search engine ranking factors, and we've just received their responses so expect an updated Search Ranking Factors guide within the next month! Monthly YOUmoz Contest Winner Last month the monthly YOUmoz blog theme was social media marketing. We received a good chunk of submissions (many of which were about Twitter) that I've listed below: Putting Out to Score on Social Media The Right Way to Leverage Social Media The Real Power of Twitter Quantifying Social Media: Cost Per Conversion Social Media Sites the Future of SEO/RM or Just a Fad? Do Twitter Accounts Need Scale? How to Utilize Twitter Trends for Amazing Blog Traffic Utilizing Twitter in a Link Building Campaign Companies Playing on the Social Media Playground Wow, look at all those entries! We had a lot of great posts, but there can be only one winner this month. So, without further ado, paging Dr. Pete, Dr. Pete, you're wanted in the winner's circle so we can feed you a carrot and brush your glossy coat. Pete wrote a great, simple, straightforward and practical post about the best way to leverage Twitter, and not only did it get promoted to the main blog, it won him a lovely $50 Amazon.com gift certificate. Congratulations, Pete! YOUmoz Theme for June 2009 And the YOUmoz theme for June 2009 is (drumroll please)...case studies! We've kept it simple--all we want is to hear some great case studies from you guys. Whether you've got a personal anecdote or you have a client example, please share them with the SEOmoz community. We want to hear both success stories and failed attempts--submit them all! They should all prove to be a great learning experience (besides, sharing is good, as we all learned in kindergarten). Start cooking up your blog posts and submit them today! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEOmoz Best of May 2009"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEOmoz Best of May 2009"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}