{
  "url": "https://moz.com/blog/seomozs-stats-for-2007",
  "slug": "seomozs-stats-for-2007",
  "title": "SEOmoz's Stats for 2007 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Following in Danny's footsteps over at SELand, I'm offering up SEOmoz's website stats for 2007. Enjoy!\nVisits\n\n    January - 202,622 \n    February - 309,924 \n    March - 283,417\n    April - 280,284 \n    ...",
  "content": "SEOmoz's Stats for 2007 Moz News By: Rand Fishkin January 3, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 3, 2008 SEOmoz's Stats for 2007 Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Following in Danny's footsteps over at SELand, I'm offering up SEOmoz's website stats for 2007. Enjoy! And if you're interested, here is last year's data as well - 2006 stats for SEOmoz. Visits January - 202,622 February - 309,924 March - 283,417 April - 280,284 May - 315,785 June - 254,604 July - 263,274 August - 263,295 September - 266,571 October - 312,147 November - 285,109 December - 242,348 TOTAL - 3,279,380 Page Views January - 554,000 February - 694,760 March - 670,208 April - 697,881 May - 739,674 June - 656,939 July - 717,553 August - 739,397 September - 789,168 October - 861,499 November - 794,620 December - 674,978 TOTAL - 8,590,677 Most Popular Pages https://moz.com/ https://moz.com/blog https://moz.com/ip2loc https://moz.com/rank-checker https://moz.com/web2.0/ https://moz.com/article/search-ranking-factors https://moz.com/page-strength https://moz.com/tools https://moz.com/users/my https://moz.com/tools/kwtool.php?a=myreports Most Popular Blog Posts https://moz.com/blog/css-properties-you-probably-never-use https://moz.com/blog/put-your-best-foot-forward https://moz.com/blog/web-developers-command-line-tricks https://moz.com/blog/web-design-tactics https://moz.com/blog/17-ne...or-successful-ecommerce-websites https://moz.com/blog/how-t...in-a-web-design-the-design-curve https://moz.com/blog/21-tactics-to-increase-blog-traffic https://moz.com/blog/inter...elopers-20-good-questions-to-ask https://moz.com/ugc/how-to...into-your-current-website-design (from YOUmoz!) https://moz.com/blog/5-htm...bly-never-use-but-perhaps-should Top Referring Domains Direct access or bookmark - 1,300,008 http://www.google.com - 406,027 https://moz.com - 194,223 http://www.stumbleupon.com - 133,044 http://digg.com - 96,840 http://www.digg.com -63,403 http://www.google.co.uk - 46,401 http://images.google.com - 28,926 http://del.icio.us - 28,035 http://search.yahoo.com - 27,359 Search Engines Google - 92.75% Yahoo - 4.42% MSN Search - 0.77% Windows Live - 0.49% AOL Search - 0.40% Ask Jeeves - 0.27% Alexa - 0.14% Dogpile - 0.09% Altavista - 0.08% Cnet - 0.07% Site Activity Avg Page Views Per Session - 2.61 Avg Length of Visit - 3 minutes, 5 seconds Most Active Server Hours - 2-4pm Demographics Screen Resolution Breakdown _ Browser Breakdown _ Country Breakdown _ Languages Breakdown _ Membership & Participation Data 59,032 Current Members ~1,700 Premium Members 794 Q+A Threads in the Knowledge Base 2,060 Total Blog Posts 380 Total YOUmoz Posts 250+ Companies in the Marketplace 44 Resumes in the Marketplace 76 Jobs posted in the Marketplace My Personal Takeaways & Observations The most popular blog posts stem almost exclusively from being featured on Digg, which is something we rarely shoot for anymore. While we certainly got some value by being regularly on Digg's front page, our goals have shifted from increasing awareness to serving an already sizable community. We might look into some more bait in 2008, but it's equally likely we'll continue to fly under the Digg radar. The most popular pages on the site reflect what return visitors are most likely to hit - the homepage, the tools and the important articles. For the first time ever, traffic from outside the US outnumbers traffic from inside the US. We're going to need to spend some serious effort to serve the international SEO community that visits here so often. With almost 60,000 members and an average of close to 100 signups each day, I'm not too worried about the flattening visit stats. Instead, I think our biggest priority is going to be making both the free and premium content on the site the best it can be - we'll worry about marketing after we have a product that truly shines. I believe Firefox's actual market share is still well under 15%, yet it's almost 60% here at SEOmoz. This makes the 92% of search referrals from Google (and the 15%+ of 1920 wide screen resolutions) no surprise either. We attract a very different kind of Internet crowd than most websites. If you compare our data and the SELand data to what Compete, Quantcast or Alexa are reporting, you can see how tragically inaccurate those services are. Sadly, that's no anomally. Everytime I get access to a client's visit data, I'm always curious to check the three and have not once found accuracy, even on a relative basis. Third party traffic metrics still have a very, very long way to go. I'm really proud of the success we've had with the Marketplace and YOUmoz. Both have become invaluable sources of community and opportunity. In 2008, we're certainly going to be focusing on improving both and adding more functionality. Goals for 2008 - to reach 5,000 premium members and have 5 million visits by year's end. If anyone has shared their blog stats for 2007, please do link to it in the comments. I'd love to let the community have a look at how lots of different sites and blogs generate traffic. p.s. Although I hate to beg for votes, if you found SEOmoz valuable this year, we'd love to hear from you in the form of taking the SEJournal blog awards survey (we're nominated for best SEO Blog, Best Overall Search Marketing Blog, Best Search Conference Coverage in Photos and I'm personally nominated for Most Giving Search Blogger). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEOmoz's Stats for 2007"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEOmoz's Stats for 2007"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}