{
  "url": "https://moz.com/blog/seomozs-web-20-awards",
  "slug": "seomozs-web-20-awards",
  "title": "SEOmoz's Web 2.0 Awards - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I ask those of you for whom the phrase \"Web 2.0\" is an anethma to refrain from judgement while you read this post and browse the site we've created. Afterwards, when you've had time to process it, I invite you to comment with as much passion (for or against) as you like.\nMy first order of business…",
  "content": "SEOmoz's Web 2.0 Awards Social Media By: Rand Fishkin March 28, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 28, 2006 SEOmoz's Web 2.0 Awards Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I ask those of you for whom the phrase \"Web 2.0\" is an anethma to refrain from judgement while you read this post and browse the site we've created. Afterwards, when you've had time to process it, I invite you to comment with as much passion (for or against) as you like. My first order of business with this post is to congratulate Kat Ortland. This young woman, who we hired less than 6 months ago, has proven her mettle. The amount of time, energy and thoughtfulness she put into what was orginally just a pet project of mine is truly astounding. Bravo Kat. Without further ado: The Web 2.0 Awards(Web2.0Awards.org) More than 700 sites were initially reviewed, of which 300 were categorized, investigated and directly used by the SEOmoz team. Our goal was to find those players in the \"Web 2.0\" space who were doing a truly exemplary job - to show our fellow web developers and web marketers how this movement (whether named or unnamed) is contributing to the growth of the Internet as a whole. On the site, you'll find: The awards themselves, including the winners, 2nd and 3rd place finishers and the honorable mentions in each category._ Our judging criteria and award selection process._ A Web 2.0 Zeitgeist article that includes a look at the phenomenon (not through rose-tinted glasses, but with a truly skeptical eye) and asks prominent players in many spaces to contribute their thoughts (I've even thrown in my own little rant at the end)._ Interviews with 19 of the 22 winners, including folks like Dave Sifry from Technorati, Craig Newmark from Craigslist, Jen Mazzon of Writely (prior to the Google PR dept. acquiring them), Mike Davidson of Newsvine and many more._ A terrific rant on the subject of Web 2.0 by the search industry's own Danny Sullivan, as well as some great chats with folks like Brad Stone (who just wrote Newsweek's cover article on Web 2.0) and Emily Chang (who runs the popular eHub blog). There's so much to talk about here that it doesn't fit in a single post. I welcome your feedback and look forward to taking lots of flack (as anything \"Web 2.0\" must). I suspect that there will be lots more to say on this issue over the next few days, but for now, with all this work behind us, the team here at SEOmoz needs a wee break. UPDATE: Wow, already on del.icio.us and Digg... Those guys are fast. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEOmoz's Web 2.0 Awards"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEOmoz's Web 2.0 Awards"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}