{
  "url": "https://moz.com/blog/seomozs-video-on-blogonexpo-a-15-minute-social-media-extravaganza",
  "slug": "seomozs-video-on-blogonexpo-a-15-minute-social-media-extravaganza",
  "title": "SEOmoz's Video on BlogonExpo - a 15 Minute, Social Media Extravaganza - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Aditya Mahesh from BlogOnExpo, an online blogging & web conference done through video and podcasts, asked us to contribute a segment on social media. Last week, Scott and I took nearly an hour of filming time (and Scott contributed many hours of editing) to create a 15 minute long presentation on…",
  "content": "SEOmoz's Video on BlogonExpo - a 15 Minute, Social Media Extravaganza Social Media By: Rand Fishkin January 14, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 14, 2008 SEOmoz's Video on BlogonExpo - a 15 Minute, Social Media Extravaganza Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Aditya Mahesh from BlogOnExpo, an online blogging & web conference done through video and podcasts, asked us to contribute a segment on social media. Last week, Scott and I took nearly an hour of filming time (and Scott contributed many hours of editing) to create a 15 minute long presentation on the principles of social media marketing: I'm saying something about the \"linkerati\" here, hence the air quotes :) (link) If you watched last week's Whiteboard Friday, you'll notice we used a similar editing technique (don't worry, we're not going to go overboard with it in the future). The video's a little fun, a little more in-depth, and hopefully educational for those who like to consume their online marketing concepts through show-and-tell. You can find the video - SEOmoz's Social Media Marketing - on the BlogOnExpo site, along with other presentations from folks like Neil Patel and interviews with others, like Matt Mullenweg. Many thanks to Aditya for the BlogOnExpo production and a special thanks to Scott Willoughby for his hard work in creating the video. p.s. I note that the video seems strangely unavailable on Google Video right now. I had to download it to my machine to get it to work... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEOmoz's Video on BlogonExpo - a 15 Minute, Social Media Extravaganza"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEOmoz's Video on BlogonExpo - a 15 Minute, Social Media Extravaganza"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}