{
  "url": "https://moz.com/blog/seomoz-wishlist-user-specific-analytics",
  "slug": "seomoz-wishlist-user-specific-analytics",
  "title": "SEOmoz Wishlist: User Specific Analytics - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "So I have a feature that I wish to see someday on SEOmoz, why not just send an email? why not scream into my pillow?Because it represents an aspect of community building that is still lacking on too many sites...Here's the feature:I want to see custom analytics tracking for my profile page, my…",
  "content": "SEOmoz Wishlist: User Specific Analytics Social Media B By: Bud-Caddell May 14, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! B By: Bud-Caddell May 14, 2007 SEOmoz Wishlist: User Specific Analytics Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. So I have a feature that I wish to see someday on SEOmoz, why not just send an email? why not scream into my pillow? Because it represents an aspect of community building that is still lacking on too many sites... Here's the feature: I want to see custom analytics tracking for my profile page, my posts, and even my comments. I want to see the same kind of analytics info that I have for my blog -- entrances, exits, durations, keywords, etc. For my comments, I want to see how often I'm replied to per post. (This came to me as I was clicking around StumbleUpon and a YOUmoz entry popped up -- and I thought, I bet that user would like to know all the traffic they're getting.) As my mother would say, spit in one hand, want in the other.... Tying analytics tracking into user profiles is no small feat. And as much as the SEOmoz team loves their new community, I don't remember ever cutting them a check for their services... The decision is theirs to make regarding the extent to which they'll serve the community -- but I would argue that one requisite of community participation that will emerge (and is beginning) is the ability to measure the extra-platform effects of participation. My Profile page ranking in the top results for my name is one example. How my participation garners me attention from off-site is the next step. SEOmoz gets a wealth of articles written by the community and currently, we get visibility on the site as well -- but I want to quantify what my posts are getting me. I juggle posting here and posting on my blog -- and I'd like to better understand the value of my time spent creating content for each site. What are your thoughts? Is this a worthwhile feature? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEOmoz Wishlist: User Specific Analytics"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEOmoz Wishlist: User Specific Analytics"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Bud-Caddell\n          \n            Bud-Caddell"
}