{
  "url": "https://moz.com/blog/seomozs-term-targeting-tool",
  "slug": "seomozs-term-targeting-tool",
  "title": "Why I'm a Fan of SEOmoz's Term Targeting Tool - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I am a new SEOMoz premium member, and I have just been absolutely LOVING all the great tools! I especially like the Term Targeting tool, and I've used it on my personal site with striking success. I had no idea how un-targeted certain pages were! And other pages I thought they were targeting…",
  "content": "Why I'm a Fan of SEOmoz's Term Targeting Tool SEO Tools E By: Eric Bryant March 6, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! E By: Eric Bryant March 6, 2008 Why I'm a Fan of SEOmoz's Term Targeting Tool SEO Tools This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Intro from Rebecca: Yes, this post pretty much just pimps our PRO tools, but it's been a busy week and sometimes it's nice to have a little praise, damnit. I am a new SEOmoz PRO member, and I have just been absolutely LOVING all the great tools! I especially like the Term Targeting tool, and I've used it on my personal site with striking success. I had no idea how un-targeted certain pages were! And for other pages that I thought were targeting certain keywords, I come to find out they really weren't. After revising a few pages according to the Term Targeting tool, I then re-checked those pages using SEOmoz's other great tool: the Rank Checker. I checked the SERPS for those new pages and terms, and I was really impressed with the outcome: modest, but substantial increases in ranking. As an SEO specialist and CEO of a multimedia communications company, I had been utilizing the SEOmoz free tools with my SEO clients, but that was limited, and I need to do more. So, I finally \"broke down\" and bought the subscription. I don't regret it one bit. These tools really work! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Why I'm a Fan of SEOmoz's Term Targeting Tool"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Why I'm a Fan of SEOmoz's Term Targeting Tool"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Eric Bryant\n          \n            Eric Bryant\n          \n            Eric Bryant"
}