{
  "url": "https://moz.com/blog/seomoz-uses-social-media-to-launch-new-seo-web-app-10768",
  "slug": "seomoz-uses-social-media-to-launch-new-seo-web-app-10768",
  "title": "SEOmoz Uses Social Media to Launch New SEO Web App - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": " Last week SEOmoz released its fantastic new SEO web app to a rocky, yet entertaining start. And while most of us typically think of SEOmoz as, well, a SEO company, a few anecdotes from their most recent launch show how the Mozzers are pretty good at online PR, branding and reputation management as…",
  "content": "SEOmoz Uses Social Media to Launch New SEO Web App Social Media By: Josh Braaten August 22, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Josh Braaten August 22, 2010 SEOmoz Uses Social Media to Launch New SEO Web App Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Last week SEOmoz released its fantastic new SEO web app to a rocky, yet entertaining start. And while most of us typically think of SEOmoz as, well, a SEO company, a few anecdotes from their most recent launch show how the Mozzers are pretty good at online PR, branding and reputation management as well. Today's post shows examples of SEOmoz's most active tweeters' activity to promote, fail (i.e., perform damage control) and win (i.e,. enjoy the spoils of a an eventually successful launch of an awesome new SEO tool). Mozzers Promoting through Twitter SEOmoz Twitter activity had followers abuzz in the weeks and days preceding the launch. Mozzer-specific Twitter activity was way up (See advanced Twitter search tip #6 here to create RSS feeds that target specific Twitter users). Tweets like the ones here fueled the anticipation. The SEOmoz Twitter account stirs up interest with this tweet: Rand is excited about the web app too: Even Jamie Steven, new VP of Marketing at SEOmoz, is on board with the launch: SEOmoz Makes Failing Look Good On August 11, SEOmoz launched the new web app to a bit of a turbulent start. A lucky few were able to get in and play with the features (thank you, 302 redirect warning that unlocked some links to an old page!) before the flood of interest and traffic brought the poor web app's server to its knees about twenty minutes later. The SEOmoz team scrambled but responded well via social media. The Mozzers quickly acknowledged the issue, apologized and thanked their community for their patience and then proceeded to add some humor to diffuse the situation. Rand sprang into action within 20 minutes of launch to acknowledge that something was awry: SEO, Coder and sometimes-Whiteboard Friday host Danny Dover used some well-timed humor to help visitors gain a window into what was happening at the Mozcamp while the web app servers was being repaired: Late into the night, VP of Engineering Kate Matsudaira happily assures a follower that the issue is still being addressed: Taking a Well-Deserved Twitter Victory Lap By the next day most issues were under control and SEOmoz Pro Members were happily exploring the new accessibility, link analysis and on-page tools available in the new web app. The SEOmoz team took time to publicly thank their fans and each other to celebrate the launch of what will no doubt become a great tool for the SEO community. SEOmoz director of Customer Acquisition Joanna Lord describes the roller coaster of emotions involved with launch day: Community Director Jennifer Sable Lopez seconds the half-giddy half-sugar-rush-then-crash feeling they must have all felt at the end of the day: As the dust settled and the server issues died down, the SEOmoz Twitter account expressed the company's thanks to the community throughout the launch: The Move to Transparency The nice thing about being so transparent on the social web is that your community is generally more understanding when things don't quite go as well as you planned. SEOmoz provided an excellent example of how to use Twitter as one social channel to promote, do damage control and (eventually) celebrate victories with their community. What thoughts did you have as SEOmoz launched the new SEO web app? Did use social media appropriately or would you have showed this SEO company a thing or two about how to respond to a less-than-optimal launch? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEOmoz Uses Social Media to Launch New SEO Web App"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEOmoz Uses Social Media to Launch New SEO Web App"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Josh Braaten\n          \n            Josh Braaten\n          \n            Josh Braaten"
}