{
  "url": "https://moz.com/blog/seomozs-hiring-frenzy-begins",
  "slug": "seomozs-hiring-frenzy-begins",
  "title": "SEOmoz's Hiring, the Best Resume Ever & An Overdue Link Roundup - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This week we're diving into the hiring game - trying to find the people who will help us make both the free and premium content on the site even more valuable over the weeks and months to come. Jane's in charge of hiring our new customer service / office manager and Jeff's doing double-duty,…",
  "content": "SEOmoz's Hiring, the Best Resume Ever & An Overdue Link Roundup Moz News By: Rand Fishkin September 25, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 25, 2007 SEOmoz's Hiring, the Best Resume Ever & An Overdue Link Roundup Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This week we're diving into the hiring game - trying to find the people who will help us make both the free and premium content on the site even more valuable over the weeks and months to come. Jane's in charge of hiring our new customer service / office manager and Jeff's doing double-duty, seeking out both a web developer and a GUI designer. We've already received one resume that's so incredibly cool, I've just got to share: Brockway Sampson Applies to SEOmoz (for those who aren't aware, Brock is a bodyguard character from the ingenius animated series, the Venture Bros.) Despite the stiff competition, I'd love it if you checked out and shared our open positions on Craigslist (after all, the best people almost always come through community referrals): Dear Exceptionally Talented Admin Rockstars Seeking Web Development Rockstar Seeking User Interface & Web Design Rockstar (yes, yes, we have a pattern of using a particular noun in our hiring posts) On to the link roundup for the last couple weeks! Gary Price notes that Wikipedia may not be the fully open system it is today for much longer. Danny covered Nielsen's Search Engine market share data - I personally think Google is much closer to 70-75% - Loren shows us Hitwise's numbers, which puts them ~65% Aaron Wall has some terrific Link Building Tips based on New Search Filters Donna has a really good question for Adam Lasnik. I'd love to know the answer to that, too :) Sketchcast launched this week - I got to play with it in early beta, and I think I might give it a spin for a Whiteboard Friday sometime soon (need to get a pen input device, first). I'm so envious of Brian Clark and Copyblogger lately - every post & every title is linkbait, but no one seems to give him a hard time about it (maybe I just need thicker skin) :) Rae's got a terrific post on paid links that Google will never spot. Since Fantomaster's triumphant return to blogging, he's had some great posts, including one on Blackhat tactics (from way back in June) and one on defending from DDOS attacks. Alex (aka Shylock) has a great post on white hat link building (I like it mostly for the format) That Adam Guy is offering to answer your questions in Google Groups Speaking of Google Groups - John Mu, webmaster turned Googler, analyzes stats for the forum - cool stuff. I'm one of those geeks who likes to take a peek at where design might be heading, and I think this post actually gets close. Don't worry about me... I'm not busy...also... What great links did I miss? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEOmoz's Hiring, the Best Resume Ever & An Overdue Link Roundup"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEOmoz's Hiring, the Best Resume Ever & An Overdue Link Roundup"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}