{
  "url": "https://moz.com/blog/seomoz-tools-top-pages-on-domain-kick-ass",
  "slug": "seomoz-tools-top-pages-on-domain-kick-ass",
  "title": "SEOmoz Tools - Top Pages on Domain Kick Ass - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The SEOmoz team has been beavering away lately, adding more and more data to Linkscape and chipping away at the coalface of cutting edge R&D with SEOmoz Labs. One of my favourite new toys in the Labs section is “Top pages on domain”.\n\n“Top pages on domain” gives you a page by page analysis of your…",
  "content": "SEOmoz Tools - Top Pages on Domain Kick Ass SEO Tools By: Richard Baxter March 27, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Richard Baxter March 27, 2009 SEOmoz Tools - Top Pages on Domain Kick Ass SEO Tools The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The SEOmoz team has been beavering away lately, adding more and more data to Linkscape and chipping away at the coalface of cutting edge R&D with SEOmoz Labs. One of my favourite new toys in the Labs section is “Top pages on domain”. “Top pages on domain” gives you a page by page analysis of your domain (or someone else’s) ordered by the number of linking route domains: Where this tool really adds value is the ability it gives you to investigate old domains and their previously indexed (and linked to) pages. Take the example above. This old domain is 301 redirecting somewhere else, but the following URL in the list, with another 3 links, leads us to a 404 error page. What we just did in the example is pretty difficult to do with an actual search engine. The problem is with old domains is past a certain point, if a site has been taken down, Google and Yahoo will eventually stop reporting the number of indexed pages with the \"site:\" operator. That’s because eventually, 404 error pages are removed from the their indexes. You don’t know what URLs were previously in the index so your investigation into previously indexed URLs can only go so far. With \"Top Pages On Domain,\" you can easily find old, deep URLs that contain lots of great quality links that aren’t being properly redirected to your site or choose to redirect specific URLs to other regions of your site. Here’s my checklist of 5 things you should be doing with the top pages on domain tool: 1) Run all of your owned domains through the tool. Check for linked to pages that should be redirected, but aren’t. 2) Redirect URLs that have link value to deeper sections of your website for better rankings. 3) Run the tool on your main domain to understand where your highest value URLs are, and gain value by getting internal links from those pages. You might even find a few old but valuable URLs from a legacy version of your site that have no redirects set up! 4) Redirect old / “out of stock” product pages or vacancy pages that have links to newer, more competitive products or jobs. 5) Analyze your competitors strongest URLs, get a list of their back links together and start link building! Enjoy, and have fun with all those redirects ;-) Richard Baxter is Founder and Director of SEOgadget.co.uk, a UK SEO Agency. Follow him on Twitter and Google... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEOmoz Tools - Top Pages on Domain Kick Ass"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEOmoz Tools - Top Pages on Domain Kick Ass"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Richard Baxter\n          \n            Richard Baxter\n          \n            Richard Baxter"
}