{
  "url": "https://moz.com/blog/seomozs-first-video-a-roundtable-discussion-on-wikipedia",
  "slug": "seomozs-first-video-a-roundtable-discussion-on-wikipedia",
  "title": "SEOmoz's First Video - A Roundtable Discussion on Wikipedia - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We recently bought a video camera and played around yesterday with some video shooting. Luckily, Scott, our resident former-Hollywooder, was able to convert the video into something we can put on the blog:\n \n...",
  "content": "SEOmoz's First Video - A Roundtable Discussion on Wikipedia Social Media By: Rand Fishkin January 31, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 31, 2007 SEOmoz's First Video - A Roundtable Discussion on Wikipedia Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. We recently bought a video camera and played around yesterday with some video shooting. Luckily, Scott, our resident former-Hollywooder, was able to convert the video into something we can put on the blog: SEOmoz VidCast 1 - Wikipedia - video powered by Metacafe Since we're completely new to videocasting, we'd love to get your input: What's your opinion of the format? More Mozzers? fewer? Different setup? How do you like the content and discussion? What would you like to see us talk about? Did the video splicing away to photos/screenshots enhance the experience or make it worse? Any good ideas on video editors you recommend? Scott downloaded the sample version of Adobe Premier to make this one (hence the logo). We'd love to try Jumpcut, but for some reason, our videos are hundreds of megs initially so we have to edit them locally. Thanks for your patience with our experimentation - we're looking forward to getting more refined with the video stuff over time. p.s. We did discuss 4 other topics after the Wikipedia set - we might try to put those up in the next few days as Scott finds some time. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEOmoz's First Video - A Roundtable Discussion on Wikipedia"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEOmoz's First Video - A Roundtable Discussion on Wikipedia"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}