{
  "url": "https://moz.com/blog/seomoz-2009-search-spam-pubcon-party",
  "slug": "seomoz-2009-search-spam-pubcon-party",
  "title": "SEOmoz 2009 Search Spam PubCon Party - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This post really doesn't need much of an introduction, so I'll get right down to it. Pubcon is coming! Pubcon is cooommiiinnnnggggg! It seems like the whole industry might just shut down for a week while we take over Las Vegas (I hope they're ready for us). This would probably be a great time for…",
  "content": "SEOmoz 2009 Search Spam PubCon Party SEO Events By: Jennifer Sable Lopez November 5, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jennifer Sable Lopez November 5, 2009 SEOmoz 2009 Search Spam PubCon Party SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This post really doesn't need much of an introduction, so I'll get right down to it. Pubcon is coming! Pubcon is cooommiiinnnnggggg! It seems like the whole industry might just shut down for a week while we take over Las Vegas (I hope they're ready for us). This would probably be a great time for spammers to come in and take over our SERPs since we'll be busy in sessions, going to parties, meeting new people... and gambling (DUDE! It's Vegas). SEOmoz will be representing in full force this year. Although we don't have a booth, you'll find us lurking in all corners of the event. Here's a quick lowdown on who will be attending from the moz crew: Photo Courtesy of Dana Lookadoo Danny - Say \"Danny Dover\" ten times fast. What?! It's funny. Really. (ok I'm tired) Scott - He's coming out from behind the camera! Adam - Ping him if you're interested in user testing some of our new products! Jen - Holla! Arden - You'll recognize him by being the friendly one (unlike the rest of us meanies) Rand - You know, that guy who always wears those funny yellow shoes Gillian - She arrives just in time from her worldwide SEO tour Pete - As in Dr. Pete, apparently people only know him by that name. :) Speaking of Dr. Pete, don't forget to check out his post 7 Tips for Surviving PubCon to help you make it through the week. Party Party Party! I know I know, quit blabbing and get to the good stuff. SEOmoz will be hosting the 3rd Annual Search Spam / Werewolf party on Tuesday night. Tickets are unfortunately limited to 200 people and are for SEOmoz Pro members plus guests, so be sure to RSVP right away before they're gone! Here are the details: Date: Tuesday, November 10, 2009 Time: 7-9pm Location: Wynn Hotel - Chambertin Room Drinks: 1 free drink ticket per person, cash bar after that This is a great way to meet other people from the community in a fun, laid back environment. There's nothing better than meeting Matt Cutts for the first time while sitting at a table, cursing him, during a vocal game of Werewolf. Remember that if you attend you get your own deck of Werewolf cards with 25 well known Search Marketing peeps. Oh! And check this out, this year we have an ALL NEW deck of Search Spam cards. That's right people, those old cards are now collectors items and you can probably sell them on eBay for millions of dollars. Heh... ok probably not, but if you do I'd like a percentage of the profit. :D Cindy Krum, Todd Friesen and Chris Winfield are on the deck this year. There's also a mystery coupon! Who knows, you could be the new Gracious Granter of Re-Inclusion or one of the dubious Black Hats. Perhaps you're more on the white side of things? Hmmmm could you be in the deck? The only way to find out is to actually come to the party and get your own deck! If you're not in the deck, you could always have fun with it and try to get people's signatures on their cards. I actually did that last year and found it to be a good way to find a reason to talk to the \"celebrities\" :) (ya do what you gotta do). Werewolf Game So what IS this Werewolf game I'm talking about? Well you can find the description & rules here, plus I found this great quote from Ian Kennedy about the game back in 2007: Werewolf (also known as Mafia) is a great parlor game in which players try and figure out the good guys from the bad guys relying on your ability to read the body language of other players to determine who is telling the truth and who is lying while keeping your role and identity hidden from others. Because the game inspires psychological tactics and gaming, it’s the perfect way for a room full of SEO experts and search engine engineers to unwind after a full day of conference sessions here at Webmaster World in Las Vegas. - Ian Kennedy (everwas.com) Last year I played the game for the first time. It took me a while to warm up to playing, but once I did I had a great time! I met a bunch of new people, and who knows maybe it even helped me to get this job! (I played Matt Cutts QUITE well I should add). I can say from experience that I was glad I didn't miss this party, and I can't wait to play again this year. Be sure to sign up soon as the space is limited! We don't want you to miss out and not get to see who else is in the deck. It could be YOU! (Yep, I'm in the deck and it says \"Jenny from the C-Block\" heh) The moz party is happening before the PubCon Palazzo Lavo Nightclub Party, be sure to also RSVP for that as well. Don't forget to check out the PubCon blog to get information on all the PubCon parties going on. Please remember to say hello if you see any of us! But whatever you do, RSVP for the Search Spam party ASAP. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEOmoz 2009 Search Spam PubCon Party"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEOmoz 2009 Search Spam PubCon Party"
    },
    {
      "level": "H2",
      "text": "Party Party Party!"
    },
    {
      "level": "H2",
      "text": "Werewolf Game"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez"
}