{
  "url": "https://moz.com/blog/seomoz-and-wired-magazine",
  "slug": "seomoz-and-wired-magazine",
  "title": "SEOmoz and Wired Magazine - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As several of my close associates know, SEOmoz was to be featured in the January issue of Wired Magazine (which hits newsstands around Dec. 19). In October, Brad St...",
  "content": "SEOmoz and Wired Magazine Moz News By: Rand Fishkin November 28, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 28, 2005 SEOmoz and Wired Magazine Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As several of my close associates know, SEOmoz was to be featured in the January issue of Wired Magazine (which hits newsstands around Dec. 19). In October, Brad Stone (who usually writes for Newsweek) flew up from San Francisco to interview me and tour our offices. Two weeks ago, the talented and very friendly Gabriela Hasbun flew up to take photos of the crew here. However, today I heard from Brad that Wired's chief editor, Chris Anderson (whose Long Tail blog I've written about in the past) nixed the piece at the last second. While my staff is distraught, I'm relatively positive. I think the experience was invaluable - being professionally interviewed and written about is no small amount of work. I'm certain it will help to have this under my belt for the next time the press turns their attention our way. To all of you in the SEO sphere whom I told to buy the next issue of Wired, Sorry! You can still buy it, but you won't see any yellow shoes featured or mentions of SES conferences. Hopefully our next piece of press will make it all the way. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEOmoz and Wired Magazine"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEOmoz and Wired Magazine"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}