{
  "url": "https://moz.com/blog/seos-and-social-networks-algorithms",
  "slug": "seos-and-social-networks-algorithms",
  "title": "Should SEOs & Content Marketers Play to the Social Networks' \"Stay-On-Our-Site\" Algorithms? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Increasingly, social networks are tweaking their algorithms to favor content that remains on their site, rather than send users to an outside source. This spells trouble for those trying to drive traffic and visitors to external pages, but what's an SEO or content marketer to do? This edition of…",
  "content": "Should SEOs & Content Marketers Play to the Social Networks' \"Stay-On-Our-Site\" Algorithms? Social Media | Whiteboard Friday | Content Marketing By: Rand Fishkin January 19, 2018 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 19, 2018 Should SEOs & Content Marketers Play to the Social Networks' \"Stay-On-Our-Site\" Algorithms? Social Media | Whiteboard Friday | Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Increasingly, social networks are tweaking their algorithms to favor content that remains on their site, rather than send users to an outside source. This spells trouble for those trying to drive traffic and visitors to external pages, but what's an SEO or content marketer to do? Do you swim with the current, putting all your efforts toward placating the social network algos, or do you go against it and continue to promote your own content? This edition of Whiteboard Friday goes into detail on the pros and cons of each approach, then gives Rand's recommendations on how to balance your efforts going forward. Click on the whiteboard image above to open a high-resolution version in a new tab! &amp;amp;lt;span id=\"selection-marker-1\" class=\"redactor-selection-marker\"&amp;amp;gt;&amp;amp;lt;/span&amp;amp;gt;Video TranscriptionHowdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week we're chatting about whether SEOs and content marketers, for that matter, should play to what the social networks are developing in their visibility and engagement algorithms, or whether we should say, \"No. You know what? Forget about what you guys are doing. We're going to try and do things on social networks that benefit us.\" I'll show you what I'm talking about. FacebookIf you're using Facebook and you're posting content to it, Facebook generally tends to frown upon and lower the average visibility and ability of content to reach its audience on Facebook if it includes an external link. So, on average, posts that include an external link will fare more poorly in Facebooks' news feed algorithm than on-site content, exclusively content that lives on Facebook. For example, if you see this video promoted on Facebook.com/Moz or Facebook.com/RandFishkin, it will do more poorly than if Moz and I had promoted a Facebook native video of Whiteboard Friday. But we don't want that. We want people to come visit our site and subscribe to Whiteboard Friday here and not stay on Facebook where we only reach 1 out of every 50 or 100 people who might subscribe to our page. So it's clearly in our interest to do this, but Facebook wants to keep you on Facebook's website, because then they can do the most advertising and targeting to you and get the most time on site from you. That's their business, right? TwitterThe same thing is true of Twitter. So it tends to be the case that links off Twitter fare more poorly. Now, I am not 100% sure in Twitter's case whether this is algorithmic or user-driven. I suspect it's a little of both, that Twitter will promote or make most visible to you when you log in to Twitter the posts that have been made or the tweets that have been made that are self-contained. They live entirely on Twitter. They might contain a bunch of different stuff, a poll or images or be a thread. But links off Twitter will be dampened. InstagramThe same thing is true on Instagram. Well, on Instagram, they're kind of the worst. They don't allow links at all. The only thing you can do is a link in profile. More engaging content on Instagram, as of just a couple weeks ago, more engaging content equals higher placement in the feed. In fact, Instagram has now just come out and said that they will show you content posts from people you're not following but that they think will be engaging to you, which gives influential Instagram accounts that get lots of engagement an additional benefit, but kind of hurts everyone else that you're normally following on the network. LinkedInLinkedIn, LinkedIn's algorithm includes extra visibility in the feed for self-contained post content, which is why you see a lot of these posts of, \"Oh, here's all the crazy amounts of work I did and what my experience was like building this or doing that.\" If it's a self-contained, sort of blog post-style content in LinkedIn that does not link out, it will do much better than posts that contain an external link, which LinkedIn sort of dampens in their visibility algorithm for their feed. Play to the algos?So all of these sites have these components of their algorithm that basically reward you if you are willing to play to their algos, meaning you keep all of the content on their sites and platform, their stuff, not yours. You essentially play to what they're trying to achieve, which is more time on site for them, more engagement for them, less people going away to other places. You refuse or you don't link out, so no external linking to other places. You maintain sort of what I call a high signal to noise ratio, so that rather than sharing all the things you might want to share, you only share posts that you can count on having relatively high engagement. That track record is something that sticks with you on most of these networks. Facebook, for example, if I have posts that do well, many in a row, I will get more visibility for my next one. If my last couple of posts have performed poorly on Facebook, my next one will be dampened. You sort of get a string or get on a roll with these networks. Same thing is true on Twitter, by the way. $#@! the algos, serve your own site?Or you say, \"Forget you\" to the algorithms and serve your own site instead, which means you use the networks to tease content, like, \"Here's this exciting, interesting thing. If you want the whole story or you want to watch full video or see all the graphs and charts or whatever it is, you need to come to our website where we host the full content.\" You link externally so that you're driving traffic back to the properties that you own and control, and you have to be willing to promote some potentially promotional content, in order to earn value from these social networks, even if that means slightly lower engagement or less of that get-on-a-roll reputation. My recommendationThe recommendation that I have for SEOs and content marketers is I think we need to balance this. But if I had to, I would tilt it in favor of your site. Social networks, I know it doesn't seem this way, but social networks come and go in popularity, and they change the way that they work. So investing very heavily in Facebook six or seven years ago might have made a ton of sense for a business. Today, a lot of those investments have been shown to have very little impact, because instead of reaching 20 or 30 out of 100 of your followers, you're reaching 1 or 2. So you've lost an order of magnitude of reach on there. The same thing has been true generally on Twitter, on LinkedIn, and on Instagram. So I really urge you to tilt slightly to your own site. Owned channels are your website, your email, where you have the email addresses of the people there. I would rather have an email or a loyal visitor or an RSS subscriber than I would 100 times as many Twitter followers, because the engagement you can get and the value that you can get as a business or as an organization is just much higher. Just don't ignore how these algorithms work. If you can, I would urge you to sometimes get on those rolls so that you can grow your awareness and reach by playing to these algorithms. So, essentially, while I'm urging you to tilt slightly this way, I'm also suggesting that occasionally you should use what you know about how these algorithms work in order to grow and accelerate your growth of followers and reach on these networks so that you can then get more benefit of driving those people back to your site. You've got to play both sides, I think, today in order to have success with the social networks' current reach and visibility algorithms. All right, everyone, look forward to your comments. We'll see you again next week for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Should SEOs & Content Marketers Play to the Social Networks' \"Stay-On-Our-Site\" Algorithms?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Should SEOs & Content Marketers Play to the Social Networks' \"Stay-On-Our-Site\" Algorithms?"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H3",
      "text": "Facebook"
    },
    {
      "level": "H3",
      "text": "Twitter"
    },
    {
      "level": "H3",
      "text": "Instagram"
    },
    {
      "level": "H3",
      "text": "LinkedIn"
    },
    {
      "level": "H2",
      "text": "Play to the algos?"
    },
    {
      "level": "H2",
      "text": "$#@! the algos, serve your own site?"
    },
    {
      "level": "H2",
      "text": "My recommendation"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}