{
  "url": "https://moz.com/blog/seos-and-content-working-together-whiteboard-friday",
  "slug": "seos-and-content-working-together-whiteboard-friday",
  "title": "How SEOs and Content Writers Can Work Better Together — Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Learn all about how SEOs and content writers can work better together. By working more closely and more effectively, you can create great content that ultimately converts and drives traffic.",
  "content": "How SEOs and Content Writers Can Work Better Together — Whiteboard Friday Whiteboard Friday | Content Marketing By: Helen Pollitt July 14, 2023 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Helen Pollitt July 14, 2023 How SEOs and Content Writers Can Work Better Together — Whiteboard Friday Whiteboard Friday | Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Edited by Emilie Martin This is part two of a three-part series of Whiteboard Fridays with Helen Pollitt on how to work better with folks within your company. Check out the first episode on 'How SEOs and Developers Can Work Better Together' and the last episode on 'How SEOs and UX Designers Can Work Better Together'. Learn all about how SEOs and content writers can work better together. By working more closely and more effectively, you can create great content that ultimately converts and drives traffic. Click on the whiteboard image above to open a high resolution version in a new tab! Video Transcription Hello, I'm Helen, head of SEO at Car & Classic, and today we're looking at how SEOs and content writers can work better together. \"SEO copy,\" it's one of the worst phrases that you can possibly hear in any office environment alongside, \"Oh, the website? Yeah, we migrated that last week.\" Or, \"I'm really sorry, but the coffee machine is broken. Will instant do?\" The reason that \"SEO copy\" is such a terrible phrase is because it just makes the content writers think that all we're after is a bunch of words to be put on a page for the sake of a robot and not a human visitor. As SEOs, we'll flatly deny that that's the reason that we want content on a page because it's against Google's guidelines, isn't it? But hands up if you have ever just thrown a bunch of keywords at a copywriter, wished them well, and then slunk off back to your Core Web Vitals audit. But really, we need our content writers to feel respected and empowered to be their brilliant, creative selves because at the end of the day, we know that it's really important for good content, for our users and for the search engines. So how can we go about making our content writers understand why we need content on the page for SEO purposes, but also why that shouldn't be limiting their creativity? I think we've got a bit of a work to do, and also, at the same time, maybe we can just ban \"SEO copy\" from our vocabulary. So where do we start? How to create good briefs Well, first off, really we need to be looking at how we can create good briefs. So start off by really thinking about what is the purpose of the page, and no, it's not so that Google really likes your website. That is not the purpose of the page. You need to reinforce that to the copywriters that actually the reason for this page is because we want conversions, or actually we want to inform and educate about something, or we want to enlighten and engage for some reason. But there should be a reason behind that page, and it shouldn't just be so that Google thinks it's highly relevant for a search phrase and lands more organic traffic on it. Next up, we need to think about what the key message is, and we really have to communicate this to the content writers so, again, they understand the full purpose of the page. What is it that you want readers to go away with? Because essentially that's the key message that the search engines will go away with as well when they're looking at the relevancy of the page. Also, start talking about things like keyword clusters and try and move content writers away from thinking that SEO means shoving one particular keyword onto a page just over and over again and trying to make it look natural. But actually, we look at more of a total topical relevancy for a page, and we're looking at things like keyword clusters. So what are the synonyms? What are the other high-trafficked keywords? What is it that you are wanting your reader to really engage with on that page? Because if they've searched for it and landed on the page and seen it on the page, that's going to help them understand that page is relevant for them. So try to communicate that to your content writers, but also relieve them of that fear that it's got to be formulaic and there's some kind of formula for how often you need a keyword to appear and all that kind of garbage that we've probably all grown up on. Really, it's a case of trying to undo some wrong thinking. So content writers have probably heard from other SEOs or they've misunderstood some stuff that they've been told in the past that means that their approach to writing, when an SEO is involved, is different if they were just left to get on with it themselves. We kind of don't want that to be the case. We want them to be empowered and given data to help them with their writing, but not really limited by us as SEOs. Train content writers in the ways of SEO What we need to do is try and train them in the ways of SEO and how it actually complements the work they're doing and doesn't detract from it. So things like how search works. Have you ever actually tried to talk to your content writers about how search works and not just how you should put keywords on a page and page relevancy and all that kind of stuff, but actually the real broad, top level about how search engines understand pages, how they crawl them, all that kind of stuff? Give them the context so that they can understand what their part is within the whole ecosphere of making a website really good for search. Look at things like the importance of relevancy. So no, it's not just about keywords and keyword density and all of that kind of stuff, but it's about making that entire page sing about a particular topic, but whilst also understanding the intent behind a person who's landing on that page and making sure that it is relevant to them. Give them access to keyword research tools and actually give them a bit of training in how to use them so they can do a little bit of research themselves, because it will probably help them to really understand the topic more if they're given access to the kind of data around what people are looking for when they are landing on that particular page. It just helps to inform them about the style, the tone, what sort of things they might like to include on the page. So don't just tell them what those things are, but actually give them the access to the data themselves so they can do a bit of extra research for you. Give them an idea of how to identify what search intent is. So suggest that they maybe want to have a bit of a search around Google themselves so they can understand a little bit about what is ranking on the SERPs already and what kind of content it is. Is it informational? Is it commercial? What is already ranking in the search engines so that they can take that information and try to use it to inform their own writing. This is the big one, EE, EE, EEAT. I'm just future-proofing the video in case Google adds some more Es before it gets published. EE E-E-A-T is really important for writers because they need to understand that actually their writing style really impacts how the search engines, in particular Google, are going to understand the experience, the expertise, the authoritativeness, and the trustworthiness of the website. It's all about what they are saying and who they are themselves as writers. That's really important. Hopefully, that kind of information, that enlightening will really empower the content writers to see how important their work is for the success of your organic traffic. AI, most content writers I've come across are either really excited about how AI is going to help them with their work, or slightly terrified that it's going to take their jobs. So let's not shy away from it. Let's start those discussions now. Let's talk about how to use AI well within content writing and the sorts of things that we need to avoid so that we don't end up with our content writers trying to pass off a load of AI-generated work as their own, but that they're also not completely afraid of using AI where it's appropriate. So how can they use it well, and what kind of safeguards do we need to put in place to make sure that they're not overly reliant on AI to a detrimental way? Look at editorial and user-generated content So we also need to look at editorial and user-generated content. Now, this is going to have a big impact on EEAT because, let's be honest, it's all about people's opinions, it's all about their experience of something, their knowledge, and their authority in the subject. Editorial is great for that because it's a place where people, that your content writers can really go to show off their knowledge and their expertise about your product or your service or your industry. That's great for demonstrating EEAT. User-generated content, on the other hand, has a similar impact in that it can really demonstrate the relevancy of a page to the topic that people are searching for. It can give other opinions and experiences. Reviews, for example, that's great. That's a great sign of EEAT because it's showing people's experience of your actual product or service. But people on the internet aren't always incredibly well-behaved. Just fire up your social media platform of choice and just take a bit of a scroll. People can't always be trusted with the things that they are saying on your website. So you do need to have some moderation and guides in place. So moderation can be that actually your content team are really informed about how to respond to negative reviews or they are given the equipment to be able to moderate comments in any kind of comment section that you have on the website, but they just need to know about the risks and rewards of having user- generated content on the website. Maybe some guides. Maybe some guides for people who are adding that content to your website, so the users themselves. Give them some tips about how if they are adding a question to a forum, they can write that question in a way that's likely to get more organic visibility and therefore more answers for them. So you can actually help teach your users how best to write for the web through those kind of prompts and guides that you're putting in your user- generated sections. Get buy-in from your content writing team Finally, you want to get buy-in from your content writing team. You want them to see that actually you should be working really closely together. So let's start by just dismissing the idea of SEO copy entirely. It's not about the bots, because if you're writing copy for the bots and people land on your website because you've made it really relevant to the search engines, they're there because they want information or they want to be able to do something. So that copy really has to meet their needs first, because otherwise, what's the point of sending traffic to that page? So this kind of concept has to be really communicated to your content writers, because they've probably been told that actually copy written for the purposes of search is really boring, formulaic, and just full of keywords. So we need to kind of dispel that myth. But it is really good to help them to understand what sort of copy does need a little bit of SEO input. So not all of the words on a website need an SEO to look over them and optimize them. Your terms and conditions probably don't need to be looked at by an SEO. Your directions to the office probably don't need to be looked at by an SEO. But your landing pages, your core content, your guides, and your how-tos, they do probably need to have at least a passing glance from an SEO who can say, \"Actually, this kind of content is really important for us. We'd love to work closely with you on it.\" Or, \"Actually, this stuff isn't as important for our purposes. We don't really need to collaborate with you on it.\" But helping your content writers to know when you do want to be involved and you don't need to be involved will help their processes. Try to give them a bit of an overview as to the impact of their work. Give them data. Show them how their work has had an impact on your organic rankings or your traffic or conversion rates even. Now, a lot of content writers don't necessarily have a digital marketing background, so they might not be familiar with how to use things like Google Analytics or Adobe Analytics or other tracking and measurement tools. But why don't you be a pal and make them a little dashboard so that they can see how their latest article performed or how the landing page tweaks that they've made have actually impacted conversion? Give them that information so that they can see that the work they're doing is really paying off in a big way and they don't feel so siloed from the rest of the company. SEO should empower content writers. It should give them more data. It should give them more insights into users. It should give them the tools they need to make really informing, engaging, brilliant content. So let's remind them of that and help them to see that. That allows us to work a lot closer with them and hopefully end up with some really good content that converts and drives traffic. I really want a coffee now I've said all of that. Thanks for listening. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How SEOs and Content Writers Can Work Better Together — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How SEOs and Content Writers Can Work Better Together — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "How to create good briefs"
    },
    {
      "level": "H2",
      "text": "Train content writers in the ways of SEO"
    },
    {
      "level": "H2",
      "text": "Look at editorial and user-generated content"
    },
    {
      "level": "H2",
      "text": "Get buy-in from your content writing team"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    }
  ],
  "author": "Helen Pollitt\n          \n            Helen Pollitt\n          \n            Helen Pollitt"
}