{
  "url": "https://moz.com/blog/seos-grim-reaper",
  "slug": "seos-grim-reaper",
  "title": "SEO's Grim Reaper - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Threadwatch has a terrific (though poorly titled) thread (hats my arse) today on the demise of SEO. There are intelligent opinions from both sides, primarily in the comments on Nick's somewhat over-the-top post - a response to a ...",
  "content": "SEO's Grim Reaper Public Relations By: Rand Fishkin July 4, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 4, 2005 SEO's Grim Reaper Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Threadwatch has a terrific (though poorly titled) thread (hats my arse) today on the demise of SEO. There are intelligent opinions from both sides, primarily in the comments on Nick's somewhat over-the-top post - a response to a thread he noticed at SEW. The liklihood of SEO's demise or decline are, in my opinion, very small for at least the next 3-5 years. Many seem to think that SEO is about keyword stuffing or hackneyed link buying, but for those who continue to optimize through content, marketing and awareness campaigns, SEO will continue as long as the web itself. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO's Grim Reaper"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SEO's Grim Reaper"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}