{
  "url": "https://moz.com/blog/separating-the-linkbait-wheat-from-the-chaff",
  "slug": "separating-the-linkbait-wheat-from-the-chaff",
  "title": "Separating the Linkbait Wheat from the Chaff - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Last week in Whiteboard Friday: Why Your Viral Content Isn't Working, I covered the importance of creating content that goes beyond just reaching the top of social media portals into the realm of attracting coveted high value links as well. Today, as promised, I'll share the big separations between…",
  "content": "Separating the Linkbait Wheat from the Chaff Social Media By: Rand Fishkin January 7, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 7, 2008 Separating the Linkbait Wheat from the Chaff Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Last week in Whiteboard Friday: Why Your Viral Content Isn't Working, I covered the importance of creating content that goes beyond just reaching the top of social media portals into the realm of attracting coveted high value links as well. Today, as promised, I'll share the big separations between the two and some tactics to implement when launching viral content with the intention of link acquisition. First off, a Venn Diagram (credit to Mystery Guest for the concept on this): You can see in the purple section, at the intersection of viral success (from reaching the top of Digg, Del.icio.us, Reddit, StumbleUpon, etc) and link attraction, I've placed the desired result - a successful linkbait campaign. In the Fall of 2006, SEOmoz conducted some research analyzing the amount of links earned by content that went popular on the major social media portals (everything from Digg to Slashdot to TechCrunch). Unsurprisingly, we saw that a significant amount of the successful content on those sites attracted only a small number of legitimate links (a few dozen to a couple hundred), while a smaller group would attract thousands, or even tens of thousands. Common Characteristics of Content that Earns Social Media Votes, But Doesn't Get Links: Shallow Humor Funny can definitely get you to the top of Digg, but it often won't carry you much further, particularly if the laugh is only enough for a \"ha\" (think Edna Krabappel) and not enough to inspire sharing. Simplistic Observations Even with an insightful bit of writing, it can be hard to attract links if the content is surface-level and carries no depth. Reinforcing Stereotypes or Beliefs It's fun and easy to create content that reinforces what everyone else is saying. Another comic making fun of Microsoft might hit the Digg popular page, but it's unlikely to draw the links you might want unless it has some other standout qualities. Low Value Lists & Amalgamation Posts These are probably the most common kinds of posts I see on the social media sites, especially Sphinn (in the SEO field) and Del.icio.us/Popular (in the developer world). Grab a few friends, get a little boost, and everyone will vote up your CSS Rounded Corners technique. Whether you'll get long term value and links is another matter. Niche-Pandering If you're aware that a particular sect of followers has a powerful influence on a site's content (Wii fanboys at Digg or Ron Paulites at Reddit), you can take advantage of that by authoring materials geared towards those audiences. Unfortunately, even if you do get on the front page, you might not earn the links you're hoping for unless you've authored something truly new or brilliant on the subject. Weak Signal to Noise Ratio Plenty of the content on social news sites has great shock value and drives clicks, but once it's time to convert those views into links, you'll need substance over pure style and rhetoric. Drive-By Images/Video As with the weak signal-to-noise ratio, many pictures and videos that find their way into the popular content have little to no chance of attracting additional interest after that first view. Market Saturation If the social portal(s) you're targeting have users that already read 99% of the material you write, you might not be getting any additional value from having one more story make the front page. Extremely Short-Form Content While there's a decent amount of short-form content that makes it on the portals, much of it gets passed over when it comes time for links. Linkers need something they want to share or something that's incited passion or critical thinking - short-form content is often consumed fast, browsed away from quickly, and forgotten before they've clicked the next item. Highly Negative/Inflammatory Content This can go either way, as some negative material gets an inordinate amount of attention. However, be cautious about how you do it - if you're negative and pandering and shallow, there's a good chance your linkbait won't earn you much besides a high bandwidth cost. Beating the Dead Horse Some content has been seen one too many times. Repeating the same tired list or showing a collection of images, videos, links, or other material that's already made its way around the web might get you a few more page views, but the Linkerati are a smart bunch, and they've often been around the web more than the average reader. Extremely Temporal News News items can attract lots of links, but if the material's old within 12-24 hours, don't expect the links to come racing in. This is why coverage of emerging events can be dangerous, as the post that only tells part of the story as fast as possible could be passed over when the whole story comes out. Inaccurate or Misleading Material If a piece is obviously incorrect, readers and voters might not catch it, but most linkerati are smarter and will investigate before they post (and even if they do link to it, will frequently use nofollow to indicate their distaste). Lost in the Echo Chamber If a blog post or content piece is simply writing the same story that's been bandied about dozens of times or covering a subject that everyone in the niche thinks they've covered already (or covered better), linkers may be particularly stingy. Recent Examples: Tech Solutions Your Small Biz Can't Use - Not only is it a low value list, it's also obviously inaccurate and misleading. As of today, Yahoo! only reports 6 links (3 are spam, the other 3 are nofollowed). SEOmoz's 2007 Site Stats - Considering how big our previous reporting on stats have been, you might expect that we'd once again earn lots of links with this release, but no. Yahoo! reports 17 links, of which more than half are spam (and several other are nofollowed). What happened? We're lost in the echo chamber and we're saturating the market - even though the post reached the top of Sphinn, SEOmoz has such an overlap with the linkerati who read Sphinn that it probably attracted very few new readers. List of Social Networking Sites in Education - Although this list of great value (I even put it in the premium tips section here at SEOmoz), the content is very long-form, very niche and, for most readers, is going to have low value. Thus, Yahoo! shows it's only got 29 links (many of which are low quality or nofollowed). Photo of Digg Accuracy - It's funny, but it's niche-pandering and very forgettable content, so even though it was on top of several social portals and even on the most Dugg list for the past 30 days, Yahoo! only shows 65 links (and not many of those are followed). Common Characteristics of Content that Earns Links, But Doesn't Always Make It on Social Portals: Duplicate Content When posting material that's already been released elsewhere, you can have some success earning links from the population who hasn't previously seen it, but it can be tough to get onto the major social portals where savvy bury-ers will shout \"dupe\" from the top of their keyboards. In-Depth Research A terrific source of links, complex research is also tough to consume quickly, and therefore isn't well suited to the \"don't Digg it if you can't understand it in 4 seconds\" crowds. Interviews They're good sources of information and insight, but they rarely appear on the social portals these days. Summaries or \"important\" quotes can help an interview stand out to the social crowds, but those votes can be tough to come by. Complex News Analysis As with in-depth research, a complex look at the news will, tragically, often earn fewer links than a shorter, punchier piece of coverage. Anyone who watches the major news outlets in the US can see this phenomenon in action on a daily basis. Tragic? Yes. Avoidable? Not really. Segments of a Larger Content Piece When content gets broken into multiple pages and pieces, linkers may find the relevant portion and reference it, but social voters don't have the attention span to focus and will frequently abandon prior to finding the value. Community-Focused Material If you're pandering or even speaking to an audience that doesn't consistently participate at the portal you're targeting, you'll have a very tough time earning the necessary votes. Recent Examples: Comparing Search Popularity Services - this post from Danny brilliantly covered the differences in the major services showing search market share percentages, and while it didn't make the social news sites (probably due to being so in-depth and targeted), it earned 450+ links. How to Order Wine Without Looking Like an Asshole - I suspect this actually did get some good social traffic through StumbleUpon, but it perfectly exemplifies an in-depth, niche-focused (but broadly interesting) post. The subject matter isn't social crowd-focused enough, but the list format is near perfect and it's earned those 5,000+ links. Maybe I should submit it to Digg... (UPDATE: Oops! It did make Digg a couple years back, although it wasn't very popular there) Why to Not Not Start a Startup - Paul Graham has very community-focused and in-depth material, and although some of his essays do make it onto sites like Techmeme (and of course, they all go to Hacker News), this one earned its 2200 links without the benefit of a major social media push. Interview with Sep Jemvar on Personalization - A perfect example of how even though the material's great, the interview format somehow prohibits social media success. Thankfully, it still managed to earn several hundred links. Armed with this knowledge, you should be able to dodge a good number of pitfalls in your viral marketing campaigns, and I suspect that will give you a big leg up in your quest for simultaneous social media and link-earning success. As a next installment, I'll cover why the search engines will have a vested interest in continuing to reward viral marketing campaigns (as there's been some debate around this subject in the recent past). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Separating the Linkbait Wheat from the Chaff"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Separating the Linkbait Wheat from the Chaff"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}