{
  "url": "https://moz.com/blog/serious-sandbox-theories",
  "slug": "serious-sandbox-theories",
  "title": "Serious Sandbox Theories - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "An impressive thread, started by yours truly at SEOChat - Sandbox just a Google-Only Algorithm Piece? has initiated some of the best high-level discussion on Google's unique filter in recent times. A great variety of SEO theorists...",
  "content": "Serious Sandbox Theories Blogging By: Rand Fishkin January 15, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 15, 2005 Serious Sandbox Theories Blogging The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. An impressive thread, started by yours truly at SEOChat - Sandbox just a Google-Only Algorithm Piece? has initiated some of the best high-level discussion on Google's unique filter in recent times. A great variety of SEO theorists, practioner and others who have direct experience on the subject have weighed in with theories both plausible and kooky to try to answer the filter's source.The thread covers more than a dozen unique theories on why the sandbox exists and what the algorithmic piece behind it is. I've compiled a current list of ideas brought up: Site Structure & Topic Organization - The internal structure of a website's categories & topic drill-downs influence are more strongly scrutinized by Google Non-Commercial Backlinks - Google prefers backlinks that come from .edu, .gov and other TLDs unavailable to the commercial web Click-through Data - Google measures click-through metrics on the SERPs and ranks poorly clicked-to sites lower Deeplink Percentage - Google views a high ratio of links to internal pages as a sign of organic linkage and gives sites a boost based on this Hilltop Hubs - Google only ranks sites well if they are linked to by the 'hubs' of the industry, as per the Hilltop Algorithm theory Domain Diversity - The range of sites across unique IP C-Blocks linking to a site influences rankings positively if it's diverse, negatively if it's narrow Age of Site - The classic sandbox theory that a site's age figures into its ability to rank, with a preference for older sites at Google Age of Incoming Links - As links age, they become more important and more weighted in Google's eyes Poison Links - When certain spam sites link to you, Google penalizes Visitor Metrics - Google uses the toolbar to measure how long users spend on a particular site and reward/penalize based on long/short visit lengths Validity of Links - Google uses advanced/unknown methodologies to sniff out 'fake' or SEO built links rather than organic links Money Keywords - The sandbox is a filter applied only to competitive or lucrative keyword phrases in an effort to combat spamHopefully, even more great theories will arise from this thread. Testing for all of these would be nearly impossible, but SEOmoz is working towards some advanced measurement tools that should go a long way towards understanding Google's unique algorithm element (or elements). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Serious Sandbox Theories"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Serious Sandbox Theories"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}