{
  "url": "https://moz.com/blog/serps-guide-content-whiteboard-friday",
  "slug": "serps-guide-content-whiteboard-friday",
  "title": "How the SERPs Guide Content — Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "How the SERPs Guide Content — Whiteboard Friday",
  "content": "How the SERPs Guide Content — Whiteboard Friday Content Marketing | Search Engines By: Julia-Carolin Zeng Edited By: Emilie Martin March 15, 2024 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Julia-Carolin Zeng Edited By: Emilie Martin March 15, 2024 How the SERPs Guide Content — Whiteboard Friday Content Marketing | Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. From videos to featured snippets, discover how SERPs can help us with our content creation in this Whiteboard Friday with Julia-Carolin Zeng. Click on the whiteboard image above to open a high-resolution version in a new tab! Hi, I'm Julia, and I'm going to talk to you today about how the SERPs can actually help us with our content creation, so how the SERPs guide content. SERPs is short for ‘Search Engine Results Page.’ You see here some really nice Google search results. We have our query box at the top. This is where the keyword goes in. Then we see some standard features that keep coming up more and more in Google. It seems as if Google search results are becoming more colorful, more visual these days, and in my opinion, it's only the beginning. Google is doing more of that in the next few years, and so it's important for us, as SEOs, that we know how to make use of these features that we see here, and it can give us a lot of good insights for our content creation. So now let's assume you've identified your main keyword or your topic that you want to create content for, for your website, and before you start creating any content, put that into Google and see what's coming up. Video results We see here, in the first bit, a full list of video results in Google. So really, imagine the whole first page of Google is full of videos. You have the little thumbnail next to it, then a title, where it is hosted, in this case, YouTube, which is in most cases, and the date when that video was published. Now this happens quite often for how-to queries. So how to clean this or that in the house, how to edit a photo or a video, you see this. If this comes up for your keyword, it means you should create videos. Don't start writing long-form content. Create a video to be competitive for this type of search result. Image results Next up, we have images, and here, a few different things are happening on the search results. We might see some little tiles of images. They all can have a different size. There's no clear structure or guideline. Sometimes it looks a bit inspirational, almost like Pinterest type content. What it means for you, if you see something like this, is that the content you create for your topic should contain images, and of course, those images need to be relevant to the content you're writing. Now what I also see more and more coming up in the Google search results is like what we would say standard, old-school search results, with a title tag and a meta description. Then next to it, to the right side, we have a little thumbnail image. I see this very often when it's about content for travel destinations, for example. So imagine this here was an image of a beautiful beach with palm trees somewhere in the Caribbean. Now it is important when you create your content, that this image again needs to be relevant to the content that you're writing, and you also want to give Google some hints that say, yes, this image is actually relevant. It fits this content. It's not a random beach. It is that same beach that I'm talking about in my text. So, in this case, what we would do, is give it an alt text, the image file name, an image description, and mention the name of that particular beach. Don't just say here's a beach. Google can see that on its own. It doesn't need your information for that. But give it a name. Featured snippets Next up, we have featured snippets, and featured snippets have been around for a few years now. We've seen them change a bit over time. What I noticed recently, especially for very informational queries, almost like concepts that you're trying to explain in a scholarly way, I would say, is that you get that featured snippet kind of cut in half. We have here on one side a bit of text, and you see we've highlighted here, in orange, there is a bit of content that is emphasized by Google. Then next to it are some images. Again, there can be beaches, like we talked about. But it also is often now graphs, diagrams, infographics; very visual explanations. What it means for you if you on your page are explaining a really complicated concept, use these things to make it also easier for the reader to understand this concept that you're explaining. Google is telling you, in this case, hey, with this content, there really should be an infographic or a diagram or something like that. People also ask Last, but not least, the people also ask. We see it now in almost all search results. I have not seen one in a very long time that didn't have the people also ask box. It is just a matter of where it actually comes in the SERP. Sometimes it's really high up. Sometimes it's a few scrolls down on the page. But it is almost always there. These are always questions of different types. Sometimes they are weirdly misspelled. Sometimes you also see duplication in there. But it's always questions, and it's always things that go with the topic that you've chosen, that you've put here in the query. A common misconception is that somebody sees this and thinks, \"Oh, I need to add FAQs to my content.\" You can, but you don't have to. What it means for you is that, in the content you write, you should answer these questions. This can be a headline. This can be a separate paragraph. It can be an FAQ, but it doesn't have to be, as long as you read your content in the end and you say, \"Yes, I've answered these three or four questions here.\" So look at this before you even start doing the outline for your content. That's it for today. This is how the SERPs guide content creation, and have fun creating content with it. Transcription by Speechpad Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How the SERPs Guide Content — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How the SERPs Guide Content — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Video results"
    },
    {
      "level": "H2",
      "text": "Image results"
    },
    {
      "level": "H2",
      "text": "Featured snippets"
    },
    {
      "level": "H2",
      "text": "People also ask"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    }
  ],
  "author": "Julia-Carolin Zeng\n          \n            Julia-Carolin Zeng\n          \n            Julia-Carolin Zeng"
}