{
  "url": "https://moz.com/blog/serps-you-cant-understand",
  "slug": "serps-you-cant-understand",
  "title": "SERPs You Can't Understand - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "With this latest update from Google, we've been noticing some very odd things in the SERPs. Despite our best instincts and measurements of link quality, quantity and optimization, sites seem to be ranking in very strange orders. In the hopes of making greater sense of things, we wondered if you'd…",
  "content": "SERPs You Can't Understand Public Relations By: Rand Fishkin October 21, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 21, 2005 SERPs You Can't Understand Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. With this latest update from Google, we've been noticing some very odd things in the SERPs. Despite our best instincts and measurements of link quality, quantity and optimization, sites seem to be ranking in very strange orders. In the hopes of making greater sense of things, we wondered if you'd like to list your top search results that make no sense. No need to point out your site or those of your clients, just the term or phrase where you believe the top ten aren't ranking in a very logical order. We'll see if SEOmoz really can take advantage of user power to get some good information. If so, I'l try to compile a nice comparison report so we can see these SERPs and sites side by side and make some educated guesses. Here's a few I think are bizarre: Mystery Novels Edward Hopper (love the image results, though) SEO Forum (note how unique this is from SEO forums) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SERPs You Can't Understand"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SERPs You Can't Understand"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}