{
  "url": "https://moz.com/blog/ses-munich-linkbait-truffles-more-insomnia",
  "slug": "ses-munich-linkbait-truffles-more-insomnia",
  "title": "SES Munich - Linkbait, Truffles & More Insomnia - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "On Friday evening, I hopped a flight from Seattle to Copenhagen, then Copenhagen to Munich, arriving Saturday around 5:00pm. Munich's a gorgeous city, and one of Germany's friendliest, a fact I've proven to myself by stopping most of the town's population to randomly ask for directions (impressive,…",
  "content": "SES Munich - Linkbait, Truffles & More Insomnia SEO Events By: Rand Fishkin March 26, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 26, 2007 SES Munich - Linkbait, Truffles & More Insomnia SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. On Friday evening, I hopped a flight from Seattle to Copenhagen, then Copenhagen to Munich, arriving Saturday around 5:00pm. Munich's a gorgeous city, and one of Germany's friendliest, a fact I've proven to myself by stopping most of the town's population to randomly ask for directions (impressive, since I've only been here 48 hours so far). From Mittlererings to Autobahns to a Mercedes with no acceleration whatsoever, Munich has been like one giant driving test - luckily, I appear to be passing. This morning featured my first solo-panel SES presentation; I covered Blogging, Social Media Marketing & Linkbait (warning: the PPT file is 500K). Although Germans are notorious for being less participatory during Q+As than their British and American counterparts, the session was filled with questions (we even ran over time a bit to accomodate). The session's moderator, Tim Cole, did a terrific job of keeping things rolling and ensuring that the session wasn't too myopic (an issue when a single presenter speaks for 1:15). Many thanks, Tim! Most surprising to me was how accepting the German SEO audience was to the ideas of linkbait - I was expecting more frustration with the English-language centric focus of most of the primary linkbait portals, but several examples from audience members (who've already been adopting and engaging in linkbait) made it clear that sites like Digg & Netscape can be used, even for German content (thanks, Marcus). After the session, Mystery Guest (who accompanied me for the first time to an SES show) and I visited downtown Munich - wandering downtown's Marienplatz. We did a bit of window shopping, but were most entranced by the farmer's market, where fresh truffles are the featured item this week: I've never seen a farmer's market with greater organization. Each item is stunningly laid out in its own basket, with clearly marked names & prices. It's a far cry from Seattle's often scatter-brained Pike Place Market. We got pretty hungry viewing all those beautiful, expensive mushrooms and decided to satiate our appetite with a bit of the delicacy at a nearby restaurant: After lunch, we visited the Glockenspiel, but just barely missed the display. Jetlag and insomnia finally caught up with us, though, and it was back to the hotel room for a nap. Last night's 4 hours simply couldn't keep me going all day. Tomorrow at 1pm it's back to Seattle, and back to your usually scheduled blogging. Thanks to everyone at SES Munich - it's been a terrific, if short, trip. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SES Munich - Linkbait, Truffles & More Insomnia"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SES Munich - Linkbait, Truffles & More Insomnia"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}