{
  "url": "https://moz.com/blog/ses-chicago-recap-in-comics",
  "slug": "ses-chicago-recap-in-comics",
  "title": "SES Chicago Recap in Comics - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We noticed that at the last few SES & Pubcon conferences, the coverage has been overwhelming. You can't say a word or show a slide without finding it 3 hours later all over the search blogosphere. So... we wanted to do something a little different for our coverage. Let's see how Incisive likes…",
  "content": "SES Chicago Recap in Comics SEO Events By: Rand Fishkin December 14, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 14, 2006 SES Chicago Recap in Comics SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. We noticed that at the last few SES & Pubcon conferences, the coverage has been overwhelming. You can't say a word or show a slide without finding it 3 hours later all over the search blogosphere. So... we wanted to do something a little different for our coverage. Let's see how Incisive likes giving out press passes to young women whose primary form of journalism is done in the classic multimedia format of... a comic strip! Don't miss - SES Chicago: The Comic Strip by Rebecca Kelley. Just beware; there's virtually nothing educational contained within. This is for the lighter side of your SEO day; enjoy! p.s. Do note that you should have a wide screen and allow for some download time. We're talking about 1200 pixel wide comics and 3+ MBs of jpegs. p.p.s. Yes, she unveils the identity of SEO Fangirl. p.p.p.s. And yes, of course this post is noisy (but worth it for the laughs). p.p.p.p.s. (from Rebecca) I used a couple images from Liana Evans and one from Barry Schwartz and Matt McGee, so thanks! One final update (with signal) - Several folks have asked for my slides from Chicago; here they are - Social Media Marketing & 7 Steps to Linkbait Success. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SES Chicago Recap in Comics"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SES Chicago Recap in Comics"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}