{
  "url": "https://moz.com/blog/setting-goals-is-critical-to-a-traffic-building-campgaign",
  "slug": "setting-goals-is-critical-to-a-traffic-building-campgaign",
  "title": "Setting Goals is Critical to a Traffic Building Campgaign - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "No matter what type of website you run, there's a bigger site in your niche (or globally on the web) that can send you a great number of visitors if you make the right moves. Making a list of those goals is part of a link/traffic builders respons...",
  "content": "Setting Goals is Critical to a Traffic Building Campgaign Link Building By: Rand Fishkin December 9, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 9, 2005 Setting Goals is Critical to a Traffic Building Campgaign Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. No matter what type of website you run, there's a bigger site in your niche (or globally on the web) that can send you a great number of visitors if you make the right moves. Making a list of those goals is part of a link/traffic builders responsibility - identifying the sites you want links and traffic from and finding ways of getting that traffic. Go ahead - dream big. But, don't forget to make the list ordered - from \"pretty good chance of being listed\" to \"If I get a link from them it's Cristal and Caviar all night\". Right now, atop my own personal list for SEOmoz is the much-lauded AListApart - the resource \"for people who make websites\". Currently, the topics list contains not a single description of a topic segment for which I could submit an article on SEO. Whereas a more practical individual might shoot for another site due to this somewhat large barrier; I'm not dissuaded. However... I would love suggestions. Any ideas on an article I could write that has a chance of making it to ALA? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Setting Goals is Critical to a Traffic Building Campgaign"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Setting Goals is Critical to a Traffic Building Campgaign"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}