{
  "url": "https://moz.com/blog/setting-goals-not-tools-as-the-foundation-of-your-marketing-whiteboard-friday",
  "slug": "setting-goals-not-tools-as-the-foundation-of-your-marketing-whiteboard-friday",
  "title": "Setting Goals (Not Tools) as the Foundation of Your Marketing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In order to make sure we're constantly creating value for our customers, our focus should center on goals instead of tools. In today's Whiteboard Friday, Mackenzie Fogelson walks us through her five-step process for ensuring that value comes naturally.",
  "content": "Setting Goals (Not Tools) as the Foundation of Your Marketing Whiteboard Friday By: Mackenzie Fogelson September 27, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Mackenzie Fogelson September 27, 2013 Setting Goals (Not Tools) as the Foundation of Your Marketing Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. With new tools introduced so regularly, it's easy for marketers to spend an inordinate amount of time trying to figure out which ones are most effective for their own work. That focus, though, shifts our attention from what really matters: setting the right goals for our companies. In today's Whiteboard Friday, Mackenzie Fogelson walks us through the five-stage process she uses to make sure her team's attention is on what really matters. For reference, here's a still of this week's whiteboard! Video Transcription Hey there, Moz community! I'm so excited to be here with you today. I wanted to share something with you that has been really powerful for the businesses we've been working with in the last year or so about building community. It's a concept that we call \"goals not tools,\" and it works in this pyramid format where you start with your goals, you move on to KPIs, you develop a strategy, you execute that strategy, and then you analyze your data. And this is something that has been really powerful and helped businesses really grow. So I'm going to walk you through it here. We start down at the bottom with goals. So the deal with goals is that you want to make sure that you're setting goals for your entire business, not just for SEO or social media or content marketing, because you're trying to grow your whole business. So keep your focus there. Then once you develop your goals, and those goals might be to improve customer communication or you want to become a thought leader. Whatever your goal is, that's where you're going to set it. Then you move on to determining what your key performance indicators are and what you're going to use to actually measure the fact that you may or may not be reaching your goals. So in terms of KPIs, it's really going to depend on your business. When we determine KPIs with companies, we sit down and we have that discussion with them before we develop the strategy, and that helps us to have a very authentic and realistic discussion about expectations and how this is all going to work and what kind of data they're expecting to see so that we're proving that we're actually making a difference in their business. So once you've determined those KPIs, then you move on to developing a creative strategy, a creative way to meet those goals and to measure it the way you've determined in your KPIs. So this is your detailed roadmap, and it's two to three months at a time. A lot of companies will go for maybe 12 months and try to get that high level overview of where they're going for the year, and that's fine. Just make sure that you're not detailing out everything that you're doing for the next year because it makes it harder to be agile. So we'd recommend two- to-three month iterations at a time. Go through, test things, and see how that works. During your strategy development you're also going to select the tools that you're going to use. Maybe it's Facebook, maybe it's SEO, maybe it's content marketing, maybe it's email marketing, PPC. There's all kinds of tools that could be used, and they don't all have to be digital. So you just need to be creative and determine what you need to plan out so that you can reach the goals that you've set. Then once you've got your strategy developed, that's really some of the hardest part until you get to execution. Then you're actually doing all the work. You need to be consistent. You need to make sure that you're staying focused and following that strategy that you've set. You also want to test things because you want as much data as possible so that you can determine if things are working or not. So make sure that during execution there are going to be things that come up, emergent things, shiny things, exciting things. So what you'll have to do is weigh whether those things wait for the next iteration in two to three months, or whether you deviate your plan and you integrate those at the time that they come up. So once you're through execution, then really what you're doing is analyzing that data that you've collected. You're trying to determine: Should we spend more time on something? Should we pull something? Should we determine if something else needs to completely change our plans so that we're making sure that we're adding value? So analysis is probably the most important part because you're always going to want to be looking at the data. So in this whole process, what we always do is try to make sure that we're focusing on two questions, and the most important one is: Where can we add more value? So always be thinking about what you're doing, and if you can't answer the value question, you know, \"Why are we doing this? Does this provide value for our customers or something internal that you're working on? If you can't answer that question, it's probably not something valuable, and you don't need to spend your time on it. Go somewhere else where you're adding the value. Then the last question is where you can make the biggest difference in your business, because that's what this is all about is growing your business. So if you stay focused on goals, not tools, it's going to be really easy to do that. Thanks for having me today, Moz. Hope I helped you out. Let me know in the questions if you need any assistance. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Setting Goals (Not Tools) as the Foundation of Your Marketing"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Setting Goals (Not Tools) as the Foundation of Your Marketing"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Mackenzie Fogelson\n          \n            Mackenzie Fogelson\n          \n            Mackenzie Fogelson"
}