{
  "url": "https://moz.com/blog/setting-up-your-seo-project-agency-for-success",
  "slug": "setting-up-your-seo-project-agency-for-success",
  "title": "Setting Up Your SEO Project / Agency for Success - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Whether you're working in-house or at an agency, speaking the language of clients and addressing their specific needs is the driving key to success behind any SEO project. Ron Garrett outlines common themes when working with new clients and shares his tips for successful campaigns.",
  "content": "Setting Up Your SEO Project / Agency for Success SEO Consulting By: Ron Garrett November 19, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Ron Garrett November 19, 2012 Setting Up Your SEO Project / Agency for Success SEO Consulting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. For the past 1.5 years, I have been the Client Development Executive for Distilled's NYC office. I helped open this office in June 2011, and at the time we were struggling as an office because we had few leads, minimal recognition in NYC, and massive competition from both local bespoke agencies and larger full-service agencies. Within 6 months, I was able to ensure the SEO consultants were at full capacity. Currently, my role entails working with both amazing big brands and innovative startups to help Distilled consultants solve pain points and define scalable solutions (usually not pertinent to SEO). Over the past year, I've come to find that most of the problems within companies have little to do with SEO. Instead, most of them involve dealing with people and problem solving in order to get things done. This realization has made a positive impact both on Distilled and on our clients. I've found that often times speaking the language of the clients and addressing their specific needs is the driving key to success for any SEO project. This post was written for SEOs who are client-facing and those who manage their own agencies. Below are some of the common themes I've encountered and how I would manage each situation and set it up for success. For SEOs: how to set up your project for success Why the cycle of sadness is so important I'm going to start off with something to wake everyone up. The first touch point for any new prospect is generally sales. I can't stress this enough. Although every organization has its own inefficiencies, the first step in the process is often times the most important. Think back to a time when you took on the wrong client, the wrong project, undersold the scope of work yet still had to deliver on it, or didn't set up a proper handover. You have a brief window of time to qualify, mine information, set the client's expectations, and hand over the project to the SEO. It's even tougher if you are the one selling and delivering the project. It's a never ending cycle of sadness, so it's imperative to try and get it right the first time around. A few ways to mitigate the cycle of sadness are as follows, and more detailed information about all these points are broken down throughout the rest of the post: Ask lots of questions and repeat back the information that was provided by the client to ensure you have an accurate picture of their organization. Request examples from the client's work that they think represents their best content, relationships for outreach, PR, etc... so you can match their definition of excellence against yours. This will mitigate risk when talking about leveraging their teams assets versus your own. Get a consultant to do a quick sample audit of their site (I usually ask for 20 - 30 minutes of their time) to identify major opportunities and how those opportunities will end up being prioritized in a first stage project plan. If you are new to putting together costs, it's always wise to get your numbers and hours to deliver the project cross-checked by a colleague you trust. If you are proposing work that you are weaker in and need to to research and prep, try to be transparent about that with the client and account for those costs. You can make up for this on the back end once you become super efficient at delivering this type of work. Make sure you document everything and centralize it for sharing with your colleagues or referencing at a later date. Spend some time cleaning up the data and making it easy to find and read through. Push back on clients who are asking for things that aren't in line with the way you do business or that you don't feel comfortable doing. Whatever you do, don't become a yes man or woman. If the client is asking you for something you aren't sure about, take some extra time to research, ask questions, and budget in enough time for you to be able to sufficiently deliver the work. How to build relationships with clients (the right way) Be likable / personable - It is so important to let your personality shine through when talking with the client, whether it's on the phone or by email. We encourage being personable in our responses and letting a bit of humor shine through. It really gets the client to open up and be more direct in their communication. Be professional - Before communicating with the client, always do a level of due diligence to streamline the process, whether it's doing a bit of research, thinking about their considerations, cleaning up your notes, sending over a meeting agenda, reiterating next steps via email, etc. Having a buttoned-up approach to business that shows that you are prepared and have taken the clients considerations into account before actioning something goes a long way. Be effective - The challenge with this one is that effective can take on many definitions. It's important to deeply understand the strategy you have laid out for the client, and make sure that when you apply time towards delivery of the project, that you are prepared, focused, and set up for success. Here are some of the ways I try to stay effective: Make sure I'm getting enough sleep at night Take breaks throughout the day Time boxing (set a certain amount of time to get one thing done and limit yourself to that time) Keep your energy levels up by snacking / eating meals throughout the day Be helpful - Never stop reading. When you have a client in a particular sector or targeting a specific demographic, start reading sites that will help you stay up to date on what is going on. It's also particularly helpful when you stumble across an article that talks about what your client's main competitors are doing, so you can gain intel and share that with your client. You can also take on a subset of responsibilities that your client would have to fulfill otherwise to help them out so they can focus on other things. The great thing about being helpful is, it's often times greatly appreciated. Be transparent - Don't just be transparent about the good stuff; get comfortable delivering the bad news as well. It can be very challenging to deliver bad news to a client, push back a deadline, or not be happy with the first iteration of your work and tell them that, but the more open and honest you can be with them, the more open and honest they will be with you. It also sets the precedence for them to trust you more. Be proactive - This can be challenging as well, especially when you have a never ending list of things to accomplish before noon, but always look for ways to be proactive instead of reactive. One of the largest complaints I receive from clients when I ask them why they are leaving their previous agency is that the agency wasn't being proactive enough. The client was finding things out after the fact on their own instead of hearing it directly from the SEO / Agency. You can even try scheduling something into your calendar as a bit of forward-thinking research time or brainstorming with your team. You can take the output of what you research or brainstorm and deliver to the client. Clients love to know that you put thought into their success and wellbeing without them asking for it. Helping to define the KPIs and ROI of a project Work with the client to define the primary business objectives (the life blood of the organization) and the terminology they use to describe them. Ask them what marketing metrics they are currently tracking and how closely those metrics are being associated back to the primary business objectives. Understand the different types of conversions they care about, and how they are currently tracking and monitoring those. I will then ask how they have tracked ROI in the past, and if tracking ROI for this project will function any differently now. Then, I offer up common measurements of ROI I have used with previous clients if they do not have a well developed model for ROI for their business yet. I also educate them on the benefits softer metrics can have on a business's success. Examples of soft ROI metrics include: Helping the client mitigate risk Hiring new employees Training existing staff Providing the client data that helps form a new strategy This can all be seen as ROI, but is much more difficult to measure the impact of. Ensuring an SEO project is set up for success internally and externally How SEOs should kick off a project Get a full project brief / handover from the individual that worked with the client before signing. Always budget in time (1-2 hours) to do some preliminary research before kicking off the project. This should include taking a look at all of the different stake holders in the project, making sense of the project brief/handover from the individual (ask questions/get clarification), and taking a look at the client site/blog/PR/News/etc. to get a good snapshot of where they currently are. Define 2-3 topic points you can bring up during the kickoff to establish credibility, expertise, and confidence in how prepared you are to succeed with the project. Take full advantage of the knowledge and expertise your point of contact has in working in house during the kickoff call. Do not stop with surface level questions, but when you get a response and want to know more about a particular aspect, make sure you ask more specific questions. EX: \"I noticed when you were talking about X you mentioned Y. What did you mean by Y? Oh, that's very interesting, how would you define Z? I would love to have a deeper understanding of that last part we talked about. Would you mind unpacking that for me?\" Take rigorous notes, or have somebody who isn't leading the call take notes. Clearly define next steps off the back of the call. Because the client is going to have expectations (they are now paying you and waiting to see what you can do), it's best to have the next steps pre-determined before hopping on the call and setting their expectations, or letting them know you will compile all of the information they have provided you during the kickoff and put together a more detailed project delivery plan for the next few weeks and send it over by no later than \"INSERT DATE\". Because you only get so much time with the client on the kickoff call, I would suggest spending most of your time listening, asking great questions, and taking in as much information as you can. The more time you talk about yourself, the less information you will get. Let the client know at the beginning of the call that should they have any questions about how something will work, they should feel free to stop and ask throughout the meeting. Make sure that before you leave the kickoff call, you do a quick recap so their expectations are set on what happens next. Make sure if there are any dependencies on them, that you are explicit about them during the call, and that you will send over a quick email after the call outlining them. How to retain clients Client retention is one of the most important metrics we look at in our agency. I have put together a few things that I have noticed increases the client retention across the board. Do enough discovery at the beginning to make sure you are working on the right things and providing immense value as early in the project as possible. Defining a strategy and a plan for execution is important in making sure you are working on the high value activity more often times than not. It's also important to have a clear project roadmap that can be easily updated and found by both parties.This is important because it keeps everybody on the same page, and represents the most updated path to success for the project. Make it easy for the client to find. I often times find using a shared Google Doc does the trick. Make sure you have at least 3-6 months built out to ensure enough visibility to what you are going to be providing the client. This will put them at ease knowing that we are building towards a bigger vision while hitting milestones along the way. Have quarterly reviews with your clients where you can bring in a third-party person who is not closely tied to the day-to-day activity (in most cases the Client Development Executive). This happens in order to get perspective on the success of the project, the direction it's heading, and ideas on areas we can make improvements. During quarterly reviews, I will normally pick a set of 5 areas of the project and have the client grade us between 1-10. They are: Account management Project management Communication Results Happiness For the areas where the client says below a 10 (which will happen more times than not), I ask them what we can do differently to go from our current score to a 10. This will give more granularity as to how they think we can make improvements. It's important to always have your hand on the pulse of the client's organization. If and when things change, it is in the account manager's best interest to have a deep understanding of what things changed, what drove the change, why it's important, and who it's going to impact. This gives you the opportunity to act / react to the situation accordingly. Make it very simple for your client to track and measure results by configuring dashboards in Analytics. From here, you can also help them set up GeckoBoard inside their organization so you can share all of the major KPIs you are working to influence easy to read and see. This gamifies the stats you and your client care about and creates additional awareness. There are different forms of reporting that can be effective too. I am a big fan of using really nicely designed letterhead from a word document to create and send Executive Summaries. This is the information the Executive Team could want to know. Build meaningful relationships with multiple stake holders within the organization. It's important to build relationships to increase surface area within the organization (eliminates you having one point of failure should something change). It's also important to continue building relationships with your clients executive team and up. Never forget about your internal champions, the people that just want to be the samurai and get things done. A great way to get additional buy in is to invite people out from your client's office (if they are nearby) for drinks and dinner. There is no better way to get the inside scoop and build a stronger relationship then hanging out outside the office. Also look for ways to make the in-house individuals of your client look good. Helping those who hired you look good and get raises is a great way to build loyal clients and develop a partnership between the two companies. Last but not least, never stop advocating for things that will improve the relationship, the value of the work done together, or building a better project. A lot of clients are fearful that their SEO/Agency will get lazy and start coasting 6 - 8 months, which is why so many companies switch agencies from year to year. Always look for opportunities to improve the existing roadmap of work together. Be sure to create awareness around the things you've done to pro-actively set the client up for success. This builds trust. Work on pre-delivering a roadmap and ideas on where they can allocate their budget for next year to help alleviate some of the work your point of contact may have to do (they will appreciate this). Actively communicate the steps you are taking in order to retain their business. Consistently talk about how important and meaningful this client relationship is to you and the organization, and how much you appreciate the chance to work with them. How to speak to a CEO or a high level marketing director, specifically if you need a bigger budget Send him or her an email to pre-deliver what you need from them, give them a clear why to get buy-in for the meeting, get dates / times lined up, and always use a slide presentation to express new ideas at the executive level. Usually, I work closely with an SEO to put together this pitch deck, but Ian Lurie of Portent shared one of the proposals that I wrote in \"build a compelling case and start with the why.\" As long as there is a clear value proposition, getting additional budget should be pretty straightforward assuming they have budget left to invest in these channels. Email pre-delivering the opportunity. See below for an example: Dear Mr. or Mrs. \"NAME\", I had an opportunity to review our current project with my colleagues, and we have identified an opportunity (opportunities) I would like to share with you that could create a lot of value for your organization. I understand you are very busy, so to make best use of your time, I will put together a PowerPoint presentation which we can present to you during our meeting sometime this week or next. This expansion of the project is likely to result in an increased budget, which is why we wanted to get your feedback and ideas on the matter. Do you have a few days and times that work nicely? For those who manage their own agency or are head of sales of an SEO agency How to determine whether a client is right for you Before I can determine whether a client is a good fit for our company, I request setting up a first call that lasts anywhere from 30 minutes to an hour so that I can better understand their business. Below are the questions that I make sure are answered during the call. \"What is the URL for your domain? I want to make sure I have it up while we talk further.\" Once I have their domain up, I will do a quick review of their site to see if their SEO is nonexistent, basic, intermediate, or advanced and try to get a sense of where they could use the most support. This will give me talking points for later in the call. \"Tell me a brief history of the company [I would have already conducted an initial research of the company before any call, but I want to see how my perception matches up to what the prospective client says], how it got started, where the organization is as a whole right now, and what the plans are for the foreseeable future.\" I will specifically take a look at the site's PR / news section to see the topics of interest they are most interested in talking about. This will give me perspective into the things they are most proud to shout about. \"What is your role at the organization?\" By this time, I will have already dropped their email address into Gmail, hovered over it with my chrome plugin Rapportive, and found all the social networks associated with their email account. I generally like checking out LinkedIn, About.me (if they have one), and any personal blog to get insights into their professional track record, personality, likes, and dislikes). \"How did you get started a this company?\" (This is a great ice breaker. It gives them a chance to open up about themselves and tell you a story. This may give you talking points that you can use as part of a follow up conversation). \"How long have you been at the organization?\" (This will give you quick reference as to whether or not you need to expand your reach within an organization and how quickly). \"Why SEO now?\" (If they don't elaborate as to their previous SEO experience and use of agencies, make sure you elaborate on that with them). Here are a few common themes that have popped up during the first initial sales conversation and how I would respond to their inquiry: Scenario 1: \"We were searching for SEO companies through Google and we wanted to find out more information about your services and company.\" My response: You show them your appreciation for the individual selecting and calling your company, and that you are willing to dedicate as much time as they need to make the best decision possible for their organization. This puts them at ease and reassures them that you are willing to help them for the right reasons, and not sell to them. Be a friendly expert, not a used car salesmen. Scenario 2: \"We have done some minor title tag changes and meta descriptions, and we would like to use your company for link building.\" (This generally means that they may have read a few articles on SEOmoz and/or other SEO blogs, but when it comes to doing information architecture changes for the purposes of SEO, removal of duplicate content, 301 redirects, URL restructuring and setting up tracking and segments in Analytics probably hasn't been tackled.) My response: With the technical SEO implementation you have done to date, is this something you would be open to our team reviewing? Most often times they say yes. You can also go back over the site at a later date to spot technical, on page, IA opportunities. I will then discuss our methodology and guidelines for linkbuilding. Because of the updates that have impacted some websites link profile, I think it's important to paint a picture for why our method of linkbuilding meets Google guidelines and talk about the subtle nuances of how we accomplish this. Scenario 3: \"We have built our business off of paid search, and we want to expand our visibility into organic search. Can you help us?\" (This generally means I will start by educating them about SEO, and how we can learn the current keywords that are converting in AdWords, do some additional keyword search, and define a strategy for growing their organic traffic) My response: I will request access to their AdWords account or get an export of their converting keywords, and save it for the SEO/Paid Search consultant to have a look and go into discussing our services and how we can apply the existing keyword knowledge to supporting their SEO efforts. Scenario 4: \"We have worked or working with another SEO /Agency currently and we are looking to switch partners/vendors. What does your company offer, what does a standard engagement look like, and what are your costs?\" My Response: I need to fully understand the situation in order to set up it up for success. Some of the questions I'd ask include: What type of work did you do with your current / previous SEO / Agency? What made you decide to transition at this time? How many SEO / Agencies has your business worked with in total? (this normally gives me an indicator as to whether or not the client could be a bad client and their SEO/Agency fired them, or they had mismanaged expectations of the work.) What would your existing SEO / Agency needed to do differently to keep your business? If you select our company as your next SEO / Agency, and you could wave a magic wand and get the type of relationship and results from working together that you wanted, what would that look like? I generally try to keep digging on that last question for as much detail as I can. People aren't used to being asked if I could have anything I wanted, what would I ask for. Turning away a project that is not right for the agency / freelancer Accepting a project that is not a good fit for your company can lead to an unhappy client, wasted money and resources, disgruntled employees, and massive pain points for all involved, which ultimately can damage the company's culture. However, every lead is an opportunity, and sometimes they are few and far between. Bottom line is you can't make this type of decision until you have a full understanding of the entire situation. Image courtesy of SmallBizTrends In this instance, it is important to have done your best to understand the potential client's requests, needs, and considerations before turning them away. I also spend time trying to educate the potential client to make sure value is created one way or another. If they do not have the budget necessary or they continue asking for the wrong things or unethical tactics, or you feel like the culture of the two companies would be a bad match, the best thing you can do is be gracious and honest. Pro tip: unless the client is an absolute nightmare and you have no intention of working with them again (even in the future), always be sure to leave an open door in your communication to come back in case they reconcile the reason you turned them away to begin with. This will give them a second chance. Scenario 1: The client doesn't have the budget to work with you given your standard rates and is unable to get more at this time. My sample response: Dear \"Insert Client Name\", We really appreciate the time you have spent with us discuss your interest in working together. Unfortunately at this time we do not feel like our organization would be a good fit at the budget we discussed given the scope of work. I would be happy to make a personal introduction to a colleague of mine who might be able to help you. They have communicated to me that they do take on clients in your budget range. His / Her name is \"Insert Name\" and he / she is the \"Insert Title\" of \"Insert Company Name\". Please feel free to use me as a resource should you have any questions or would like to re-open the conversation of working together in the future. Scenario 2: The client is not a good cultural fit, and you think it would put too much strain on the success of the project. My sample response: Dear Client, Thank you again for making time to speak with me this past week. I had an opportunity to speak to my colleagues and after much discussion, we have decided that we would like to respectfully decline bidding on this project / campaign at this time. Although the project campaign would have been great to work on, we feel like there is just too big of a discrepancy between team dynamics/company culture, and because we work very hands on, we see this as creating challenges. {Discuss the areas where the team dynamics / company culture broke down so the client has a path for correction}. We are still open to the idea of working together in the future, but in order for it to work, these are the things we would need to work through in order to discuss next steps. Please let us know if you have any questions. I'm happy to discuss it in more detail on a call if you like. Thanks in advance for your understanding, and we wish you much luck on this project! Scenario 3: The client continuously pushes their agenda to work on things that will either have little to no impact on their success or asks for things that your company doesn't feel comfortable delivering. In this instance, I would make sure I work to educate the client and try to get them on track with asking for more of the right things. My sample response: Hop on the phone with the potential client, give them one final opportunity to explain their position. Be explicit about what will and will not work with their proposed project plan. Then, try and educate them on why it will or will not work out for the purposes of the engagement. If you still feel like the project or relationship is not in a good place by the end of the conversation, be very candid with them. Let them know you appreciate all of their time, but you don't think working together based on the real reasons is the best fit for your organization at this time. I know it can be tough to say this, but just remember people will respect you in the long run for being honest with them and not sugar coating things. It also gives them a clear path the correction should they change their mind. After the call, it's always important to send a quick recap email to have a transcript of the call to refer back to. Dear Client, Thank you again for making time for the call. Even though we were unable to come to an agreement on this project at this time due to \"insert reason,\" please let me know if you have any further questions about it down the line. Final thoughts Ultimately, when you sign on a new client, you are creating an agreement between two parties. The better picture you can create for what the client expects, keep a pulse on if expectations change, and make sure you are proactively working to deliver value and communicate in a transparent way, the greater the chance of retaining and upselling your clients. You will notice there were common threads throughout my post that are good things to keep in mind when working with a client. Are you being honest, transparent, proactive, and delivering on the original or updated agreement you signed with your client? Do they have a clear picture of what is to come next? Can you provide them with a unique value proposition that will make them look look good that they can't find anywhere else? This is easier said than done, but hopefully the examples of emails and types of responses I give in particular situations will help you through these times. I really appreciate you all taking the time to read this post, and please feel free to ask any questions below in the comments! Happy Mozzing :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Setting Up Your SEO Project / Agency for Success"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Setting Up Your SEO Project / Agency for Success"
    },
    {
      "level": "H2",
      "text": "For SEOs: how to set up your project for success"
    },
    {
      "level": "H3",
      "text": "Why the cycle of sadness is so important"
    },
    {
      "level": "H3",
      "text": "How to build relationships with clients (the right way)"
    },
    {
      "level": "H3",
      "text": "Helping to define the KPIs and ROI of a project"
    },
    {
      "level": "H3",
      "text": "Ensuring an SEO project is set up for success internally and externally"
    },
    {
      "level": "H2",
      "text": "How to retain clients"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": "How to speak to a CEO or a high level marketing director, specifically if you need a bigger budget"
    },
    {
      "level": "H2",
      "text": "For those who manage their own agency or are head of sales of an SEO agency"
    },
    {
      "level": "H3",
      "text": "How to determine whether a client is right for you"
    },
    {
      "level": "H3",
      "text": "Turning away a project that is not right for the agency / freelancer"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Sins of an Agency: Parting Ways With Our Biggest Client"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "8 Prep Steps for Better Local Business Client Meetings"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ron Garrett\n          \n            Ron Garrett"
}