{
  "url": "https://moz.com/blog/sge-local-search-data",
  "slug": "sge-local-search-data",
  "title": "Google SGE: Early Local Search Data - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Google SGE: Early Local Search Data",
  "content": "Google SGE: Early Local Search Data Local SEO | Marketing Industry | AI and SEO By: Miriam Ellis July 10, 2023 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis July 10, 2023 Google SGE: Early Local Search Data Local SEO | Marketing Industry | AI and SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Edited by Emilie Martin If the local version of Google’s Search Generative Experience (SGE) experiment rolls out broadly, what will that be like for local business owners and their marketers? This is the question I set out to answer with a small study geared to gather some early basic data. Bearing in mind that there is no guarantee that the present version of SGE will roll out or will look exactly as it does now, I have what I hope are some interesting takeaways for you today! Methodology With SGE enabled, I performed 50 manual local searches. 100% of these searches generate local packs in the non-SGE setting, and 100% of them also generate local packs beneath the SGE box in the SERPs. I included both branded and non-branded terms (e.g. Safeway vs. grocery store), and modified and non-modified terms (e.g. bookstore vs. bookstore in novato). I tracked the data in a spreadsheet and took screenshots along the way. How many local searches return SGE results? 100% of my keyword phrases (things like pizza, women–owned cafe near me, and bookstore in San Francisco) returned a local pack, signifying that Google recognizes their local intent, but of those searches: 10% returned no SGE display34% returned a “generate” button to prompt to SGE display56% auto-generated an SGE display without prompting Takeaway: At this stage, Google isn’t sure whether users will automatically want SGE for everything or only as an option for some searches. How many SGE results included an SGE local pack? While 100% of my searches yielded a traditional local pack outside the SGE display: Only 77.6% of the SGE results included a local pack22.4% resulted in an SGE display of something other than a local pack For example, most of us would expect a search for “shoes” to generate a local pack in Google’s interface these days, but here we see this SGE result, instead: Similarly, we’ve been trained by Google to think we only need to type “Catholic churches” into a search box to be shown houses of worship near us, but SGE provided this very broad definition instead of any type of local result: And SGE is really taking a surprising view of my intent in looking up “EV charging stations”. Instead of showing me a pack of nearby places where I can charge my electric vehicle, I’m being shown products to purchase: When clicking on these products, I’m given an interstitial card of places to buy these products, like eBay and Best Buy, which feels quite remote from my intent: Takeaway: There is a different logic powering SGE than what we’ve become accustomed to in pre-SGE Google. This may impact both your keyword research and your local search marketing strategy. Just because a search used to be perceived by Google as having an obvious local intent that would then be reflected in the SERPs returned, that doesn’t mean that the same logic applies in what SGE thinks your intent is. You’ll need to re-study the SERPs for your core keyword phrases if SGE rolls out broadly and is adopted by your customers. The big question: Do SGE packs match traditional local packs? The short answer is a decisive “no”. In my case study, 62.8% of SGE packs did not exactly match the contents or precise ranking of traditional local packs. That’s right, well over half the time, SGE rankings are different from local pack rankings. As seen in the above side-by-side comparison, the SGE pack has a completely different business in first place, and the ranking order of restaurants 2, 3, and 4 is in a different order than its traditional local pack analog. These are significant differences for the businesses involved and one is left wondering why that #1 spot is being awarded to an eatery that isn’t strong enough to make it into the familiar local pack. Takeaway: While I observed many instances of overlap of pack contents between SGE and traditional SERPs, the % of differentiation means that your traditional local pack rankings in no way guarantee the same spot in SGE’s recommendations. You’ll need to study and audit your SGE competitors separately if SGE rolls out to the public and is widely adopted. How many businesses are included in SGE local packs? Once upon a time, Google’s local packs contained 10 results. Imagine! Then we had 7. Now, we mostly have 3. SGE packs have their own variation. In my study, I found that: 46.6% have a 5-pack22.2% have a 4-pack4.4% have a 3-pack4.4 have a 2-pack Takeaway: In 68.8% of SGE packs, more local businesses are being displayed that would be shown in a traditional 3-pack in the organic SERPs. This provides more opportunity for you to be visible without a searcher having to click through an initial interface to something secondary like the Local Finder. Is there an escape route out of SGE, and what about the ongoing importance of links and citations? In my June live-tweeted thread documenting my first encounter with SGE, one of my first reactions to the interface was that it felt very enclosed. The SGE packs don’t click to the Local Finder or Google Maps or the reviews interface, making me feel sort of stuck. No matter where I was clicking around in the results, I was kept within the walled garden. Since that first experience, I’ve realized that the local version of SGE does contain an escape route in the form of these carousels to the right of the SGE packs: In my case study: 53.3% of the carousels linked to Yelp6.6% linked to Wikipedia4.4% linked to TripAdvisor4.4% linked to YP15.5% linked directly to brands’ own websites8.8% linked to a local informational site, like local online tourism sites or online local travel magazinesThere was also a smattering of Facebook, Michelin, UberEats, GrubHub, and SuperpagesThis did not come up in my study, but I would like to anecdotally mention that in playing around with SGE, I am seeing a lot of citations of LinkedIn. Local businesses that don’t yet have a Linkedin profile should consider creating one. Takeaways: Your structured citations in the form of formal local business listings still matter very much in the SGE setting. Your unstructured citations in the form of mentions on relevant local and industry sites still matter, too. The number of direct links from these carousels to local business websites is quite meager, and I would like to see Google reconsider this. At any rate, there is some escape from SGE to third-party destinations, but here’s what I really want to emphasize: 100% of SGE results containing SGE packs include carousel links to local.google.com When moused over, these bring up a local.google.com URL, including a Place ID, like this: I was puzzled at first by that local.google.com subdomain. I feel like I hadn’t seen a URL from Google like that in a long time, but when clicked on, these types of URLs in the SGE carousel redirect to a google.com/search URL and this familiar display: Takeaway: I could be 100% wrong about this, but looking at the way SGE is currently structured makes me feel like it’s not the ultimate way this will work. As it currently is, you’re already sitting right above the organic results while in SGE, and then there are these tiny cards in the carousel taking you back to the organic results, and the paths just feel a bit bewildering. So, while I like the escape routes out of the confines of AI, there’s something non-intuitive about the CTAs in these SGE packs. What about local attributes in SGE? I’m sorry to report that the work you’ve put into adding excellent attributes to your Google Business Profiles to serve specific customer intents seems to be wasted when it comes to SGE at this point. If you’ve taken the time to proudly add self-selected attributes like Black-owned or women-owned to your profiles, these results may let you down. Here’s a side-by-side comparison of my search for “women-owned clothing store Novato”: The traditional local pack tells me my intent will be met at these two stores on the left with their clear women-owned attributes. On the right, though, SGE is apparently ignoring my modifier and just showing me women’s clothing stores, which may or may not be owned by women. The nuance is being lost. This made me lack confidence in using SGE to search for other businesses with particular attributes. Takeaway: This version of SGE is coming off as a bit less “smart” about local nuances than the local results to which we’re accustomed. How standardized are the results when SGE thinks your intent is local? The answer is not very standardized at all. There’s something very vague and Google-y about the fact that some packs are headed with a simple message like “There are lots of yarn stores in Novato” or: Whereas, for quite similar queries, Google suddenly wants to tell me a bunch of other information, which, quite frankly, seems rather random. A lookup of nearby Chinese restaurants generated a long list for me of people’s favorite Chinese takeout dishes (which I hadn’t asked about), and look at this example for Mexican restaurants. Explain to me the logic behind a 4-pack (when there are clearly enough choices for a 5-pack) being followed by a list of non-clickable “other” restaurants. What am I supposed to do with that list? What’s the CTA? Another odd variant I encountered more than once is this one, where the “other” restaurant is clickable but, for some reason unknown to me, is being portioned off outside the other results. Why Google, why? We won’t even get into the fact that Toast is not a Thai restaurant and is characterized (categorized?) right there in the results as an “American” eatery. So what is it doing there, being labeled a Thai restaurant? Ah, well. Meanwhile, local business owners will likely be most curious to know how they appear for a branded search in the SGE world. Typically, you’ll see yourself presented like this, with location info, a descriptive summary, some photos, a couple of review boxes, and one of those local.google.com links: Unless you have that special misfortune of having branded your business something that defies Google’s intent logic, as in the case of the great brand, Patagonia. SGE is uncertain as to whether I’m searching for a store or a geographical region here, and I get this: Takeaway: As we can see, there is not strong standardization across SGE at this point, and while in some cases, you’d think time might yield a more uniform presentation, I wouldn’t count on it with Google. Traditional local search has changed continuously over the past two decades. Branding, features, pack counts, guidelines, and mysterious ranking logic are all in flux, all the time. I would expect the same from SGE, necessitating ongoing study. SGE packs vs. local packs: which is better? I may have oodles of objectivity from studying Google’s local results for nearly 20 years, but this opinion is entirely subjective: right now, SGE is simply not providing as good of an experience as traditional packs and GBPs for basic local search functions. Why do I say this? If I just want to see an actionable set of local businesses, local packs are faster to access and easier to understand in terms of layout.SGE is a whole new interface for people to learn without any obvious added benefit to learning it. I did not get into asking SGE further questions in this case study because such activity isn’t basic to basic local search. I want to talk directly to the business after finding it online - not to a bot, given that I have no idea how current its information is.I really don’t like that I don’t get a review interface when clicking on the reviews portion of the SGE pack. It almost feels like an error that nothing comes up.I am really surprised by, and not a fan of, the map disappearing when I click on one of the results. How can it be that Google, which has based its entire local search enterprise out of Google Maps, is letting maps take such a backseat in the local SGE interface?The SGE results for branded searches in no way touch the depth of information provided by a direct look at a Google Business Profile. If Google is betting that people would rather see a bare-bones summary than a novel full of info, then maybe this approach will be popular, but I am not wowed by what I am seeing as the SGE replacement for a GBP. It feels very empty. Looking at a branded SGE result really makes me wonder about the pressure for conversational search to become ‘a thing’. Local search has accustomed us to getting the name, address, phone number, and hours of operation in a neat little package, nicely organized, almost like a list. If you go back and look at the branded SGE result for The Good Earth Market, Google is expecting you to read through paragraphs of text to find this information. In many ways, local search has been like a giant experiment in shorthand, giving you quick data at a click so that you can make fast decisions. Conversational search presumes you want to read a lot and talk a lot before finding a place for a fast box of tacos. Conversational search is a real 180, and I have to wonder if, like voice search, it will struggle to find the kind of use cases that lead to longevity. I remain unconvinced that AI, in general, is a natural match for local search. The introduction of an AI-based review filter has caused havoc in local business reviews, and I feel that this movement towards automation simply takes us further towards a virtual world and further away from the local world that local searchers want. Takeaway: Do your own research and monitor your presence in SGE to see how it evolves. Be wary of hype. Every new thing that is being launched in the AI era comes with claims that it will “change the world forever.” Wait, watch, and see, and keep working on the things that you know work in local. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google SGE: Early Local Search Data"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google SGE: Early Local Search Data"
    },
    {
      "level": "H1",
      "text": "How many local searches return SGE results?"
    },
    {
      "level": "H1",
      "text": "How many SGE results included an SGE local pack?"
    },
    {
      "level": "H1",
      "text": "The big question: Do SGE packs match traditional local packs?"
    },
    {
      "level": "H1",
      "text": "How many businesses are included in SGE local packs?"
    },
    {
      "level": "H1",
      "text": "Is there an escape route out of SGE, and what about the ongoing importance of links and citations?"
    },
    {
      "level": "H1",
      "text": "What about local attributes in SGE?"
    },
    {
      "level": "H1",
      "text": "How standardized are the results when SGE thinks your intent is local?"
    },
    {
      "level": "H1",
      "text": "SGE packs vs. local packs: which is better?"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}