{
  "url": "https://moz.com/blog/sge-stats-whiteboard-friday",
  "slug": "sge-stats-whiteboard-friday",
  "title": "4 Stats About SGE – Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Discover key statistics on Google's Search Generative Experience and their impact on SEO, ads, and user experience. Dive into the latest trends shaping the search landscape in this insightful Whiteboard Friday with Tom Capper.",
  "content": "4 Stats About SGE – Whiteboard Friday Whiteboard Friday | Search Engines | AI and SEO By: Tom Capper September 22, 2023 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Tom Capper September 22, 2023 4 Stats About SGE – Whiteboard Friday Whiteboard Friday | Search Engines | AI and SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Edited by Emilie Martin Discover key statistics on Google's Search Generative Experience and their impact on SEO, ads, and user experience. Dive into the latest trends shaping the search landscape in this insightful Whiteboard Friday with Tom Capper. Click on the whiteboard image above to open a high resolution version in a new tab! Video Transcription Happy Friday, Moz fans. I'm here today to share with you some quick stats, four quick stats about Google's search generative experiences. So in case you've not heard of those before or not seen these before, this is a new kind of search result, a new kind of SERP feature, I suppose that Google started testing earlier this year. Currently, this is not generally rolled out. You can only see this if you are opted in, in Google Labs. You are logged in, you're using Chrome and you have a US IP address, although VPNs do work. So this is maybe a bit of a hint about a direction that Google might be considering. Maybe not. I might publish some blog posts about whether I think they'll stick to this plan but I still think it's interesting to take a look at what they're doing right now and yeah see what we can observe. The structure of Google’s Search Generative Experience So the basic structure of the SGE is, it's stuck onto the top of a search engine results page above all of the other kinds of results and SERP features. And you've got a little warning. So generative AI is experimental. Then a block of of content, normally text, then some questions. So ask a follow-up and then some suggested questions. So for example, I've searched for Mozcon. One of the suggested questions is where is Mozcon? And this would just link through to a follow-up search. And then there's these three links on the right and these look kind of like portrait organic results but they're actually supposed to be the articles that this AI generated text is based on. Key SGE Statistics So what are the stats that I want to share with you? Links in the SGE Well, these three links, I think it's very interesting. You might reasonably assume that this would just be like the top three organic results or something like that but actually that's not the case. So in only 13% of cases in the 100 SGE SERPS that I studied in only 13% of cases, were all three of these links actually present in the top 10 organic. I should say a bit about the data that I'm using here. So this is the top few keywords from every MozCast vertical. So it's a hundred SERPS in total tracked in the US on desktop. So relatively small scale study but enough to get an idea of what's going on here. So yeah, 13% of of SGE SERPs had 100% overlap between these three links. Then also appearing in organic beneath which I think is surprisingly low. And in 41% of cases, there was none at all that none of these links actually appeared in the organic results, which I, yeah I find that very surprising. It shows that this is a different system. This is not built on top of organic. Ads are beneath the SGE The second stat I want to share with you is about ads. So you'll notice I've not put any ads above the the SGE here and that's not an accident. I didn't see that even once, ads when they exist are beneath the SGE, so pushed right down and in only 30% of the SERPs I looked at were there any ads at all? Which I would say is quite low when you're looking at sort of competitive head terms which MozCast keywords are, but also think about how far down they've been pushed. So this is not a particularly commercially great situation for Google if they were to go with this as it is. Suggested questions The third stat I want to share with you is about these questions. So you've got, like I say ask a follow-up and then some suggested questions here. Now these look a bit like people also ask questions. And indeed, often the questions that you see here will also appear in a people also ask box further down. I think that's a bit odd. I think it's very un Google-like to have duplicated functionality like this, got two SERP features that are essentially doing the same thing. Got both people also asked box somewhere further down. And then these questions often even with the same questions. So in 83% of SGE SERPs also had people also ask as a SERP feature, which like I say, I think that makes me think they kind of rushed this, you know if they had thought about this a little bit more maybe they would've changed the SERPs beneath to not include features that are overlapping. I've got some other stats on this that I'll share later on. But this also happens with maps. So if there are maps in this block, then there's normally or often I should say also a local pack further down which is basically the same functionality appearing twice. It's not really very elegant as these things go. What is actually included in the SGE? And that brings me to the last stat I want to share which is about what you actually have in the SGE. So in 70% of cases, this is just raw text, so just like a featured snippet, except obviously AI generated. The next most common is places so you know, location listings. And when that happens, it's a bit odd because these three links tend to just be links to the the Google Maps results or Google local results that are also listed on the map. So again, it kind of comes over as a little bit clumsy. Then 7% of cases you can get products inside here. I did not see when they first demoed this at Google IO they had ads inside the AI generated block. I have never seen that in the wild. I'm not sure they actually have that functionality. It was probably just a mockup or something like this but maybe a statement of intent. So yeah, that's four quick stats about SGEs. The main thing that I would take away, to be honest from my experience collecting this data is that at the moment this is a bit of a half-baked feature. So they probably put it out in a rush to, you know to respond to pressure from competitors and from investors. I imagine this has a long way to go. Anyway, hope you enjoyed that. Hope you found these stats interesting. Thanks. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "4 Stats About SGE – Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "4 Stats About SGE – Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "The structure of Google’s Search Generative Experience"
    },
    {
      "level": "H2",
      "text": "Key SGE Statistics"
    },
    {
      "level": "H3",
      "text": "Links in the SGE"
    },
    {
      "level": "H3",
      "text": "Ads are beneath the SGE"
    },
    {
      "level": "H3",
      "text": "Suggested questions"
    },
    {
      "level": "H3",
      "text": "What is actually included in the SGE?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    }
  ],
  "author": "Tom Capper\n          \n            Tom Capper\n          \n            Tom Capper"
}