{
  "url": "https://moz.com/blog/share-your-microsoft-stack-pains",
  "slug": "share-your-microsoft-stack-pains",
  "title": "Share Your Microsoft Stack Pains - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Over at the Live Search Webmaster Center, we have been hearing a lot from people who are frustrated with the Microsoft stack and some of the inherent challenges with making your site built on the Microsoft stack search friendly.  We recently wrote a post on the Live Search Webmaster Blog asking…",
  "content": "Share Your Microsoft Stack Pains Mobile SEO J By: Jeremiah Andrick September 8, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! J By: Jeremiah Andrick September 8, 2008 Share Your Microsoft Stack Pains Mobile SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Over at the Live Search Webmaster Center, we have been hearing a lot from people who are frustrated with the Microsoft stack and some of the inherent challenges with making your site built on the Microsoft stack search friendly. We recently wrote a post on the Live Search Webmaster Blog asking what is wrong with the Microsoft stack, and as recently as last week there was also a discussion that was started on the WebmasterWorld Forums related to the subject. As part of our role as ambassadors to the Search community here at Microsoft, we are also seeking feedback from the SEOmoz community to help us understand how Microsoft can improve our products to ensure they are search friendly. In our post we offered the following food for thought about what might be an issue: Bad default settings - What settings are poorly configured by default? What should the correct setting be (e.g., IIS using 302 redirects by default)? Too hard - What is possible, but simply too hard to do? If this is done well on another platform, that would be helpful to know as well (e.g., re-architecting the link structure on a site while not breaking the links of the old site). Limited capabilities - Are their capabilities that we just don't have, but would really make your lives easier as SEO-savvy web developers (e.g., need to have multiple URL entry points into silverlight application)? Bugs - What just doesn't work right today (e.g., URL rewriting in ASP.Net using 302's to redirect links)? Considering the potential problems above, if you have feedback that you would like us to take to the engineers responsible for the stack, let us know but be as specific as possible. We are committed to taking your feedback to the right product teams and driving to the best possible solutions to create a friendlier for search Microsoft stack. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Share Your Microsoft Stack Pains"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Share Your Microsoft Stack Pains"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too"
    },
    {
      "level": "H3",
      "text": "Internal Linking for Mobile-First & Mobile-Only Indexing"
    },
    {
      "level": "H3",
      "text": "All About Fraggles (Fragment + Handle)"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jeremiah Andrick\n          \n            Jeremiah Andrick\n          \n            Jeremiah Andrick"
}