{
  "url": "https://moz.com/blog/should-domain-authority-be-used-to-determine-which-backlinks-to-remove",
  "slug": "should-domain-authority-be-used-to-determine-which-backlinks-to-remove",
  "title": "Should Domain Authority Be Used To Determine Which Backlinks To Remove? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Since the infamous Penguin Update, many webmasters have been scrambling to remove backlinks Google may have penalized them for (a.k.a. high risk links, toxic links, bad links, etc.). But how do you determine which links are toxic and should be removed?",
  "content": "Should Domain Authority Be Used To Determine Which Backlinks To Remove? Advanced SEO By: Adam Thompson November 12, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Adam Thompson November 12, 2012 Should Domain Authority Be Used To Determine Which Backlinks To Remove? Advanced SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Since the infamous Penguin Update, many webmasters have been scrambling to remove backlinks Google may have penalized them for (a.k.a. high risk links, toxic links, bad links, etc.). But how do you determine which links are toxic and should be removed? There seems to be a growing discussion as to whether Domain Authority should be used to determine which links are high quality vs which links are toxic and should be removed. I assume this thinking started because many toxic links are from low quality sites with little editorial control, which tend to have low domain authority. But correlation does not equal causation. I believe that using domain authority as a primary metric to determine which links are toxic and should be removed is a potentially dangerous mistake. Here's why... What is domain authority (DA)? According to the official SEOmoz glossary, \"Domain Authority represents SEOmoz's best prediction about how a website will perform in search engine rankings\" and it is calculated by \"combining all of our other link metrics (linking root domains, number of total links, mozRank, mozTrust, etc.) into one single score.\" In other words, domain authority is a measurement of a website's backlinks. What is a toxic or high risk backlink? A toxic or high risk backlink is a link that Google is likely to determine is manipulative, and may penalize. In other words, the link was gained primarily to manipulate search rankings, not to provide value to users. Examples of manipulative links include paid links, link exchanges, spam blogs, and low quality directories. What specific factors does Google use to determine whether a link is manipulative? I have seen a couple of correlative studies, including one very extensive study, intended to determine what factors are associated with a natural link profile vs. what factors are associated with a Penguin (or other link based) algorithmic penalty. The factors identified were: Anchor text. Sites that had an overly high percentage of backlinks that used “money keywords” as anchor texts were more likely to be penalized. Natural link profiles included more branded and URL anchor texts. Relevance. Sites that had an overly high percentage of backlinks from sites that were on unrelated topics were more likely to be penalized. If you want to read the studies in more detail, here they are: Penguin Analysis: SEO Isn’t Dead, But You Need to Act Smarter Anchor Text Optimization Case Study: What’s Natural? Post-Penguin SEO Link Building: The Naked (URL) Truth Also worth reading are these three penalty recovery case studies, which show that at least in these specific cases, the penalties were related to keyword and/or sitewide links: Recovering from an Over Optimization Penalty - A True Story How WPMU.org Recovered From The Penguin Update Case Study: How to Remove a Google Penalty with Majestic SEO Why doesn't domain authority indicate whether a link is toxic or not? Domain Authority doesn't measure or relate to anchor text or content relevance, both of which have been found to be linked to Penguin penalties. Domain Authority doesn't relate to intent (i.e. was the link intended for SEO alone, or is its primary purpose to benefit users), which is what Matt Cutts and Google tend to talk about when discussing whether a link might be penalized. In my opinion, Domain Authority doesn't measure the most important factors which would help determine whether a link is likely to be penalized or not (anchor text, site relevance, intent, etc.). You could easily have a high DA backlink that is being penalized, and a low DA backlink that isn't being penalized. In fact, I did some quick checks and found manipulative backlinks placed on sites with 82 domain authority. While penalized links may often be on domains with low DA, I suspect that is because penalized links are on low quality sites, which tend to be low DA. It's easier to get spammy links from low quality websites, and low quality websites generally don't get many good backlinks and hence have low DA. There are plenty of high quality websites that have low DA, though, and a link from such a site could be very valuable. Examples of high DA links which could be toxic: A paid link on a high PageRank/ DA website Keyword anchor text forum signature links on a high PageRank/ DA website A sitewide link on an unrelated high PageRank/ DA website A keyword anchor text sitewide link on a high PageRank/ DA website Examples of low DA links that could be natural: A link from a relevant, high quality website that is new and hasn't yet built much authority A link from a small niche website that's tightly targeted to a specific geographic area or topic that is relevant to your website A link from the personal website of an expert in your industry A link from a small local website in your industry My conclusion: Don't go out and delete links just because they are on a site with low domain authority. I'd rather have a natural, editorial link from a quality site with 25 or 30 domain authority than an unnatural link from a site with 50 domain authority. What factors should be used to determine which links to remove? Here are some of the questions I have used to help determine whether a link should be removed or not. These questions are based on Google's statements, my observations, and the aforementioned studies. What was the intent of the link? Is it designed to help users, or just to get better Google rankings? Is the link on a site/page that is not topically related to your website? Was the link purchased? Does the link use a keyword phrase as the anchor text? Is the link sitewide or in a footer (possible risk factors)? Was the link editorially given by the webmaster? Is the link on a site banned or penalized by Google? Is the linking site part of a network of sites (especially if the network of site has low trust metrics or other spammy-characteristics)? Is the link on a page with spun, low quality, or duplicate content? I'd love to hear from other Mozzers: What factors do you like to use to determine whether a link is toxic and should be removed? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Should Domain Authority Be Used To Determine Which Backlinks To Remove?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Should Domain Authority Be Used To Determine Which Backlinks To Remove?"
    },
    {
      "level": "H2",
      "text": "What is domain authority (DA)?"
    },
    {
      "level": "H2",
      "text": "What is a toxic or high risk backlink?"
    },
    {
      "level": "H2",
      "text": "What specific factors does Google use to determine whether a link is manipulative?"
    },
    {
      "level": "H2",
      "text": "Why doesn't domain authority indicate whether a link is toxic or not?"
    },
    {
      "level": "H2",
      "text": "What factors should be used to determine which links to remove?"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Adam Thompson\n          \n            Adam Thompson\n          \n            Adam Thompson"
}