{
  "url": "https://moz.com/blog/should-a-comment-be-worth-more-than-a-thumb",
  "slug": "should-a-comment-be-worth-more-than-a-thumb",
  "title": "Should A Comment Be Worth More Than A Thumb? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Those of you who don't know me may be suprised than I'm a big of an ego searcher (no sniggering Rebecca & Lisa). This isn't due to any serious God complex or anything, it's just fact that blogging still gives me the childish thrill of seeing my name at the top of a published article. Which is quite…",
  "content": "Should A Comment Be Worth More Than A Thumb? Moz News C By: Ciaran Norris July 6, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! C By: Ciaran Norris July 6, 2007 Should A Comment Be Worth More Than A Thumb? Moz News This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Those of you who don't know me may be surprised that I'm a big of an ego searcher (no sniggering Rebecca & Lisa). This isn't due to any serious God complex or anything, it's just fact that blogging still gives me the childish thrill of seeing my name at the top of a published article, which is quite something for someone who always wanted to be a journalist. As part of this (and also to make it easier to keep up with all the great content on YOUmoz), I often use the Popular YOUmoz entries page to see whether a) people have enjoyed my posts, & b) what great articles I've missed. This list is ordered based on the numbers of thumbs up & down an article has received. So if an article, for instance mine on grammar in blogging, has received 12 thumbs up & 2 thumbs down, this will mean that it ranks below an article which has received 10 thumbs up, but none down. And what I've been wondering is, is this the best way to order them? I wrote quite a while ago about how people seemed to have fallen out of love with the thumbs, after the first rush of excitement following the re-launch. So, if this is the case, should the amount of discussion that a post has generated be taken into account when deciding which have been most popular? This would perhaps mean that a post which has provoked a lot of negative & positive reaction would be considered more 'popular' than one which got several thumbs up, but didn't provoke conversation. Perhaps comments could be taken into account as a weighting factor, with thumbs still the primary part of the formula. After all, as the mini-discussion about fish & chips over on Rand's recent post (for which I must take some blame) has shown, not all comments are equal. I should add here that I'm not writing this because I think any of my previous posts should be higher on the popularity list - all those ahead of me are great articles, which thoroughly deserve their place. What I am trying to do though is provoke a discussion about the value of, well, discussion. And isn't that what makes YOUmoz, and even SEOmoz, so great? I'm the SEO Director at London-based full service digital agency Altogether (our web-site is in incubation at the moment, but you can see what we do on our blog). And I'm expecting to get a whole heap of down thumbs for this article. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Should A Comment Be Worth More Than A Thumb?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Should A Comment Be Worth More Than A Thumb?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ciaran Norris\n          \n            Ciaran Norris"
}