{
  "url": "https://moz.com/blog/should-you-optimize-your-site-for-each-individual-search-engine",
  "slug": "should-you-optimize-your-site-for-each-individual-search-engine",
  "title": "Should You Optimize Your Site For Each Individual Search Engine? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I was reading through Search Engine Land today (as I do every day--kissuptodannykissuptodanny) and came across the following blurb in Stoney deGeyter's 10 Useless SEO Worries post:\n\nDon't think that you need to optimize a page for each search engine. It doesn't work that way. Just do good…",
  "content": "Should You Optimize Your Site For Each Individual Search Engine? Moz News By: Rebecca Kelley November 1, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley November 1, 2007 Should You Optimize Your Site For Each Individual Search Engine? Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I was reading through Search Engine Land today (as I do every day--kissuptodannykissuptodanny) and came across the following blurb in Stoney deGeyter's 10 Useless SEO Worries post: Don't think that you need to optimize a page for each search engine. It doesn't work that way. Just do good optimization and all engines will rate you accordingly. Now, you should be concerned about making sure each engine finds your web site and that it is relevant for your key search phrases. But don't make drastic changes to your pages because Ask or Microsoft has you at page 2 while Google has you at the top of page 1. Not unless you absolutely know those changes won't cause a drop in your Google rankings. If you're uncertain, or if you make those changes and see Ask move up and Google move down, by all means change it back. It's just not worth it. After that, I read Shari Thurow's post, Understanding Search Usability. Here's what she had to say: Search-friendly design is user-centered or usage-centered design. The focus is on end users. Search engine-friendly design, on the other hand, is a design for information retrieval systems only. Want your web site to show up in the top 10 results in Google? Then design a web site only for Google. Want your web site to show up in the top 10 results in Yahoo? Then design a web site for Yahoo. While you're at it, design a site for Microsoft Live and one for Ask.com. Cloak all of these sites and make sure you redirect them to the \"real\" site when you believe you have detected an actual human user. Lather, rinse, repeat. Shari isn't saying that you should SEO for each engine per se; rather, the gist is that Google, Yahoo, and MSN users are different. Nevertheless, it was kind of funny reading what Stoney wrote and then reading Shari essentially recommending the opposite strategy. I asked my favorite Victorian SEO (other than Jen Slegg and Jim Hedger, of course), Todd Friesen, what his thoughts were, and he said, \"It's not like you need a different site for MSN users vs. Google users. I do one size fits all SEO, because by and large it does.\" Wise words, Todd; however, this question pops up in our Q&A section and elsewhere every so often. It's interesting how many people get upset that they're ranked highly in Google, but less so in Yahoo/MSN, and whether they should have a \"Yahoo\" version of their site so it'll rank higher. I chatted with Lyndon Antcliff about this, and his response was perfect: \"The return is hardly worth the effort. Of course, this may change...which is the great thing about SEO. :)\" Think about that. Is it worth the effort to optimize your site for every major search engine? Think about all of the things that differentiate one from another, and how you'd have to take all of those factors into account and craft several versions of your pages that you'll show to the appropriate search engine and user. \"Well, Google emphasizes links but Yahoo likes keyword density and MSN prefers that you sacrifice a goat, while Ask requires jelly beans and argghhhhghhghgh...\" Plus, overcompensating for one engine could tip the scale and hurt your rankings in another. I think that keeping in mind general best practices (for guidance, check out our Search Engine Ranking Factors, as well as SEO Book's How Search Engines Work piece) is more than adequate enough when optimizing for the various search engines, because trying to spread yourself too thin by focusing on all three could result in problems across the board. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Should You Optimize Your Site For Each Individual Search Engine?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Should You Optimize Your Site For Each Individual Search Engine?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}