{
  "url": "https://moz.com/blog/should-there-be-a-googleus-for-the-united-states",
  "slug": "should-there-be-a-googleus-for-the-united-states",
  "title": "Should there be a Google.us for the United States? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Ian (who has now been the subject of 3 posts at SEOmoz) McAnerin asks at SEW if Google should have a .us domain for United States based searches. After all, there is a Google regio...",
  "content": "Should there be a Google.us for the United States? Search Engines By: Rand Fishkin June 13, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin June 13, 2005 Should there be a Google.us for the United States? Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Ian (who has now been the subject of 3 posts at SEOmoz) McAnerin asks at SEW if Google should have a .us domain for United States based searches. After all, there is a Google regional for every other country of relative size or global importance, yet Google.com upsets both international users who feel that it should be more representative and US based users who notice that Google.com is not directly, geographically geared towards them. Ian's poll shows a slight majority at SEW acutally preferring a change to Google.us and making Google.com international. My vote is to keep it the way it is, since so much could be lost from an SEO's business perspective if Google.com and Google.us were to split and provide different results. I guess I'm just stuck with a case of the \"Not In My Back Yard\" (or NIMBY) syndrome. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Should there be a Google.us for the United States?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Should there be a Google.us for the United States?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}