{
  "url": "https://moz.com/blog/simple-regression-tool",
  "slug": "simple-regression-tool",
  "title": "Simple Regression Tool - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This may not apply directly to a lot of SEOs, but an automated regression analysis is what allowed me to build most of the SEOmoz tools' reports accurately. This sweet l...",
  "content": "Simple Regression Tool Moz News By: Rand Fishkin September 30, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 30, 2005 Simple Regression Tool Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This may not apply directly to a lot of SEOs, but an automated regression analysis is what allowed me to build most of the SEOmoz tools' reports accurately. This sweet little page (watch out for frames) will allow you to plugin a data set and have an equation returned to \"best match\" the data. Infinitely useful for all sorts of applications, not least of which are ranking how valuable 500,000 links are vs. 50,000 (as reported by Yahoo's new site explorer). Many thanks Messrs. Werner & Costenoble! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Simple Regression Tool"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Simple Regression Tool"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}