{
  "url": "https://moz.com/blog/simply-the-best-2016-top-content",
  "slug": "simply-the-best-2016-top-content",
  "title": "Simply the Best: 2016's Top Content from the Moz Blog - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "With every click, visit, thumbs-up, and comment, you voted for the best Moz Blog content of 2016. Revisit your favorite posts and check out what you might have missed throughout the year!",
  "content": "Simply the Best: 2016's Top Content from the Moz Blog Content Marketing | Advanced SEO | Moz News By: Felicia Crawford January 12, 2017 Table of Contents Copied! By: Felicia Crawford January 12, 2017 Simply the Best: 2016's Top Content from the Moz Blog Content Marketing | Advanced SEO | Moz News Now that we've comfortably settled into the first two weeks of 2017, it's time to revive an annual Moz Blog tradition: the Best of 2016 is here! I've carefully collected data on all the posts, comments, and commenters you remarkable readers liked the most this past year, compiling it all into one big, beautiful blog post. You'll laugh, you'll cry, you'll rue the day you ever downloaded Pocket. But as we commence our journey into the insights and revelations of yesteryear, my sincere hope is that you'll feel inspired. That you'll learn something new, or reflect on what's changed. That you'll tack a new task onto your bucket list (\"Become a Moz Top Commenter\" is way more hip than traveling to all 7 continents, people). Flip on some classic Tina Turner to set the mood and join me as we sift through what you decided was simply the best of 2016. Table of Contents Top posts by 1Metric score Top posts by unique visits Top YouMoz posts by unique visits Top posts by number of thumbs up Top posts by number of comments Top community comments by thumbs up Top commenters by total thumbs up New: Category-specific RSS feeds! 1. The top 10 posts according to our 1Metric score1Metric is our handy-dandy internal metric that measures how well a piece of content is doing. There were quite a few high scores in 2016, with a clear, strong trend toward core SEO topics. You might notice some posts making it onto a few different lists — consider those the absolute must-reads, and make sure you didn't miss anything big! 1. 8 Old School SEO Practices That Are No Longer Effective - Whiteboard Friday by Rand Fishkin, April 29th Are you guilty of living in the past? Using methods that were once tried-and-true can be alluring, but it can also prove dangerous to your search strategy. In today's Whiteboard Friday, Rand spells out eight old school SEO practices that you should ditch in favor of more effective and modern alternatives. 2. My Single Best SEO Tip for Improved Web Traffic by Cyrus Shepard, January 27th\"If content is king, then the user is queen, and she rules the universe.\" Are you focusing too much on the content, rather than the user? In his last post as a Mozzer, Cyrus Shepard offers his single greatest SEO tip for improving your web traffic. 3. On-Page SEO in 2016: The 8 Principles for Success - Whiteboard Friday by Rand Fishkin, May 13thOn-page SEO is no longer a simple matter of checking things off a list. There's more complexity to this process in 2016 than ever before, and the idea of \"optimization\" both includes and builds upon traditional page elements. In this Whiteboard Friday, Rand explores the eight principles you'll need for on-page SEO success going forward. 4. 301 Redirects Rules Change: What You Need to Know for SEO by Cyrus Shepard, August 1stGoogle blew our minds when they said 3xx redirects no longer lose PageRank. Cyrus is here to give you the low-down on what this means for SEO. 5. 10 Predictions for 2016 in SEO & Web Marketing by Rand Fishkin, January 5thRand examines the accuracy on his predictions for 2015 and, if he does well enough, taps into his psychic ability to predict 2016. Spoiler alert: He's pretty accurate. 6. 8 Rules for Choosing a Domain Name - Whiteboard Friday by Rand Fishkin, July 15th8 rules for choosing a domain name: Make it brandable, pronounceable, short, intuitive, bias to .com, avoid names that infringe on another company, use broad keywords, and if not available, modify. 7. Can SEOs Stop Worrying About Keywords and Just Focus on Topics? - Whiteboard Friday by Rand Fishkin, February 5thShould you ditch keyword targeting entirely? There's been a lot of discussion around the idea of focusing on broad topics and concepts to satisfy searcher intent, but it's a big step to take and could potentially hurt your rankings. In today's Whiteboard Friday, Rand discusses old-school keyword targeting and new-school concept targeting, outlining a plan of action you can follow to get the best of both worlds. 8. Weird, Crazy Myths About Link Building in SEO You Should Probably Ignore - Whiteboard Friday by Rand Fishkin, September 9thFrom where to how to when, there are a number of erroneous claims about link building floating around the SEO world. In today's Whiteboard Friday, Rand sets the record straight on 8 of the more common claims he's noticed lately. 9. How Long Does Link Building Take to Influence Rankings? by Kristina Kledzik, August 21stThe eternal question: How much time does it take for a link to affect rankings? Kristina Kledzik breaks out the entire process from start to finish. 10. SEO for Bloggers: How to Nail the Optimization Process for Your Posts - Whiteboard Friday by Rand Fishkin, June 3rdWith the right process and a dose of patience, SEO success is always within reach — even if you're running your own blog. Optimizing your blog posts begins as early as the inception of your idea, and from then on you'll want to consider your keyword targeting, on-page factors, your intended audience, and more. In this Whiteboard Friday, Rand spells out a step-by-step process you can adopt to help increase search traffic to your blog over time. 2. The top 10 blog posts by unique visitsRand and his Whiteboard Fridays steal the show this year, with some fantastic cameos by our good friends Cyrus and Dr. Pete, and a promoted YouMoz post that's worth its backlinks in gold. One interesting thing to note: You really loved last year's \"Predictions for SEO\" post. While 2016 was unpredictable on multiple levels, Rand still made the cut — be sure to check out his predictions for 2017, released just yesterday. 1. 8 Old School SEO Practices That Are No Longer Effective - Whiteboard Friday by Rand Fishkin, April 29thAre you guilty of living in the past? Using methods that were once tried-and-true can be alluring, but it can also prove dangerous to your search strategy. In today's Whiteboard Friday, Rand spells out eight old school SEO practices that you should ditch in favor of more effective and modern alternatives. 2. 8 Rules for Choosing a Domain Name - Whiteboard Friday by Rand Fishkin, July 15th8 rules for choosing a domain name: Make it brandable, pronounceable, short, intuitive, bias to .com, avoid names that infringe on another company, use broad keywords, and if not available, modify. 3. My Single Best SEO Tip for Improved Web Traffic by Cyrus Shepard, January 27th\"If content is king, then the user is queen, and she rules the universe.\" Are you focusing too much on the content, rather than the user? In his last post as a Mozzer, Cyrus Shepard offers his single greatest SEO tip for improving your web traffic. 4. On-Page SEO in 2016: The 8 Principles for Success - Whiteboard Friday by Rand Fishkin, May 13thOn-page SEO is no longer a simple matter of checking things off a list. There's more complexity to this process in 2016 than ever before, and the idea of \"optimization\" both includes and builds upon traditional page elements. In this Whiteboard Friday, Rand explores the eight principles you'll need for on-page SEO success going forward. 5. Title Tag Length Guidelines: 2016 Edition by Dr. Pete, May 31stGoogle is testing a wider left-column, and with it, wider display titles. We dig into the data to see how long your titles should be. TL;DR? Stick to under 60 characters. 6. 301 Redirects Rules Change: What You Need to Know for SEO by Cyrus Shepard, August 1stGoogle blew our minds when they said 3xx redirects no longer lose PageRank. Cyrus is here to give you the low-down on what this means for SEO. 7. 10 Predictions for 2016 in SEO & Web Marketing by Rand Fishkin, January 5thRand examines the accuracy on his predictions for 2015 and, if he does well enough, taps into his psychic ability to predict 2016. Spoiler alert: He's pretty accurate. 8. How to Achieve 100/100 with the Google Page Speed Test Tool by Felix Tarcomnicu, April 3rdThe website loading speed is imperative for the overall user experience, and it’s also one of the hundreds of SEO ranking factors. The truth is that nowadays, people don’t have the patience to wait more than five seconds for a page to load. If your website is not loading fast enough, you will lose potential customers. 9. Targeted Link Building in 2016 - Whiteboard Friday by Rand Fishkin, January 29thSEO has much of its roots in the practice of targeted link building. And while it's no longer the only core component involved, it's still a hugely valuable factor when it comes to rank boosting. In this week's Whiteboard Friday, Rand goes over why targeted link building is still relevant today and how to develop a process you can strategically follow to success. 10. How to Create 10x Content - Whiteboard Friday by Rand Fishkin, March 18thHave you ever actually tried to create 10x content? It's not easy, is it? Knowing how and where to start can often be the biggest obstacle you'll face. In today's Whiteboard Friday, Rand talks about how good, unique content is going to die, and how you can develop your own 10x content to help it along. 3. The top 10 YouMoz posts by unique visitsLate in 2016, we lost another old friend. And while YouMoz can't claim to have sung the best song about an astronaut you'll ever hear, we still loved it dearly while it was with us. Retiring our process for community contributions was a hard but ultimately necessary decision, and while we hope to have a newer, sleeker process in place someday, let's take a moment to revisit the most popular posts from the final year of YouMoz. 1. How to Use Six Google Analytics Reports to Complete a Website Content Audit by Daniel Hochuli, February 18thIn this article, I will show you how a content audit with six important Google Analytics reports can help you make some smart decisions about the health of your current site, what your audience wants from your content, and how you can benchmark your performance for future content marketing efforts. 2. How to Find and Fix Structured Data Markup Errors via the Google Search Console by Al Gomez, April 7thMake your content easier for the search bots to read by eliminating data markup errors from your website. 3. 5 Essential E-Commerce Rich Snippets for Your Store by Aleh Barysevich, February 2ndWhen it comes to online marketing bang for your buck, rich snippets are hard to beat. 4. 5 YouTube Tools to Boost Your Content Marketing Efforts by Ann Smarty, March 3rdYouTube marketing can be overwhelming. Ann Smarty shares her favorite video marketing tools that let you discover more opportunities and allow you to achieve better results. 5. Here’s How to Automate Google Analytics Reporting with Google Sheets by Gabriele Toninelli, February 25thWhen it comes to automating your Google Analytics reporting, Google Sheets is your friend. 6. How to Perform an Image Optimization Audit by Ryan Ayres, January 20thHave you made image optimization a priority for your website? If not, there's no time like the present. 7. Here’s How My 5-Step YouTube Optimization Strategy Generated 5,121,327 Views by Amir Jaffari, January 28thIn this article, Amir Jaffari explains how following a 5-step process enabled him to increase his annotation CTR by 22,400% (from 0.2% to 45%), how he received 150,000 views from annotations, and how this resulted in millions of views. 8. Hacking Facebook’s Local Awareness Ads: 5 Advanced Tips by Garrett Mehrguth, January 26thFor years, local businesses relied solely on direct mail, stickers, flyers, referrals, and word of mouth. These were the life-blood of their business. Now, in the digital age, we can replace these tactics with a more affordable digital channel that has the power to bolster all of our other marketing channels. 9. 10 Simple Steps for Creating a Blog Your Readers Will Adore by Martina Mercer, March 21stThe keys to making your blog a success is knowing who'll be reading it and what they desire in the way of content. 10. Here’s How to Visually Map a Content Strategy by Katy Katz, June 13thWhen it comes to building a content strategy to guide your brand, seeing is believing, so creating a visual roadmap can help mightily. 4. The top 10 posts by number of thumbs upIf the heated debate in 2016 was whether technical SEO was necessary or important, the trends here suggest an answer: it is. While you'll see some overlap with our top posts by 1Metric here, be sure you don't miss Dave Sottimano's challenging (yet rewarding) task list for Junior SEOs or Mike King's masterpiece analysis of the technical SEO renaissance. 1. My Single Best SEO Tip for Improved Web Traffic by Cyrus Shepard, January 27th\"If content is king, then the user is queen, and she rules the universe.\" Are you focusing too much on the content, rather than the user? In his last post as a Mozzer, Cyrus Shepard offers his single greatest SEO tip for improving your web traffic. 2. On-Page SEO in 2016: The 8 Principles for Success - Whiteboard Friday by Rand Fishkin, May 13thOn-page SEO is no longer a simple matter of checking things off a list. There's more complexity to this process in 2016 than ever before, and the idea of \"optimization\" both includes and builds upon traditional page elements. In this Whiteboard Friday, Rand explores the eight principles you'll need for on-page SEO success going forward. 3. Can SEOs Stop Worrying About Keywords and Just Focus on Topics? - Whiteboard Friday by Rand Fishkin, February 5thShould you ditch keyword targeting entirely? There's been a lot of discussion around the idea of focusing on broad topics and concepts to satisfy searcher intent, but it's a big step to take and could potentially hurt your rankings. In today's Whiteboard Friday, Rand discusses old-school keyword targeting and new-school concept targeting, outlining a plan of action you can follow to get the best of both worlds. 4. 8 Old School SEO Practices That Are No Longer Effective - Whiteboard Friday by Rand Fishkin, April 29thAre you guilty of living in the past? Using methods that were once tried-and-true can be alluring, but it can also prove dangerous to your search strategy. In today's Whiteboard Friday, Rand spells out eight old school SEO practices that you should ditch in favor of more effective and modern alternatives. 5. Weird, Crazy Myths About Link Building in SEO You Should Probably Ignore - Whiteboard Friday by Rand Fishkin, September 9thFrom where to how to when, there are a number of erroneous claims about link building floating around the SEO world. In today's Whiteboard Friday, Rand sets the record straight on 8 of the more common claims he's noticed lately. 6. Linking Internally and Externally from Your Site - Dangers, Opportunities, Risk and Reward - Whiteboard Friday by Rand Fishkin, April 15thNavigating linking practices can be a treacherous process. Sometimes it feels like a penalty is lurking around every corner. In today's Whiteboard Friday, Rand talks about the ins and outs of linking internally and externally, identifying pitfalls and opportunities both. 7. Targeted Link Building in 2016 - Whiteboard Friday by Rand Fishkin, January 29thSEO has much of its roots in the practice of targeted link building. And while it's no longer the only core component involved, it's still a hugely valuable factor when it comes to rank boosting. In this week's Whiteboard Friday, Rand goes over why targeted link building is still relevant today and how to develop a process you can strategically follow to success. 8. An Essential Training Task List for Junior SEOs by David Sottimano, August 10thWith 5 detailed projects that drag you through the technical trenches, this customizable training program for Junior SEOs should put you on the road to skill mastery (and a nice career edge) in just a couple of months. 9. The Technical SEO Renaissance: The Whys and Hows of SEO’s Forgotten Role in the Mechanics of the Web by Michael King, October 25thTechnical SEO is more complicated and more important than ever before, while much of the SEO discussion has shied away from its growing technical components in favor of content marketing. Mike King makes a compelling case for exactly why and how a returned focus on technical SEO will rejuvenate and revolutionize the search game. 10. A Step-by-Step Process for Discovering and Prioritizing the Best Keywords - Whiteboard Friday by Rand Fishkin, May 6thRand outlines a straightforward and actionable 4-step process (including an array of tools to check out) for uncovering and prioritizing the best keywords for your SEO campaigns. 5. The top 10 posts by comment volumeBy the end of 2016, commenting on the Moz Blog took a sharp 180°. We implemented sophisticated filters to catch a higher volume of spam, with even more improvements in the works. I declared it my personal quest to improve comment quality (I can only deny so many invitations to join the Illuminati before it starts to get freaky), and we worked to spark creative discussion from the get-go. Without further ado, I give you the top blog posts in 2016 that struck a chatty chord: 1. My Single Best SEO Tip for Improved Web Traffic by Cyrus Shepard, January 27th\"If content is king, then the user is queen, and she rules the universe.\" Are you focusing too much on the content, rather than the user? In his last post as a Mozzer, Cyrus Shepard offers his single greatest SEO tip for improving your web traffic. 2. 8 Old School SEO Practices That Are No Longer Effective - Whiteboard Friday by Rand Fishkin, April 29thAre you guilty of living in the past? Using methods that were once tried-and-true can be alluring, but it can also prove dangerous to your search strategy. In today's Whiteboard Friday, Rand spells out eight old school SEO practices that you should ditch in favor of more effective and modern alternatives. 3. Weird, Crazy Myths About Link Building in SEO You Should Probably Ignore - Whiteboard Friday by Rand Fishkin, September 9thFrom where to how to when, there are a number of erroneous claims about link building floating around the SEO world. In today's Whiteboard Friday, Rand sets the record straight on 8 of the more common claims he's noticed lately. 4. Linking Internally and Externally from Your Site - Dangers, Opportunities, Risk and Reward - Whiteboard Friday by Rand Fishkin, April 15thNavigating linking practices can be a treacherous process. Sometimes it feels like a penalty is lurking around every corner. In today's Whiteboard Friday, Rand talks about the ins and outs of linking internally and externally, identifying pitfalls and opportunities both. 5. How to Build a Facebook Funnel That Converts - Whiteboard Friday by Ryan Stewart, October 14thAre you getting the most out of your Facebook ads? In this guest-hosted Whiteboard Friday, Ryan Stewart outlines his process for using remarketing and targeted content creation to boost conversions. 6. How Long Does Link Building Take to Influence Rankings? by Kristina Kledzik, August 21stThe eternal question: How much time does it take for a link to affect rankings? Kristina Kledzik breaks out the entire process from start to finish. 7. Accidental SEO Tests: How 301 Redirects Are Likely Impacting Your Brand by Brian Wood, January 19thThose 301 redirects could be more costly to your brand than you previously imagined. Brian Wood dives into the results of an accidental SEO test that turned out to be serendipitous. 8. The 9 Most Common Local SEO Myths, Dispelled by Joy Hawkins, April 19thHave you taken any of these statements as truth? In this post, Google My Business Top Contributor Joy Hawkins shares and debunks the Local SEO myths she runs into most frequently. 9. 301 Redirects Rules Change: What You Need to Know for SEO by Cyrus Shepard, August 1stGoogle blew our minds when they said 3xx redirects no longer lose PageRank. Cyrus is here to give you the low-down on what this means for SEO. 10. Four Ads on Top: The Wait Is Over by Dr. Peter J. Meyers, February 19thIn a 2-week timeframe, Google AdWords top ad blocks with 4 ads jumped from 1% to 36%, and right-column ads disappeared entirely (moving to the bottom-left position). 6. The top 10 community comments by thumbs upOne of the best things about the Moz Blog is what happens in the comments section. You folks support each other immensely, and that's nowhere as apparent as in how you interact. The top comments from 2016 tended to be on the longer side, thoughtful, TAGFEE, and full of love and concern for our Moz community when times got rough. These are the top comments from 2016, as voted by you. 1. Gianluca Fiorelli | August 17thCommented on Moz is Doubling Down on Search 2. Gianluca Fiorelli | February 5thCommented on Can SEOs Stop Worrying About Keywords and Just Focus on Topics? - Whiteboard Friday 3. Rand Fishkin | March 28thCommented on Are Keywords Really Dead? An Experiment 4. Mark Jackson | August 17thCommented on Moz is Doubling Down on Search 5. Devendra Saxena | February 19thCommented on Four Ads on Top: The Wait Is Over 6. Gianluca Fiorelli | March 18thCommented on How to Create 10x Content - Whiteboard Friday 7. Tomek Obirek | April 15thCommented on Linking Internally and Externally from Your Site - Dangers, Opportunities, Risk and Reward - Whiteboard Friday 8. Gianluca Fiorelli | August 2ndCommented on Wake Up, SEOs – the NEW New Google is Here 9. Gianluca Fiorelli | January 27thCommented on My Single Best SEO Tip for Improved Web Traffic 10. Wil Reynolds | September 8thCommented on The Future of the Moz Community 7. The top 10 community member commenters by total thumbs upWhen you're in charge of the Moz Blog, you get to know your regular commenters. These folks put a great deal of time and effort into stating facts, asking questions, and more than anything else, reading. Say hello to the top community commenters of 2016 by total thumbs up earned! 1. Shalu Singh, username ShalusinghMozPoints: 505 | Rank: 214 2. Larry Kim, username larry.kimMozPoints: 2,809 | Rank: 34 3. Samuel Scott, username SamuelScottMozPoints: 3,694 | Rank: 25 4. Mustansar Iqbal, username IkkieMozPoints: 1,026 | Rank: 127 5. Joe Robison, username Joe.RobisonMozPoints: 1,218 | Rank: 111 6. Joy Hawkins, username JoyHawkinsMozPoints: 580 | Rank: 190 7. Tom Capper, username Tom.CapperMozPoints: 905 | Rank: 134 8. Tomas Vaitulevicius, username TomasVaituleviciusMozPoints: 200 | Rank: 566 9. Alexandra Tachalova, username Alex-TMozPoints: 468 | Rank: 224 10. Jennifer Slegg, username jenstarMozPoints: 784 | Rank: 147 Category-specific RSS feeds (Whiteboard Friday fans, rejoice!)Historically, the only way to subscribe to Moz Blog updates via RSS feed was to commit to the entire thing — every post, every topic, even if you were only into content marketing and didn't care a fig for anything technical. That was back in 2016, though. In this bold new odd-numbered world, we now have RSS feeds for our most popular categories. Whiteboard Friday devotees, it's time to party. Here's a list of feeds you can now subscribe to; if you have a desire to follow a category we haven't covered here, let me know in the comments and we may be able to make it a reality. Advanced SEO Whiteboard Friday Moz ToolsLocal SEO On-Page SEO Link Building Keyword Research Technical SEO Conversion Rate Optimization Basic SEO Content (also includes Blogging, Copywriting, Email Marketing, and Video categories) Paid Search Marketing (PPC) and Online Advertising Analytics and Reporting Social Media and Public Relations Onward and upward!Thanks to everyone who works and plays so hard to keep the Moz community thriving; this place could never be what it is without our readers, commenters, authors, and behind-the-scenes Mozzers. Much earnest thanks to Moz Blog veteran Trevor Klein for some key SQL help, which made my life while writing this post easier by leaps and bounds. I can't wait to see what our next year brings. Hope to see you somewhere on this list come 2018! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Simply the Best: 2016's Top Content from the Moz Blog"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Simply the Best: 2016's Top Content from the Moz Blog"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H2",
      "text": "1. The top 10 posts according to our 1Metric score"
    },
    {
      "level": "H2",
      "text": "2. The top 10 blog posts by unique visits"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "3. The top 10 YouMoz posts by unique visits"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "4. The top 10 posts by number of thumbs up"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "5. The top 10 posts by comment volume"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "6. The top 10 community comments by thumbs up"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "7. The top 10 community member commenters by total thumbs up"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "Category-specific RSS feeds (Whiteboard Friday fans, rejoice!)"
    },
    {
      "level": "H2",
      "text": "Onward and upward!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Felicia Crawford\n          \n            Felicia Crawford\n          \n            Felicia Crawford"
}