{
  "url": "https://moz.com/blog/single-best-seo-tip-for-improved-web-traffic",
  "slug": "single-best-seo-tip-for-improved-web-traffic",
  "title": "My Single Best SEO Tip for Improved Web Traffic - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "\"If content is king, then the user is queen, and she rules the universe.\" Are you focusing too much on the content, rather than the user? In his last post as a Mozzer, Cyrus Shepard offers his single greatest SEO tip for improving your web traffic.",
  "content": "My Single Best SEO Tip for Improved Web Traffic On-page SEO | Advanced SEO | SEO Basics By: Cyrus Shepard January 27, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Cyrus Shepard January 27, 2016 My Single Best SEO Tip for Improved Web Traffic On-page SEO | Advanced SEO | SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Howdy Moz Fans, After more than 5 years — including an 18-month hiatus as a Moz associate — tomorrow marks my last day working as a Mozzer. Make no mistake — I love this job, company, and community. Moz has taught me to be a better marketer. Both Rand Fishkin and Sarah Bird (and many others) have taught me more about emotional intelligence and how to treat others than I thought possible of myself. Moz has introduced me to amazing coworkers and industry folk around the world. I’m truly grateful for this experience. Since my first YouMoz post was accepted for publication by Jen Lopez before I even worked here, I’ve done my best to share SEO tips and tactics to help people advance their marketing and improve online visibility. These posts are truly the thing I’m most proud of. Time for one last SEO tip, so I hope it’s a good one... SEO white liesThe beauty of SEO is that, instead of pushing a marketing message onto folks who don’t want to hear what you have to say, you can reverse-engineer the process to discover exactly what people are looking for, create the right content for it, and appear before them at exactly the moment they are looking for it. It’s pull vs. push. Works like magic. Customers come to you. Let’s begin this process by telling a lie. “Content is king.” Bull hockey. The king doesn’t rule jack squat. A truer statement is this: If content is king, then the user is queen, and she rules the universe. Let’s say that again, because this is important. “The user is queen, and she rules the universe.” Google only cares about your content inasmuch as it answers the user’s search query. Search results are not a collection of “good” content; they are a ranked list of content that best satisfies what the user is looking for. Here’s a typical process many SEOs use when building content: Conduct keyword research to discover what people are searching for relative to your niche. Pick a series of high-volume, low-competition phrases Build content around these phrases and topics Launch and market the page. Build some links. Watch the traffic roll in. (Or not) Move on to the next project. The shortcoming of this approach is that 1–4 are often hit or miss. Google’s Keyword Planner, perhaps the best available keyword tool available, is famous for not surfacing most long-tail keywords. Additionally, creating the exact content and building the right links in order for Google to rank you for precise pages is challenging as well. Unfortunately, this where most people stop. My advice: Don’t stop there. This whole process relies on traditional SEO signals to rank your content higher. Signals like keyword usage and PageRank (yes, it’s a real ranking factor). While these factors remain hugely important, they miss the point of where SEO has already moved. In our latest Ranking Factors Expert Survey, we asked over 150 top search marketers to rate which factors they see gaining and losing significance in Google’s algorithm. The results showed that while most traditional SEO features were expected to either retain or decrease in influence, we found that user-based features were expected to increase. In addition to signals like mobile-friendliness, site speed, overall UX, and perceived quality, the factors I want to focus on today include: Page matches the searcher’s intent: In other words, the page has a high probability of being what the user is actually looking for. Search engine results clickstream data: This may include measuring the search results that users actually click, as well as the pogo-sticking effect. Task completion: The user is able to complete the task they set out to do. In other words, their questions have been completely answered. What I am going to talk about is how to improve all three of these factors for underperforming pages at the same time, using a single technique. Here’s the tip: Optimize for how users are actually using the page — as opposed to how you optimized the page ahead of time — and you’ll see significantly better traffic. Once you begin receiving traffic from search engines, you have an incredible amount of data regarding real search visits. If your page receives any traffic at all, Google has already guessed what your content is about — right or wrong — and is sending some traffic to you. In all reality, there is a gap between the traffic you thought you were optimizing for when you created the page, and the traffic you are actually getting. You want to close that gap. We’ll ask and answer these 3 questions: Is my content matching the intent of the visitors I’m actually receiving? Based on this intent, is my search snippet enticing users to click? Does my page allow users to complete their task? Here’s how we’re going to do it. I present your SEO homework. 1. Identify your low-to-mid performing pagesThis process works best on pages with lower or disappointing traffic levels. The reason you want to stay away from your high-performing pages is the adage: “If it ain’t broke, don’t fix it.” That’s not to say that high-performing pages can’t be improved, but whenever you make changes to a page you risk ruining the things that work well, so for now we’re going to focus on our under-performers. The simplest way is to use analytics to identify pages you believe are high quality — and target good keyword phrases — but receive less traffic than you’d expect based on site averages. For this example I’ll use Google Search Console for my data, although you could use other platforms such as Bing Webmaster or even features found in Moz Pro. Here’s a picture of our traffic and search queries for Followerwonk. While it’s a good amount of traffic, something looks off with the second URL: it receives 10x more impressions than any other URL, but only gets a 0.25% click-through rate. We’ll use this URL for our process. 2. Discover mismatches between user intent and contentNext, we want to discover the keyword phrases that surface our URL in search results. Here’s how you do it in Search Console. After you complete #3 above by clicking on the URL you wish to analyze, you’ll find a page of data isolating that URL, but it will lack keywords. Now hit the \"Queries\" tab to filter keywords filtered for this specific URL. For our Followerwonk URL, we discover an interesting result. The phrase \"twitter search\" generated a million search impressions, but only 724 clicks. Google believes we deserve to rank for this query, but obviously the page doesn’t offer what people are looking for Or does it? The Followerwonk Bio Search page offers advanced Twitter bio search, complete with lots of advanced options you can’t find on Twitter. It’s reasonable that tons of people searching for \"twitter search\" would find enormous value in this page. So why the disconnect? A quick screenshot reveals the heart of the problem. That’s it — the entire page. Very little explanatory text makes it difficult to quickly grasp what this page is about. While this is an awesome page, it fails in one key aspect for its highest volume search query. The page fails to satisfy user intent. (At least in a quick, intuitive way.) So how can we fix this? Let’s move on to the next steps. 3. Optimizing for user intentNow that we understand how users are actually finding our page, we want to make it obvious that our page is exactly what they are looking for to solve their problem. There are 5 primary areas this can be accomplished. Title tag Meta description Page title and headers Body text Call to action Rewriting the title tags and descriptions of underperforming pages to include the keyword queries users perform to find your URL can lead to a quick increase in clicks and visits. Additionally, after you get these clicks, there’s a growing body of inconclusive evidence that higher click-through rates may lead to higher rankings. In the end, it really doesn’t matter. The whole point is that you get more traffic, one way or another. The key is to take this data to optimize your search snippet in a way that entices more and better traffic. Earning the click is only half the battle. After we get the visitor on our site, now we have to convince them (almost immediately) that we can actually solve the problem they came here to find. Which leads to… 4. Improving task completionConsider this: A user searches for \"best restaurants in Seattle.\" You want your pizza parlor to rank #1 for this query, but will this satisfy the user? Likely not, as the user is probably looking for a list of top restaurants, complete with reviews, hours, maps, and menus. If you can offer all — like TripAdvisor, Opentable, and Yelp — then you’ve helped the user complete their task. The key to task completion is to make solving the user’s problem both clear and immediate. On our Followerwonk page, this could be accomplished by making it immediately clear that they could perform an advanced Twitter search, for free, along with an expectation of what the results would look like. A standard for task completion can be found by answering the following question: After the user visits this page, will they have completely found what they are looking for, or will they need to return to Google for help? When the query is satisfied by your website, then you’ve achieved task completion, and likely deserve to rank very highly for the targeted search query. 5. Submit for reindexingThe beauty of this process is that you can see results very quickly. The easiest thing to do is to submit the page for reindexing in Google, which can help your changes appear in search results much faster. You may see changes submitted this way reflected in search results within minutes or hours. Usually it's not more than a day or two. 6–7. Measure results, tweak, and repeatNow that your results are live, you want to measure present performance against past. After a few days or weeks (whenever you have enough data to make statistically significant decisions) you want to specifically look at: Rankings, or overall impressions Clicks and click-through rate Engagement metrics, including bounce rate, time on site, and conversions Warning: You may not get it right the first time. That’s okay. It’s fine to iterate and improve (as long as you don’t destroy your page in the process). In fact, that’s the whole point! If you follow this process, you may see not only increases in traffic, but improved traffic coming to your site that better aligns what you offer with what the visitor is searching for. The best content that aligns with user intent is what search engines want to deliver to its users. This is what you want to broadcast to search engines. The results can be rewarding. TransitionsWhat's next for me? In the near term, I'm starting a boutique online publishing/media company, tentatively named Fazillion. (Our aim is to produce content with heart, as we ourselves are inspired by sites like Mr. Money Mustache, Wait but Why, and Data is Beautiful.) I can’t express enough how much this company and this community means to me. Moving on to the next adventure is the right thing to do at this time, but it makes me sad nonetheless. Say what you want, SEO is a wonderful industry of awesome human beings.— Cyrus Shepard (@CyrusShepard) January 21, 2016 Coincidentally, my departure from Moz creates a unique job opening for a talented SEO and Content Architect. It should make a wonderful opportunity for the right person. If you’re interested in applying, you can check it out here: SEO Content Marketer at Moz Happy SEO, everybody! If you see me walking down the street, be sure to say hi. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "My Single Best SEO Tip for Improved Web Traffic"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "My Single Best SEO Tip for Improved Web Traffic"
    },
    {
      "level": "H2",
      "text": "SEO white lies"
    },
    {
      "level": "H2",
      "text": "1. Identify your low-to-mid performing pages"
    },
    {
      "level": "H2",
      "text": "2. Discover mismatches between user intent and content"
    },
    {
      "level": "H2",
      "text": "3. Optimizing for user intent"
    },
    {
      "level": "H2",
      "text": "4. Improving task completion"
    },
    {
      "level": "H2",
      "text": "5. Submit for reindexing"
    },
    {
      "level": "H2",
      "text": "6–7. Measure results, tweak, and repeat"
    },
    {
      "level": "H2",
      "text": "Transitions"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Cyrus Shepard\n          \n            Cyrus Shepard\n          \n            Cyrus Shepard"
}