{
  "url": "https://moz.com/blog/sitelinks-search-box",
  "slug": "sitelinks-search-box",
  "title": "Google's Sitelinks Search Box Schema: What You Need to Know - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Several months ago, Google announced a new sitelinks search box. Despite its strong adoption, until now we've had very little evidence to understand its effects. We implemented it to share with you the results. Here's what we found...",
  "content": "Google's Sitelinks Search Box: What You Need to Know On-page SEO | Technical SEO | SEO Basics By: Cyrus Shepard February 2, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Cyrus Shepard February 2, 2015 Google's Sitelinks Search Box: What You Need to Know On-page SEO | Technical SEO | SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Several months ago, Google announced a new sitelinks search box. Almost immediately, the sitelinks search box markup became one of the fastest growing Schema implementations on the web. According to the folks at SimilarTech (part of the SimilarWeb family) the SearchAction markup now dominates all other Schema types on the top 1 million sites that they monitor. Moving beyond the top million sites to the entire Internet, the SearchAction Schema is the 12th most popular Schema out of the 49 types that SimilarTech measures. Despite such strong adoption, until now we have had very little evidence to understand the effects of the sitelinks search box. After Google dropped support for authorship photos in search results, many webmasters are weary of investing in each new initiative Google announces. Sitelinks search box basics The box appears in Google's search results for certain branded and navigation queries such as: adobe apple website nytimes dot com The box all allows users to refine searches to within a particular site, as in this example below when a user searches for \"Moz\" and refines their search to \"keyword research\". By default, searches performed in the sitelinks box sends users to a second set of Google results, refined to include to results from the target website (using Google's site: operator.) The second page also typically includes additional Google ads, giving the searcher a chance to click on an ad instead of visiting your website. At the same time, Google also gives webmasters a chance to bypass this second page of results and send searchers directly to their own internal search results if they implemented special Schema code on their homepage. Not every site qualifies. Typically, Google reserves sitelinks search box for those sites with a high volume of branded queries. To see if your site is eligible, check Google Webmaster Tools. Google typically sends messages to eligible site owners. If you qualify, and Google finds the correct code on your homepage, Google directs visitors to your website's internal search results. The advantage is obvious: by directing visitors to your own search results instead of another Google page filled with ads from third party websites, you potentially gain more clicks and visits and better control the visitor experience. How to implement the sitelinks markup Compared to other types of markup, implementing the sitelinks code is easy and straightforward. 1. Determine if your site qualifies This question is actually harder to answer than it appears. Not every site qualifies for the sitelinks search box, and Google isn't overly transparent about the requirements. If you can answer \"yes\" to any of these questions, it's quite possible your site qualifies. Does your site receive a high volume of navigational or branded search traffic?For example, keyword phrases such as 'moz' and 'moz.com' send this website thousands of visits per week. Branded and navigational search volume is a good, but not perfect, indicator of the likeliness of the sitelinks search box to appear.Did you receive a message via Google Webmaster Tools? Google often sends notifications to verified, eligible sites through Webmaster Tools. Here's a screenshot of one such message.Does the sitelinks search box already appear for your site in Google search results?Try searching for your site using the most common branded and navigational search queries that your visitors might use. If the sitelinks search box already appears, then you most likely qualify to take advantage of adding the SearchAction Schema on your site and directing visitors to your own search results page. Keep in mind that if you don't qualify, it's not necessary a negative. If you do qualify, continue with the steps below. 2. Leverage your own internal search engine Most internal search engines work perfectly fine, including the default WordPress search function. If your website doesn't have internal search, it's easy to get started with a free Google Custom Search engine. For websites that use Google's default Custom Search engine, Google also has the chance to make money on ad clicks, because the free version of the Customer Search engine includes Google ads. Google offers a paid version known as Site Search that allows an ad-free experience. 3. Add SearchAction Schema to your homepage Place the following snippet in the source code of your homepage, editing the \"url\" and \"target\" fields to match your website information. <script type=\"application/ld+json\"> { \"@context\": \"http://schema.org\", \"@type\": \"WebSite\", \"url\": \"https://www.example-petstore.com/\", \"potentialAction\": { \"@type\": \"SearchAction\", \"target\": \"https://query.example-petstore.com/search?q={search_term_string}\", \"query-input\": \"required name=search_term_string\" } } </script> Source: Google Developers. 4. Opting out Google doesn't advertise it well, but there is a way for you to prevent Google from displaying the sitelinks search box altogether if you'd like to opt out. Menashe Avramov first noticed an additional Google meta tag that prevents the search box from displaying. <meta name=\"google\" content=\"nositelinkssearchbox\" /> Can you guess which major publisher opts out of Google's Sitelinks Search Box? Amazon. Interestingly, Google displays no sitelinks search box for the most popular website on the planet, Facebook, even though no such meta tag is apparent on Facebook's site. Results: How the sitelinks search box impacts traffic Below are landing page visits to Moz's search results page before and after adding the sitelinks markup. While it looks like a significant jump, the increase only equaled 150 visits per week. This represents just 0.05% of all organic search sessions Moz sees on a weekly basis (around 300,000 sessions). Several SEOs who manage large sites reported similar results when we spoke with them. Although the search results page sees a small rise in sessions, it's always nearly impossible to identify a statistically significant increase in overall search traffic. I'm glad we implemented this because I think it provides a better user experience, but I would not say that it has sent much traffic our way. - Rob Leslie, Website Usability & SEO Administrator at George Fox University In other words, implementing the SearchAction Schema is \"optimized\" and may result in a small boost in traffic and an improved experience for users. Based on the evidence, most publishers shouldn't expect big traffic gains. Our best advice is to add the SearchAction Schema if it is easy to implement, but keep your expectations in check. As for opting out, like Amazon, it's likely best to experiment on your own site before committing to a course of action. Keep in mind that many SERP features such as review stars and breadcrumbs have been associated with higher click-through rates, and having a giant search box next to your result may help you stand out. Have you implemented the code for Google's sitelinks search box? Share your experience in the comments below. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Google's Sitelinks Search Box: What You Need to Know"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Google's Sitelinks Search Box: What You Need to Know"
    },
    {
      "level": "H2",
      "text": "Sitelinks search box basics"
    },
    {
      "level": "H2",
      "text": "How to implement the sitelinks markup"
    },
    {
      "level": "H4",
      "text": "1. Determine if your site qualifies"
    },
    {
      "level": "H4",
      "text": "2. Leverage your own internal search engine"
    },
    {
      "level": "H4",
      "text": "3. Add SearchAction Schema to your homepage"
    },
    {
      "level": "H4",
      "text": "4. Opting out"
    },
    {
      "level": "H2",
      "text": "Results: How the sitelinks search box impacts traffic"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Cyrus Shepard\n          \n            Cyrus Shepard\n          \n            Cyrus Shepard"
}