{
  "url": "https://moz.com/blog/sitemaps-and-spidering",
  "slug": "sitemaps-and-spidering",
  "title": "Sitemaps and Spidering - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The great advantage of a sitemap (for SEO purposes) comes from its ability to reduce the number of links that must be followed in order to reach all pages on a site. Sitemaps have a unique ability to garner the attention of search engine spiders and crawlers - making for much faster i...",
  "content": "Sitemaps and Spidering Design By: Rand Fishkin January 20, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 20, 2005 Sitemaps and Spidering Design The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The great advantage of a sitemap (for SEO purposes) comes from its ability to reduce the number of links that must be followed in order to reach all pages on a site. Sitemaps have a unique ability to garner the attention of search engine spiders and crawlers - making for much faster indexing, and thus, faster rankings. The boost provided by sitemaps hasn't been measured in full, but many SEOs suspect that bots may have an innate ability and preference for spidering sitemaps. Several rules govern the construction and maintenance of sitemaps to achieve optimal benefits: Make sure your sitemap is linked to by every page on the site (this ensures even distribution and increases the frequency of spidering. Don't have more than 200 links on a sitemap page. In Google's ancient recommendations page, this number is 100, but reports from around the SEO community indicate there is no detriment to having up to 200 links on the page. Try to refrain from external linking on the sitemap page. For both users and spiders, the sitemap has an established purpose as the index of your website's own pages. Externally linking is a detractor. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Sitemaps and Spidering"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Sitemaps and Spidering"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}