{
  "url": "https://moz.com/blog/site-reviews",
  "slug": "site-reviews",
  "title": "Uncovering Issues Via Site Reviews - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I've just read the technical issues blogpost about CDN's and redirects from Mr Critchlow. Interesting stuff, but beyond anything I see from day to day. However, when he mentions redirects and how getting things put in scope is difficult, I HAVE come across those issues, even in my early days.",
  "content": "Uncovering Issues Via Site Reviews Technical SEO By: Matt Lambert April 16, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Matt Lambert April 16, 2009 Uncovering Issues Via Site Reviews Technical SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I've just read the technical issues blogpost about CDN's and redirects from Mr Critchlow. Interesting stuff, but beyond anything I see from day to day. However, when he mentions redirects and how getting things put in scope is difficult, I HAVE come across those issues, even in my early days. There is usually someone in the room who turns slightly ashen when you start talking about SEO. But, at one company (who shall remain nameless), I met a webmaster who looked sideways at me and said, \"Yeah, well, those SEO things are maybe right for today, but tomorrow...\" He trailed off; obviously, SEO wasn't worth thinking about - not so much ashen as completely oblivious. The MD told me to concentrate on their Adwords instead. But, having been baited, I couldn't resist a closer look at the site and found the following: A complete duplicate site, with a totally separate URL, created when the company took over another and absorbed it three years ago. Seemed like the simplest thing to do at the time, apparently. The non-www URL of the main website went to a sister company's website, so anyone typing that into the address bar would be confused (same company stem). The front page had a picture of all the terms considered important. No words or links, mind you, just a pictur. There were 75 pages, plus 400(!) PDFs indexed -- not bad, but the company had been around for 15 years. 30% of the pages had no title, description or keywords (including the home page), and the rest were grouped into sets of duplicates. There were lots of incoming links, including .edu links that went to pages that had been renamed, without re-directs. No keyword research had been done at all, although some URLs did actually have keywords. Analytics was installed but nobody had looked at it, and they had bounce rates of about 80-90% for their most popular Adwords Ad Groups. There were no breadcrumbs or sub menus on the site to let visitors know where they had landed, and for some reason, the website opened up a new page for any internal link. (Is it just me that gets irritated when that happens?) There were some satellite older domains that still hung around with the wrong branding - these were the only pages on any of the sites that were ranking for anything other than the company name. On the plus side, the site code was fine! Needless to say, there wasn't much in the way of unpaid traffic coming in. But these things aren't really in the scope still, and it's taken months to get anything changed. Is this (site or behaviour) normal, or have you come across worse passivity (if that's a word)? I guess it's better than having 'not much to report'... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Uncovering Issues Via Site Reviews"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Uncovering Issues Via Site Reviews"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Matt Lambert\n          \n            Matt Lambert"
}