{
  "url": "https://moz.com/blog/site-audits-deliverables-followup-and-implementation",
  "slug": "site-audits-deliverables-followup-and-implementation",
  "title": "Site Audits: Deliverables, Follow Up, and Implementation - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "You could offer the best SEO recommendations in the world, but if your advice is not presented and communicated in the right way, your hard work may not pay off. In today's post, learn what makes the difference between a site audit being left on the shelf, compared to a document that can…",
  "content": "Site Audits: Deliverables, Follow Up, and Implementation SEO Consulting J By: Jonathan Quinton May 16, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! J By: Jonathan Quinton May 16, 2013 Site Audits: Deliverables, Follow Up, and Implementation SEO Consulting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. You could be the best SEO in the world, with the best recommendations your clients ever seen; but if this information isn’t presented and communicated in the right way, the sad fact is that your hard work probably won’t change a thing. A couple of weeks back, Dan and I ran a very enjoyable Mozinar on this very topic. (A huge thank you to everyone who listened in!) If you did miss it, feel free to check out the recording and download the slides here. Rather than talking through the ins and outs of technical SEO, we really wanted to dive into what, in our experience, makes the difference between a site audit being left on the shelf, compared to a document that can potentially turn a business around. On the back end of the Mozinar, we had a ton of great questions. Many focused specifically on the delivery and follow-up process, and how we approach this particular part of the job. There was quite a bit of interest in this area, so we thought a dedicated post on the latter part of our auditing process (see below) would give us a chance to dive in a little deeper. Although the follow-up and implementation clearly comes once your document has been delivered, a lot of the very early conversations have a big influence on how successful the project will ultimately end up being. I’ve found that getting a client in the mind-set of working together and buying into implementing your recommendations right from the start always makes getting work done so much easier! Although this post is about the follow-up process, I also want to spend some time touching on other areas that have a direct influence on that part of the project. Let's go! Sales kick-off and briefing The sales process is such a critical part of any project; and not just for the obvious reasons. A well thought out sales conversation is the ideal opportunity to discuss goals, understand the clients business, and really find out what they need to achieve. Ron Garrett summed it up brilliantly in this post, and covered some great points with regards to the important details that every initial conversation with a potential client should cover. In terms of how the conversations held at the beginning of a project can impact on the effectiveness of your follow-up, it’s so important to make sure you’re starting the project with the right goals in mind. After all, how can you measure success if you don’t understand what KPIs make a true difference to your clients business? Q: How much should I give away during the sales process? On a very similar point, we had a couple of questions crop up in the Mozinar Q&A from people asking how much to give away during the sales process. Some people like to run a sample audit, whilst others won’t give anything away until they have ink on paper. Really, this is down to you. From my perspective, you have to be sensible with your time and learn to consider each situation by its own circumstances. I’ve been in the situation many times before where you sense the company in question is just inviting agencies to pitch in order to gain some free expert knowledge. It takes time to put a proposal together, so you have to make a judgement on the best use of that time. Feel each situation out and you should be just fine. This is not just about selling projects; it’s about understanding the situation well enough to sell the right project to solve the right problem. Kick-off and briefing If you take a step back and think about all the projects you’ve worked on that haven’t worked out well, it’s crazy to think how much probably went wrong before you’d even started. If everyone was in an honest mood, I think we’d all admit to being involved in projects before where it all felt just a little too rushed. As a result, a good solid brief can be skipped meaning the team get dropped in with no idea at all of delivery dates, or what the client actually wants or needs from the project. Clearly, things don’t tend to go well from here. At best, the project just ends up being another report on another desk – at worst reputations get damaged. So with implementation and a smooth follow-up in mind, what should a good brief cover? As a bare minimum, I suggest the following should always be included: Deliverables Key dates Goals/objectives KPIs Key personnel Why is this so important? One of the biggest and most common reasons for a project failing is that for a variety of reasons they simply miss the mark. Usually when a project doesn’t tick the right boxes, the issue can nearly always be traced back to the brief or a miscommunication at the start. The other point here is that if the project is simply being dumped on the team, they’re not likely to be too happy about it. Get your team excited and they in turn will get the client excited. If the client is excited about getting things done, suddenly getting work implemented is a far more enjoyable and productive process. Deliverables A major part of any project is the format in which you present your documentation. Sometimes a \"highlights\" presentation deck detailing the biggest issues is the way to go, whereas some situations require a detailed document and a large set of data to refer to. The best way to do this is really going to depend on who you’re delivering to, and what the initial outline of the project was. We had some really good questions on this during the webinar, so it felt right to pick out some of the best and answer them directly: Q: What exactly should be delivered? A large document, a set of data, or just the top ten action points? At SEOgadget, we’ve found that the best approach is to do a combination of all three, with the exact delivery style adjusted to whomever you’re meeting or presenting to. A typical situation for us would be to create a master document containing detailed explanations of our findings alongside all the necessary change requests. Of course, if we’re running crawls and conducting log-file analysis then there’s also going to be a pretty substantial amount of data on hand too. I like delivering the data for two reasons: first, data always backs up what you’re recommending. It’s always so much more valuable to show and not tell. Having the ability to clearly walk the client through exactly what you’ve found can work wonders for adding credibility to what you’re saying. Second, providing the data makes it much easier for a developer to work out what’s going on and gives a reference point for future questions should anything crop up. What’s more, in 90% of situations clients always ask for the data anyway! Task lists also have a very valuable place. The first question that always comes back is, \"OK, so where do we start?\" If a question keeps cropping up, then answer it before it gets asked! At the top of all our documents we provide a prioritized list of all change requests (as seen above). This forms a great base for follow-up calls and meetings as everyone can refer back to the same task list. With development resource often being high in demand, it also enables you to start scheduling the biggest fixes first. Q: Some clients are not \"techy,\" and talking them website audit is not that easy. How many details we should give those clients? Should we spent a lot time and train them about SEO? This is where being able to give a high-level view first is extremely important. Not everyone understands the details of SEO. You might not always be working directly with an SEO department; you could be working with a traditional marketing team or leading into an Ecommerce manager where their role touches on SEO, but it’s not something they do all day every day. In this case, the best approach is to deliver a \"highlights\" type of presentation. Break the problems down and focus on the benefits of resolving the issues. Show the client what you’ve found, but think more about explaining the benefits of fixing each issue will have on their business. It’s less about canonical tags and more about ROI. Again, get the client excited about the impact of fixing things and you’ll buy yourself a heap of influence. Even though you’re only presenting on a few key areas, you’ll still have the full document to refer back to in more detail later down the line. Follow-up support I’m a big believer in the idea that a technical project shouldn’t be about completing a review and then thinking it’s \"job done.\" It’s so much more important to have the ability to really influence change and action. In fact, the most important part (and often hardest part!) of any technical audit is the follow-up process and getting your work implemented. A good SEO can diagnose issues – a great SEO follows up and makes sure these problems get fixed. Going right back to what we touched on earlier when talking about the sales process, having a good grasp of development resource can really help here. Do you have an understanding of what processes are in place for booking requests? Did you check when development resource is available and allocated for SEO? Getting ahead of the game in these areas is one of the biggest keys to winning! The follow-up process can be greatly helped by having a central resource to track changes and keep on top of progress or indeed challenges with implementing your recommendations. Using tools such as Basecamp or Asana can be a great way of keeping communication clear, and for making sure you have the right tasks in front of the right people. If you’re not keen on using these tools, a simple Google Docs sheet to display tasks and provide a place to leave comments is sometimes all that’s needed. Combining this with regular calls or checking in via email gives you the ability to keep the project moving in the right direction, and the retain focus when you come to catching up in a meeting or on a call. If you’ve got any further questions on the process side of technical SEO audits, feel free to drop them in the comments, or tweet myself or Dan and we’ll do our best to answer them. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Site Audits: Deliverables, Follow Up, and Implementation"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Site Audits: Deliverables, Follow Up, and Implementation"
    },
    {
      "level": "H2",
      "text": "Sales kick-off and briefing"
    },
    {
      "level": "H2",
      "text": "Kick-off and briefing"
    },
    {
      "level": "H2",
      "text": "Deliverables"
    },
    {
      "level": "H2",
      "text": "Follow-up support"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Sins of an Agency: Parting Ways With Our Biggest Client"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "8 Prep Steps for Better Local Business Client Meetings"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jonathan Quinton\n          \n            Jonathan Quinton\n          \n            Jonathan Quinton"
}