{
  "url": "https://moz.com/blog/skype-enters-india-holding-big-gs-hands-or-are-they",
  "slug": "skype-enters-india-holding-big-gs-hands-or-are-they",
  "title": "Skype Enters India Holding Google's Hand - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Yesterday, I was jolted when I suddenly discovered these grey and green bars next to the Google local search results. I clicked on impulse and was immediately taken to my skype client to make the call. My immediate reaction was, “Oh, then I have to pay, and here I was thinking I would make a call…",
  "content": "Skype Enters India Holding Google's Hand Whiteboard Friday S By: swayam April 18, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! S By: swayam April 18, 2008 Skype Enters India Holding Google's Hand Whiteboard Friday This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Yesterday, I was jolted when I suddenly discovered these grey and green bars next to the Google local search results. I clicked on impulse and was immediately taken to my Skype client to make the call. My immediate reaction was, “Oh, then I have to pay, and here I was thinking I would make a call at Google's expense.” For a long time, Google has been experimenting with their call buttons. The earlier 'click to call' buttons were a disaster by Google standards. Personally, I tried calling several advertisers and the system hardly ever worked for me without a glitch. The Indian population were mostly using Yahoo Messenger as their IM client, and then a few of them shifted over to GTalk for the email-plus-chat benefit. But to this date the majority uses Yahoo Messenger. Skype, I know, is extremely popular in the US and Europe, but has been unable to create a niche for itself in the Indian market. The demographics of Skype users, I presume, would include a bunch of non-resident Indians and a handful of IT-savvy metropolitans. But, the fact remains that Skype offers the best audio quality in internet telephony. So, this partnership is certainly a huge breakthrough for Skype. Also, the Google users should find it useful. Overall, a win-win situation. Unfortunately though, in my little experience I have noticed that the Indian population (me included) is sadly jinxed and biased against adapting to newer technologies. A month or so back, I had started using Twitter, and though I marveled at the possibilities thrown open by the integration of internet and telephony, I quickly set it aside as an extra load on my list of social networking sites. The Indian population took a lot of time adapting to the internet and email and are still getting used to the idea of online transactions. I am afraid such rapid technology modifications will only alienate the long tail of the Indian market, which Google and a lot of other organizations have been eyeing for sometime now. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Skype Enters India Holding Google's Hand"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Skype Enters India Holding Google's Hand"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "swayam\n          \n            swayam"
}