{
  "url": "https://moz.com/blog/slow-and-steady-seo",
  "slug": "slow-and-steady-seo",
  "title": "Slow and Steady SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Well, the big page rank brouhaha last week caused me to take a good long had look at all of my sites.  Not just their PR (relatively unchanged) but their SERPs, objectives and overall long-term strategy.I have a lot of varied interests (boating, real estate, SEO, travel, super heroes, video games,…",
  "content": "Slow and Steady SEO Content Marketing V By: Vinny Goldsmith October 29, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! V By: Vinny Goldsmith October 29, 2007 Slow and Steady SEO Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Well, the big page rank brouhaha last week caused me to take a good long hard look at all of my sites. Not just their PR (relatively unchanged) but their SERPs, objectives, and overall long-term strategy. I have a lot of varied interests (boating, real estate, SEO, travel, super heroes, video games, etc.), and I've always felt it was better to have a lot of individual blogs or niche sites to play around in these areas, as opposed to just one or two \"catch all\" sites. As a result, I've created way more websites than any one person - or even a small team of people - could properly attend to. For my real estate related lead-generation sites, I've always thought it was better to have a lot of small neighborhood sites rather than one or two large regional authority sites. Then I interlinked all of these smaller sites in a way that would hopefully increase their link weight - but in actuality had very little impact because they were all so small. All I see when I look out at my 20+ sites is unused bandwidth, half-built pages, and an overall weak linking strategy. Not a lot to be proud of after 3+ years of even mediocre part-time effort. One thing I did notice is that the sites where I've had the greatest success (as measured by inbound links, SERPs, and, most importantly, conversions) are the ones where I have made a long term commitment to steady posting of good content. I'd like to say \"great content,\" but I'm not a full-time writer and if I tell myself I have to post something of value everyday, the best I can hope for is \"good.\" Or, at the very least, average. Sometimes even that bar was too high for me. Even when I have faltered and these sites have gone unattended to for a period of time, their traffic has still increased. Sometimes I get caught up in the immediate results of a post. I look back at something I did a month ago and wonder why my traffic didn't go up with that one great post. How come no one linked to it? Why is it not even showing up in Google, etc? Meanwhile, the smaller sites - even the less interesting ones - grow steadily when content is put out there. I have to remind myself: Traffic will follow content eventually. Well, as of this week, I'm repenting and changing my ways, the first step being to admit you have a problem and all that. By the way, one of the final deciding factors in all this was one of Rand's old posts - \"what not to blog about\" - that I found from reading his post today, where he patiently answered a lot of our questions. Another factor was when I boasted to my son \"I'm ranking for the search term 'New Orleans Goldsmith!\" and his reply was \"and does that make you any money?\" Gotta love those 15 year olds. I've already started making some changes - taking down old sites, combining content, grouping content in ways that it will be useful to users, doing 301 redirects, etc. I'm sure in the short-term my SERPs will suffer - and my hosting providers will wonder why I'm breaking up with them - but I know from experience that in the long run I'll be better served. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Slow and Steady SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Slow and Steady SEO"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Vinny Goldsmith\n          \n            Vinny Goldsmith"
}