{
  "url": "https://moz.com/blog/small-business-link-building-part-b-grabbing-the-bull-by-the-horns",
  "slug": "small-business-link-building-part-b-grabbing-the-bull-by-the-horns",
  "title": "Small Business Link Building: Part B - Grabbing the Bull by the Horns - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "To date I have journeyed through my Keyword Discovery Process and waded through the first part of the Small Business Link Building (analysing the opportunities). This post is a follow up to the latter, and discusses the wa...",
  "content": "Small Business Link Building: Part B - Grabbing the Bull by the Horns Link Building By: Rishi Lakhani July 7, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Rishi Lakhani July 7, 2008 Small Business Link Building: Part B - Grabbing the Bull by the Horns Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. To date I have journeyed through my Keyword Discovery Process and waded through the first part of the Small Business Link Building (analysing the opportunities). This post is a follow up to the latter, and discusses the ways in which I would tackle each one of the categories we ended up with. Stick with me and towards the end of the post I will include a few goodies that I found. The Usual Disclaimer: As usual, I insist that none of the information below is ground breaking, but rather, in my usual style, common sense with a bit of organisation. To recap, we asked a series of questions that led us to creating the following list of link ops (from the stakeholders that have a web presence): Close contact Fair contact Occasional contact Business or formal contact I will take each one in turn and demonstrate a strategy I use. Close Contacts This is probably the easiest way to gain links for small businesses, albeit time consuming. Close contacts are individuals that the business owner has emotive or other relationships with. In most cases, the easiest way to expedite and guarantee the link is to pick up the phone. With most of my small clients, I encourage them to make the call themselves rather than someone like myself – it saves the time of having to explain who I am and what I want, and why I want it. Photo Credit: http://www.flickr.com/photos/82046831@N00/1793916286/ I usually advise clients to follow up a positive response with a polite email along the lines of \"Good speaking to you, thanks for agreeing to add the link,\" etc as a preamble, and then follow up with something like: “Well anyway, I asked my web guy to make this easy for you and to provide the information that we would prefer to have on your site – he has provided it in text form and as code (whatever that means). I hope you don’t mind asking your web guy to add it in: Text: XYZ company specialises in the development of Small Widgets in London. Please visit their site for more information. www.xyz.co.uk Code: <p> XYZ company specialises in the development of <a href=\" http://www.xyz.co.uk \" > Small Widgets in London </a>. Please visit their site for more information <a href=\" http://www.xyz.co.uk \" >www.xyz.co.uk </a>.” Of course, the above is written for friendly contacts. For some business-close contacts you need to vary the language, but hopefully the above illustrates the type of emotive responses, followed up with a call to action, that makes the strategy useful. The advantage of following up with the above email is to manipulate the anchor text, which can then be varied from contact to contact. Fair Contacts This is a tricky category – fair contacts are those I would classify as being close to the business owner, but not necessarily responsive. An example could be a business rival that may not be servicing the local area, with whom the business owner is still on socialising terms. In this case, you need to provide a sweetener, and often a reciprocal link is the outcome of the bargain. I would probably use the strategy above, with the slight alteration of offering a link on the site once hesitation is sensed. This is where you need to prime the client – explain the advantages of the link, and explain how to judge the hesitation – however, I find it is rare that you need to advise the client at this negotiation. Most business owners have carried this transaction in different forms and actually enjoy them. Now, don't fall into the trap of assuming that link exchanges don't always work - they do for small businesses if done with relevant sites, and in a logical way. Imagine you are exchanging links with a florist in Ohio; use that as anchor text, surrounded with a small paragraph, and ask the opposite end to do the same. That way you are optimising for *keyword* + *area* searches. Photo Credit: http://www.flickr.com/photos/dewaldp/2393233411/ Occasional Contacts With occasional contacts it is usually better to get slightly formal, with a view to strengthen the relationship (seemingly). With most clients, I tend to see that this category usually includes sites of societies and groups they belong to. The normal strategy here is to write a letter, followed by an email to the contact with an introduction to the client’s site, adding a footnote requesting the possibility of investigating a link opportunity. This has a twofold effect: the recipient is made aware that the site exists, and has been pushed into answering the letter. I find that a polite request of an answer either way usually receives a quick response, usually declining the possibility, or pointing in the direction for progressing the request to the right channel. Tip: It usually helps having investigated the site first to see if any links do exist – pointing out this area on the letter gets a better response. Photo Credit: http://www.flickr.com/photos/auntiep/64895334/ Business or Formal Contact These are the ones that need a “hook,” in my experience. And in my time I have suggested many variations in the same theme – offer something in return for the link, without mentioning the link as the primary objective. (But I would investigate the site first to make sure that they don’t have a suppliers or clients directory or page – if they do, getting the link is easy :-) For example, imagine that the clients business uses ABC grinders and has a relationship with the ABC grinder company as a client. The client can ask ABC if it is ok to write a review about ABC grinders type A, for them to either use on their site, or on the client's own site. Either way, it’s simpler to gain that elusive link if the organisation has something relevant to it to link to. Although labour intensive, these are usually the sites that have a high PR and would benefit your clients' sites the most, which is why they are worth the effort. Remember, if the business is aligned to the client's business, the possibility of click through traffic exists as well. Conclusion What I have done above is handpicked a few scenarios in each one of the categories to illustrate the customisation of the technique. By no means will every contact in a category have the exact same method; however, some of the above are quite interchangeable as strategies go. Also note how I switched the onus on the client – they are responsible for most of the footwork in gaining that link – something in my experience works pretty well – after all, they know the business, they know the contact, and they know the mindset better than any link expert would. Therefore, the aim of this post was to encourage you to develop customisable strategies that have higher chances of working, since spammy, standardised email requests to the above groups would be an opportunity wasted. I intend to follow this post up with other simple low cost link building opportunities available for small businesses. P.S: If a client complains about the amount of work, I use two methods to reason with them – First, I help them set up a step-by-step plan which would make the best use of their time, and second, I show them the going rates of buying links. The latter works pretty well to convince them that their time spent on link acquisition is actually a HUGE saving. Photo Credit: http://www.flickr.com/photos/somemixedstuff/2403249501/ The Goodies: An absolutely awesome Link Building Poster. I don’t think there is a better representation of link building that is so simple yet instructive. Danny’s absolutely awesome Checklist for Small Business SEO. This is in no way a plug – I saw this site and their “dofollow Tuesdays” are pretty good for verticals. Link Building Best Practices. A site focussed solely on Small Business SEM offers the SEO Success Pyramid (another download that explains more than I can in a series of posts). David Mihm did an excellent post a while back on Widget-Like Techniques for Small Business Link Building. Rand's 5 Rare & Valuable Link Building Tactics covers a couple of my ideas, but is so straight to the point, that you will NOT be tearing your hair out trying to implement them. I have never seen so many ideas on link building in one place. But be careful when you do pick one… Rand makes the list again by baiting the SEOmoz community to reveal Who Has the Best Link Building Techniques? Tools (I know this was in the last post, but I'm adding them again for the benefit of those who missed them): Check your present backlinks Check who YOU link to Back Link Anchor Text Analysis Make link research easy – use the Juicy Link Finder Don't Go Yet! If you would like to know other processes that I use, please feel free to read my take on SEO Swot Analysis and the Boston Consulting Matrix. If you enjoyed my writing, I invite you to catch up on my previous posts or follow me on Twitter. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Small Business Link Building: Part B - Grabbing the Bull by the Horns"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Small Business Link Building: Part B - Grabbing the Bull by the Horns"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rishi Lakhani\n          \n            Rishi Lakhani\n          \n            Rishi Lakhani"
}