{
  "url": "https://moz.com/blog/small-business-seo-content-strategies",
  "slug": "small-business-seo-content-strategies",
  "title": "Small Business SEO: Content Strategies - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "One of the problems with working on Small Business SEM is content development. So far we know what keywords we are targeting, who our link market is, and ...",
  "content": "Small Business SEO: Content Strategies Content Marketing By: Rishi Lakhani August 19, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Rishi Lakhani August 19, 2008 Small Business SEO: Content Strategies Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. One of the problems with working on Small Business SEM is content development. So far we know what keywords we are targeting, who our link market is, and how to gain those links. But in order to target a large range of the long tail keywords, we do have to try and make sure that we have content on the site that focuses on the strategies that we have identified. We shouldn’t forget that good, regular content is in itself an excellent way to build link equity and make the site more link worthy. Photo Credit http://www.flickr.com/photos/churl/250235189/ Of course, we can pay writers to develop the content – but here’s the catch – you are: Working on a budget Targeting a niche, which means good content is hard to come by In my usual fashion, I start by asking the client to answer a few questions: Where do you go to find information on competitors, clients and complementary services? Which information services are the MOST relevant to your niche? (e.g., local paper, medical journal, Business Digest, National Geographic) What are the most common questions you or your team ask/are asked while dealing with clients? Are there any interesting cases worth remembering? What non-business information do you display on your physical venue of business? What charitable / social / community events are you, your team, or business involved in? Which sites do you feel are authoritative in terms of customer information? Do you regularly follow any blogs, podcasts, radio shows, or magazines that are important to your business or niche? Which members of your team (including yourself) can write passable 3-4 paragraph summaries on any information presented to you? Are you willing to dedicate 15-20 mins a day per team member to develop content? (Questions 8 and 9 are added in just to secure their buy-in on the process) Photo Credit: http://www.flickr.com/photos/duanestorey/365006563/ By this time most clients already start seeing a pattern in the questions, and actually a lot of them start developing ideas for content. After all, as I have mentioned time and time again, these guys are intelligent people – they are running a business, and in a niche that they know well. As an SEO strategist, you need to guide them, tease them gently out to the vast opportunities that lay in front of them. The questions above actually generate a range of ideas, including (note that these are all in direct relation to the business niche): Summary and opinion of latest online news (a “in the news category? ) Summary and opinion of print articles A well focussed and researched Frequently Asked Questions area of the site A series of case studies Local information – about the local area, getting there, history The business and community – usually “feel good” content that is great at encouraging inbound links… Summaries / opinions / critique of best customer information Breakdown of complementary services in region, location, area Photo Credit: http://www.flickr.com/photos/robertnelson/411891168/ A working example: Client: A Local Plumber in UK Keyword lists: “Plumber in town name” “Common plumbing issues” “Common plumbing suppliers in area” “Common drain supplies” “TV programme – DIY” “TV programme – bad plumbers” Possible Content Strategies: 1. Develop a Series of Frequently Asked Questions: - What to do when x breaks down - DIY - When to call a plumber 2. A local supplies guide: - Big shops and what they sell - Small local suppliers - Great bargains (you can even use affiliate links and make a bit on the side) - Buy of the week (regular feature) 3. Common Tips and Tricks - How to - Where to buy - Save… 4. TV Reviews - Plumbers from hell opinion - Dealing with similar problems - Case studies (how we dealt with it) The above list is a pure brain dump of ideas – it's up to the client to pick and choose what's most relevant and actionable. In order to make development seamless, I usually advise the installation of a blog (most commonly Wordpress), which then has the added advantage of tags and categories. Photo Credit: http://www.flickr.com/photos/timballas/31369414/ Ok – so we have : Identified the need for content Identified the resources available Decided on the type of content to develop Agreed on the regularity and responsibilities for the content What’s left? Umm, SEO… Although the client may soon pick up the strategy and run with it, it does not make them an expert in SEO, which means you need to provide them a checklist in order to make sure that they are targeting the right elements. The checklist should at the minimum include: Titles Descriptions When to categorise and when to tag Out linking policy Internal linking policy Adding calls to action. Absolute no nos (list of harmful topics or writing styles) Once again, we make sure that the content is the responsibility of the client, and that we have identified a useful process that they can maintain with maximum potential. One of the spin off advantages of this strategy is that not only are we adding SEO benefit to the client's business, but we're actually building the value of the site. And best of all, the client knows their stuff – they aren’t likely to add information that will be detrimental to the business. I shall end with a cliché (I love them): “Give a man a fish, and he eats for one day. Teach a man to fish, and he eats for the rest of his life.” Hold Your Horses! Don’t Go Yet! I really respect Matt McGee, who has recently launched a site about Hyperblogging some very similar ideas to what I have discussed above, plus more! No one does local SEO like David Mihm, and his “10 [Content] Tips for Small Business Owners” is a must read. If you would like to know other processes that I use, please feel free to read my take on SEO Swot Analysis and the Boston Consulting Matrix. If you enjoyed my writing, I invite you to catch up on my previous posts or follow me on Twitter. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Small Business SEO: Content Strategies"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Small Business SEO: Content Strategies"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rishi Lakhani\n          \n            Rishi Lakhani\n          \n            Rishi Lakhani"
}