{
  "url": "https://moz.com/blog/small-businesses-websites-compete-big-players-seo-whiteboard-friday",
  "slug": "small-businesses-websites-compete-big-players-seo-whiteboard-friday",
  "title": "How Can Small Businesses/Websites Compete with Big Players in SEO? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It may seem like an uphill battle to compete with big sites in the SERPs, but there are tangible SEO benefits to running a smaller site. In this Whiteboard Friday, Rand explains how small sites can target opportunities the big sites can't, despite their natural advantages.",
  "content": "How Can Small Businesses/Websites Compete with Big Players in SEO? Advanced SEO | Whiteboard Friday | SEO Basics By: Rand Fishkin November 4, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 4, 2016 How Can Small Businesses/Websites Compete with Big Players in SEO? Advanced SEO | Whiteboard Friday | SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. It may seem like an impossible uphill battle to compete with big sites in the SERPs, but there are benefits to running a smaller site that can make a tremendous difference to your SEO. In today's Whiteboard Friday, Rand explains how small businesses and websites can target opportunities the big sites can't, in spite of their natural advantages. Click on the whiteboard image above to open a high-resolution version in a new tab! Video TranscriptionHowdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week we're going to chat about how you, as a small site, could compete against big sites.Big site advantages Now look, big sites in SEO have some big advantages. Those include things like: Domain authority Quantity and diversity of the links that are coming to them, which bias engines to generally rank their content higher than they ordinarily might if it were on a brand-new site or a smaller site that they didn't recognize. Trustworthiness. They've built brand associations in the space through advertising and through their size and scale and their reputation over time and over years that means that people have these biases towards trusting that brand, liking that brand, buying from that brand. Financial resources that likely you are not going to have as a small website. If we're talking about Expedia here versus randstravels.com, they have tens if not hundreds of millions of dollars that they can put towards their web marketing efforts and their SEO efforts, and I have, well, my bad self. Ability to invest if and usually not just if, but if and when, if and when something is a major priority. If it's not the case that something is a major priority, then Expedia is probably not going to invest in that, and this is where a lot of your advantages come from.Small site advantages So as a small website: Nimbleness. You can choose to say, \"Here are all the things we could be investing in right now, and you know what, this is the highest priority right now,\" and a week later decide this is no longer the highest priority. We're going to change direction and go pursue this instead. You don't have to check with a manager or a team or a boss. You don't have three layers of management that you have to run that approval process through. You can be extremely nimble. Small teams can get remarkable amounts done in small amounts of time compared to much larger teams. Creativity. You are allowed to go outside the boundaries of what's been set. If you have an idea, you can execute on it. If you have an idea at Expedia, you need to get a lot of approval before you can go after it, and you better make sure that all of the rest of your work is done, too. Focus. As a small business, you can choose to focus your web marketing efforts on one specific thing. So if you know that SEO is where all of your opportunity lies, you can ignore your other web marketing channels, you can ignore retargeting for a few weeks, you can ignore your PPC accounts for a few weeks and simply focus on SEO. At Expedia, a marketing manager is going to have a long list of things that they need to do that they are responsible for, and they can't simply ignore all their duties to focus on something new. Niche appeal. So yes, Expedia built up their brand around travel, and they have associations around hotels and flights and bookings and all this kind of stuff. But you can choose to take a small slice of those for your particular business and say, \"We're going to focus exclusively on this, and we're going to become the authority in this particular niche,\" which gives you a bunch of advantages that we'll talk about. Authenticity on your side. So a big brand will often have big brand associations. A smaller brand can build very strong positive associations with, granted, a smaller audience, but you don't need to monetize as many or as fast or as directly as a big brand needs to. You can concentrate on building your brand's appeal to your very specific niche. If you monetize them well enough over time, you can build a great business, a small business but a great small business.5 ways to competeSo, five ways to compete.1. Target keywords the big sites are unwilling, unable, or so far aren't trying to compete on. First off let's talk about keywords. So in the SEO keyword universe, there are going to be keywords that a big brand, like in this example Expedia, is unwilling, unable, or has chosen not to target yet because they have an indirect path to ROI or legal issues or PR issues. Those can be things like: Long-tail keywords. So maybe Expedia is definitely targeting something like \"Istanbul city guide,\" but they are definitely not targeting something like \"best shops to visit in Istanbul's Grand Bazaar.\" By the way, I looked that up, and I could not find a great list. So if someone wants to make a list of those, that would be real handy because the Grand Bazaar, very hard to find things. Comparison keywords. So Expedia can't go after their competitors' brand names, and they certainly wouldn't choose generally to compare themselves to another brand. So Venere flights versus Expedia flights, they're just not going to have a page on that. But you can have a page on that, and you can compare those things to each other. That's an advantage that a small website is going to have over a larger one. Editorial keywords. So Expedia has business relationships with a lot of different hotels. Therefore, it is not in their interest to rank hotels in a particular locale from 1 to 10 or from 1 to 100. As a small website, you don't have that constraint, and you can go after those types of keywords that your bigger competitors bias against doing, and that can be very powerful as well.2. Aim for authority and brand association in a very specific nicheSo like we talked about, Expedia is focused on travel. But Rand's Travels can focus on city-specific itineraries or ranking travel destinations or some other thin slice of a niche that Expedia can't build that same brand equity in.3. Pursue indirect/harder-to-monetize contentSo Expedia knows that they're generally pursuing not just keywords, but content that helps people buy directly from Expedia, and they're going to be looking at that path to conversion. But you might say, \"I don't care if it takes three visits or four visits or five visits for someone to convert. I want to build trust. I want to build authority in my niche. Therefore, I can go after content that Expedia would not go after.\" They might be hotels, flights, cars, and cities. You might be recommended websites and travel education and news and tactics and tips and neighborhoods.4. Go deeper and provide more value with content than what your big competition can afford to scale You can invest more in a single piece of content than Expedia or a big brand ever could. So when you take your small niche and you say this keyword or this set of keywords is extremely important to me. This search intent is extremely important. I'm going to create 10x content. I'm going to put 10 times more effort and energy and resources into building that than what my big brand competitor can do. If they are a two-star resource, I'm going to be a five-star resource.5. Build relationships 1-on-1 that big competition will never invest in In addition to that element of building better content, you can also build better, more direct relationships with the people you need those relationships with. So Expedia goes through their PR team, and they have their teams of folks that do their relationships. But you can go direct. You can say, \"I'm Rand's Travels. I'm going to go meet with people in Istanbul while I'm there and forge those relationships personally and build those relationships up on social media and have conversations and leave blog comments, and that will reinforce my authenticity and my niche appeal.\" That's a huge advantage as well, and that can help to amplify the reach of your content and to get you visibility on these keywords and this content that your competitors simply can't touch because they're too big. They need to do this stuff at scale. When you need to do things at scale, you simply can't focus in the same way, and that's where your big advantages come from as a small website. Now, looking forward to our comments and hearing more from you about how you've been able to compete against the big guys, and we'll see you again next week for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Can Small Businesses/Websites Compete with Big Players in SEO?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Can Small Businesses/Websites Compete with Big Players in SEO?"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Big site advantages"
    },
    {
      "level": "H2",
      "text": "Small site advantages"
    },
    {
      "level": "H2",
      "text": "5 ways to compete"
    },
    {
      "level": "H4",
      "text": "1. Target keywords the big sites are unwilling, unable, or so far aren't trying to compete on."
    },
    {
      "level": "H4",
      "text": "2. Aim for authority and brand association in a very specific niche"
    },
    {
      "level": "H4",
      "text": "3. Pursue indirect/harder-to-monetize content"
    },
    {
      "level": "H4",
      "text": "4. Go deeper and provide more value with content than what your big competition can afford to scale"
    },
    {
      "level": "H4",
      "text": "5. Build relationships 1-on-1 that big competition will never invest in"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}