{
  "url": "https://moz.com/blog/smx-seattle-and-then-ses-toronto",
  "slug": "smx-seattle-and-then-ses-toronto",
  "title": "SMX Seattle and then SES Toronto - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Danny Sullivan's long-awaited and much anticipated Search Marketing Expo conference kicks off next week with SMX Advanced in Seattle. Matt, Scott, Jeff, and Gillian all have Expo Passes, while Jane and I will be covering the conference for our blog and Rand will be speaking on the \"SEO, Meet SMM\"…",
  "content": "SMX Seattle and then SES Toronto SEO Events By: Rebecca Kelley June 1, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley June 1, 2007 SMX Seattle and then SES Toronto SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Danny Sullivan's long-awaited and much anticipated Search Marketing Expo conference kicks off next week with SMX Advanced in Seattle. Matt, Scott, Jeff, and Gillian all have Expo Passes, while Jane and I will be covering the conference for our blog and Rand will be speaking on the \"SEO, Meet SMM\" panel with Cindy Krum, Todd Malicoat, and Neil Patel (the session is on Day 1, from 1:15 pm to 2:45 pm). You'll most likely spot the SEOmoz Squad at the Microsoft-sponsored SMX Bash Networking Reception Sunday evening, and probably at the Yahoo! Search Marketing Network Reception and the SMX After Dark Google Dance Monday night. We're all really excited to see what this conference series has to offer, and we're thrilled about meeting new faces (especially all of our Premium Members and blog readers who will be in attendance!). After the conference wraps up, our French Canadian chum Guillaume Bouchard will be hanging out at the SEOmoz headquarters for a couple days to share SEO strategies, so maybe we can wrangle him into a Whiteboard Friday video or something. :) But WAIT, there's more! Rand and I will be attending SES Toronto, which is June 12-13. Both Rand and Guillaume will be speaking on the \"Linkbaiting and Widgets: Viral Bag o' Tricks\" panel on Day 1 (4:30-5:45) along with Greg Jarbo, and Rand will also speak on the \"Get Dugg! Social Media and WOM Targeting Tips\" panel on Day 2 (4:30-5:45) with Helen M. Overland, Neil Patel, and Tamera Kremer. This time, I won't be attending the conference as Rand's entourage--I actually got a speaking spot! (I know, I know, it's shocking to think that I actually do work and act professionally from time to time, but I can fake it pretty well.) I originally pitched to be on the Keyword Research panel, but after I didn't get selected I decided to stalk Andrew Goodman and pester him via email until he relented and told me to pitch for the \"What's Your Purple Cow Quotient? Differentiation and Positioning Workshop\" session on Day 2 (10:15-11:45). I got excited, mailed him a video of my overly elaborate pitch (it involved puppets, a fog machine, and some basic CG), and waited with bated breath. Andrew must have been getting tired of receiving 86 annoying phone calls from me per day, so he relented and gave me a spot on the panel. Hooray! Anyway, I'll be speaking with Rebecca Lieb and Ian McAnerin to the crowd about branding and how to stand out from the crowd. No presentation is required, so I guess I'll just chat with attendees and try to help them out in any way that I can. I'm very excited, nervous, and thrilled to be speaking at an SES show. Hopefully I can get good at this whole speaking thing and advance my SEO knowledge to elite status, especially since Rand is getting burned out on traveling so often (once again, \"Rebecca Kelley: When Rand's Not Available, She'll Have to Do!\"). Anyway, we're all looking forward to seeing you at SMX and at SES Toronto this month! If you spot us, be sure to head over and say hello! UPDATE: Rand and I are switching sessions, so now he's tackling \"What's Your Purple Cow Quotient\" while I get to talk about Linkbaiting and Widgets. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SMX Seattle and then SES Toronto"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SMX Seattle and then SES Toronto"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}