{
  "url": "https://moz.com/blog/smx-advanced-andy-atkins-kruger-talks-international-seo-and-yandex-whiteboard-friday",
  "slug": "smx-advanced-andy-atkins-kruger-talks-international-seo-and-yandex-whiteboard-friday",
  "title": "SMX Advanced: Andy Atkins-Kruger Talks International SEO and Yandex - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When most of us talk about SEO, the search engines we implicitly refer to are Google and Bing/Yahoo, but that's about it. Do you know which of these search engines is most popular in Russia? Neither! The largest search engine in Russia is Yandex, with millions of users and more market share than…",
  "content": "SMX Advanced: Andy Atkins-Kruger Talks International SEO and Yandex Whiteboard Friday By: Aaron Wheeler June 9, 2011 Table of Contents Copied! By: Aaron Wheeler June 9, 2011 SMX Advanced: Andy Atkins-Kruger Talks International SEO and Yandex Whiteboard Friday When most of us talk about SEO, the search engines we implicitly refer to are Google and Bing/Yahoo, but that's about it. Do you know which of these search engines is most popular in Russia? Neither! The largest search engine in Russia is Yandex, with millions of users and more market share than either of the other guys. You may have been wondering how to optimize your site for Yandex or other international search engines. While international SEO is fundamentally the SEO best practices we know and love, there are some nuances to consider when trying to optimize for search engines like Yandex. On Wednesday at SMX Advanced, Rand spoke with Andy Atkins-Krüger, the founder and CEO of international SEO firm WebCertain, about strategies for optimizing your site for Yandex and being conscious of international SEO. Have any tips of your own for optimizing for Yandex or other engines? Let us know in the comments! Video TranscriptionRand: Howdy, SEOmoz fans. Welcome to this special edition of SMX Advanced Whiteboard Friday. There's no whiteboard. It's actually a Wednesday, and even better, I'm joined by Andy Atkins-Krüger, founder and CEO of WebCertain. Andy, thank you so much for having me. Andy: Hi, Rand. Thank you for asking me. Rand: Andy, can you tell us a little bit about what WebCertain does? Just give us a brief introduction. Andy: Well, WebCertain is an international specialist in social marketing. So we operate in 36 languages and look after people with international campaigns. Rand: Right. One of the countries that you operate in and help people with is Russia. Andy: Yeah. Rand: In Russia the primary, dominant search engine, with I think it's 60% to 70% plus market share, is Yandex. Andy: And going up, the share is going up, yeah. We mainly find ourselves operating in those markets that are more difficult. So Russia and China are principal markets for us. We do a lot of work in both of those markets. Rand: That makes sense. I mean, one of the big challenges that we have that I know a lot of people in the SEOmoz community have, is they basically have very little knowledge of what's going on in those particular two markets. I think South Korea is the other big one that's sort of uncertain for us. Can you give us a brief background, particularly with Yandex, how did they win the Russian market? Why do they continue to increase share against Google? What are some big differences between how Google operates and how Yandex operates? Andy: Right. Well, Yandex actually launched in Russia. In fact, Yandex launched at the same time as Google. They're about the same age as Google. Rand: Okay. Andy: And a lot of the developments there are base around handling the Russian language. It was based on some software that was written before search engines were invented, that was extracting data from Russian language text. Rand: This is like Cyrillic characters, which are . . . Andy: Yeah. It's not the Cyrillic characters that's the problem though. It's the structure of the language. The words in Russian, the endings are very critical, and Google did not handle that very well for years. They put some investment in, in around 2006, and started to improve their handling of Russian morphology, as it's termed. Actually, it's not true that Yandex has always been growing in share in Russia, because for a period of time around about 2008, they saw a bit of a dip and that was partly because Google had then started to deal with this Russian language issue. But since then, they've launched some new technologies that have actually been very successful for them, using particularly machine learning. Rand: Okay. Which is something Google had historically biased against but recently tried out with the Panda update. Andy: Yeah. Google does not use machine learning on its natural search to anywhere near the extent that Yandex does. Rand: Gotcha. Andy: One of the interesting things that I discovered, I was over in Moscow early this year, and virtually everything that's written about Yandex from an SEO perspective is wrong. It's out of date. Rand: Well, I'm lucky to have you then. Andy: Because the issue with Yandex is the way that they use machine learning comprehensively for their algorithm. So their algorithm is created basically by what human assessors think of web pages, and they set those as targets and then the algorithm tries to achieve those targets. Rand: Right. Andy: Now what that means is that if you've got a set of results and in those results there's a kind of a certain approach that should theoretically get you to the top of those results, and you launch a site that matches that format, then the algorithm is going to say, \"Oh, no, that's not what we wanted,\" and it will shift. So as an SEO, you're in a fairly difficult position because it's going to move around all the time. Rand: So you kind of have to think, \"What would quality raters want in their search results? That's what I need to produce.\" Then the algorithm will figure out the right metrics to get me to the top. Andy: Yes. It actually points to having a bunch of assessors judging websites and saying which ones are great. Rand: Now, can you pay these assessors to just say that you're great? Andy: No, because they're not actually working on the websites that are found. They're working on a typical set that is adapted by the machine learning programs, which they call MatrixNet. Rand: Interesting. Andy: But they also use it for keywords categorizations. That's called Spectrum. So it basically decides what type of results people are looking for from a machine learning perspective, and then it goes into MatrixNet to find the right algorithm to deliver the right . . . Rand: It's so interesting, because it's the complete opposite of Google, right? Andy: Yes. Rand: They produce an algorithm that gets results. They have quality raters that tell them how good that algorithm was, and then they try and tweak tune it rather than having the quality raters say, \"We wish these sites were sort of in the top ten in these formats, etc. Build me an algorithm that's going to get them there.\" Andy: But the interesting thing from a Google SEO point of view is that Yandex, having taken a significant market share back off Google in Russia - it's something like 5% - as result of machine learning, you've got to say, \"Well, Google's likely to follow suit.\" Rand: Yeah. Well, Panda was certainly right. So there's this Google engineer, and his last name is Panda. He comes up with this scalable machine learning technique, and they implement it. Then they name the update after him, and this is the first we've seen of that. Andy: Yeah. Rand: So maybe they're going in that direction. Andy: I think it's inevitable. Rand: Wow. Andy: But Yandex has made that something of a core skill. So there are these machine learning competitions around the globe, and if you look at those competitions, they're often run by Yahoo, funnily enough. Rand: Yeah. Andy: But if you look at those competitions . . . Rand: Well, Netflix had a very famous one, right? Andy: Right. And you'll find that Yandex will have put in several teams competing to succeed, and they are quite often in the top ten, sometimes first, second, and fifth, that kind of result. They're really very keen on it. Rand: That's very fascinating. So, Andy, real quick, if I'm doing SEO for Yandex, I want to rank well there, what are a couple or three things that I can do actively to help my site? Andy: Well, it's going to sound a bit straightforward really. You need great content. It needs to look good. It needs to handle the Russian language well. It needs to have plenty of good inbound links, and some of them can be paid, because Yandex has a different approach to paid links to Google. Rand: Wow. Okay. Andy: They don't like paid links, but they accept that sometimes they have to count them, and they will say publicly that they have to count paid links. Rand: Fascinating. Andy: But basically, you've got to try and predict what the Russian human assessors are going to think is great content and they're going to want to match that in the particular search that you're targeting. Rand: So maybe surveying your own small group of folks and saying, \"What would you want to see here?\" Try and produce that content. Andy: Yeah, and you have to say that it looks like that's likely to be what we in SEO do much more of in the future. Rand: Fascinating. I love it. Well, Andy, thank you so much for joining us. Andy: No problem. Rand: Thanks for sharing so much about Yandex. Andy: You're welcome. Rand: And good luck to you. Andy: Okay. Thanks, Rand. Rand: Cheers. Andy: Cheers. Rand: Take care, everyone.Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SMX Advanced: Andy Atkins-Kruger Talks International SEO and Yandex"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SMX Advanced: Andy Atkins-Kruger Talks International SEO and Yandex"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Aaron Wheeler\n          \n            Aaron Wheeler\n          \n            Aaron Wheeler"
}