{
  "url": "https://moz.com/blog/smx-social-in-long-beach-ca",
  "slug": "smx-social-in-long-beach-ca",
  "title": "SMX Social in Long Beach, CA - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Ok I have been living under a rock I guess because I just got an email from Third Door Media and found out that SMX Social is coming to da LBC. I have always thought that Long   Beach, CA would be a great place for an SEO convention. I live downtown and I am in the industry, so it seems a little…",
  "content": "SMX Social in Long Beach, CA SEO Events By: Mark Hawks March 12, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Mark Hawks March 12, 2008 SMX Social in Long Beach, CA SEO Events This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Ok I guess I have been living under a rock because I just got an email from Third Door Media and found out that SMX Social is coming to da LBC. I have always thought that Long Beach, CA would be a great place for an SEO convention. I live downtown and I am in the industry, so it seems a little selfish, but really if I think of it from the perspective of how much fun everyone is going to have in Long Beach, it is not selfish at all. Long Beach is one of the rare cities in southern California that you don’t need a car. In both Orange County and LA you are dead without a car. Long Beach is different -- it's small and everything is within short walking distance. That is what makes it great for conventions. Great restaurants, bars, and entertainment are going to be the focus at night for everyone coming to SMX Social. So, I am all fired up, to say the least, and thought a YOUmoz post that highlights some cool local spots is in order. Especially since Rand and Rebecca are scheduled to speak at SMX Social. In fact, it will be hard to fit in everything the city has to offer in just 2 days. Alright, SMX Social is April 22 and 23 (Tues/ Wed). BTW, you get a 3 month subscription to SEOmoz PRO with registration. April 22/23 is just after Long Beach’s biggest event, the Long Beach GP. It will be very hard to get a hotel room downtown the weekend before SMX. If you are interested in coming early, good luck. Long Beach Grand Prix will bring well over 500,000 people to the city. Downtown/Shoreline streets are closed because the race is actually on the streets downtown. Parking spaces sell for $40-50 a day, I’m not kidding. It is the type of weekend that if you live here, you have to go to the event or get the hell out of town. It will be a “fun in the sun” weekend with A LOT of alcohol and eye candy and, oh yeah, a car race. If you decide to go for it, you’d best get booking your hotel now. Here are some bars and restaurants to hit at night. First, and most important...Bars: House of Hayden is my favorite local bar. Cool décor, cool alternative/indie/punk/hip crowd is always here. This is the type of bar that you either start or end your night at. Auld Dubliner: Irish style pub across from the convention center. Great beer and a little more normal crowd if House of Hayden doesn’t sound like your thing. I haven’t tried the food other than the liquid bread (beer). 555 East Steakhouse has a great bar and probably the best bartender in all of Long Beach, CA. The food here is perfect; you will not find a better steakhouse. Eat in the bar unless you are on a date (not budget friendly) Smooth’s is actually a sport’s bar, but it is actually nice and the food is great. Yard House has 250 beers on tap and good food. It is also on the water and the patio will be nice in April. Restaurants - There are too many to list, but here are a few of my faves: Modica’s Deli – This is a great place to hit for lunch. They make some killer sandwiches. The Smokin’ Joe and Classic Italian are great. SkyRoom – Great food and great ocean views. Jacket required and no jeans allowed. 555 East – Excellent steaks and seafood. Lobster bisque is awesome. Eat in the bar and make sure to finish your dinner with some brandy and a cigar. L’Opera – Awesome food! Sevilla –Spanish food and great atmosphere, Salsa dancing Wednesday nights. Alegria – Excellent Spanish cuisine. Get the paella. Utopia – This is a great little restaurant with great food and not too pricey. Pine Avenue is 2 blocks from the Westin, where SMX is hosted. It has all kinds of great restaurants, like Fish House for seafood and oyster bar, Wasabi for sushi, and Taco Beach for great fish tacos. Plus, walk down by the water and there are another 7-10 chain restaurants like PF Changs, Outback, Islands, Bubba Gump, etc. There is also the infamous Roscoe’s Chicken and Waffles about 4 blocks away from the Westin. Segway rentals are readily available downtown, too. They are actually pretty fun and geeky. (Come on, you know you want to ride one.) I’d like to see the SEO Rascals rollin’ on some Segways. They just need to pimp ‘em out with beer holders (better brown bag it, this ain’t Vegas). Anyone else going to SMX Social Long Beach? Are you fired up now? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SMX Social in Long Beach, CA"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SMX Social in Long Beach, CA"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Mark Hawks\n          \n            Mark Hawks"
}