{
  "url": "https://moz.com/blog/smx-london-ranking-factors-in-2010",
  "slug": "smx-london-ranking-factors-in-2010",
  "title": "SMX London: Ranking Factors in 2010 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Somehow, my flight from Seattle landed just before the newest Icelandic ash cloud began shutting down airports across UK airspace. As a result, I was able to present at SMX London this morning. The presentation is included below.\nThis slide deck focuses on things that are probably in the search…",
  "content": "SMX London: Ranking Factors in 2010 SEO Events By: Rand Fishkin May 17, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 17, 2010 SMX London: Ranking Factors in 2010 SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Somehow, my flight from Seattle landed just before the newest Icelandic ash cloud began shutting down airports across UK airspace. As a result, I was able to present at SMX London this morning. The presentation is included below. This slide deck focuses on things that are probably in the search engines' ranking algorithm today (e.g. the reasonable surfer model), might be in today and probably will be more in the future (e.g. tweet data) and may or may not get in (e.g. Facebook's open graph). SEO Ranking Factors 2010 SMX London Everyone at SMX noted that this year's event is much busier and more active than last year. Goodbye recession; hello London as a new center of the search world. Looking forward to your comments as always! p.s. I'm planning to write a much more comprehensive post about the \"reasonable surfer\" patent, but in the meantime, be sure to read Bill Slawski's analysis. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SMX London: Ranking Factors in 2010"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SMX London: Ranking Factors in 2010"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}