{
  "url": "https://moz.com/blog/smx-seattle-addressing-clicks-cliques-clicktastrophes",
  "slug": "smx-seattle-addressing-clicks-cliques-clicktastrophes",
  "title": "SMX Seattle - Addressing Clicks, Cliques & Clicktastrophes - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This morning I spent a half hour interviewing Danny Sullivan about the upcoming Search Marketing Expo in Seattle on June 4 and 5. We hashed through quite a bit of material and I learned a great deal about what the goals of the conference will be, who the target audience is and why there are so many…",
  "content": "SMX Seattle - Addressing Clicks, Cliques & Clicktastrophes SEO Events By: Rand Fishkin April 25, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 25, 2007 SMX Seattle - Addressing Clicks, Cliques & Clicktastrophes SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This morning I spent a half hour interviewing Danny Sullivan about the upcoming Search Marketing Expo in Seattle on June 4 and 5. We hashed through quite a bit of material and I learned a great deal about what the goals of the conference will be, who the target audience is and why there are so many changes from his successful SES conference series. Size of Venue & Limited Crowd With SMX, the crowd capacity is 550 attendees, a far cry from the throngs of thousands in attendance at SES shows in San Jose or New York, but considerably larger than the tiny size of exclusive events like SEODays or Elite Retreat. Danny's hoping that by limiting the crowd size, he can do a few things: Create more one-on-one time for attendees with speakers and search engines reps Enable public parties rather than private, invite-only events after hours Cultivate the perfect size for networking Allow audience participation to be more egalitarian Cliques & the Search World I think Danny has recently felt the pain of the average conference attendee who has trouble getting time to talk to speakers, doesn't get invited to private parties, and may not even know anyone else at the show. As such, he's created built-in networking events on the night before the show (Sunday, June 2) and the first night of the show (Monday, June 3). The goal is to make sure that everyone has a chance of appearing in Rebecca's comic strips ;) No, seriously, I think he's hoping that people who attend will have a much better opportunity to connect with the people they want without restriction. It's a noble goal, and I hope that it has success. Change in Session Format The sessions at SMX are nothing like what you'd see at SES. There are only two tracks per day, and even then, the late afternoon debates (one on SEO, one on paid search) are all by themselves in their time slots. The content is radically different too, focusing much more on advanced strategies, working through search issues with people from the search engines and hearing about techniques and tactics that are typically never discussed during SES shows. Focus on Advanced Marketers Danny noted on the phone that while everyone is invited to attend, he hopes that this show will specifically provide very advanced search marketers with the kind of value they rarely get at conference sessions. The basics aren't provided here, and a high level of knowledge will be assumed, so the presentations from the speakers and the questions from the audience are expected to be of a different echelon than SES. A Few Problems with the Show It's hard to say anything negative about SMX - it's in Seattle (my favorite town, hence the reason I live here), it's on advanced topics, it's smaller and more intimate and Matt Cutts will actually be there. The only struggles so far have been: Including Speakers - Danny mentioned that with hundreds of speaker applications and only a couple dozen slots, he's had to say no to many of the folks who are often fantastic speakers. I barely got a slot myself, having to fistfight Ken Jurina out back of a chicken farm in rural Alberta. Presenting Content - with only two days, you're limited in what you can focus on and how deeply. Hence, Danny's creation of some of the specialty SMX shows later in the year - Local & Mobile and Social Media (both in October) Lack of Press - As Danny and I both noted on the phone - it's impossible to compress complex search issues (like those he wants to address at SMX) in a mainstream journalism publication. The background necessary to understand the issues properly would take the entire article, so getting press coverage here will be tough. That said, the event is less for the media and more for the attendees - that might turn out to be a very good thing. Uncharted Waters - there's no real focus group or user testing on this, and while Danny has an incredible track record and a ton of experience, I think even he might be nervous about how the new format is received and covered. I'd love to hear what you think, not just about the new SMX series, but about the problems with conferences in the past and what you'd hope to see out of this new endeavor. If we're very, very lucky, Danny himself might even come by and leave a comment or answer a question. :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SMX Seattle - Addressing Clicks, Cliques & Clicktastrophes"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SMX Seattle - Addressing Clicks, Cliques & Clicktastrophes"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}