{
  "url": "https://moz.com/blog/snapchat-support",
  "slug": "snapchat-support",
  "title": "Support 4.0: Using Snapchat for all of Moz's Support - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Support 4.0 with Moz's new philosophy on using Snapchat for all customer inquiries.",
  "content": "Support 4.0: Using Snapchat for all of Moz's Support Branding | Moz Tools | Moz News By: Nick Sayers April 1, 2015 Table of Contents Copied! By: Nick Sayers April 1, 2015 Support 4.0: Using Snapchat for all of Moz's Support Branding | Moz Tools | Moz News Innovation. Mobile. Community. Social. All words that come to mind when I think of Snapchat. Well, now a new word is creeping in… a word so disruptive to the Snapchat ecosphere that I’m going to bold it, then repeat it. Support. Yes, support. Moz has always been a customer-centric company. We innovate, and you enjoy. Moz is ready to take it further than ever. Support+Snapchat is going to change how you talk to us and learn about the Moz products. Now read the following emotionally driven marketing copy to get a better sense of our new (industry-changing) means of support... Move the needle on the go. Using Moz on the go with a desktop-based browser and have a question about Local Rankings? Just hold your phone up to your other screen and send us a snap of your issue. Make sure to shout loud enough. We love to hear you. Why boil the ocean? This is easy. Sleek. And, dare we say, innovative. It's like chat, but it completely disappears. You just need your phone and a crippling support issue. A team of unicorns. We've \"transitioned\" the zebras and horses to unemployment. We now only have unicorns. They will be blowing you away while helping with your support needs. Get ready to puke rainbows, folks. Game-changing privacy. NSA. FBI. CIA. NYPD. Google. Illuminati. They're all watching. Feel secure that your in-depth support explanations will disappear soon after you receive them. You won't have to worry about anyone knowing that you couldn't find an export button without our help. Don't open the kimono. Keep it clean. Unicorns are sensitive. Think of Moz's Snapchat as your sweet old grandmother's mailbox. The one those old Scholastic books she ordered for you always arrived in. Don’t tell her you didn't read them. Now reach out. Feel the disruption in the Support Force. Send a Snapchat to moz_help. And welcome to Support 4.0. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Support 4.0: Using Snapchat for all of Moz's Support"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Support 4.0: Using Snapchat for all of Moz's Support"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Getting Buy-In for Customer Stories — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Local Brand Loyalty Takeaways From That Time Ace Hardware Was Trending"
    },
    {
      "level": "H3",
      "text": "How to Build a Strong Brand Moat With SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Nick Sayers\n          \n            Nick Sayers\n          \n            Nick Sayers"
}