{
  "url": "https://moz.com/blog/so-sakis-what-is-wrong-you-got-us-traffic-but-where-are-the-sales",
  "slug": "so-sakis-what-is-wrong-you-got-us-traffic-but-where-are-the-sales",
  "title": "You Got Us Traffic, But Where Are the Sales? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "One of the main advantages of online advertising is that everything is measurable. The advertiser knows almost instantly all she needs to know about her ads: impressions, CTR, cost, conversions etc; that way he can quite easily calculate his ROI.Some advertisers who do e-commerce, however, come to…",
  "content": "You Got Us Traffic, But Where Are the Sales? Online Advertising S By: Sakis May 6, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! S By: Sakis May 6, 2008 You Got Us Traffic, But Where Are the Sales? Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. One of the main advantages of online advertising is that everything is measurable. The advertiser knows almost instantly all she needs to know about her ads: impressions, CTR, cost, conversions etc; that way she can quite easily calculate her ROI. Some advertisers who do e-commerce, however, come to me complaining about the fact that while they manage to increase their website traffic (primarily through PPC), the same cannot be said of their online sales. For some reason, many advertisers seem to believe that the great majority of traffic generated by PPC advertising to their websites shall equal many, many conversions. They often ask me, \"So, Sakis, what is wrong? You got us traffic, but where are the sales?\" Ok now, I'm sure your blood pressure, dear reader, is going sky high just like mine does when I hear that kind of question (more often than not in an aggressive tone...). So, what is wrong? Most of the time their websites are the problem -- bad design, usability, development. No credibility, no trust, no \"emotional values.\" I always try to be as sincere as I can towards my clients. I really believe that you need to do business with clients who are open to training. Clients who do not want to learn from you or implement what you think is best for their business will stop being an asset and will instead become a liability. Anyway. Back to the point. Of course, not all websites are badly designed. \"So, Sakis, our website is fine. Where's the problem?\" Well, a user who came to your website through a PPC campaign (or, in fact, through whichever venue) is not going to buy online necessarily. She may buy offline. The effect, of course, of online advertising in the offline world is not so easy to ascertain. Nevertheless, here's what a recent article in Harvard Business Review (April 2008), entitled The Off-Line Impact of Online Ads, reports: A recent study we conducted for a retailer with more than $ 15 billion in annual revenues-the vast majority of which come from its physical stores-had notable results. Over a three-month period, U.S. sales increased by 40% online and by 50% off-line among people exposed to an online search-and display-ad holiday campaign promoting the entire company. Because its baseline sales volumes are greater in physical stores than on the internet, this retailer derived a great deal more revenue benefit off-line than the percentages suggest. Even in terms of raw increases, though, online ads had a bigger impact on off-line than on online sales in a majority of our studies. Equally interesting: People tend to respond-with their wallets-more to search ads than to display ads Aside from this, another recent study by Enquiro Research entitled The Brand Lift of Search, showed that search marketing (which is typically not appropriate for branding) may have branding effects. According to this study, increases in brand affinity, brand recall, and purchase intent were shown due to search marketing activities. Client education is the only way for a win-win situation. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "You Got Us Traffic, But Where Are the Sales?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "You Got Us Traffic, But Where Are the Sales?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sakis\n          \n            Sakis"
}