{
  "url": "https://moz.com/blog/so-your-web-site-visitor-converted-to-a-sale-or-lead-and-all-you-can-say-is-thank-you",
  "slug": "so-your-web-site-visitor-converted-to-a-sale-or-lead-and-all-you-can-say-is-thank-you",
  "title": "So Your Web Site Visitor Converted To a Sale or Lead and All You Can Say is Thank You? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Did you know that on average a visitor will remain on a thank you page, after he has completed a form, longer than he remained on most of the web pages he visited before he completed the form? Well you might think what does it matter, he just did what i intended, he either just made a purchase or…",
  "content": "So Your Web Site Visitor Converted To a Sale or Lead and All You Can Say is Thank You? Design D By: debbiec September 10, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! D By: debbiec September 10, 2009 So Your Web Site Visitor Converted To a Sale or Lead and All You Can Say is Thank You? Design This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Did you know that on average a visitor will remain on a thank you page, after he has completed a form, longer than he remained on most of the web pages he visited before he completed the form? Well you might think, \"What does it matter? He just did what i intended, he either just made a purchase or he has become a lead.\" However, there is really so much more that you could offer him. We all know how hard we work in order to make the flow just right in our website to increase conversions, so why not take advantage of the fact that we have the complete confidence of this visitor and why let him leave so soon? He has just made a purchase or made an inquiry and he is left high and dry with nothing more to do. His next natural move will probably be to return to what he was doing before he was looking for your product or service or he will continue surfing the Internet. 5 ideas of items you could add to your thank you page in order to keep your visitor around a little longer and make him feel that his visit to your website was really enjoyable, rewarding and memorable: 1. RSS feeds You may or may not have requested permission from the visitor on the form he just completed to send him newsletters, campaigns and product updates however these will probably be sent to him by email. We are all aware of the huge amount of promotional emails we receive on a daily basis and I assume that you are all similar to me as sometimes I have more patience than other to read these promotions before I trash them, so why not offer your user an RSS feed. That way even if he opted-out from your promotional email, deletes them when they arrive, or files them away in a “Must Read” folder that is never read, you can still reach this visitor on a regular basis. 2. Newsletter subscription You may or may not have requested an opt-in to your newsletter on the form, however, even if you did perhaps your company has a variety of newsletters for different products, services or interests then you could offer a form for him to subscribe to additional newsletters. 3. Links back to your website You are now in a position that you know exactly what your user has just bought or requested so why not offer him more information either about this product, or other related products. You could also offer him a link to a blog or a forum. 4. Link to subscribe to an upcoming webinar If your company runs webinars then perhaps you could offer a link to sign up to one of these to your visitor. 5. A promotion for another product If you have other products that are on special promotion, or better still if you can now offer something to your visitor with a discount based on the fact that he has just purchased something, then offer it now. You should also mention that in order to be eligible to receive this special discount he has to make the purchase within 24 hours of his previous purchase. 6. Forward to a friend button or form People love sharing information on the Internet so why not make it easy for your visitor to share your website with his friends or maybe even let him forward the special offer you are offering him due to his recent purchase. You could enable his friend to be eligible for the special offer if he purchases it within 24 hours. For the forward to a friend feature just offer a very basic form and display the subject of the email that will be sent plus an additional message. Let your visitor change these if he wishes. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "So Your Web Site Visitor Converted To a Sale or Lead and All You Can Say is Thank You?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "So Your Web Site Visitor Converted To a Sale or Lead and All You Can Say is Thank You?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "debbiec\n          \n            debbiec"
}