{
  "url": "https://moz.com/blog/so-you-call-yourself-an-analyst-part-2-analysis-redefined",
  "slug": "so-you-call-yourself-an-analyst-part-2-analysis-redefined",
  "title": "So You Call Yourself an Analyst? Part 2: Analysis Redefined - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Well here we go, you ready to jump into analytics, part deux? Just a heads, up this is the second post of a three post series. The first post, \"So You Call Yourself an Analyst, Part 1: Asking the Right Questions, walked through ways in which you could reevaluate the questions steering your…",
  "content": "So You Call Yourself an Analyst? Part 2: Analysis Redefined SEO Analytics By: Joanna Lord September 28, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Joanna Lord September 28, 2010 So You Call Yourself an Analyst? Part 2: Analysis Redefined SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Well here we go, you ready to jump into analytics, part deux? Just a heads, up this is the second post of a three post series. The first post, \"So You Call Yourself an Analyst, Part 1: Asking the Right Questions, walked through ways in which you could reevaluate the questions steering your analytical efforts.The tough love truth is that most marketers are not analyzing the right data. We have so many tools to help us \"analyze,\" that most of us are sitting in front of our dual monitor set-ups, staring at reports, excel grids, and pivot tables wondering what the hell we are supposed to be seeing. This is analysis paralysis, and I am here to help talk you back to a place of insight and action.#1 Anomolies take precedenceI get asked a lot, \"where should I start?\" Simply put -- start with the data that looks strange. The majority of your time should be spent on things that surprise you, things that concern you, and things that shift the momentum of your website's performance. For example, last week at SEOmoz, I was pulling our weekly stats and saw this:I saw that our Rank Tracker tool traffic fell of a cliff. #awesome. You can bet this was prioritized, and we spent the next hour poking around the data before realizing the tracking code had been implemented wrong during a site update. {facepalm} So how do you research these anomalies?Analytics Intelligence is one of the more obvious places to start if you are using GA. It is under the \"Intelligence\" tab and allows you to set alerts for when your data goes \"off pattern.\" It notifies you when numbers fall below or peak above user-set parameters. These notifications are controlled by a sensitivity gauge that you control, and when an alert is triggered you are notified by email. The \"Compare to\" feature is another great way to see issues quickly. In GA you can compare two date ranges and see how they measure up, which is a great way to see discrepancies in otherwise stable datasets. You can compare the vital stats of any section of your site from one date range to another. I use this all the time. (Example of \"Compare to\" feature, making drops in data, week over week, obvious) There are a number of other ways to isolate out changes in your site's data, most of them involving things like manual benchmarking or daily monitoring. I know not everyone uses GA, but the two features above are a great way to see anomalies as they are happening, not after the fact. #2 Align your analysis with your company's current goal(s)Next up, you should turn your attention to stats that directly match up or feed into your company's goals. It should be noted that some analysts would prioritize this data to the top of your list, but I personally think that stable data is just that...stable. For that reason, I think only after you have problem data isolated out and understood should you turn your attention to \"other data.\"When I say \"other data\" I mean-- the data that will let your company know if its hitting its goals. It is up to you to know the roadmap for your company and isolate out data insights that help keep you on track. Once or twice a month I go in and \"explore\" but analysis, for the most part, should not be exploratory. So what are some specific features that can help you analyze key data?Advanced segmentation is one of my favorite GA features. It enables you to quickly cross reference different metrics, dimensions, user types, and variables. You can save segments and apply them across multiple profiles, so if you have a key metric the whole company is watching and working on, they can easily log in and check progress with a saved segment. Here is a video on advanced segmentation if you are looking to get started.Visualization of metrics is too often overlooked in my opinion. There is a number of visualization options in GA that allow you to see the data differently. I am a firm believer in viewing the same data set in a variety of ways, because in my experience it forces your brain to revisit relationships, trends, etc. (Visualization options in GA, I particularly love bar graphs for gauging relationships)Lastly, I do want to mention the weighted sort feature in GA, since it is so new, and a lot of people probably still aren't using it. After months of asking for it, GA gave us the ability to take a metric in list view and \"freeze\" it so we can apply a second filter. If you don't have GA, Dr. Pete shows us how to create your own here. This helps us analyze only data with the greatest impact.#3 Not all data is good data, know when to move onThis is a tough one for a lot of analysts. It can be a \"data-head high\" to get into the numbers and spend hours trying to prove a hunch, but it is important you know when to walk away. Yup, that's right...I am telling you to give up, throw in the towel, wave the analytical white flag. You can't change the numbers. You just can't. Sometimes the analytic Gods will win, and sometimes you will, let it be and move on.What are you left with? The data that matters. The hardest part about analytic packages like GA, Omniture, and others is that there literally is an unlimited supply of data. By using company goals to prioritize your analysis and using all of the features at your disposal, you begin to see that pile of data take shape.Repeat after me friends: \"I will only spend time on data that will return the love.\"Next week I will finish up the series with the third post focused on applying value to this key data and using those values to help decide on action steps. I will also wrap up the series with some examples of how an analyst can better present all of this data to those that need to see it. I will try to keep it shorter than this week's post, but no pinky swears on that one. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "So You Call Yourself an Analyst? Part 2: Analysis Redefined"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "So You Call Yourself an Analyst? Part 2: Analysis Redefined"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Joanna Lord\n          \n            Joanna Lord\n          \n            Joanna Lord"
}