{
  "url": "https://moz.com/blog/social-media-sites-the-future-of-seorm-or-just-a-fad",
  "slug": "social-media-sites-the-future-of-seorm-or-just-a-fad",
  "title": "Social Media Sites the Future of SEO/RM or Just a Fad? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Social media sites as of late seem to be a staple of search engine optimization and reputation management, but will this continue to hold true in years to come? It currently seems that one of the easiest ways to get a company/individual to the top of Google is by using social media sites. With…",
  "content": "Social Media Sites the Future of SEO/RM or Just a Fad? Social Media D By: Dustin Ma May 22, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! D By: Dustin Ma May 22, 2009 Social Media Sites the Future of SEO/RM or Just a Fad? Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Social media sites as of late seem to be a staple of search engine optimization and reputation management, but will this continue to hold true in years to come? It currently seems that one of the easiest ways to get a company/individual to the top of Google is by using social media sites. With Google's current algorithm it only makes sense to register with the popular social media sites out there because they fit the algorithm perfectly. Google wants to see \"authoritative names,\" \"original content,\" \"high page rank.\" Having a profile on Myspace, Facebook, Twitter, Digg, etc. gives you exactly that. Creating a profile on any/all of these sites gives automatic authority on the internet. As long as you do not use the same words in every profile you also get original content on these profiles. In some cases, if you make a profile such as LinkedIn in the morning, just later that day you can see it on page 1 or 2 of Google. When I made my LinkedIn account later that same day, it got to the front page of Google; granted, my name doesn't have any real competition, especially in the SEO world, but it still goes to show how much weight these sites are given. It seems to me with Google's most recent change on their search options they have given even more weight to social media sites, especially forums. Are social media sites completely golden now for search engine optimization or is it just a current trend? Will Google continue to give social media sites more credit and continue to build the algorithm/search options around these sites? In which case, we all might end up out of a job because of people like Tila Tequila with her millions of Myspace friends and Michael Phelps with his army on Facebook may be the future of SEO. However, things change, and methods used years ago for search engine optimization are almost dead, obsolete, or have changed so much they are almost something completely different. I do believe from this point forward some sites will give at least some strength for a website, and it will provide at least some link juice for many years to come even if a big change happens. Looking at the 2nd part of this article though (using social media for reputation management), I believe reputation management has been forever changed by social media sites. It puts companies and individuals not just with a face and a profile, but comments and user feedback. Even if you see slander and negative comments or anything of the sort against a company online, if they have a social media site such as Facebook, Myspace, etc. you can get a really good strong feeling of the individual or business. The act of online reputation management has gotten a bit easier because of this; you can now create your client's fan base and let others see that positivity. I believe that with the internet, positivity creates positivity while negativity creates negativity--it’s like one giant pendulum. The ability to delete comments and filter out negative comments that could be created by competition, bitter ex-employees, etc. is what makes social media sites the current pinnacle of R.M. Almost every social media sites let you delete comments. Blogs are a great way to release testimonials, press releases, and articles, ultimately giving your clients more credibility in their field, and helping wash the \"bad taste in anyone's mouth\" if they see anything negative online. Even if search engines give less credibility and/or power to social media sites, I believe so many individuals and companies have social media sites they will use them to cross reference other individuals/companies for years to come, if not forever. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Social Media Sites the Future of SEO/RM or Just a Fad?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Social Media Sites the Future of SEO/RM or Just a Fad?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dustin Ma\n          \n            Dustin Ma"
}