{
  "url": "https://moz.com/blog/social-media-is-the-disconnect-between-traditional-and-nontraditional-advertising-and-marketing",
  "slug": "social-media-is-the-disconnect-between-traditional-and-nontraditional-advertising-and-marketing",
  "title": "Social Media is the Disconnect Between Traditional and Non-Traditional Advertising and Marketing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The area of Indiana where I live was very hard-hit by the economic downturn.  I was fed up with being unemployed for the last nine months and was scouring the Internet, looking for a job.  ANY job.  Then I saw an ad for a local company that called for link building.  \"What the heck is 'link…",
  "content": "Social Media is the Disconnect Between Traditional and Non-Traditional Advertising and Marketing Social Media By: Andras Kovach December 8, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Andras Kovach December 8, 2009 Social Media is the Disconnect Between Traditional and Non-Traditional Advertising and Marketing Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. The area of Indiana where I live was very hard-hit by the economic downturn. I was fed up with being unemployed for the last nine months and was scouring the Internet, looking for a job. ANY job. Then I saw an ad for a local company that called for link building. \"What the heck is 'link building'?\" I thought to myself. I could do everything else the ad was asking for, so I thought I'd give it a try, though I'd never even heard of the term 'link building' in my four and a half years at a progressive ad agency. (They were as progressive as their clients allowed them to be, i.e. \"It's our company's money and we said this won't work!\") *Shudder* When I interviewed for the position, my bosses explained what was involved in the world of SEO and link building...and I understood most of it...but there seemed to be a disconnect between what I had learned about marketing and advertising in the past and this new-to-me SEO thing. It wasn't until I had been on the job for a few months that I finally realized what the big picture of link building was all about. So, in order to explain SEO to my friends, family, and unfortunately, a lot of people I pitch links to, these are the ways I have to explain it, in simplified form. Otherwise, they all tend to nod their heads in agreement and then stealthily change the subject by muttering an \"oh...neat....\" (Again, *Shudder*) I tell them when it comes down to it, link building is akin to getting your company's (or client's) name or product \"out there\" via keywords in hyperlinks all over the Internet. It's like traditional advertising and marketing in the sense that you are exposing a service or a product to potential users or buyers, but unlike traditional advertising and marketing, link building is much, much more analytically involved, at least in my opinion. And most of the analytical stuff I tend to leave to my boss because it's still way over my head. I also tell them link building's twin is sitting alone in your office or cubicle for eight hours a day without much social interaction. This was something my bosses warned me about, and I told them I'd be fine with it. But, I'll admit, it does tend to get boring at times. Occasionally there's the random press release, postcard run, or magazine ad to release me from the monotony of it all, but, ta-da! Enter: social media! (My savior!) Social media is my ticket to not falling asleep every day. It's interesting and current. It's better than \"the way we've always done things,\" i.e. traditional advertising and marketing. It's a real-time interaction between you and your customers or your clients' customers. It's awesome because social media is new and exciting and ground breaking. And best of all, it's actually FUN! In my humble opnion, social media is the main missing link between traditional and non-traditional advertising and marketing that we've all been waiting for for a long time. And when you have to explain the concept of SEO to most people, it makes a whole lot more sense to them if you just mention Facebook, Twitter, Stumble Upon, or LinkedIn, etc. rather than search engine \"spiders\" and \"bots\" or \"crawling\" and \"alt tags.\" And when you mention the terms \"Google\" and/ or \"Yahoo!,\" it's like a light suddently goes on above their heads and they finally \"get it.\" (I think I just heard someone saying somewhere, \"Thank God for brand recognition!) I'm not saying social media is the answer to all advertising or marketing campaigns; if it doesn't make sense to use social media for the project you're heading up, just don't use it. And some may argue that social media IS non-traditional advertising and marketing. But what I am saying is that when traditional and non-traditional advertising and marketing are being compared or examined, social media tends to fall between the two quite nicely. It feels like a bridge connecting the traditional to the non-traditional. I read a blog post on YOUmoz a while back and one of the discussion points was if it was easier to go from being taught traditional media or to not know anything about media at all when transferring into the world of SEO. I think it's a personal thing; everyone's different. For me, it was easier knowing what I knew about advertising and marketing going into the SEO realm than I think it would be if I hadn't ever been in this industry. I think it's definitely worth pondering over. Humans desire to be understood. They also desire to understand why they do and say the things they do and say. And with any path you choose in your life involving how you spend the majority of your time, usually via a job, you tend to wonder why you're doing what you're doing. We may never find out the point of it all or if we've made any kind of dent, but we as SEOs are closer than we ever have been before to fully understanding the world of advertising and marketing traditionally and non-traditionally, through the bridge of search engine optimization. P.S. Please be kind; this is my first blog post! :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Social Media is the Disconnect Between Traditional and Non-Traditional Advertising and Marketing"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Social Media is the Disconnect Between Traditional and Non-Traditional Advertising and Marketing"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Andras Kovach\n          \n            Andras Kovach"
}