{
  "url": "https://moz.com/blog/social-media-metrics-not-as-difficult-as-you-thought",
  "slug": "social-media-metrics-not-as-difficult-as-you-thought",
  "title": "Social Media Metrics: Not as Difficult as You Thought - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When was the last time you were asked, “So what’s our average growth rate on Facebook?” Err... Whether it’s a client, a boss, or the CEO of the company, you get questions like this. Ok so perhaps you’ve never heard this exact question, but I can pretty much bet that you’ve heard something similar.…",
  "content": "Social Media Metrics: Not as Difficult as You Thought Social Media By: Jennifer Sable Lopez December 7, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jennifer Sable Lopez December 7, 2011 Social Media Metrics: Not as Difficult as You Thought Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. When was the last time you were asked, “So what’s our average growth rate on Facebook?” Err... Whether it’s a client, a boss, or the CEO of the company, you get questions like this. Ok so perhaps you’ve never heard this exact question, but I can pretty much bet that you’ve heard something similar. They want to know how your social media efforts are doing; they want to know that you’re tracking key performance indicators. But social media isn’t as simple as “track these numbers and *poof* you’ve got it all figured out.” Determining KPIs Every social media marketer struggles with which KPIs are the best to track. We know as marketers that having metrics to guide you and measure progress against is super important, yet here we still stand somewhat weary of what to keep an eye on. While there are many posts out there telling you the absolute best metrics to track in social media marketing, I’d like to take a different approach. Saying there is a top list of metrics we should all blindly collect for collection sake is a dangerous way to approach social media tracking. In fact, I feel strongly that every organization will likely want to keep a close eye on slightly different metrics throughout the lifetime of their social efforts. I know that throughout my time at Moz, I have paid attention to a number of different social KPIs; some of them are always there, and some of them are project-based. My tracking process has evolved with our social media marketing, so I don’t feel comfortable telling you there is a one-size fits all formula for social media marketing KPIs. However, what I can get behind is the idea there are pieces to social that need to be measured in an ongoing way to help us better understand the health of our social media efforts. Here at Moz, we wanted to integrate social analytics into our PRO software for this exact reason -- to help inbound marketers better know the health of their social media marketing efforts. What Makes Your Social Efforts Healthy? When I manage social here at Moz, I am always pushing for four things - growth, engagement, momentum, and results. What those four words mean to your social efforts versus mine might be completely different. However, the new social dashboard we’ve launched is there to help every marketer measure those four pillars more effectively. Let me run through each and give them a little more shape. But when it comes right down to it I truly believe, if you can check in on these four pieces and see progress, your social media marketing efforts are going well. What Do I Mean by Growth? I know, I know... everyone always tells you that it’s not the number of followers that count, and for the most part, I agree with this sentiment. However, while it’s not the size that matters most, it’s a great starting point and base to measure your growth. Often times, this is the number that your boss or client (or whoever) cares about. In about five seconds, I can track the growth of both my Twitter and Facebook accounts, download the data into a csv to track, or show an exact screenshot in my weekly/monthly report. BOOM. What Do I Mean by Engagement? “Social media is about engagement.” How many times do you hear that one? Well, it’s true. If you’re not out there engaging with your audience (and vice versa), then what in the heck are you doing? This isn’t the place to go into all the details around how to do that, but I want to show you how easily you can track retweets, mentions, and replies over a given time period. Do you follow the SEOmoz twitter account? If so, you probably see that we engage with the community quite a bit. To us, monitoring the level of engagement is much more meaningful than how many followers we have. We want to see that our efforts are engaging the community and that our community feels they’re heard and are a part of the greater conversation. Social analytics in Moz will continue to grow with this in mind. We want to show you not simply that there is activity, but whether it’s valuable activity. What you see right now is simply the starting point. :) What Do I Mean by Momentum? Whee! To me this is the fun one. Sure, sure, sure the numbers may increase, but showing that the increase each week is gaining momentum is far more important. This is why we track KPIs: to show momentum. You want to see that percentage increase go up! What Do I Mean by Results? As social media marketers, we’ve had to defend our efforts and worth since the beginning. What does a tweet do for us? What does an engaged conversation on Facebook do for the company’s bottom line? What is the lifetime value of a new set of engaged eyes? Whew... these are hard things to figure out. There are lots of tools out there trying to nail this down. This is where Moz social analytics comes in... we track your traffic from social media sources. All you have to do is hook your campaign up to GA (which if you have a campaign already you’ve probably already hooked up GA). Social analytics is our first step in this direction. We aren’t hoping to be your social management platform; we realize that is not where our strength as a company lies. Instead, we have data. We have a slew of data, and we get inbound marketing. We hope to show you how all of your time spent on social actually has worth. We’ve started with traffic. We wanted to show which of your social efforts are resulting in more traffic. This is a great place to start. So Where Does Moz Go From Here? We have a goal here to show marketers important data to help them better prioritize their time. Time is a precious thing. We hope that our first stab at social analytics gets you closer to knowing how well your social media management is doing right now and help you better allocate your efforts in the future. We realize the limitations of our first launch, and we would love any requests/feedback/freak outs you have. Once you get a chance to check out the social analytics, please take a second to fill out this quick survey as this will help us build exactly what you want. In the meantime, get on in there and check it out. No better time to start collecting this data than now. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Social Media Metrics: Not as Difficult as You Thought"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Social Media Metrics: Not as Difficult as You Thought"
    },
    {
      "level": "H2",
      "text": "Determining KPIs"
    },
    {
      "level": "H2",
      "text": "What Makes Your Social Efforts Healthy?"
    },
    {
      "level": "H2",
      "text": "What Do I Mean by Growth?"
    },
    {
      "level": "H2",
      "text": "What Do I Mean by Engagement?"
    },
    {
      "level": "H2",
      "text": "What Do I Mean by Momentum?"
    },
    {
      "level": "H2",
      "text": "What Do I Mean by Results?"
    },
    {
      "level": "H2",
      "text": "So Where Does Moz Go From Here?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez"
}