{
  "url": "https://moz.com/blog/social-media-curation-guide",
  "slug": "social-media-curation-guide",
  "title": "Social Media Curation Guide - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Social content curation is an important building block of your inbound marketing strategy. In today's post, Gianluca Fiorelli shares his tips for preparing and executing your social content curation strategy, along with his favorite tools and thought leaders in the space.",
  "content": "Social Media Curation Guide Social Media By: Gianluca Fiorelli February 28, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Gianluca Fiorelli February 28, 2013 Social Media Curation Guide Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Last year on SEOmoz, I published The Content Curation Guide for SEO, which - even though it is still valid - I thought it needed a fresh addition. Not only does this post update some of the information shared, but it also digs deeper into an aspect of content curation that is actually the most used and, possibly, useful to SEOs and Content Marketers who must deal with more duties than just curation: social media curation. For that reason, I gave a Mozinar last week about this topic where I explained why it is important to include social content curation in your inbound marketing strategy; how to prepare, organize, execute, and analyze your social curation activities; and what tools to use. If you missed the opportunity to attend the live broadcast of the Mozinar, you can watch it here. Joanna Lord does great social content curation on Pinterest! Audience Q&A 1. If you have many clients for which you need to curate content, you need to have so many profiles for all the social media accounts etc for their respective industries. Any good tools for managing these and managing mentions and more across all the accounts? During the webinar, I praised Buffer for their awesome tools. However, its premium version only allows adding up to 12 social profiles and have up to two team members access the accounts. If you are doing social content curation for many clients, it might not be the best tool to use. In your case, I would possibly use Hootsuite, whose premium plan allows you an unlimited number of admins for social profiles, a much larger number of social networks (Google+ included), and strongly social web platform like Scoop.it, Tumblr, YouTube, and others. 2. Can you discuss your methods of not repeating content through different forms of social media (i.e. posting the same link on your organization's Facebook and Twitter accounts)? Ideally, to obtain the best effect from your social content curation, it is always better to craft the message accordingly to the specific nature of the social media you are going to share it. For instance, not only Twitter, Facebook , and/or Google+ have their own specific characteristics that you could miss using at your advantage with a single \"standard\" message, but they also present very different user behaviors, even in the case the users are the same in those three social networks. With platforms like Buffer and Hootsuite, you can easily switch from social to social from within the same platform, which will surely help. 3. How do you stay on top of all this content? I have Google RSS feeds, Pocket, Paper.li newspapers, Flipboard, and more continuously feeding in stories on SEO, PPC, social media, etc. - and it just overwhelms me. How do you a) stay sane, and b) decide what and what not to read/create content about? Good question! Actually, even if I like to experiment and play with as many tools I can, I don't use many. To be honest, I use only these ones: Zite, Twitter (the selected people/sites I follow and the list I created), Google+, and the posts/comments in the blog I trust the most (i.e. SEOmoz and YouMoz) for discovering new sources Google Reader as the hub of all the sources I select with time Buffer, for the sharing process, and Bit.ly, Followerwonk, Google+ Ripples, and Facebook Insights for the analysis of my social curation activity How do I \"stay sane\" and decide what and what not to read/create content about? Experience sure helps me, because with the passing of time, you learn how to easily recognize if one piece of content is so outstanding you should share it with your audience. But here few tips, which may help you: Don't read first, but \"skim\" the posts in your RSS Feed. If the first paragraph (more than the title) makes you want to read more, then there's a chance that the posts is good and interesting. Put a lot of weight in your sharing decision of the conclusions of the post. The best posts usually have amazing last paragraphs, which not only summarize the thesis of the post and its takeaways, but also make you literally say \"WTF!\" 4. What should the frequency of shareing blog posts be? If by blogs we mean social shares, the frequency depends on the social network you are sharing your updates. The most common rule is to not overwhelm your audience with an excessive amount of shared content. For this reason, I am not particularly a fan of automation in social media, even if acclaimed people like Dan Zarrella are praising it. Automation, which is not the same as scheduling, takes away the human touch of a real and thoughtful human social curation, which - with the quality of the content shared - is what makes the difference. That said, especially if your audience is spread all over the world, it is more than probable that you will need to share the same content at least twice in order to be reach the most of them when they are socially active. Luckily, social networks like Facebook and Google+ ( thanks to their Lists and Circles) offer you to make invisible these \"reshares\" to that part of your audience, who saw it previously. 5. How do you measure the success of content curation? I measure it considering the two objectives I always want to reach with my content curation activities: The increment of the number of followers/fans my social profiles The number of the authors of the content I curated who thanks me and, possibly, follow me Mozinar by Gianluca Fiorelli Why social content curation We see it everyday in the SERPs, we see it as being in the background of every Google update of late (Panda, Penguin, EMD), and we see it in people's buying behavior: trusted brands are the entities of excellence for Google. This positive attitude of Google toward brands is logical. In fact, people tend to trust more a recognized brand rather than some unknown one. This is even truer online because brands tend to be considered as a reassuring “lighthouse” within the Internet, which is mostly a confused ocean of information. Brands like Amazon, REI, CocaCola, Airbnb, and Zappos have a trust advantage that sites as onlinewarehouse.com, outdoors.com, sodabeverages.com, cheaphotels.com, and allkindofshoes.com (any reference to existing sites is purely casual) may have. The same can be said regarding to people. We naturally tend to consider someone as the trusted reference in a specific niche as we get to know them. For instance, our own Rand Fishkin is a trusted reference in the SEO niche. Just few examples of thought leaders in different areas, present and past. As well defined by Forbes: \"A thought leader is an individual or firm that prospects, clients, referral sources, intermediaries and even competitors recognize as one of the foremost authorities in selected areas of specialization, resulting in its being the go-to individual or organization for said expertise.\" More over: A thought leader is an individual or firm that significantly profits from being recognized as such. Thoughtful leadership is the real intangible gold that makes a Brand or a Person a leader in its niche. But none is born a leader. Throughout the past years, we have understood how inbound marketing (meant as the synergy of SEO, content, and social media marketing) is the correct strategy to use in order to obtain this so dreamt leadership. Content curation, as a facet of content marketing, can be of help in making that objective true. How to to properly conduct a strategy of social content curation First of all, you must make sure you're targeting the correct audience. This section of Followerwonk is a huge help in making that goal possible, and the methodology explained by Peter Bray in this post. However, while that methodology is useful to understand your potential audience, you also need to understand a second kind of audience: the people who are able to influence the thought leaders in your niche, because nothing is truer – especially for brands in its beginnings – than that it is easier to influence an influencer via the ones who are already influencing them (sorry for the tongue twister). Once you have determined your audience, you should map it and segment it. After these steps are complete, you can start doing Social Content Curation for real. How can I find trusted sources of information to curate? Resource directories and news aggregators You can use directories like Alltop, where you can find extremely well curated list of blogs for almost any kind of topic. You can also use curated aggregation sites like Inbound.org or Hacker News in the Internet marketing and technology fields. Sites like those exist in mostly every niche; for instance, www.mortgagenewsdaily.com is news aggregator about mortgage. Don't forget about how often news aggregation is conducted via newsletters, especially when it comes to very small and specific niches. Fortunately, you can rely with newsletters aggregators as Smartbrief to dig into these hidden treasures. Finally, if you are working for an enterprise level company, you can find market content curation enterprise solutions such as Factiva by Dowjones. Social network personalized suggestions, lists, and groups Quality resource directories, curated news aggregation sites, newsletters aggregators, and enterprise solutions are perfect for collecting sources, but as time passes and you become more socially active, you should start paying more attention to other sources for discovering new content to curate. A few examples include? Twitter Stories Linkedin Today Slideshare’s recommendations Suggested Communities and Google+ suggestions in its Explore section YouTube suggestions And so on… As you can see, all kinds of information is based on personalization factors. For this same reason, it is safer not to mix the use of what you are doing on your personal social profiles, or you can literally screw up the quality of the suggestions. Never forget to log out when letting your kids watching videos on YouTube, or... A site like Topsy, thanks to its very good internal search feature, is another great source for discovering new content to share with your audience, especially when you must to care also the \"freshness\" factor of your curation. Lists, like the ones created by the users on Twitter and Facebook, Groups (FB), and Communities (G+) are usually overlooked. However, they are amazing sources of new and surprisingly good content. They are also an easy way to extend your own audience thanks to the conversations you can create there, and a really easy way of discovering the ones I previously defined as the influencers’ influencers. The old school (still good) methodology: blogs commenter’s analysis Personally, this is still the methodology I prefer the most. It is not scalable and presents many defects in terms of time spent conducting a curation research, but – possibly – it is the best way not only to discover new amazing sources, but also for creating strong relationships with those same sources. When I was more of a new kid on the block in this industry than I am now, I follwed this tactic. I was able to discover sites like SEOgadget, Distilled, and SEERInteractive, and I also created great relationships with people like Richard Baxter, Dr Pete, John Doherty, Mike King, and many others, all thanks being very active on the SEOmoz community. How can I organize the sources I have collected? \"It's not information overload. It's filter failure,\" Clay Shirky once said. And filter failure happens if you are not able to organize the sources you have collected for performing you social content curation activity. What I am going to present is my methodology, which I do not pretend is the best one. What I know is that it gives me positive results, and therefore it may be of help to you, too. The curator’s best friends Google Reader and Buffer are my best allies when it comes to content curation. I use the Google Reader as the hub of all the sources I have discovered, and Buffer is the tool I prefer for socially sharing my curated content. When curating content, it is essential to perfectly categorize the main subject of your curation interest in subtopic. For instance, I subcategorize SEO into its different facets: Technical SEO Local search Link building International SEO Schema, Authorship, and G+ Etc., etc. More importantly, you must maintain the consistency of this categorization in every platform you are saving sources; for your Pocket account, Diigo, or your own browser favorites, and not just in Google Reader. This is how I categorize the SEO and social media topics in Subtopics How do I curate things? Do you have an example? The style and tone to use when doing social content curation varies depending on the social networks you are using for these simple reasons: Every social platform offers you different “formal” opportunities for sharing content. The character limitation of Twitter is the easiest difference you can list, but others are present. The users’ behavior varies a lot from a social platform to another. On Twitter, they tend to prize timely news shares; on Facebook, photos and videos; and on Google+, long forms works usually better than short ones. What voice to use is something that you learn with the experience and the analysis of the success (or failure) of the curated content you have shared. For that reason, it is important to use shorteners like bit.ly, or to use proprietary tools like Google+ Ripples and Facebook Insights, which allow you to track the life of your shares. You can find inspiration from people who master the art of curation. Here is a short list of “non-official curators” people and brands, who are indeed doing great social content curation: Avinash Kaushik and Mackenzie Folgerson on Google+ AJ Kohn on Twitter Guy Kawasaki and George Takei on Facebook Joanna Lord on Pinterest Starbucks on Instagram YouTube itself on YouTube What is the best side effect of content curation? As I have said since the beginning, social content curation should be meant as a content marketing tactic to help you and your brand become a trusted source of information, and eventually a thoughtful leader, in your niche. Social content curation can also be a great way to break the ice and start creating bonds, relations, and serendipity with other people, that can then result in future occasions for link building, social shares of your own original content, or even collaborations. In this sense, social content curation is a great “tool” for what it is normally defined as relationship or influencers marketing, as it shares the same purpose: creating trust. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Social Media Curation Guide"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Social Media Curation Guide"
    },
    {
      "level": "H2",
      "text": "Audience Q&A"
    },
    {
      "level": "H2",
      "text": "Why social content curation"
    },
    {
      "level": "H2",
      "text": "How to to properly conduct a strategy of social content curation"
    },
    {
      "level": "H3",
      "text": "How can I find trusted sources of information to curate?"
    },
    {
      "level": "H3",
      "text": "How can I organize the sources I have collected?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Gianluca Fiorelli\n          \n            Gianluca Fiorelli\n          \n            Gianluca Fiorelli"
}