{
  "url": "https://moz.com/blog/social-media-and-the-future-of-customer-relations",
  "slug": "social-media-and-the-future-of-customer-relations",
  "title": "Social Media and the Future of Customer Relations - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Recently, I’ve been doing quite a bit of reading and discussing the question of “What’s next?” in terms of social media, online brand strategy, and the Internet as a whole. There are many different, compelling opinions about what the future holds for our beloved World Wide Web, but I’ve found…",
  "content": "Social Media and the Future of Customer Relations Social Media J By: Jim Keller April 27, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! J By: Jim Keller April 27, 2009 Social Media and the Future of Customer Relations Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Recently, I’ve been doing quite a bit of reading and discussing the question of “What’s next?” in terms of social media, online brand strategy, and the Internet as a whole. There are many different, compelling opinions about what the future holds for our beloved World Wide Web, but I’ve found myself commonly summing up my own thoughts as follows: “more information, faster.” Facebook updates, tweets, and text messages: the up-and-coming generation of Internet users has developed a way to manage their lives through 160-character snippets of immediately syndicated conversation. They have come to expect information not as soon as it’s available, but before it’s available. Albums and movies are leaked before they’re even released. The Twitter community is well aware of the intricacies of the latest pair of Nike Dunks long before anyone has seen a proper press release. YouTube has given new meaning to the term 'Crisis PR', since you can bet your bottom dollar that when something goes wrong, someone’s there to catch it on video for the world to see. These examples aren’t the exceptions, they are the new rules of the Internet, and things are only going to get more interesting from here. The user generated content movement caused an undeniable change in the way Internet users interact not only with one another, but with the brands they identify with: More information, faster. What does this mean for customer relations? It means that every company needs to re-think how they interact with their customers. It’s no longer the case that your brand lives on one side of the communication divide, your customers live on the other side, and your PR team manages a smooth, controlled flow of information between them. The open nature of web 2.0 has broken open the ‘black box’ business model, and your customers now expect a level of transparency that would previously have been considered positively unreasonable. Take company blogs, for example. Recently on SEOmoz, CEO Rand Fishkin posted a personal note about how one shouldn’t be quick to judge people professionally and personally due to a single bad encounter. The post itself had nothing to do with the company or search marketing, but it received a generally positive response from the community, and I wouldn’t expect it to be the last time something personal goes on the SEOmoz blog. Now, flash back to five years ago. Imagine trying to propose to the board of directors that any single executive should have free reign to post quick, off-the-cuff thoughts that are immediately syndicated to a healthy mix of customers, potential customers, competitors, and the general public. It simply wouldn’t have been a reasonable suggestion – that level of transparency would have been considered to be too risky for the company image. However, in 2009, we’re finding forward-thinking companies embracing blogs, Facebook, Twitter, and a rich tapestry of other tools that bridge the communication divide between consumer and brand. Why are some companies embracing something that can be such a double edged sword? Because when it comes to “customer relations 2.0”, companies don’t have a choice in the matter, so it’s a question of whether to sink or swim. Blogs, YouTube, Twitter, Epinions, Yelp, and a thousand other user-driven sites are going to guarantee that your customers are sharing everything they know about your brand, your products, and your services. The good, the bad, and the ugly. The only choice you have is whether to embrace it or try to fight it, and the latter is going to be a losing battle. Compare the dismal performance of the RIAA in trying to combat the spread of MP3s with Apple’s use of the technology to sell five billion songs online, and you’ll understand why you need to adapt your business model to a changing world, rather than trying to fit the world to your business model. Some companies are doing it right. Zappos has shown that you can sell shoes sight-unseen as long as the customers trust your customer service in the event of a return. Bodybuilding.com not only ships products in record time, but they give you a brief biography of the person who physically fulfills your order. GoDaddy's CEO keeps a personal blog to showcase his mis-adventures as the leader of one of the world’s largest web hosts. So it seems that the cat is out of the bag: Your customers know - thanks the up-to-the-second newswire that we all connect to from our computers & phones - that behind whatever glossy portrait you paint as the public image of your company, real people with their own ideas, faults, and quirks are what live behind the brand. And in this age of unbridled interaction, they want to be introduced to those people. Make sure you give them that opportunity, or they’ll be happy to patronize someone they \"know\" just a little bit better. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Social Media and the Future of Customer Relations"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Social Media and the Future of Customer Relations"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jim Keller\n          \n            Jim Keller"
}