{
  "url": "https://moz.com/blog/social-media-optimization-article-released",
  "slug": "social-media-optimization-article-released",
  "title": "Social Media Optimization Article Released - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "While most of the search world is partying with Rebecca attending sessions at SES San Jose, some of us have been working away at our computers as though the biggest search function wasn't going on two states away. It's actually kind of awesome to be in such a quiet office, and it's equally pleasant…",
  "content": "Social Media Optimization Article Released Social Media By: Jane Copland August 27, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jane Copland August 27, 2007 Social Media Optimization Article Released Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. While most of the search world was partying with Rebecca attending sessions at SES San Jose, some of us were working away at our computers as though the industry's biggest event wasn't going on two states away. It was actually kind of awesome to be in such a quiet office, and it was equally pleasant not to have to pander to Rebecca's dislike of certain food groups when we decided on where to eat lunch. In the guide, we cover optimization techniques, ideas and tactics for nine of the most effective social media entities currently available. Those services include: StumbleUpon MySpace Facebook Yahoo! Answers LinkedIn Reddit Squidoo Digg Del.icio.us While there are many other social media and networking sites that marketers can use to their advantage, we recommend beginning social media campaigns with the above options. Examples of other social media and web 2.0 services can be found in the Social Media Marketing Tactics article that we released last year. The advice included in this new, in-depth article should be implemented on smaller services as well. UPDATE FROM RAND: I just wanted to say how proud I am of Jane for slogging through this. It was literally three months of work, interrupted by several client projects, to put this together in a finished version. What I see is a document that's incredibly valuable. While the older, free Social Media Tactics piece still rocks, this one really expands on the MOST useful sites and the BEST tactics for conducting SEO, traffic building, branding and networking through the social portals. The depth of information and the incredible number of case studies that really show off the power of the networks are what make this one of my favorite pieces we've ever done. I'm really proud of you, Jane - it's amazing to think how far you've come. I'd doubt there are more than a handful of people in the world who have your affinity with SMM, and that's saying something. BTW - I'm home sick today with whatever I caught in SJ (it just won't seem to shake), so yes, I'm using the SEOmoz blog to chat with Jane :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Social Media Optimization Article Released"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Social Media Optimization Article Released"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jane Copland\n          \n            Jane Copland"
}