{
  "url": "https://moz.com/blog/social-network-mind-trick-more-effective-influencer-marketing",
  "slug": "social-network-mind-trick-more-effective-influencer-marketing",
  "title": "Leverage This Social Network Mind Trick for More Effective Influencer Marketing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "When it seems like everyone you know is talking about the same thing, don't be fooled — it may just be a trick of influence. Learn how to harness the power of the \"majority illusion\" for yourself to strategically boost your audience reach.",
  "content": "Leverage This Social Network Mind Trick for More Effective Influencer Marketing Social Media By: Kelsey Libert January 19, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Kelsey Libert January 19, 2016 Leverage This Social Network Mind Trick for More Effective Influencer Marketing Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Did it feel like everyone you knew was watching “Making a Murderer” at the same time? It may have just been an illusion, thanks to a few key members of your social network. Researchers at the University of Southern California recently uncovered that when something appears more popular than it actually is, it can create the right conditions for it to be widely spread. They named this social network phenomenon the majority illusion, which happens due to highly-connected individuals within a social network skewing the group’s perception. These findings explain something we already knew — well-connected individuals can wield extraordinary influence. The majority illusion may also explain why it can take only a handful of the right influencers to make something go viral. Marketers can leverage the majority illusion to create the tipping point needed to drive action or spread a message far and wide. It starts with identifying influencers who have the potential to create the majority illusion among your target demographic, and then encouraging those influencers to help amplify your message. How social influencers can create the illusion of popularityAre you surprised when your non-marketer friends are completely unaware of something that was major news in the marketing world? You may think it’s popular because you kept seeing it discussed by key members of your network, which can give the impression that it’s universally popular. Image source Let’s say that in the figure above, each of the colored nodes is a Nickelback fan. The networks are identical, except different people are Nickelback fans in each figure. Since the Nickelback fans in figure A have more connections, it may appear to their network that Nickelback’s music is popular. This is how the majority illusion can create the impression within a group that an idea, behavior, or attribute is common, even if the opposite is true. How a social network is structuredBy illustrating how a social network is organized, we can see how an idea can potentially spread across communities or stay within a select group. We modeled a network graph of 77 Twitter influencers across eight different verticals: automotive, business, entertainment, finance, health, lifestyle, technology, and travel. Influencers were chosen based on criteria including relevance to a vertical and engagement. In order to create a usable graph, we then narrowed down the influencers’ 19 million followers to about 8,600 second-degree influencers. We chose those users based on a set of criteria that signaled mid-level influence: a following greater than 30,000, a follower to following ratio of at least 1:1, and a “lists per followers” rate of at least 6.5 (the number of times they have been added to a Twitter list per thousand of followers). Side note: Wondering why you can’t find Rand? He’s too popular to meet the parameters we set for a “mid-level” influencer. The resulting network illustrates the hierarchical relationships of first- and second-level influencers within a social network. Click here to see the full interactive graph. The nodes represent individuals, while the relationships between individuals are expressed as lines. The larger a node, the more relationships the individual has within the network. It’s important to understand this does not mean the large nodes have the most followers within the network; rather, they have the most connections within a particular network (some being first-degree, second-degree, third-degree connections, etc.). By examining this graph, you can see that social influence is more like six degrees of Kevin Bacon than a popularity contest. Because of this, marketers should focus on getting their message spread by influencers within a focused niche or strategically-positioned influencers to maximize reach, rather than looking for influencers who merely have a large following. Finding strategically-positioned influencersTools such as BuzzSumo and Followerwonk are a good jumping off point for finding influencers within a vertical. But you want to look at more than the number of followers, because influence depends on far more than popularity. There are three main factors for determining the most powerful members of a network: Betweenness Centrality: An individual’s location between different sections of a network Degrees: The number of connections, or edges, an individual has Closeness: The average number of degrees between the individual and others in the network So which of these variables are most important? It depends on your goals. Do you want people to take an action? Niche influencers may be best to create the majority illusion and give the impression of popularity, thus spurring others to mimic their behavior. An influencer’s closeness may be the most important factor in this case, since it signals they share a lot of connections with other individuals in their network. When you consider all of the common relationships within a niche group, it’s easy to see how these groups are susceptible to the majority illusion effect. Are the goals for your content expanding brand awareness or increasing viral potential? Influencers with connections to other communities may be most effective for reaching a large audience. Betweenness centrality is the greatest signal of strategic positioning, since it shows the individual’s potential to influence and connect different groups. Influencing a niche groupIf you want to create the majority illusion within a niche-focused group, target influencers with followers similar to them who have a low number of followers. Notice how some groups are isolated on the edges of the graph. We can assume the “majority illusion” is likely to happen within these groups since they have little to no overlap with the other communities. The researchers found that the majority illusion occurs most frequently in networks where individuals with a low degree of connections tend to connect with individuals with a high degree of connections. Those with a low number of connections may be easier to influence since they aren’t exposed to a wide range of ideas and opinions — plus they have less noise in their stream, so they are likely to see what the influencer posts. Getting a handful of niche influencers talking about your brand within the same time period may be the key to creating an impression of popularity. I see this happen all the time on niche blogs, where several blogs do a sponsored post or review of the same product within a short time period. It does have the effect of making it feel like you’ve seen something everywhere, even though only a few people are talking about it. Influencing a wide audienceIf you want your content amplified to the widest possible audience, target influencers who are followed by other influencers and have diverse connections across different communities. The closer an influencer is to the center of the graph, the more visibility they have across multiple verticals. This gives your content a better chance of escaping the echo chamber likely to occur within the more isolated groups. Individuals strategically positioned within their network, rather than those who are the most popular, may be the most effective at influencing a large number of people. Two great examples of this within our network model are Ann Handley (@MarketingProfs) and Daniel Pink (@DanielPink). Notice how their connections are spread across different groups. Example: @MarketingProfs Example: @DanielPink You don’t need to build your own social network graph to identify influencers with high betweenness centrality. Look for a mix of these two factors to spot strategically-positioned influencers: Influencers who are followed by other influencers. Consider the ripple effect that can happen when an influencer shares something and then other influencers following them share it. Influencers who are followed by people across multiple verticals. Potential reach is greater among influencers who have a diverse following, since their followers can spread things throughout multiple networks. Need help finding the right influencers? Check out our guide to identifying effective influencers. Once you pinpoint the influencers who can help you achieve your desired goal, be sure to deploy Rand’s advice on getting influencers to amplify your message. By visualizing the structure of a social network, you can see that having a lot of followers doesn’t necessarily equate to influence. Influencers within closely-knit groups may be best suited for influencing their followers to take action or adopt an opinion, since this type of group is primed for creating the majority illusion that \"everyone’s doing it.\" To reach a large audience, marketers should enlist the help of influencers who are strategically positioned between social communities, rather than those with a Kardashian-sized following. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Leverage This Social Network Mind Trick for More Effective Influencer Marketing"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Leverage This Social Network Mind Trick for More Effective Influencer Marketing"
    },
    {
      "level": "H2",
      "text": "How social influencers can create the illusion of popularity"
    },
    {
      "level": "H2",
      "text": "How a social network is structured"
    },
    {
      "level": "H2",
      "text": "Finding strategically-positioned influencers"
    },
    {
      "level": "H3",
      "text": "Influencing a niche group"
    },
    {
      "level": "H3",
      "text": "Influencing a wide audience"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kelsey Libert\n          \n            Kelsey Libert\n          \n            Kelsey Libert"
}