{
  "url": "https://moz.com/blog/social-media-marketing-article",
  "slug": "social-media-marketing-article",
  "title": "Social Media Marketing Article - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Last week, Rand discovered that an article we'd written quite some time ago had never been launched. \"How to Leverage Web 2.0 & Social Media Sites to Market Your Brand & Control Your Message\" covers thirty sites that you can use for marketing.",
  "content": "Social Media Marketing Article Mobile SEO By: Jane Copland March 5, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jane Copland March 5, 2007 Social Media Marketing Article Mobile SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Last week, Rand discovered that an article we'd written quite some time ago had never been launched. \"How to Leverage Web 2.0 & Social Media Sites to Market Your Brand & Control Your Message\" covers thirty sites that you can use for marketing. Obviously, the list is far from extensive: we went for a more general overview of what's out there than a comprehensive guide (that's called the Web 2.0 Awards). Ranked loosely in terms of usefulness, we looked at a range of factors, such as whether the site's pitch or \"About Us\" section bore any resemblance to what it actually does. We also looked at whether the site is tailored to a small niche or to the general public and whether it disallows engines from spidering its pages or nofollows links. In addition, there's some information as to what you can achieve on each of the sites in terms of uploading your content, controlling your image, gaining ground in the SERPs and attracting customers. It's meant to be informative and yet fun at the same time. Enjoy! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Social Media Marketing Article"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Social Media Marketing Article"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too"
    },
    {
      "level": "H3",
      "text": "Internal Linking for Mobile-First & Mobile-Only Indexing"
    },
    {
      "level": "H3",
      "text": "All About Fraggles (Fragment + Handle)"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jane Copland\n          \n            Jane Copland"
}