{
  "url": "https://moz.com/blog/social-media-traffic-isnt-useless",
  "slug": "social-media-traffic-isnt-useless",
  "title": "Social Media Traffic Isn't Useless - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Last week, Kim Krause's Cre8pc blog got Dugg. She wrote about her experience, which she described as largely negative:\n\nIn addition to the negative comments and free for all party over at Digg, ...",
  "content": "Social Media Traffic Isn't Useless Link Building By: Rand Fishkin January 23, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin January 23, 2007 Social Media Traffic Isn't Useless Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Last week, Kim Krause's Cre8pc blog got Dugg. She wrote about her experience, which she described as largely negative: In addition to the negative comments and free for all party over at Digg, I had to close the comments to my own blog post. I’ve never been forced to close comments here before. If you own a blog, you know what this is like. The worst in human behavior comes and sits on your front porch, begging for your attention. I had joined Digg last year, buying into the hype that this is something we must do in a Web 2.0 world. The belief is that the traffic that comes is great for your marketing efforts. I’ve already written about my dislike for Digg and how some Diggers gang up to get sites banned in industries they don’t like. I seem to be unable to unjoin it. As a general advocate of all things social media, linkbait and Digg (at least from a marketing perspective), I'm inclined to stand up for the value driven by these tools. I'm also a huge fan of Kim herself, and of Matt Bailey, who also wrote about the issue on his post - Social Media Under the Microscope: For a search engine marketer, social media traffic can be a proof that they know how to build quick attention for a site. However, beyond that shot of traffic, what is there to show? For those in the SEO business, there is not much else, traffic sells. For businesses that make their living on and off the web, traffic like this is not helpful. It is not direct, and the numbers show that there is even less engagement and branding impact than any other source of traffic. So besides a quick influx of visitors who don’t stick around or even read the full page, what is the benefit? That's what I'm here for, Matt, to show you the benefits. In my opinion, there's no debate - this social media stuff has incredible power. Let me show you what I mean. Last fall, we asked Ruud Hein to do some research for us about the effect being on top of Digg, Del.icio.us/Popular, Reddit or Netscape might be. We scraped the number of results for a Yahoo! linkdomain command (which pulls from Site Explorer) at the onset of a page making the social media sites and then re-scraped 3 days, 7 days and 14 days later. We did this for two solid weeks (gettting thousands of data points). Here's a few rounded averages (with some outliers and bad data points removed): Average number of links to a page 14 days after being on: Digg.com ~2,500 Del.icio.us/popular ~800 Reddit.com ~500 Netscape.com ~400 My hope is to eventually release all of this data in a large article on linkbait, but we've been overwhelmingly swamped with other things and I've let it slide a bit. If you're looking for a few more narrative data points on traffic numbers from being Dugg, look no further than this post on the linkbait bump effect at SEOmoz or, more recently, Danny's discussion on Search Engine Land's statistics, which show a parallel effect from linkbait. Linkbait can build a brand - it built YouTube through the Lazy Sunday video and Zillow.com through their real estate home pricing system. Linkbait can help brands become more popular, like SEOmoz, SearchEngineLand, Shoemoney, Drivl, ArsTechnica, ReadWriteWeb and many others. Linkbait can help sites and pages rank well at the search engines, by serving as a catalyst for inbound link popularity. Linkbait can even push you in front of the offline media, as has been the case for many folks in the tech world, specifically and folks like the red paperclip guy or the million dollar homepage guy. Linkbait has limitations, though - it's no good for: CTR-based ads Conversions Supportive, emotionally sensitive comments Positive re-inforcement (in most cases) Instant subscribers It's great for: Inbound links (if you have an effective piece) Search engine rankings (if you can achieve the aforementioned links) Publicity (people will start to know who you are and remember your brand after seeing your site several times through social media) Branding (growing awareness and a reputation) Getting the Attention of Influencers So to Kim - I'm sorry for your negative experience. It happens and will happen many more times. The most active population on Digg is a negative, condescending and disruptive group. The traffic is greedy, seeking immediate gratification and something that will connect with them. When you get Dugg, plan on being judged in the harshest, most negative light and then remember that the real value comes later. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Social Media Traffic Isn't Useless"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Social Media Traffic Isn't Useless"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}