{
  "url": "https://moz.com/blog/social-networking-sites-still-arent-effectively-being-leveraged",
  "slug": "social-networking-sites-still-arent-effectively-being-leveraged",
  "title": "Social Networking Sites Still Aren't Effectively Being Leveraged - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "...at least, not according to a study published by eMarketer. The article, titled \"Search Marketers Seed Social Networks,\" cites a survey conducted by iProspect and JupiterResearch. \n\nhttp://www.emarketer.com/Article.aspx?id=1004937...",
  "content": "Social Networking Sites Still Aren't Effectively Being Leveraged Social Media By: Rebecca Kelley May 22, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley May 22, 2007 Social Networking Sites Still Aren't Effectively Being Leveraged Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. ...at least, not according to a study published by eMarketer. The article, titled \"Search Marketers Seed Social Networks,\" cites a survey conducted by iProspect and JupiterResearch. It talks about how \"nearly half of search marketers placed content on social networking Web sites in February 2007.\" Nearly half = less than half, which surprises me somewhat. Maybe it's because we do a lot of social media marketing and promote link bait on social media sites, but I would have thought that more SEMs would be leveraging social media/networking sites to, as the article put it, \"drive traffic, create brand awareness, sell directly, and influence purchasing.\" Social media marketing sessions have been increasingly offered at SES shows, and the topic will be the subject of a session at Danny's upcoming SMX Advanced show. Every day at least one of the SEO RSS feeds in my reader talks about Digg and other social media/networking/bookmarking sites. Let's face it, social media marketing is becoming a new facet of SEO. I'm not saying that it will always be a part of SEO--I'm sure that in a while SEO will shift in the near future, just as it always has, and social media marketing won't be as heralded as it is now. I say it's best to strike while the iron's hot. As long as there are various web 2.0 and social media sites to leverage, why wouldn't you take advantage of this available means of marketing? We've built various social media profiles for some of our clients, and these profiles show up in search results for our client's name and for some long tail searches. Users performing such a search will see the various profiles and can become more aware of the client, which increases awareness of the client's brand. Additionally, there's the obvious benefit of building links on social media sites that can point to your client's domain. On the other hand, you could argue that if more search marketers start taking advantage of the marketing benefits social media sites can offer, the search results can get over-saturated with social media sites and users can become blind to them. Or, the search engines could start discounting links from social media sites if they see too many SEMs \"gaming\" the sites. Are you surprised that \"nearly\" half of the search marketers surveyed utilized social media sites in their Internet marketing campaigns? Do you think that number is too low? Too high? Just right? Are you wondering why more SEMs aren't more attuned to social media, or are you in the \"More for me!\" mentality? Lastly, what do you think the future holds for social media marketing? Is it only going to get better for us marketers, or should we enjoy it while we can? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Social Networking Sites Still Aren't Effectively Being Leveraged"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Social Networking Sites Still Aren't Effectively Being Leveraged"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}