{
  "url": "https://moz.com/blog/social-media-trends-influence-seo",
  "slug": "social-media-trends-influence-seo",
  "title": "How Social Media Trends Can Influence Your SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If taking advantage of social media trends in one way or another isn’t a part of your brand’s digital marketing strategy just yet, read on. This article will show why it’s important to jump on board, and provide you with a list of actionable steps to do so successfully.",
  "content": "How Social Media Trends Can Influence Your SEO Social Media | Marketing Industry By: Sandra Potisek March 24, 2022 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Sandra Potisek March 24, 2022 How Social Media Trends Can Influence Your SEO Social Media | Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Whether it’s participating in the latest challenge, using a trending TikTok sound, or putting your own spin on a viral recipe, we all know social media trends provide a great opportunity to spread brand awareness and grow your brand’s social media following. But they can also be utilized to boost search engine results, driving traffic and sales to your website. If taking advantage of social media trends in one way or another isn’t a part of your brand’s digital marketing strategy just yet, read on. This article will show why it’s important to jump on board and provide you with a list of actionable steps to ace the game. Examples of search results influenced by social media trends If we compile a list of social media trends from the last couple of years and search for their related terms on Google Trends, we can spot a recurring pattern — search results for related terms increasing at the time of their social media trends going viral. Let’s take a look at a few examples. Little Moons @melika_zaidi Omg look how many flavours! #littlemoons #LetsGetBackOnTrack #mochi #littlemoonsmochi #foodie #foodreview ♬ Butter - 방탄소년단 (BTS) Little Moons mochi ice cream has been around for over a decade, but it wasn’t until January 2021 that their popularity truly exploded. All thanks to an organic, mid-lockdown viral trend prompted by a couple of TikTok creators. It snowballed into thousands of Little Moons-themed TikTok videos of people searching for and trying their products, which ended up generating over 500 million views. Little Moons became the most sought-after ice cream in the UK, with their sales skyrocketing by 2,000%. At the height of the virality, product, brand, related unbranded, as well as retail searches on Google have increased drastically too, as seen below. The significant drop in searches after the initial spike indicates that the trend has eventually died out, which is a consequence of social media content – viral or not – having a short shelf life. Brands can keep the momentum going by tapping into influencer marketing themselves, starting new trends and reaching new audiences. Emily Mariko’s salmon rice @emilymariko Best lunch of the week! ♬ original sound - Emily Mariko Another great example is Emily Mariko, a food and lifestyle content creator, whose leftover salmon rice “recipe” blew up on TikTok back in October of 2021. She went from 70,000 to 7 million followers within a few weeks, while everyone else’s follow-up salmon rice videos gathered over 800 million views so far. The Google Trends report shows us people were searching for Emily Mariko’s salmon rice on Google as well, which gave plenty of other creators, brands, and media outlets an opportunity to capitalize on it, since she didn’t utilize those searches herself. With her newly amassed follower base, Emily Mariko continues to create viral trends and influence search results, as can be seen with a recent surge in “Emily Mariko toaster oven” searches below. This really goes to show that the power of influencer/REALfluencer marketing shouldn’t be underestimated. Tax the rich While the following case isn’t the most common way to go about it, there’s no denying that Alexandria Ocasio-Cortez posting her “tax the rich” Met Gala dress on Instagram is a very clever example of how a post on social media can not only sell, but help spread awareness about a cause. On September 14, 2021, when the post went live, searches for “tax the rich” jumped to new heights. Of course the media frenzy surrounding the event gave them an extra boost. How brands can take advantage of existing social media trends to drive traffic to their website Recreate trending content One way to interject your brand into culturally relevant moments is to recreate a trending piece of content on your brand’s social media account. By putting your own spin on it, you can get your product or message out there in a very authentic way. A great place to find trends is through TikTok’s discovery tab, where trending hashtags and audios will give you plenty of ideas for content. Do make sure to include a call to action at the end of your piece of reactive social media content, and paste an appropriate link in your profile’s bio to drive traffic off the platform straight to your website. Create supporting content off social media At this stage, most brands are doing the above, but what many brands and creators still aren’t doing is providing supporting content off of social media platforms. As we’ve seen, viral social media trends often transcend their original platform. Google Trends tells us people are searching for trending items on Google in conjunction with those trends taking off. It’s a missed opportunity to ignore the search boosts resulting from viral social media trends or organic influencers’ mentions. Despite your brand or product not being explicitly featured in the original viral post, there are many ways to put your keyword optimized website content in front of the eyes of this new audience. Let’s take Emily Mariko’s toaster oven searches to explore the opportunity. If you’re a brand or a retailer selling kitchen appliances, you can create a shoppable landing page featuring Emily Mariko’s most-loved kitchen appliances. Diving into her TikTok videos will show you she’s also a fan of rice cookers, aesthetic non-stick cookware, stove gap covers, blenders… All of these items are being searched for by Emily Mariko’s fans, so you can kill many birds with one stone. Another piece of content to support toaster oven searches could be “5 toaster oven recipes even Emily Mariko would approve of” — an evergreen article with a trending angle. The list of ideas is endless and a list of brands that can jump on board is too. You can even give digital PR a go and pitch a piece of trending content like the article above to journalists, essentially providing them with a story for a chance to gain quality backlinks and a potential influx of new customers. Speaking of publishers and bloggers, they, too, can benefit from creating reactive pieces of content — by increasing website views and putting affiliate links to good use. As viral social media trends can rarely be predicted and come in and out of style rather fast, it’s important to stay on top of the game, follow what’s going on in the social media space, and react quickly. How brands can utilize influencer marketing to increase searches and demand Collaborating with influencers to showcase your brand or product while participating in a trend is another great way to create awareness and increase searches for your product or brand. Not only do influencers have an advantage of an existing loyal audience. Many times, content creators will do a much better job at speaking the unpolished language of social media and your potential new customers, resulting in higher conversions. This is how Popsockets, a brand known for their phone grips, took advantage of an already existing “Emoji Outfit Challenge”, a challenge in which people filmed themselves matching their outfits to popular emojis. They activated eight of their ambassadors to participate in the challenge by incorporating their product, and reached two million viewers. If a popular influencer from your niche is already featuring a generic product you sell in a trending piece of content that could translate into follow-up content, or generally creates the type of content your product could be seamlessly incorporated in, don’t sleep on it. Reach out to them for a product placement and use the power of word-of-mouth marketing.You can find influencers in each and every niche or even look beyond your niche. With the right creative spin, even seemingly mismatched pairings can yield successful results these days, as long as there’s still an overlap in the target audience. Grace Wells, a content creator sharing videography tricks, is a great example. She may not be the first person to come to mind for a promotion of a skincare product or an energy drink, but in her case, such collaborations are very successful. Her viral “making epic commercials for random objects” series on TikTok landed her many brand deals and is now successfully helping brands go viral. @gracewellsphoto if you’d told me a year ago that I’d be throwing fruit around my house for a living... 😅🎥 #videographer #videomagic #celsiuspartner @CelsiusOfficial ♬ original sound - Grace Wells Tips on creating an effective influencer marketing campaign Launching a campaign on social media and trying to make it go viral yourself is where working with influencers across your niche comes especially handy. It helps your campaign gain that initial momentum it needs for it to start trending, generating views and eventually also additional reactive organic content, searches and clicks to your website. If influencer marketing isn’t something your brand has dabbled in already, here’s some tips on what to keep in mind when creating a campaign that converts before or after you’ve identified a social media trend you want to get involved in. Define campaign goals and target audience Before even coming up with a creative angle, always start by defining your campaign goals and target audience. One of the biggest mistakes new as well as established brands make is choosing influencers solely based on popularity or how many followers they have. Your target audience has to overlap and the collaboration has to come across authentic to truly resonate with the audience. Having your campaign goals clearly defined from the get-go will also help you identify the right influencers to work with and choose the right social media platform(s) for your campaign. Are you looking for brand exposure or do you want to boost sales for a particular product? Even within a single platform like Instagram, there are lots of nuances between what kind of content works on the feed verses on stories. If you wish a high volume of clicks to your site immediately, having an influencer promote your product on their Instagram feed might not be the best option. You’ll need a way for their audience to access a clickable link without having to take additional steps, so a feature on the influencer’s Instagram Story would be a better option. When you find the influencers who can help you achieve your goal, don’t forget to then share your campaign goals with them too, so they can optimize the content for your desired results. Avoid one-off collaborations Jumping on trends can mislead brands into chasing one-off features, but to allow the influencer’s audience to truly develop a relationship with your product, collaborations that stretch through a longer period of time and include regular, organic product incorporations are much more effective. Work with a range of influencers Since influencers often don’t share a fan base despite operating in the same niche, working with several different influencers rather than designing your entire campaign around only one is highly recommended. This will give you an opportunity to tap into different audiences and increase your campaign’s reach. And don’t forget about smaller-sized creators as well! Their engagement rates tend to be higher, a connection and trust they share with their audience deeper, plus they’re more affordable. Give influencers creative control over their content Let influencers promote your product in their own unique way, suitable for their personal brand and audience. Authenticity should always be at the forefront. Designing a campaign that will force them to follow a script is a no-go. Instead, create an open-ended brief. Give them rough guidelines on what you want to communicate with your campaign and let them come back to you with their own ideas. The collaboration has to come across organic, not sound like a blatant ad. Start a social media challenge Starting a challenge is one of the most popular and effective tactics of influencer marketing. Unlike with typical ambassador campaigns, the point of starting a trend is that anyone can jump in and create their own spin on it, stretching the reach of your campaign and building a sense of exclusivity and community within those participating. To promote their Cinco de Mayo deal, Chipotle started a #LidFlip TikTok challenge in 2020, asking participants to record themselves attempting to flip the lid onto the bowl without using their hands. It was a fun way to boost awareness of their deal and engage with their community. The videos using the hashtag ended up generating over 700 thousand views. If you're creating a hashtag to go along with the challenge, just make sure it hasn’t already been used and do a thorough research to avoid any negative connotations that may arise and end up portraying your brand in a negative way. Be prepared for the influx of searches and purchases It is important to have everything ready on your brand’s end before the collaboration goes live. From optimized landing pages (to catch the incoming direct and search traffic), to making sure you have enough product stock for a campaign of your size. Though adding a FOMO element can sometimes play to your advantage — as was the case with Little Moons. Support influencer marketing campaigns with paid advertising Running UGC ads on your brand’s accounts alongside an active influencer campaign, whether that’s on Facebook, Instagram or TikTok, will add further momentum and exposure to your brand. For more on how to work with influencers to support your SEO, watch Andy Crestodina's Whiteboard Friday: Conclusion Utilizing social media trends and influencer marketing to boost brand awareness, search results and sales is an extremely viable marketing hack brands of all sizes can take advantage of right now. TikTok has completely changed the game — in a good way. As of right now, it’s still a platform where not only paid, but organic content can reach millions, so it’s fairly easy even for new and small brands to join the game of co-creating viral trends and/or producing optimized supporting content to capitalize on searches. And with the rise of social commerce, it will become an even more important tactic. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Social Media Trends Can Influence Your SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Social Media Trends Can Influence Your SEO"
    },
    {
      "level": "H2",
      "text": "Examples of search results influenced by social media trends"
    },
    {
      "level": "H3",
      "text": "Little Moons"
    },
    {
      "level": "H3",
      "text": "Emily Mariko’s salmon rice"
    },
    {
      "level": "H3",
      "text": "Tax the rich"
    },
    {
      "level": "H2",
      "text": "How brands can take advantage of existing social media trends to drive traffic to their website"
    },
    {
      "level": "H3",
      "text": "Recreate trending content"
    },
    {
      "level": "H3",
      "text": "Create supporting content off social media"
    },
    {
      "level": "H2",
      "text": "How brands can utilize influencer marketing to increase searches and demand"
    },
    {
      "level": "H2",
      "text": "Tips on creating an effective influencer marketing campaign"
    },
    {
      "level": "H3",
      "text": "Define campaign goals and target audience"
    },
    {
      "level": "H3",
      "text": "Avoid one-off collaborations"
    },
    {
      "level": "H3",
      "text": "Work with a range of influencers"
    },
    {
      "level": "H3",
      "text": "Give influencers creative control over their content"
    },
    {
      "level": "H3",
      "text": "Start a social media challenge"
    },
    {
      "level": "H3",
      "text": "Be prepared for the influx of searches and purchases"
    },
    {
      "level": "H3",
      "text": "Support influencer marketing campaigns with paid advertising"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    }
  ],
  "author": "Sandra Potisek\n          \n            Sandra Potisek\n          \n            Sandra Potisek"
}