{
  "url": "https://moz.com/blog/social-media-poisoning-possibly-the-most-insiduous-negative-tactic-in-smm",
  "slug": "social-media-poisoning-possibly-the-most-insiduous-negative-tactic-in-smm",
  "title": "Social Media Poisoning - Possibly the Most Insidious Negative Tactic in SMM - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There's no word for this practice that I'm aware of, so I've coined one - Social Media Poisoning (SMP). The practice involves proactively generating spammy comments, posts, links, etc. from a competitor's domain in order to make bloggers, social media contributors, forum owners, etc. ...",
  "content": "Social Media Poisoning - Possibly the Most Insidious Negative Tactic in SMM Blogging By: Rand Fishkin July 11, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 11, 2007 Social Media Poisoning - Possibly the Most Insidious Negative Tactic in SMM Blogging The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. There's no word for this practice that I'm aware of, so I've coined one - Social Media Poisoning (SMP). The practice involves proactively generating spammy comments, posts, links, etc. from a competitor's domain in order to make bloggers, social media contributors, forum owners, journalists, etc. view that brand in a negative light. I just heard about my first case of it today - wherein a firm was seeking SMM (Social Media Marketing) antagonistically against a competitor. Obviously, I can't discuss the companies involved and the input I provided was to absolutely stay away from the tactic - in my opinion, conducting social media poisoning is putting your brand at greater risk than the brand you're attempting to harm. Here's some of the potential tactics that a black hat social marketer might engage in: Spamming the comments at major blogs like Techcrunch, GigaOm, MattCutts, etc. (BTW - I've heard that once you spam Techcrunch, Mr. Arrington will refuse to mention your site in the future) Authoring low quality posts at forums to make it seem as though the brand/website in question has hired forum spammers Emailing or even calling major bloggers, press outlets, etc. and trying to pitch a \"shill-like\" campaign that will receive obvious rejection (and leave a bad aftertaste) Sending lots of junky submissions to sites like Reddit, Digg, Netscape, etc. in order to \"poison\" the admins at those sites against a domain. This is most effective when combined with obvious manipulation (like 50 Digg accounts on the same IP address) Sending fake emails requesting paid links or link exchanges or even just begging for links in a very negative fashion to sites in the competitor's industry There are probably many more heart-wrenchingly spammy methods for conducting SMP, but these were the only ones that were mentioned to me (or that I inferred from the discussion). And, I'm not sharing these to encourage folks to go conduct SMP on their competitors - I'm doing it so owners of blogs, forums, social media sites, etc. can be aware that just because a domain appears to be spamming you doesn't mean they're behind the activity. With the public backlashes against sites that engage in negative practices in social media, it was only a matter of time before black hat players realized they could use the psychology of angry bloggers/site owners to hurt their competition. Has anyone been a part of a campaign like this (on the receiving end) or seen it conducted against another firm? I have some suspicions about a few of the blog-related emails that I've received in the last couple months (felt that \"Ah Ha!\" moment when it dawned on me that maybe those emails originated elsewhere), but no direct sources to point to. In any event, I highly encourage anyone in social media marketing to stay far, far away from this practice. Between the investigatory capacity of IP tracing, email routing & fraud detection and the social world of folks connected to each other across these platforms, exposure is a massive risk. If and when you are discovered, I can only imagine that the backlash will be 10X worse than what you've inflicted on your competitor. Besides which, don't you have productive content, link generation and participatory SMM you could be engaging in? Spend your time elsewhere. And to bloggers, site owners, and social media admins - watch out - that brand you think is spamming you might be completely innocent - make sure you do your research. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Social Media Poisoning - Possibly the Most Insidious Negative Tactic in SMM"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Social Media Poisoning - Possibly the Most Insidious Negative Tactic in SMM"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}