{
  "url": "https://moz.com/blog/some-tips-from-pubcon-on-how-to-get-your-site-optimized-for-the-mobile-web",
  "slug": "some-tips-from-pubcon-on-how-to-get-your-site-optimized-for-the-mobile-web",
  "title": "Some Tips from PubCon on How to Get Your Site Optimized for the Mobile Web - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Being a developer, I tend to be drawn to the sessions here at PubCon that have more of a product creation and development  feel.  The search marketing sessions are good too, and I attend them over the entry level developer sessions, but when I go to a session my takeaway is how what I've learned…",
  "content": "Some Tips from PubCon on How to Get Your Site Optimized for the Mobile Web SEO Events J By: Jeff Pollard December 5, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! J By: Jeff Pollard December 5, 2007 Some Tips from PubCon on How to Get Your Site Optimized for the Mobile Web SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Being a developer, I tend to be drawn to the sessions here at PubCon that have more of a product creation and development feel. The search marketing sessions are good too, and I often attend them over the entry-level developer sessions, but when I go to a session I try to take away products and ideas that make me a better developer. Fighting lack of sleep, I attended the Local and Mobile Search panel this morning at PubCon. It gave a good overview of what you should look for when moving your site to the mobile web, offering some good overview tips and tricks on site design, function and layout. 30 minutes in to the presentations, however, a man by the name of Eswar Priyadarshan demoed the technology behind their new product called GetMobile. In an entry on his blog, Eswar explains what GetMobile does. One of our key goals is to enable publishers to rapidly mobilize. To this end, we provide a capability that we refer to as “Juicing”: the dynamic, automatic extraction and mobile transcoding of existing wired Web content. What separates our Juicer from most other technologies out there with similar goals is (a) the extraction of Wired content can not only occur based on HTML markup and structure but also by where the content is located visually on the page and (b) we have the full ability to run Javascript/Ajax code on the page prior to extracting the content. What the Juicer does is make it possible for our client sites to essentially treat their wired Web site as a dynamic data source – we have found this to be very powerful since clients are not required to provide us with specialized content feeds or the like – their Web site is their virtual feed to the Juicer. It's pretty heavy, so I'll make it a little easier to understand. Basically, you feed your full blown website in to the GetMobile \"juicer,\" and it runs some complicated algorithms and processing, eventually generating a mobile friendly version of your site. Their processor is smart enough to recognize what portions of your site is the logo, navigation, & content, and very accurately pieces the parts together to automatically generate a mobile site. From there, you're allowed to customize your mobile site even more with colors, images & other branding elements to make the user experience match your full blown website. It was pretty amazing, and had Mel (who was sitting next to me) ooing and aahhing during the presentation. If it works as advertised, the software takes the very complicated process of developing a mobile site and makes it about as simple designing a webpage in Dreamweaver. As all the other presenters in the session mentioned, the mobile web is on its way to the mainstream. We're very close to a tipping point in the space, and all businesses - small and large - need to take advantage of it. Keep an eye out for GetMobile, as it makes the process of going mobile much, much easier. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Some Tips from PubCon on How to Get Your Site Optimized for the Mobile Web"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Some Tips from PubCon on How to Get Your Site Optimized for the Mobile Web"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jeff Pollard\n          \n            Jeff Pollard"
}