{
  "url": "https://moz.com/blog/some-basic-seo-tools-you-should-check-out",
  "slug": "some-basic-seo-tools-you-should-check-out",
  "title": "Some Basic SEO Tools for Firefox - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Today I want to show you three Firefox ad ons which I highly reccomend. These tools are quite different from the SEO MOZ pro tools which I would hihgly reccomend too (of course) SEO MOZ tolls are designed for more advanced SEO, these tools in my examples today are for a quick SEO overview.\nThe…",
  "content": "Some Basic SEO Tools for Firefox SEO Tools By: James Norquay September 22, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: James Norquay September 22, 2010 Some Basic SEO Tools for Firefox SEO Tools This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Today I want to show you three Firefox add-ons which I highly recommend. These tools are quite different from the SEOmoz Pro tools which I would also recommend (of course). SEOmoz tools are designed for more advanced SEO. The tools in my examples today are for a quick SEO overview. 1. SEO for FirefoxThe first example is the SEO for Firefox tool. This tool gives you a quick overview of the page you are viewing. It's good for seeing social media value for a specific website. This tool shows you crucial metrics for SEO from a diverse number of sources and is a good quick overview for a site SEO. Example of the tool in action - 2. SeoQuake for FirefoxThe second example I will show you today is the SeoQuake tool. this tool can either run all the time on Firefox or you can have it running in the background. Basically what this tool does is quickly pull specific metrics for a website such as if it has a functional XML sitemap, Robots.txt file in place, quick page source view and many other crucial SEO aspects which assist in doing a quick overview. Example of the tool in action - 3. Web Developer ToolThe third Firefox SEO tool is the Web Developer extension which is a great tool to show various SEO attributes such as ALT text on the website, outline frames, quick W3C analysis, disable specific coding elements and many more web dev aspects which assist SEO. Example of the tool in action - I would recommend you install all three tools as they add value when using Firefox and doing day to day SEO. I hope this helps, Regards, James. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Some Basic SEO Tools for Firefox"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Some Basic SEO Tools for Firefox"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "James Norquay\n          \n            James Norquay\n          \n            James Norquay"
}