{
  "url": "https://moz.com/blog/some-nifty-seo-bookmarklets-to-make-you-more-efficient",
  "slug": "some-nifty-seo-bookmarklets-to-make-you-more-efficient",
  "title": "Some Nifty SEO Bookmarklets To Make You More Efficient - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Being a chrome junkie and also a keen productivity evangelist I'm predictably a huge fan of javascript bookmarklets. I use them all day long and over time I've built up a few that I have made myself that I thought I'd share today. What is a javascript bookmarklet? A javascript bookmarklet is a…",
  "content": "Some Nifty SEO Bookmarklets To Make You More Efficient Technical SEO T By: Tom Critchlow August 14, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! T By: Tom Critchlow August 14, 2011 Some Nifty SEO Bookmarklets To Make You More Efficient Technical SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Being a chrome junkie and also a keen productivity evangelist I'm predictably a huge fan of javascript bookmarktels. I use them all day long and over time I've built up a few that I have made myself that I thought I'd share today. What is a javascript bookmarklet? A javascript bookmarklet is a small piece of javascript code that you can execute in your browser by bookmarking a link. I'm shamelessly going to steal Rand's image from his old post on bookmarklets: The Basics - Cached Pages & Site Searches What I'm covering in this blog post are all kinds of weird and wonderful bookmarklets but I want to re-post the basics here for you since these two bookmarklets I literally use 10s of times a day: Quickly run a Google site: search for the site you're on - Site Search Jump to the Google cache version of the URL you're on - Google Cache Rand actually wrote a post that covers a lot of the standard bookmarklets (including the two above) and if you're new to them I strongly suggest you check it out: 30 SEO bookmarklets to save you time Open Site Explorer Bookmarklets Of course you can use the moz toolbar to quickly grab stats and jump to your favorite tools but sometimes I prefer the speed and elegance of a bookmarklet instead so here's a bunch of them that work with the new open site explorer URLs: Open Site Explorer Links OSE for the homepage of the domain you're on OSE for the URL you're on Open Site Explorer Top Pages OSE top pages report for the domain you're on Open Site Explorer Anchor Text Anchor text phrases for the domain you're on Anchor text phrases for the URL you're on (By the way, while I'm mentioning OSE - you do know that CSV downloads are back right? Woop! Good job moz team!) Domain Insights These bookmarklets are designed to give you some insights about the domain you're browsing. Domain name search volume: Google insights search for the domain you're on (minus the TLD) Google Adplanner: Google adplanner stats for the domain you're on SEMrush SEMrush data for the domain you're on MajesticSEO: See the historic link graph for the domain you're on Social Data I've talked about my love of Topsy on here before and it will be no big surprise that I have a Topsy bookmarklet: See what's being tweeted for the domain you're on This gives you quick access to an OSE-style view of the most tweeted pages on a domain: I've also talked about sharedcount before and it's no surprise I have one for them too: Social share data for the URL you're on Google Analytics Debugging I spend an unhealthy amount of time in Google Analytics and often end up needing to debug how a site is using GA and what's going on with a particular issue. Both of these bookmarklets come in handy for this: Check the cookie of the site you're on: Check site cookie Check the referrer for the page you're on: Check page referrer Technical SEO Stuff Here's a few more technical SEO bookmarklets for some common functions that I find myself using over and over again: Check if the page you're on has a canonical tag and alert you to it: Check the URL canonical tag Check if the page you're on has a meta robots tag and alert you to it: Check the URL meta robots Thanks to Berian Reed I also discovered these awesome bookmarklets: SERPs Damn It This is an awesome bookmarklet that you run on a SERPs page and it will open a new tab with all of the rankings displayed in an easy to copy and paste manner which is perfect if you're looking to quickly gather some data to throw in excel or an email or whatever: Go check out the bookmarklet and explanatory video here. HTTP Header Checkers Webconfs has a nice header checker that has a bookmarklet associated with it. Here's the bookmarklet and here's the tool. If you'd prefer a bookmarklet that stays in the window - check out this bookmarklet from yoast which gives you something like this: Fun Social Stuff We're entering an age of connected data and I stumbled across the Google social graph API a little while back and instantly fell in love. Using this tool you can quickly and easily see what pages Google has crawled and associated with a particular page. This is best demonstrated visually - if I put my twitter URL into the tool Google tells me that I'm related to these pages: Check out the tool here. When you're doing twitter research and trying to find out who someone is or find out how you might be able to get in touch with someone it's often handy to quickly lookup a twitter handle here and see where else that person lives online so I built a bookmarklet that jumps straight to the google social graph page from a twitter page: Run this on a twitter profile page and find out what they're connected to (note I have this setup for https pages as I always use https pages on twitter, you might need to do some hacking if you have some other setup) Bonus Stuff A lot of people I know swear by Quix which is supposed to be like bookmarklets on steroids. Personally I've never quite gotten my head around it (despite all the keyboard shortcut goodness) but I feel like I'm likely in the minority - if you're a power user be sure to check it out! While creating and testing bookmarklets I found this JS prettifier extremely useful. Let's Hear It For The Community! I'd love to see what the community has built - what bookmarklets have you pimped your browser out with? Leave your best in the comments! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Some Nifty SEO Bookmarklets To Make You More Efficient"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Some Nifty SEO Bookmarklets To Make You More Efficient"
    },
    {
      "level": "H2",
      "text": "What is a javascript bookmarklet?"
    },
    {
      "level": "H2",
      "text": "The Basics - Cached Pages & Site Searches"
    },
    {
      "level": "H2",
      "text": "Open Site Explorer Bookmarklets"
    },
    {
      "level": "H2",
      "text": "Domain Insights"
    },
    {
      "level": "H2",
      "text": "Social Data"
    },
    {
      "level": "H2",
      "text": "Google Analytics Debugging"
    },
    {
      "level": "H2",
      "text": "Technical SEO Stuff"
    },
    {
      "level": "H2",
      "text": "Fun Social Stuff"
    },
    {
      "level": "H2",
      "text": "Bonus Stuff"
    },
    {
      "level": "H2",
      "text": "Let's Hear It For The Community!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Tom Critchlow\n          \n            Tom Critchlow\n          \n            Tom Critchlow"
}