{
  "url": "https://moz.com/blog/some-opinions-on-the-seo-myths-realities-fight",
  "slug": "some-opinions-on-the-seo-myths-realities-fight",
  "title": "Some Opinions on the SEO Myths & Realities Fight - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A few weeks back, Stephan Spencer authored a post for SearchEngineLand entitled 36 Myths that Won't Die But Need To. I certainly recommend checking out the post, but be warned of some highly contentious comments. The tweets and offline feedback were similarly up-in-arms and it's easy to understand…",
  "content": "Some Opinions on the SEO Myths & Realities Fight Public Relations By: Rand Fishkin May 11, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 11, 2010 Some Opinions on the SEO Myths & Realities Fight Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. A few weeks back, Stephan Spencer (one of my Art of SEO coauthors) authored a post for SearchEngineLand entitled 36 Myths that Won't Die But Need To. I certainly recommend checking out the post, but be warned of some highly contentious comments. The tweets and offline feedback were similarly up-in-arms and it's easy to understand why. SEO is a field where reputation is a huge part of your ability to perform well. Because the search engines don't publish comprehensive guidelines (or even guidelines that cover 1/10th of the material necessary for good SEO work), businesses rely on the savvy of individual consultants, contractors and employees. If your boss reads Stephan's article and sees him contradicting advice that you've been giving for years, faith erodes and with it, job security. Luckily (or perhaps unluckily), there's probably 5-10 articles you can find on the web that support your side of the story, many from quality, trusted sources. The lack of standards sucks. But, it's also the reason our industry is so exciting. New experiments & experiences can reveal critical data about search engine operations. The ability to become an expert is open to anyone with the skills and perseverance to see it through. But, no matter how hard you try, it's hard to overcome some of the persistent myths of the SEO field - I've been caught in plenty of them myself (and who knows, maybe still am today). This post is going to look at some of those nagging, lingering falsehoods that continue to thwart good SEO efforts, specifically those that Stephan called out and faced strong resistance. As always, this is my opinion, based on my experience (see the moz disclaimer) except in cases where research and data exists, in which case it's my opinion that the research cited is good enough to warrant that opinion :-) How Significantly Does Personalization Affect Rankings? Stephan Says: Although it is true that Google personalizes search results based on the user’s search history (and now you don’t even have to be logged in to Google for this personalization to take place), the differences between personalized results and non-personalized results are relatively minor. Check for yourself. Get in the habit of re-running your queries — the second time adding &pws=0 to the end of Google SERP URL — and observing how much (or how little) everything shifts around. Comments Include: I’m not sure I agree with your statement under #5 that personalization changes are “relatively minor”. I’ve been seeing some drastic rank changes due to personalization. I just posted about it at http://www.rypmarketing.com/blog/49-are-google-serp-personalizations-relatively-minor.whtml While there are still “absolute rankings” that display most of the time, your site can be ranked much higher or lower, based on personalization. My Opinion - They're both right. Personalization seems to primarily affect areas in which we devote tons of time, energy and repeated queries. This means for many/most \"discovery\" and early funnel searches, we're going to get very standardized search results. It's true that it can influence some searches significantly, but it's also true that, at least in my experience, 90%+ of queries I perform are unaffected (and that goes for what I hear/see from other SEOs, too). The linked-to post above actually helps to validate this, showing that while rankings changes can be dramatic, they only happen when there's substantive query volume from a user around a specific topic. Do We Need to Update Our Homepages Every Day to Maintain Rankings? Stephan Says: \"It’s important for your rankings that you update your home page frequently (e.g. daily.)\" This is another fallacy spread by the same aforementioned fellow panelist. Plenty of stale home pages rank just fine, thank you very much. Comments Include: It actually is important. Sure, a stale home page might rank, but Google definitely takes freshness into account in rankings. I’ve seen rankings boosts whenever I post new content. This varies from niche to niche, of course a site can rank well whilst remaining static, it may also have a considerable number of links pointing to it. In a competitive niche where the link volume/quality is pretty even, then regular updates to the home page, and other pages within the site can make all the difference – to describe this as a fallacy is a fallacy itself. My Opinion - There was a time when I was pretty convinced this was true. I did lots of testing around it for my clients sites and would put in time each day making sure new content appeared on their homepages. Today, I'm much less of a believer. Stephan is certainly correct that plenty (if not the overwhelming majority) of homepages and, indeed, web pages that rank well for many queries are static. I do think it's a great idea to continually have new content linked-to from homepages - by linking to the latest blog posts, YOUmoz posts and marketplace postings, the SEOmoz homepage helps drives spiders to revisit frequently and crawl these new posts (though RSS pings may make that obsolete). Overall, I wouldn't advise updating pages just for the sake of possibly getting a \"fresh content\" boost. QDF operates on unique, fresh, individual pages (or older pages that are earning newly fresh links). I'd have serious doubts as to whether anything in Google's ranking system rewards pages that simply change frequently - it doesn't pass my smell test. How is Google Treating \"Reciprocal\" Links? Stephan Says: Trading links helps boost PageRank and rankings. Particularly if done on a massive scale with totally irrelevant sites, right? Umm, no. Reciprocal links are of dubious value: they are easy for an algorithm to catch and to discount. Having your own version of the Yahoo directory on your site isn’t helping your users, nor is it helping your SEO. Comments Include: Google places less weight on reciprocal links that they used to, but they still count. I’ve done numerous link exchange campaigns for websites, and seen huge boosts in rankings. At the end of the day, would you rather have a reciprocal link from another site in your niche, or no link at all? The answer is obvious. Reciprocal links aren’t necessarily of dubious value. Consider this example: I’m a news site. I link to CNN because it’s CNN and they have news. One day, CNN links to me (huzzah). Technically, this is a reciprocal link, but no way in hell is Google going to discount the value of the link because the sites are linking to each other. So now you have to determine intent — and how do you do that? In many niches, every authority site links to every other. Not only is it natural, but these are the most relevant possible links. So what you seem to be saying is that Google lowers the value of a site’s most relevant links — thereby increasing the relative value of irrelevant or off-topic ones. That makes sense how? My Opinion - This one really depends on how we're defining \"reciprocal links.\" The post you're reading links to Stephan's SELand article. Would Stephan updating that post with a link here potentially hurt both our rankings? No. However, if SEOmoz built a link directory on our site (ironically humorous because, as long time readers may recall, we used to have one) and promoted linking to your site if you reciprocated with a link back here, I'd be more concerned. This is essentially link graph manipulation and while it's a fine line to tread, plenty of folks have crossed it in the past and, as Stephan notes, unnatural reciprocal link behavior is remarkably easy to spot on a link graph. I wouldn't be concerned at all with a technically \"reciprocated\" link, but I would watch out for schemes and directories that leverage this logic to earn their own links and promise value back to your site in exchange. Also - watch out for those who've evolved to build \"three-way\" or \"four-way\" reciprocal directories such that you link to them and they'll link to you from a separate site - it's still attempted manipulation and there's so many relevant directories out there; why bother!? Keyword Density is Not Used - How Many Times Do We Have to Say It? Stephan Says: Keyword density is da bomb. Ok, no one says “da bomb” anymore, but you get the drift. Monitoring keyword density values is pure folly. Comments Include: Folly? Hardly. If you’re trying to rank for a keyword, you want to make sure you use it a few times on a page. That’s just common sense. Of course, you don’t want to overuse a keyword, or it might come across as spammy. Any smart SEO pays attention to KW density. My Opinion - Again, we're likely coming down to semantics. The formula for keyword density - a percentage of the total number of words on the page that are the target phrase - is indeed folly. IR scientists discredited this methodology for relevance decades ago. Early search engines and information retrieval systems already leveraged TF*IDF as a far more accurate and valuable methodology. In my opinion, the reason the myth persists is that sometimes, optimizing towards a keyword density can actually improve your relevance and targeting of TF*IDF. I'll make an analogy - let's say you believe flight is accomplished not by lift, thrust, drag and weight, but rather by reaching a particular velocity in a bird-shaped device. It's entirely possible that you might stumble upon flight, or flight-like elements even without understanding the physics. That said, could you honestly call yourself an aeronautics engineer? If we're going to call ourselves professional SEOs, we should bother to learn the science. Yes, adding additional instances of a keyword term or phrase to a page might indeed help your rankings (usually not massively and almost never in highly competitive spaces), but that does not mean that the keyword density average you've been using is accurate or that engines leverage the metric. Spreading this ignorance of math and science does little to further the SEO field's reputation - let's end it. Do Hyphens in Domain Names Really Suck for SEO? Stephan Says: Hyphenated domain names are best for SEO. As in: san-diego-real-estate-for-fun-and-profit.com. Separate keywords with hyphens in the rest of the URL after the .com, but not in the domain itself. Comments Include: Hyphens in domain names are less than ideal for flagship businesses because they’re hard to communicate, but you better believe Google ranks domains with keywords in them highly, even if they contain hyphens. Again, it’s less than ideal (a hyphen-less .org or .net is preferable to a hyphenated .com), but if the top choices aren’t available, a domain that includes a hyphen can be a decent substitute. Don’t make a blanket statement that having hyphens in your domain hurts your potential. This is just fallacy. Yes, hyphens suck for direct traffic, as the domain is more likely to spelled incorrectly. But when it comes to search, domains with hyphens in them do just fine. My Opinion - They suck. Yes, I realize that technically, they may not have a formal algorithmic component (though I'm guessing part of Google's spam filter early warning system does look at hyphens, particularly when there's more than one in a domain name). But, they certainly correlate with worse branding value, which means fewer links and citations, less reputation in the eyes of visitors and potential business partners, less viral spread through word-of-mouth and, as the comments note, lower type-in traffic. All of those are going to have a 2nd-order impact on rankings through metrics like inbound links, social mentions and usage data (to whatever degree you believe that mya be a signal). Thus, hyphens in domain names do, indeed, suck for SEO (and lots of other stuff). I've never liked SEO practices that operated in a vaccum or didn't consider usability, virality, positioning, branding or other basic marketing techniques. Going back to the analogy above, it's like the aeronautics engineer who doesn't consider seats a necessity. Sure, it flies, but who exactly will pay for a ride? Does Click-Through Rate Matter? Stephan Says: The clickthrough rate on the SERPs matters. If this were true then those same third-world link builders would also be clicking away on search results all day long. Comments Include: Don’t assume that clickthrough rates don’t matter just because of some potential abuse that would happen if absolutely zero logic were built in. In regards to CTR influencing rankings, there are a number of things that lead me to suspect that user behavior does affect search results. I’m sure you are familiar with the so-called google \\honeymoon period\\ that seems to occur when a new site launches. The site will rank highly for a few weeks, and then see a dramatic drop in SERPs. I’ve launched over a dozen sites in the past year, and have noticed this pattern. I believe this goes beyond QDF, it’s a site-wide phenomenon. The hypothesis is that Google will temporarily rank a new site highly, to see how users perceive the site. If people visit the site, and then immediately hit the back button to return to the SERPs, that’s a good signal that the site did not meet the needs of the user, and that google should not rank it as highly. I am on the fence, I could literally flip a coin whether it is myth, magic, or the CTR really does make a difference. If it does it is such a small difference it’s nothing I would ever focus on for success. My Opinion - I've written and spoken about this extensively in the past and it doesn't need a great deal of re-hashing. I will, however, say that should any SEO ever discover that it substantively impacts rankings, we're going to be faced with an army of zombie botnets trying to take over our computers not to send email spam, but to click on links through our \"reputable\" Google accounts. Just look at the hacks of Facebook, Twitter & Wordpress over the past few weeks and ask yourself - if any spammer could show any financial incentive or ability of clicks to influence Google, would we really have as (organic) click-fraud free a world as we do today? We do have one data point from Google that suggests they look at some kinds of less manipulate-able click data. A Googler speaking at the first SMX East show in New York mentioned during his session that Google will record searches that are performed frequently with no clicks, followed by query refinement or abandonment, as potential searches that need work (because it seems no one likes the results). If this is what you mean when referring to click-data being used in the engines, I think that's completely reasonable. Do H1 Tags Help with Rankings? Stephan Says: H1 tags are a crucial element for SEO. Research by SEOmoz shows little correlation between the presence of H1 tags and rankings. Still, you should write good H1 headings, but do it primarily for usability and accessibility, not so much for SEO. Comments Include: H1 tags are very important, I’ve seen pages rank well for targeted keywords once the tag has been tweaked to be more targeted, not spammy or purely for SEO, but well written. Ok, in some cases it may not be “crucial” but after the title tag I think it’s up there as one of the most important on site factors. My Opinion - Covario's research is spot on; I got to listen to and speak with their chief scientist, Dr. Matthias Blume, at a conference in Silicon Valley. It also matches up to our correlation and rankings model data. You're invited to repeat on-page keyword prominence testing and check the results for yourself (more on search engine testing methodologies here). H1 tags are very slightly better than Bold/Strong tags for keyword usage and both are barely better than simply using the keyword on the page (in any text format). In every instance I've seen a report of H1s improving rankings, it's been because the keyword phrase was now included as some of the first text on the page and provided an additional instance of the target term and title element in the on-page copy. As Stephan recommends in the comments, try taking a site with H1s and replacing them with CSS styles that mimic the text formatting. You may see tiny fluctuations in a few close rankings, but likely little else. All that said, H1s are still a best practice. If you're building a site from scratch today, you should certainly use them for headlines, and they do provide some (albeit quite tiny) benefits for SEO. However, I feel incredibly guilty about the many times in my SEO consulting career I pushed hard for engineering and development teams to get H1s right in the markup when it generated such tiny results. That time would have been far better spent on dozens of other projects. If I can, I'd love to save you that same embarassment and disappointment. H1s may fit with SEO stereotypes, but that doesn't make them a high priority, high value activity. If you don't believe the research of others, do your own, then listen to the results. Can Linking to Other Sites Help You Perform Better? Stephan Says: Linking out (such as to Google.com) helps rankings. Not true. Unless perhaps you’re hoarding all your PageRank by not linking out at all — in which case, that just looks unnatural. It’s the other way around, i.e. getting links to your site — that’s what makes the difference. Comments Include: Not true. Matt Cutts has said that linking out to high quality websites is one of the many factors that they use to evaluate a site. NOTE: the comment references the below copied text below from this post by Matt Cutts (on Google's webspam team): Q: Okay, but doesn’t this encourage me to link out less? Should I turn off comments on my blog? A: I wouldn’t recommend closing comments in an attempt to “hoard” your PageRank. In the same way that Google trusts sites less when they link to spammy sites or bad neighborhoods, parts of our system encourage links to good sites. My Opinion - I suspect there may be some small, positive effects of linking out to relevant, quality sites and pages for SEO. However, Stephan's likely correct in his assertion that just linking to a \"high Domain Authority\" or \"high PageRank\" site won't normally help. He's also right to say that hoarding link juice is likely a very bad move. You can listen to the NYTimes' SEO, Marshall Simmonds, talk about how adding external links to articles on the site had a noticeable positive impact on the Times' rankings and traffic. I don't have correlation or ranking models data on this, nor have we experimented internally to the degree that I'd feel comfortable calling this a settled debate. My instincts say Google probably considers outbound links in some form or fashion, but I doubt it's a huge ranking factor. It might be more important than H1s, though :-) PageRank is a Good Predictor of Rankings? Stephan Says: Your PageRank score, as reported by Google’s toolbar server, is highly correlated to your Google rankings. If only this were true, our jobs as SEOs would be so much easier! It doesn’t take many searches with SEO for Firefox running to see that low-PageRank URLs outrank high-PR ones all the time. It would be naive to assume that the PageRank reported by the Toolbar Server is the same as what Google uses internally for their ranking algorithm. Comments Include: Come on now. It’s true that a lot of people place too much emphasis on PR, but let’s not take it to the opposite extreme and say it’s irrelevant. PR is not the be-all-end-all of rankings, but it still matters. Having a high PR homepage clearly means *something*. I probably couldn’t disagree with anything more than this one. I guarantee a website that has homepage PageRank 6 and then 2 page deep pages having PageRank 5 and trailing off into 4’s and 3’s get’s WAY more traffic than the one with PageRank 3 and trails off into 2’s and 1’s. PageRank is not 100% accurate, but it’s an extremely good indicator, it’s not just make believe or useless non-sense that authoritative sites have PageRank; 6, 7, 8, 9, 10. My Opinion - They're both right (though the \"guarantee of traffic on the PR6 vs. 5 site\" sounds like a bet this commenter's opponent could win many, many times over). Our data on PageRank correlation is very solid and suggests that yes, PR is positively correlated with rankings on Google.com (though much less so in Google.co.uk - sorry Brits!). However, the degree of correlation is not overwhelming and there are far better single metrics if rankings correlation is your goal. I would strongly get behind Stephan's statement that what the toolbar server reports is not what Google uses internally. They've messaged this many times. It's also very true that PageRank is only one of a plethora of ranking signals, and plenty of PageRank 3 pages outrank PageRank 6 or 7 pages for given queries. Does Great Content Equal Great Rankings? Stephan Says: Great Content = Great Rankings. Just like great policies equals successful politicians, right? Comments Include: I see no one is criticizing \"Great content = great rankings.\" This is job number one. My Opinion - I think the commenter may have missed Stephan's intended sarcasm. I am in full agreement that great content ≠ great rankings. This is no more true than the statement: \"the way to win elections is to propose the best legislative ideas.\" Marketing, promotion, networking, partnerships, virality, incentives and hundreds of others feed into the inputs for a site's success on the web. Unless you believe that links are meaningless and Google's content analysis systems can read and rank content like a human (e.g. Google thinks the Times' article on Brown's stepping down was more adroitly perceptive than the Post's), the ability to draw in links, which is not and likely never will be about the \"best content\" will have an overwhelming impact on rankings. The future likely holds greater usage of data from social media and social web interaction, but even this depends on far more than the content's quality. Those brands and sites that have early-adopting, viral-sharing, people-connecting, idea-distributing users invested in promoting their work are likely to be long term winners with little regard for comparative levels of content quality. There's lots more fun and interesting discussion on the SearchEngineLand post, but hopefully these will spark some interesting chats in the comments here as well. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Some Opinions on the SEO Myths & Realities Fight"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Some Opinions on the SEO Myths & Realities Fight"
    },
    {
      "level": "H2",
      "text": "How Significantly Does Personalization Affect Rankings?"
    },
    {
      "level": "H2",
      "text": "Do We Need to Update Our Homepages Every Day to Maintain Rankings?"
    },
    {
      "level": "H2",
      "text": "How is Google Treating \"Reciprocal\" Links?"
    },
    {
      "level": "H2",
      "text": "Keyword Density is Not Used - How Many Times Do We Have to Say It?"
    },
    {
      "level": "H2",
      "text": "Do Hyphens in Domain Names Really Suck for SEO?"
    },
    {
      "level": "H2",
      "text": "Does Click-Through Rate Matter?"
    },
    {
      "level": "H2",
      "text": "Do H1 Tags Help with Rankings?"
    },
    {
      "level": "H2",
      "text": "Can Linking to Other Sites Help You Perform Better?"
    },
    {
      "level": "H2",
      "text": "PageRank is a Good Predictor of Rankings?"
    },
    {
      "level": "H2",
      "text": "Does Great Content Equal Great Rankings?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}