{
  "url": "https://moz.com/blog/spamming-on-the-square",
  "slug": "spamming-on-the-square",
  "title": "Spamming on the Square - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A new phrase seems to be catching fire at SES San Jose this year - \"Spamming on the Square.\" First off, a bit of background is in order; the phrase \"kidding on the square,\" popularized recently by Al Franken, refers to when an individual who pokes fun or makes jokes has a hint of seriousness b...",
  "content": "Spamming on the Square Link Building By: Rand Fishkin August 9, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 9, 2006 Spamming on the Square Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. A new phrase seems to be catching fire at SES San Jose this year - \"Spamming on the Square.\" First off, a bit of background is in order; the phrase \"kidding on the square,\" popularized recently by Al Franken, refers to when an individual who pokes fun or makes jokes has a hint of seriousness behind them. For example, in the following exchange: Rand: Hey, Matt, how are you?Matt Cutts: Good, good - and you? How's scraping Google treating you?Rand: Oh... low blow, but fair enough, fair enough. Matt Cutts is \"kidding on the square\" with me - he's just giving me a hard time and laughing and smiling, but we both know that SEOmoz might occasionally scrape results from Google. Likewise, spamming on the square is when you leave a \"spammy\" link, but do it in a way that also provides enough value or creates a relationship. Here's some examples: Adding lots of good, relevant, useful content to Wikipedia, with the ultimate goal of getting your user profile page important enough to where links from it will help you get spidered and ranked. Posting in a blog's comments a relevant link, that just happens to be about your own site - knowing that with a bit of luck, the blogger might write about it. Creating a Squidoo lens or Ma.gnolia page - ostensibly to build on the concept of social media, but also because you know you can get a link out of it. In some ways, once the Pandora's Box of how links help rankings has been opened, it's almost impossible for any action an SEO takes on the marketing/promotion side to be considered anything but \"spamming on the square.\" BTW - Here are today's slides from today's presentation on Search Algorithms. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Spamming on the Square"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Spamming on the Square"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}