{
  "url": "https://moz.com/blog/speaker-submissions-mozcon-2012",
  "slug": "speaker-submissions-mozcon-2012",
  "title": "Want to speak at #MozCon 2012? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We're accepting community speaker submissions for MozCon 2012! Submit your brilliant idea by 5pm on Wednesday, June 27th. We're looking to hear from 4 different amazing people.",
  "content": "Want to speak at #MozCon 2012? SEO Events By: Erica McGillivray June 13, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Erica McGillivray June 13, 2012 Want to speak at #MozCon 2012? SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. We're doing something we've never done before, opening up community speaker submissions for MozCon! We're doing this because MozCon is for our community and because community pitches at our SearchChurch Meetup in Philly were phenomenal. If you haven't heard, MozCon -- our annual conference taking place July 25th-July 27th in Seattle -- is SOLD OUT. We have 700 amazing people geared up to attend, including Roger Mozbot, and a set of delightful speakers talking about a broad range of subjects from link building to content marketing and more. And now you can be one of those awesome speakers! We have four 10-minute spots. Because our speaker submissions rocked for the event we threw at SEER's SearchChurch, we wanted to hear from YOU again at MozCon. When we look at our MozCon schedule and realized there was some time we could shuffle around, nothing seemed better than to bring voices from our community right to the center stage. We're looking for 4 people to deliver incredible actionable tips and tricks in SEO, social media, content marketing, analytics, conversion rate optimization, and any other great inbound subject. The technical details: Your pitch must be submitted by Wednesday, June 27th at 5pm PDT. Please submit only 1 pitch. We're looking for the best of the best. Check out the current agenda when coming up with your unique for MozCon topic. Some topics that currently aren't well represented: local SEO, blogging, video, etc. If you've never spoke before or have spoken hundreds of times, we want to hear from you. Presentations will be 10 minutes long with an added ~5 minutes for questions. These sessions will be from 3:30-4:30pm on Friday, July 27th. Presentation PowerPoints will be due one week before MozCon. If you already have a MozCon ticket, we will refund your ticket; and if you don't have one, we'll comp you one! Unfortunately, you will have to book your own hotel, flight, and transportation. You will be invited to attend our speakers' dinner on Wednesday, July 25th. You must be at MozCon in person. Sorry, no Skype, Google Hangout, or other video conferencing. Our community speaker selections are final. Speaker submissions are closed. Thank you so much for tossing your hat in the ring. We'll let people know soon. Can't wait to see all mind-blowing topics you come up with! If you're looking for a MozCon ticket, make sure you're signed up for the waiting list. We're currently seeing if we can open up more seats (and believe it or not, people do cancel). Our wait list is first come, first serve. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Want to speak at #MozCon 2012?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Want to speak at #MozCon 2012?"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Erica McGillivray\n          \n            Erica McGillivray\n          \n            Erica McGillivray"
}