{
  "url": "https://moz.com/blog/sphinn-the-social-news-site-every-search-marketer-should-be-using",
  "slug": "sphinn-the-social-news-site-every-search-marketer-should-be-using",
  "title": "Sphinn - The Social News Site Every Search Marketer Should Be Using - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Late last week, Danny Sullivan launched Sphinn, the search engine industry's own social news & networking site, with remarkably little fanfare. However, despite the relatively covert launch, the site itself has some fairly exceptional functionality and a very fast learning curve. And, if that…",
  "content": "Sphinn - The Social News Site Every Search Marketer Should Be Using Mobile SEO By: Rand Fishkin July 16, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 16, 2007 Sphinn - The Social News Site Every Search Marketer Should Be Using Mobile SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Late last week, Danny Sullivan launched Sphinn, the search engine industry's own social news & networking site, with remarkably little fanfare. However, despite the relatively covert launch, the site itself has some fairly exceptional functionality and a very fast learning curve. And, if that wasn't enough, one of the top stories right now is on the laziness of linking to Wikipedia (which makes my heart happy): Sphinn isn't the kind of social site that's going to fizzle out and become unpopular in a few weeks (unlike John Battelle's sad stab at the subject). The dedicated community at Sphinn is already apparent with lots of submissions, registrations and networking. To make this easy, I'll list the top 10 reasons (yep, in list format) why you, as a professional in the search world, should be registered at and contributing to Sphinn on a daily basis: #10 - You Can \"Stalk\" Your Friends Stalking is a very cool feature at Sphinn that lets you monitor what others are submitting, \"Sphinning\" and blogging about. The impressively advanced profile system means that you can watch your SEO \"idols\" in all sorts of spooky, fun ways. #9 - Early Adopters Have a Chance to Stand Out Since Sphinn is new, active members have a chance to get noticed at the site. Participate heavily and everyone in the search world will soon know your name, or at least your handle. #8 - Content Currently Only Needs 10-20 Votes I'm not suggesting you should game the system - I suspect Danny and crew are watching that very closely. However, I would say that it's remarkably easy to get content in front of a lot of important eyeballs and that probably won't be the case for long. #7 - Referral Traffic is Already High SEOmoz received around 100 unique visits from Sphinn last week - remarkable considering the overlap between the audiences (and the fact that the story we made popular for wasn't particularly engaging). #6 - High Profile & Authority Bloggers Are Covering the Material From Philip Lensen to Matt Cutts to Gary Price and Aaron Wall, the community at Sphinn couldn't be more valuable or influential. I expect that SEOmoz will regularly discuss content on the site, as will many other high authority sites and blogs that will provide link love. #5 - Live Links Danny says that they may be going away (or move to a system that measures participation and trust like SEOmoz), but for now, it's open season on grabbing some juicy links. #4 - No Bury Brigade Since search marketers despise the anti-SEO bury brigades at sites like Digg, you can rest assured that content won't be buried simply for being self-promotional or \"created as linkbait\" so long as it's also valuable to the audience. #3 - Great Material Is Rising to the Top Looking through the 100 or so stories that have been made popular so far, the material is quite excellent. Matt McGee's Followed Links at Wikipedia, Vanessa Fox giving kudos to her old team at Google on the webmaster alerts and Todd Malicoat's post on Reputation Management are excellent examples. #2 - Submissions Are Judged on Merit There's no second-guessing intent or marketing background on Sphinn. We all know why we're participating - we love great marketing content and we love the ability to get it in front of other people's eyes (and earn their links). Content on Sphinn gets judged fairly, without biased, SEO-is-the-root-of-all-evil tinted glasses. #1 - It's Ours Search marketers have been clammoring for a popular alternative to Digg for many months. Now that it's here, we need to make the most of it, or we'll have only ourselves to blame. Just think of the possibility - if we all contribute and participate at Sphinn and help to spread the site's message, we can earn the attention of the tech media that's been going wild over Facebook and Digg and LinkedIn for the past year. That validation is going to make the trust of the search marketing field in general skyrocket amount the cogniscenti of Silicon Valley (and beyond) - a very, very good thing. And besides, we need to face the fact that getting on Digg just isn't as fun as it used to be. For those who aren't quite sure how the site works or what to do there, a few posts have already been authored on the subject. First, read this brief intro to Sphinn and Danny's latest tips on using the site. If you're still skeptical, I'd strongly urge you to have a look at the list of members. Although there aren't yet thousands of people, the names you do see are the \"linkerati\" of the search world. That's enough to put me convince me that getting a story popular on Sphinn is going to be incredibly valuable - even if you don't earn the links, you're going to be getting invaluable branding, akin to being mentioned on any of the high profile search industry sites. If you need more prodding, remember this, by clicking over to Sphinn from SEOmoz, you'll make up for the horrible things that Rebecca said about him last week. p.s. If you'd like to find my profile, you can do so here - randfish. And, if you'd like to \"Sphinn\" this story, you can do that here. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Sphinn - The Social News Site Every Search Marketer Should Be Using"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Sphinn - The Social News Site Every Search Marketer Should Be Using"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too"
    },
    {
      "level": "H3",
      "text": "Internal Linking for Mobile-First & Mobile-Only Indexing"
    },
    {
      "level": "H3",
      "text": "All About Fraggles (Fragment + Handle)"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}