{
  "url": "https://moz.com/blog/spot-zero-is-gone",
  "slug": "spot-zero-is-gone",
  "title": "Spot Zero is Gone — Here's What We Know After 30 Days - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A month out from Google eliminating position zero, what's changed? PJ Howland of 97th Floor investigates the data and shares key takeaways, from vastly different CTR to the impact of PAAs and beyond.",
  "content": "Spot Zero is Gone — Here's What We Know After 30 Days Search Engines | SEO Analytics | Advanced SEO By: PJ Howland February 24, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: PJ Howland February 24, 2020 Spot Zero is Gone — Here's What We Know After 30 Days Search Engines | SEO Analytics | Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As you are probably aware by now, recent updates have changed the world of search optimization. On January 22nd Google, in its infinite wisdom, decided that the URL that has earned the featured snippet in a SERP would not have the additional spot in that SERP. This also means that from now on the featured snippet will be the true spot-one position. If a web page listing is elevated into the featured snippet position, we no longer repeat the listing in the search results. This declutters the results & helps users locate relevant information more easily. Featured snippets count as one of the ten web page listings we show.— Danny Sullivan (@dannysullivan) January 22, 2020 Rather than rehash what’s been so eloquently discussed already, I’ll direct you to Dr. Pete’s post if you need a refresher on what this means for you and for Moz. 30 days is enough to call out trends, not all of the answers I’ve been in SEO long enough to know that when there’s a massive shake-up (like the removal of spot zero), bosses and clients want to know what that means for the business. In situations like this, SEOs responses are limited to 1) what they can see in their own accounts, and 2) what others are reporting online. A single 30-day period isn’t enough time to observe concrete trends and provide definitive suggestions for what every SEO should do. But it is enough time to give voice to the breakout trends that are worth observing as time goes on. The only way for SEOs to come out on top is by sharing the trends they are seeing with each other. Without each other’s data and theories, we’ll all be left to see only what’s right in front of us — which is often not the entire picture. So in an effort to further the discussion on the post-spot-zero world, we at 97th Floor set out to uncover the trends under our nose, by looking at nearly 3,000 before-and-after examples of featured snippets since January 22nd. The data and methodology I know we all want to just see the insights (which you’re welcome to skip to anyway), but it's worth spending a minute explaining the loose methodology that yielded the findings. The two major tools used here were Google Search Console and STAT. While there’s more traffic data in Google Analytics than GSC, we’re limited in seeing the traffic driven by actual keywords, being limited by page-wide traffic. For this reason, we used GSC to get the click-through rates of specific keywords on specific pages. This pairs nicely with STAT's data to give us a daily pinpoint of both Google Rank and Google Base Rank for the keywords at hand. While there are loads of keywords to look at, we found that small-volume keywords — anything under 5,000 global MSV (with some minor exceptions) — produced findings that didn’t have enough data behind them to claim statistical significance. So, all of the keywords analyzed had over 5,000 global monthly searches, as reported by STAT. It’s also important to note that all the difficulty scores come from Moz. Obviously we were only interested in SERPs that had an existing featured snippet serving to ensure we had an accurate before-and-after picture, which narrows down the number of keywords again. When all was said and done, the final batch of keywords analyzed was 2,773. We applied basic formulas to determine which keywords were telling clear stories. That led us to intimately analyze about 100 keywords by hand, sometimes multiple hours looking at a single keyword, or rather a single SERP over a 30-day period. The findings reported below come from these 100 qualitative keyword analyses. Oh, and this may go without saying, but I’m doing my best to protect 97th Floor’s client’s data, so I won’t be giving anything incriminating away as to which websites my screenshots are attached to. 97th Floor has access to hundreds of client GSC accounts and we track keywords in STAT for nearly every one of them. Put plainly, I’m dedicated to sharing the best data and insight, but not at the expense of our clients’ privacy. The findings... not what I expected Yes, I was among the list of SEOs that said for the first time ever SEOs might actually need to consider shooting for spot 2 instead of spot 1. Who saw @dannysullivan's tweet on spot zero no longer playing a part in SERPs?The biggest takeaway from this article is that for the first time since the launch of featured snippets 6 years ago SEOs may want to actually consider deoptimizing for featured snippets. https://t.co/5eqSZiQhvz— PJ Howland (@askPJHowland) January 23, 2020 I still don’t think I was wrong (as the data below shows), but after this data analysis I’ve come to find that it’s a more nuanced story than the quick and dirty results we all want from a study like this. The best way to unfold the mystery from the spot-zero demotion is to call out the individual findings from this study as individual lessons learned. So, in no particular order, here’s the findings. Longtime snippet winners are seeing CTR and traffic drops While the post-spot-zero world may seem exciting for SEOs that have been gunning for a high-volume snippet spot for years, the websites who have held powerful snippet positions indefinitely are seeing fewer clicks. The keyword below represents a page we built years ago for a client that has held the snippet almost exclusively since launch. The keyword has a global search volume of 74,000 and a difficulty of 58, not to mention an average CPC of $38.25. Suffice it to say that this is quite a lucrative keyword and position for our client. We parsed out the CTR of this single keyword directing to this single page on Google Search Console for two weeks prior to the January 22d announcement and two weeks following it. I’d love to go back farther than two weeks, but if we did, we would have crept into New Years traffic numbers, which would have muddled the data. As you can see, the impressions and average position remained nearly identical for these two periods. But CTR and subsequent clicks decreased dramatically in the two weeks immediately following the January 22nd spot-zero termination. If this trend continues for the rest of 2020, this single keyword snippet changeup will result in a drop of 9,880 clicks in 2020. Again, that’s just a single keyword, not all of the keywords this page represents. When you incorporate average CPC into this equation that amounts to $377,910 in lost clicks (if those were paid clicks). Sure, this is an exaggerated situation due to the volume of the keyword and inflated CPC, but the principle uncovered over and over in this research remains the same: Brands that have held the featured snippet position for long periods of time are seeing lower CTRs and traffic as a direct result of the spot-zero shakeup. When a double snippet is present, CTR on the first snippet tanks Nearly as elusive as the yeti or Bigfoot, the double snippet found in its natural habitat is rare. Sure this might be expected; when there are two results that are both featured snippets, the first one gets fewer clicks. But the raw numbers left us with our jaws on the floor. In every instance we encountered this phenomenon we discovered that spot one (the #1 featured snippet) loses more than 50% of its CTR when the second snippet is introduced. This 40,500 global MSV keyword was the sole featured snippet controller on Monday, and on Tuesday the SERP remained untouched (aside from the second snippet being introduced). This small change brought our client’s CTR to its knees from a respectable 9.2% to a crippling 2.9%. When you look at how this keyword performed the rest of the week, the trend continues to follow suit. Monday and Wednesday are single snippet days, while Tuesday, Thursday, and Friday brought the double snippet. Easy come, easy go (not a true Spot 1) There’s been a great deal of speculation on this fact, but now I can confirm that ranking for a featured snippet doesn’t come the same way as ranking for a true spot 1. In the case below, you can see a client of ours dancing around spots 5 and 6 before taking a snippet. Similarly when they lose the snippet, they fall back to the original position. Situations like this were all too common. Most of the time we see URLs losing the snippet to other URLs. Other times, Google removes the snippet entirely only to bring it back the following day. If you’re wondering what the CTR reporting on GSC was for the above screenshot, I’ve attached that below. But don’t geek out too quickly; the findings aren’t terribly insightful. Which is insightful in itself. This keyword has 22,200 global volume and a keyword difficulty of 44. The SERP gets significant traffic, so you would think that findings would be more obvious. If there’s something to take away from situations like this, here it is: Earning the snippet doesn’t inherently mean CTRs will improve beyond what you would be getting in a below-the-fold position. Seeing CTR bumps below the fold Much of the data addressed to this point either speaks of sites that either have featured snippets or lost them, but what about the sites that haven’t had a snippet before or after this shakeup? If that describes your situation, you can throw yourself a tiny celebration (emphasis on the tiny), because the data is suggesting that your URLs could be getting a slight CTR bump. The example below shows a 74,000 global MSV keyword with a difficulty that has hovered between spots 5 and 7 for the week preceding and the week following January 22nd. The screenshot from STAT shows that this keyword has clearly remained below the fold and fairly consistent. If anything, it ranked worse after January 22nd. The click-through rate improved the week following January 22nd from 3% to 3.7%. Perhaps not enough to warrant any celebration for those that are below the fold, as this small increase was typical across many mid-first-page positions. “People Also Ask” boxes are here to steal your snippet CTR Perhaps this information isn’t new when considering the fact that PAA boxes are just one more place that can lead users down a rabbit hole of information that isn’t about your URL. On virtually every single SERP (in fact, we didn’t find an instance where this wasn’t true), the presence of a PAA box drops the CTR of both the snippet and the standard results. The negative effects of the PAA box appearing in your SERP are mitigated when the PAA box doesn’t serve immediately below the featured snippet. It’s rare, but there are situations where the “People Also Ask” box serves lower in the SERP, like this example below. If your takeaway here is to create more pages that answer questions showing up in relevant PAA boxes, take a moment to digest the fact that we rarely saw instances of clicks when our clients showed up in PAA boxes. In this case, we have a client that ranks for two out of the first four answers in a high-volume SERP (22,000 global monthly searches), but didn’t see a single click — at least none to speak of from GSC: While its counterpart page, which served in spot 6 consistently, is at least getting some kind of click-through rate: If there’s a lesson to be learned here, it’s that ranking below the fold on page one is better than getting into the PAA box (in the terms of clicks anyway). So, what is the takeaway? As you can tell, the findings are a bit all over the place. However, the main takeaway that I keep coming back to is this: Clickability matters more than it ever has. As I was crunching this data, I was constantly reminded of a phrase our EVP of Operations, Paxton Gray, is famous for saying: “Know your SERPs.” This stands truer today than it did in 2014 when I first heard him say it. As I reflected on this pool of frustrating data, I was reminded of Jeff Bezo’s remarks in his 2017 Amazon Shareholder’s letter: “One thing I love about customers is that they are divinely discontent. Their expectations are never static — they go up. It’s human nature. We didn’t ascend from our hunter-gatherer days by being satisfied. People have a voracious appetite for a better way, and yesterday’s ‘wow’ quickly becomes today’s ‘ordinary’.” And then it hit me: Google wasn’t built for SEOs; it’s built for users. Google’s job is our job, giving the users the best content. At 97th Floor our credo is: we make the internet a better place. Sounds a little corny, but we stand by it. Every page we build, every ad we run, every interactive we build, and every PDF we publish for our clients needs to make the internet a better place. And while it’s challenging for us watching Google’s updates take clicks from our clients, we recognize that it’s for the user. This is just one more step in the elegant dance we perform with Google. I remember a day when spots 1, 2, and 3 were consistently getting CTRs in the double digits. And today, we celebrate if we can get spot 1 over 10% CTR. Heck, I‘ll even take an 8% for a featured snippet after running this research! SEO today is more than just putting your keyword in a title and pushing some links to a page. SERP features can have a more direct effect on your clicks than your own page optimizations. But that doesn’t mean SEO is out of our control — not by a long shot. SEOs will pull through, we always do, but we need to share our learnings with each other. Transparency makes the internet a better place after all. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Spot Zero is Gone — Here's What We Know After 30 Days"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Spot Zero is Gone — Here's What We Know After 30 Days"
    },
    {
      "level": "H2",
      "text": "30 days is enough to call out trends, not all of the answers"
    },
    {
      "level": "H2",
      "text": "The data and methodology"
    },
    {
      "level": "H2",
      "text": "The findings... not what I expected"
    },
    {
      "level": "H2",
      "text": "Longtime snippet winners are seeing CTR and traffic drops"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "When a double snippet is present, CTR on the first snippet tanks"
    },
    {
      "level": "H2",
      "text": "Easy come, easy go (not a true Spot 1)"
    },
    {
      "level": "H2",
      "text": "Seeing CTR bumps below the fold"
    },
    {
      "level": "H2",
      "text": "“People Also Ask” boxes are here to steal your snippet CTR"
    },
    {
      "level": "H2",
      "text": "So, what is the takeaway?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "PJ Howland\n          \n            PJ Howland\n          \n            PJ Howland"
}