{
  "url": "https://moz.com/blog/spread-the-education",
  "slug": "spread-the-education",
  "title": "Spread the Education - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "So you just spent the week at the latest conference.  You consumed large quantities of free alcohol, networked with lots of friendly SEO's, got a suitcase full of freebies, and heck, you even picked up some nice tips and tricks.  The conference has put a fire inside you, you can&...",
  "content": "Spread the Education SEO Events By: Simon Heseltine April 19, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Simon Heseltine April 19, 2007 Spread the Education SEO Events This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. So, you just spent the week at the latest conference. You consumed large quantities of free alcohol, networked with lots of friendly SEOs, got a suitcase full of freebies, and heck, you even picked up some nice tips and tricks. The conference has put a fire inside you, you can't wait to get back and take your site to the next level with all of this new knowledge. Great! Now you get back, and your co-workers ask you about the conference, then you've got to catch up on the emails, and the missed meetings while you were out... Now it's a few days later, you start to write up ways to implement your new ideas, you try to get them on the development schedule, and as they get pushed down the list, you start to lose that fire....A couple of weeks later, all that you have left of that fire is a warm glow whenever you pick up the SEOmoz koosh that Rebecca only gave out to the really nice people.... What could you do differently? The easiest solution is for you to take that fire and spread it around. At conferences such as SES, you have most of the slides that were presented available for you to download. Take the pieces of each presentation that really reached out to you and your situation, and make your own internal presentation. Show how the topic will help your business, use the case studies, use the examples. Present to your team, present to your peers, present to the executive team, present to the board. Get everyone fired up. Not only will it help you get your ideas implemented, it'll help keep your energy level high, and it'll help everyone realise that the conference was worth the money paid (and you'll still have the koosh). If you'd like, you can also take a look at my entry in the Marketingpilgrim.com contest on Improving your PPC conversion rate. Feel free to give it a comment or heck, if you'd like you can even Digg it. - Simon Heseltine Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Spread the Education"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Spread the Education"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Simon Heseltine\n          \n            Simon Heseltine"
}