{
  "url": "https://moz.com/blog/st-patricks-day-100-customized-commercialized",
  "slug": "st-patricks-day-100-customized-commercialized",
  "title": "St. Patrick's Day - 100% Customized & Commercialized - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "And now for something completely different. Via Slate - Ireland's \"Crack\" Habit:\n\nIn the last 15 years, Dublin-based IPCo and its competitors have fabricated and installed more than 1,800 watering holes in more than 50 countries. Guinness threw its weight (and that...",
  "content": "St. Patrick's Day - 100% Customized & Commercialized Moz News By: Rand Fishkin March 17, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 17, 2006 St. Patrick's Day - 100% Customized & Commercialized Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. And now for something completely different. Via Slate - Ireland's \"Crack\" Habit: In the last 15 years, Dublin-based IPCo and its competitors have fabricated and installed more than 1,800 watering holes in more than 50 countries. Guinness threw its weight (and that of its global parent Diageo) behind the movement, and an industry was built around the reproduction of \"Irishness\" on every continent—and even in Ireland itself... ...A few decades back, St. Patrick's Day was a relatively quiet day in Ireland. It was a religious holiday; pubs were closed, and no one dyed anything green. A typical Dubliner might attend Mass, eat a big meal with the family, and nod off early... ...Where there is celebrated excess, there is a market to exploit. In 1995, the Irish government saw potential in international \"Irish\" revelry. They reinvented the holiday at home to kick-start the tourist season. Now thousands of partiers head to Ireland for the \"St. Patrick's Day Season\" as Guinness has called this time of year. (It used to be called \"March\" or, for Irish Catholics, \"Lent.\") In Dublin, the festival lasts for five days and adds about 60 million euros* to the economy. Don't let that stop you from drinking tonight; but, I always think it's better to know when you're being put on. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "St. Patrick's Day - 100% Customized & Commercialized"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "St. Patrick's Day - 100% Customized & Commercialized"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}