{
  "url": "https://moz.com/blog/startup-marketing-how-to-earn-customers-without-paying-for-them",
  "slug": "startup-marketing-how-to-earn-customers-without-paying-for-them",
  "title": "Startup Marketing: How to Earn Customers Without Paying for Them - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Last week, on the very kind invitation of Dmitri Grabov, I gave a presentation in London to the Hacker News monthly meetup group. The event was sponsored and hosted by some friends at Forward, and attended by startup folks from all around the greater London area. Like my presentation in Silicon…",
  "content": "Startup Marketing: How to Earn Customers Without Paying for Them Conversion Rate Optimization (CRO) By: Rand Fishkin April 4, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 4, 2012 Startup Marketing: How to Earn Customers Without Paying for Them Conversion Rate Optimization (CRO) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Last week, on the very kind invitation of Dmitri Grabov, I gave a presentation in London to the Hacker News monthly meetup group. The event was sponsored and hosted by some friends at Forward, and attended by startup folks from all around the greater London area. Like my presentation in Silicon Valley, the focus was on marketing for startups. Dmitri & Forward worked together to get the event filmed and posted the video online and thus, I felt it would be great to share here. A couple caveats before watching: There's not a lot of advanced, tactically focused content. This talk is geared to startup marketers and founders and probably better for mid-level managers and consulting clients than for \"in-the-trenches\" SEOs and marketers (who already know all this stuff). If you've already seen my presentation from the Silicon Valley HN meetup, this has quite a bit of overlap (go to ~30minutes in to see the unique material). I'm sharing this version, despite the crossover with some previous work (something I usually don't do) because I think this may be the best iteration of this particular subject I've done to date, and one of the more efficient (the formal presentation is just under 45 minutes). Warning - I do use a bit of bad language. Sorry about that! Sometimes I get excited on stage. :-) My goal is to help more folks in the startup world become familiar with the practices of inbound marketing - content, SEO, social media, blogs, etc. These are powerful channels, but they often don't get the respect they deserve in these spheres (which both frustrates and surprises me). Rand Fishkin - Inbound Marketing for Startups: How to Earn Customers Without Paying from HN London on Vimeo. Hopefully, if you find the video enjoyable and useful, you can spread it to those who need a push to invest in or believe in the great practices inbound marketers undertake. p.s. I've been on the road for the last two weeks, speaking at events in Madrid, Munich, London, Boston and now San Francisco, but return to Seattle Friday and will hopefully be better about consistent posting and whiteboard Friday appearances thereafter. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Startup Marketing: How to Earn Customers Without Paying for Them"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Startup Marketing: How to Earn Customers Without Paying for Them"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Ensure Your Organic Traffic Actually Drives Revenue — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How Our Website Conversion Strategy Increased Business Inquiries by 37%"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}