{
  "url": "https://moz.com/blog/starting-over-part-3-optimize",
  "slug": "starting-over-part-3-optimize",
  "title": "Starting Over, Part 3 - Optimize - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Once your site is launched and indexed, it's time to sand off the rough SEO edges. Part 3 in the \"Starting Over\" covers how to do a quick, early SEO audit.",
  "content": "Starting Over, Part 3 - Optimize SEO Basics By: Dr. Peter J. Meyers May 14, 2014 Table of Contents Copied! By: Dr. Peter J. Meyers May 14, 2014 Starting Over, Part 3 - Optimize SEO Basics This post is a part of the \"Starting Over\" series, the story of starting a blog (MinimalTalent.com) from scratch. See the end of the post for links to the rest of the series. In parts one and two, I showed how I got my blog off the ground, indexed by Google, and just starting to rank. Now, it's time to dive in and sand off any rough edges, before they cause future SEO injuries.(1) Spot-check the SERPs Marketing automation tools are great, but sometimes we get so enamored with those tools that we forget they only offer a window into the big picture. Early in a site's life, I'm a big believer in actually typing in searches and seeing how your results look in the wild. The first time I started ranking for the phrase \"minimal talent,\" it looked something like this: On the bright side, the site was getting picked up on Google+ (thanks, Jeremy!). Unfortunately, Google was creating a snippet from my first blog post. Why? Well, I hadn't actually specified a Meta description. Sometimes, even the professionals forget the basics. Once I fixed the problem, I kept watching and eventually saw this: There's a wealth of information in this one image. I learned that Google was using my Meta description, but that it might be a bit long (note the odd jump to mid-sentence). I learned that Google was picking my authorship attribution and displaying my profile picture. I learned that my title wasn't getting cut off. I learned all of this by just opening my eyes and looking.(2) Google Webmaster Tools Ok, now that we've at least made a few sanity checks with our own eyes, let's see what the tools have to say. First, is Google indexing the site the way we'd like them to? Since I set up an XML sitemap, I can just go to \"Crawl > Sitemaps\", and see something like this: I've submitted 8 pages, and all 8 were indexed – so far, so good. Of course, the \"indexed\" count on this page only tells you which of the URLs in your sitemaps have been indexed. To get a glimpse at Google's full index stats for your site, go to \"Google Index > Index Status\": The total count is right in the ballpark of my sitemap count, which, at least in my case, is good. Of course, Google didn't index any pages before the site existed, so the graph really isn't that useful. Over time, though, it can show you any unusual trends. Keep in mind that, for large sites, you can't expect every single page to be indexed, and that's often not even desirable. The more you break up your sitemaps, the more you'll be able to spot problems. If you see your total index count really take off, or you know it's just way too large (your site has 500 pages, and Google has indexed 25,000), then this could be a sign of runaway URL parameters and duplicate content. Finally, let's make sure I don't have any obvious crawl errors. Go to \"Crawl > Crawl Errors\" and you should see an overview like this: I've got two \"Not found\" (404) errors, which really isn't bad at all. I'm a bit concerned that my initial WordPress \"Hello World\" post is popping up, so let's click on that: The \"Error details\" aren't particularly useful here, so I'll go straight to \"Linked from\" and can see that the bad URL was on the page itself (a non-issue) and the home-page. Looking at the home-page source code, this link is now gone. So, Google just crawled the site a bit too early, and this problem should take care of itself. (3) Moz Analytics While Google Webmaster Tools has a lot of useful information, there can be pitfalls to getting the story from just one point-of-view (especially when it's Google's). Let's look for any crawl issues in Moz Analytics, starting with \"Search > Crawl Diagnostics\". Toward the bottom of the page, I get this summary: Problems are sorted (left-to-right) from high priority to low priority, but my job this time around is pretty easy. I have 38 occurrences of one error, \"Missing Meta Description Tag.\" This is problematic not just because of the error, but because I really don't expect to have 38 pages of the site crawled. So. Let's drill down and look at a few sample pages… A quick spot-check of the site reveals that these pages do not, in fact, have custom Meta descriptions. While this isn't mission critical just yet, I should add them soon for my main pages. As for the 38 crawled pages, it looks as if Moz Analytics is crawling my comment/reply pages. Looking at the source code, these pages have two Meta Robots directives and a rel=canonical tag in place, which is probably giving the crawlers some grief. It's probably not a big issue, but let's make sure that Google isn't indexing these pages, by using the \"site:\" operator with \"inurl:\" on the comment/reply URL parameter. Entering the following into Google… site:minimaltalent.com inurl:replytocom …results in no documents found. So, at this point, it looks like Moz is being a little overprotective. It may be worth removing either the canonical or Meta Robots down the line, to make sure I'm sending Google clear signals. Now, let's look at what really matters – have my rankings improved? Or, at the very least, are they stable? It's looking good. I took the top spot for my brand name (\"minimal talent\"), kept the #1 spot for my tagline, and have even moved into the top 10 for \"minimalism 101\". I don't expect to be ranking for \"minimalism\" or \"yahoo logo\" any time soon – these are stretch goals at best. What's important is to see gradual progress, even if that progress isn't always as fast as you'd like.(4) Google Analytics Are these rankings helps my traffic? Honestly, only a tiny bit. Here's the graph of sessions for the first couple of months: It's not a bad graph, as graphs go, but the spikes correspond with blog posts and almost entirely with traffic from social media (at this point, primarily Twitter). The small increase in traffic between posts toward the right side of the graph is a good sign, and some of that is coming from Google. I think this graph really illustrates the dilemma of modern SEO. You aren't going to get search exposure without first building traffic and interest somehow. For me, social is one obvious tool, but for the first few months of a project that means a sustained effort on an established network. For someone with no network at all, the build-up is going to take even longer.Recapping Parts 1-3 I hope this short series has at least given you some insight into getting started and how the pieces can all come together. I hope it's also not entirely bad news – ranking in 2014 isn't easy, but it can be done, and getting the basics right does still matter quite a bit. We're going to put this series on hold until something interesting happens to Minimal Talent that's worth talking about. If anyone has specific questions about getting started or about the site's successes or failures so far, please chime in. Read the full series Use the links below to explore the entire \"Starting Over\" series: Part 1 – Pre-launch Part 2 – Launch Part 3 – Optimize Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Starting Over, Part 3 - Optimize"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Starting Over, Part 3 - Optimize"
    },
    {
      "level": "H2",
      "text": "(1) Spot-check the SERPs"
    },
    {
      "level": "H2",
      "text": "(2) Google Webmaster Tools"
    },
    {
      "level": "H2",
      "text": "(3) Moz Analytics"
    },
    {
      "level": "H2",
      "text": "(4) Google Analytics"
    },
    {
      "level": "H2",
      "text": "Recapping Parts 1-3"
    },
    {
      "level": "H2",
      "text": "Read the full series"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}