{
  "url": "https://moz.com/blog/stat-google-data-studio-connectors",
  "slug": "stat-google-data-studio-connectors",
  "title": "6 Connectors to Spice Up Your Reporting: Introducing Google Data Studio Connectors for STAT - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Thanks to the helpful feedback of STAT customers, we’ve been hard at work building six Google Data Studio Community Connectors to help pull STAT data into Data Studio. Fortified by beta testing and your thoughtful input, we're excited to launch the six connectors today!",
  "content": "6 Connectors to Spice Up Your Reporting: Introducing Google Data Studio Connectors for STAT Moz Tools | Moz News By: Brian Ho July 29, 2020 Table of Contents Copied! By: Brian Ho July 29, 2020 6 Connectors to Spice Up Your Reporting: Introducing Google Data Studio Connectors for STAT Moz Tools | Moz News Data visualization platforms have become a vital tool to help illustrate the success of a body of work. Painting a clear picture of your SEO efforts is as important as ever, whether you’re reporting out to clients or to internal stakeholders at your own company. More and more SEOs are turning to data visualization tools to do so — pulling in data from across multiple SEO tools, blending that data in unique ways, and helping to pull back the curtain on the mystery of SEO. Platforms like Tableau and Google Data Studio are becoming more commonplace in the SEO community as we seek better ways to communicate with our teams. We’ve heard from a number of folks in the Moz community that having a central dashboard to present data has streamlined their own reporting processes. It’s also made information more digestible for colleagues and clients, as they can see everything they need in one place. Thanks to the helpful feedback of many, many STAT customers, we’ve been hard at work building six Google Data Studio Community Connectors to help pull STAT data into Data Studio. Fortified by beta testing and your thoughtful input, we're excited to launch the six connectors today: Historical Keyword Rankings (site and tag level), Share of Voice (site and tag level), and Ranking Distributions (site and tag level). If you’re already using STAT, dive into our documentation in the Knowledge Base to get all the nitty-gritty details on the connectors. If you’re not yet a STAT customer, why not chat with a friendly Mozzer to learn more? See STAT in Action Want to hear a bit more about the connectors and how to implement them? Let’s go! Historical Keyword Rankings Tracking daily keyword positions over time is a central part of STAT and the long-term success of your site. The Historical Keyword Rankings connectors send historical highest rank data to Data Studio for every keyword you’re currently tracking in a site or a tag. You can start out with a simple table: perhaps if you have a group of keywords in a dynamic tag, you might want to create a table of your top keywords ranking on page one, or your top keywords ranking in positions 1-3. Turn that table into a line graph to understand average rank for the whole site or tag and spot trends: Find the Site Level Historical Keyword Rankings connector here and the Tag Level Historical Keyword Rankings connector here. Share of Voice In STAT, share of voice measures the visibility of a group of keywords on Google. This keyword set can be keywords that are grouped together into a tag, a data view, or a site. Share of voice is calculated by assigning each ranking a click-through rate (CTR) and then multiplying that by the keyword’s search volume. It’s important to remember that share of voice is based on the concept that higher ranks and higher search volume give you more share of voice. The default chart type will display a doughnut chart for current share of voice, and a line graph will show share of voice over time: Find the Site Level Share of Voice connector here and the Tag Level Share of Voice connector here. Ranking Distribution Ranking Distribution, available in the Daily Snapshot and Ranking Trends views in the STAT app, shows how your keyword rankings are distributed across the top 119 Google results. View your top ranking positions as a bar chart to easily eyeball how your rankings are distributed, where shifts are taking place, and where there is clear opportunity for improvement. Find the Site Level Ranking Distributions connector here and the Tag Level Ranking Distributions connector here. Getting started with the connectors Whether you’re a Google Data Studio pro or a bit newer to the tool, setting up the connectors shouldn’t be too arduous. Get started by visiting the page for the connector of your choice. Authorize the connector by clicking the Authorize button. (Tip: Each connector must be authorized separately.) Once you authorize the connector, you’ll see a parameters table like this one: Complete the fields using the proper information tied to your STAT account: STAT Subdomain: Fill in this field with the subdomain of your STAT login URL. This field ensures that the GDS connector directs its request to the correct STAT subdomain.STAT API Key: Find your API key in STAT by visiting Options > Account Management > Account Settings > API Key.STAT Site/Tag ID: Retrieve IDs through the API. Visit our documentation to ensure you use the proper API calls.Allow “STAT Site/Tag ID” to be modified in reports: Tick this box to be able to edit the site or tag ID from within the report, without reconfiguring the connector.Include Keyword Tags: Tick this box to add a column to your report populated with the tags the keyword is a member of (only applicable to site and tag historical keyword rankings connectors).Allow “Include Keyword Tags?” to be modified in reports: Tick this box to be able to turn the inclusion of the Keyword Tags column on or off from within the report, without reconfiguring the connector (only applicable to site and tag historical keyword rankings connectors). Once you’ve filled in the table, click Connect in the top right. Confirm which columns you’d like to include in the report. Review the columns, and click Create Report. Once you’ve created a report, the exciting part begins! Whether you’re pulling in your STAT data for a fresh report, adding it into a report with other pieces of data, or using Data Studio’s data blending feature to create compelling views of your search presence — there are so many ways to slice and dice. Ready to put the connectors into production? We can’t wait to hear how your Google Data Studio reports are strengthened by adding in your STAT data. Let us know how it goes in the comments. Not yet a STAT user but curious how it might fit into your SEO toolkit? Take a tour of the product from your friendly neighborhood Mozzer: Learn More About STAT To help us serve you better, please consider taking the 2020 Moz Blog Reader Survey, which asks about who you are, what challenges you face, and what you'd like to see more of on the Moz Blog. Take the Survey Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "6 Connectors to Spice Up Your Reporting: Introducing Google Data Studio Connectors for STAT"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "6 Connectors to Spice Up Your Reporting: Introducing Google Data Studio Connectors for STAT"
    },
    {
      "level": "H2",
      "text": "Historical Keyword Rankings"
    },
    {
      "level": "H2",
      "text": "Share of Voice"
    },
    {
      "level": "H2",
      "text": "Ranking Distribution"
    },
    {
      "level": "H2",
      "text": "Getting started with the connectors"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "Moz AI: Introducing Augmented Intelligence"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Brian Ho\n          \n            Brian Ho"
}