{
  "url": "https://moz.com/blog/statement-of-land-acknowledgement",
  "slug": "statement-of-land-acknowledgement",
  "title": "A Statement of Land Acknowledgement, Published Today With Gratitude - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We are deeply grateful to the many members of the Tribes, Nations, and Bands on whose homelands our teams live and work, and who generously gave their time over the past year to consult with us on our new Statement of Land Acknowledgement.",
  "content": "A Statement of Land Acknowledgement, Published Today With Gratitude Moz News By: Miriam Ellis September 23, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis September 23, 2021 A Statement of Land Acknowledgement, Published Today With Gratitude Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. From today, if you visit the Contact page of Moz.com to look up our office locations, you will see that we have included the following Statement of Land Acknowledgement with the permission of the Tribes, Nations, and Bands in whose homelands our teams live and work: We at Moz acknowledge that our offices in Seattle and Vancouver exist in the traditional, ancestral, current, and unceded lands of Tribes, Nations, and Bands including the dxʷdəwʔabš (Duwamish), suq̀wabš/dxʷəq̓ʷabš (Suquamish), bəqəlšuł (Muckleshoot), sdukʷalbixʷ (Snoqualmie), dxʷlilap (Tulalip), Sḵwx̱wú7mesh (Squamish), Səl̓ílwətaʔ/Selilwitulh (Tsleil-Waututh), xʷməθkʷəy̓əm (Musqueam), and Stz’uminus Peoples. We respect their sovereignty, their right to self-determination, and their sacred connection to the land and water. We offer our thanks to the Peoples, the land, and the water. We are deeply grateful to the many members of the Tribes, Nations, and Bands for the time they generously gave over the past year in consulting with us on the accuracy of this statement and in granting permission to publish it. Thank you. What is a Statement of Land Acknowledgement? A Statement of Land Acknowledgement is an oral or written act of honoring the Indigenous Peoples in whose homelands something is taking place. In the words of the Duwamish Tribe: “It is important to note that this kind of acknowledgement is not a new practice developed by colonial institutions. Land acknowledgement is a traditional custom dating back centuries for many Native communities and nations. For non-Indigenous communities, land acknowledgement is a powerful way of showing respect and honoring the Indigenous Peoples of the land on which we work and live. Acknowledgement is a simple way of resisting the erasure of Indigenous histories and working towards honoring and inviting the truth.” Why is Moz publishing this statement? “There have always been Indigenous peoples in the spaces we call home, and there always will be. The acknowledgement process is about asking, What does it mean to live in a post-colonial world? What did it take for us to get here? And how can we be accountable to our part in history?” Kanyon Sayers-Roods (Mutsun Ohlone) At Moz, our longtime TAGFEE code calls on our company to be transparent, and we consider it essential to speak openly about the factual history of the places we live and work. Colonization, genocide, broken treaties, theft of lands, federal failure to recognize legal status, erasure, and racism are all part of the past and present of the Pacific Northwest. We believe it’s the bare minimum requirement of all local people to speak about this candidly and with a determination to act from a place of truth. At the same time, we hold in the highest possible regard the Tribes, Nations and Bands who continuously set examples of caring for the human community and for the lands and waters they have protected since time immemorial. We are grateful for this vital leadership on human rights, Climate Change, ethics, sustainability, and so many other foundational matters. In accordance with the Universal Declaration of the Rights of Mother Earth, we at Moz are also thanking the beautiful lands and waters, themselves. Is your company also thinking of publishing a Statement of Land Acknowledgement? We’d like to take this opportunity to invite all of our good peers and colleagues in the SEO and SaaS spaces to start team discussions about the importance of acknowledging and honoring the local Tribes, Nations, and Bands whose members are included on your staff or who are your nearest neighbors. These were the main steps in our own journey: We consulted the map at Native-Land.ca to form a first idea of the traditional homelands in which our offices are located. This map is a work in progress and is not a substitute for direct dialogue with Indigenous Peoples. We visited the websites of each of the Tribes, Nations, and Bands we had seen on the maps, and read any statements they had published regarding Land Acknowledgement protocols. For example, this guide from the Duwamish Tribe was extremely helpful. We searched for Indigenous-authored commentary on the process of Land Acknowledgement to help us become better-informed. Articles like this one taught us a great deal. We looked at statements that had been published by other local businesses, organizations, and educational institutions. For example, the City of Vancouver made this motion, and a nearby YWCA had posted this page.We spent some time learning the decolonized spellings of the names of each of the Tribes, Nations and Bands, where available, and watched their videos on YouTube to hear these names pronounced in hopes of making our address respectful. We phoned or emailed the offices of each Tribe, Nation, or Band to inquire if, given our office locations, it would be appropriate to include them in an acknowledgement and if they had any specific requests as to how they would prefer inclusion. We were so appreciative of the kind responses we received, particularly given how difficult things have been during the pandemic. It has been such an honor to spend time learning about this process, and we close with our grateful acknowledgement to each of the Tribes, Nations, and Bands for their permission, guidance, and presence. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Statement of Land Acknowledgement, Published Today With Gratitude"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Statement of Land Acknowledgement, Published Today With Gratitude"
    },
    {
      "level": "H2",
      "text": "What is a Statement of Land Acknowledgement?"
    },
    {
      "level": "H2",
      "text": "Why is Moz publishing this statement?"
    },
    {
      "level": "H2",
      "text": "Is your company also thinking of publishing a Statement of Land Acknowledgement?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}