{
  "url": "https://moz.com/blog/statement-in-support-of-indigenous-peoples",
  "slug": "statement-in-support-of-indigenous-peoples",
  "title": "A Statement in Support of Indigenous Peoples in This Time of Grief - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We express solidarity with the Indigenous communities of this continent grieving their precious lost children.",
  "content": "A Statement in Support of Indigenous Peoples in This Time of Grief Moz News By: Sarah Bird July 6, 2021 Table of Contents Copied! By: Sarah Bird July 6, 2021 A Statement in Support of Indigenous Peoples in This Time of Grief Moz News We express solidarity with the Indigenous communities of this continent grieving their precious lost children. What occurred at the boarding and residential schools of Canada and the US is cruel beyond words. We call for the rights, needs, requests, and words of Indigenous Peoples in their own voices to be foregrounded in all areas relating to cultural genocide. At Moz, we have been working for the past year with the Tribes, Nations, and Bands in the traditional homelands in which our offices are located to draft an approved Statement of Land Acknowledgement, but we still have so much more to learn. We recommend the following resources to our community for further learning in support of Indigenous Peoples. Learn The first step toward change is education. We've compiled resources you can use to learn more about these tragedies: Learn about what happened at the residential and boarding schools. Listen to survivors. Indigenous survivors and advocates have spent decades telling the world of these atrocities. Take the time to learn their histories and share them far and wide.Read Indigenous journalism. Consider making publications like Indian Country Today, Windspeaker, and the Indigenous Environmental Network part of your regular news-reading schedule. Learn how to be an ally to Indigenous communities. Dr. Lynn Gehl shares an Ally Bill of Responsibilities here, while Amnesty International offers a helpful resource here. Honor Many non-Indigenous people live on stolen land. Take the time to learn about and support the Indigenous communities near you. Know where you live. Native-land.ca is a community-contributed interactive map that shares the Peoples, languages, and treaties for a given geographic location. Learn about the land you live on, the people from whom it was taken, the Nations, Tribes, and Bands who currently live there, and their many diverse cultures. This map is a work in progress; seek out additional information from the websites of Indigenous communities near you and from books written by local Indigenous authors. Find ways to support the Tribes nearest you. In Seattle, the Real Rent Duwamish project allows residents to pay rent to one of our local and shamefully federally unrecognized Tribes. You can also sign this petition demanding the US federal government uphold the 1865 Treaty of Point Elliott and recognize the Duwamish Tribe. Start a discussion at your company about developing and publishing a Statement of Land Acknowledgement on your website. Here, for example, is the Duwamish Tribe’s guidance on such statements, and here is an example of this type of statement on the website of Seattle Central College. Act All of us have the power to make a difference. Here are actions you can take today to express solidarity with Indigenous communities. Advocate for transparency in education. Inaccuracies and historical omissions are par for the course when it comes to teaching kids about North America's violent colonial history. Teaching children the truth about history, even the ugly parts, is one way to halt the cycle of harm.Contact your representatives. If you're in the US, this government site will help you connect with your local elected officials. For Canada, see the On Canada Project here. If you are a non-Indigenous resident, let officials know you support the specific requests and demands of Indigenous Peoples, as expressed in their own voices.Amplify Indigenous voices. The SEO community is highly active on social media. Consider following Indigenous neighbors on Twitter, Facebook, and other platforms, learning respectfully from their accounts, and sharing their content from your own accounts. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Statement in Support of Indigenous Peoples in This Time of Grief"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Statement in Support of Indigenous Peoples in This Time of Grief"
    },
    {
      "level": "H3",
      "text": "Learn"
    },
    {
      "level": "H3",
      "text": "Honor"
    },
    {
      "level": "H3",
      "text": "Act"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sarah Bird\n          \n            Sarah Bird\n          \n            Sarah Bird"
}