{
  "url": "https://moz.com/blog/stealing-dmoz-listings-with-mod-proxy",
  "slug": "stealing-dmoz-listings-with-mod-proxy",
  "title": "Stealing DMOZ listings with Mod_Proxy - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I don't think I know of any SEO who doesn't like Apache. Modules like Mod_Rewrite have definitely made our lives a whole lot easier. But there are many more, less known modules, that can serve the life of a (Black Hat) SEO. Mod_Proxy is one of those modules, originally created to serve as a…",
  "content": "Stealing DMOZ listings with Mod_Proxy Blogging J By: Jammer July 20, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! J By: Jammer July 20, 2007 Stealing DMOZ listings with Mod_Proxy Blogging This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I don't think I know of any SEO who doesn't like Apache. Modules like Mod_Rewrite have definitely made our lives a whole lot easier. But there are many more, less known modules, that can serve the life of a (Black Hat) SEO. Mod_Proxy is one of those modules, originally created to serve as a proxy/caching module but also known for its load-balancing features. However, the most interesting feature has to be its ability to proxy websites on to another domain. Do RSS scrapers upset you? With just three lines in my .htaccess Mod_Proxy allows me to copy your entire website. Think you are safe because you're using \"absolute URLs\"? Think again, there's nothing Mod_Proxy_HTML can't fix. On to the fun part: Stealing DMOZ listings We all know the importance of DMOZ listings, just as we all know how impossible it is to get one for your website, let alone 10 (or 20). This is where Mod_Proxy comes in. Go to DMOZ and find yourself a couple of well edited, relevant categories. Pick a couple of sites and use your Mod_Proxy configuration to copy those sites to new domains. Mod_Proxy_HTML even allows you to include an alternative logo to match your new domain names. After you've copied a couple of websites, go back to DMOZ and request to have the \"old\" listings updated so they match your domains. Just argue that due to some merger the name of the company has changed, whatever... If you're lucky, some listings will get changed and you then own a couple of relevant DMOZ listings. Wait a couple of days/weeks and redirect your \"proxy domains\" to your favorite scraper. It'll get you a scraper with so much authority that you will rank for pretty much anything. Other fun posibilities Of course you're not limited to just stealing DMOZ listings. There's plenty of other things to play with: Google washing: Copy your favorite competitors' website a gazillion times Adwords misery: Advertise your proxied site with Adwords and report the original for \"double serving\". If you're lucky Google stops their ads. ... (Get creative)! Ulco | Netters.nl UPDATE from Rand: While this blog post offers excellent insight into black hat tactics, I'd urge readers to use this information to help identify and protect themselves from threats, not engage in them. The downside risk for using methods like this far outweigh their short-term value. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Stealing DMOZ listings with Mod_Proxy"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Stealing DMOZ listings with Mod_Proxy"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Make AI Your Writing Sidekick for Content Marketing"
    },
    {
      "level": "H3",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H3",
      "text": "Author names: Do They Matter? How to Attribute Content"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jammer\n          \n            Jammer"
}