{
  "url": "https://moz.com/blog/stepping-out-of-the-seo-echo-chamber",
  "slug": "stepping-out-of-the-seo-echo-chamber",
  "title": "What New SEOs Don't Know Unless You Tell Them: A Reminder from Outside the Echo Chamber - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Think everyone knows as much as you do about SEO? Think again. Find out what the average client really knows and what happens when you don't make sharing your SEO knowledge a part of your standard business practice.",
  "content": "What New SEOs Don't Know Unless You Tell Them: A Reminder from Outside the Echo Chamber SEO Basics By: Ruth Burr Reedy November 26, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Ruth Burr Reedy November 26, 2014 What New SEOs Don't Know Unless You Tell Them: A Reminder from Outside the Echo Chamber SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. SEO experts spend multiple hours a week reading blogs, social media and forums to stay abreast of the latest search engine developments; we spend even more time testing and measuring tactics to figure out what works best for our sites. When you spend so much of your time thinking, talking and learning about SEO, you can get lost in the echo chamber and take your eyes off the prize of growing your clients' businesses. It's easy to get excited about the new and shiny developments in search and to hang on Google's latest announcements, but there's no point in switching a site from HTTP to HTTPS if it doesn't even have appropriately keyword-rich title tags. There's no reason to run a button-color conversion rate optimization test on a site that's still using the manufacturer's default description on product pages. Sometimes your traffic is plummeting because you haven't checked for new 404 errors in 6 months, not because you've been hit with a penalty. Think horses, not zebras, and don't forget one important fact: Most people have no idea what we're talking about. What clients don't know Running a business, especially a small business, is way more than a full-time job. Most business owners these days understand that they need to be doing something for their business online, but once they get beyond \"have a website\" they're not sure of the next step. Photo via Pixabay Moving back into agency work after several years in-house, I was surprised by just how many businesses out there have never gone beyond that first step of having a website. The nitty-gritty of building a search-friendly website and driving traffic to it still aren't that widely known, and without the time or inclination to become experts in marketing their websites, most small business owners just aren't spending that much time thinking about it. Hanging out in the SEO echo chamber is a great way to stay on top of the latest trends in digital marketing. To win and keep our clients, however, we need to step out of that echo chamber and remember just how many website owners aren't thinking about SEO at all. The good Relatively few people know or understand digital marketing, and that's the reason we all have jobs (and most of us are hiring). The strapped-for-time aspect of business ownership means that once someone decides it's time to get serious about marketing their business online, they're likely to call in an expert rather than doing it themselves. There are some really competitive industries and markets out there, but there are also plenty of niche and local markets in which almost nobody is focusing on SEO in a serious way. Take a look at who ranks for your target keywords in your local area, using an incognito window. If the key phrase isn't appearing consistently on the search results page, chances are nobody is targeting it very strongly. Combine that with an absence of heavy-hitting big brands like Amazon or Wikipedia, and you may have a market where some basic SEO improvements can make a huge difference. This includes things like: Adding keywords to title tags and page copy in an intentional, user-friendly, non-keyword-stuffed wayClaiming local listings with a consistent name, address and phone numberBuilding a few links and citations from locally-focused websites and blogs It may not seem like much (or seem like kind of a no-brainer), but sometimes it's all you need. Of course, once the basics are in place, the smartest move is to keep improving your site and building authority; you can't rely on your competitors not knowing their stuff forever. Even in more competitive markets, a shocking number of larger brands are paying little to no attention to best practices in search. Many businesses get the traffic and rankings they do from the power of their brands, which comes from more traditional marketing techniques and PR. These activities result in a fair amount of traffic (not to mention links and authority) on their own, but if they're being done with no attention given to SEO, they're wasting a huge opportunity. In the coming years, look for SEO-savvy brands to start capitalizing on this opportunity, leaving their competitors to play catch-up. From inside the echo chamber, it's easy to forget just how well the fundamentals of SEO still really work. In addition to the basic items I listed above, a website should be: Fast. Aim for an average page load time of under 5 seconds (user attention spans start running out after 2 seconds, but 5 is a nice achievable goal for most websites).Responsive so it can be viewed on a variety of screens. Mobile is never getting less important.Well-coded. The Moz Developer's Cheat Sheet is as good a place to start as any.Easy to navigate (just as much for your customers as for Google). Run a Screaming Frog crawl to make sure a crawler can get to every page with a minimum of errors, dead ends, and duplicate content.Unique and keyword-rich, talking about what you have in the language people are using to search for it (in copy nobody else is using).Easy to share for when you're building awareness and authority via social media and link building. So life is good and we are smart and there's a lot to do and everything is very special. Good deal, right? The bad SEO being a very specialized skill set has some serious downsides. Most clients don't know much about SEO, but some SEOs don't know much about it either. There are a ton of great resources out there to learn SEO (Moz and Distilled U come to mind). That said, the web can be a ghost town of old, outdated and inaccurate information, and it can be difficult for people who don't have much experience in search marketing to know what info to trust. An article on how to make chocolate chip muffins from 2010 is still useful now; an article on PageRank sculpting from the same time period is much less so. Outdated techniques (especially around content creation and link building) can be really tempting for the novice digital marketer. There are a ton of \"tricks\" to quickly generate low-quality links and content that sound like great ideas when you're hearing them for the first time. Content spinning, directory spam, link farms – they're all still going on and there are gobs of information out there on how to do them.Why should we care? So why should we more experienced SEOs, who know what we're doing and what works, care about these brand new baby n00b SEOs mowing through all this bad intel? Photo by Petras Gagilas via Flickr The first reason is ideological – we should care because they're doing bad marketing. It contributes to everything that's spammy and terrible about the internet. It also makes us look bad. The \"SEO is not spam\" battle is still being fought. The second reason is practical. People billing themselves as SEOs without knowing enough about it is a problem because clients don't know enough about it either. It's easy for someone engaging in link farming and directory spam to compete on price with someone doing full-scale content marketing, because one is much, much more work than the other. Short-term, predictable results feel a lot more tangible than long-term strategies, which are harder to guarantee and forecast. Not to mention that \"X dollars for Y links\" guy isn't going to add \"There is a risk that these tactics will result in a penalty, which would be difficult to recover from even if I did know how to do it, which I don't.\"How can we fix it? SEOs need to educate our clients and prospects on what we do and why we do it. That means giving them enough information to be able to weed out good tactics from bad even before we make the sale. It means saying \"even if you don't hire me to do this, please don't hire someone who does X, Y or Z.\" It means taking the time to explain why we don't guarantee first-page rankings, and the risks inherent in link spam. Most of all, it means stepping out of the echo chamber and into the client's shoes, remembering that basic tenets of digital marketing that may seem obvious to us are completely foreign to most website owners. At the very least we need to educate our clients to please, please not change the website without talking to us about it first! Since terrible SEO gives us a bad rep (and is annoying to fix), we also need to actively educate within the SEO community. Stepping out of the echo chamber in this case means we need to spend some time talking to new SEOs at conferences, instead of just talking to each other. Point brand new SEOs to the right resources to learn what we do, so they don't ruin it for everybody – for heaven's sake, stop calling them n00bs and leaving them to learn it all from questionable sources. As SEO content creators, we should also take time on a regular basis to either update or take down any outdated content on our own sites. This can be as simple as posting a notification that the info is outdated or as complex as creating a brand new resource on the same topic. If you're getting organic search traffic to a page with outdated information, you're passively hurting the state of SEO education. A declared stance on providing up-to-date information and continually curating your existing content to make it the highest quality? Sounds like a pretty strong brand position to me, SEO bloggers! Some people are going to read this post and say \"well, duh.\" If you read this post and thought it was basic (in every sense of the word), go out right now and fix some of your blog posts from 3 or 4 years ago to contain the latest info. I'll wait. The takeaways There are still a ton of markets where just the basics of SEO go a long way.Don't get distracted by the latest developments in search if the basics aren't in place.Brands that are getting by on their brand strength alone can be beaten by brand strength + SEO.Old/bad SEO information on the web means people are still learning and doing old/bad SEO, and we're competing with them. Branding and positioning in SEO needs to take this into account.Clients don't know who to trust or how to do SEO, so we have to educate them or we'll lose them to shysters (plus it is the right thing to do).Bad SEO gives all of us a bad reputation, so education within our community is important too. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "What New SEOs Don't Know Unless You Tell Them: A Reminder from Outside the Echo Chamber"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "What New SEOs Don't Know Unless You Tell Them: A Reminder from Outside the Echo Chamber"
    },
    {
      "level": "H2",
      "text": "What clients don't know"
    },
    {
      "level": "H2",
      "text": "The good"
    },
    {
      "level": "H2",
      "text": "The bad"
    },
    {
      "level": "H3",
      "text": "Why should we care?"
    },
    {
      "level": "H3",
      "text": "How can we fix it?"
    },
    {
      "level": "H2",
      "text": "The takeaways"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ruth Burr Reedy\n          \n            Ruth Burr Reedy\n          \n            Ruth Burr Reedy"
}