{
  "url": "https://moz.com/blog/stimulus-check-traffic-conversion-impacts",
  "slug": "stimulus-check-traffic-conversion-impacts",
  "title": "How Did US Stimulus Checks Impact On-Site Traffic and Conversions? [Case Study] - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The team at Portent conducted a study verifying whether stimulus distributions correlated with revenue spikes in online retailers and auto industries. Dig into their results in this post, along with consumer data to use as predictive indicators through the rest of the pandemic.",
  "content": "How Did US Stimulus Checks Impact On-Site Traffic and Conversions? [Case Study] Marketing Industry | SEO Analytics | SEO Reporting By: Oeuyown Kim February 24, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Oeuyown Kim February 24, 2021 How Did US Stimulus Checks Impact On-Site Traffic and Conversions? [Case Study] Marketing Industry | SEO Analytics | SEO Reporting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As a Senior Analytics Strategist working at an agency with clients across industries, I’ve seen wildly contrasting performance throughout the pandemic. Certain online retailers and auto sites were far surpassing any historical performance, while others had to cut back budgets significantly. The variances in revenue performances also empirically correlated with time frames when the public received more support, in the form of stimulus checks. My team at Portent conducted the study detailed below to verify our hypotheses that the pandemic caused revenue increases in online retailers and auto industries, and that those spikes correlated with stimulus distributions. We discovered a few specific factors that increased the probability of confirming our hypothesis along the way. “Unprecedented” has undoubtedly been the word of the year, and it’s touched all aspects of life and business. There have been changes in consumer behavior across all industries — we’ve unfortunately seen swaths of shutdowns in particular markets while others have sustained or are even thriving. This post will provide some observations in online behavior along with some consumer data that should be used as predictive indicators through the rest of the pandemic. The study The observations of changes in online behavior were pulled and anonymized from 16 of our clients across 8 different industries. We narrowed those 8 industries down to three categories defined by Google Analytics for the purposes of this analysis: Shopping (10), Travel (3), and Autos & Vehicles (3). The sites included in this analysis were limited to the US where possible and ranged in monthly revenue from $16K to $103K and in monthly sessions from 4K to 44K. Observation #1: Stimulus checks resulted in increases in online behavior Stimulus checks initiated the first revival of spending since the start of the pandemic. Granted, it was only about a month between the first notice of a lockdown and the beginning of stimulus payments. However, that increase in spend remained at higher levels after the majority of stimulus checks were distributed for most sites in this analysis—of course, excluding the Travel sites. The first round of stimulus checks provided some form of relief to single Americans that made less than $99K a year, with those who made less than a $75K salary receiving the full $1,200. There were differences in limits depending on whether you have children or how you filed your taxes. There was a noticeable jump in both sessions and revenue during the (1) week of April 13th, when $80M worth of stimulus payments were deposited for taxpayers who had direct deposits set up. By the (2) week of April 20th, additional rounds of deposits were made to those who manually set up direct deposits through the IRS. And by the (3) week of June 3rd, the IRS had delivered $270B in stimulus checks to Americans. At this point, revenue and sessions began to normalize below that period of stimulus distributions until the undeniable Black Friday sales occurred. Observation #2: The impact depends on the market There were obvious industries that were impacted most by the changes in consumer behavior and are still barely recovering: travel, in-store retail, and restaurants, to name those that were hit the hardest. On the other hand, some industries are actually performing better than before, such as online retail sales and food and beverage stores. The analyses from S&P Global and the U.S. Census Bureau were accurately reflected in our study as well. Through the end of November, the average revenue for the Shopping sites in our analysis was 27.5% higher than our dip seen in March while sessions were 24.4% higher. What came as a surprise, however, was that the Autos & Vehicles sites actually sustained higher averages than the Shopping sites. The sites in this industry saw 26.8% higher sessions and 36.8% higher revenue compared to the dip seen in the beginning of the pandemic and also well above prior levels in the beginning of the year. The stark jump in sessions and revenue also aligned with when the distribution of stimulus checks began. In hindsight, the increase in consumer spending in this industry could have been anticipated considering the limitations and fear associated with traveling by plane. Online behavior is higher in the summer months as well, as those who were becoming restless from quarantining began to take road trips to satisfy their wanderlust. There were a few other predictable trends that we identified in our study: There was one quick spike in athletic wear purchases with the average sustaining higher than pre-pandemic levels.There was a prolonged spike in revenue and especially traffic for baking goods and flour purchases, which remained at much higher levels compared to prior numbers. Then there was the seasonal influx of interest during the holidays. Interestingly, the conversion rate was 123% higher during the holidays compared to its peak in the beginning of the pandemic.With parents and families stuck at home, there was an exponential and lengthy growth in online behavior for children’s toys. Although the growth has tapered, it continues to see an upward trend.As expected, travel sites have taken the largest hit out of our study with a significant drop that has resulted in little to no recovery. The increase in revenue and sessions in the summer is almost entirely attributed to a resort that saw a similar increase in interest from the wanderlusts of the Autos & Vehicles sites. Observation #3: There’s a positive correlation between AOV and % change in revenue There was a fairly strong correlation of 0.76 between average order value (AOV) and % change in revenue YoY* for Shopping sites only. The consumer behavior on Autos & Vehicles sites was more dependent on stimulus checks and weather while the behavior on Travel sites was dependent on the feeling of safety. *The data in this chart was pulled with the following notes: YoY comparison was for November 2019 vs. November 2020 (November being the highest performing month based on seasonality)Two anomalies were excluded from this data: (1) A flour company and, (2) A company with an AOV of nearly $2K This one makes intuitive sense if you think about who’s been disproportionately impacted by the pandemic. Industries that are still thriving are ones that were able to more easily transition to 100% remote work and ones that had enough funds to weather some dropoff in clientele. Those who were fortunate enough to be employed in those industries during this time are also more likely to be paid higher than the median. In fact, only 30% of parents earning $200K or more lost their jobs since the pandemic, compared to 65% of parents earning less than $25K. Those who lost jobs in higher income brackets were also more likely to be able to find work again. High-income spenders weren’t significantly impacted by the pandemic aside from the first few months, during which the change in consumer spending came from uncertainty. Although high- and low-income brackets both saw significant drops in spending initially, high-income consumers returned to levels comparable to January 2020 while low-income consumers were still about 10% below on average through September 2020. Considerations to forecast future performance There’s quite honestly nothing novel in this analysis that hasn’t been surfaced through market research, and these observations have been corroborated by economic data. The key takeaways here are to pay attention to the trends we're seeing, think about how they relate to your target audience or customer, and pay attention to new developments that may signal a shift toward normalcy once again as you re-enter the digital marketplace. Stay informed of economic trends Keep up-to-date with economic research published by S&P and monitor news releases from the Bureau of Economic Analysis to identify trends in Personal Income, Disposable Personal Income (DPI), Gross Domestic Product (GDP), and Personal Consumption Expenditures (PCE). The PCE started dipping in July, which correlates with the changes in consumer behavior we saw in our study. Although the reports don’t come out immediately, staying updated on the direction of these trends could inform your efforts. Consider your target audience It’s important to narrow down your research to your target audience. If your business is international, you likely won’t be as impacted by future stimulus checks in the US. However, different international markets will recover at differing rates. Similarly, it’s important to keep your industry in mind. S&P is already estimating that the most-affected industries may not recover fully until 2022. This means that industries like in-store retail, travel, and service will have to find alternative ways to pivot during this time to return to normal levels. Once you’ve considered your market and industry, weigh the risks based on your AOV and the income level of your average consumer. The higher the average income level, the more likely it is that your market has already recovered or the higher your chances are of being able to adjust successfully. Additional federal support Although the support from the US government throughout the pandemic has been lackluster at best, there’s a possibility of additional support. The recent round of stimulus checks were more limited than the first, meaning the impact on consumer behavior might be less noticeable. Economists are guessing that consumers would rather save this smaller amount than put it back into the economy. However, these bills should be accounted for in forecasting with the hopeful potential of additional (and more significant) federal support. The distribution of vaccinations is likely to take at least several months to be impactful and possibly even longer to reach herd immunity. During this time of forward movement in the pandemic, we will all need to monitor and predict consumer behavior in unprecedented ways until we begin to see normalcy again. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How Did US Stimulus Checks Impact On-Site Traffic and Conversions? [Case Study]"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How Did US Stimulus Checks Impact On-Site Traffic and Conversions? [Case Study]"
    },
    {
      "level": "H2",
      "text": "The study"
    },
    {
      "level": "H3",
      "text": "Observation #1: Stimulus checks resulted in increases in online behavior"
    },
    {
      "level": "H3",
      "text": "Observation #2: The impact depends on the market"
    },
    {
      "level": "H3",
      "text": "Observation #3: There’s a positive correlation between AOV and % change in revenue"
    },
    {
      "level": "H2",
      "text": "Considerations to forecast future performance"
    },
    {
      "level": "H3",
      "text": "Stay informed of economic trends"
    },
    {
      "level": "H3",
      "text": "Consider your target audience"
    },
    {
      "level": "H3",
      "text": "Additional federal support"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Oeuyown Kim\n          \n            Oeuyown Kim\n          \n            Oeuyown Kim"
}