{
  "url": "https://moz.com/blog/stoney-degeyter-of-pole-position-marketing-on-viral-campaigns-sphinn-blackmail-and-more",
  "slug": "stoney-degeyter-of-pole-position-marketing-on-viral-campaigns-sphinn-blackmail-and-more",
  "title": "Stoney DeGeyter of Pole Position Marketing on Viral Campaigns, Sphinn, Blackmail and More - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I think this is one of the most enjoyable interviews we've featured here. Stoney DeGeyter is an SEO and Internet marketer from Reno, NV and the owner of Pole Position Marketing, an SEO/M firm with considerable talent and a roster of happy clients. In the interview, Stoney covers his view on the SEO…",
  "content": "Stoney DeGeyter of Pole Position Marketing on Viral Campaigns, Sphinn, Blackmail and More Public Relations By: Rand Fishkin November 14, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 14, 2007 Stoney DeGeyter of Pole Position Marketing on Viral Campaigns, Sphinn, Blackmail and More Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I think this is one of the most enjoyable interviews we've featured here. Stoney DeGeyter is an SEO and Internet marketer from Reno, NV and the owner of Pole Position Marketing, an SEO/M firm with considerable talent and a roster of happy clients. In the interview, Stoney covers his view on the SEO issues of the day, along with a terrific story of viral marketing that sparked this post. Stoney kicks back after his big interview First off, for those who might not be familiar, can you give us your background and tell us how you got involved in the field of search and Internet marketing? I kind of grew up with the entrepreneurial bug. My parents owned their own business selling decorative wall plaques and I remember coming home from school every day and having to \"fold boxes\" that they used to ship the plaques in. After college I had a few decent jobs and was really a crappy employee. I seemed to have about a one-year life-span at any one place before I got the urge to move on, or politely be asked to go! So while going from one job to another, working as an admin assistant to a secretary to graphic design I was always working something from home. I picked up a book \"Learn HTML in 24 hours\" and built my first website in 12. I was really crappy at it back then but so was everybody else so it hardly mattered. I started off selling music CDs online which then morphed into developing websites. My dad had a website so I told him I’d redevelop it and make it better, and I did, frames and all. He then bought me a copy of the original Web Position program so I could help him get top search rankings. That moved me into \"SEO\" and eventually I got away from website design as I realized that I had neither the creative skills graphically, nor the technological skills to keep up with the database development that was just starting to emerge. Tell us a little about Pole Position - how long has the company been around? Where are you based? What kinds of clients do you work with and what does the typical engagement entail? It was in ‘98 or so that I really started diving into search engine rankings etc. I went through several company names as I moved from CDs to web development to SEO. I finally settled on Pole Position Web which was our company name for several years. Still is, actually, but a couple of years we changed our DBA (and will soon be changing our legal name) to Pole Position Marketing. I felt that better represented the direction we were going as a company. And there is nothing like having a name that gives at least some indication as to what you do. PPM is based in Reno, NV but most of our clients are abroad. When we moved the company here from Sacramento, CA a few years back, I told my wife that it didn’t matter where I was so long as I had internet access. I realize now that that’s not entirely true, especially when it comes to hiring good people. I’ve been blessed in that regard as I have the best crew I could ever hope for regardless of location. We don’t \"specialize\" in any one area. We have clients all over the map, from baby stores to flowmeters. It’s really quite amazing to work with such varied industries, and it goes a long way to keeping things interesting. We focus pretty heavily on on-page optimization and visitor usability. It’s easy enough to SEO a page for keywords, but making sure the text is readable, engages the visitor and persuades them through the conversion process, is another. We are always exploring new ways to get good links, whether that be through more traditional link building or social media/viral marketing. One of the things we pride ourselves on most, though is our optimization process. For us, optimization is an ongoing process. We don’t focus on 15 or 50 keywords, but instead are in a constant state of analyzing and optimizing the next group of keywords into the site. Our clients sign 1-year contracts and then go month to month after that, and we rarely lose clients. The big draw is that they know that as long as we are optimizing for the next group of keywords, they will always be expanding their reach in the search engines month after month. You're obviously extremely talented in the social media and viral content creation arena - care to show off some of your work? Well, we have far more failures than successes. In fact, outside of the Brock Sampson campaign I can’t point to anything that I’d say we are really proud enough to showcase. We’re babies in this and still feeling our way through it. But I’ll give the full rundown on Brock in response to your last question below. Stoney - I note that you're very active on Sphinn. What's your general opinion of that site, the community its created and the stories that get voted up there? I try to be pretty active there but I find that I just don’t have a whole lot of time. It’s getting harder and harder to keep up. I recently had to unsubscribe to the New Submissions feed because it was overwhelming for me. Now I just peruse the Hot Topics, which I know isn’t really fair because nothing goes hot unless somebody is looking at the new submissions. I feel that I’m not being a responsible participant in the Sphinn community. But I do rely heavily on \"Sphinn this\" emails and instant messages I get from my pals. I know Tamar started a discussion about that, but really I don’t mind being asked by people that I already trust. Getting those requests often points me to content that I otherwise would not have time to find myself. If I like it I’m more than happy so Sphinn it, otherwise I won’t. I think my small circle all understands this, and we respect each other to act accordingly and don’t bother anybody after the first ask. As for the stories, well a lot are quality, but more than I can count in a single day are just things that I’m not interested in, even those that go hot. But obviously someone is, which is why they go hot to begin with. The main thing for me is to look for things that are of interest to me and my team. Those are typically the stories that I Sphinn. On a related note, we've noticed that several forums, sites and friend groups consistently Sphinn each other's content, and the same 10-15 folks are often the voters on many pieces created by or submitted by those members - do you think this hurts the Sphinn community, or is it a natural part of any voting site that welcomes search marketers? Well, I guess the question is if the SEO community can be self policing in this regard, or if we just have to expect this. Just the other day I asked one of my crew to submit one of my stories. She did and the rest of the team jumped in to Sphinn it too. An hour later the only sphinns were my team. It made me feel silly. Now I try to make it a policy not to ask for a Sphinn on any of my own stuff (past the original submit) until enough people have already Sphunn it themselves. In actuality, I’d prefer it got submitted on its own, and a lot of my stuff does. But sometimes vanity gets the best of us! The bottom line is that I don’t care who submitted or Sphunn something if it’s quality. If you go hot only because all your buddies Sphunn it for you, then there really is no reward in that and I don’t think you get any benefit out it, so what’s the point? Sphinn isn’t digg, it’s not a mindless community just looking for the next thing to vote for. It seems to me if it’s quality, someone will find and Sphinn it (unless you’re an unknown, in which case submit it yourself). If it’s worth it, it’ll go Hot all by itself. A few questions about search policies - any opinions on Google's paid links stance? Obviously, it dominates blogosphere conversations in the SEO world - why is that? Does it pay to try and fight Google's policies on paid links? Is there any action a small group of SEOs could take that would actually impact Google substantively? Hehe. I’ll point you to my post over at Search Engine Guide, but to summarize, I think Google needs to make up its mind if we should edit sites for users and not engines, or if editing sites for Google’s benefit is now considered kosher. Obviously, when Google makes a move like this it’s going to make waves in the community. After all, this is what we do. And I think the range of opinions is good and healthy. I don’t agree with a lot of people’s take on it and I know many don’t agree with me, but with each opinion I read I learn something and it perhaps allows me to put things into a slightly different perspective. I can’t say whether it pays to fight or not. I do think Google keeps their ear to the ground in the industry but I don’t know if we have enough of an effect to change Google policy in the near-term, especially when their own interests are involved. I do think there are some that Google might be more apt to listen to, Danny for instance, and you seem to be able to have Matt Cutt’s ear, so yeah, a few can make a difference, but it depends on the issue overall. I don’t think this particular argument is one that Google will concede and back off on. There is just too much at stake for them to make the move they did. But I suppose if the noise gets loud enough and, Google starts getting a bad name, that can have an effect. Maybe not immediately, but over a period of time, it certainly can. So yeah, griping can have its advantages. Another big search engine issue that SEOs frequently bash heads against is the dominance of domain trust in the algorithms. Wikipedia is obviously one of the most visible signs of this feature, but it extends equally to large news sites, dominant niche players (Zillow, Expedia, Findlaw, etc.). Do you think this ranking methodology is good for users? Is it good for engines? Do you think we'll see the pendulum swing further in this direction? Good question and I don’t know if I can adequately answer. I think it’s inevitable that some domains will be more trusted overall than others. But what I think the engines can do is find ways to balance domain strength against individual page strength. It seems that a page on Wikipedia that relies solely on domain strength for rankings should be able to be overcome by a weaker domain that happens to have a page on the same topic where that single page gets more links than that single Wikipedia page. It’s all about balance and I would hope the search engines are always seeking to find that. Maybe they are. Recently, we've seen both MSN/Live and Yahoo! update their algorithms and their features - do you think that either could present a significant challenge to Google's search dominance in the future? What would it take for another engine to rise significantly in search share? Oh, I hope so. But I don’t see it happening anytime soon. The problem with the other engines is they are playing catch-up and even if they meet and slightly surpass Google in perceived relevance, Google has become part of the culture. Yahoo tried for years to get their name used as a verb \"Do you Yahoo!?\". With Google it happened against their will. That’s where Google’s strength lies. Any search engine would have to be vastly superior than Google to begin really making a dent. Heck, I think that Ask's blended results are far superior to Google’s, but they are not gaining any market share. But that’s a cosmetic superiority, not necessarily one of relevance. Google is going to have to blunder and fall out of favor with the pop culture. That can certainly happen and maybe even sooner than we think. Pop culture is fickle that way sometimes. Would you be willing to share your favorite 2-4 posts or stories on any aspect of search marketing? Well, I would start with anything that I have written or any post that references something that I have written. :D Actually, that’s a very hard question because I’m not good at bookmarking things I like. I tend to like things teach me something or provide tips to doing \"X\". Especially if it’s something I have never read before or a unique take on something. I’m a very action oriented person so I like things that I can turn around and take action on. Industry news and gossip doesn’t interest me a whole lot, nor does the latest Google whatever. If it doesn’t help me provide my clients with a better service I usually just gloss over it. Which is ironic because I am often first to provide my unsolicited opinion to anyone within earshot! How were you able to build up your profile in the search marketing world? Any advice for newcomers seeking to become icons like Stoney? LOL. Well I have to give a shout out to Jennifer Laycock who was first to pull me from obscurity. She gave me my first real opportunity to get my stuff out there in public. I’m not a natural at self-promotion or networking so I spent many years building my business in the shadows of the SEO industry. To give you some perspective on this, I’ve been writing newsletters (and then later blogging) since 1993 and still my company blog, (EMP) E-Marketing Performance has only a few hundred subscribers. It’s only been in the last couple years that I’ve been able to break out of my self-contained island and start making friends and getting myself out there in the community. You could say I took the long way about it. But I will say that the single best thing to do is to start making friends. Not just looking for ways to use others to promote yourself but finding ways to be a true asset to others. I rarely go into things with a \"what’s in it for me\" attitude. I like to go in from an angle of how I can provide benefit to someone else. Coincidentally, this is the same approach that is preached in marketing. Meet peoples need, be remarkable, etc. What are, in your opinions, some of the most under-utilized tactics in social media? Any areas where the mainstream crowds seem to be less savvy or skilled? I am completely unqualified to answer this question. Next. Likewise, for the SEO work that you do, where do you see your clients or potential clients having the most failures? I think the biggest failure in SEO is not looking at the big picture. SEO tends to focus so much on keywords. Not always keyword rankings, but getting keywords optimized on the pages. There is nothing wrong with that, but the site as a whole has to be considered. Everything from the site architecture, to the navigation, backend management systems and usability aspects get overlooked. More times than not, the clients want keyword after keyword after keyword, and don’t really allow the SEO the time, or have the budget, to look at some of the bigger issues that are often preventing the optimization from performing as well as it should. Recently we had the opposite happen with a client. We had optimized several pages and dozens of keywords and then discovered that the search engines were not spidering the pages that we wanted them to. We dug around and discovered that their CMS was creating duplicate pages/URLs and linking to them in the sitemap. We are still working with the client to get that resolved, but shortly after we found it I sat down with the client and he told me that after all the work we’ve done, it’s only now that he felt like we were really working for them. That statement tweaked me, knowing how much time and effort we put into the optimization, but I knew what he was getting at. We uncovered a real problem. This is the type of thing that can easily be overlook because the client wants the SEO to focus on keywords instead of looking at the big picture. It's Friday evening and you're doing something other than work - tell us about what you do when you're not online? Patiently wait for the next season of Battlestar Galactica to start. Evenings and weekends are usually reserved for my family. The kiddies usually have sporting events so it’s rare that we actually get a weekend of doing nothing. Aside from the family I’m a huge movie and TV buff. TV is not something I can have on as background noise. I have to watch it. I want to watch it. I absolutely love my TiVo (and Slinbox), cause now I can wait until all the kids are in bed and watch all my programs in silence (and anywhere with internet access!). I rarely go to the theater… only big-budget movies. I’m content to wait for DVD where I can watch it on my 55\" wide-screen, and take as many bathroom breaks as needed. I’ve got a pretty decent DVD collection too. Though I have some pretty obvious omissions (Free Sphinns for life for anyone who buys those for me! Uh, quality posts only, though!). Which of the following blog lists are better - Technorati Top 100, Bloglines top 1000, Techmeme Leaderboard or something else? Who? What? This is gonna sound really bad, but I’ve never looked at any of those lists. Living person you'd most like to meet? Anybody who can teach me how to work my business and my finances smarter. What's the next conference you're attending? Any special plans there? PubCon. We’re meeting up with your team for drinks, remember? (Don’t make me bring out those incriminating photos!) I’ll also be headed to SEMpdx in March and the just (or soon to be) announced Small Business Marketing: Unleashed Finally, tell us about the brilliance that was the Brock Sampson campaign - who came up with that? How did it start? And how could you tease us like that? We thought there might actually be someone we could hire! Well, that’s a story, so pull up a chair. Once I knew for certain that Ed and I would be attending your seminar I wanted to do something that would make you guys remember us. I tasked this to Ed and we shot ideas back and forth. I thought about bringing you guys a gift of some kind, either something useful or totally useless but that you couldn’t help but remember. Ed kept shooting down my ideas, I think one was life-size cardboard cutouts of our team as an office decoration (you can thank Ed later for his foresight!) After several days Ed came to me with the idea of getting you guys an action figure. I didn’t think much of the idea even after he found the hand-made Brock action figure. What do I know… I watch Family Guy! Anyway, the action figure just wasn’t substantial enough so I kept sending Ed back to think on it some more. Finally he came up with the idea of creating the resume. Around this time I also got the idea of the SEO Quiz: The Essentials, so Ed was working on that as well. I had originally wanted to get it to you guys a month before we headed to Seattle to make sure that it actually got noticed. As we got closer to the date of the seminar I was getting worried that our window was closing. Fortunately for us, you actually check your email! Needless to say, we were ecstatic when you responded. We worried a bit about whether you would figure out who it was. Ed had sent it out via a proxy server so you couldn’t trace the IP address, but later we realized that if you looked at the author data of the Word document you would have seen \"Ed\" as the creator. At that time, Ed was in communication with Gillian about the conference so we thought you might be able to put 2 and 2 together. Now I don’t remember who came up with the idea for the ransom note, but we knew what we were getting into this for. This is one of those few times that I go into something looking for something in return, and we wanted exposure and links from you. So we planned ahead and Ed took some photos of Brock in, shall we say, compromising situations. We held onto those for good measure. (Good thing too!) Our next task was to figure out how we were going to present Brock to you guys in Seattle. We knew it would be at the after party, but we had to wait for the right opportunity. We thought about setting him on the table where you were sitting when you weren’t up shooting your turn at pool. But we never saw the right opportunity. Finally Ed and I found a table near Rebecca, and set Brock hanging from an empty beer glass. I swear it took us five minutes to get Rebecca’s attention. She was obviously drunk, slurring her words, drooling at the mouth and gazing up into space. Seriously I was no more than five feet away and waving my arms in a way that could have flagged down a 747 a mile up and she still didn’t notice me. Finally when we got her attention we got her to come over and sit down. There was Rebecca and there was Brock only inches from her face and she didn’t notice. Maybe she was just awed by Ed and I’s masculinity, but we basically had to tell her to \"follow my finger\" and lead her eyes down to Brock. Score one for the sober team! So here we are, months of effort and we finally get a payoff. We were happy to go home with a victory under our belt. Sort of. The next Friday, Rob pulls open your videocast Whiteboard Friday, and announces to the office that you’re using Brock as a pointer. And then you do the unthinkable. You tell the world that you’ll tell us all about Brock later. Later? Really? So, this is where the photos came in handy. Here we were, a month after the fact, still waiting for \"later\". So we did what any decent, respectable, link baiting SEO would do. We blackmailed you. And lo and behold, the very next day I get a dozen plus interview questions from you. Funny how that works. And before you think better of it, I’ll be watching to see if this actually goes online. And for your own sake, let’s not be neglecting the other demands! I also asked Mr. deGeyter if he'd contribute at \"best of Stoney\" list of his contributions to the SEO blogosphere: Destination Marketing: SEM without Compromise A Completely Useless Linkbait Article Content is Dead. Community is King Now. Giving Personality to Your Personas The Power of Branding for Small Business: Part One A Look at SES Speakers and How they Brand Themselves If that's notenough for you, Stoney's also written an ebook on eMarketing and a guide to keyword research (warning - PDF). Thanks a ton for your input, Stoney - and congrats on all your success with Pole Position. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Stoney DeGeyter of Pole Position Marketing on Viral Campaigns, Sphinn, Blackmail and More"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Stoney DeGeyter of Pole Position Marketing on Viral Campaigns, Sphinn, Blackmail and More"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}