{
  "url": "https://moz.com/blog/stop-wasting-money-on-unoptimized-advertising",
  "slug": "stop-wasting-money-on-unoptimized-advertising",
  "title": "Stop Wasting Money on Unoptimized Advertising - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Facebook advertising, post boosting, PPC, and even print advertising. How are you deciding where and when to do these? That post your just “boosted”, how did you decide who is going to see it? Sure, you can pick some demographic info about people, pick some interests they already have, and a lot of…",
  "content": "Stop Wasting Money on Unoptimized Advertising Online Advertising By: Terry Moore August 20, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Terry Moore August 20, 2013 Stop Wasting Money on Unoptimized Advertising Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Facebook advertising, post boosting, PPC, and even print advertising. How are you deciding where and when to do these? That post your just “boosted”, how did you decide who is going to see it? Sure, you can pick some demographic info about people, pick some interests they already have, and a lot of other “narrowing” it down options. But what about the geographic component? When I speak with other marketers on the subject of “where and when” you would think I just spoke in a foreign language. But what if the state of Washington is NEVER EVER going to bring you a conversion (micro or monetary)? Why spend money on fans that aren’t your market? Building the wrong audience for your company can crush you in the future, but that’s another subject for another day. Also, what if the state of Maine is only seasonally interested in your product? They don’t care about you this month; sure, they might click, but they never take actions during certain times of the year. Again, do you want to waste effort and money on traffic that is highly unlikely to convert, ever? Shouldn’t this kind of info impact your decisions? So how do we optimize for the when and where? We need to start using the geographic component in our strategies. I believe if you’re not optimizing for when and where then you’re throwing a lot of your money away. Tossing it in the wind and hoping it lands somewhere good. Like other areas, we who are online marketers should be looking for ways to stretch the dollars spent so we look good for knowing our junk. What is the geographic component exactly? In a real basic sense, it is looking at statistical data by regions and locations to find patterns that may inform other marketing decisions. It’s a pretty old school marketing strategy that I believe died during the era of “gaming” search engines, but because of Google’s drastic changes over recent years we have been forced to do real company. . .stuff. As a result, we’re seeing some of the older methods resurface, with some updates to match how the times have changed. What I Do. First, let me explain what I do. I am an in-house internet marketer for a vacation rental company on the Outer Banks of North Carolina, Southern Shores Realty. As an in-house the small team at Southern Shores Realty is sort of a jack of all trades to everything for online marketing. We’ve learned that many of our marketing decisions, both online and offline, need to be informed by strategies that include the geographic component. How I Use The Geographic Component. Let me first explain a little bit about the uniqueness of our area. The Outer Banks is a tourist destination and wedding destination. While the Outer Banks does draw visitors from all over the world, more than 95% of our visitors come from very specific areas of the United States. The vast majority of this tourism runs parallel to when kids are out of school (most of June through most of August) with the booking season strongly kicking off the week after Christmas. As a vacation rentals home company, our business and product is directly tied to the interest in the Outer Banks, whether you come here to vacation, for a wedding, for an event, or for the rich history. This is something that is very different from many other brands, so some of what I’m going to show you may require some customization for your business marketing needs, but every industry can benefit from the geographic component. It’s all about knowing how to interpret the trends you’re seeing. So let’s get down to the process I use. I have learned to keep the process very affordable, so there is no cost in this process, just time and effort. Start with Google Analytics. Select a large date range. I like to use a year because I believe it will give a broader picture, allowing me to see yearly trends, so I’m going to pick July 1, 2012 through June 30, 2013. Then let’s go to Audience and then Location. Here I see the United State is 98.4% of all of our traffic so I’m really going to focus our attention on the United States. Looking at only the U.S. I can see we really do get traffic from every state in the U.S. But we want to focus our attention in the right areas. I believe that looking at the State level is too vague while going to the city level is too specific, so my preference is to set the primary dimension to Metro. Metros are areas highly connected to one specific area, often encompass multiple towns and cities that typically have similar interests based on accessibility and convenience. There was one more important step that needs to take place before I can have the data I need. We do a good amount of paid advertising online for Southern Shores Realty. Some are Google or Bing Pay-per-Click, some are Facebook Advertising, and some are paid links. We don’t want to see those in our results. Why? Because in the end, we’re trying to look for what people were looking for without being paid to click. Mixing in the wrong data could give me misleading results; including the people you paid to look at you will very much do that. How I handle this is through limiting my traffic to “non-paid search traffic” with an advanced segment, which happens to be a segment already provided by Google. Now that we’re looking at the Metro areas with only organic searches we get a clean picture of who is looking at us without being paid to do so. From this I can see who the heavy hitters are and where the majority of our traffic comes from. Number one on our list is the Washington D.C. metro. Here’s another cool tip: if you need to know what the D.C. metro area includes just click on the link and you’ll get a display of 163 towns and cities. I don’t use this often, but when I need to refine my data and go a little deeper I know this is here for me. At this point I like to focus on the metros that are at least 2.5% of our organic traffic. For us, that means our top 10 metros, which have at least 25,000 visitors annually. What I suggest for you is to begin with your top three metros and expand as you see fit. But keep in mind that the smaller the volume the greater the margin of error. But you need to adjust this number to what you believe will work best for you. What you’re looking at now really answers the question of “where” that we’ve been looking for. But what about “when”? “When” is a little more complicated. We needed Google Analytics to not just give us a summation of the “where” for the year, but also when it happened. For that we needed to create a custom report. Here’s the custom report I created. Really all you need is the Visits in the Metric Group and Metro in the Dimension Drilldowns. In a moment we’re going to apply the same advanced segment to for Non-Paid Search Traffic, but you could also do that as a part of this report’s design in the filters. I don’t because I use this report for things other than organic searches. So now you’re looking at something very much like what you had before (don’t forget to apply the Advanced Segment for Non-Paid Search Traffic) except instead of a map of the U.S. we see a nice line graph. I like to plot the line by month. It makes the trends a little easier to see. So now I filter my results to one metro at a time for each of my top metros and begin looking for patterns. Interpreting the results. Let me show you our top three as an example. The visitors from the metro of D.C. seems to start researching for their vacation on the Outer Banks starting in January and this stays consistent until June. July sees a major spike, probably you last minute vacationers, hoping they’ll find a discount. August is still good, but by September there is very little interest. You could break the report down by weeks to see the changes on a micro scale. Maybe December is actually completely dead until the last week of the month and that’s where all the traffic for that month is coming from. The metro of Norfolk has one thing in common with the metro of D.C.: they like to book at the last minute. They’re not as interested in booking early, probably because they’re in such close proximity to the Outer Banks. The metro of Philadelphia looks a lot like the metro of D.C. One major difference is they seem to like to either go ahead and book early or to book last second, but there’s not much in-between. You could use sales data to verify this. Are you starting to see how this might impact your conversion driven marketing? This tells you when people have your product on the brain. This allows you to say which months MUST be a focus and which months you would be wasting your money. This could also help you examine where you’re weak in comparison to your competitors. You could use this info to strengthen your weaknesses. You could also design some of your PPC and Facebook marketing around campaigns a single metro which would allow you to track long-term success in that area. In the end, you really have to focus on how the geographic component can impact your marketing goals. You should never use this data to set your goals. This technique only informs us of what is, not what should or could be. Good marketers set trends and transform the “what is” into the “what should be”. A few last thoughts I want to leave you with. Consider other uses of geographic component you could achieve based on further filtering. For example, examining the mobile vs. non-mobile usage in metros. Consider what could be influencing or skewing your data. Consider how you can use the geographic component to acquire new customers. And lastly, just because there doesn’t seem to be any interest in a metro for your product, that doesn’t mean you can’t grow there. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Stop Wasting Money on Unoptimized Advertising"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Stop Wasting Money on Unoptimized Advertising"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Terry Moore\n          \n            Terry Moore\n          \n            Terry Moore"
}