{
  "url": "https://moz.com/blog/stop-nickelanddiming-your-seo-clients-give-them-means-not-just-the-ends",
  "slug": "stop-nickelanddiming-your-seo-clients-give-them-means-not-just-the-ends",
  "title": "Stop Nickel-and-Diming Your SEO Clients: Give Them Means, Not Just the Ends - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I read a lot about what sort of advice to give to SEO clients, how to educate them about what SEO is really about, generating interesting content, etc...but how helpful is that to a client once you are no longer providing them with SEO services? If a client does not have the means with which to…",
  "content": "Stop Nickel-and-Diming Your SEO Clients: Give Them Means, Not Just the Ends SEO Tools A By: Alhan Keser November 13, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! A By: Alhan Keser November 13, 2008 Stop Nickel-and-Diming Your SEO Clients: Give Them Means, Not Just the Ends SEO Tools This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I read a lot about what sort of advice to give to SEO clients, how to educate them about what SEO is really about, generating interesting content, etc...but how helpful is that to a client once you are no longer providing them with SEO services? If a client does not have the means with which to perform all of the tasks that you just advised them on, then they will continually need to rely on you for all on-site SEO edits they may wish to make later down the road, once your SEO contract is through. Give them SEO tools that will put their knowledge to good use. Below are a few tools that an SEO company should be able to provide their clients (along with the proper instructions on how to use them). These features are readily available in most generic content management systems, but often lacking in custom-built ones. Meta tag editing: The client should be able to change title tags, meta descriptions, and the robots tags at the very least. Editing internal link anchor text: Every time a new page is added, the client should be able to customize their internal navigational text that links to the page. Editing URLs: If you have already built a URL-rewrite engine (probably before Google said that it wasn’t that important), then it would be great to give your client the power to edit the URLs of new pages. 301 redirecting dead URLs: Say your client runs an e-commerce website with products that are constantly removed or added. If a certain product acquires a few juicy inbound links then is taken off the site, that sucks. To not lose any of the link juice, create a script that automatically adds a 301 redirect to the .htaccess file so that the removed page is redirected to a relevant page (such as the product's category page). Adding analytics / conversion tracking: The client should be able to add their own site analytics tracking if they wish to, as well as Adwords conversion tracking to concerned pages. Addition of nofollows: If you have indeed given proper training to a client, they should know what links to nofollow. Allow them to add nofollow attributes where they see fit. This is a bonus feature that I don’t see as being compulsory, but it depends on the client and type of website they run (as well as whether you believe in internal nofollows or not). All of these tools are things that would not only help a client, but help you during the SEO process to quickly and easily make changes to your client’s website. What types of tools do you give to your clients so they don’t call you every week with new SEO requests? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Stop Nickel-and-Diming Your SEO Clients: Give Them Means, Not Just the Ends"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Stop Nickel-and-Diming Your SEO Clients: Give Them Means, Not Just the Ends"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "How to Build Your Own SEO Chrome Extension With ChatGPT"
    },
    {
      "level": "H3",
      "text": "Understand Brand Strength With Moz Pro – Next Level"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Alhan Keser\n          \n            Alhan Keser\n          \n            Alhan Keser"
}