{
  "url": "https://moz.com/blog/story-and-strategy-one-of-seomozs-secret-shoppers",
  "slug": "story-and-strategy-one-of-seomozs-secret-shoppers",
  "title": "Story and Strategy: One of SEOmoz's Secret Shoppers - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As a respondent in the recent SEOmoz PEPS case study project, my team and I had the chance to evaluate our digital marketing strategies and practices. In this post, I share our experience as a participant in the study and highlight the strategies that moved us into the top five respondents.",
  "content": "Story and Strategy: One of SEOmoz's Secret Shoppers Moz News J By: John Cashman October 3, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! J By: John Cashman October 3, 2012 Story and Strategy: One of SEOmoz's Secret Shoppers Moz News This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Last week, we received a long-expected email from a lead we had been chasing. The lead was Kurtis from an organization called PEPS.org. For the last few months, we had been following up with Kurtis to enquire if he had made a decision on using our company, Digital Firefly Marketing, for SEO services, so we were excited to hear back and hopefully land the gig. While sitting in a rented car on the top of the Marin Headlands, we received the final email from found out that our lead Kurtis was not actually Kurtis. Imagine our surprise! Kurtis turned out to be Ashley Tate, Kurtis Bohrnstedt, and Ruth Burr from SEOmoz, and we were on SEOmoz candid camera. We had been part of a SEOmoz case study to test the aptitude of today's SEO consultants, and our team had been chosen as one of the finalists in the proposal to help optimize the PEPS site. Our selection for the top five lead to a linkback on the SEOmoz blog titled, \"How Many SEO Consultants Actually Know What They Are Talking About?\" Needless to say...a link from SEOMoz...little bit of a traffic spike. Thank goodness for linode! But how did we get to this place over the last few months? How is our core marketing strategy reflected in SEOmoz giving us a high five for being a knowledgeable SEO firm? To that end, we dug through our emails with Kurtis (aka Ashley, Kurtis, Ruth, and team) to map out how we were approached by PEPS and how we answered their questions. We compared our responses with our digital marketing strategy and were able to see why the outcome ended up playing in our favor. This post highlights the emails and gives you a peek into the marketing strategy we follow. Email #1: July 24, 2012 - Kurtis' \"Introductory Email\" Hi, I found you guys via Google search and am seeking some help on SEO. I work with the team at http://www.peps.org. We've got a number of marketing goals this year and some budget to achieve it. Before we start down that path, I was hoping you could answer a few quick questions: Do you see any quick areas for improvement? Are we doing anything really wrong or dangerous? We've been hearing a lot of talk about the \"Panda\" and \"Penguin\" penalties from Google. Can you explain what these are? Are we at risk for these penalties? How can we tell if we've been hit? We have the opportunity to buy some domains that relate to our services, like ParentSupport.com. We were thinking of building a second version of our site on a .com site that is more related to our services. Is it better to have a .com or a .org domain? How can we leverage buying other domains that have to do with our services to help get more SEO traffic? We get lots of emails from people wanting to trade or exchange links with us. Should we be saying yes? Will this help with SEO Thanks very much - looking forward to your thoughts! Best, Kurtis We decided to respond to questions from \"Kurtis\" to see if we would be a good fit for the audit. After we received the email, we crawled the site with Screaming Frog and looked for linkbacks on OpenSite Explorer to get an idea of their site in terms of SEO. Once the crawls were complete, we sent our response: Good morning Kurtis - We took a look at your website this morning and wanted to answer your questions below. Let me know if you would like to chat on the phone. All the best, JC 1. Do you see any quick areas for improvement? Are we doing anything really wrong or dangerous? Without looking under the hood of the website, it doesn't appear you are doing anything wrong or dangerous. For the most part, unless websites are either really old and out of date or people are using bad techniques, most people aren't doing anything dangerous. In terms of quick improvement: You should put your social media channels on your homepage so people can follow you. It was hard to find your Facebook page and I couldn't find you on Twitter. You should make your content shareable by including \"like\" and \"tweet\" buttons so people can share it via social networks. Google does take these into account in its search ranking as it considers a tweet or like to be a good reference. You have 13 webpages that return a 404 error, meaning a link is broken so it goes nowhere. This doesn't hurt you, but it won't let those pages be indexed by Google. You use your name way too much on your site. This means that Google will index your page as Program for early parent support over and over again, which you rank number one for by a mile. One of the best things to do is remove that name off each page and replace it with more detailed keywords about the web page so Google know exactly what the page is about. This goes to the heart of SEO, which is the keyword. We always start with a goal...what do you want to do with the website? Sell stuff? Inform people? Make ad revenue? Once the goal is determined, we start looking for keywords via Google's keyword tool that already have a lot of searches and low amount of competition meaning there aren't a lot of websites with that information. We then swap out the keywords and have Google recrawl your site so you can get indexed for those searches as well. 2. We've been hearing a lot of talk about the \"Panda\" and \"Penguin\" penalties from Google. Can you explain what these are? Are we at risk for these penalties? How can we tell if we've been hit? Google uses a number of factors in how it ranks people in search. Over the years, they have made a number of changes to the algorithm to improve its quality and keep people from gaming the system. The first update was code named Panda. The Panda update is meant to deliver people from Google to what Google deems \"quality\" sites. These are sites that are well structured, have links both in and out of the site, have a lot of people going to the site and staying on it. Panda doesn't really give you a penalty, per se. What it does instead is reward websites that create original material ahead of those who just repost and link out. You can tell if you have been effected by Panda if your Google Organic traffic suddenly drops. If you don't see a drop in Google traffic, you are fine. Penguin is a little different. This update to Google's search was designed to go after techniques that Google considers \"black hat.\" They include doing things on your website like putting tons of keywords in white onto a page that a user can't see, but Google's search spiders can see, or putting the same piece of content on your site over and over again to make it look bigger than it really is. 3.We have the opportunity to buy some domains that relate to our services, like ParentSupport.com. We were thinking of building a second version of our site on a .com site that is more related to our services. Is it better to have a .com or a .org domain? How can we leverage buying other domains that have to do with our services to help get more SEO traffic? There is nothing wrong with buying more domains. Having a .org, .com, or .us doesn't make a big difference in the SEO world. The only domains that do matter in this regard are .edu and .gov as those are considered sponsored and will only link for reference sake, which sometimes happens and sometimes happens when you do a marketing project with a .edu domain. I don't think you will get a lot of traction from another site based on .com. I would redirect those domains to your core site. Having a second version of the site can now actually do more harm than good because Google Panda will see the sites as having the same content. Where you may want to focus if you are building another site is to look in Google Analytics to see which countries generate the most traffic and develop international versions of the website and deploy them in country. This will give you a lot more Google traffic in those areas; after all, every country has parents! 4. We get lots of emails from people wanting to trade or exchange links with us. Should we be saying yes? Will this help with SEO? No. Google uses something called PageRank that will rank a website v. other sites so it know whether or not that website is considered an authority or not. The scale is logarithmic so every time you go up a number, it's ten times harder to get to the next number. Your site has a MozRank, which is an approximation of Page Rank of 6, which is a great number. Google views your site as an authority on the subject, which is why you are getting emails asking people to link from your site. So unless you get someone with a higher rank, it's really not going to do a whole lot for you. The best thing to do is create content and posts that people will link to and at the same time link to people that you find interesting or want to reference some important data. The PEPS Project is Revealed Over the next two months, Kurtis let us know that we had made the cut and sent over a proposal for an SEO audit of their site on August 10, 2012. Over the last six weeks, we contacted Kurtis twice to follow up and see what stage the proposal was in. Last weekend, we finally discovered that Kurtis was, indeed, the SEOmoz team. In all honesty, our initial reaction was disappointment because we had not won the deal and we had been duped into participating in a blind case study. However, after the initial disappointment wore off, we realized that this was a great opportunity for our team. We also reread the email and saw the word \"link,\" and that made us feel a bit better. The blog post went up, a link to our site was included, and we saw our traffic spike. Overall, it was a great decision for our team to participate in the study. Looking through the blog comments, I even find it somewhat baffling that some people would withhold information from a prospective client about how to rank on Google, or not even respond to their initial questions! You do need to sell your services in order to pay yourself and employees. Attracting and closing your leads is key. So, how do we attract leads from companies like PEPS and close them? By following a specific digital marketing strategy and executing on its tactics. Our Digital Marketing Strategy Our aim is to always try and convey our knowledge around SEO to any lead that approaches us, and to give them a warm and fuzzy feeling in proving that we have the skills to do the job. The below chart is one we use ourselves and recommend to all of our clients. The chart lays out a fundamental strategy to drive traffic to a website from a wide variety of sources so that they convert into a lead. SEO is part of that strategy under both owned media and earned media. Owned media is the content you create on your site, like blogs, galleries, and products, while earned media are links, likes, and retweets you earn from sources you don't control to help boost your website in Google. Digital Marketing Tatics The strategy is only one piece of the puzzle. Execution of the strategy are the tactics you need to use in order to attract and close deals. We use the following marketing tactics to attract and engage our clients: We blog 2-3 times a week and only on digital marketing subjects. Typically, our posts are based around steps to take to accomplish something that clients are looking for. We update social media at least once every 18 hours, even if it's just a quick status update. We try and post more links, videos, and photos than just text. This keeps us tat the top for our Facebook, Twitter, and Pinterest audiences. We offer free eBooks on all the marketing we do to show how knowledgeable we are about the subject. However, to get the book, a prospective client needs to provide an email address. We market back to those email addresses if it makes sense later on. We offer free audits of any website, social media presence, or email marketing. This allows us to show clients how we might fix their website or Facebook page so that they get an idea of what needs to be done. It also gives us a chance to show our knowledge and skill around these areas of marketing. All emails are stored in Highrise and tracked via Google Analytics on conversion forms. This way, we can analyze whether or not our own marketing efforts are making a difference and where they are working. It also allows us to track all the pending deals we have and set reminders to follow up in two weeks, a month, or three months, depending on the prospect. While the tactics drive the strategy, our underlying philosophy as a company helps drive the communication with our leads and prospects. In our way of thinking, explaining how SEO works to a prospective client creates a more educated client. It's a win-win for them and for us. We continually use this philosophy on all levels for marketing and interaction. We give free advice to any lead that comes our way on some of the best ways to rank in Google or have their posts go viral on Facebook. If they want to use this advice and run their own marketing, they do so with our unabashed support and enthusiasm. However, typically we see that once people understand we have a skill set, they choose to bring us on as a partner rather than as a company that is treated as a cost. Thanks again to Ashley, Kurtis, Ruth, and the SEOmoz team for including us in their case study, and congrats to Dave and team at BeanstalkSEO on winning the PEPS audit. Hopefully we can see his answers here as well! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Story and Strategy: One of SEOmoz's Secret Shoppers"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Story and Strategy: One of SEOmoz's Secret Shoppers"
    },
    {
      "level": "H2",
      "text": "Email #1: July 24, 2012 - Kurtis' \"Introductory Email\""
    },
    {
      "level": "H2",
      "text": "The PEPS Project is Revealed"
    },
    {
      "level": "H2",
      "text": "Our Digital Marketing Strategy"
    },
    {
      "level": "H2",
      "text": "Digital Marketing Tatics"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "John Cashman\n          \n            John Cashman\n          \n            John Cashman"
}