{
  "url": "https://moz.com/blog/storytelling-site-content",
  "slug": "storytelling-site-content",
  "title": "Storytelling 301: Site Content as Story - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "\"Storytelling\" can be more than just jargon. This post will show you six types of stories you can inject into your site content to develop a compelling, powerful brand story.",
  "content": "Storytelling 301: Site Content as Story Content Marketing | SEO Copywriting By: Isla McKetta July 14, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Isla McKetta July 14, 2016 Storytelling 301: Site Content as Story Content Marketing | SEO Copywriting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Feel like you're already over the term \"storytelling\" without ever really having understood how you can successfully apply it to your writing? You aren't alone. Like so much jargon, this amazingly powerful and useful word is in serious danger of being consigned to LinkedIn profiles and marketing parody. Even storytelling guru Annette Simmons is over the way we're teaching storytelling as a content cure-all. \"We need to stop 'telling stories' that oxytocin or the magic of a 'narrative arc' explain storytelling. It’s much bigger than science can explain. Storytelling is an art – subjective, emotional, and as variable as humanity is diverse.\" - Annette SimmonsWe can do better. Instead of yet another \"stories=good\" post, today we're going to apply the logic of storytelling to site content. After you've read the last word, you should have the tools you need to draw a concrete map of how to tell your brand \"story\" with site content. Note: I'm not knocking storytelling here. I'm a novelist. That's illegal. I am knocking throwing the latest buzzword at our marketing and pretending like using the word makes us better at our jobs. Why storytellingI promised not to flog you with the \"stories are engaging so be engaging by telling stories\" line, but if we dig just a little deeper we can understand one of the concrete arguments for storytelling: persuasion. In her compelling book, The Story Factor, Annette Simmons reminds us that we can throw facts and figures at people all day long, but stories hold the real power to change someone's mind. \"Your story needs to take [potential customers] on a tour of the aspects that step by step convinced you to believe so they can step by step come to believe the same things\" - Annette Simmons Take a moment to check this against your own experience. When was the last time someone truly shifted your perspective? If they did so using anything other than a story, it's okay to stop reading here and find a tactic that you think will work better. But my guess is that some sort of story was involved. The six types of storySimmons outlines six types of stories we can use as humans and marketers to overcome objections: \"Who I am\" stories and \"why I am here\" stories establish the groundwork you need to build trust with your audience. They naturally assume you're in it for yourself and these stories allow you to share your motivations. If you get human enough, your audience might find common ground on which to connect with you. Vision stories tell how things could be. This type of story shows your audience what's in it for them. If you're holding an all-hands meeting, your vision story might include a tale about how the company has triumphed over obstacles in the past. If you're marketing a product, your vision story might speak to a future state where a problem (that your product solves) no longer has to exist. Teaching stories give your audience an opportunity to learn from a mistake without ever having to make it. They also help you shape that audience's understanding of the potential solutions available to them. For example, if I were to tell you that a site audit can help you understand all the content resources you have available to you and use Moz Content as my auditing tool, I'd be pointing you in the direction of a solution for you and also making it easy for you to choose our solution. Values-in-action stories are similar to vision stories and teaching stories, but they focus on the core values you want to reinforce and provide examples. Simmons suggests focusing on positive value stories rather than \"war stories.\" One way to do this would be if a wedding dress company that prided itself on proper etiquette wrote a blog post about a bridal consultant who hand-wrote a thank-you card to every bride who purchased a dress from her. The final type of story, the \"I know what you are thinking\" story, allows you to neutralize concern without that concern ever being raised. It's relatively easy to anticipate an objection from your audience and to use this kind of story to get ahead of it. Applying storytelling to site contentThis is where I wish I had a gorgeous illustration of the marketing funnel and that I could neatly fit these six story types in and presto change-o, poof! Your site content is perfectly optimized for storytelling and conversion. Alas, life is a little harder than that. But we can get a good sense of which types of content are best for telling which types of stories. I'll use Moz as an example because that's close to my heart. Who we are and why we're hereMoz is about three things: helping people be better marketers, building a strong community, and being TAGFEE. Free educational content has been a huge part of who we are since the very beginning when Rand was blogging about everything from the Google Link Command to Sandbox. That strong community is here because all of you make it happen, and because we work to make TAGFEE happen every day. You can see our desire to help people be better marketers and to connect with the community right up at the top of our site. Click on \"Learn & Connect\" to bring down a bucket of resources like our beginner's guides to SEO, Content Marketing, and Social Media, as well as our webinars, blog, and Q&A. We also share who we are on our about, TAGFEE, and team pages. You'll note that all of this content is front and center because it helps our audience get to know us. Our audience becomes acquainted with our slightly quirky personality through our voice and the style of our imagery. We put our values out in the open for all to see so we can hold ourselves accountable and so our audience can know what to expect. And you can tell a lot about Moz by the fact that everyone who wants to be is listed on our team page (not just a selection of the top execs) and that each individual Mozzer's page has their own voice. Help your potential customers get to know you by sharing \"who you are\" and \"why you're here\" stories in the content and form of your home, about, and team pages. Our visionThe homepage is a perfect place to introduce an audience to your vision story: But to really shape their expectations about what life could be like if only they'd use your products, you'll want to flesh out that vision story in content such as product descriptions and white papers. Notice that all the vision stories, no matter where they are on the site, elaborate on and reinforce the same vision. Some pieces will speak to a greater ecosystem and others will pinpoint how your products bring that vision to life. Which role they play depends largely on where that piece of content sits in your funnel. TeachingYou're reading teaching story content right now. I'm not trying to sell you anything at all, but I am trying to give you a new way of thinking about the work you do — to help you make better marketing. I'm also, on a meta level, teaching you about how Moz thinks about marketing, including how we see value in going beyond superficial monikers like \"storytelling\" and \"keywords\" to provide actual applied insight. Although I mentioned our beginner's guides as \"who we are\"-type stories, they are also teaching stories. You may have noticed that we don't have a beginner's guide to pay-per-click advertising. That's not because PPC isn't important, but it is because our story is about the difference you can make with SEO, content marketing, and influencer marketing. Big content can also be part of your teaching story. We use our Search Ranking Factors and Local Search Ranking Factors surveys to explore and share the changing nature of search, which helps focus our potential customers on asking the right questions about ranking better (instead of \"where can I buy links?\"). Mozcast plays a similar role by pointing people's attention to potential signs of shifts in Google's search algorithm. It is a useful tool, yes, for monitoring and predicting the search climate. It's also a story that teaches how much the algorithm changes and that SEO is not a one-and-done project. Depending on who you are, your teaching stories might help your audience see fashion from the lens of accessories, understand that the value of your products is in sending matching items to the developing world, or see how essential connection speed is to saving money. Shape that conversation on your blog and in your big content. Values in actionOur blog also tells values in action stories. We do this both through the teaching that is so core to who we are but also through the tone of content on the blog. This goes back to TAGFEE. Rarely (if ever) will you see a brand or competitor called to the carpet on our site. And our product and company updates are just as likely to tell you the ugly side of why we made the improvement as they are to celebrate the update, like this announcement of Keyword Explorer: You'll also find values in action stories in our help documentation as we try to provide straightforward but fun information to help you be the best marketer you can be. Demonstrate your values in action by telling the story of efficient project management with a datasheet that doubles as a purchasing checklist to help your buyer overcome internal objections. Or teach your customers how to use the spices you sell by turning help documentation into recipes. We know what you are thinkingWow, that's a lot of talk about us. Most of our audience would be wondering right now if we can really live up to that hype. That makes this the perfect moment to share a \"we know what you are thinking\" story. Some of the best site content forms for putting the proof in your pudding are social proof (in the form of testimonials) and case studies. Your turnReady to put storytelling into your site content? The framework is universal, but the application of it will be very individual to your experience. I'd love to hear how you've incorporated these six types of stories into your site, along with what's working for you and what isn't. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Storytelling 301: Site Content as Story"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Storytelling 301: Site Content as Story"
    },
    {
      "level": "H2",
      "text": "Why storytelling"
    },
    {
      "level": "H2",
      "text": "The six types of story"
    },
    {
      "level": "H2",
      "text": "Applying storytelling to site content"
    },
    {
      "level": "H3",
      "text": "Who we are and why we're here"
    },
    {
      "level": "H3",
      "text": "Our vision"
    },
    {
      "level": "H3",
      "text": "Teaching"
    },
    {
      "level": "H3",
      "text": "Values in action"
    },
    {
      "level": "H3",
      "text": "We know what you are thinking"
    },
    {
      "level": "H2",
      "text": "Your turn"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Isla McKetta\n          \n            Isla McKetta\n          \n            Isla McKetta"
}