{
  "url": "https://moz.com/blog/strategies-for-administering-client-google-analytics-accounts",
  "slug": "strategies-for-administering-client-google-analytics-accounts",
  "title": "Strategies for Administering Client Google Analytics Accounts - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This past year, while saving up for my wedding, I completed a large number of freelance Google Analytics jobs. In doing so, I had to deal with many different problems which arise when you are working on Google Analytics accounts for a large number of clients. This post details some of the solutions…",
  "content": "Strategies for Administering Client Google Analytics Accounts SEO Analytics By: Benjamin Alvord February 14, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Benjamin Alvord February 14, 2013 Strategies for Administering Client Google Analytics Accounts SEO Analytics This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. This past year, while saving up for my wedding, I completed a large number of freelance Google Analytics jobs. In doing so, I had to deal with many different problems which arise when you are working on Google Analytics accounts for a large number of clients. This post details some of the solutions I found. Gaining Access to Client Accounts When you begin working with a new client, ask them to add your Google ID onto their Google Analytics account as an administrator (don't have a Google ID? Create one). The client can add you by: Clicking 'Admin' at the top right of the Google Analytics interface. Clicking into the profile that they want to give you access to. Clicking the Users tab. Clicking the '+ New User' button. Do not ask the client to just hand over their own login credentials to you. Most clients will be happy to do so, but the majority of those clients don't seem to realize that in doing so, they are also giving you access to their Gmail account and any other Google product being used under that login. As a consultant, if you have never had access to their account, they can't try to blame you when someone racks up $5,000 of unapproved charges on their AdWords account (and yes, this did happen). Dealing with Custom Dashboards and Reports Within Google Analytics, all custom dashboards and reports are tied to individual Google Account IDs. What does this mean? It means if I log in to Google Analytics with my personal Google ID, access a client's account and create a custom report for them, when the client then logs in to Google Analytics under their own Google ID, they will not see this new custom report. Basically, as a user of Google Analytics, you can only see custom reports and dashboards that have been setup while logged in under your own Google ID. So if we're not asking clients to give us their login credentials, how do we get custom dashboard and reports setup for them? We share. Sharing Custom Dashboards To share a custom dashboard, navigate to the dashboard in question and click the 'share' button, highlighted in red below. Clicking 'share' triggers a lightbox like the one shown below. That highlighted link is what you need to share with your client. When the client opens that link in a browser and logs in to Google Analytics, they'll see something like this: Once the client chooses the profile they want to use the custom dashboard on and clicks 'create', the dashboard will be visible within their own account. A few miscellaneous notes on the sharing of custom dashboards: If you are sharing a custom dashboard that itself includes custom reports, you do not need to also share the individual custom reports. If you've already shared a custom dashboard with a client and you then modify that dashboard under your own login, the client's instance of the dashboard will not change. Vice versa, if the client modifies the dashboard after you've shared it with them, their changes will not appear on your original version of the dashboard. For some easy money, spend a lot of time creating an awesome custom dashboard for one client. Then when you get more clients, charge them X amount of dollars for a 'custom' dashboard and share with them the one you previously created. Sharing Custom Reports Sharing a custom report is very similar to sharing a dashboard, but access the actual share button is different. For custom reports, first click the 'Customization' tab in the interface. You'll be brought to a screen listing all of your custom reports. Next to each report, you will find a button for 'actions'. Click that, and select 'share', as shown below: Following this, the remaining steps all match what happens with custom dashboards. A lightbox launches with the share link. When the client visits that link, they must pick which profile they want to display the custom report in, and that's it! Scheduled Emails Many clients want to have reports and/or dashboards from Google Analytics emailed to them on a daily, weekly or monthly schedule. Setting these emails up is quite easy, described here. There are, however, some hidden potential problems with this process as well. When the scheduling of emails is setup under your own Google ID, the client does not have access to that scheduling (much in the same way that they don't have access to custom dashboards and reports before you share them). They will receive the emails, but they won't be able to alter anything about them down the road. If the client removes your access from their Google Analytics account, any emails that you scheduled for that account will cease to be sent out. Emails that you setup under your login will be sent to the client 'from' your login email address. This means if the client replies to one of the emails, it goes to you. Because of note #3 above, I tend to try and explain to clients how to setup scheduled emails themselves. Otherwise, clients will respond to the emails asking things like, \"Hey, how come my organic search traffic is dropping like a rock?\", which would be fine, except clients will send these 'quick questions' six months after your project with them is complete, expecting you to answer their questions for free. Relinquishing Access to Client Accounts I completed approximately 125 separate Google Analytics projects last year, and for almost every one of those projects, I was given admin access to a Google Analytics account. If you're anything like me, leaving dozens and dozens of dormant client accounts sitting there on your 'Account Home' page drives you nuts. You might be thinking, \"He should just click the 'Remove My ID From This Account' button!\" Sorry, that button doesn't exist (Are you there Google? It's me, Ben. Pretty please can you add that button for us?) The easiest solution to this problem, of course, is to have your client remove your access from the account when your project is complete. There are many reasons why this might not be feasible however. Maybe your client is a bit of a jerk and you'd rather not communicate with them anymore. Or maybe the client contact you worked with left the company and now no one there knows what the login is. Or who you are. There are many reasons, so here's what I do: Create another Google Account ID, calling it something like 'please.remove.me@gmail.com'. We'll call this our 'auxiliary ID' (because I enjoy the word 'auxiliary'). Open up two different browsers (i.e. Chrome and Firefox) with one logged in to your personal account and the other logged in to your auxiliary account. In your personal account, provide your auxiliary ID with admin access to the client account. If the client account has any custom dashboard or custom reports setup within it, share them with your auxiliary account using the methods described previously. If you setup any scheduled emails for the client account, set them up again under the auxiliary account ID. If you don't do this, the emails will cease to be sent when we complete step 6 below. In your auxiliary account, go to the Users admin screen. We want to remove our personal ID from this account now, but you'll see that the link for 'remove' is greyed out. Click 'settings' for your personal ID, change the role to 'User' and save it. Now return to the user admin screen and remove your personal ID from the account. Done! Wasn't hard at all, am I right? No? I'm totally wrong? That was a royal pain in the ass? \"Hey Google, we need a 'remove me' button ASAP!\" What if the Client Changed My Role to 'User'? So the client changed your access level to user when the project ended, and now they won't respond to your emails or just remove you from the account. What do you do? Cry for a little bit. It's okay, let it out. Go to a four-year-old thread in the Google forums and complain along with all the other ignored people. The best way to handle this for now is to utilize the ability to 'star' certain accounts and profiles on the Account Home page, like this: Once you have starred all of the properties that you want to see on your home screen, click the star at the top of the interface to filter out the 'unstarred' properties, like this: Hopefully this post will help some of you better organize your client accounts and enable you to spend more time on analytics and less time on these sorts of headaches. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Strategies for Administering Client Google Analytics Accounts"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Strategies for Administering Client Google Analytics Accounts"
    },
    {
      "level": "H2",
      "text": "Gaining Access to Client Accounts"
    },
    {
      "level": "H2",
      "text": "Dealing with Custom Dashboards and Reports"
    },
    {
      "level": "H3",
      "text": "Scheduled Emails"
    },
    {
      "level": "H2",
      "text": "Relinquishing Access to Client Accounts"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Benjamin Alvord\n          \n            Benjamin Alvord"
}