{
  "url": "https://moz.com/blog/straight-to-youtube-wetpaint-does-viral-video",
  "slug": "straight-to-youtube-wetpaint-does-viral-video",
  "title": "Straight to YouTube: Wetpaint Does Viral Video - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Seattle-based wiki website Wetpaint have always done things a little differently to most wiki providers. With a highly user-friendly interface, Wetpaint lets even the most technically-uninclined people create websites. The sites, which are of course all wikis, can either be hosted at Wetpaint or on…",
  "content": "Straight to YouTube: Wetpaint Does Viral Video Social Media By: Jane Copland October 29, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jane Copland October 29, 2007 Straight to YouTube: Wetpaint Does Viral Video Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Seattle-based wiki website Wetpaint has always done things a little differently to most wiki providers. With a highly user-friendly interface, Wetpaint lets even the most technically-uninclined people create websites. The sites, which are of course all wikis, can either be hosted at Wetpaint or on a separate domain. While the company doesn't appear to have any plans to take its marketing campaigns to television yet, it has released seven videos on YouTube that fall into a relatively new breed of viral marketing. These videos use professional studios and teams, just like made-for-television commercials. However, they're meant for online eyes only. Usually, viral videos aren't exactly hot on the production end. You have your wonky camera work, following a guy who's shouting just loud enough to be heard over the nearby freeway, gusts of wind and neighborhood lawn mowers. It's pretty impressive when they manage the cute cuts and fades. Our Whiteboard Friday videos put most YouTube uploads to shame, and most of the professional videos you see online were made for TV and put in the Internet as an afterthought. Wetpaint, however, has deliberately filmed TV-quality content for the Web. Obviously, these videos join the throngs of Mac / PC parodies, and they also spoof eHarmony's sickening commercials. This isn't particularly new, although the points they make about the difference between traditional wikis and Wetpaint are totally valid. One problem with relying on viral video as a promotional source is that there are few scheduled ad breaks on the Internet. Ads are everywhere, and when we're faced with an ad that shoots onto the screen and asks us to \"skip advertisement and go straight to article,\" we get frustrated. For the most part, we ignore online commercials because they're everywhere. With Tivo and generic DVRs, we're getting to the same stage of ad-ignorance on television. This is why online and offline ads have to be particularly creative in order to catch our attention. I remember being shocked at the low-quality television commercials when I moved to the U.S. in 2002. For some reason, the New Zealand television commercial market got very competitive in the late 90s and watching the ads was often more entertaining than watching the shows. This stunner of a commercial brought an antiquated swear word to the mouths of every Aussie and Kiwi. Our anti-drunk driving commercials (and other road safety ads) would be rated strictly NC-17. Air New Zealand always made really neat 30-second mini-movies for our entertainment. I came over here and was devastated at the ad quality. In the wake of fast-forwarding commercials, American ads are improving remarkably, but I still miss the delight of Kiwi commercials! The need to be competitive and different is especially important online. When was the last time you took notice of Adsense, let alone clicked on it? I clicked on an Adsense ad this morning, but it was only to find out what \"BUI\" meant, in relation to \"DUI\" (FYI, it means \"boating under the influence\"). Anomalies like this aside, we've become accustomed to tuning out boring ads in the same way we don't watch the very tame All State car accidents (in comparison to the Kiwi ones - don't make me link to these little horror films). Wetpaint's campaign, while not totally original, is a smart move in that their videos are accessible to people who are already online and who may want to check out their site, and they are not paying for an expensive television slot where totally dis-interested people will gaze at the ad and wonder, \"what's a wiki?\" This is the first time I've written about viral video because I have very little experience with it and it interests me a lot. I find Wetpaint's approach interesting, and I'm sure there is more to be made from the medium, given the desensitisation we have to all forms of advertising. If you managed to make it to the end of this post without getting lost in the joys of YouTube, thanks for your stoic attention span. On the Linkbait panel that I'm taking part in at SMX London, Ciarán Norris will be presenting on the subject of video bait. I'll probably sit there in front of the crowd and shamelessly take notes along with everyone else. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Straight to YouTube: Wetpaint Does Viral Video"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Straight to YouTube: Wetpaint Does Viral Video"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jane Copland\n          \n            Jane Copland"
}