{
  "url": "https://moz.com/blog/structured-social-sharing-formula-whiteboard-friday",
  "slug": "structured-social-sharing-formula-whiteboard-friday",
  "title": "Structured Social Sharing Formula - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Sharing content via social media is simply the next step after hitting the \"Publish\" button. Today's Whiteboard Friday outlines steps to take to ensure your shares on Facebook, Google+, and Twitter are optimized for success.",
  "content": "Structured Social Sharing Formula Whiteboard Friday D By: DanaLookadoo September 14, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! D By: DanaLookadoo September 14, 2012 Structured Social Sharing Formula Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Sharing content via social media is simply the next step after hitting the \"Publish\" button. How do you ensure your shares on Facebook, Google+, and Twitter are optimized? With a little planning and coding, you can make them look their best so that they go viral and track effectiveness in analytics. In this Whiteboard Friday, Dana Lookadoo unpacks the Structured Social Sharing Formula (SSSF): 10 steps for optimizing Web pages and social shares. The process includes: Marking up pages with microdata (Open Graph Protocol) Best practices for formatting How to find and use hashtags Tagging URLs to track social referral data in analytics Keep an eye on the blog next week for a supplemental post from Dana offering detailed steps from her Community Speaker presentation at Mozcon 2012. To learn more about social markup and tagging, download the free Structured Social Sharing Formula worksheet! Video Transcription \"Hi Mozzers. All right. What we're going to talk about today is the structured social sharing formula, and I'm going to go over 10 best practices for rocking your SEO with a markup and how this is going affect Google+ and Facebook. So I'm going to run through these, and then we'll delve down a little bit. So the first of your five items that you would cover are actually going to do with meta tags that are Open Graph protocol. We have the title tag and the description and the OG image and the type of the website and the URL. Actually, in five of these, four of these are required. The title is one of the first required items, and we're going to break down that in a moment The meta description is not required, and the image is going to actually become your thumbnail image. The type has to do with your website type, and that's going to actually be default. If you don't put anything in there, they're going to assume that's a type value. The other values that you can look at are author, profile, book, video, and you can look more at OGP.me if you want to look up more about types. On your URL, that's your canonical URL. So it's your permalink. So that's pretty easy. Then we're going to go over your UTM variables so that you can track your campaigns, and that way you're going to make sure that you're getting your social referral data. We'll talk about your share blurb that goes on Facebook and Google+. Hashtags, we're going to delve into a little bit on best practices. We can't do a demo on here, but at least you'll get an idea of what to do and what not to do. Moving into the best practices for Twitter and then best of all on how to document and track this. I'm going to save that for last. So in looking at that, let's break this down. So if you look over here, we have the anatomy of a share snippet. The elements on Facebook and Google+ are the same. You have your avatar, and then you have your name. So it's starts out with your share blurb about the post, and then as move into this, you're looking at . . . okay, here's your title tag, which is actually controlled right here by the OG title. That actually becomes an anchor link to your page, to your URL. So keep in mind those two are related. Then your description, this could be your meta description from your page. You may want to copy it, but you're not limited to the same amount of space. So you have about 188 characters or less before Google+ will cut that off. Interestingly I have seen last week that about 453 characters on a description. So I don't know if Google is testing things or if I'm part of that test group, but keep it around 188 or less. Talking about length on the title tag, that's actually . . . I saw 134. I can't imagine a 134 title. So just follow best practices for title. I go to about 80. All right. So now we are at our image, so your OG image, and you want that to be square. You want it to be 150 x 150 is optimal. The minimum is 120 x 120. This is very important, because if you do not put in the proper image, you can actually put in the code. You could put this OG image directive in the code. Facebook will honor it. Let's say the image is too small and it's not 150 x 150. It may be 110 x 110. Then it will show up on Facebook, and you'll have an image, but Google+ either won't put anything, or they're going to draw another image to the page. If you have ads on your page, you may end up with an ad showing there instead. So this is where you can really rock your engagement because images are everything and people are looking at them. So that's important to get that right and remember how they're working. One other thing I want to keep in mind in this is we're using Open Graph here and not Schema.org, Why use two tags? We're just doing this all in one. This is an all in one formula to do it all at one time. All right. So now let's talk . . . . we're done with the five meta tags that are going to go in the head, and so let's talk actually about your UTM variables. Your UTM variables are actually going to start with you have your URL, and you're going to start with your source. So in this case, we're sharing it on Google+. Then you're actually going to use your medium. So how are you doing it? The medium here we're sharing it on social, so that's the medium. Actually your campaign, this is a Whiteboard Friday. So by doing this, you have voila your social referral data. Keep in mind this is really important because you don't get this unless . . . you're not going to see that something came from Twitter unless it actually came from the Web itself. TweetDeck doesn't send this information. So this way you can keep track and you can track all of your social shares. All right. We talked about the share blurb. But I want to go into that a little bit more, because on this share blurb, so what you're actually putting in the \"What's on your mind\" or \"What's New\" box, that's really important. Obviously, it's important for people reading it, but when this actually becomes in search plus your world for personalized search, that actually can become a SERP. So when that snippet is actually showing, guess what the title of it is? It's your blurb. So you may want to think SEO. You may want to frontload keywords. So think about this. This isn't just a blurb. There's actually some SEO benefit on personalized search. Let's talk a little bit more about hashtags. As you're entering in your description, you can type in your description and type in the # sign on Google+, and you're going to see an autocomplete. This is SEO. You're typing in \"#S\" and you can see a list of related. Start over \"#SE\" and you're going to see SEO. But what's cool with this, a little pro tip, you're going to see what the latest trends are is what people are showing. So if you want to show up within those trends, you can use the hashtags. Two more things on hashtags. Facebook, just don't do it. Facebook is not Twitter. On Twitter, you could use tagdef is one that has autocomplete. There's twubs. You can out hashtags.org. All right. So let's move back and talk a little bit more about Twitter moving on in our formula here. You want to make sure that your tweets are retweetable, but what you want to start with is you want to do your campaign variables first, then create you short URL. So you've got this. You're entering all this. It may be bit.ly or it may be a custom URL shortener, and then as you're creating that, you're going to want to create the title of your post and then the bit.ly or the short URL, your at, your by, your at profile, and your hashtag. That whole length should be about 140 minus 5 minus the length of your profile. So at that point, that gives you enough room so that you have space, and voila you've got a retweetable tweet and you have your social referral data. Okay. Last thing, document and track. I have a worksheet, and this was actually we're doing a Whiteboard Friday as part of MozCon, and I will be speaking about this tomorrow, on Friday. By the time you see this, it will be after the fact. You'll be able to download a worksheet, and that will be in the information below on the post that you will actually in that worksheet be able to enter in there will be a field for each of this information. You'll put in your campaign variables. It will automatically create your URL for you. All you have to do is cut and paste so that when you cut and paste your information into Google and Facebook, all you have to do is you could paste in your URL, and what Google and Facebook will do is they will parse the page and they'll look for those directives. You'll end up with a structured shared snippet. I think that's about it for today, and thank you very much. It's been nice.\" Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Structured Social Sharing Formula"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Structured Social Sharing Formula"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "DanaLookadoo\n          \n            DanaLookadoo"
}