{
  "url": "https://moz.com/blog/studying-for-a-postgrad-education-in-social-media",
  "slug": "studying-for-a-postgrad-education-in-social-media",
  "title": "Studying for a Postgrad Education in Social Media - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I have seen no articles on where its possible to get a postgrad Education in SEO or associated fields. And as im about to get such an education, I thought Id share what Ive found. For some time, Fullsail.com has been the only new media education player but now there are some traditional teaching…",
  "content": "Studying for a Postgrad Education in Social Media Social Media By: Firstconversion.com September 25, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Firstconversion.com September 25, 2009 Studying for a Postgrad Education in Social Media Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I haven't seen any articles on where it's possible to get a postgrad Education in SEO or associated fields. And as I'm about to get such an education, I thought Id share what I've found. For some time, Fullsail.com has been the only new media education player but now there are some traditional teaching institutions picking up online social media. I have given up my day job and will be starting the MA in Social Media at City University Birmingham in 2 weeks. Ive included an indicative overview of course contents. Remember that this is the first running of the first of its kind course, so its unlikely to be perfect first time. If you know of any Postgrad courses that I haven't mentioned, please add them in a reply. MA Social Media at City University Birmingham, UK saw this in the works about 6 months ago. At the time it was the first postgraduate course that I had seen that was even related to SEO or my day to day work as a SEO/SEM. News of the course was picked up by a few mainstream papers who took a tongue in cheek approach and called it a Degree in Facebook and Twitter. To me that sounds like a killer niche. Fast forward 6 months and I am leaving my wonderful agency in London to move to Birmingham and take a leap forward. The MA attracted me for a few reasons: 1st of its kind course at a Postgrad level - an MA will allow me to catch up in some way against SEOs who have been working in the field for 10 years compared to my 1.5.Its not going to allow me to be the best seo in the world but it may allow me to be the best seo with a relevant social media postgrad degree in the world. The world and their dog have degrees these days. MA and PHD are a must to stand out in your field I will be able to work with some New Media companies and make new contacts in Birmingham and the field in general. Drop out of the rat race, be a student, do only fun seo that interests me, party :D I thought the people I would meet on this kind of course would be damn good people to know Positives so far Following fellow students and lecturers on twitter has been interesting and a great way to get to know them a bit before meeting them. My fellow students are already contributing to the course blog at http://masocialmedia.com/ Worries so far 1st of its kind so its not going to be perfect, but I'm a believer in what you put in is what you get out and I'm getting first mover advantage anyway. The lack of focus on technical and programming skills Work, not because i will go back to being a poor student, but because I didn't want to spend a year away from SEO. That would be 1 foot forward and 2 feet back. But it looks like I will be able to pick up quite a bit of work from contacts and companies I know (and you, yes you, can soon find my details in the SEOmoz jobs section - Im happy to write SEO optimised copy or do 1 off site reviews and business plans) INDICATIVE COURSE CONTENTS Social Media as Culture: This is a theory module which explores the current state of academic knowledge and debates around the emergence of social media that inform an understanding of related practices conceptualised as cultural. It will provide you with a systematic understanding of the approaches to studying social media culture and its social and cultural role and character. Media Enterprise: This module explores media production as enterprise. Whether establishing a new business for their own independent practice, or selling social media concepts into an established business, social media workers are by nature entrepreneurial. This module will also explore social enterprise and funding for social projects. Social Media Practice: This production module explores social media as an area of media practice in social enterprise, commercial, public and personal areas. In this module you will consider the different areas of media, cultural and creative production that come under the auspices of social media. You will explore the production practices and skills that this involves, and begin to develop your own professional practice through a range of production activities. Production Lab: This module prepares students for research by practice, developing skills required to complete the MA by practice. MA by practice: Not sure exactly what this will entail :) Other relevant education FULLSAIL.com MA Internet marketing Lots of banner ads about from Full Sail recently about their new postgraduate Distance course. I did look at them initially but they looked like a spam online college or a place only for young kids with rich parents. Of course forcing me to buy an Mac as part of my course was never going to fly anyway. MA Social Media at University of Salford in Manchester A recent development but not much info at the moment. Can follow them https://twitter.com/salfordsmc . The course details dont look very inspirational SETH GODINS ALTERNATIVE MBA Wow. That post was inspirational reading. An alternative MBA program. Unaccredited, residential, free and six months long. No official MBA award, but working closely with Seth to get your dream off the ground. Looked like a once off, but worth keeping an ear to the ground if he does another.If anyone has any experience of FullSail or the Seth Godin MBA please comment. Looking forward to letting you all know how it goes through this year and maybe introducing some course mates to SEOmoz. Student Discount Does SEOmoz gives student discount? No company paid for SeomozPro for me anymore and there's that tasty SEOmoz London pro training on 19 & 20th October... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Studying for a Postgrad Education in Social Media"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Studying for a Postgrad Education in Social Media"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Firstconversion.com\n          \n            Firstconversion.com\n          \n            Firstconversion.com"
}