{
  "url": "https://moz.com/blog/stumbleuponcom",
  "slug": "stumbleuponcom",
  "title": "StumbleUpon.com - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Anybody getting good traffic from StumbleUpon.com?  That site first started getting my attention a few months ago while examining my logs.  I didn't think that it would be a serious source of traffic but the referrals have gone up and now I am avera...",
  "content": "StumbleUpon.com Moz News E By: EGOL January 28, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! E By: EGOL January 28, 2006 StumbleUpon.com Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Anybody getting good traffic from StumbleUpon.com? That site first started getting my attention a few months ago while examining my logs. I didn't think that it would be a serious source of traffic but the referrals have gone up and now I am averaging over two hundred visitors per day.This is another \"social site\" where regular visitors - referred to as \"stumblers\" - install a toolbar on their browser. They then sign up to \"stumble\" into websites that are in one or more of many themes featured by the site. You can sign up to see sites within (these are just a few of many categories).... activism, animals, arts, animation, astronomy, bizarre, cartoons, cats, crafts, cooking, drawing, graphic-design, humor, homemaking, illusions, indie-rock, internet, logic, linguistics, mac-os, music, multimedia, mathematics, online-games, painting, philosophy, photography, programming, psychology, religion, satire, science, sculpting or web-design. Once you have the toolbar and have picked some themes you then click the \"SU\" logo on your toolbar and it transports you to a site within one of your selected themes. I signed up and have been stumbling into websites about digital physics, robotics, nanotech and more. Now, before you think that \"EGOL has too much time on his hands....\" I'll tell you that overall the quality of sites that I have been seeing is very high. Each time you \"stumble\" into a site you have an opportunity to give it the \"thumbs up\" or \"thumbs down\" and I am betting that sites that get the thumbs down a few times are dropped from the stumble list pretty quick. So the value to me is getting a look at some successful sites and I've found a few to blog about and have even asked for and gotten unreciprocated links from a some of them.In addition to \"stumbling\" they also have SERPs (which remid me of Yahoo). In these SERPs, the pages that are getting lots of \"thumbs up\" votes are designated with from one to five yellow stars. I have lots of pages there with one or two stars and they don't yield much traffic but I also have a couple pages that waiver back and forth between four and five stars and these pages yielding about 100 referrals from SU per day which is why I like this site (-:It is very clear that info sites and entertaining sites have an enormous advantage in this type of contest. I'm also thinking that an attractive design will give you a jump also.OK... so, go over there and sign up and give one of your best pages the \"thumbs up\" and see if it leads to anything. And here's a tip. Pick a user name that is an easier keyword that you don't have coverage for on your sites. Your user page will start showing in the google SERPs and might even pull a little traffic on its own.So, check your logs and see if any stumblers are coming to your site. Then go try it out and come back here and let us know what you think... and if you give the \"thumbs up\" to one of your sites that is yet unrated there, come back a week later and tell us if has yielded any traffic. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "StumbleUpon.com"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "StumbleUpon.com"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "EGOL\n          \n            EGOL"
}