{
  "url": "https://moz.com/blog/stumbleupons-fantastic-ability-to-drive-traffic",
  "slug": "stumbleupons-fantastic-ability-to-drive-traffic",
  "title": "StumbleUpon's Ability to Drive Traffic - SEO Tips - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I've been a fan of StumbleUpon for almost 6 months, and here's why:\n\nThe above image shows the traffic stats from the StumbleUpon toolbar to SEOmoz since the beginning of the year. Wh...",
  "content": "StumbleUpon's Fantastic Ability to Drive Traffic Social Media By: Rand Fishkin August 16, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 16, 2006 StumbleUpon's Fantastic Ability to Drive Traffic Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I've been a fan of StumbleUpon for almost 6 months, and here's why: The above image shows the traffic stats from the StumbleUpon toolbar to SEOmoz since the beginning of the year. While these numbers are by no means overwhelmingly large, my impressions of StumbleUpon is that the traffic is fantasticaly well-targeted, savvy and looking for viral content. Stumblers tend to have accounts at Digg, Del.icio.us, Reddit and others and more than once, I've seen Stumble traffic lead to a re-surgence of traffic to a particular site or page that Stumblers have given high marks. To be honest, I'm also a user of the toolbar. I have it installed on my laptop, home machine and work computer and will occasionally \"stumble\" while chatting on the phone, waiting for a process or when I feel burned out. It may seem counterintuitive to use the web for random navigation - something that only Stumbleupon offers - but to me, it's relaxing, fun and exposes me to content I'd never see on my own. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "StumbleUpon's Fantastic Ability to Drive Traffic"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "StumbleUpon's Fantastic Ability to Drive Traffic"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}