{
  "url": "https://moz.com/blog/subdomains-subfolders-and-toplevel-domains",
  "slug": "subdomains-subfolders-and-toplevel-domains",
  "title": "Subdomains, Subfolders and Top-Level Domains - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Many of the client issues we've been working with recently have centered around canonicalizing, re-directing and structuring URLs for content. Marketing, sales, executives and IT departments all seem to have a unique viewpoint on these matters, making compromise and agreement especially difficult.…",
  "content": "Subdomains, Subfolders and Top-Level Domains Technical SEO By: Rand Fishkin May 11, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 11, 2006 Subdomains, Subfolders and Top-Level Domains Technical SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Many of the client issues we've been working with recently have centered around canonicalizing, re-directing and structuring URLs for content. Marketing, sales, executives and IT departments all seem to have a unique viewpoint on these matters, making compromise and agreement especially difficult. For the purposes of this post, I'll focus solely on the \"best practices.\" When to use a subfolder 99.9% of the time, if a subfolder will work, it's the best choice for all parties. Subfolders have all the flexibility of subdomains (the content CAN, if necessary, be hosted on a unique server or completley unique IP address through post-firewall load balancing) and none of the drawbacks. Subfolder content will contribute directly to how search engines (and users for that matter) view the domain as a whole. The link in to subfolders are considered relevant to the domain as a whole, and while this rule applies for many subdomains, the exceptions make it worth avoiding them. When to use a subdomain If your marketing team decides to promote a URL that is completely unique in content or purpose and would like to use a catchy subdomain to do it, it can be practical. Sites like maps.google.com, blog.searchenginewatch.com and even SEOmoz's own web2.0awards.org are examples of wher the marketing considerations make a subdomain an acceptable choice. Be wary of press and media attention to the domains, as un-savvy users often don't understand the concept of subdomains or that domains can be on the \"world-wide-web\" without a \"www.\" It's much less expensive to use a subfolder and have slightly less marketing panache than it is to educate through branding and advertising. When to use an entirely new domain When you don't want it to rank at the search engines . Seriously, though, a new domain, even for many of the world's largest brands, is not a particularly good idea. It's practical for entirely new campaigns, like a new movie (though if I were Warner Brothers or MGM, I'd opt for warnerbrothers.com/newmovie) or a new brand, and it's obviously necessary when building a new company. Other than these limited uses, however, multiple domains hosting content that could fit on an existing domain is brand dilution. I'd liken it to retail stores only taking American Express Gold cards and rejecting AmEx Corporate or AmEx Blue - overly segmented and dangerous for the consumer mindset (particularly consumers named Google, Yahoo! or MSN). Giving up the value of incoming links, the branding of an existing domain and the historical weight given by search engines is exceptionally inadvisable, particularly in a post-sandbox era. When to use a TLD other than .com Only these few rare situations would sway me to move away from the .com domain: When you own the .com and want to re-direct to a .org, .tv, .biz, etc. possibly for marketing/branding/geographic reasons. Only do this if you already own the .com and can re-direct. When you can use a .gov, .mil or .edu domain (.jobs, though technically restricted to HR and hiring organizations, is available to anyone who hires, and doesn't have any special search benefits) When you are serving only a single geographic region and are willing to forever forego promotion outside that region (i.e. .co.uk, .de, .it, etc.) I have no doubt my strict rules have some omitted exceptions - feedback is always welcome. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Subdomains, Subfolders and Top-Level Domains"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Subdomains, Subfolders and Top-Level Domains"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}