{
  "url": "https://moz.com/blog/super-advanced-seo-tip-build-an-experience",
  "slug": "super-advanced-seo-tip-build-an-experience",
  "title": "Super Advanced SEO Tip: Build an Experience! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Do you ever get frustrated by websites gaining more links than you even though you had better content? This happens for several reasons but one I've been paying attention to lately is websites with personality and beautiful design are just more link-friendly.Think about it, do you want to link to a…",
  "content": "Super Advanced SEO Tip: Build an Experience! Technical SEO By: rmccarley February 6, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: rmccarley February 6, 2007 Super Advanced SEO Tip: Build an Experience! Technical SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Do you ever get frustrated by websites gaining more links than you, even though you had better content? This happens for several reasons, but one I've been paying attention to lately is websites with personality and beautiful design are just more link-friendly. Think about it, do you want to link to a website that is bland and boring, or do you want to link to a website that has zoom? The search engines say we are who we link to/from, and in a way that's true... because on some level we identify with the sites we link to. So they better be cool. Average websites blend into the mass of other average websites. In SEO circles we tend to use WordPress or Blogger, often without bothering to customize the appearance. We call it \"testing the waters.\" How can anyone take you seriously if you aren't willing to make your site your own? If the viewer thinks you are too cheap or lazy to make your own site remarkable. why would they 1. hire you, or 2. link to you (when you may be gone tomorrow)? Some test - the results you got weren't as good as they should have been. Marketers and designers talk about branding. But I think branding is short of the mark. Just customizing colors and fonts and attaching a logo does not make a customer experience. It doesn't even reflect who you are. And that is the point: add personality! Be bold enough to let you shine through! One of my favorite bloggers is Rebecca here at SEOmoz. Why? Even when she is being incredibly off-topic, she is still being her honest self. And that is amazing. Put Rebecca's voice on Matt's design, and you've got more than just an ordinary website...more than just a blog...you've got an experience! There is more than just great information spewing from the mozzers. There is fun (in a Colbert Report sort of way) and a welcoming community. And none of that would be as successful without a great backdrop. This site does not look like any other. And even though Rand and crew talk about the same stuff the rest of us talk about, he's got a huge advantage to making link-friends...he gives the viewer an experience they can emotionally connect to. As advantageous as this tactic is today, it will become a necessity as the search engines push personalized search. At that point mind-share will be king. And the best way to get in a prospect's mind is by creating an experience beyond the norm. Don't just make \"nice\" websites - make websites worth talking about! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Super Advanced SEO Tip: Build an Experience!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Super Advanced SEO Tip: Build an Experience!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "rmccarley\n          \n            rmccarley"
}