{
  "url": "https://moz.com/blog/supersized-roundup-thursday-for-the-weeks-of-6108-and-6808",
  "slug": "supersized-roundup-thursday-for-the-weeks-of-6108-and-6808",
  "title": "Super-Sized Roundup Thursday(ish) for the Weeks of 6/1/08 and 6/8/08 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "My apologies for the missing roundup last week--it was SMX Advanced, and we were pretty busy with conference happenings. I've combined news and whatnot from last week into this week's roundup, so please forgive the extra bloatedness of this week's post (there's no such thing as Alka-Seltzer for…",
  "content": "Super-Sized Roundup Thursday(ish) for the Weeks of 6/1/08 and 6/8/08 SEO Events By: Rebecca Kelley June 13, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley June 13, 2008 Super-Sized Roundup Thursday(ish) for the Weeks of 6/1/08 and 6/8/08 SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. My apologies for the missing roundup last week--it was SMX Advanced, and we were pretty busy with conference happenings. I've combined news and whatnot from last week into this week's roundup, so please forgive the extra bloatedness of this week's post (there's no such thing as Alka-Seltzer for blogs, is there?). Also, the editorializing is a little light due to the massiveness of this post, so forgive me for being a little on the \"dry\" side this week. Stories, news, and other notable items from the past week: Two star links: I'm getting tired of this \"Google is evil! Wait, no they're not! But it was their motto and now it's not!\" B.S. It's the most overplayed catchphrase since \"Homey don't play that!\" Or maybe since \"You go, girl!\" Or \"that's hot.\" Geez, come to think of it, catchphrases really suck. If you're going to say that web readers have no attention span, you might want to take less than 5,000 friggin' words to make your point. /unglazes eyes Three star links: Onward Search has a list of the top 30 cities to earn a big SEO salary. Unsurprisingly, New York City is at the top of the list, but where the poo is Seattle? Rand, you underpayin' us?! Jane enjoys this uber-nerdy delete eraser. And so do I. And you too, probably. Liking dorky stuff like this comes with the job. CopyBlogger has a great tip on how to increase your blog subscription rate by tweaking the wording of your offer (in this case, \"Get\" vs. \"Subscribe\"). Time said you only need between 6.5 and 7.5 hours of sleep a night. Aww, but I love to sleep! Sleeping's the best. Gab Goldenberg (bookworm SEO) tells us how to use the link graph to get a lift in your branded search. The \"Increase Sociability Wordpress Plugin\" checks your referrers and if they match Digg or StumbleUpon, it welcomes your visitors and encourages them to upvote your content if they like it. After this particular blogger installed the plugin, he received a huge increase in visitors from StumbleUpon. Similarly, SocialHistory.js is a similar plugin that allows you to detect which social bookmarking sites your visitors use. AbleReach compares their blog traffic and analyzes which posts are most popular from which traffic sources. It's an interesting dissection of their blog, and we're prompted to give it a go as well. Compete does a drilldown of Twitter usage and traffic growth (daily attention, user segmentation, et al), so if you're Twitter obsessed, this will be the ultimate post for you. This post is a couple months old, but cool nonetheless. The search engines know where we spend time looking on maps...could this be an algo component in how they rank local businesses? Europe may be catching up the U.S. in online ad spend. They added $4 billion Euros year over year. Meanwhile, U.S. dollars are being used as a base for papier maché projects. These two pieces on transparency from some East Coast VCs suggest that openness predicts success. Danny Sullivan lays the smackdown on Firefox for forcing Google onto us as a default search engine. No fairsies, Firefox! How much money do you think Amazon lost when their site was down for about two hours last week? Oh, roughly $2.3 million, according to the eCommerce and Entrepreneurship blog. Matt McGee does a nice job of summarizing SMX Advanced with five key takeaways. From the Jane and Robot blog comes a good document on robot access. Bradley Spencer wonders if Google uses CTR as a metric in organic listings. What do you all think? ReadWriteWeb asks if you trust Google to resist the dark side (data mining across services). Dude, I can't resist watching a crappy zombie movie every now and then, so what makes me confident that Google can resist tapping into those sweet, sweet, metrics? (By the way, the new Day of the Dead movie [straight to DVD, of course] is as crappy as you'd think it'd be.) This post says that it doesn't have to be \"all or nothing\" with a startup (all startup and no life), while this guy says that he's working hard to keep the competition at bay. It's like the Sharks vs. the Jets! If you're a hardcore search geek, you probably already knew that Google used quality raters to decide if algo tweaks are good or bad, but it's certainly nice to see it confirmed yet again. Not sure why they keep trying to deny it... Google has doubled in size in the past couple years, but nobody seems to be talking about the new servers now found online... Four star links: Tamar yelled at me for neglecting to link to her viral marketing post about Weezer's latest video. The band does a clever job of featuring \"YouTube stars\" in their video for their latest single, Pork and Beans. It features the Chocolate Rain singer, Miss Teen South Carolina, the Numa Numa kid, and many more one-hit-wonder folks. Pretty smart of them to craft a video around various Internet sensations--it definitely attracts buzz from the linkerati and the blogsphere. Hey, check it out, an SEO guide for designers! SEOmoz hearts designers who understand SEO. The fastest rising, most impressive startup in the world might just be Barack Obama, and according to the article, there are some business lessons to learn from him (aka the \"Google\" of the political world). Black hat is a hot topic lately, and this discussion of black hat ethics makes for a compelling read. Speaking of which, Quadzilla says that there's no such thing as advanced white hat SEO. Even if we don't necessarily agree with everything he says, the post is still a fun read and an interesting perspective. John Carcutt from Search Engine Journal asks whether SEO forums are still necessary. He provides a good history of SEO forums and includes some interesting charts depicting forum growth from 2006-2008. The verdict? Don't count out forums just yet! More discussion of this post is over at cre8asite. Seth Godin offers up 10 things programmers would want to know about marketers. #7 is my favorite. Five star links: Malcolm Gladwell does a video on hiring. It's lengthy but well worth watching. Hiring is one of the hardest problems organizations face, and he hits the issues square on the nose. Rand calls this guide \"Probably the best single guide to Wordpress SEO [he's] seen yet,\" so check it out, suckas! And finally...I'm acquitted, bitches! The R. Kelly verdict is in! In yo face! Kidding...we all know who the \"real\" R. Kelley is, and she doesn't pee on people...much. ;) YOUmoz entries: Solving Duplicate Content Issues with Http and Https. AjiNIMC provides some tips on how to solve dupe http/https issues with .htaccess, and he also goes over canonicalization. As the SEOsons Turn... SEMCommonSense shares a friendly reminder to pay attention to seasonal trends since those queries could be important for your web traffic/conversions. 7 Things to Know About Email Marketing. Mighty Workshop writes a great list of things you should keep in mind when doing email marketing. Check it out if you're running an email marketing campaign. The Next Big Challenge to Google... Heavensgame posits Google's next challenge is analytics, and he provides his opinion on what Omniture is doing right and Google is doing wrong. The Lessons of \"Halfway Over Greenland.\" Rick Downer authors his first YOUmoz post and expresses appreciation for Rand's honesty in his \"Halfway Over Greenland\" post. Fix It If It's Broke: Client Recovery. Webwordslinger provides some tips on how to avoid/minimize client dissatisfaction. Blog Promotion: Heavy Blog Traffic Through Unique Use of Domain Names. Taxtorpedo proposes an interesting tactic: choose a humorous/thought-provoking domain and redirect that name to your actual URL, but use the \"cool\" domain in forums, email signatures, blog comments, etc. SEO Drink Buying Guide - Caffeine and Alcohol. Venice has a little fun with his Twitter friends and shares their favorite Starbucks drink and bar beverage with us. No Surprise for the US Elections. BottomTurn wonders if you can use Google Trends and other trend reporting tools to predict election results. Google Image Results and Flickr: Part 2. EverywhereTrip authors up another post about Google image results and Flickr. He hypothesizes that Google gives preference to images hosted on the same domain as the page it's linked from. Easy Link Love from Higher Ed Websites. Marty Martin shares a tip on how to snag links from .edu TLDs. Fast, Cheap, and Out of Control - A Viable Strategy for Developing Websites. DanCrean uses a NASA analogy to illustrate \"gold standard\" sites vs. quickly constructed, cheap websites. Was SMX Advanced Too Black Hat or Just Not Enough Advanced White Hat? Brent D. Payne weighs in on how he thought SMX Advanced went, and he gives some suggestions on what sort of advanced white hat content should be offered next year. Getting Organized with Mind Maps. Marty Martin authors up another post and lists a few different mindmapping tools for your idea generating pleasure. SEO? No, SPO (Self-Promotion Optimization). Lance Wilson discusses ways to promote yourself internally and achieve success in the workplace. Blog For Your Dinner. Identity encourages SEOmoz members to use our Marketplace and post their resume there. Web Development As a Series of Nested Options. DanCrean calculates the expected value of a website based on its development costs, success rate, estimated worth, and failure rate. He encourages us to estimate the value of developing a website using a similar formula/structure. The Painful Results of an SQL-Injection Attack. K0k1man's client recently experienced an SQL-injection attack, and in resulted in the search engines dropping thousands of indexed URLs and a nose dive in traffic. Title and Description Optimisation - How to Look Good and Keep It Tidy. London Phil shares with us his process for optimizing titles and meta descriptions with a dominant term. Best of YOUmoz: Explaining the Value of Ranking Internal Pages. Emecks shares a great Biblical analogy that he tells clients to help them understand why it's valuable to have internal pages rank in addition to the root domain. Get Free Links on Search Engine Watch! Lovingly controversial contributer Darren Slatten talks about exploiting XSS vulnerabilities for inbound links, and he uses Search Engine Watch as an example. It's a very thorough post and demonstrates that Darren's not actually just a troll--he's a pretty damn smart troll. How to Choose the Right SEO Clients for Your Business. Bookworm SEO provides a great list of questions to ask potential clients in order to determine whether they're a right fit and if they're an appropriate client to take on. My First Conference. Bhawk988 tells a humanizing tale of leaving his cell phone in a cab at SMX Advanced, and the good samaritan who went out of his way to help him track it down. 7 Ways to Tame Duplicate Content. Dr. Pete suggests 7 ways you can battle dupe content on your site. It's a good drilldown of tips that you should keep in mind. New events added to the Events Calendar: No new events were added. Upcoming events: Widget Web Expo June 16-17 in Brooklyn, NY New additions to the SEOmoz Marketplace: Featured job postings: We got some good job postings lately, including positions at MapQuest, Lucky Jeans, and Yahoo! Media Group. Pretty cool! Senior social media manager for Onward Search in Santa Clara, CA Senior search marketing analyst and PPC manager for Onward Search in Boston, MA SEO specialist for Onward Search in New York, NY SEO specialist for Sequiter IT Services in Trivandrum, Keral, India Internet marketing analyst for Destination Lighting in Seattle, WA Director of SEO for Demand Media in Santa Monica, CA SEO specialist for contract/project in Austin, TX Sponsored search revenue manager for MapQuest in Denver, CO An SEO back office firm is needed for Wise Solutions in Santa Barbara, CA Ecommerce analyst for Lucky Jeans in Los Angeles, CA SEO strategist for Yahoo! Media Group in Santa Monica, CA Commercial SEO manager for the Times Online in London, UK Featured companies: United States/North America: Creative Search Media in Silicon Valley/Bay Area, CA Range Online Media in Texas Graphic SEO in Baltimore, MD Morpheus Media in New York, NY HiYaYa in Tampa, FL Getupdated Internet Marketing in Ft. Lauderdale, FL Rise, Interactive in Illinois WriteSEO in Palatine, IL Top SEO Consultants in Washington state Hope Primas Associates in Philadelphia, PA bnr marketing in Raleigh, NC SEO Factor in Florida EmailAppenders in NY as well as Canada, the UK, and Australia OptinBuilders in Humble, TX, as well as Canada, the UK, Australia, Germany, and Romania WiderFunnel Marketing in Vancouver, BC, Canada UK/Europe: OOSEOO Internet Marketing in Amersfoort, UT, Netherlands Guava in the UK, Denmark, and Sweden Asia: Sequiter IT Services in Keral, India Creativ Era's in Kanpur, U.P., India Dotndot in Hyderabad, AP, India Featured resumes: Currently looking: Dipali Thakkar is an SEO executive who has a good knowledge of Internet marketing and its various aspects. Dennis Dornon is an SEO/SEM who excels in analyzing and implementing business strategies in SEO, Internet management, and organizational leadership. Phillip E. Daoust is a marketing specialist, product content manager, web editor/developer guru who has experience with various SEO/SEM subsets. Robert Monson is looking for a director of search engine marketing position. He feels he has the requisite qualifications and seems very eager and capable. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Super-Sized Roundup Thursday(ish) for the Weeks of 6/1/08 and 6/8/08"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Super-Sized Roundup Thursday(ish) for the Weeks of 6/1/08 and 6/8/08"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}