{
  "url": "https://moz.com/blog/sustainable-link-building-seo",
  "slug": "sustainable-link-building-seo",
  "title": "Sustainable Link Building: Increasing Your Chances of Getting Links — Best of Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Link building campaigns shouldn't have a start-and-stop date — they should be ongoing, continuing to earn you links over time. In this 2018 edition of Whiteboard Friday, guest host Paddy Moogan shares strategies to achieve sustainable link building, the kind that makes your content efforts…",
  "content": "Sustainable Link Building: Increasing Your Chances of Getting Links — Best of Whiteboard Friday Link Building | Whiteboard Friday By: Paddy Moogan October 30, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Paddy Moogan October 30, 2020 Sustainable Link Building: Increasing Your Chances of Getting Links — Best of Whiteboard Friday Link Building | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Link building campaigns shouldn't have a start-and-stop date — they should be ongoing, continuing to earn you links over time. In this informative and enduringly relevant 2018 edition of Whiteboard Friday, guest host Paddy Moogan shares strategies to achieve sustainable link building, the kind that makes your content efforts lucrative far beyond your initial campaigns for them. Click on the whiteboard image above to open a high-resolution version in a new tab! Video Transcription Hi, Moz fans. Welcome to Whiteboard Friday. I'm not Rand. I'm Paddy Moogan. I'm the cofounder of Aira. We're an agency in the UK, focusing on SEO, link building, and content marketing. You may have seen me write on the Moz Blog before, usually about link building. You may have read my link building book. If you have, thank you. Today, I'm going to talk about link building again. It's a topic I love, and I want to share some ideas around what I'm calling \"sustainable link building.\" Problems Now, there are a few problems with link building that make it quite risky, and I want to talk about some problems first before giving you some potential solutions that help make your link building less risky. So a few problems first: I. Content-driven link building is risky. The problem with content-driven link building is that you're producing some content and you don't really know if it's going to work or not. It's quite risky, and you don't actually know for sure that you're going to get links. II. A great content idea may not be a great content idea that gets links. There's a massive difference between a great idea for content and a great idea that will get links. Knowing that difference is really, really important. So we're going to talk a little bit about how we can work that out. III. It's a big investment of time and budget. Producing content, particularly visual content, doing design and development takes time. It can take freelancers. It can take designers and developers. So it's a big investment of time and budget. If you're going to put time and budget into a marketing campaign, you want to know it's probably going to work and not be too risky. IV. Think of link building as campaign-led: it starts & stops. So you do a link building campaign, and then you stop and start a new one. I want to get away from that idea. I want to talk about the idea of treating link building as the ongoing activity and not treating it as a campaign that has a start date and a finish date and you forget about it and move on to the next one. So I'm going to talk a little bit about that as well. Solutions So those are some of the problems that we've got with content-driven link-building. I want to talk about some solutions of how to offset the risk of content-driven link building and how to increase the chances that you're actually going to get links and your campaign isn't going to fail and not work out for you. I. Don't tie content to specific dates or events So the first one, now, when you coming up with content ideas, it's really easy to tie content ideas into events or days of the year. If there are things going on in your client's industry that are quite important, current festivals and things like that, it's a great way of hooking a piece of content into an event. Now, the problem with that is if you produce a piece of content around a certain date and then that date passes and the content hasn't worked, then you're kind of stuck with a piece of content that is no longer relevant. So an example here of what we've done at Aira, there's a client where they launch a piece of content around the Internet of Things Day. It turns out there's a day celebrating the Internet of Things, which is actually April 9th this year. Now, we produced a piece of content for them around the Internet of Things and its growth in the world and the impact it's having on the world. But importantly, we didn't tie it exactly to that date. So the piece itself didn't mention the date, but we launched it around that time and that outreach talked about Internet of Things Day. So the outreach focused on the date and the event, but the content piece itself didn't. What that meant was, after July 9th, we could still promote that piece of content because it was still relevant. It wasn't tied in with that exact date. So it means that we're not gambling on a specific event or a specific date. If we get to July 9th and we've got no links, it obviously matters, but we can keep going. We can keep pushing that piece of content. So, by all means, produce content tied into dates and events, but try not to include that too much in the content piece itself and tie yourself to it. II. Look for datasets which give you multiple angles for outreach Number two, lots of content ideas can lead from data. So you can get a dataset and produce content ideas off the back of the data, but produce angles and stories using data. Now, that can be quite risky because you don't always know if data is going to give you a story or an angle until you've gone into it. So something we try and do at Aira when trying to produce content around data is from actually different angles you can use from that data. So, for example: Locations. Can you pitch a piece of content into different locations throughout the US or the UK so you can go after the local newspapers, local magazines for different areas of the country using different data points? Demographics. Can you target different demographics? Can you target females, males, young people, old people? Can you slice the data in different ways to approach different demographics, which will give you multiple ways of actually outreaching that content? Years. Is it updated every year? So it's 2018 at the moment. Is there a piece of data that will be updated in 2019? If there is and it's like a recurring annual thing where the data is updated, you can redo the content next year. So you can launch a piece of content now. When the data gets updated next year, plug the new data into it and relaunch it. So you're not having to rebuild a piece of a content every single time. You can use old content and then update the data afterwards. III. Build up a bank of link-worthy content Number three, now this is something which is working really, really well for us at the moment, something I wanted to share with you. This comes back to the idea of not treating link building as a start and stop campaign. You need to build up a bank of link-worthy content on your client websites or on your own websites. Try and build up content that's link worthy and not just have content as a one-off piece of work. What you can do with that is outreach over and over and over again. We tend to think of the content process as something like this. You come up with your ideas. You do the design, then you do the outreach, and then you stop. In reality, what you should be doing is actually going back to the start and redoing this over and over again for the same piece of content. What you end up with is multiple pieces of content on your client's website that are all getting links consistently. You're not just focusing on one, then moving past it, and then working on the next one. You can have this nice big bank of content there getting links for you all the time, rather than forgetting about it and moving on to the next one. IV. Learn what content formats work for you Number four, again, this is something that's worked really well for us recently. Because we're an agency, we work with lots of different clients, different industries and produce lots and lots of content, what we've done recently is try to work out what content formats are working the best for us. Which formats get the best results for our clients? The way we did this was a very, very simple chart showing how easy something was versus how hard it was, and then wherever it was a fail in terms of the links and the coverage, or wherever it was a really big win in terms of links and coverage and traffic for the client. Now, what you may find when you do this is certain content formats fit within this grid. So, for example, you may find that doing data viz is actually really, really hard, but it gets you lots and lots of links, whereas you might find that producing maps and visuals around that kind of data is actually really hard but isn't very successful. Identifying these content formats and knowing what works and doesn't work can then feed into your future content campaign. So when you're working for a client, you can confidently say, \"Well, actually, we know that interactives aren't too difficult for us to build because we've got a good dev team, and they really likely to get links because we've done loads of them before and actually seen lots of successes from them.\" Whereas if you come up with an idea for a map that you know is actually really, really hard to do and actually might lead to a big fail, then that's not going to be so good, but you can say to a client, \"Look, from our experience, we can see maps don't work very well. So let's try and do something else.\" That's it in terms of tips and solutions for trying to make your link building more sustainable. I'd love to hear your comments and your feedback below. So if you've got any questions, anything you're not sure about, let me know. If you see it's working for your clients or not working, I'd love to hear that as well. Thank you. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Sustainable Link Building: Increasing Your Chances of Getting Links — Best of Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Sustainable Link Building: Increasing Your Chances of Getting Links — Best of Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "Problems"
    },
    {
      "level": "H3",
      "text": "I. Content-driven link building is risky."
    },
    {
      "level": "H3",
      "text": "II. A great content idea may not be a great content idea that gets links."
    },
    {
      "level": "H3",
      "text": "III. It's a big investment of time and budget."
    },
    {
      "level": "H3",
      "text": "IV. Think of link building as campaign-led: it starts & stops."
    },
    {
      "level": "H2",
      "text": "Solutions"
    },
    {
      "level": "H3",
      "text": "I. Don't tie content to specific dates or events"
    },
    {
      "level": "H3",
      "text": "II. Look for datasets which give you multiple angles for outreach"
    },
    {
      "level": "H3",
      "text": "III. Build up a bank of link-worthy content"
    },
    {
      "level": "H3",
      "text": "IV. Learn what content formats work for you"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Paddy Moogan\n          \n            Paddy Moogan\n          \n            Paddy Moogan"
}