{
  "url": "https://moz.com/blog/sustainable-local-business-tips",
  "slug": "sustainable-local-business-tips",
  "title": "Celebrating Canada’s Small Business Month With Sustainable Local Biz Tips - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Happy Small Business Month! In this article, Miriam displays that by making sustainable local goods and services easier for everyone to find and choose online, we can work towards healing the climate together.",
  "content": "Celebrating Canada’s Small Business Month With Sustainable Local Biz Tips Local SEO | Reputation Management By: Miriam Ellis October 10, 2023 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis October 10, 2023 Celebrating Canada’s Small Business Month With Sustainable Local Biz Tips Local SEO | Reputation Management The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Edited by Emilie Martin Happy Small Business Month to the 1.19 million small-to-medium enterprises (SMEs) in Canada! You employ 10.7 million Canadians (88.1% of the private labor force) and contribute to 50.4% of the gross domestic product (GDP). Your numbers, percentages, and contributions outweigh those of large businesses in many ways, meaning that Canadian SMEs have awesome collective power to be part of the transition to sustainability which we all know we need in order to protect the beautiful earth on which we depend for life. Localized green production is considered one of the top methods of healing the climate, but in order for customers to discover and choose your sustainable business, you’ve got to have a strong presence in Google’s local results. Today, let’s talk to 3 of my favorite Canadian local SEOs — Darren Shaw, Colan Nielsen, and John Vuong — for expert tips on becoming highly visible in Google’s local pack rankings. And, if you’re working to green your business or planning to start a new one, we’ll highlight a few sustainable models for your inspiration. The transition off fossil fuels is a narrative of gains, not losses, and as a local business owner, you have the opportunity to play a starring role in this dramatic evolution towards a better future for all of us. 3 expert Canadian local pack ranking tips I asked my honored colleagues to the north what the top factor they see currently impacting Google’s local pack rankings (shown above) in Canada. You’ll find a diversity of answers, because all local SEOs notice different things as they work with different industries and geographies, making all advice worth listening to. Here are their tips for you: 1. Keywords in Google Business title Darren Shaw, the CEO of Whitespark, says: \"The top factor I'm seeing driving local rankings in Canada is the same as the top factor I see in any country. Unfortunately, it's keywords in the Google Business Profile business name. Google gives too much ranking weight to this factor, and it's helping businesses spam their way to the top of the search results. It's technically against Google's guidelines to use a business name that is not your business' actual real-world name, but the sad reality is that Google does not police or penalize this, so spamming the business name with additional keywords has become a common practice.\" When Darren refers to spamming Google Business Profile names with keywords, he’s talking about this practice: Google’s guidelines make it clear that the only thing that belongs in this field is your real-world business name. No one in Canada knows local rankings better than Darren, who is the annual publisher of the Local Search Ranking Factors Survey and Report, and he and I both expressed our disbelief that Google is still allowing keyword-stuffed business names to have such influence on visibility. What is an honest local business owner to do in this scenario? Join in the spam? Report it? I’ve created this graphic to explain the several paths open to you: This graphic doesn’t represent every possible bend in the road, but it covers the big ones. In sum, if you’re being outranked by a spamming competitor, you could decide to join in the spam. But that could make you lose potential customers who think your name looks untrustworthy, and Google might eventually edit your business name, which could lead to a loss of rankings once your extraneous keywords are removed. If you’re investing in spam instead of other more solid marketing tactics, you’re always on the verge of losing out. Meanwhile, you do have the option to report spammy competitors to Google by flagging the name right on the listing or via the Business Redressal Complaint form, but even if Google acts on this and edits the keyword-stuffed name, the spammer is all too likely to come back. Spam fighting is a good competitive tactic, but can’t form the whole of your marketing strategy. If you choose not to spam, you will look authentic to the customers who do see your listing, and you just have to be philosophical about the fact that spammers may outrank you in Google’s system. If your competitors’ business practices are as iffy as their names, you know their disgruntled customers will likely end up coming to you one day, anyway, for better service, and we can all hope that Google may one day utterly downgrade this ranking signal. Finally, if you’re preparing to launch a brand new business, you could choose to brand it with one or two top keywords in mind, knowing that this could give you a boost in Google’s local packs. However, there are two big conditions to this route. Firstly, don’t go overboard. Don’t name your business Best Organic Farm-to-Table Restaurant With Sustainable Practices And Righteous Poutine in Toronto. This is just going to look silly to anyone who is evaluating whether to become your customer. Stick to just one or two keywords at most, and remember that your business name must be consistent on your real-world signage, website, and how you answer the phone. The second condition is that brand names that are too specific can sometimes require later rebranding if the business expands. For example, if you name your first restaurant location Toronto Farm to Table and you become successful enough to open a second location in Mississauga, your original branding is going to become a problem in your new setting. If you plan to grow, be wary of city names or other geo-modifiers in your branding that could hold you back in the future. 2. Primary category selection VP of Sterling Sky, Colan Nielsen, agrees with Darren about keywords in the business name, but don’t miss his second tip because it’s a major one: “The local algorithms in Canada tend to be driven by most, if not all, the same factors that drive rankings in the USA. Here are a few things that we have seen have a significant impact on rankings recently: Keywords in the business name. Yes, yes, I know… everyone is tired of hearing about keywords in the name. But even here in the great white north, it has a significant impact. Getting the primary GBP category right. We recently advised a Family Law practice to change the primary GBP category from \"Law Firm\" to \"Family law attorney,\" and it improved their rankings significantly.” If you download the free Chrome extension, GMB Everywhere, you’ll be able to make the most of Colan’s tip about getting your primary category right by looking at it in comparison to your competitors’ Google Business Profile listings. The primary category (in this case, garden center) is marked with a star in this useful interface: It’s almost impossible to rank for your most important local search phrases without selecting the right primary category, so a shop like this garden center in Edmonton has to be sure that the first category they choose when creating their Google Business Profile is of prime importance to the business. They can then add up to 9 additional categories for aspects of secondary importance, and one key way of determining what your primary category should be is by seeing what your top-ranked competitors have chosen. In this example, the top result for this search has, indeed, chosen “garden center” as their primary category: For more tips on this key area of local listing optimization, read: How to Choose Google My Business Categories with Cool Tools 3. Searcher-to-business proximity CEO John Vuong of Local SEO Search Inc. says, “Physical proximity is the top ranking factor for the local pack right now. Google wants to provide users with the most relevant search results possible, and this includes showing them businesses that are closest to them. Make sure that you are optimizing your site for local search to rank best in your local area and try to get solid reviews with local justification trigger terms in them on Google (e.g. close by, near me, neighborhood/city, highly rated, etc.).” John is referring to two things. The first is the phenomenon of knowing you are likely to rank best in the local packs for searchers nearest you, like this: This can not only help you determine the ideal spot for your company to be physically located so that it’s closest to your intended audience, but this nearby geography should also feature highly in how you optimize your local business website. City names and neighborhood names matter. Secondly, John is describing the eye-catching local pack elements known as local justifications, which look like this: Read: Local Justifications are a Big Deal and You Can Influence Them to get a speedy education on this neat feature that can influence clicks on your listings, and don’t miss this quiet but fascinating recent tip from Colan on how to get Google to show the “provides” justification on your listing. 3 Deeply sustainable Canadian small business models Are you an entrepreneur who wants to be part of the sustainable transition by founding a Canadian SME? Consider these models: 1. Feeding local people local food “Farming. It had everything we were looking for; it was a real and concrete way to work at creating change.” — Liz Beasley and Matt Rock Small organic growers like Joyfully Organic Farm in Markham, Ontario, aren’t merely producing vegetables without synthetic chemicals; they are focusing on regenerative agriculture, which improves land over time while also greatly reducing the fossil fuels required to put meals on neighbors’ plates. When managed organically, farm stands, farm shares, CSAs, farmers' markets, and community gardens can abundantly feed us with the fresh, nearby, unprocessed foods medical experts say are best for us. Farmers say you can even keep eating locally in winter in most of Canada with a combination of cold-weather crops and ancient practices like preserving. 2. Launch a local ReStore for local people \"Thrift stores are idealized as the perfect place to find unique and affordable items, with proceeds benefiting local charities. In reality, 75 percent of your donations are being shipped overseas. Conversely, Habitat’s ReStore operates in a highly transparent way to assure you that. your purchase from our ReStore really does have an impact on local families.” — Habitat ReStore, Ontario Overconsumption, fast fashion, long-distance shipping, and planned obsolescence are the opposites of sustainability. A really good solution to keeping your neighbors clothed and stocked with basic household necessities could be launching a community ReStore. If you are good at mending and repairing a variety of merchandise, your re-store could significantly reduce the number of times people nearest you have to buy new. This phenomenon has become so popular in Europe that Sweden opened the world’s first recycled mall and it’s about to celebrate its tenth anniversary. 3. Offer green, local production of basic goods One green trend I’m keeping a close eye on is helping people transition from seeking happiness in owning lots of stuff to pursuing joy through intangible experiences like staycations and community projects. These increase satisfaction in being where you are, the truth is that we all need some basic belongings like clean water, food, clothing, shelter, warmth, and a few simple household goods. If you’re launching a new venture or looking to transition an existing one, consider how you can emphasize local production of necessities. Squamish Nation-owned Raven and Hummingbird Tea Co. reduce the need for imported drinks by locally growing traditional herbs in their community garden. Customers looking for nearby drinking vessels could go to TAV Ceramics of Vancouver which sources their clay locally and uses lead-free glazes. Another nearby outfit, Just Potters, highlights how diversity, equity, and inclusion are meant to be part of the energy transition; they’re embracing their community by employing neighbors with both physical and mental health challenges. Look around your home, office, and town and see if you can identify daily-use items that are currently being imported and shipped long distance to your neighbors. Could you produce these items locally? Are there parts of your existing supply chain that you could switch to more local sources? Business ideas, persuasive USPs, meaningful content marketing, and a better future could exist if you have the right vision. Why I secretly want Canada to lead in healing Climate Change Canada is so beautiful! Some powers-that-be may see you as the world’s oil can, but Canada is so much more worthy, inspiring, and awe-inspiring than that. I was personally thrilled when Moz evolved beyond Seattle to include a branch in Vancouver and expanded our Moz Local offering to help Canadian businesses get listed on the major local business directories and platforms. As a California girl, I’ve always been a secret Canada fan. I grew up with a really special feeling for Canadian children’s television like Degrassi Junior High, and wanted to live on PEI with Anne of Green Gables. Your country gave us Rush, one of the greatest rock bands of all time. Your figure skaters and hockey players are global legends, your gardens are gorgeous, and your natural spaces are beyond monumental. You understand my fierce love of both maple syrup and beavers. You spell better. And you might just have the prettiest flag in the world. Yes, I’ve always felt close to Canada, and in recent years, that kinship has been more deeply forged by the losses we are both suffering in California and Canada due to the wildfires of Climate Change. We know first-hand now what it means to see loved spaces turned to ash, making the transition off fossil fuels immediate and urgent to us both. While penning this column, I haven’t been able to go outside for five days due to air quality alerts from heavy wildfire smoke. Climate Change is, indeed, impacting every aspect of business and life throughout North America. But, together, by making sustainable local goods and services easier for everyone to find and choose online, we can reduce fuel consumption and, perhaps, bring new meaning to the symbology of both our homelands’ flags. You have a maple leaf, and I have a bear. Let’s do business like people who know we not only depend on nature but are part of it. Wishing you a strong and sustainable Small Business Month in 2023! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Celebrating Canada’s Small Business Month With Sustainable Local Biz Tips"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Celebrating Canada’s Small Business Month With Sustainable Local Biz Tips"
    },
    {
      "level": "H2",
      "text": "3 expert Canadian local pack ranking tips"
    },
    {
      "level": "H3",
      "text": "1. Keywords in Google Business title"
    },
    {
      "level": "H3",
      "text": "2. Primary category selection"
    },
    {
      "level": "H3",
      "text": "3. Searcher-to-business proximity"
    },
    {
      "level": "H2",
      "text": "3 Deeply sustainable Canadian small business models"
    },
    {
      "level": "H3",
      "text": "1. Feeding local people local food"
    },
    {
      "level": "H3",
      "text": "2. Launch a local ReStore for local people"
    },
    {
      "level": "H3",
      "text": "3. Offer green, local production of basic goods"
    },
    {
      "level": "H1",
      "text": "Why I secretly want Canada to lead in healing Climate Change"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}