{
  "url": "https://moz.com/blog/swoop-an-ontology-browser",
  "slug": "swoop-an-ontology-browser",
  "title": "SWOOP - An Ontology Browser - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "What is an ontology? In case you're disinclined to follow the link, I've quoted Wikipedia's excellent article on the subject:\nIn computer science, an ontology...",
  "content": "SWOOP - An Ontology Browser Moz News By: Rand Fishkin March 9, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 9, 2005 SWOOP - An Ontology Browser Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. What is an ontology? In case you're disinclined to follow the link, I've quoted Wikipedia's excellent article on the subject: In computer science, an ontology is the attempt to formulate an exhaustive and rigorous conceptual schema within a given domainSWOOP, pictured at right is an ontology based browser that can be downloaded for free. It's an excellent tool to play around with in order to get a good idea of what ontologies are, particularly in relation to web pages. The importance of ontologies is their use by search engines to help disambiguate queries, find more relevant information and identify websites that are well structured for the delivery of hierarchical information.For example, if you were to construct a website about French cuisine, you would want to seperate the information into categories, possibly by region, ingredients, meals, etc. The ontologies for the seperate pages would help a search engine to \"learn\" what content was contained in the pages and assist them in identifying that content that would be most relevant given a complex search string, like \"bordeaux regional french cuisine\".For most SEOs, ontologies have not been an important subject because; Search engines have failed to implement them effectively Most of the phrases SEOs target are short, general queries Most users are not yet searching with this level of complexity or detailHowever, in being prepared for the future, it is important for SEOs and webmasters to recognize the great value in writing for an ontology based web scheme. Not surprisingly, this makes for fantastically easy-to-use and readable sites and pages. I'm personally looking forward to creating my first (from scratch) site architecture based around the principles of ontologies and hierarchies over the next 2-3 months. I'll let you know how it goes! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SWOOP - An Ontology Browser"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "SWOOP - An Ontology Browser"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}