{
  "url": "https://moz.com/blog/take-apple-maps-more-seriously",
  "slug": "take-apple-maps-more-seriously",
  "title": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Apple has just launched their new Apple Business Connect interface — designed to make it easier for small businesses to get listed on Apple Maps. If your last real look at Apple Maps was a decade ago when the platform was going through a very awkward stage, it may now be time to revisit the…",
  "content": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too Local SEO | Mobile SEO By: Miriam Ellis April 4, 2023 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis April 4, 2023 Apple is Taking Their Maps More Seriously and Local Businesses Should, Too Local SEO | Mobile SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. For the past 20 years, local business owners and their marketers have had to live and work with Google as the “great house”, owning all the good real estate. The dominant role Google’s local and organic results play in bringing nearby customers to our doors has had the effect of making every other source of business listings feel like a bit of a granny unit — tiny and somewhere at the back of the weedy yard. Owners frequently ask whether they should even bother paying for local listings development, what with Google Business Profiles looming so large on the landscape. But with spring comes change, and Apple has just tidied up the garden and put out a welcome mat via their new Apple Business Connect interface that’s designed to make it easier for small businesses to get listed on Apple Maps. If your last real look at Apple Maps was a decade ago when the platform was going through a very awkward stage, take note of what Near Media co-founder David Mihm is saying about the launch of ABC: “I can't remember a press release in the marketing tech world that undersold the level of improvement more than the one that Apple put out this week. I read it, I thought, 'Ah, this is, you know, re-skinning the existing thing and putting a couple of bells and whistles in.' Then I logged in and it was like, 'WOW! Wildly different experience, much more functionality.' …I'm not saying it has gone beyond where Google's My Business Dashboard was even three or four years ago — but the juxtaposition of, 'Hey, this is a real product for managing location information' versus the absolute dumpster fire of the NMX new GBP experience.” Multi-location management via ABC remains forbiddingly time-consuming. The steps involved in creating and claiming many listings are many. Yet, as Mihm rightly points out, this is a big step for Apple and a signal to anyone involved in marketing local businesses to take a closer look at why they need to be listed someplace other than Google! Why get listed on Apple Maps? Apple’s high card is its integration into daily life. Some estimate that Apple Maps has a user base of 75-100 million US adults. Car Play (which uses Apple Maps) is integrated into more than 80% of automobiles sold in the US. I think the best way to look at prevalence is that it’s estimated that there will be 136.8 million US iPhone users this year, and Apple Maps is the default mapping application on these trendsetting devices. In the past, subpar data and a non-intuitive interface gave Apple Maps a wormy reputation, but they have spent the last ten years carefully and thoughtfully improving this product. They’ve rolled out a new “Explore” layer for navigating notable features of cities and neighborhoods, added new curated guides to places, have a function called App Clips for transactions like ordering food or paying for parking, as well as a growing set of filters for helping users refine their searches. Unlike Google, which tends to beta launch buggy products early and often, Apple has taken a more measured approach to getting things right, and in 2023, ABC stands on the shoulders of a product that is already deeply embedded in society. In short, there are many reasons why your customers may consider Apple Maps their preferred application for navigating their local communities. Google may still be your big landlord, but Apple is offering new reasons for real-world brands to hang up a shingle in their neighborhood. When major entities like Apple put money and people behind a product, opportunity often results for SMBs. How to get listed on Apple Maps Moz Local customers don’t actually need to do anything. Your local business data is already being distributed to Apple Maps (you’re ahead of the game - a nice feeling!) If you’re not yet a Moz Local customer, my recommendation is that you read this piece by Mike Blumenthal to determine how much of an investment you want to make in manually listing each of your locations in Apple Maps. If your evaluation points to this being a good investment, you’ll need to take the following steps: Create your Apple ID here.Next, head to the ABC interface. If the business you’re marketing has fewer than 25 locations, search to see if your Place Cards already exist. If they do, go through the verification wizard to claim each listing. If not, go through the wizard to create and then verify your listing. You will need to provide proofs to Apple, such as a utility bill, legal business registration certificate, or lease documentation. Verification can take about five days. If your business has 25+ locations, you will need to acquire a D-U-N-S number, click on the “register as an enterprise” link in ABC, and then use the Enterprise Onboarding Guide to get going with your multi-location Place Cards. If you determine that the hassle of creating and claiming your Apple Place Cards directly is just too much, this is a good time to note that Moz Local is directly integrated with Apple Business Connect, meaning that: Moz Local customers enjoy real-time data updates to Apple Maps via APIApple Maps data is checked and synced to Moz Local data, 24/7You are strongly encouraged to add up to 100 photos to your Moz Local dashboard to make your Apple Maps listings stand out In sum, ABC has succeeded to a certain degree in making it easier for local brands to get listed, but if the process is still too time-consuming for you, a service like Moz Local can make having an Apple Maps presence practically effortless. We are very impressed with the time and care Apple is putting into their increasingly-prevalent product, and we’re keeping a close eye on new experimental features. Moz strongly believes that Apple Maps has a real role to play in the local search ecosystem. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too"
    },
    {
      "level": "H2",
      "text": "Why get listed on Apple Maps?"
    },
    {
      "level": "H2",
      "text": "How to get listed on Apple Maps"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}