{
  "url": "https://moz.com/blog/taking-local-inventory-online",
  "slug": "taking-local-inventory-online",
  "title": "Taking Local Inventory Online: An Interview with Pointy’s Mark Cummins - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Getting inventory online and competing with e-commerce giants is a huge obstacle for local retailers. In this interview with former Googler Mark Cummins, we explore the workings of a new option that takes advantage of the See What's In Store feature to gain a competitive edge.",
  "content": "Taking Local Inventory Online: An Interview with Pointy’s Mark Cummins Local SEO | Search Engines | E-Commerce SEO By: Miriam Ellis January 7, 2019 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Miriam Ellis January 7, 2019 Taking Local Inventory Online: An Interview with Pointy’s Mark Cummins Local SEO | Search Engines | E-Commerce SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Let’s go back in time 20 years so I can ask you the question, “How often do you look at a paper map every month?”Unless you were a cartographer or a frequent traveler, chances are good that your answer would be, “Hmm, maybe less than once a month. Maybe once or twice a year.”But in 2019, I’d wager there’s scarcely a day that goes by without you using Google Maps when planning to eat out, find a service provider, or find something fun to do. That web-based map in your hand has become a given.And yet, there’s one thing you’re still not using the Internet for. And it’s something you likely wonder about almost daily. It starts with the question,“I wonder who around here carries X?”A real-world anecdoteAfter the tragic fires we’ve had this year in California, I wanted to wet mop all the floors in my house instead of vacuuming them, due to my concerns about particulate pollution in the air. My mother recommended I buy a Swiffer. I needed to know where I could find one locally, but I didn’t turn to the Internet for this, because the Internet doesn’t tell me this. Or at least, it hasn’t done so until now. Few, if any, of the local hardware stores, pharmacies, or big box retailers have reliable, live online inventory. At the same time, calling these places is often a huge hassle because staff isn’t always sure what’s in stock. And so I ended up going to 3 different shops in search of this particular product. It wasn’t a convenient experience, and it was an all-too-common one.The next big thing in local already existsMy real-world anecdote about a wet mop is exactly why I’m so pleased to be interviewing Mark Cummins, CEO of Pointy. 90% of purchases still take place in physical stores and it’s Mark who has seen this gap in available online knowledge about offline inventory and has now set out to bridge it. I predict that within a few years, you’ll be using the Internet to find local inventory as frequently and easily as you’ve come to use its mapping capabilities. This chat with Mark explains why.The real-world roots of an existing local needMiriam: Mark, I understand that you were formerly a Google Search Team member, with a background in machine learning, but that your journey with Pointy began by walking into retail shops and talking face-to-face with owners. What did these owners tell you about their challenges in relation to offline/online inventory? A memorable real-world anecdote would be great here.Mark: I started thinking about this problem because of an experience just like your story about trying to find a Swiffer. I’d recently moved to a new country and I had to buy lots of things to set up a new apartment, so I had that kind of experience all the time. It felt like there was a huge gap there that search engines could help with, but they weren’t.I had been working at Google developing what became Google Lens (Google’s image recognition search feature). It felt strange that Google could do something so advanced, yet couldn’t answer very basic questions about where to buy things locally.So I started thinking about ways to fix that. Initially I would just walk into retailers and talk to them about how they managed their inventory. I was trying to figure out if there was some uniform way to bring the inventory information online. I quickly learned that it was going to be hard. Almost every retailer I spoke to had a different method of tracking it. Some kept records on paper. Some didn’t count their inventory at all.My first idea was a little crazy — I wanted to build a robot for retailers that would drive around the store every night and photograph all the shelves, and use image recognition to figure out the inventory and the prices. I spent some time seriously thinking about that, but then landed on the idea of the Pointy box, which is a much simpler solution.Miriam: Can you briefly describe what a typical Point of Sale system is like for retailers these days, in light of this being technology most retailers already have in place?Mark: Well, I would almost say that there isn’t a typical Point of Sale system. The market is really fragmented, it sometimes feels like no two retailers have the same system. There’s a huge range, from the old-style systems that are essentially a glorified calculator with a cash drawer, up to modern cloud-connected systems like Clover, Square, or Lightspeed. It’s very disruptive for retailers to change their POS system, so older systems tend to stay in use for a long time. The systems also differ by vertical — there are specialized systems for pharmacies, liquor stores, etc. Dealing with all of that variation is what makes it so hard to get uniform local inventory data.A simple inventory solution is bornMiriam: So, you spoke with retailers, listened to their challenges and saw that they already have Point of Sale systems in place. And Pointy was born! Please, describe exactly what a Pointy device is, how it solves the problems you learned about, and fits right in with existing Point of Sales technology.Mark: Right! It was pretty clear that we needed to find a solution that worked with retailers’ existing systems. So we developed the Pointy box. The Pointy box is a small device that attaches to a retailer’s barcode scanner. Basically it links the barcode scanner to a website we create for the retailer. Whenever the retailer scans a product with their barcode scanner, we recognize the barcode, and list the product on the website. The end result is live website listing everything in the store — here’s an example for Talbot’s Toyland, a toy store in San Mateo. They have over ten thousand products listed on their site, without any manual work.The experience is pretty much seamless — just plug in Pointy, and watch your store website build itself. The Pointy box connects directly via the cell phone network, so there’s really nothing to set up. Just plug it in and it starts working. New products automatically get added to your store page, old products get removed when you no longer sell them, item stock status syncs automatically. We did quite a bit of machine learning to make that all automatic. Once the site is live, we also have some SEO and SEM tools to help retailers drive search traffic for the products they sell.Miriam: My understanding is that the Pointy Team had to do a ton of legwork to put together various product catalogues from which data is pulled each time a product is scanned so that its information can be displayed on the web. I’m not familiar with this concept of product catalogues. What are they, what types of information do they contain, and what did you have to do to pull all of this together? Also, is it true that your team hand-reviews all the product data?Mark: If you’re working in shopping search, then product catalogs are really important. Every mass-market product has a unique barcode number, but unfortunately there’s no master database where you can enter a barcode number and get back the product’s name, image, etc. So basically every retailer has to solve this problem for themselves, laboriously entering the product details into their systems. Pointy helps eliminate that work for retailers.There are some product catalogs you can license, but each one only covers a fraction of products, and errors are common. We built a big data pipeline to pull together all of this product data into a single catalog and clean it up. We automate a lot of the work, but if you want the highest quality then machine learning alone isn’t enough. So every single product we display also gets approved by a human reviewer, to make sure it’s accurate. We’ve processed millions of products like this. The end result for the retailer is that they just plug in a Pointy box, scan a product, and their website starts populating itself, no data entry required. It’s a pretty magical feeling the first time you see it. Especially if you’ve spent countless hours of your life doing it the old way! Where real-time local inventory appears on the webMiriam: So, then, the products the retailer scans create the brand’s own inventory catalogue, which appears on their Pointy page. What tips would you offer to business owners to best integrate their Pointy page with their brand website? Linking to it from the main menu of the website? Something else? And do these Pointy pages feature SEO basics? Please describe.Mark: Some retailers use Pointy as their main website. Others have it as an additional profile, in the same way that they might have a Facebook page or a Yelp page. The main thing Pointy brings is the full live inventory of the store, which generally isn’t listed anywhere else. To integrate with their other web presences, most just link across from their main sites or social media profiles. A few also embed Pointy into their sites via an iframe.We work a lot on making these pages as SEO-friendly as possible. The queries we focus on ranking for are things like “product name near me” or “product name, location.” For example, a query like “rubber piggy bank san mateo” currently has the Pointy page for Talbot's Toyland in #1 position. We have an engineering team working on this all the time, and we’ve actually discovered a few interesting things. Miriam: And how does this work when, for example, a product goes out of stock or goes on sale for a different price?Mark: We keep that information updated live. The stock status is updated based on the information from the Pointy box. We also handle price data, though it depends on what features the retailers is using. Some retailers prefer not to display their prices online.See What's In Store: Google totally sees the opportunityMiriam: I was fascinated to learn that Pointy is the launch partner for Google’s See What’s In Store feature, and readers can see an example of this with Talbot’s Toyland. Can you explain what’s involved for retailers who want their inventory to appear in the SWIS area of the Google Business Profile (aka “Knowledge Panel”) and why this represents such an important opportunity? Also, does the business have to pay a commission to Google for inclusion/impressions/clicks?Mark: This is a pretty exciting feature. It lets retailers display their full product catalogue and live inventory information in the Business Profile on the Google search page. It’s also visible from Google Maps. I’m guessing Google will probably start to surface the information in more ways over time.It’s completely free for retailers, which is pretty interesting. Google Shopping has always been a paid service, so it’s notable that Google is now offering some organic exposure with this new feature.I think that this is going to become table stakes for retailers in the next year or two, in the same way that having your opening hours online is now. Consumers are simply going to expect the convenience of finding local product information online. I think that’s a good thing, because it will help local businesses win back customers that might otherwise have gone to Amazon.We’ve worked a lot with Google to make the setup experience for local retailers very simple. You just link your Pointy account to Google, and your live inventory appears in the Google Business Profile. Behind the scenes we do a lot of technical work to make that happen (including creating Merchant Center accounts, setting up feeds, etc). But the user experience is just a few clicks. We’ve seen a lot of uptake from Pointy users, it’s been a very popular feature. We have a bit more detail on it here.What about special retail scenarios?Miriam: So, basically, Pointy makes getting real-world inventory online for small and independent retailers who just don’t have the time to deal with a complicated e-commerce system. I understand that you have some different approaches to offer larger enterprises, involving their existing IT systems. Can you talk a bit about that, please?Mark: Yes, some larger retailers may be able to send us a direct feed from their inventory systems, rather than installing Pointy boxes at every POS location. We aim to support whatever is easiest for the retailer. We are also directly integrated into modern cloud POS systems like Clover, Square, Lightspeed, Vend, and others. Users of those systems can download a free Pointy app from their system’s app store and integrate with us that way. And for retailers not using those systems, they can use a Pointy box.Miriam: And what about retailers whose products lack labels/barcodes? Let’s say, a farm stand with constantly-changing seasonal produce, or a clothing boutique with hand-knit sweaters? Is there a Pointy solution for them?Mark: Unfortunately we’re not a great fit for those kind of retailers. We designed the experience for retailers who sell barcoded products.Miriam: You’re a former Google staffer, Mark. In local search, Google has become aggressive in taking a cut of an increasing number of local consumer actions and this is particularly hard on small businesses. We’ve got Local Service Ads, paid ads in local packs, booking buttons, etc, all of which struggling independent businesses are having to pay Google for. Right now, these retailers are eager for a competitive edge. How can they differentiate themselves? Please, share tips.Mark: It’s true, lots of channels that used to be purely organic now have a mix of organic and paid. I think ultimately the paid ads still have to be ROI-positive or nobody will use them, but it’s definitely no fun to pay for traffic you used to get for free.On the positive side, there are still plenty of openings to reach customers organically. If small businesses invest in staying ahead of the game, they can do very well. Lots of local product searches essentially have no answer, because most retailers haven’t been able to get their inventory online yet. It’s easy to rank well for a query when you’re the only one with the answer. There’s definitely still an opening there for early adopters.“Pointing” the way to the futureMiriam: Finally, Pointy has only been available in the US since 2016, and in that short amount of time, you’re already serving 1% of the country’s retailers. Congratulations! What does the near future look like to you for retailers and for Pointy? What do you see as Pointy’s mission?Mark: We want to bring the world’s brick-and-mortar retailers online and give them the tools they need to thrive. More than 90% of retail goes through brick and mortar stores, so there’s no reason they shouldn’t have an amazing technology platform to help them. The fragmentation and difficulty of accessing data has held everyone back, but I think Pointy has a shot at fixing that.Miriam: Thank you, Mark. I believe Pointy has what it takes to be successful, but I’m going to wish you good luck, anyway!Summing upIn doing this interview, I learned a ton from Mark and I hope you did, too. If a local retailer you market is seeking a competitive advantage in 2019, I’d seriously be considering early adoption of Google’s See What's In Store feature. It’s prime Google Business Profile (formerly Knowledge Panel) real estate, and so long as SWIS is free and Pointy is so affordable, there’s a pretty incredible opportunity to set yourself apart in these early days with a very modest investment.I’m feeling confident about my prediction that we’re on the verge of a new threshold in user behavior, in terms of people using local search to find local inventory. We’ll all have the enjoyment of seeing how this plays out over the next couple of years. And if you heard it first at Moz, that will be extra fun! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Taking Local Inventory Online: An Interview with Pointy’s Mark Cummins"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Taking Local Inventory Online: An Interview with Pointy’s Mark Cummins"
    },
    {
      "level": "H2",
      "text": "A real-world anecdote"
    },
    {
      "level": "H2",
      "text": "The next big thing in local already exists"
    },
    {
      "level": "H2",
      "text": "The real-world roots of an existing local need"
    },
    {
      "level": "H2",
      "text": "A simple inventory solution is born"
    },
    {
      "level": "H2",
      "text": "Where real-time local inventory appears on the web"
    },
    {
      "level": "H2",
      "text": "See What's In Store: Google totally sees the opportunity"
    },
    {
      "level": "H2",
      "text": "What about special retail scenarios?"
    },
    {
      "level": "H2",
      "text": "“Pointing” the way to the future"
    },
    {
      "level": "H2",
      "text": "Summing up"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}