{
  "url": "https://moz.com/blog/taking-advantage-of-googles-bias-toward-hyperfresh-content-whiteboard-friday",
  "slug": "taking-advantage-of-googles-bias-toward-hyperfresh-content-whiteboard-friday",
  "title": "Taking Advantage of Google's Bias Toward Hyper-Fresh Content - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A recent trend shows Google giving increasing preference to the freshest content in the SERPs. In today's Whiteboard Friday, Rand explains how to take advantage of that preference in ways that don't risk penalties.",
  "content": "Taking Advantage of Google's Bias Toward Hyper-Fresh Content Whiteboard Friday By: Rand Fishkin October 4, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 4, 2013 Taking Advantage of Google's Bias Toward Hyper-Fresh Content Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In the last year or so, Google has increasingly displayed hyper-fresh content in SERPs, leading many marketers to think about how they can take advantage of that preference. In today's Whiteboard Friday, Rand explains a few ways to go about that without risking penalties. For reference, here's a still image of this week's whiteboard: Video Transcription Howdy Moz fans, and welcome to another edition of Whiteboard Friday. This week I want to talk a little bit about Google's strange and overwhelming in some cases bias to fresh content. I want to give a shout out to Glen Allsopp who had talked about this a little bit and written some blog posts exposing some of Google's priorities around freshness or what feel like priorities for them around freshness. Google's been biasing to fresh content, trying to show more and more fresh results, recently published results in their SERPs for several years now, but it's gotten particularly strong in the last 12 months in certain sectors. I think Glen had noticed it very strongly in some of the sectors that he was watching for some of his clients. We have seen it in some places very heavily, in other places not as much. But you can definitely feel it. There are places like Shakespeare plays. This is a search result that a few years ago, even 6 to 12 months ago probably you would not have seen much freshness, and now you're starting to see more and more of these types of things, results that call out when they were published, a feeling that things that are published more recently, even if they don't have as many links or as good of keyword targeting or as authoritative a website, those kinds of things are ranking a little bit higher. You're seeing news results in there, which is a relatively new development, especially on a phrase like this which the intent one might interpret as \"well, they're probably looking for a list or maybe they're looking for plays in their area.\" So more and more of these cases Google is biasing to show recently published results, and, because of that, there are some opportunities for folks in the SEO field. If you're seeing this kind of thing in the results that you're looking at, seeing a lot of dates, especially a lot of recent dates, in particular recent dates on published content that seems to not have the ranking ability that you would expect of the rest of the pages, you could use something like the keyword difficulty SERPs analysis tool from Moz to kind of try and figure that out. This may be a real opportunity for you, and there are a few ways that you can take advantage. Number one, I suggest these kind of anyway. This isn't a, \"Oh, I want to exploit something in Google's algorithm where they're weak, and I'm black hat, gray hat, and I'm trying to exploit it.\" This is actually Google saying, \"Hey, we think users want fresh content, and so publishers please produce it because we're willing to put it in front of our audience.\" I think that's just fine. It could be that Google's a little over the line right now. Maybe they'll swing that pendulum back over time. But number one, find keywords and terms and phrases with fresh results, like we talked about here, and then target them with some new content. Give this a try. Essentially, if you're looking out and you're saying, \"Gosh, this is a hyper-competitive keyword. I'm not sure that I can normally rank here. Let me see if I can get there for a day or a couple of days. Do I have the ability to start ranking on fresh stuff?\" If you can't hit the front page, the first page of results with that particular phrase, try a little bit longer tail keyword term. Number two. If you have some old content, I think this is something that many of us experience. We have older content that's targeting valuable keywords, important keywords that are critical to our brand to attracting the visitors that we want, and those have fallen down in the rankings. It may be that you used to be in the top three or four, and now you're in the bottom half of the top ten results or on page two or three. Consider an update. I've done this several times and had a lot of success with it. Just updating an old blog post or an old resource, making it fresh again, adding new things, things that have emerged or come to light over the past few months or few years. Then a republication or promotion. The critical thing here is to think about: Do you want to produce that at the same URL, or do you want to do a redirect? This is a little bit tough because, generally speaking, what I like to do is keep these at the same URL if they are outside of an RSS feed. So, essentially, not a blog post or not a news item or those kinds of things. I like to do the redirection when it's, \"Hey, I'm rewriting this old blog post. I've got a new version of it. You know what? I'm going to 301 redirect that old version to the new version.\" Or if I really want to keep it available at the old URL, I'll use rel=canonical to say, \"Hey, this is the more updated version. This is essentially a duplicate, just a more recent duplicate, and here's the old one if you want to see that.\" Number three. If there are some hyper-valuable keywords that are consistently showing fresh results, you're just seeing this over and over and over again, well, maybe it's time for a regularly updated series. Think about columnists who do syndication, or they write a weekly column on a particular topic or around a specific subject or they do something once a month. This might be a big opportunity for you to say, \"Hey, you know what? What's a piece of content that we could refresh every month, that would be on this topic, and we could consistently be in those fresh results and we could always be delivering the most recent, most valuable stuff?\" Good example is in the sports world. The sports world changes so fast. There are different scores, different teams, rankings, standings. An old page is nearly useless. Unless you're updating that page every time there's new information, it's not that valuable. So I think those are exactly the kinds of places where you might consider some form of regularly updated either series, new posts, new publications, or a single page that you're regularly updating. Then number four, in terms of doing some research to try and find these types of phrases, obviously you can check out the SERPs if you're tracking in Moz Analytics and you're looking at your search results. You sort of can see those listed in there. But you might also use, to find some new phrases, things like Google Trends, Ubersuggest, which scrapes Google's suggest results. News sites, a lot of times when things are published that are news oriented, people will be doing searches around them. You can look at aggregators like Reddit or Alltop, social sites, obviously Twitter and Facebook, and these types of things to keep an eye on that. Double Click Ad Planner, which sort of has similar data too, but seems to be slightly different than Google Trends, and sometimes you can see some more stuff there, and Fresh Web Explorer, which of course is part of the Moz Analytics research tools package to find those trends. Last thing I'm going to say on this. There are a few rules that I have for fresh content. First off, fresh content doesn't just mean recycling and republishing. I realize that, because of this bias, sometimes, and Glen pointed this out in some of his posts, that you can take advantage of this simply by republishing similar content again and again. I would highly recommend against doing that. I think you're putting yourself at risk for things like Panda if you do it at a large scale or for manual penalties or for having low click-through, low engagement, high pogo sticking back to the search results. That kind of stuff is dangerous. Make sure you're serving the visitor's intent. Remember that with fresh content there's probably a recency intent on top of whatever other layers. So, if I'm publishing something about Shakespeare's plays, I don't just want to list, \"Well, here are all the plays, and they were all written in the 17th century or 16th century, and so they haven't changed. He's not writing any new ones. Yes, but new things are constantly coming out. The news results show different types of stuff. The quotes are showing which ones are popular. There's a movies page that's showing which Shakespearean plays are being made into movies or which new spin offs are being done with Shakespearean concepts in them. So I do recommend that. I also suggest, if you can, get your site, get your feed included in Google news, and if that's not a possibility, at least have an RSS feed and be doing social shares on top of the content that you're publishing. Then last, but not least, be cautious about abusing dates. I realize that there's a few folks in the gray hat, black hat world who have been doing this and been having a little bit of success with it on and off, which is just sort of modify the dates on the page of publication to fool Google. I don't know why it seems to work sometimes. Or fooling them by adding new comments, which is sort of weird. We've seen this a few times with Moz blog posts, where an old blog post gets a comment. That comment has the date of the comment's publication, and that actually will make the results show up with that newer, fresher date, which is a little bit awkward and odd. I don't think that's a bad thing if it's just happening naturally and Google happens to be messing up, but if you're specifically abusing it, I think you could get into trouble. So I look forward to reading some great comments about what you're seeing in fresh results, how you're taking advantage of them. I'm sure you have some great suggestions for our readers as well. Take care. We'll see you again for another edition of Whiteboard Friday. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Taking Advantage of Google's Bias Toward Hyper-Fresh Content"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Taking Advantage of Google's Bias Toward Hyper-Fresh Content"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}