{
  "url": "https://moz.com/blog/tangential-content-ideas",
  "slug": "tangential-content-ideas",
  "title": "How to Come Up With Tangential Content Ideas — Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In this brand new episode of Whiteboard Friday, Amanda Milligan of Fractl is here to walk you through what tangential content is, why it's useful, and how to create it. ﻿",
  "content": "How to Come Up With Tangential Content Ideas — Whiteboard Friday Whiteboard Friday | On-page SEO | Content Marketing By: Amanda Milligan December 4, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Amanda Milligan December 4, 2020 How to Come Up With Tangential Content Ideas — Whiteboard Friday Whiteboard Friday | On-page SEO | Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Your brand has probably used content marketing to generate awareness and engagement, but have you tried tangential content? In this brand new episode of Whiteboard Friday, Amanda Milligan of Fractl is here to walk you through what tangential content is, why it's useful, and how to create it. Click on the whiteboard image above to open a high resolution version in a new tab! Video Transcription Hi. My name is Amanda Milligan. I'm the Marketing Director at Fractl, an agency that helps brands build their organic growth. Today I'm going to talk to you about one of the strategies we use for our clients, and it's called tangential content. If you haven't heard of it, don't worry. Odds are you might have already done it and not even known. Today we're going to talk about what it is, why you should include it in your strategy, and how to come up with content ideas that are tangential. What is tangential content? So to start, what is tangential content? It's not used a ton, this phrase, but we and some others I think have kind of adopted it because there wasn't a ton of language around it. So the word \"tangential\" means lightly touching or peripheral. So not really as related is basically what the word means. Tangential content then is content that is not directly related to your product or service offering. In other words, it's not very on brand. Maybe the opposite of tangential content is very topical content. So we create both topical and tangential content at Fractl, but they each serve different purposes, which is what I'll get into. But just to give you an example of the difference between the two, down here I have two different articles you can create for let's say a dating website. So a topical article for a dating website might be here are seven profile red flags to watch out for. So the reason that's topical is because we're actually talking about a dating site or a dating app, and so is this article talking directly about things to watch out for on a dating profile. So it's really relevant to the actual offering that you're making as a brand, and it's helping even users. So it's targeting your direct audience and then also some people who might use other apps. Tangential content in this category might look like, \"couples voted these seven places as the most romantic cities in America\". So now we're not talking about dating apps anymore or any dating websites. We're talking about partners and relationships. It's still relevant in the grand scheme of this niche, but it's not directly related to the product or service. So this is just an example of how topical and tangential can look a little different. Another example I like to use is for Porch.com. They are a home improvement website. We've done all kinds of content for them that fall in both buckets. So for topical content, we've done the cost of home improvement over the lifespan of living in a house, and we've done tangential content like how to cook with your family or backyard games or something. So I'll explain a little bit more over here how to come up with ideas like that. But you see this all the time in marketing even if you haven't recognized it or known what to call it. We actually did a study very recently where we looked at the finalists for the Content Marketing Awards. We excluded agencies, but we looked at a bunch of brands, and we saw that, I think, at least 6 out of 10 of those brands that we examined had tangential content on their blogs. So it's a pretty common practice, and whether people even recognize it or not, it can be really effective. Why create tangential content? So why bother with content that isn't entirely on brand? A lot of people would hesitate and say, \"I want to do stuff that only makes sense for our primary audience, that will convert users, or build a really relevant audience.\" Link building But there are some incredible benefits for tangential content. First of all, SEO people love the link building aspect. So if you're interested in getting some of the best links you've ever gotten, really high quality links from some of the best media publications, we haven't found a better way to do it than using tangential content. Why? Because when you're doing something that's not directly related to your brand, you're able to reach a more general audience, really tap into compelling ideas that will appeal to more people and thus more publications. So it increases your chances of getting that media coverage. Brand awareness The second is brand awareness. For similar reasons, if you're able to get that content out there and appeal to more people, that means more people are seeing your brand. So what we do at Fractl is essentially come up with these types of ideas. We build an entire content project around a new dataset or we run a survey or we collect new information based on this tangential idea, and then we pitch it to the media. So when you have this new study or this new report done by your brand and you get it covered on some of the top national media sources, that's pretty incredible brand awareness, not to mention authority, because when your brand is mentioned as so-and-so study shows this, you're framed in a really authoritative way, usually toward the top of the article as the source of the information that this publication has deemed worthy of talking about. It's pretty incredible. So that's kind of what I'm talking about here — national media coverage. Additionally, if you're doing tangential content on your blog and you're trying to get more organic traffic and more presence in the SERPs, that is another way that you can really build out the top of the funnel marketing efforts that you have. So if you're kind of zooming out and thinking how can I reach people in this industry who might not already have decided that they want to purchase our product or service but still get our name out there, then you can target more tangential, top of the funnel keywords and start ranking in the SERPs to get more awareness. So these are really incredible benefits. Social shares Finally, social shares, because, as I'll get to, when you come up with tangential ideas, like I said, you have much more room to play around and be creative, which generally means you can come up with ideas that are much more compelling and emotionally resonant, and those are the types of ideas that get all kinds of social shares. People want to send it to their friends. They want to react to it on social, etc. So really some great stuff here. Whether you're coming at it from a brand perspective or an SEO perspective, you can get a lot out of doing this type of content. How to create tangential content So finally, how? The first thing I tell people is to zoom out. If you have typically only been creating topical content in the past, you're probably not used to thinking about your greater industry outside of your value proposition. 1. Zoom out So I encourage people to start by literally just thinking, \"What is our greater category?\" So if you work as car insurance, then automobiles or transportation even. It's like, \"What would the top category in a publication be that fits your brand?\" So for this example, I put time management software. So if you are a SaaS company and you are time management software, maybe your general topic would be work and productivity. So that would be the general zooming out. Once you've zoomed out, then you want to think laterally. This is how we describe it. What I mean by that is: What are all of the subtopics that fall under the zoomed out category? What are all of the other things we can talk about that aren't directly related to our brand? So for work/productivity, I wrote down some examples of what that could be. Sorry, not work/productivity, but work and productivity. It could be either one. So just the workplace, that's the general gist. So maybe it's about your salary, your salary aspirations, are salaries fair across different companies, within companies. Anything salary related, maybe that would get published on financial publications in addition to ones that cover the workplace or business publications. Office gossip, that's something a lot of people can relate to, and you can pitch publications that are more on the lifestyle side of things. That's an example of getting very generally appealing. Anybody who's worked in an office, even if they haven't participated in office gossip themselves, probably knows that it has happened or that it's caused issues or what have you. So you can go that route. Work/life balance. We're recording this in the time of COVID. That's even more applicable now. You can get a really timeliness factor to it. But when you talk about productivity, work/life balance becomes a question a lot of the time. It's how can you be more productive without sacrificing your personal life? Dating coworkers. Again, you're taking a totally different ... You're combining the work niche and relationship dating lifestyle niche. This could be something that even the dating site could even do. They can talk about dating coworkers. It's a tangential idea that actually applies to multiple industries. Finally, I have up here job satisfaction. So this is more based on the work side of things, how good do you feel about your job, are you looking for another one. Just getting a sense of how people feel. All of these things qualify as tangential content ideas for a time management software company. So I wanted to illustrate that because it shows how many things are now within the realm of possibility for you that you might not have realized before. When you can play around with this many types of ideas, you can get very creative with the methodologies and the things that you explore. It gets pretty fun I have to be honest. 2. Consider emotion So down here, and honestly this section deserves its own whiteboard, after you've done this and maybe you've written down 70 ideas based on, oh wow, we're able to zoom out and think about all kinds of stuff, so much comes to mind, think about emotion. Most things that do well have an emotional impact on you. Even if it's how-to content, you might be thinking that's usually pretty straightforward and dry. If you're helping somebody and they're getting value out of it and they're reading it like, \"Oh, thank God, I was looking for an answer to this,\" that is an emotional reaction. So you have to be thinking about how emotionally resonant these ideas are. So part of how we score our ideas or prioritize them or measure their likelihood of succeeding is to think about the emotional components. You can kind of see how these play into these ideas. Salary aspirations, people tie a lot of their worth at work to their salaries. That's a pretty emotional thing. Dating and gossip at work, obviously those social dynamics can get pretty intense. Work/life balance, again now you're talking about your family and your relationships with people. Job satisfaction, similarly to salary aspirations, that can really impact your life. So then I actually recommend to people, when they have ideas, to literally write down all these emotions and see what is going to be part of like the essence of the actual idea. Then, when you're able to say, \"Okay, this idea is really going to emotionally resonate with people. They're going to see themselves in this. They're going to be really interested in the results. Then you can start honing in on: What are the different methodologies we can use? What kind of data is available or that we have internally or that we can find or collect that can illustrate this, get at some of those truths that we don't have access to right now? So that's a great place to start if you have kind of questions. Like if you have office gossip and you're like, \"I wonder how many people do feel like they participated in that? I wonder how many people have actually had some kind of ramification at work because of that or have suffered themselves?\" I don't know the answer. So if you want to run a survey about that, that could be really interesting to people. So zoom out. Think about all the different types of subtopics you can talk about now that you have zoomed out. Then consider the emotional factors of all those ideas and then start sorting based on that. See where you can collect data to kind of fulfill those types of ideas. Once you're onto something like that, a lot of the time your intuition will tell you. If you find it interesting, if you want to know the answer, certainly give it a shot executing it. Then you can pitch it to publications. So that is the short version of how we do all this. I'm happy to answer any questions you have. You can find me on Twitter @millanda. But that is the gist of tangential content. It is extremely effective. Give this a shot. Whether it's on your blog or if you do decide you want to pitch it to media publications and go for those links, I highly recommend it. Thank you so much for watching. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "How to Come Up With Tangential Content Ideas — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "How to Come Up With Tangential Content Ideas — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "What is tangential content?"
    },
    {
      "level": "H2",
      "text": "Why create tangential content?"
    },
    {
      "level": "H3",
      "text": "Link building"
    },
    {
      "level": "H3",
      "text": "Brand awareness"
    },
    {
      "level": "H3",
      "text": "Social shares"
    },
    {
      "level": "H2",
      "text": "How to create tangential content"
    },
    {
      "level": "H3",
      "text": "1. Zoom out"
    },
    {
      "level": "H3",
      "text": "2. Consider emotion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Amanda Milligan\n          \n            Amanda Milligan"
}