{
  "url": "https://moz.com/blog/targeting-european-online-markets",
  "slug": "targeting-european-online-markets",
  "title": "Targeting European online markets - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This post begins a series during which I  will explore various issues any online business seeking visibility in (non-English) European markets has to face with.  As starters, I’m going to run a short summary about the market area because I think most SEOMoz readers are US based and with limited…",
  "content": "Targeting European online markets Online Advertising M By: mozUser1469147917838 December 5, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! M By: mozUser1469147917838 December 5, 2006 Targeting European online markets Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This post begins a series during which I will explore various issues any online business seeking visibility in (non-English) European markets has to face with. As starters, I’m going to run a short summary about the market area because I think most SEOMoz readers are US based and with limited knowledge about Europe as market area. Europe consists of nearly 50 nations, 25 nations are members of European Union. Probably I can’t overstress the meaning of this for any online business. In terms of SEO the main impact comes from where you host your server and do you have a national top level domain. The thin red line that runs across all the search engines is simple: sites with local hosting and a national top level domain (preferably with keyword in domain name) get favoured in SERPs. European population is approx. 710 million people, making Europe the 3rd largest continent in terms of population right after Asia and Africa. There are over 200 European languages (and many more spoken by citizens whose family origin is from other continents) in addition of which several languages contain localized dialects etc. features One of the problems when building online services for European markets is taking the language factor into account – What is the size of audience speaking language X? Where do these people live (for example Dutch, German, French are official / semi-official languages in several countries – this affects where you choose your hosting and domain, and what search engines to target for). Writing page content in English IMHO is suitable option only if the target audience is either worldwide or English speaking. Europe has traditionally been one of the most influential economical areas globally, and it still is ruling the charts with estimated nominal GDP of 13.4 trillion USD. Of course, there are huge national and local differences in GDP and acknowledging these can be crucial when launching online business. If comparing US and European online markets, there is one very distinct difference - online business has never thrived in Europe similar to US. Yes, Europe has several successful online brands (as well as failures) but in general the European view to online business is much more reserved. Online payment methods in Europe are highly different than in US. In general, people own and use credit cards much, much less than in US. I would even go to lengths and say that many Europeans dislike the idea of owning and/or using a credit card (and as always, there are large national differences). This has lead to situation where the most important (and above all, most trusted) online payment gateway’s are usually national banks. Making online payments has been made very easy and secure for customer, but be prepared to sign up with 5-10 payment processors for each nation you target. Tax and custom policies inside Europe are very varying, and there is a lot of confusion about this amongst consumers. Below are rough generalisations when working inside European Union: When ordering items inside European Union, the customer does not have to worry about VAT or customs. The VAT rate will be the same as in the country of origin of store and there will be no customs.Ie. I live in Finland. If I buy stuff from shop that is VAT registered in Germany, the total price of my order will contain a 16% VAT. If I buy a similar items from a shop that is VAT registered in Finland, the price of product will contain 22% VAT. When ordering items outside European Union, the customer must pay local VAT, product specific customs (anything between nothing to 50%), and possibly even postal charges by the customs if the value of order (including postal charges) exceeds a limit specified by governing legislation (usually about 50 US$)Ie. I live in Finland. If I buy CD/DVD’s from US worth 100 Euro’s the customs will charge me for additional 26 Euro’s. If I buy clothes with the same amount, the customs will charge me for additional 35 Euro’s. And then there is of course the Europe that is not part of the Union. Sounds simple? General marketing and consumer legislation in Europe is much stricter than in US. In nutshell a majority of European marketing and consumer legislation is heavily based on protecting the consumer or the weaker (purchasing) party. There are lot’s of national level clauses that for example define very precisely the limits of acceptable and not acceptable marketing and whole lot of other do’s and do not’s. Cross the line, and you might end paying considerable penalty or losing your business license. The above lists just some of the issues any online biz targeting European markets has to deal with. I’m sure I forget lots of things (and there are even issues You might disagree), but feel free to share your opinions and views. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Targeting European online markets"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Targeting European online markets"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "mozUser1469147917838\n          \n            mozUser1469147917838"
}