{
  "url": "https://moz.com/blog/targeted-impact-link-building-guide",
  "slug": "targeted-impact-link-building-guide",
  "title": "The Guide to Targeted-Impact Link Building - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Links drive rankings — that’s one thing that SEOs and marketers can agree on. But which rankings, and for which pages on your website? Use this guide to build links that impact rankings for specific pages on your website.",
  "content": "The Guide to Targeted-Impact Link Building Link Building By: Garrett French September 1, 2021 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Garrett French September 1, 2021 The Guide to Targeted-Impact Link Building Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This piece was co-written with James Wirth. Links drive rankings — that’s one thing that technical SEOs, content marketers, digital PR folks, and even some of #SEOTwitter can agree on. But which rankings, and for which pages on your website? If you’ve ever wanted to build links that impact rankings for specific pages on your website, we’ve got the guide for you. Selecting pages for a targeted-impact link building campaign Preparing a link building campaign often involves helping the client refine their goals in order to be able to effectively measure the campaign. The first step is typically level-setting based on what we can learn from available data. Comparing link metrics against top competitors will help us size up the competition. Layered against estimated traffic, Page Authority, and SEO “difficulty”, and we’re able to better understand the opportunity. While this isn't particularly complex or inaccessible, it's likely deeper than the client has gone, and very often they’re happy to move forward with data-informed recommendations. If we were preparing a link building campaign for Moz, for example, we might pre-select some sections of the site to focus on in the analysis. Suppose we start with /products/, /tools/ the beginners guide pages (love those), and a few others that jump out. Here are a few pages from that list: From here, we would compile a list of competitors based on top keywords for each of the pages. That will let us compare average metrics across the top competitors to the metrics for Moz’s pages. This dataset represents the top 10 competitors from the top 10 keywords for each of Moz’s pages. Once compiled, we’ll have 90-100 rows of competitor data, give or take, depending on where Moz ranks for each page in the list. We can average the competitor data to make it easy to compare, and spot-check from there to look for outliers, or filter out branded or stray keywords we don’t want to compete for anyway: Now it’s time to look for opportunities. We can eye-ball the metrics in a shortlist like this, but if we’re looking at hundreds or thousands of pages (even after filtering it down), this gets a little cumbersome. Prioritizing the pages will help us look more quickly through the list and find the best opportunities. In a scenario where it’s a short pilot program, some of these competitors have scary-high linking root domains, and we’re going to have an idea of a monthly budget to set our pilot up for success by not biting off more than we can chew. So, we’ll add a couple columns to help some of these stand out. To help find the low-hanging fruit, we might look at the relationship to the gap in linking root domains of the competition and our potential campaign page, and the search volume from those top 10 keywords: By dividing the link gap into the search volume, we can look at higher priority pages for the campaign based on the probability of reducing the linking root domain gap, in order to improve the client’s share of voice on high-converting pages. Adding rank-order to the rows will help us look at the best potential opportunities: From this group of pages, the Moz Pro product page seems to be a pretty tasty candidate. We might stay away from the free SEO tools page since, well, “free” doesn’t necessarily scream REVENUE, but it’s worth a conversation to verify. The same can be said for a couple of those beginner guide pages as well. Even if none end up in the campaign, we'll still be able to assess the link gap for pages that ARE the targets, and help steer Moz towards effective linking choices After a few refinements, we’ll have a very solid set of potential campaign pages to recommend! Finding your most-impactful audience We build out our model of audience based on the specific client URL that we're building links to. So, for sales pages, we're thinking about where, how, when, and why that product or service fits into the customer's life. What are its various contexts of use? What circumstances or conditions benefit from the use of this offering? The offering’s contexts of use are intrinsically relevant to the target URL, whether or not the same keyword is used to describe them. For example, if we target the Moz Pro page identified above, we’d start asking ourselves: “when is it that agencies and in-house SEOs start thinking about SEO tools?” Perhaps we explore that point where someone has to pick up the SEO projects left behind by someone whose career has taken them elsewhere. What’s the checklist like for following behind another SEO? Additionally, what about an SEO crash course for folks who suddenly find themselves in charge of an SEO department (we’ve spoken with people in this situation before). Both of these scenarios could give ample reason and circumstance to mention SEO tools. For either of these examples, an expert survey, expert interviews, and off-site informational placements could enable contextual linking opportunities. Let’s step outside of the SEO space though and think about insurance sales pages. We could begin mapping out the circumstances and events in life as one decides to seek insurance: Events like having your first child, becoming an independent contractor, buying a home, having a cardiac-related scare, etc. From these \"use-case brainstorms\", we work up into problem areas — and related queries — that the target audience might be having. These give us a basis for discovering publishers that align the audience of the target page with its contexts of usage. For Moz, we’d likely focus on marketing trade pubs — SEO or not. For the insurance pages, we’d likely start with parenting blogs, health/fitness publishers, websites relating to starting a business, and potentially realtor sites. For good measure, we frequently examine high ranking pages in the target keyword space to learn more about what we call the \"linking context\" for a given set of keywords. We're especially focused on the titles of linking pages. This gives instant insight into topics that make sense for prospect discovery. We usually find things like long form guides, tons of coupon pages, review sites, forums, etc. — all of this gives us a better sense of the linking context. Combined, use-case brainstorms and linking context analysis help us build out a full picture of the audiences and key problems that will lead us to suitable publishers. Link outreach Outreach is simple. Well, sort of. If you understand what the publisher wants, which is ultimately related to how they make a living, then you figure out how to pitch and deliver just that. If you're in the digital PR space pitching journalists, you're pitching your ability to drive \"audience engagement\" (as we've picked up from Neomam CEO, Gisele Navarro). So your subject line and offer need to clearly drip with page views, click-throughs, and social shares. And your content has to deliver. After all, with the high content costs involved you’ll need to reuse your contacts! If you're in broken link building (and to a lesser extent, a tactic like unlinked mentions), you're offering \"visitor experience improvements\" to a webmaster or page curator who's dedicated to a particular audience. With this in mind, your subject line and offer (a fix) must demonstrate value to the target audience, as well as mention the impact the broken link could have on an expectant visitor in need. We find that when pitching guest content, especially to sales-supported publishers, we see higher conversions when we pitch topics that will help drive the publisher’s traffic or conversions. You can learn more about our guest content approach in this Whiteboard Friday, but again, we lean into pitching “publishing benefits” to the site owner. So your key question: what is this person's purpose for publishing to their particular audience? Knowing this helps you determine an offer that will resonate, and earn you a link. One last bit of advice on outreach: avoid directly implementing subject lines, templates, etc. from other experts. Be inspired by the experts, but remember that their advice involves very specific offers, audiences, and publishers, and they are unlikely to align with your actual circumstances. Study them, for sure, but only for understanding general guidelines. A quick word on link building tactics Every functional link building tactic earns its links by meeting the target publisher’s unstated “price” for reaching their audience. The publisher’s cost can certainly be money, but in the earned link space, we’re usually talking about supplying publishers with value such as exclusive news and information, previously unstated but highly useful advice, articles that could help them sell more products or services, and useful corrections that shore up authority. We’re reminded, as we discuss value exchange, of a campaign by the link builder Debra Mastaler, in which she offered a cement client’s t-shirt to the members of several dues-supported professional organizations. She not only earned links from the organization websites (who got to provide a “special perk” to their members), but earned business and, of course, brand visibility within their precise target audience. Wow! So, while a free t-shirt may not work in all verticals, Mastaler reminds us of the most overlooked aspect of link building campaigns: finding publishers who reach your target audience and asking “okay, what can we offer that they will actually want?”. Creative, entrepreneurial thinking — perhaps you could call it marketing instinct? — remains the link builder’s most important tactic. That said, reviewing the existing array of link building tactics can be very useful, especially as you’re starting out, just as a budding chef spends time reading cookbooks to understand key ingredients and guiding principles. And as it is for the budding chef, your greatest lessons will come from the hours spent in the kitchen, working on your craft. Check out this graphic for a quick overview of some of the more common tactics and their relationships between the publishers and your desired SEO outcomes: Measurable link building wins This is one of the most challenging aspects of a campaign for myriad reasons. It’s also one of the most effective ways to retain clients, or budget, if you’re on the in-house side. There are a number of ways to track the performance of a link building campaign, but which methods are chosen largely depends on the tactics deployed. In our case, we’re focused on the content side, and specialize in earning placements to hard-to-link sales landing pages. We approach our measurements of success from the perspective of SEO-related metrics that will show both leading indicators of improvements, and the right performance indicators once we have had impact. Early on in a campaign, we often see a worsening of average position. The cause of this is typically new keywords ranking on the campaign page. Because the page initially begins to rank on SERP #7 or #8, this will initially pull down the average rank of the page, even if the rank for established keywords is improving. This graph underscores one of the risks of focusing too heavily on rank as the primary success metric. While average position (the purple line) shows a decline in average position, we can see in the stacked columns that not only is the total number of ranking keywords growing, it’s also growing nicely in positions 1-3 (the blue segment at the top), as well as positions 4-10 (the orange segment 2nd from top). Just not enough to keep up with newly ranking keywords further down in the SERPs. Correlating ranking changes to ranking keyword count was paramount to continuing this campaign. While we track and report on average position over time, we certainly don’t lead with it. Instead, we focus on metrics that more directly correlate to traffic and conversions, which positions us for demonstrating positive ROI of the campaign. The metrics that matter for us are share of voice (a search volume-weighted CTR model) and Moz Page Authority. Share of voice The benefit for us of prioritizing share of voice over ranking is that it normalizes dramatic shifts in time series reports based on ranking fluctuations from low-volume queries. Ranking reports, as we all know, can be a serious roller coaster. Share of voice, on the other hand, aligns with an estimated traffic model, expressed as a percentage of total traffic for the keyword set. As seen in the graph above, we also include a control group: a second set of pages on the site that are not part of the campaign (and preferably not part of any concerted SEO effort). This second set of pages is chosen from similar sections of the site and from similarly ranking and visited pages when possible, to measure the success of our link building campaign against. While the graph above does indicate positive growth just with the bars, when we determine the percentage difference between our campaign pages and the control group, the results are even more dramatic. Page Authority Another critical metric is Moz Page Authority, which is often another early indicator of imminent success. We sometimes see Page Authority increase even before we see improvement to rankings and share of voice. And again, tracking against a control group helps to underscore the value of our work. Another benefit of Page Authority: Third party validation of the direct impact of our work. While many factors outside of the scope of our link building campaign may affect rank, such as core algorithm updates, gaps in page content, topic misalignment or technical issues inhibiting Google’s full valuation of the page), a metric that is best influenced by “improving a page’s link profile by… getting external links”, aligns very well with our offering. And hey, we think using a third party metric to validate the hard work we’re doing for our clients is pretty okay in our book (now in its second edition!). Questions? More link building tips? Share them with us on Twitter. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Guide to Targeted-Impact Link Building"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Guide to Targeted-Impact Link Building"
    },
    {
      "level": "H2",
      "text": "Selecting pages for a targeted-impact link building campaign"
    },
    {
      "level": "H2",
      "text": "Finding your most-impactful audience"
    },
    {
      "level": "H2",
      "text": "Link outreach"
    },
    {
      "level": "H2",
      "text": "A quick word on link building tactics"
    },
    {
      "level": "H2",
      "text": "Measurable link building wins"
    },
    {
      "level": "H3",
      "text": "Share of voice"
    },
    {
      "level": "H3",
      "text": "Page Authority"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Garrett French\n          \n            Garrett French\n          \n            Garrett French"
}