{
  "url": "https://moz.com/blog/technical-seo-expert-round-up",
  "slug": "technical-seo-expert-round-up",
  "title": "According to the Experts: 5 Technical SEO Trends to Watch in 2021 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "To find out more about the state of technical SEO in 2021, we asked seven industry experts for their thoughts and advice.",
  "content": "According to the Experts: 5 Technical SEO Trends to Watch in 2021 Technical SEO | Marketing Industry By: Morgan McMurray March 9, 2021 Table of Contents Copied! By: Morgan McMurray March 9, 2021 According to the Experts: 5 Technical SEO Trends to Watch in 2021 Technical SEO | Marketing Industry It’s no secret that SEO relies heavily on technical components to drive site rankability, and with so many emerging technologies, new tools, and metrics (*cough* Core Web Vitals *cough*), you might be wondering whether these constant updates will affect your more technical work. To find out more about the state of technical SEO in 2021, we asked seven industry experts for their thoughts. The overwhelming answer? Keep doing what you’re doing. “The core essentials in 2021 will remain about the same — every SEO needs to understand the fundamentals of crawling vs. indexing and the technical basics that have to be met before a site can rank,” says Moz Search Scientist, Dr. Pete Meyers. “All the fancy footwork in the world won’t get you anywhere if there’s no floor beneath you.” But what should that floor be constructed of? Read on to find out! 1. Focus on the fundamentals Click to tweet this! Technical best practices are the “best” for a reason, so having a strong foundation of basic technical SEO skills is still a must. “For me, the most underrated technical SEO strategy has always been the fundamental best practices,” says consultant Joe Hall. “It might sound surprising to some, but the vast majority of my clients have a difficulty in grasping the importance of best practices or just the basic fundamentals of SEO. I think this is in large part because of our community's focus and attention on the ‘next best thing’, and not very often talking about the basic fundamentals of technical SEO.” Those fundamentals include hard skills like understanding how to recognize and fix crawlability, indexation, accessibility, and site performance issues, but also how to prioritize the issues you come across. SEO expert Lily Ray notes that prioritization is an area of improvement that novice technical SEOs need to address first, as they may be more inclined to cite small things as major problems when they’re really not: “It is common for new or junior SEOs to send a laundry list of technical items as exported by [SEO tools] directly to clients, without prioritizing which ones are the most important to fix, or knowing which ones can be ignored,” she says. “In many cases, the tools don’t even flag some of the more severe technical issues that may be affecting crawling, indexation, or rendering… Good technical SEOs are able to pinpoint real problems that are having a significant impact on the website’s ability to rank well, and they know which tools or other resources to use to be able to solve those problems.” So start taking note of not just the what when it comes to technical issues, but also the influence those issues actually have on your site. Need to brush up or build on these hard skills? Not to worry — Moz Academy recently released a Technical SEO Certification that can help you do just that! Sign Me Up! Beyond the more hands-on, practical skill sets required for building and maintaining search-optimized websites, our experts agree that basic soft skills are just as important, with several citing the need for cross-team collaboration abilities. “Technical SEO implementations generally require working with multiple teams... which means there’s a lot of partnership, persuasion, give and take collaborations,” says Alexis Sanders, the SEO Director at Merkle. “Having project management, client services, storytelling, and communication skills will support implementation.” So don’t get stuck in the weeds of your technical work — make sure you’re in constant communication with the teams and stakeholders who will help support your initiatives. 2. Gear up for Core Web Vitals Click to tweet this! One of the hottest topics in the industry right now is no doubt Core Web Vitals, the new Google ranking factors update expected in May 2021. But do technical SEOs really need to worry about them? The experts say yes, but to work as a team to address them, and make your SEO voice heard. Alexis Sanders puts it this way: “The page experience update consists of Core Web Vitals, mobile-friendliness, web app security, and removing interstitials. Regardless of how teams are structured, making progress is going to require a wide array of talents, giving SEO a more involved seat at the table, as these elements affect our bottom-line.” When prioritizing what to focus on, make sure that improving site speed is at the top of your list. “If you only work on one area of Technical SEO in 2021, make it site speed,” advises Kick Point President Dana DiTomaso. “Site speed is one of those great parts of technical SEO where the benefit isn't only for search engines — it also helps the people visiting your website. Remember, not everyone is coming to your website using the latest technology and fastest internet connection.” When asked about their favorite ways to optimize, here’s what the experts suggested: Start using a content delivery network, such as cloudflare.com. Implement server-side caching for markup and design assets like CSS and JavaScript, and minimize the number of individual requests made for each page by bringing CSS and JavaScript in-line.Optimize media files by converting to next-generation formats and compressing for size and use of data.Use tools like BuiltWith, Wappalyzer, and Lighthouse to investigate what third party scripts have been loaded on a page, and remove them if you no longer need them, or move as many as compatible to a tag management tool. Focus on image performance optimization. Work with analytics and other internal teams to establish processes and expectations for adding and removing tagging. Set requirements and expectations around page speed early in the development process. Addressing any site speed and usability issues now will set you up to better weather rankings shake-ups caused by Core Web Vitals. Click to tweet this! 3. Use schema and structured data strategically To ensure that crawlers can read, index, and serve the content of their sites to searchers, many SEOs rely on structured data and schema frameworks to organize everything — as well they should. But when implementing structured data, the experts agree, make sure you’re using it to achieve specific goals, and not just because you can. “Some structured data has material impact on search results or how Google can process and understand a site, while other structured data will be totally irrelevant to any given site or have no measurable impact,” says Dr. Pete. “We need to use structured data with clear intent and purpose in order to see results.” Lily Ray agrees, pointing out the debate on the topic of schema within the industry: “There is a wide range of opinions on this topic within the SEO community, with some SEOs wanting to ‘mark up all the things’ and others not believing schema is important if it doesn’t generate Rich Results. Personally, I like to apply structured data if I believe it can provide search engines with more context about the entities included in our clients’ websites, even if that schema does not generate Rich Results. For example, I believe that adding Schema attributes related to your brand and your authors is a good approach to help solidify information in Google’s Knowledge Graph.” The takeaway? Get clear on your goals, and implement structured data if it makes sense for your strategy, but don’t “mark up all the things” if doing so will create unnecessary work for you and your team without bringing about the results you’re looking for. 4. Leverage automation to get things done Click to tweet this! Emerging technologies don’t always stick around long enough to become useful, but one innovation that won’t be going away anytime soon is using languages like Python to help automate various workflows, like data analysis and research. “The technical SEO industry has been exploding with new ideas and innovations in the past couple of years, particularly related to analyzing data at scale and automating SEO processes, which has resulted in programming languages like Python moving into the spotlight,” says Lily Ray. Why is automation important? Not only can it make your day-to-day work easier and more streamlined, it can have positive effects on your business as well. “I still think that improving time to task completion (performance optimization) is core to every business,” says Miracle Inameti-Archibong, the Head of SEO at Erudite. “Not just because of the page experience update coming in May, but because it affects all channels and directly affects the bottom line of the business (sale, leads) which is what key decision-makers are interested in.” In 2021, explore ways in which automation can help you achieve both your technical SEO and broader business goals more effectively. 5. Don’t forget about analytics and reporting Click to tweet this! SEO success is incremental and gradual, usually taking months to years before you can definitively show how the work you put in has paid off. But if something goes wrong? Well, Dr. Pete has the perfect analogy: “The truth is that technical SEO is often like washing dishes — no one gives you much credit for it, but they sure notice when you break something.” While technical SEO is the basis for all other SEO work, your non-SEO co-workers and managers will likely pay attention more when things are going wrong than when they’re going right. To help mitigate this issue, he suggests steering clear of “vanity metrics”, such as pages indexed, and instead “showing how a clear plan of action led to improvements in relevant rankings, traffic, and sales.” Click to tweet this! Make sure you’re outlining specific metrics and goals from the start of every campaign, which will help guide your efforts and give you an easier framework for reporting on things down the line. And don’t forget to factor in outside forces that may be affecting your results. “Organic traffic can be impacted by a lot of external factors, or your other, non-technical SEO campaigns,” says Tom Capper, Moz’s Senior Search Scientist (say that five times fast). “Tactics like SEO split-testing or, at a more primitive level, counterfactual forecasting, can help to isolate these effects in many cases, and happily technical changes tend to have a quicker, more direct impact than some other types of change that don’t see returns until the next core update.” So when analyzing and reporting, remember: quantity isn’t always quality, and make sure you have the full picture before gleaning insights. Conclusion Click to tweet this! While the core of your technical SEO work will stay the same in 2021, there is plenty of opportunity to build and improve on foundational skills, implement structured data and automation, clarify the way you analyze and report your results, and plan for Core Web Vitals to take effect. And while technical work can sometimes feel isolating, remember that cross-team collaboration is key to success, and that you’re part of a community of SEOs with similar goals! Speaking of community, we’d be remiss if we didn’t mention the amazing work of Areej AbuAli and the Women in Tech SEO network. “If you identify as a woman, do join the Women in Tech SEO Slack channel and subscribe to its newsletter,” advises Miracle Inameti-Archibong. “I wish I had a community like that at the beginning of my career. There are loads of people always willing to help with not just technical SEO issues, but mentoring and sharing of opportunities.” Have questions for the experts, or advice not mentioned here? Let us know in the comments! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "According to the Experts: 5 Technical SEO Trends to Watch in 2021"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "According to the Experts: 5 Technical SEO Trends to Watch in 2021"
    },
    {
      "level": "H2",
      "text": "1. Focus on the fundamentals"
    },
    {
      "level": "H2",
      "text": "2. Gear up for Core Web Vitals"
    },
    {
      "level": "H2",
      "text": "3. Use schema and structured data strategically"
    },
    {
      "level": "H2",
      "text": "4. Leverage automation to get things done"
    },
    {
      "level": "H2",
      "text": "5. Don’t forget about analytics and reporting"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Morgan McMurray\n          \n            Morgan McMurray\n          \n            Morgan McMurray"
}