{
  "url": "https://moz.com/blog/technical-site-audit-for-2015",
  "slug": "technical-site-audit-for-2015",
  "title": "Technical Site Audit Checklist: 2015 Edition - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Back in 2011, I wrote a a technical site audit checklist, and while it was thorough, there have been a lot of additions to what is encompassed in a site audit. I have gone through and updated that old checklist for 2015.",
  "content": "Technical Site Audit Checklist: 2015 Edition Technical SEO By: Geoff Kenyon January 19, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Geoff Kenyon January 19, 2015 Technical Site Audit Checklist: 2015 Edition Technical SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Back in 2011, I wrote a technical site audit checklist, and while it was thorough, there have been a lot of additions to what is encompassed in a site audit. I have gone through and updated that old checklist for 2015. Some of the biggest changes were the addition of sections for mobile, international, and site speed. This checklist should help you put together a thorough site audit and determine what is holding back the organic performance of your site. At the end of your audit, don't write a document that says what's wrong with the website. Instead, create a document that says what needs to be done. Then explain why these actions need to be taken and why they are important. What I've found to really helpful is to provide a prioritized list along with your document of all the actions that you would like them to implement. This list can be handed off to a dev or content team to be implemented easily. These teams can refer to your more thorough document as needed. If you'd like to download a PDF version of the checklist, you can find it here. Quick overview Check indexed pages Do a site: search. How many pages are returned? (This can be way off so don't put too much stock in this). Is the homepage showing up as the first result? If the homepage isn't showing up as the first result, there could be issues, like a penalty or poor site architecture/internal linking, affecting the site. This may be less of a concern as Google's John Mueller recently said that your homepage doesn't need to be listed first. Review the number of organic landing pages in Google Analytics Does this match with the number of results in a site: search? This is often the best view of how many pages are in a search engine's index that search engines find valuable. Search for the brand and branded terms Is the homepage showing up at the top, or are correct pages showing up? If the proper pages aren't showing up as the first result, there could be issues, like a penalty, in play. Check Google's cache for key pages Is the content showing up? Are navigation links present? Are there links that aren't visible on the site? PRO Tip: Don't forget to check the text-only version of the cached page. Here is a bookmarklet to help you do that. Do a mobile search for your brand and key landing pages Does your listing have the \"mobile friendly\" label? Are your landing pages mobile friendly? If the answer is no to either of these, it may be costing you organic visits. On-page optimization Title tags are optimized Title tags should be optimized and unique. Your brand name should be included in your title tag to improve click-through rates. Title tags are about 55-60 characters (512 pixels) to be fully displayed. You can test here or review title pixel widths in Screaming Frog. Important pages have click-through rate optimized titles and meta descriptions This will help improve your organic traffic independent of your rankings. You can use SERP Turkey for this. Check for pages missing page titles and meta descriptions The on-page content includes the primary keyword phrase multiple times as well as variations and alternate keyword phrases There is a significant amount of optimized, unique content on key pages The primary keyword phrase is contained in the H1 tag Images' file names and alt text are optimized to include the primary keyword phrase associated with the page. URLs are descriptive and optimized While it is beneficial to include your keyword phrase in URLs, changing your URLs can negatively impact traffic when you do a 301. As such, I typically recommend optimizing URLs when the current ones are really bad or when you don't have to change URLs with existing external links. Clean URLs No excessive parameters or session IDs. URLs exposed to search engines should be static. Short URLs 115 characters or shorter – this character limit isn't set in stone, but shorter URLs are better for usability. Additional reading: Best Practices for URLs URL Rewriting Tool mod_rewrite Cheat Sheet Creating 301 Redirects With .htaccess Content Homepage content is optimized Does the homepage have at least one paragraph? There has to be enough content on the page to give search engines an understanding of what a page is about. Based on my experience, I typically recommend at least 150 words. Landing pages are optimized Do these pages have at least a few paragraphs of content? Is it enough to give search engines an understanding of what the page is about? Is it template text or is it completely unique? Site contains real and substantial content Is there real content on the site or is the \"content\" simply a list of links? Proper keyword targeting Does the intent behind the keyword match the intent of the landing page? Are there pages targeting head terms, mid-tail, and long-tail keywords? Keyword cannibalization Do a site: search in Google for important keyword phrases. Check for duplicate content/page titles using the Moz Pro Crawl Test. Content to help users convert exists and is easily accessible to users In addition to search engine driven content, there should be content to help educate users about the product or service. Content formatting Is the content formatted well and easy to read quickly? Are H tags used? Are images used? Is the text broken down into easy to read paragraphs? Good headlines on blog posts Good headlines go a long way. Make sure the headlines are well written and draw users in. Amount of content versus ads Since the implementation of Panda, the amount of ad-space on a page has become important to evaluate. Make sure there is significant unique content above the fold. If you have more ads than unique content, you are probably going to have a problem. Additional reading: How to Write Magnetic Headlines SEO Copywriting Tips for Improved Link Building The Ultimate Blogger Writing Guide Tips to Earn Links and Tweets to Your Blog Post Duplicate content There should be one URL for each piece of content Do URLs include parameters or tracking code? This will result in multiple URLs for a piece of content. Does the same content reside on completely different URLs? This is often due to products/content being replicated across different categories. Pro Tip: Exclude common parameters, such as those used to designate tracking code, in Google Webmaster Tools. Read more at Search Engine Land. Do a search to check for duplicate content Take a content snippet, put it in quotes and search for it. Does the content show up elsewhere on the domain? Has it been scraped? If the content has been scraped, you should file a content removal request with Google. Sub-domain duplicate content Does the same content exist on different sub-domains? Check for a secure version of the site Does the content exist on a secure version of the site? Check other sites owned by the company Is the content replicated on other domains owned by the company? Check for \"print\" pages If there are \"printer friendly\" versions of pages, they may be causing duplicate content. Accessibility & Indexation Check the robots.txt Has the entire site, or important content been blocked? Is link equity being orphaned due to pages being blocked via the robots.txt? Turn off JavaScript, cookies, and CSS Use the Web Developer Toolbar Is the content there? Do the navigation links work? Now change your user agent to Googlebot Use the User Agent Add-on Are they cloaking? Does it look the same as before? PRO Tip: Use SEO Browser to do a quick spot check. Check the SEOmoz PRO Campaign Check for 4xx errors and 5xx errors. XML sitemaps are listed in the robots.txt file XML sitemaps are submitted to Google/Bing Webmaster Tools Check pages for meta robots noindex tag Are pages accidentally being tagged with the meta robots noindex command Are there pages that should have the noindex command applied You can check the site quickly via a crawl tool such as Moz or Screaming Frog Do goal pages have the noindex command applied? This is important to prevent direct organic visits from showing up as goals in analytics Site architecture and internal linking Number of links on a page 100-200 is a good target, but not a rule. Vertical linking structures are in place Homepage links to category pages. Category pages link to sub-category and product pages as appropriate. Product pages link to relevant category pages. Horizontal linking structures are in place Category pages link to other relevant category pages. Product pages link to other relevant product pages. Links are in content Does not utilize massive blocks of links stuck in the content to do internal linking. Footer links Does not use a block of footer links instead of proper navigation. Does not link to landing pages with optimized anchors. Good internal anchor text Check for broken links Link Checker and Xenu are good tools for this. Additional reading: Importance of Internal Linking Internal Linking Tactics Using Anchor Links to Make Google Ignore The First Link Successful Site Architecture for SEO The SEO Guide to Site Architecture Information Architecture and Faceted Navigation Technical issues Proper use of 301s Are 301s being used for all redirects? If the root is being directed to a landing page, are they using a 301 instead of a 302? Use Live HTTP Headers Firefox plugin to check 301s. \"Bad\" redirects are avoided These include 302s, 307s, meta refresh, and JavaScript redirects as they pass little to no value. These redirects can easily be identified with a tool like Screaming Frog. Redirects point directly to the final URL and do not leverage redirect chains Redirect chains significantly diminish the amount of link equity associated with the final URL. Google has said that they will stop following a redirect chain after several redirects. Use of JavaScript Is content being served in JavaScript? Are links being served in JavaScript? Is this to do PR sculpting or is it accidental? Use of iFrames Is content being pulled in via iFrames? Use of Flash Is the entire site done in Flash, or is Flash used sparingly in a way that doesn't hinder crawling? Check for errors in Google Webmaster Tools Google WMT will give you a good list of technical problems that they are encountering on your site (such as: 4xx and 5xx errors, inaccessible pages in the XML sitemap, and soft 404s) XML Sitemaps Are XML sitemaps in place? Are XML sitemaps covering for poor site architecture? Are XML sitemaps structured to show indexation problems? Do the sitemaps follow proper XML protocols? Canonical version of the site established through 301s Canonical version of site is specified in Google Webmaster Tools Rel canonical link tag is properly implemented across the site Make sure it points to the correct page, and every page doesn't point to the homepage. Uses absolute URLs instead of relative URLs This can cause a lot of problems if you have a root domain with secure sections. Site speed Review page load time for key pages Is it significant for users or search engines? Make sure compression is enabled Gzip Test Enable caching Optimize your images for the web Google's guide to optimizing your images Minify your CSS/JS/HTML Use a good, fast host Consider using a CDN for your images. Optimize your images for the web Google's guide to optimizing your images Additional reading: Google Page Speed Insights Best Practices for Page Speed Mobile Review the mobile experience Is there a mobile site set up? If there is, is it a mobile site, responsive design, or dynamic serving? Make sure analytics are set up if separate mobile content exists If dynamic serving is being used, make sure the Vary HTTP header is being used This helps alert search engines understand that the content is different for mobile users. Google on dynamic serving. Review how the mobile experience matches up with the intent of mobile visitors Do your mobile visitors have a different intent than desktop based visitors? Ensure faulty mobile redirects do not exist If your site redirects mobile visitors away from their intended URL (typically to the homepage), you're likely going to run into issues impacting your mobile organic performance. Ensure that the relationship between the mobile site and desktop site is established with proper markup If a mobile site (m.) exists, does the desktop equivalent URL point to the mobile version with rel=\"alternate\"? Does the mobile version canonical to the desktop version? Official documentation. International Review international versions indicated in the URL ex: site.com/uk/ or uk.site.com Enable country based targeting in webmaster tools If the site is targeted to one specific country, is this specified in webmaster tools? If the site has international sections, are they targeted in webmaster tools? Implement hreflang / rel alternate if relevant Documentation If there are multiple versions of a site in the same language (such as /us/ and /uk/, both in English), update the copy been updated so that they are both unique Make sure the currency reflects the country targeted Ensure the URL structure is in the native language Try to avoid having all URLs in the default language Analytics Analytics tracking code is on every page You can check this using the \"custom\" filter in a Screaming Frog Crawl or by looking for self referrals. Are there pages that should be blocked? There is only one instance of a GA property on a page Having the same Google Analytics property will create problems with pageview-related metrics such as inflating page views and pages per visit and reducing the bounce rate. It is OK to have multiple GA properties listed, this won't cause a problem. Analytics is properly tracking and capturing internal searches Demographics tracking is set up Adwords and Adsense are properly linked if you are using these platforms Instructions for linking AdWords Instructions for linking AdSense Internal IP addresses are excluded Official documentation UTM Campaign Parameters are used for other marketing efforts Google URL Builder Meta refresh and JavaScript redirects are avoided These can artificially lower bounce rates. Event tracking is set up for key user interactions Event Tracking Documentation This audit covers the main technical elements of a site and should help you uncover any issues that are holding a site back. As with any project, the deliverable is critical. I've found focusing on the solution and impact (business case) is the best approach for site audit reports. While it is important to outline the problems, too much detail here can take away from the recommendations. If you'd like a downloadable PDF version of the checklist, you can grab it here. If you're looking for more resources on site audits, I recommend the following: Helpful tools for doing a site audit: Annie Cushing's Site Audit Web Developer Toolbar User Agent Add-on Firebug Link Checker SEObook Toolbar MozBar (Moz's SEO toolbar) Xenu Screaming Frog Your own scraper Inflow's technical mobile best practices Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Technical Site Audit Checklist: 2015 Edition"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Technical Site Audit Checklist: 2015 Edition"
    },
    {
      "level": "H2",
      "text": "Quick overview"
    },
    {
      "level": "H2",
      "text": "On-page optimization"
    },
    {
      "level": "H2",
      "text": "Content"
    },
    {
      "level": "H2",
      "text": "Duplicate content"
    },
    {
      "level": "H2",
      "text": "Accessibility & Indexation"
    },
    {
      "level": "H2",
      "text": "Site architecture and internal linking"
    },
    {
      "level": "H2",
      "text": "Technical issues"
    },
    {
      "level": "H2",
      "text": "Site speed"
    },
    {
      "level": "H2",
      "text": "Mobile"
    },
    {
      "level": "H2",
      "text": "International"
    },
    {
      "level": "H2",
      "text": "Analytics"
    },
    {
      "level": "H3",
      "text": "Helpful tools for doing a site audit:"
    },
    {
      "level": "H2",
      "text": "Looking for a free, up-to-date SEO Audit Checklist?"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Geoff Kenyon\n          \n            Geoff Kenyon\n          \n            Geoff Kenyon"
}