{
  "url": "https://moz.com/blog/technorati-top-100-too-easy-to-game",
  "slug": "technorati-top-100-too-easy-to-game",
  "title": "Technorati Top 100 - Too Easy to Game? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Technorati currently has two Top 100 blog lists - one according to favorites and the other generated based on link popularity. The first measures Technorati users who've marked the blog as a \"favorite;\" as per the screen capture below:\n...",
  "content": "Technorati Top 100 - Too Easy to Game? Content Marketing By: Rand Fishkin September 14, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin September 14, 2006 Technorati Top 100 - Too Easy to Game? Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Technorati currently has two Top 100 blog lists - one according to favorites and the other generated based on link popularity. The first measures Technorati users who've marked the blog as a \"favorite;\" as per the screen capture below: The top 6 blogs all have fewer than 1000 members who've \"favorited\" them. Compared with the number of readers these blogs have, it's nearly absurd to think that such a small percentage are A) members at Technorati and B) interested in pushing their favorite blogs up the list. As you scroll down the top 100 favorited, you see that a group of 100 friends could easily launch a blog and get it solidly placed into the top 50 without much effort. SEW is #52 with only 93 members \"favoriting\" that blog. The other Technorati Top 100 list is ranked by the number of other blogs linking to the listees. See below: This one is tougher to game, but remember that almost any blog can be included in Technorati (though they do filter for splogs) and that it only takes 2,900 blogs linking to you to get onto this list. SEOmoz itself has over 2600 blogs pointing to it, putting us at rank #152 as of now. I was talking with Todd (Oilman) today about his own blog and he mentioned that a personal goal was to get onto the Technorati lists. With an arsenal of a few clever programmers or simply a large group of friends, those lists seem largely pliable, though I don't yet see evidence of manipulation. I suspect that controls may be in place to prevent large scale spamming, but I'd be curious as to how it's done. One problem that Technorati's Top 100 Favorited list certainly suffers from is the lack of reward for users to \"tag\" their favorite blogs. Doing so provides no value to the user, it doesn't create a watchlist or add it to a Technorati Feed. You can download a nifty toolbar that lets you favorite blogs across the web and once on your favorites page, you can organize these, but the fun basically stops there. If I were Mr. Sifry, I'd seriously consider adding a value proposition to make it more enticing for users to favorite blogs, for bloggers to encourage their users to participate at Technorati and for those new to the blogosphere to explore the industry through Technorati's services. Normally, I'm not one to ask users to perform any sort of task, but I'm immensely curious about what would happen if a large group of blog readers suddenly favorited a blog en masse. Since it's selfish to do it for SEOmoz (although it would be cool, so don't let me stop you if you do like us), let's give this a shot for another smaller blog, like Todd's. Supposedly, if 50 or so of us readers favorite his blog, we should break him into the Top 100. I'm sure he'd be happy to respond by giving us the traffic stats from the move and we can watch how Technorati responds as well. What's your experience using Technorati's services? Has anyone here tried playing around with their popularity metrics in the past? Do you find it odd that they rank search results according to update time? Is my social experiment spam? manipulative? unethical? All of the above? I'm so tired from the hiring process, I honestly have a brain like a sieve. And no, I won't be giving away who got kicked off Runway tonight - I learned my lesson last week (though luckily the Digg crowd and Project Runway's demographic have minimal overlap). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Technorati Top 100 - Too Easy to Game?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Technorati Top 100 - Too Easy to Game?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}