{
  "url": "https://moz.com/blog/tech-seo-strategies-2022",
  "slug": "tech-seo-strategies-2022",
  "title": "The Top Tech SEO Strategies for 2022 and Beyond - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Last year was an incredible year for core updates , and for changes to how SEOs improve page quality for users. Moving forward, we can expect to see increased diversification of SERPs and new features from tools like Google Lens. These developments will change how we manage our SEO now and in the…",
  "content": "The Top Tech SEO Strategies for 2022 and Beyond Technical SEO | Advanced SEO By: Crystal Carter January 27, 2022 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Crystal Carter January 27, 2022 The Top Tech SEO Strategies for 2022 and Beyond Technical SEO | Advanced SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Last year was an incredible year for Core Updates, and for changes to how SEOs improve page quality for users. Moving forward, we can expect to see increased diversification of SERPs, led by developments in Google’s algorithms, and new features from tools like Google Lens. These developments will change how we manage our SEO now and in the future. Multimedia first Why should you consider a multimedia-first SEO strategy? MUM is the latest in Google’s suite of super-powerful algorithms, which help them to understand information in new and different ways. It runs alongside BERT, but it's actually much more powerful than BERT. MUM stands for “multitask unified model”, and not only does it process natural language, but it does so in over 75 languages — and counting. It's also able to process text and images with a similar quality, and is increasing its ability to process video and audio in the near future. This means we’re likely to see the impact of this in the SERPs, specifically what they look like, which is also likely to shape some of the targeted algorithm updates in the future. This shift in focus is a natural evolution of a mobile-first digital experience that allows users to engage with content dynamically using a mix of inputs, outputs, and tools, often simultaneously. Google’s push towards better understanding — and towards ranking media like image and video — will require SEOs to look at multimedia content with fresh eyes. Which short-term multimedia optimizations should you prioritize in 2022? Visual recognition for Google Lens Google has invested significantly in image recognition solutions for almost 10 years, but they have recently picked up the pace and scale of its integration into everyday search. As a result, improvements to and new uses for Google Lens have been front and center at flagship events like Google I/O and SearchOn during the last 12 months, while their future plans to move into health depend significantly on honing their visual search abilities. In 2021, they added Google Lens directly into the search widget for Pixel, Android phones, and onto Chrome’s mobile search bar. Last year’s Google Lens updates included the ability to translate text in over 100 languages via AR and carry out targeted visual searches of screenshots. Add to this list of features their upcoming rollout of a MUM-enabled ability to “Add Questions” to Lens searches, and you can see that change is afoot. How does Google Lens impact image SEO? Standard image optimization elements like alt-text, schema markup, file names, image titles, and file sizes will continue to be important and relevant in regards to how search engines understand your image. Building upon this, though, elements like composition will also come to the fore. This means that SEOs might need to have more strategic conversations about what images look like, as well as how they’re rendered on a site. This is because, while AI-driven image processing tools like Google Cloud’s Vision AI and Google Lens are developing rapidly, images that have clear composition will be better understood for visual search than images that are cluttered, complex, or partially visible. Simply put, cleaner images mean that your content is surfaced with more relevant search results and business outcomes. SEO value of image composition Need to illustrate the point to stakeholders? Released in 2015, Vision AI’s image recognition tech underpins many of the functions of Google Lens, and their free demo tool can be used to demonstrate how images are interpreted at a high level. Pair this with real-time Google Lens results to illustrate where you should be concentrating your image optimization efforts as MUM matures. Google's Vision AI API testing tool. Case in point, in the diagram below, you can see two photos of the same enamel teapot as analyzed with Google Cloud’s Vision AI API testing tool and then with Google Lens. In the image where you can’t see the handle and spout at the same time, the Vision AI interprets the photo as a Tableware object with 76% certainty and adds Kettle as the most relevant searchable label with 74% certainty. Conversely, the image with the teapot in the profile is understood as a Teapot with 94% certainty and given a Teapot label with 89% certainty. How composition impacts Vision AI interpretation of images. When we click through to the SERPs for kettle and teapot, we can see a clear difference in results. It is also clear that the latter is a much closer match to the actual object, thus more likely to satisfy customer needs, resulting in more click-throughs and driving better SEO for the site overall. Left shows results for ‘Kettle’. Right shows results for ‘Teapot’ When we search the same images directly in Google Lens, the overall results are better: this time both are showing enamel teapots. But again, we see that the side profile photo is delivering near-exact matches to my IRL teapot. Thus, better photo composition equates to better search optimization. Better images give more relevant in Google Lens. In practice, this means that while there may be a desire to fill a site with stylish lifestyle or Instagram-ready images, for SEO purposes, it is important to prioritize clean, — dare I say “boring” — images, particularly for transactional pages like product listings. While this methodology is not necessarily new, the accessibility and integration of “search what you see” tools in the daily search experience will make image composition considerations for SEO a priority moving forward. AI is allowing Google to make comparable strides with video and audio analysis, meaning investment in the knowledge of audio quality and video aesthetics could pay SEO dividends in the future. Security for speed Security and speed are both established ranking factors. During the great Core Web Vitals push of 2021, many came to understand that the two elements are closely linked. On an individual account level, I've seen server security optimization improve page performance for multiple clients. On a larger scale, when hosting platform Wix tripled their year-over-year CWV performance, enhancements like universal HTTP/2 to improve SSL times were critical to the task. In the coming year, we will see Google prioritize security in its products and search services. Chrome promises the rollout of increased security and privacy tools, with updates that will include security features for <iframes> and cross-site navigation that add more checks as users transfer between links and use certain features. This could give sites with top-tier security a competitive advantage for speed, page experience, and conversions in the coming year. And as the desktop page experience ranking update arrives in February 2022, the impact may be seen across many more domains. Add to this trend the enthusiastic adoption of high-speed HTTP/3 by big tech players like Facebook and Google, and you can see that legacy tech will struggle to keep pace with user and bot expectations. The use of HTTP/3, the latest HTTP protocol, has seen a fivefold increase across the web in the last year and is now live on about 25% of domains. Though this protocol is active on Cloudflare and many other top cloud providers, it is not yet standard. If you want to make the most of the benefits here, you may need to manually enable the update for your main server and/or CDN. And if you’re considering a new CDN or server partner in the coming year, this should be a deciding factor. SEO specialisms for Google channel diversity Google continues to reduce friction as users move between their dedicated channels and apps. In the process, they’re creating a more dynamic and niche SERP that requires SEO specialism to gain traction. Click-throughs for some SERP results go to Google managed channels and apps. From a user experience, this makes for rich mobile-friendly SERPs, which take users directly into high-performance apps like Google Maps and dedicated channels like Google Travel. Furthermore, it affords Google the opportunity to access and combine the information users need in a highly contextualized manner. Since Google-managed properties give them control over many informational feeds at once, enhancing and connecting existing channels will be essential to their aims to serve ever more nuanced search results. While this has long been the preserve of transactional verticals like shopping and hotels, Google’s commitment to multi-modality means this is likely to become more prevalent amongst queries at the top of the funnel as well. This means SEO efforts must also be made to optimize profiles and performance within each of the most relevant channels in order to maximize visibility in the SERPs. Due to the rate of change for each channel, SEO generalism is increasingly less likely to build a critical mass for impact. Instead, coordinated teams for SEO specialisms are likely to see the most gains. If we look at Local Inventory Ads (LIA) for instance, we can see optimizations for multiple channels converge to make a complex, high-value search feature. Introduced last year, this free and paid Google Shopping feature allows users to find products in stock at shops near their location. Google uses data and content from websites, Google Business Profiles, Maps, and Merchant Center to surface this information when users need it. Ongoing optimization for LIA requires expertise in each of these channels, running in tandem with a collection of SEO skill sets. All of this is to say that assembling a well-rounded SEO team will be essential to top performance as multimodal search evolves. Consider nurturing in-house channel champions and/or engaging external product experts via an agency or freelance support, and coordinate to achieve business goals in search. Borderless international SEO In the coming year, three factors will become significant drivers for international SEO: the rise of borderless e-commerce, the maturity of AI translation tools, and the rollout of MUM. Borderless e-commerce Digital acceleration has changed our digital experience significantly. The relevance of a business’s physical location, currency, and time zone is shifting, and the barriers to entry for brands to go global are being significantly reduced. Brick-and-mortar businesses still have a significant impact on local SEO and local pack SERPs, but customers are increasingly more willing (and more often, expecting) to buy from retailers outside their country. Research shows that tentative markets, where around 40% of consumers were willing to purchase from overseas sellers in 2016, had shifted to 55% willingness in 2021. Shopify launched Shopify Markets at the start of Q4 2021, full of confidence in this global retail trend and its potential for sellers, meaning that competition here is likely to heat up in the coming months. As SEOs, our task is to meet customers where they are, and this change in customer expectations brings opportunities for business growth. To get started here, consider tried-and-tested international SEO tactics alongside low-cost, low-friction market entry channels like free Google Merchant Listings. If your international growth includes selling on top international marketplaces like Amazon, Wish, AliExpress, or eBay, consider optimizing your landing pages and on-site e-commerce E-A-T to build trust with new customers. Finally, think mobile-first for shoppers in Asia and other emerging markets. In summary All in all, I’m optimistic. As MUM matures we should see more varied content types emerge from around the web. Improvements to speed and security are a win for everyone. More layered SERP features help to demonstrate the importance of SEO. And building a borderless customer base helps to make brands more resilient in a changeable marketplace. Some of the changes we are likely to see are substantial, but they should move SEO in a positive direction. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Top Tech SEO Strategies for 2022 and Beyond"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Top Tech SEO Strategies for 2022 and Beyond"
    },
    {
      "level": "H2",
      "text": "Multimedia first"
    },
    {
      "level": "H3",
      "text": "Why should you consider a multimedia-first SEO strategy?"
    },
    {
      "level": "H3",
      "text": "Which short-term multimedia optimizations should you prioritize in 2022?"
    },
    {
      "level": "H4",
      "text": "Visual recognition for Google Lens"
    },
    {
      "level": "H5",
      "text": "How does Google Lens impact image SEO?"
    },
    {
      "level": "H5",
      "text": "SEO value of image composition"
    },
    {
      "level": "H2",
      "text": "Security for speed"
    },
    {
      "level": "H2",
      "text": "SEO specialisms for Google channel diversity"
    },
    {
      "level": "H2",
      "text": "Borderless international SEO"
    },
    {
      "level": "H3",
      "text": "Borderless e-commerce"
    },
    {
      "level": "H2",
      "text": "In summary"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    }
  ],
  "author": "Crystal Carter\n          \n            Crystal Carter\n          \n            Crystal Carter"
}