{
  "url": "https://moz.com/blog/ten-resources-that-changed-how-i-view-the-internet",
  "slug": "ten-resources-that-changed-how-i-view-the-internet",
  "title": "Ten Resources That Changed How I View the Internet - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I can always pick out a fool when I hear someone claim they fully get the internet, whether it be a social media snake-oil salesman or a Twitter user with too many followers. The fact of the matter is that while it’s possible (and exciting) to understand one sub-sphere of the internet, there are…",
  "content": "Ten Resources That Changed How I View the Internet Marketing Industry By: Danny Dover May 20, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Danny Dover May 20, 2009 Ten Resources That Changed How I View the Internet Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I can always pick out a fool when I hear someone claim they fully get the internet, whether it be a social media snake-oil salesman or a Twitter user with too many followers. The fact of the matter is that while it’s possible (and exciting) to understand one sub-sphere of the internet, there are simply too many spheres for one person to really understand all of them. I simply don’t think it is possible. By the same logic, my understanding of the internet is flawed as well. I have had many times when a light bulb goes off in my head and for a split second the universe suddenly makes sense. While these moments are awesome (in the truest sense of the word “awe some”), they are temporary. Nonetheless, they have helped shaped my view of the internet and, to a certain extent, the world. The following is a list of the resources that have substantially changed my view of the internet. Embracing the Wisdom of Crowds Wikipedia TED Talk - Wikipedia is the bane of every SEO's existence. It ranks for everything (#3 on my computer) and is difficult to replace. I shared this hatred until I came across Wikipedia founder Jimmy Wales' explanation of why Wikipedia works. Frankly, the entire is process is quite beautiful. Why Paris Hilton Is Famous - Just the mere image of Paris Hilton bothers me. That said, after reading the following article, I respect her unprecedented ability to market herself both online and offline. Although I think the author gives her too much credit, his outlook on her is both refreshing and inspiring. Why Paris Hilton Is Famous The Wisdom of Crowds - For most of you I imagine this book is not new. The Wisdom of Crowds by James Surowiecki changed how I view people. His research showed me what I should have seen all along. It is silly to think that an individual person would be better or smarter than the combined wisdom of a group. This book made me realize this. The Wisdom of Crowds A World Wide Web of Opportunity A Speech by David Heinemeier Hansson - In 2008, David, of Ruby on Rails and 37Signals fame, gave a speech at Y combinator’s Startup School. In his speech he described what he believes to be the reason why so many internet companies fail. Without spoiling it for you, the link is below. YouTube Founders Video - Can you imagine the feeling of securing the financial future for yourself and all of your loved ones simply by signing a piece of paper? It is the feeling that entrepreneurs dream of, and Chad Hurley and Steve Chen finally had it after selling YouTube to Google for $1.65 Billion. This video was taken right after this happened. No wonder they are so giddy! Stop Following the Leaders: Fortune 450-500 - I recently had an extremely eye opening lunch with a prominent technologist in Seattle. While discussing the role of education in technology, I foolishly brought up the stale examples of Steve Jobs and Bill Gates dropping out of school. Quick to the draw, my lunch mate advised me to stop studying the leading Fortune 500 countries and start studying the Fortune 450 through 500. While the leaders relied on hard work to get to where they are, they also were given tremendous good luck. This is not always the same for the companies lower down on the list. Fortune 401-500 Fighting Information Overload Don't Make Me Think by Steve Krug is undoubtedly the best book ever written on web usability. His clear and well thought out explanations lay out what every web developer should know about doing their job. After reading this book, I literally made it a requirement for anyone who builds websites with me in my personal life. Don't Make Me Think Remembering My Place in the Internet’s Evolution The Computer for the 21st Century - Back in February of 1991, Mark Weiser wrote this article in Scientific American. In it, he outlines a vision for ubiquitous computing that we are still working to achieve today. After reading this, I understood my proper place in computing for the first time. The cutting edge that we live on today is merely the foundation for computing tomorrow. The Computer for the 21st Century The Last Question - This is my favorite short story of all time. Written in 1956, Isaac Asimov eerily predicts the creation of a tool like Google. It's chilling, humbling and has a ending that has stuck with me since first reading it several years ago. The Last Question The Hacker's Manifesto - My experience as an internet marketer skews more toward the internet and development side of internet marketing. This article written in 1986 by +++The Mentor+++ taught me how little the spirit of hackers has changed. It is as relevant today as it was 23 years ago. The Hacker's Manifesto If you have any other resources that you think are worth sharing, feel free to post them in the comments. This post is very much a work in progress. As always, feel free to e-mail me or send me a private message if you have any suggestions on how I can make my posts more useful. If that's not your style, feel free to contact me on Twitter (DannyDover) Thanks! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Ten Resources That Changed How I View the Internet"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Ten Resources That Changed How I View the Internet"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Danny Dover\n          \n            Danny Dover\n          \n            Danny Dover"
}