{
  "url": "https://moz.com/blog/ten-types-of-blog-managers-which-one-are-you",
  "slug": "ten-types-of-blog-managers-which-one-are-you",
  "title": "Ten Types of Blog Managers - Which One are You? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "What type of blog manager are you?  Mr. Packrat?  Miss Self-Contained?  Your style of blog management can make your blog an SEO powerhouse, a great resource for visitors, or an intellectual property graveyard.  Check out these management styles and comment on which one you think is best!   1) PACK…",
  "content": "Ten Types of Blog Managers - Which One are You? Content Marketing E By: EGOL February 3, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! E By: EGOL February 3, 2007 Ten Types of Blog Managers - Which One are You? Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. What type of blog manager are you? Mr. Packrat? Miss Self-Contained? Your style of blog management can make your blog an SEO powerhouse, a great resource for visitors, or an intellectual property graveyard. Check out these management styles and comment on which one you think is best! PACK RAT: Blogs at full speed ahead. Never checks to see if his links are dead. Never adds important developments to the topics posted. Probably has typos and bad grammar. COMPULSIVE MAINTAINER: Always links directly to the internal page of the website he is citing. Runs a check for dead links regularly, often goes back to old posts to add informational updates. Perfect spelling and grammar. LOW MAINTENANCE GAL: Hates messing with dead links so she always links directly to the homepage of the website she is citing. If there is a development on an old topic she writes a brand new post and links to her old posts on that topic. THE PRUNER: Runs occasional checks for dead links and deletes the post. Also deletes posts that have problems to due age or recent developments. THE PLANNER: Runs WordTracker before composing his title, decides how to present the post to place strategic keywords in the first and last sentence. Links to source documents with great anchor text. Has blog categories that cluster around the theme of his site. THE FIXER: Runs occasional checks for dead links and fixes them. If the link is dead it is fixed or a notation is made that the target document is not available. THE ROLLOFF: Keeps six months of posts on his blog. Lets the old ones drop off the bottom. THE ARCHIVER: Doesn't like out-of-date topics or dead links so he moves old posts to a special area of his site. MISS SELF-CONTAINED: She wants to have all parts of the story covered on her blog so she does extensive research before every post. This cuts the quantity of posts that she can make but each one is a stand-alone source document that presents all aspects of the story and answers all of the readers questions. =================== Which one of these styles best describes you? Which is best for SEO? Best for users? I am sure that we will have some disagreement but here are my opinions. If you disagree that's great, but please tell us why you feel differently. Best for productivity defined as a lot of posts: Packrat and Low Maintenance Best for your visitors: Compulsive Maintainer followed by Self-Contained and Fixer Best for developing a reputation in your field: Compulsive Maintainer followed by Self-Contained Best for linkability: Self Contained (writes source documents that are authoritative and highly linkable) followed by Compulsive Maintainer (tidy, up-to-date blog makes him an authority)... Packrat is a little slobby and will not get many links Best for SEO: Planner followed by Compulsive Maintainer (no dead links, lots of content, links to authoritative sources, probably gets a few natural links) and Self-Contained (because she her thorough and authoritative posting style gets a nice number of links) Best for intellectual property management: Compulsive Maintainer and Self-Contained... Rolloff and Archiver are terrible because they ditch content but it is amazing at how many newspaper sites are run this way! Who is best overall? The best overall will be Blogger #10... this person does everything right and takes the best qualities from Planner (SEO's his posts), Compulsive Maintainer (keeps his historic posts updated and his links on target) and Miss Self-Contained (because she will earn lots of links). Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Ten Types of Blog Managers - Which One are You?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Ten Types of Blog Managers - Which One are You?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "EGOL\n          \n            EGOL"
}