{
  "url": "https://moz.com/blog/thanks-for-dinner-vintage-tub-bath",
  "slug": "thanks-for-dinner-vintage-tub-bath",
  "title": "Thanks for Dinner, Vintage Tub & Bath! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I owe a big one to Allan Dick, who bought dinner tonight for myself, Danny Sullivan, Ammon Johns, Chris Sherman and about a dozen other SESers here in London. Unbelievably, I still have not slept since Sunday night, but managed to truly enjoy the wine, crab cakes and top-notch beef and Guiness…",
  "content": "Thanks for Dinner, Vintage Tub & Bath! SEO Events By: Rand Fishkin May 31, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 31, 2006 Thanks for Dinner, Vintage Tub & Bath! SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I owe a big one to Allan Dick, who bought dinner tonight for myself, Danny Sullivan, Ammon Johns, Chris Sherman and about a dozen other SESers here in London. Unbelievably, I still have not slept since Sunday night, but managed to truly enjoy the wine, crab cakes and top-notch beef and Guiness pie. In return, I thought I'd take a quick dive over to Alan's site - a veritable haven for those in the home maintenance and upgrading corridor of life, Vintage Tub & Bath has been around for many years, but really turned into a multi-million dollar business with the help Allan received from some of his first SES conferences. They've got some nifty stuff, actually: This modern sink is, IMO, wicked cool It's a tad offbeat, but these brass shower faucets can look darn cool in the right setting Also, it appears Allan has a blog at Blogspot (which I can't understand for the life of me - he must know those links to his blog aren't helping Vintage, right?) And yes, no need to point out the obvious here - I'm giving Allan a bit of link love in exchange for a meal, so Aaron, Adam, if you guys feel the need, go ahead and yoink the link value from this post. I won't hold it against you (although it might be good to remember he bought you dinner, too) ;) How about it SEOmozers? Any great suggestions for the Vintage site? He's got good rankings, but I suspect there is much, much more that could be done on that site with regards to user experience, search targeting and information scent. p.s. I'm praying I can get some sleep tonight - it's 2am already and I still feel like I'm lost in that dreamworld of a waking coma... Did anyone see Al Pacino in Insomnia? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Thanks for Dinner, Vintage Tub & Bath!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Thanks for Dinner, Vintage Tub & Bath!"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}