{
  "url": "https://moz.com/blog/that-settles-itright-underscores-vs-dashes",
  "slug": "that-settles-itright-underscores-vs-dashes",
  "title": "That Settles It...Right? Underscores vs Dashes - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "“Do not speak unless you can improve the silence” I still see many blogs that use underscores in the URL -- ../this_is_my_postBut from an SEO perspective, we've always been told dashes are the way to go, since older programming languages and PHP use the underscore with variables.. and then there's…",
  "content": "That Settles It...Right? Underscores vs Dashes On-page SEO B By: Bud-Caddell May 3, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! B By: Bud-Caddell May 3, 2007 That Settles It...Right? Underscores vs Dashes On-page SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. “Do not speak unless you can improve the silence” I still see many blogs that use underscores in the URL -- ../this_is_my_post But from an SEO perspective, we've always been told dashes are the way to go, since older programming languages and PHP use the underscore with variables...and then there's Matt's post from a while ago, and Matt's blog is as close to gospel as we SEO'ers get (though we should probably reconsider that at times). \"No one tests the depth of a river with both feet\" I decided to run a little test here at SEOmoz to gauge how effective each spacer was with Ask, Yahoo, MSN, and Google. SEOmoz seemed like the best place to run this test--it's a very visible site and I've spent a good deal of my time here writing posts and submitting comments, so there are many instances on the site where a link with the anchor text of my handle points back to my profile page. All I needed to do is measure the ranking of my profile page with the changes to the handle. Special thanks to Oatmeal for changing my nick for me twice. *I should note that while SEOmoz has a good deal of inner linking with my name and profile, I doubt there are any links at all from outside the site to my profile with my name as the anchor text. First, I had my handle changed from BudC to \"Bud_Caddell\" -- I let this sit for a while, then I did a rank test across the SEs for terms related to my name... I waited another while, changed my handle to \"Bud-Caddell\" and ran another ranking test.. here are the results: This is the effective change from going from \"Bud_Caddell\" to \"Bud-Caddell\" as my handle on SEOmoz You'll see at Google, with the underscores, my profile didn't show up at all for \"bud caddell\" or 'bud caddell,' but when I made the change to dashes, my profile page immediately jumped up the results (within 3 days). Interesting enough, it looks like the change didn't affect the Ask or MSN results really, and Yahoo doesn't seem to like me at all (external linking deficiency?) or is incredibly slow to update their search data. Questions I still have from this experiment.. We may know how search engines parse a page based on the underscore or dash, but how do they handle these characters as search queries? Could that be affecting the ranking of the above terms? Is this also proof of Google outweighing external linking factors with the trust or authority of the domain? Is it correct for Google to be toe'ing such a hard line on this issue -- shouldn't their algorithm be more about ranking the web as it is, not as it should be? Are the technical issues enough to warrant such a hard stance? Let me know what you think! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "That Settles It...Right? Underscores vs Dashes"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "That Settles It...Right? Underscores vs Dashes"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "How Pipedrive Increased Organic Sign-Ups by 33% with BOFU Content"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Bud-Caddell\n          \n            Bud-Caddell"
}