{
  "url": "https://moz.com/blog/the-best-of-the-seomoz-blog-20042007",
  "slug": "the-best-of-the-seomoz-blog-20042007",
  "title": "The Best of the SEOmoz Blog 2004-2007 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "For those of you who don't know me yet, my name is Danny and I am SEOmoz's intern. I have spent the last several weeks reading and categorizing all the blog posts written over the years on this site. It has been quite the project and has let me really experience how this company and the SEO…",
  "content": "The Best of the SEOmoz Blog 2004-2007 SEO Events By: Danny Dover January 7, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Danny Dover January 7, 2008 The Best of the SEOmoz Blog 2004-2007 SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. For those of you who don't know me yet, my name is Danny and I am SEOmoz's intern. I have spent the last several weeks reading and categorizing all the blog posts written over the years on this site. It has been quite the project and has let me really experience how this company and the SEO industry as a whole have evolved. I, like the other mozzers, am a stat junkie and kept notes on notable trends, stats, and general quality as I read through the posts. Below I have listed what I believe to be the most successful, funny, and best posts ever written on SEOmoz. Enjoy! Most Successful Posts I defined the most successful posts as those that most successfully exemplified SEOmoz's purpose and style. Specifically, I looked for posts that I felt excelled at teaching SEO, interacting with the community, and sharing sought-after information. 7. In Web 2.0, Fostering Community Creates Value YOUmoz Post – With the emergence of Web 2.0, we have seen an unprecedented boom in social online communities. Many resources have emerged that enable anyone to build the technical framework for a community but fail to provide a human touch. This post goes the extra mile by teaching the values and human elements required to create a successful online community. 6. A Simple Explanation for Why MySpace is So Successful Myspace is the quintessential example of \"Why didn't I think of that?\" This post attempts to describe why this social network took off and while other seemingly good communities did not. The discussion that that starts in the comments really supplements the post and provides great additional views. 5. Top 100 Digg Users Control 56% of Digg's HomePage Content This post is a perfect example of creating unique viral content out of publicly available information. By analyzing the percent of power diggers' stories that went on the homepage, the post uncovered the lack of true democracy that is expressed at social news portals. I believe this really opened many people's eyes to the politics that affect Digg and similar communities. 4. The SEO Routine What does every new SEO want to know? They all want to know how to become a successful SEO, of course. This post lays it out honestly and with all the important details. It provides accurate information in an understandable and concise manner. 3. Dispelling The \"Get Rich Quick\" Myth YOUmoz Post – Many first time SEOs dream that they can find secret tricks that will instantly make them riches from crafty pages and hidden text. Many people prey on this human desire by selling bad information at high prices. This post attempts to explain why these so-called tricks don't exist and provides valuable alternatives. 2. My Personal Opinion - 90% of the Rankings Equation Lies in These 4 Factors This is the second most successful post ever written on this blog. It describes SEO to the layman in a nutshell. (The description is in a nutshell, not the layman. (-; ) The quality information is complemented by intelligent comments. This post successfully gives the answers many people are searching for without any BS and free of cost. 1. Anatomy of a Super Digg YOUmoz Post - I really love this post and personally believe it is the most successful post ever posted on SEOmoz. It chronicles the journey of creating content and experiencing the rush of watching the content go truly viral. It contains valuable information, detailed stats, and a human voice. It teaches great SEO techniques, appeals to a large community, and shares valuable information in an interesting manner. Next time you need to explain why being an SEO is thrilling and a work of love, find this post. Funniest Posts My first indication that SEOmoz was better than its competition was its frequency of funny posts. While choosing the posts, I defined the funniest ones as those that made me laugh the most (duh!) while serving some purpose. Since humor is so subjective, I tried to take other users' perspectives and opinions into account as much as possible. I only included blog posts, so I left out much of the site. However, I think Rebecca's comics are worth mentioning. They are sure to make you giggle like a little girl at least once. 6. Top Eleven Social Media Startups I'd Give My First Born For YOUmoz Post - Web 2.0 is known for company names that contain misspellings, acronyms, foreign references, and sometimes just plain dumb words. Combine the popularity of American stupidity and social networks and you've got yourself a funny blog post. 5. One Reason You Shouldn't Go to the SEOmoz Premium Training Seminar YOUmoz Post - This article is well written and funny by itself. However, the addition of the pictures is what made it stand out among the rest. Apparently, Kevin from Blue Acorn is an exact replica of Rand. He even has Rand's strange attraction to canary yellow shirts. No word on Mystery Guest clones yet, although it should be noted that upon seeing the Rand clone, MG instantly decided what she wanted for her birthday. 4. SEOmoz's Unusual Search Terms from the Month of November “Titties, Mud Wrestling, Hot Young Things, Freebasing Coke, Weird Thumb Porn, Scantily Clad Interns Named Danny.” Nothing out of the ordinary. This post really has something for everyone. If you read this without laughing, please go outside and talk to someone. 3. We Add Words to AdWords... Google Subtracts them. Compilation of the funniest AdWords ads. This post is great because the humor is appreciated by almost anyone and it is all original content. Bonus points to Matt Cutts for trying to plant the idea of using Google AdWords as a drinking game. His amiable attempt to boost Google's Ad Revenue should be noted by Microsoft, Yahoo, and Ask. 2. Porn Filters Taking the Ogle out of Google Undisputed winner of funniest title. This post is one of the funniest things I have ever read online. I show it to my friends when they ask what I do at work. I then determine the importance of our friendship on their reaction. A must read. 1. How to See Paris in Seven Hours This post is clever, funny, informative, and universally understood. This is one of the rare pieces of content that will make my grandmother, my little sister, and I laugh all for the same reasons. Rebecca's writing combined with Scott's facial expressions make this the funniest post ever to make it onto the blog. Best of the Best Choosing the best of the best was an agonizing process. The difference between a great post and an excellent post is not always immediately evident. The difference, I found, comes several days later when a post I read would creep back into my mind. These posts are the ones that truly inspired me and changed how I view the industry. The qualities I used to rank the best of the best are as follows: Human Connection – Did I feel like I was listening to the teacher from Charlie Brown (\"whaa-whaa-whaa\" trombone effect) or a friend sharing a memorable experience? Relevance – Does the audience care? Was the post on topic? What was the noise vs signal ratio of the piece? Completeness – Did the author answer all of my questions in the article, and more importantly, did the author continue the conversation in the comments? Unique – format, style, and content. 8. SEOmoz Has a Pen Pal! This is one of my favorite fan contributions to the site. An entrepreneur at a federal correctional institution sent a handwritten note to our offices asking for SEO advice. Be sure to read both of the handwritten notes that are attached. They will brighten your day. 7. SEOmoz's 2006 Financial Statements Many companies claim to be transparent. They share advice, inside information, and resources. They generally are well respected and become an important resource. This is all fine and dandy until someone asks for financial information. It is generally understood that businesses don't publicly release valuable financial information for any reason. In the true fashion of mozism, these figures were released first in this post in 2006 and every subsequent year. 6. Helping to Build the Web: A Day in the Life of a Web Developer Traditionally, the web developers at SEOmoz have rarely posted on the blog. In the rare instances that they did blog, it was always on a technical topic. This post was different. Jeff, our CTO, detailed the day in the life of a web developer. It was a side of his profession that is rarely seen. In addition to the post, other web developers shared their thoughts in the comments. 5. Please Stop Spamming Me for Votes Generally, the posts on here sing of the joy of being an SEO. Although being an SEO can be a fun and prosperous job, it is not without its difficult times. This post uniquely focuses on the latter. It is full of voice and proved to be more of a conversation than a declaration. 4. Dear Digg.com: I'm Going to Save You a Million Dollars with Three Lines of Code This is one of the most well written posts on this blog. It has the perfect mix of all the requirements of a successful SEO post. It provides a modest suggestion to Digg.com on how it could fix a simple canonical issue. It is well researched, understandable, and a good read. I really think we should have more posts that have this tone and present information in this way. 3. Apparently I Work for Google I think this is Rebecca's best post. It explains how she deals with the fundamental problem of our industry, explaining our job to our families. This post is funny, full of voice, and a genuine day brightener. A must read for anyone in the industry. 2. Snippets from 30,000 Feet I believe that this is the best post Rand has ever written. It is the perfect mix of all the best of the best criteria. This “day in the life” style post is not only humble and thought provoking, but also poetic. It interesting and a good read for people involved in SEO, as well as those who are not. If you have not read this post before, please treat yourself and read it. 1. Good to Great: Gillian Responds to Rand's Answers to Hard Questions I think it is very fitting that the best post ever written on the SEOmoz blog was authored by our least vocal staff member. Gillian, president of SEOmoz, shares her experience of running a successful company while maintaining a healthy relationship with her son/CEO. I think her own words describe the general sentiment of this post better than I can. “As I see it, the job of the president and/or CEO is to climb the tallest tree on the highest mountain and shout to the team hacking at breakneck speed through the forest below, Wrong mountain! Go that way!” This blog has improved by leaps and bounds since its inaugural post over three years ago. If the gems listed above are any indication of the things to come, then I warmly look forward to this blog's bright future. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Best of the SEOmoz Blog 2004-2007"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Best of the SEOmoz Blog 2004-2007"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Danny Dover\n          \n            Danny Dover\n          \n            Danny Dover"
}