{
  "url": "https://moz.com/blog/the-tender-process-do-customers-ever-get-it-right",
  "slug": "the-tender-process-do-customers-ever-get-it-right",
  "title": "The Tender Process - Do Customers Ever Get It Right? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Despite the doom and gloom reported in the wider economy, our agency has had the busiest start to the year I can remember, with an unprecedented number of invitation to tender requests. We're long enough in the tooth not to go for every tender, but even so our experience of completing these has…",
  "content": "The Tender Process - Do Customers Ever Get It Right? Online Advertising By: Matthew Kerridge April 29, 2009 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Matthew Kerridge April 29, 2009 The Tender Process - Do Customers Ever Get It Right? Online Advertising This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Hi All, Despite the doom and gloom reported in the wider economy, our agency has had the busiest start to the year I can remember, with an unprecedented number of invitation to tender requests. We're long enough in the tooth not to go for every tender, but even so our experience of completing these has varied enormously, with some being so badly run that I was prompted to write this post. I think it is fair to say that we have just been through a very wide range of tender processes, from the downright chaotic to the ultra professional, fair and efficient. I know speaking to many peers that the tender process is often much maligned, and agencies often find themselves being forced by customers to submit proposals for activities they don't believe are appropriate, or respond to requests that actively incentivise the bidders to make rash, even false promises in order to win the bid. I came across a couple more posts that are worth a read, but in the meantime, rather than jump on the client bashing band wagon, I thought it would be useful to put together a tender process guide for to help customers get their choice of agency right and recognise that the process differs depending on the types of services being sought. I thought I would ask the SEOmoz community for your own experiences and 'wish list items' that you believe would enable a more fair and successful selection process. A few thoughts of my own are listed below to get things moving: Before the ITT is issued, research agencies you think will offer you the services you seek and look like a good fit, and be clear about what you are looking for. Keep the list small (maximum of 6). Spend time writing a 'proper' ITT. If you aren't confident, get help; perhaps even ask the agencies/wider business contacts you may have to recommend a neutral consultant to work with you on defining your requirements and drafting the document (perhaps even running the tender process for/with you). I would be really interested to hear what people feel should be included in a 'proper' ITT. Only shortlist 3 agencies, perhaps even less. Consider paying for the initial tender responses - particularly if your project/requirement is large/complex, you need a high quality response. Work carried out for free and probably under tight timescales is never going to be as good as work paid for. If you keep the shortlist short, these costs shouldn't be prohibitive and should be of enormous value. Take the time to visit them, don't make them come to you. For the final pitch, it is vital that you get a real sense of the agency, not just the 'big guns' that run the actual pitch. You need to meet the actual team that will be working on your account, not the guys that you only see in the pitch. Did you get on with them? Can you see a good relationship developing? Whatever you do, DO NOT TREAT AGENCIES AS A COMMODITY. You are buying skills, not day rates. Judge your agency by ROI, not cost. You are not buying bricks. I'd really value the thoughts of the SEOmoz community, and I am planning to follow up this post with an actual tender process guide for customers. All help is greatly appreciated! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Tender Process - Do Customers Ever Get It Right?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Tender Process - Do Customers Ever Get It Right?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Matthew Kerridge\n          \n            Matthew Kerridge"
}