{
  "url": "https://moz.com/blog/the-secret-about-search-engine-marketing-that-shouldnt-be-a-secret-at-all",
  "slug": "the-secret-about-search-engine-marketing-that-shouldnt-be-a-secret-at-all",
  "title": "More Secrets of Search Engine Marketing (that shouldn't be secret) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Rand's recent post about the (not so) secret to getting high rankings in the SERPS got me thinking as to whether there are any other secrets in SEM that should really be common knowledge. And then one struck me. In fact I'd argue that it's the biggest secret about searc...",
  "content": "More Secrets of Search Engine Marketing (that shouldn't be secret) Public Relations C By: Ciaran Norris March 20, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! C By: Ciaran Norris March 20, 2007 More Secrets of Search Engine Marketing (that shouldn't be secret) Public Relations This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Rand's recent post about the (not so) secret to getting high rankings in the SERPS got me thinking as to whether there are any other secrets in SEM that should really be common knowledge. And then one struck me. In fact, I'd argue that it's the biggest secret about search engine marketing there is (for which I'm kind of grateful, or I probably wouldn't have a job), and the clue is in the name. Everything that we do is nothing more than old fashioned marketing but on a new medium, with new tools and, most importantly, new jargon that scares the bejeezus out of traditional marketers, making them run for cover. This may seem either obvious or utter crap (or a mix of the two), but let me point out just how the two (supposedly wildy differing) skill sets meet up. Let's take a look at the main aspects of SEM (by which I mean SEO & PPC): Keyword Research - One of the 1st things that any SEM does is some good old fashioned keyword research. They investigate what people are interested in, how many people are interested in a subject, and what language could be used to attract them. Sound familiar? Traditional marketers might just call this Market Research. Paid Search Advertising - Ok. We now know what people want, so let's try and get their business. What we'll do is work out our demographic, target them, put together some ad copy, decide our maximum bid, analyse results, play around with the copy, and so on until we get great ROI. In other words, Direct Marketing. Title/Description Tags - Often named as one of the most important factors in SEO, we spend hours making sure that we have unique title & description tags on as many pages as possible, that they're in good English (or French, Spanish, etc.), that they include our most important keywords, and (because of how they show in the SERPS) that they promote our USP in order to get a good click-through (or what you might just call a response). Wow - that sounds a hell of a lot like Copy Writing. Link Building - We've now got a site with good tags, well researched keywords, and some good traffic from PPC. Now we need some links to keep us in the top slot. We'll promote our content/product/services to people who are (broadly) in the same industry & have a good rep (what with the increasing importance of quality & relevance in link weight) to try and get them to link to us. I know this has been said before, but doesn't that sound a hell of a lot like PR. Ok, so sometime we may have to pay for those links - voila, Advertising. Linkbaiting - As Rand pointed out, it's not enough to just get links from relevant, quality sites. You need to get the Ryans & Seths of the digg world to submit or bookmark pages from your site. How do you do this? Well, it seems like you create some content that will get people talking, or laughing, or shouting, or simply mumbling \"Hey, that's, like, way cool\" in order to provoke the desired response. Does anyone else here remember a little 90s thing called Viral Marketing? I can hear a lot of you say \"WAIT! That's all fine & lovely, but we SEMs also have to have heaps of technical knowledge about how the engines work, what they like, and loads of other really complicated stuff that puts us way above your common or garden marketer.\" Well, yes. But, to take an example from publishing (the sector I currently work in), traditional marketers need to know about things like printing & magazine distribution. They need to know that the Royal Mail charges for delivery on weight and size of magazines, so that when they're planning a new launch, they don't come up with a magazine that will cost too much money every time it's posted to a subscriber. And they need to understand what sort of a cover is most likely to be given prominent placement in WHSmiths (one of the UK's largest magazine retailer), so that their mag doesn't get stuffed at the back with Pizza Today. This doesn't mean that they need to know how the printing presses work, or what sort of van will be used to get the magazine to the shop, but they do need to understand the rules, guidelines, and best practice for these things. Just like it's not essential (although it is desirable) for an SEM to know everything about algorithms or coding, but they do need to know best practice (which the engines even help with, with their guidelines on good web design like Google's Webmaster Guidlines). So, the next time someone asks you what search engine marketing is, the answer should be clear: it's marketing for search engines. Obvious, eh? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "More Secrets of Search Engine Marketing (that shouldn't be secret)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "More Secrets of Search Engine Marketing (that shouldn't be secret)"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ciaran Norris\n          \n            Ciaran Norris"
}