{
  "url": "https://moz.com/blog/the-ultimate-online-smoke-signal",
  "slug": "the-ultimate-online-smoke-signal",
  "title": "Sitemaps: The Ultimate Online Smoke Signal - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Getting a new website found on the internet can be difficult for some. You just have to put it up there right? Nope. You need links, or to tell the main engines that it's there. Screaming in the forest does nothing, but the homing beacon can do wonders. An XML sitemap is a great beacon.  Based on…",
  "content": "Sitemaps: The Ultimate Online Smoke Signal Technical SEO K By: Kate Morris April 24, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! K By: Kate Morris April 24, 2008 Sitemaps: The Ultimate Online Smoke Signal Technical SEO This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Getting a new website found on the internet can be difficult for some. You just have to put it up there, right? Nope. You need links, or to tell the main engines that it's there. Screaming in the forest does nothing, but the homing beacon can do wonders. An XML sitemap is a great beacon. Based on Rand's statements aout Google WMC (Webmaster Central), I think there needs to be a review of XML sitemaps and how to submit them. This is a topic that I personally knew little about (compared to others on SEOmoz, that is), so I think it warrants a How To Article based on what I know and researched this morning. First off, what is an XML sitemap? According to Sitemaps.org: In its simplest form, a Sitemap is an XML file that lists URLs for a site along with additional metadata about each URL (when it was last updated, how often it usually changes, and how important it is, relative to other URLs in the site) so that search engines can more intelligently crawl the site. How do you get one? Simple. You can either code it yourself (protocol here), or use a sitemap builder. There are tons of free ones and tons of software out there to buy. I personally use SiteMapBuilder for mine. I have them crawl my sites, save the document made, and then edit it using a text editor. (If anyone wants to join in with who you use, I'm sure newbies would be appreciative.) What is the benefit? Well, it gives a concise look at your website. It's you telling the spiders what you consider important. Is your privacy policy that important? Probably not as much as your main product page. Now you've made one, what to do now? Put it in your main directory. Ex. http://www.sample.com/sitemap.xml Edit your Robots.txt to include it for all engines. Add a line in there like this one: Sitemap: http://www.example.com/sitemap.xml Tell the engines about it directly. Learn more about Webmaster Central Here. Yahoo SiteExplorer is Here MSN/Live is here (I haven't tested this one yet) Probably the single best resource to learn about sitemaps is Sitemaps.org. Their FAQs and Sitemap Protocol say just about everything you might need. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Sitemaps: The Ultimate Online Smoke Signal"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Sitemaps: The Ultimate Online Smoke Signal"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kate Morris\n          \n            Kate Morris\n          \n            Kate Morris"
}