{
  "url": "https://moz.com/blog/the-bizarre-economy-of-links-portland-sempdx-keynote",
  "slug": "the-bizarre-economy-of-links-portland-sempdx-keynote",
  "title": "The Bizarre Economy of Links - Portland SEMpdx Keynote - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Tonight I'm in Portland for tomorrow's SEMpdx Searchfest conference, where I'll be giving a keynote address at 9am on The Algorithmic Evolution of Search Engines and the Impact on Search Marketing Campaigns. Like most keynotes, it's designed to be more of a broad overview, focusing on understanding…",
  "content": "The Bizarre Economy of Links - Portland SEMpdx Keynote Search Engines By: Rand Fishkin March 10, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin March 10, 2008 The Bizarre Economy of Links - Portland SEMpdx Keynote Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Tonight I'm in Portland for tomorrow's SEMpdx Searchfest conference, where I'll be giving a keynote address at 9am on The Algorithmic Evolution of Search Engines and the Impact on Search Marketing Campaigns. Like most keynotes, it's designed to be more of a broad overview, focusing on understanding the hows and whys of modern SEO strategy, rather than the technical specifics (which is what I usually discuss). Plus, it features slides with each of the following: Arnold Schwarzenegger from Commando Cletus the Slack-Jawed Yokel The Cast of Futurama Jamiroquai's Virtual Insanity Video Jeff Lew's Killer Bean So it's at least going to be entertaining. I'm aiming for about 35-40 minutes with 116 slides - meaning my rapid-fire, one slide per word/sentence rule is in effect. To Guy Kawasaki I say, \"Go suck on a lemon!\" Of course, after almost 16 hours to build the deck, I can definitely see the appeal of his style. I figured that for the blog readers out there, I'd leave you with these three graphs, explaining the core of the problem I'm addressing in the keynote. I need some sleep, so although I wish I had time to walk through each of them, I guess you'll just need to drive to the Portland Zoo tomorrow if you'd like to learn more :-) BTW - Mystery Guest returns home after 2.5 weeks in Italy, so expect that my free/blogging time the rest of the week will be seriously curtailed. Luckily, there's tons of great YOUmoz posts in the queue, so as Rebecca finds time, expect those to bubble up to the surface. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Bizarre Economy of Links - Portland SEMpdx Keynote"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Bizarre Economy of Links - Portland SEMpdx Keynote"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}