{
  "url": "https://moz.com/blog/the-new-direction-of-ses-an-interview-with-kevin-ryan",
  "slug": "the-new-direction-of-ses-an-interview-with-kevin-ryan",
  "title": "The New Direction of SES & An Interview with Kevin Ryan - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Last week, I received some very friendly correspondence from the Search Engine Strategies and Incisive Media organizations about my irresponsible post on speaker exclusivity. I knew that I had done wrong, and to make amends, I asked if Kevin Ryan, who was ...",
  "content": "The New Direction of SES & An Interview with Kevin Ryan Public Relations By: Rand Fishkin June 13, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin June 13, 2007 The New Direction of SES & An Interview with Kevin Ryan Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Last week, I received some very friendly correspondence from the Search Engine Strategies and Incisive Media organizations about my irresponsible post on speaker exclusivity. I knew that I had done wrong, and to make amends, I asked if Kevin Ryan, who was announced last week as the new head of the SES organization would agree to an interview. Luckily, Kevin agreed and I sent him a list of questions over email. In addition, during the Toronto SES conference, we shared coffee over an hour of discussions about SES & Kevin's new position. Kevin & Rand on the Exhibit Hall Floor During SES Toronto I'll start by sharing our email interview, and then wrap up by posting my thoughts on our meeting (and some interesting, previously unreleased news about SES). RAND: Let's talk first about your new position - what exactly will you be doing? Are you chairing the SES conferences? All of them? Some of them? Will you be creating the programming (the session ideas and formats)? Selecting the speakers? Choosing the cities and dates? Feel free to give us as much detail as you can, as I know lots of folks are very curious about this. I’ll be working with the conference chairs around the world to help develop and direct content. “Chair” maybe isn’t the appropriate term for my role, but I will be involved in all of the above (selecting speakers, sessions, et al.) RAND: Your background has taken you through quite a few different positions over the last few years - can you tell us the companies you've been with and your roles with those firms (a brief few sentences or bullet points would be terrific)? I understand you've also got some associations and formal/informal positions with various groups - could you talk about those that are public? As you know, the industry is very dynamic and I have had a few interesting experiences. I’ve spent most of my career on the agency side of the business from small start up to giant holding company. Each had their own benefits. I have made an effort to give back to the industry as much as time would permit. I have worked with the IAB, AAAA’s and SEMPO serving on various committees and action groups. In a young industry, guidance is extremely important in the early stages of development. Probably my favorite role was Search Editor at iMedia Communications and serving on the Ad:Tech advisory board. My experience in those two roles definitely influenced my decision to work with Incisive. RAND: What do you see as the biggest internal (i.e. non-competition-based) threat to the SES conference series? What are areas where improvement is either needed now or may be needed in the near future? The most important aspect of any conference or event is the audience. Maintaining fresh topical content is the highest priority. Fortunately for me, Incisive has a very solid team in place to help maintain and expand our position in the marketplace. I don’t devote much energy to edging out the competition. That is to say, looking over your shoulder is no way to run a business. I’ll be working with the Incisive team to make changes where appropriate and listening to our audience. RAND: As far as a strategy for the SES series - do you already have some ideas in place? Will we see the conference change substantively and how? Will it grow to more cities? Take on bigger formats? Will we ever see a 10,000 person show? Do you want to grow vertically to have more specific, niche conferences? Yes. (note: I've written a bit more about this below) RAND: Do you expect the speaker lineup to change dramatically? Will you be asking more speakers who haven't previously been a part of SES to come on board? Could we see speakers who haven't scored well with audiences in the past disappear from the circuit? There are seemingly innumerable experts in the field of search and I am very thankful to the speakers who have devoted time, energy and resources to making SES a success over the years. As the industry changes, there will be new personalities that emerge and I expect to see them represented at SES along with the newsmakers and movers that have made SES what it is today. RAND: One of the big industry talking points is that SES Chicago and Pubcon are scheduled at the same time this year for the first time - is that of concern to you? Do those conferences have a lot of overlap or do you think there's plenty of room for both? Will you be re-focusing the Chicago show to help differentiate it ( i.e. possibly having a greater ad/media focus rather than organic/techy focus)? Chicago is a great market and I always enjoy my time there. We plan to design a conference that will be most relevant for the audience there and of course meet the unique demands they have stipulated. RAND: Can you tell us who else was considered for the position? Do you know? I am sure it was a long and well considered search. RAND: I promise this is the only time I'll mention Danny. :) One of my favorite things about Danny (and I think a lot of other people's, too) was his willingness to put speakers on the stage who had never spent a dollar of advertising with the SES or SEW organization, even over those who had, based on the content of their work in blogs, forums, discussions, etc. If someone sent in an amazing pitch, Danny might never have heard of them before, and yet they'd be there at the next conference, presenting their material. Obviously, this wasn't always successful, some speakers were great, other only mediocre, but it made the environment dynamic and the playing field very level. If you will be programming the shows, is this something you intend to keep? Or, should we expect to see that many of the big spenders with SES & SEW will have a greater presence on the stages (which is common in many other industries)? I will be programming the shows with the assistance of the Incisive content team. Stewart Quealy and Marilyn Crafts and other members of the Incisive team have been working hard with our group around the world and I think we’d all agree that it’s important to hear from market leaders. Quite a few folks want to know what the big providers and agencies are up to yet I have always contented that many of the smart minds in our space don’t have multi-million dollar budgets. I would encourage anyone with a story to tell to reach out to me and our team will do our best make the time to listen (Kevin.Ryan at IncisiveMedia.com). Sure, not every idea or content pitch is a winner, but everyone deserves a chance. If that were not the case, Sergey and Larry’s dream might never have left the dorm. Content and sales live in separate worlds. Period. End of story. RAND: Obviously, to get this position, you must be someone who's attended a lot of search conferences. Would you share with us a few of your very favorite sessions and speakers from the past? Rand Fishkin rules! I’ve been to quite a few SES shows in the past, along with iMedia Summits, Ad:Tech conferences and a some regional shows. Singling out one speaker over another would be impossible. Usually, sessions with controversial topics are my favorites, anytime there is a lot of passion in the room entertaining and informative content will ensue. RAND: OK - Last question. Any chance we'll see an upgrade in the quality of breakfast and lunch at SES events under Kevin Ryan? Eliminate the growly tummy at 5:00pm problem? I’d say the chance of snack time improvement is 100%. What would you like? Drop me a line. Then again, it seems many people enjoy a liquid snack around 5pm. RAND: Thanks a ton for this, Kevin. Your willingness to participate means a lot to myself and the community at SEOmoz. As you've probably noticed, many of Kevin's answers over email are short and sweet - hard to blame a guy who's just gotten a new job with a thousand responsibilities, eh? (See - my time in Canada is already influencing my lexicon). Luckily, Kevin freed up an hour on Tuesday afternoon to speak with me about his history, his new role and his plans for SES. I'll do my best to share that experience without misquoting him (in fact, I'm planning not to quote him at all). Kevin and I started by discussing his background - his history with Zunch, with Kinetic Results (now Dexterity Media) with iMedia (Kevin shares his parting words here) and sitting on the board at the AD:Tech conference series (a position which he'll be giving up due to an inherent conflict of interest). Kevin described himself as someone who's very experienced with the advertising and PPC side of the search world and familiar with, though less involved with the organic side of search. He presented himself, first and foremost to me as a journalist and editor who has a great overview of the search world in general. We got to talking about his new position and where he wanted to go - definitely a tough topic for someone who's only been at the job 6 days. However, he did discuss some level of strategy. Kevin doesn't plan to expand the number of shows or the cities in which they're held (at this point). His concern is primarily around getting a sense for the market and the conferences, building a great team to assist with the programming and decision making (more on that later) and growing the existing events in both quality and quantity (of attendees & participants). Kevin noted that the only expansion geographically may be the smaller, vertically focused shows, which he feels can continue to have success in regional markets. He also believes that the pre-conference training seminars are an excellent addition and plans to grow these at conferences where it makes sense. Finally, we touched on some specifics of the SES shows and even, possibly, the origin of the rumors for my post on exclusivity. Kevin said that he strongly feels that fresh content is critical to the continued success of SES, and as such, he plans to carefully observe speakers and moderators to gauge quality and enforce rules about content - during one specific dialogue we took, Kevin told me that a speaker who makes the same presentation one week at AD:Tech or Pubcon or SMX, then brings that same presentation to SES the next week (or two weeks later) is not truly providing value to the conference series. I'm going to editorialize here and say that it's hard to disagree - poor Neil Patel gave the same presentation with me at SMX Seattle and at SES in Toronto earlier today, and even disclosed this to the audience, some of whom had been in attendance at his previous presentation (to his credit, Kevin, who was observing our session from the back of the room, didn't bat an eyelash, but I suspect he'll probably ask Neil to come up with something new for SES Miami & San Jose). I'm feeling very thankful that I put together a whole new, 58 slide, deck for Toronto (you can download the 5MB PPT - \"Get Dugg\" here). The new announcement, which Tim Walsh, Matthew McGowan and Kevin Ryan all cleared for me to release is that Kevin will be putting together a board of ~12 individuals with specialties in the field of search and search marketing to help provide input on the direction of the SES conference. Kevin noted to me that he feels that search is bigger than one person and that to effectively grow SES and make the industry the best it can be, many heads will be better than one. Kevin also indicated that somewhere between 6-10 of those positions have already been either filled or offered, so the announcement of the full board shouldn't be far away. Now - for news of a different nature... I'm a terrible bowler. I know, I know; it's a shame. However, my unremarkable bowling has put me in Incisive's debt. How you ask? Through a gentleman's agreeement (aka \"bet\") I made with Mr. McGowan last week at the SEOmoz bowling/pool/shuffleboard party. If I lost, I told Matt, I would do work for SES, while if he failed to knock down the pins, his punishment would be toiling for the SMX conference. Naturally, due to my phenomenally terrible game (I believe I scored an 81), I am now reconciled to owing Matt's organization. Hopefully, my performance moderating and speaking at Toronto has paid that off, but it's up to Matt & Tim to decide. I'll send an email asking Tim, Matt & Kevin to try to make their way to this blog post to answer questions sometime in the next few days, so feel free to leave any you might have. A big thanks to everyone at Incisive for not only their kind forgiveness, but their support and participation. And to anyone who says there's speaker exclusivity looming - get ready to fight these guys: Rand Fishkin, Jeffery Rohrs & Tim Walsh Poised for a Rumble p.s. Rebecca flew home to Seattle today, but I'm staying on the east coast (NJ & DC) for client meetings and won't return until next Thursday, so email & posting will continue to be slow - my apologies. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The New Direction of SES & An Interview with Kevin Ryan"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The New Direction of SES & An Interview with Kevin Ryan"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}