{
  "url": "https://moz.com/blog/the-massive-ranking-factor-too-many-seos-are-ignoring-whiteboard-friday",
  "slug": "the-massive-ranking-factor-too-many-seos-are-ignoring-whiteboard-friday",
  "title": "The Massive Ranking Factor Too Many SEOs are Ignoring - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There's an incredibly important ranking factor that SEOs just aren't paying enough attention to, and Rand (as Randa Claus) is here to fill you in with a very special episode of White*beard* Friday.",
  "content": "The Massive Ranking Factor Too Many SEOs are Ignoring SEO Basics | Whiteboard Friday By: Rand Fishkin December 26, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 26, 2014 The Massive Ranking Factor Too Many SEOs are Ignoring SEO Basics | Whiteboard Friday The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Despite Google's ambiguity about how it's used in the algorithm, we've seen evidence time and again that there's a giant ranking factor that SEOs just aren't optimizing for. In today's very special Whitebeard Friday, Rand (or Randa Claus) shows us how to fill in this important gap in our work. For reference, here's a still of this week's whiteboard! Video transcription Ho, ho, ho. Howdy, Moz boys and girls, and welcome to another special Christmas edition of Whitebeard Friday. I'm your host Randa Claus. (pause) I just can't keep making fun of Santa like this. It's just terrible. I am very thrilled to have all of you with us for the holidays and for this special edition of Whitebeard Friday. We actually have some really important, juicy, meaty SEO material. Hopefully, my beard won't get too much in the way of that. I feel like I have the same mustache. It's just whiter this week. I want to talk about this big ranking factor that a lot of SEO practitioners and experts are almost ignoring. By ignoring, I don't mean to say we don't know it exists. We just aren't optimizing it yet. That factor is engagement. I'm not just talking about onsite engagement. I'm talking about overall web engagement with your site and your brand. That can manifest in a bunch of different ways. A branded search is certainly one manifestation of that. Direct navigation, so lots of people going directly to your website, lots of people typing in searches for clearly your brand. They want to go just to your website. Time on site and browse rate, we've seen a bunch of elements around this. Pogo-sticking, which we've talked about on Whiteboard Friday previously. Traffic referrals, meaning traffic you're sending out to the rest of the web. Google can see this. They have Chrome. They have Android. They have Google Analytics. They have all sorts of plugins. They have the web's biggest advertising network. They can see all of this stuff. Then, finally, amplification in the forms of press and PR and word of mouth, kind of the non-link forms of amplification, which could even encompass social media. So what is our evidence that these things are real factors in the search ranking algorithms? Well, unfortunately, unlike the early days of links when this was more directly observable and when the search engines were a little more open about this, they've been pretty quiet about engagement. They all talk about it in a broad sense, but they don't specifically say, \"Oh, yes, we specifically use time on site and browse rate.\" In fact, they're very nuanced around this. The only thing that I've heard engineers or search engine folks say is, \"Yes, we do use pogo-sticking, and yes, we will look at some forms of amplification and some things around brand,\" which you could interpret to mean maybe branded search and some things around brand that could be interpreted as direct navigation. But they are not specific about this. However, we've seen tons of experiments and lots of information that suggest that even if these aren't exactly what they're using, they're using stuff like it. When you see experiments that show, hey, despite the fact that site speed is a very small factor, we reduced the page load time and saw all these wonderful things happen around search. What's going on there? It's some form of engagement. It's something they're measuring around that, that's not just site speed, but engagement overall. That increases as you bring page load speed down. So what's the problem here? Why is it that SEOs, many of us at least, are not optimizing for this yet? Well, the answers are oftentimes we don't have the authority. If you go to someone, you pitch an SEO project internally at your company, you're the person who runs SEO, and they're like, \"No, you take care of our crawlability. You take care of our links. You're not responsible for how much traffic we send out or the time on site and browse rate or amplification and press.\" Those are all different departments, and it's very tough to get that synchronization between them. We may not have access to the tools or the data that we need to measure this stuff and then to show improvements. That's very tough and hard too. Then the inputs around a lot of this stuff are not direct. Let's go back to links as an example. If you know that links are the big ranking factor for you, you can show, \"Hey, we got this many links. Here's how it changed our ranking position. We need more. Here's how we go about getting them.\" Plan, execution, analysis, it's simple. It's direct. It may not be easy, but it is observable. This is often indirect. There are so many things that impact this stuff that's indirect, and that's really tough and frustrating. As solutions, it's going to be our job to do what early SEOs had to do -- socialize. We have to go out to the industry, to our colleagues, to our clients if we're consultants, to other web professionals across all the forms of marketing, and we have to socialize the fact that engagement is a major input into SEO, just like SEOs did starting in about 1999/2000, where we had to explain, \"Look, this is how links work. Links are important. It's not just about getting listed in the directory. It's not just about keywords anymore. It's not just about meta tags anymore. Links really matter here. I can show you Google's PageRank paper here. I can show you all these patent applications here. I can show you the impact of links.\" We have to do that again with engagement. That's going to be tough. That's going to be an uphill battle, but I believe it's something we're already starting. A lot of industry leaders have done this ahead of this Whiteboard Friday for sure. Second off, we've got to utilize the tools that we do have available to be able to get some of this data, and there are some. While I am no big fan of Google Webmaster Tools -- I think a lot of the data in there is inaccurate -- we can look at trending numbers around things like branded search, and we can do that through Google Analytics. So Google Analytics, yes, keyword not provided is 90% of your referrals. That's okay. Take the sample 10% and show over time whether you're getting a bigger and bigger proportion and bigger and bigger quantities of branded search. That's a directional input that you can use to say, \"Look, our brand is growing in search. There it is.\" You can do user testing around search results. This is something I see very few folks doing. We often do usability and user testing on our websites, but we don't do them in the search results. If you ask a group of five users, \"Hey, go perform this search. Take a look at these 10 results. Tell me which one you would choose and why. Now tell me your second choice and why. Now tell me your third choice and why,\" you will get to things like time on site. You'll get to things around pogo-sticking. You'll get to those engagement metrics that happen in the search results. Then, of course, you can use, if you're a Moz subscriber, Fresh Web Explorer or something like mention.net or Talkwalker or Trackur or something to get these amplification numbers and data that you might not be able to get from raw links themselves. This is gettable data, just in different ways than we're used to. Finally, we actually are going to have to change what we're comfortable with. We're going to have to get comfortable in a world where the ranking factors are indirectly influenceable, not directly influenceable. That's weird for us, because we've always said, \"Okay, algorithm has all these factors. I can influence these ones. That's the ones I need to work on. I'm going to go to work.\" Now we have to go, \"Wait a minute, wait a minute. In order to influence traffic referrals, I'm going to have to do things around my content, things around how I earn traffic, and then, boy, I don't know if that'll have a direct impact on my rankings.\" You don't. This is a world of indirect inputs. This thing, this tactic I'm going to pursue is going to lead to this thing, which I hope is going to lead to engagement, which I hope is going to lead to rankings. That's frustrating. It's harder to sell. It's harder to invest in, but, oh man, the ROI is there. If you can do it, if you can earn that buy-in, you can make these investments, and then through experimentation, you can learn what works for you and where you need to move the needle. This is going to be weird because it's a world where our tactics are correlated, but they aren't explicitly causal into the ways that we influence the rankings. It's a whole new world, but it's about to be a new year, and I think it's a great time for us to invest in engagement. With that, happy holidays, whatever holidays you celebrate. Happy new year if you celebrate the new year. I'm looking forward to seeing lots of you here on Whiteboard Friday in 2015. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Massive Ranking Factor Too Many SEOs are Ignoring"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Massive Ranking Factor Too Many SEOs are Ignoring"
    },
    {
      "level": "H2",
      "text": "Video transcription"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}