{
  "url": "https://moz.com/blog/the-mozcon-2015-agenda-has-arrived",
  "slug": "the-mozcon-2015-agenda-has-arrived",
  "title": "The MozCon 2015 Agenda Has Arrived! - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Check out our lineup for MozCon 2015. We have some incredible talks, ranging from technical SEO and email marketing to content strategy and digging into your creative side.",
  "content": "The MozCon 2015 Agenda Has Arrived! SEO Events By: Erica McGillivray May 14, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Erica McGillivray May 14, 2015 The MozCon 2015 Agenda Has Arrived! SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. We're super-thrilled to say that it's finally here: the MozCon 2015 Agenda. MozCon is July 13-15 in Seattle. We have an outstanding lineup this year featuring topics ranging from technical SEO and email marketing to content strategy and digging into your creative side. All of our speakers are already gearing up to deliver top-notch and actionable tips. And if you still need your ticket: Buy your ticket now! If you have any questions about the schedule, we'd love to hear 'em. Feel free to ask in the comments. MozCon 2015 Agenda Monday 8:00-9:00amBreakfast 9:00-9:20amWelcome to MozCon 2015! with Rand Fishkin MozCon 2015 is here. Rand brings in the fun, recaps where our industry's been, and talks a bit about the future. Husband of Geraldine. Founder of Moz. Presenter of Whiteboard Friday. Writer of blog posts. Sender of tweets. 9:20-10:05amHow to Make Your Marketing Match Your Reality with Dana DiTomaso Too often, the tone and promises of marketing don't match those of the business itself. Dana will help you bring your brand identity together, both in-store and online, whether at a conference, on the radio, or in a meeting. Dana DiTomaso likes to impart wisdom to help you turn a lot of marketing bullshit into real strategies to grow your business. After 10+ years, she's (almost) seen it all. It's true, Dana will meet with you and teach you the ways of the digital world, but she is also a fan of the random fact. Kick Point often celebrates \"Watershed Wednesday\" because of Dana's diverse work and education background. In her spare time, Dana drinks tea and yells at the Hamilton Tiger-Cats. 10:05-10:25amAM Break 10:25-11:25amHow To Do Content Strategy (Probably) with Kristina Halvorson Put 10 people in a room and ask them to define “content strategy,” and you’ll likely get 10 different answers. Kristina will share her own tried-and-true approach! Kristina Halvorson is widely recognized as one of the most important voices in content strategy. She is the founder of Brain Traffic, the coauthor of Content Strategy for the Web, and the founder of the Confab content strategy conferences. 11:25-12:10pmAn SEO's Guide to the Insane World of Content with Matthew Brown Find yourself arguing whether or not SEO is just great content? Matthew will talk through a strategic and tactical journey of content strategy from an SEO's viewpoint and leave you with new tools and tactics. Matthew Brown is on the Product Strategy and Design team at Moz, where he spends equal time on new products and staying out of the way. He enjoys bourbon and working on his upcoming novel, \"Fifty Shades of Ginger\" (look for it in 2019). Follow him at @MatthewJBrown for his special brand of hot takes. 12:10-1:40pmLunch 1:40-2:00pmDelightful Remarketing: How You Can Do It with Duane Brown By focusing on the differences between remarketing and creating delightful remarketing, Duane will help you grow the revenue and profit for your brand. Duane Brown is a digital marketer with 10 years' experience having lived and worked in five cities across three continents. He's currently at Unbounce. When not working, you can find Duane traveling to some far-flung location around the world to eat food and soak up the culture. 2:00-2:20pmThe Perfect Pair: Using PPC Data to Influence SEO with Stephanie Wallace PPC is an easy testing ground for your SEO. Stephanie will explain how to better integrate them and leverage campaign data to influence SEO strategies. Stephanie Wallace is Director of SEO at Nebo, a digital agency in Atlanta. She helps clients navigate the ever-changing world of SEO by understanding their audience and creating a digital experience that both the user and Google can appreciate. 2:20-2:40pmTracking Beyond the Pageview with Adrian Vender Typical engagement analytics don’t tell the full story of how people interact with your website. Adrian will show you how to use Google Tag Manager to turbocharge your content tracking and custom reports. Adrian Vender is the Director of Analytics at IMI and a general enthusiast of coding and digital marketing. He’s also a life-long drummer and lover of music. 2:40-3:00pmPM Break 3:00-3:35pmToo Busy to Do Good Work with Marta Turek Don't let your work suffer from being busy. Instead, let Marta show you the tactics to clean up your PPC processes to finally get more strategic. Marta Turek holds seven years of experience in digital advertising, specializing in lead generation, and paid search marketing. Developing digital strategies and telling stories through data is what rocks her boat. She's currently at ROI·DNA. 3:35-4:10pmOnline Personalization that Actually Works with Cara Harshman Personalizing your marketing may be a daunting idea right now, but after Cara breaks it down, you’ll realize why embracing it early will be transformative, highly lucrative, addicting, and not creepy. Cara Harshman tells stories at Optimizely. She was the second marketer to join and is now a Content Marketing Manager+Blog Editor. In 2012, she (openly) ghost-wrote A/B Testing the book, on behalf of the co-founders. 4:10-4:55pmUltimate Search and Social Mashup: Expertly Curate Owned Audience Cookie Pools with Marty Weintraub Stay relevant, marketers! Learn to mine merged search and social data to build audience-based cookie pools for performance marketers to exploit. Marty is Founder of aimClear®. He was honored three years straight as a \"Top 25 Most Influential PPC Expert”; was 2013 \"US Search Personality of the Year”; is an acclaimed author; and fixture on the international digital marketing conference speaking circuit. 7:00-10:00pmMonday Night #MozCrawl We’re having a pub crawl on Monday, official stops coming soon. You’ll be able to explore some of our favorite haunts and make some new friends. Go at your own pace, and visit the stops in any order. Spread across seven bars, each stop is sponsored by a trusted partner and one by us. You must bring your MozCon badge—for free drinks and light appetizers—and your US ID or passport. See you there! Tuesday 8:00-9:00amBreakfast 9:00-9:45amSurviving Google: SEO in 2020 with Pete Meyers Organic results are disappearing, replaced by Knowledge Graph, direct answers, new ad hybrids, and more. How can SEOs be ready for Google in five years? Dr. Pete Meyers is Marketing Scientist for Moz, where he works on product research and data-driven content. He has spent the past three years building research tools to monitor Google, including the MozCast project, and he curates the Google Algorithm History. 9:45-10:30amBecome a Mobile SEO Superhero with Cindy Krum With Google's algorithm mobile change, Cindy will walk you through the changes, what they mean for your site and its rankings, and what you should be focusing on going forward. Cindy Krum is the CEO and Founder of MobileMoxie, LLC, and author of Mobile Marketing: Finding Your Customers No Matter Where They Are. She brings fresh and creative ideas to her clients, and regularly speaks at US and international digital marketing events. 10:30-10:50amAM Break 10:50-11:25amDigital Analytics: People, Process, Platform with Adam Singer In a data-driven world, Adam will pull you back to think again about your analytics, best practices, and how you report. Adam Singer is Analytics Advocate at Google, startup adviser, investor, and blogger. He previously was director for a global consulting team and has provided digital strategy for brands in a variety of industries including marketing, technology, healthcare, and more. 11:25-12:00pmHow to Better Sell SEO to the C-Suite with Purna Virji Whether you need more resources, trust, or buy-in, Purna will share practical tips for focusing on Profit & Loss and better communicating SEO planning, forecasting, and strategizing. Purna Virji is the founder and CEO of Purview Marketing, a boutique consulting firm helping companies of all sizes grow via search and content marketing. Purna is an avid traveler and speaks six languages (and can swear in 17!). 12:00-12:35pmDrive More Conversions with Lifecycle Email Campaigns with Tamara Gielen Triggered emails can be powerful marketing. Tamara will lead you through data-driven decision making to improve your campaigns and connect with customers. Based near Brussels, Belgium, Tamara Gielen is one of the world's leading experts in email marketing with over 14 years of experience managing email marketing programs for international corporations. 12:35-2:05pmLunch 2:05-2:40pmReaching Critical Mass: 150 Active Members with Rich Millington Imagine you could create and rejuvenate a successful community whenever you like? Richard Millington will take you through a step by step action plan to reach critical mass. Richard Millington is the Founder of FeverBee, a community consultancy, and the author of Buzzing Communities. 2:40-3:25pmDark Search and Social—Run Rabbit Run! with Marshall Simmonds With data from 112 publishers with 164+ billion page views, Marshall will dive into the challenges of tracking social and search campaigns. He'll focus on history's lessons and what’s happening with direct and mobile traffic in an app-heavy world. Marshall Simmonds is the Founder of Define Media Group, the enterprise audience development company specializing in strategic search and social marketing. Define works with many of the most influential brands and networks in the world. 3:25-3:45pmPM Break 3:45-4:20pmBack to the Future with Local Search with Mary Bowling Google's model of our world now mirrors the physical world better than it ever has before. Learn how to meld the online and offline actions of your business for optimal Local Search success. Mary Bowling's been concentrating on helping businesses succeed with Local SEO since she got into this crazy biz in 2003. She's a consultant at Optimized!, a partner at Ignitor Digital, a partner in LocalU, and a trainer and blogger for Search Engine News. 4:20-5:05pmThe Time to Do the Web Right Is Incredibly Short with Wil Reynolds In \"web time,\" competitive advantage can be lost in an instant, speed matters. Wil shares how keep on the pulse of competitor agility and how to get things done to stay ahead of them. Wil Reynolds - Director of Strategy, Seer Interactive - founded Seer with a focus on doing great things for its clients, team, and the community. His passion for driving and analyzing the impact that a site's traffic has on the company's bottom line has shaped SEO and digital marketing industries. Wil also actively supports the Covenant House. 7:00pm-10:00pmMozCon Ignite at Benaroya Hall We're thrilled to announce the addition of a networking and Ignite-style event for attendees on Tuesday night. Join us to meet—and—greet your fellow community members and hear them talk about their passion projects. Leave that notebook in your hotel and settle into some fun. Enjoy light appetizers and a couple of drinks on us. Want to speak at (or just learn more about) this event? We are accepting pitches through Sunday, May 17, at 5pm PST! Wednesday 8:30-9:30amBreakfast 9:30-10:15amMarketing Innovations: Creative PR, Content, and SEO Strategies with Lexi Mills Lexi shows you how to apply strategies used in emerging markets to grow the success of your PR, SEO, and content work from bathrooms to rock bands. Lexi Mills is a PR SEO specialist, with over eight years experience working with both small firms and big brands. She has designed and implemented integrated PR, SEO, content, and social campaigns in the UK, Europe, and USA for B2B and B2C clients. She's currently at DynamoPR. 10:50-11:10amAM Break 11:10-11:30amGet Hired to Do SEO with Ruth Burr Reedy You dream in SEO—but all the SEO job descriptions require something you don't have! Ruth Burr Reedy will teach you how to show employers you know your stuff, by building your personal brand with real-life examples of your SEO prowess. Ruth Burr Reedy is the head of on-site SEO for BigWing Interactive, a full-service digital marketing agency in Oklahoma City, OK. At BigWing she manages a team doing on-site, technical and local SEO. Ruth has been working in SEO since 2006. 11:30-11:50amRocking Your CRO Efforts with Radical Redesigns with Chris Dayley Too often we have design blinders on when running A/B tests, focusing only on things like button text. Chris will help you break through to find dramatic gains in your CRO efforts. Chris Dayley is a digital marketing expert and owner of Dayley Conversion. His company provides full-service A/B testing for businesses, including design, development, and test execution. 11:50-12:10pmParole, Parole, Parole: Practical, Modern Keyword and Topical Research with Gianluca Fiorelli Just using Keyword Planner and Google Suggest is a waste time. Gianluca will show you how keyword and topical research is more about culture, not guessing, and explore unusual sources and seldom used tool features to make your research more effective. Moz Associate, official blogger for Stateofdigital.com and well-known International SEO and Inbound Strategist, Gianluca Fiorelli works in the Digital Marketing industry, but he still believes that he that he knows nothing. 12:10-1:40pmLunch 1:40-2:15pmThe Psychology of Social Media with Courtney Seiter Courtney dives into the science of why people post, share, and build relationships on social media and how to create an even more irresistible social media experience for your audience. Courtney Seiter examines social media and workplace culture at Buffer, and her writing has been published at TIME, Fast Company, Lifehacker, Inc., and more. She lives in Nashville, where she is a founder of Girls to the Moon, a leadership camp for girls. 2:15-2:50pmAstoundingly Useful Applications of Facebook Search for Marketers with David Mihm Facebook has long neglected its potential as a local search giant, and as a result, its Graph Search product is an afterthought for too many marketers. David showcases Graph-powered insights for small-business marketers—with utility well beyond Facebook. David Mihm has created and promoted search-friendly websites for clients of all sizes since the early 2000’s. David co-founded GetListed.org, which he sold to Moz in November 2012. He now serves as Moz's Director of Local Search Strategy. 2:50-3:10pmPM Break 3:10-3:45pm(Check back soon; we're still finalizing the details of this session!) 3:45-4:30pmOnsite SEO in 2015: An Elegant Weapon for a More Civilized Marketer with Rand Fishkin SEO has come full circle as on-page SEO has returned to the forefront. Rand will share how and why on-site SEO is so important and show off uncommon tactics with powerful potential. Husband of Geraldine. Founder of Moz. Presenter of Whiteboard Friday. Writer of blog posts. Sender of tweets. 7:00pm-12:00am Wednesday Night Bash at the Garage Do you love singing \"I Love Rock n' Roll\"? How about bowling in some fancy shoes? Or are you a pool shark? Our after-party has a little something for everyone. Chill with the new friends you've made, catch up with your old friends, and get to know the people you've only ever met online. We'll provide heavy appetizers and plenty of beverages. This year's assortment includes the MozCow Mule Mocktail, as well as well liquor, beer, house wine, soft drinks, and of course, plenty of our friend H2O. Make sure to bring your MozCon badge and an ID (driver's license or non-US passport). See you there! Ready for MozCon? Buy your ticket now! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The MozCon 2015 Agenda Has Arrived!"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The MozCon 2015 Agenda Has Arrived!"
    },
    {
      "level": "H2",
      "text": "MozCon 2015 Agenda"
    },
    {
      "level": "H3",
      "text": "Monday"
    },
    {
      "level": "H3",
      "text": "Tuesday"
    },
    {
      "level": "H3",
      "text": "Wednesday"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Erica McGillivray\n          \n            Erica McGillivray\n          \n            Erica McGillivray"
}