{
  "url": "https://moz.com/blog/the-vast-ocean-between-shoemoney-seomoz-and-why-you-should-be-able-to-trust-blog-links",
  "slug": "the-vast-ocean-between-shoemoney-seomoz-and-why-you-should-be-able-to-trust-blog-links",
  "title": "The Vast Ocean Between Shoemoney & SEOmoz and Why You Should Be Able To Trust Blog Links - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I don't think many would argue that Jeremy Schoemaker and I have very different styles of blogging and doing business. In person, Jeremy's always been a great friend and someone I really respect, but on his blog, things are different. I sometimes feel a great disconnect between the way he…",
  "content": "The Vast Ocean Between Shoemoney & SEOmoz and Why You Should Be Able To Trust Blog Links Public Relations By: Rand Fishkin May 30, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 30, 2007 The Vast Ocean Between Shoemoney & SEOmoz and Why You Should Be Able To Trust Blog Links Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I don't think many would argue that Jeremy Schoemaker and I have very different styles of blogging and doing business. In person, Jeremy's always been a great friend and someone I really respect, but on his blog, things are different. I sometimes feel a great disconnect between the way he approaches topics and the way I'd wish to see them presented. Case in point - his post, Full Disclosure, Assume the Position: In fact every time I see a blog post or basically anything including conversation I assume someone is benefiting from mentioning the product they are talking about. Even if they are not paid directly for reviewing or mentioning the product directly I assume they are hoping the users find the information useful or maybe even the product owner will see the review and pay them in the form of mentioning them back or advertising on there site... ...So basically my disclosure policy is you should assume I am getting paid for or will get paid for anything I ever mention... ...I think these blogger disclosure policies while noble and all that good stuff are extremely silly. Everyone gets paid one way or another. OK, let me first say that I agree with Jeremy's opinion about blogger disclosure policies or some sort of blog organization that lords over bloggers with codes of conduct. I'm not a fan of it in the SEO world, and I'm not a fan of it in the blogosphere either. It's up to individual bloggers to decide and individual audiences to trust or reject what they read. That said, I'm having a really tough time getting my head around Jeremy's message, and I left a few comments to that effect. Over the past few months, SEOmoz has written some nice things about Eric Enge, the SMX conference, Keycompete, Text-Link-Brokers, Reddit, the Googlers and dozens of others. Guess what - no kickbacks, no payments, no under-the-table favors. We're not being paid to speak at SMX (in fact, we're paying to send a mozzer to cover it). We receive no kickbacks or even a free acount from Keycompete. We had a relationship with TLB where they hosted our site for a couple months, but the bandwidth got too much and we switched to Superb Hosting and guess what - full disclosure. I would be absolutely shocked to hear that someone thought SEOmoz received benefits or kickbacks from the companies we use. Even Indextools, which I love, and am very fond of talking about, doesn't give us anything beyond the usual free account for re-sellers and discounts for having many clients with them. When I link to them, I never use an affiliate link or have them track that traffic. I like their service; I share my experiences honestly; end of story. We support a huge endorsement of vendors on the recommended list - a list that I send several interested parties to every day. Guess what, when someone does try to give us a comission for those referrals, I always say no. Here's my exact response to one recently: ... that's an incredibly sweet offer, and much as I'd love to accept, I simply can't. If we took money from the referrals, it would be very tough for me to continue to give potential clients unbiased advice about who to choose. But, you can definitely buy Mystery Guest and I a drink in New York :) OK, so maybe free drinks are technically a kickback, but you get the idea. My opinion on this is unshakeable - if you are recommending services because you've been paid to recommend them, you're doing your audience a disservice. I understand the Pay-Per-Post concept and I think it's fine if you get paid, offer an honest review and provide both pros and cons, positive and negative feedback. I even think Google & the other engines should be counting those links - the publisher has given them trust by providing a non-no-followed link, so it's really up to the engines to decide how much they trust the publisher (and how much others do), but I'm getting off-topic. What really makes me upset about Jeremy's post are the comments. Just read: I have to agree with you shoe. I tend to think/feel the same exact way. Its like what they say about sex! we all pay one way or another! I think it’s stupid when someone puts a marker next to affiliate links as if the reader isn’t astute enough to realize that the writer will be benefiting… money makes the world go round. Amen. Blogging isn’t about 12 year old emo girls publishing their poetry anymore, it’s its own media outlet and is just as commercial as any other. People need to get that through their heads. I would have to agree with you Jeremy. Everyone benefits somewhere, somehow. Even in blogging or a website. Couldn’t agree more on this… blogging is all about getting publicity. Seriously, out of about 70 comments, 30-40 are folks relentlessly agreeing with Jeremy's position that bloggers are perfectly within their rights to dupe their audiences about their motivations for writing or linking to content/tools/services/companies/etc. Luckily, there are a few folks whose thinking more closely matches my own: I had already assumed that and that’s the reason I don’t take any of your recommendations seriously! It’s all about putting money in YOUR pocket, not ours. Non-disclosure mainly becomes a problem if you end up endorsing something in order to get paid for it. It gets worse if it is a product that you have never really tried, or didn’t even like. My favorite comes from Noah Robinson: Wow, so basically, you’ve decided that (a) your thoughts and ideas posted are for sale for any price you deem worthy; ( b) there’s no reason to make specific disclosures about whether you’re influenced here or there cause you’re ALWAYS influenced... ...But anyone that reads your blog, in the past, or moving forward, should know that your statements are most likely biased in some way to make you more money. You’re not here to help others, you’re here to make others think you’re helping them, while simultaneously, making money off that advice…even if it’s not the best advice that would help others. Basically you’ve undercut the very authority and credibility that you’ve worked so hard to build up. I think you ought to reconsider this one… I'm with Noah. It seems like after this post, it would be very hard for me to take Jeremy's advice about any product, service or website seriously. I'm not suggesting his blog is no longer valuable, but with such clearly corrupt editorial practices, how could we judge whether he really thought a service was good or not? How could we know whether he isn't hiding a contributor's skeletons in the closet? If you've been paid to blog about a product or service, or you want to throw an affiliate link into your blog or if you even want to recommend services that provide you a commission, by all means, go for it! I'm not saying there's anything wrong with that, and I certainly am not trying to tout SEOmoz as some great and mighty ethical angel casting the first stone. I'm just saying - tell me about it. Give me the truth so I can judge for myself if your advice is valuable and helpful. There's two possible scenarios here - #1: You write about a product/service and tell your readers that you've been paid to do so They think - hmmm, well it's a paid review, but I trust that Shoemoney guy; he's given me good advice in the past and if he wants to make a few bucks, hey, who am I to stand in the way? They check out the referral and give it a fair shake Then, there's scenario #2: You write about a product/service and make no disclosure about any financial benefit you might receive Your readers see it and think - wow, Shoemoney really likes that company, I should check them out The reader has a favorable opinion and perhaps buys services Later, they discover through one channel or another, that you were compensated for your review They feel betrayed. Maybe the service is fine, but their trust is now lost - how can they take your advice at face value again in the future? How do they know you'll be honest with them if something goes wrong with the company's services? Why should they believe what you say? Now look, if Jeremy's making this post just to tell his audience that Shoemoney.com and all the products he might recommend should be considered paid reviews, OK. I'm cool with that. But, he's going a step further and saying that no one, anywhere, on any blog, should have to disclose money they earn from writing about a company. It's not the ethics of it that bug me, it's the potential outcome for those who might take that advice. It's the scenario #2 situation I just described. SEOmoz itself has recently been taken to task for our monetization strategies with the premium content, re-design of the homepage, inclusion of ads, etc. We certainly blog not only out of the goodness of our hearts, but as a significant part of our marketing strategy. I'm not arguing here the blogs must be 100% altruistic with no business side benefits in order to be trusted. I'm saying there's a world of difference between a blog like SEOmoz or SearchEngineLand or SEO-Scoop or MarketingPilgrim where the best possible advice is offered in the hopes of attracting traffic, building trust and gaining from the indirect benefits of premium membership or advertising vs. the undisclosed sums exchanging hands in order to get a recommendation or promotion of a service that may or may not be any good (even in the eyes of the reviewer). Jeremy's obviouslyl not going this route - his blog does provide valuable advice and I think that he often times does give a fair & balanced shake to the services he reviews, even when they have paid him. But, he's suggesting that others don't even have to be that forthright. What do you think? Is it really OK for bloggers to hide their financial benefits from their audiences? Is it true that SEOmoz is benefiting just as much from our supposedly \"unbiased\" blogging as Shoemoney does from his paid blogging and I'm being hypocritical? Should there be a boundary? p.s. Despite this, Shoemoney's staying in my regular reading list and Jeremy will certainly remain a friend. But, hey, if we can't disagree, then that becomes a disclosure problem itself? :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Vast Ocean Between Shoemoney & SEOmoz and Why You Should Be Able To Trust Blog Links"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Vast Ocean Between Shoemoney & SEOmoz and Why You Should Be Able To Trust Blog Links"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}