{
  "url": "https://moz.com/blog/the-end-of-link-building-as-we-know-it",
  "slug": "the-end-of-link-building-as-we-know-it",
  "title": "The End of Link Building as we Know It - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The entire online marketing industry is still up in arms after Matt Cutts's post on his blog title: The Decay and Fall of Guest Blogging for SEO. Guest Blogging was one of the last horizons that people considered safe for “White Hat” link building. So what now? Is guest blogging truly dead?",
  "content": "The End of Link Building as we Know It Link Building By: Marcela De Vivo March 18, 2014 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Marcela De Vivo March 18, 2014 The End of Link Building as we Know It Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. The entire online marketing industry is still up in arms after Matt Cutt’s post on his blog title: The Decay and Fall of Guest Blogging for SEO. Guest Blogging was one of the last horizons that people considered safe for “White Hat” link building. So what now? Is guest blogging truly dead? Part One What I’ve learned from being a Link Audit Junkie Before we can talk about guest blogging, I have to share with you what I’ve learned from two years of deep-diving into link audits and detailed competitive research. After the first Penguin hit on April 24, 2012, I focused on performing in-depth research to identify patterns in penalized sites. What I quickly noticed was that most people who were penalized had very clear footprints in their backlink profiles. These were not easy to detect if you only looked at the profile of the individual sites, but when you ran a competitive link audit and established averages for the keyword sector as a whole, this became a “meter” from which to judge a specific site’s link footprints. Later I incorporated private tools that allow you to search for patterns within a site’s backlink profile. These patterns include links on the same IP address or C class, links with similar or duplicate text, links with the same anchor text, links with the words “articles” in the URL, even link patterns that are two levels removed (the links to the links). For the last 12 months or so, most of the sites that I looked at that were penalized had the following in common: High density of money keywords in anchor text Unnatural anchor text profile Many links from article marketing directories Many links from general directories Too many unnatural ratios: Too many links from follow vs nofollow sites Too many links from low-quality pages or pages not indexed in Google Money vs brand anchor ratio was skewed Sites with unnatural links are very easy to spot when you look at their link profile. You can detect sites with unnatural link profiles from a mile away with the right tools. And let’s face it - Google has those tools. If we can see it, you better believe they can as well. The patterns are easy to spot: if your link building strategies are not impeccable, they can be spotted a mile away. Examples of Unnatural Links Google’s Disavow and Reconsideration process is very complex, and it sometimes takes us several submissions to get clients out of the penalty box. Typically when a reconsideration request is denied, Google includes examples of the links that they consider still unnatural. In the past, these links ranged from article marketing sites, to forum or comment spam, to low-quality directories. Until recently, guest posts were never cited as examples for unnatural links. Part Two Guest Posts now under the “Unnatural Links” Umbrella After Matt’s post on January 20th, we’ve received several letters back from Google, and in many cases, they cited links to low-quality guest posts as examples of unnatural links. This is the first time I’ve ever seen this link type included in the denial letters. Matt’s comments on his blog have been followed by one significant change: the Google Web Spam Team appears to have been instructed to include low-quality guest posts in their list of unnatural links. This has resulted in a new wave of manual penalties for sites with unnatural links in their profiles (including, of course, these low-quality guest blog posts), while sites currently penalized are being kept in the hot seat for the very same posts. What is the Difference between Low-Quality and High Quality Guest Posting? There are several common elements in the backlink profiles of newly-penalized sites and in the examples of low-quality guest blog posts cited by Google: The sites have little to no social engagement, comments, or shares; Poorly designed sites obviously created for the sole purpose of hosting guest posts and selling advertising; Links in the guest post to the target site contain money keywords in anchor text; The authors are anonymous or don’t have Authorship set up; The “theme” of the content is extremely varied. You may see an article about “debt consolidation” followed by one on “online schools” followed by an article talking about “satellite TV”; The sites feature excessive use of money terms in their tags or category names; There are few to no static pages; There is no “About Us” page, address, or number listed - no endorsement of a “REAL” person behind the site; There are footprints in the guest posts - for example, they all use the same or similar author bio or use money keywords in anchor text; The links to the target site land on obvious “money” pages selling a product or lead acquisition form; The content of the guest posts is very similar or low quality. We know Google has the ability to filter by Reading Level, and that they’ve gotten better at semantic analysis and understanding meaning and context. It’s likely they’re using this as one of the criteria when analyzing guest post links in backlink profiles; Links to obvious authority sites. It’s a common link building footprint to link out to 2-3 topical authorities, alongside the link to the target site; The quantity of guest post links in the profile is too high. If there are 100 backlinks, and 50 are from guest posts, the ratio is too high and this creates an unnatural footprint; Guest posts appear on sites that also sell text links or sponsored posts. The Danger is in the PATTERNS Notice how often I’ve used the words PATTERNS and FOOTPRINTS in this article. When you do large scale or low-quality guest posting, unless you’re spending the time and attention to do it extremely well and carefully, you’ll likely be leaving identifying footprints that Google’s advanced filters can easily spot. This, I suggest, is at the crux of these recent developments. Scaling guest posting is very difficult and expensive. Most companies quickly discover this and search for ways to make guest posting scalable and affordable. After all, unless the company has a dedicated online marketing team, odds are business owners spend most of their time running their business, not running an editorial calendar. Certainly not writing and publishing content at the rate required to build authority online. Outsourcing therefore becomes the most viable alternative. So off these companies go to Odesk or Elance to find offshore companies who can help them scale the outreach and content development portion of their link building campaign. Often these companies rely on people who speak English as a second language. This lands us back in square one: Google does not like spammy content. A content producing assembly line churning out guest post after guest post is exactly that: spammy content. Eventually, spammy guest blog posts become just spam. Part Three Why I Like Content Marketing, and How to Do it Well Before I was in online marketing, I was a writer. I love what I do because I love to write. So Google’s steps to curb spammy guest blog posts is, I believe, a move in the right direction. Yes, it hurts small businesses. Yes, it creates a business landscape where Adwords and a Content Marketing team become necessary (and therefore an added expense for small businesses that might not be able to handle their cost-structure as it is). But it also makes the internet a place where good content prevails. Where your search results are actually results you’ll find topical, helpful, and authoritative. So, what to do? Guest Blogging done right includes customized pitch letters, previously published content on authoritative sites, pitching specifically to that site and those readers, cultivating relationships via social media and email with these people, and much more. When you try to scale the process, it becomes an enormous undertaking. It includes multiple articles/contacts in varying stages, which in turn requires careful tracking and follow through: from writing, to pitching, to checking articles, to finding/adding images for posts, etc. And, of course, the quality has to be impeccable. Ideally, each piece should be well-researched, should cite hard data and sources, and should actually make a point (remember your college essays?). As you can imagine, all of this is time consuming and expensive. You simply cannot take shortcuts anymore. Google will see your shortcuts, and that’ll be that. Not only will your time and money be wasted, you might also end up in the penalty box. Good old fashioned writing might seem old-tyme, but it’s what works. High Quality Guest Posting as part of a Content Marketing Strategy Including high quality guest posting as part of a content marketing strategy is a way to generate authority, visibility, and social signals. These types of links are still valuable. The key is to focus on the quality of the target sites. So, who should you target? Make sure each site is: Authoritative Socially active Receives comments and engagement Has Authorship Of course, avoid the footprints mentioned above, but most importantly: Do not use money terms in anchor text The links should be natural and pointing to informative content, not money/ecommerce pages (unless these are 100% relevant/necessary) Include links in the body, not in the author biography If your target is to earn 100 links, make sure you create a strategy to vary the types of links acquired. No more than 20% of your profile should originate from guest posts. Make sure there are other types of links. Here are a few examples of safe link earning tactics after Matt’s comments against guest posts. I can personally cite dozens of sites that use guest posting as part of their content acquisition and content promotion strategy that are not penalized by Google, nor will they be. Guest posting done right is one of the fundamental aspects of how people connect and share online. Certainly it was abused once the content economy became scalable. However, Google simply cannot throw out the baby with the bath water. So, if you want to stay in the game, then it’s simple: do it right. Believe me, we all benefit. Your readers access quality content, your site builds authority and rankings, and, of course, you avoid the Guest Blogging apocalypse! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The End of Link Building as we Know It"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The End of Link Building as we Know It"
    },
    {
      "level": "H2",
      "text": "Part One"
    },
    {
      "level": "H3",
      "text": "What I’ve learned from being a Link Audit Junkie"
    },
    {
      "level": "H3",
      "text": "Examples of Unnatural Links"
    },
    {
      "level": "H2",
      "text": "Part Two"
    },
    {
      "level": "H3",
      "text": "Guest Posts now under the “Unnatural Links” Umbrella"
    },
    {
      "level": "H3",
      "text": "What is the Difference between Low-Quality and High Quality Guest Posting?"
    },
    {
      "level": "H3",
      "text": "The Danger is in the PATTERNS"
    },
    {
      "level": "H2",
      "text": "Part Three"
    },
    {
      "level": "H3",
      "text": "Why I Like Content Marketing, and How to Do it Well"
    },
    {
      "level": "H3",
      "text": "High Quality Guest Posting as part of a Content Marketing Strategy"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Marcela De Vivo\n          \n            Marcela De Vivo\n          \n            Marcela De Vivo"
}