{
  "url": "https://moz.com/blog/the-smx-advanced-recap-is-chock-full-of-nostalgia",
  "slug": "the-smx-advanced-recap-is-chock-full-of-nostalgia",
  "title": "The SMX Advanced Recap is Chock Full of Nostalgia - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Hey, remember SMX Advanced in Seattle? Think back to a couple weeks ago. Danny Sullivan threw a conference in the Emerald City, some SEOs attended, it was a huge success...any of this ringing a bell to you? Well, if two certain slacker SEOs didn't have 8,000 simultaneous tasks to work on and…",
  "content": "The SMX Advanced Recap is Chock Full of Nostalgia SEO Events By: Rebecca Kelley June 24, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley June 24, 2007 The SMX Advanced Recap is Chock Full of Nostalgia SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Hey, remember SMX Advanced in Seattle? Think back to a couple weeks ago. Danny Sullivan threw a conference in the Emerald City, some SEOs attended, it was a huge success...any of this ringing a bell to you? Well, if two certain slacker SEOs didn't have 8,000 simultaneous tasks to work on and actually published this article right after the conference ended, you'd be more excited about reading it. Oh well... Anyway, if you're into those \"I Love the 80s\" shows on VH1 and love to wax nostalgic on all sorts of tidbity information, then please, please check out our long and comprehensive recap of SMX Advanced. It's also listed in the Articles section of our site. Peruse through the article, pick out one obscure sentence, and then drop a comment below saying \"Oh, I love how you mentioned such and such! What valuable information!\" so Jane and I feel like you guys got some actual value out of this. Thanks. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The SMX Advanced Recap is Chock Full of Nostalgia"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The SMX Advanced Recap is Chock Full of Nostalgia"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}