{
  "url": "https://moz.com/blog/the-abcs-of-video-content",
  "slug": "the-abcs-of-video-content",
  "title": "The ABCs of Video Content: How to Build a Video Marketing Strategy - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Despite all this hype, many small to medium brands still use very few videos in their marketing, if they use any at all.",
  "content": "The ABCs of Video Content: How to Build a Video Marketing Strategy Video | Content Marketing By: Tyler Samani-Sprunk July 25, 2019 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Tyler Samani-Sprunk July 25, 2019 The ABCs of Video Content: How to Build a Video Marketing Strategy Video | Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Take a moment to think about how you’ve used the internet today. Which posts made you stop scrolling through your Instagram feed? What webpages did you spend the most time on? What content did you enjoy? If you’re like most of us, there’s a good chance that videos played a factor in your answers to all three of those questions. So it’s no surprise that marketing experts have been encouraging brands to use more video for years now. Despite all this hype, many small to medium brands still use very few videos in their marketing, if they use any at all. In our experiences with clients, we’ve seen companies struggle in four major areas: Budget. Some companies don’t believe that video marketing can generate real results, but many simply assume they can’t afford it. Talent. Most small marketing teams don’t have people experienced with creating or starring in videos. Buy-in. Companies that use video well have many people across the organization committed to leveraging video content, including leadership, salespeople, customer service representatives, and subject-matter experts. But achieving this level of buy-in across an organization can be very difficult. Consistency. While many brands have figured out how to produce frequent and consistent written content, few have figured out how to do so with video. With challenges this significant, it’s no wonder why most brands still don’t include video as a major component of their marketing efforts. The good news is that these barriers to entry give you an opportunity to beat your competitors to the punch – but that window is closing quickly. To help our clients reap everything video marketing has to offer, we’ve put together a framework that makes building a video marketing strategy much easier to approach and manage. The ABCs of video content The first thing that must happen before a marketing team can successfully use video in today’s world is usually a mental shift: If your marketing team or company leadership thinks about producing video the same way they did a decade ago, it will be very difficult to create enough video content to truly make a difference because you’ll constantly face the challenges mentioned above. The greatest thing about creating video content today is that it doesn’t always have to be this large-scale production. The days of spending thousands of dollars and weeks of time on every video you create are officially over. We believe that every brand needs a strong mix of video content across three levels: A-level, B-level, and C-level. A-level video content A-level videos are the videos that most brands are already used to creating. These videos are polished and well-produced, and therefore the most expensive to create. If your company has ever created a television commercial or a brand overview video for your website, it was probably an A-level video. A-level videos work best when you need to create a strong impression on the viewer. If it’s the first time someone is interacting with your brand or another situation when you need to convey that your company is professional and credible, an A-level video will likely work best. This is what makes them great for commercials, product videos, and company overviews. Don’t use A-level videos when your primary goal is to convey authenticity or build a relationship with your viewer. A-level videos also aren’t cost-effective for most brands to use as consistent, regular video content to support your social media, video SEO, email communications, or blog. A brand will need much fewer A-level videos than B or C. As such, the key to getting the most from your investment in A-level video content is repurposing. You should always consider how you can use clips or footage from your A-level content for things like social media posts, presentations, across your website, or as a quick way to add a little polish to a B or C-level video. To create A-level videos, most brands will need to work with a third party video company or marketing agency. These videos will be scripted, shot with high-end cameras by people who really know how to use them, will often feature paid on-camera talent, and will be professionally edited. B-level video content When a brand produces high volumes of video content, the majority of it is usually B-level. These videos are planned, but not perfect. Most of the how-to videos and vlogs you watch would fit into this category. B-level videos work great when your goal is to build a relationship with your video viewers because they allow you to show more authenticity than A-level videos, and their lower cost makes them perfect for a consistent video strategy. This level works well for educational content, social media videos, a video series, team or personal intro videos, simple product demos, and video testimonials. The best thing about B-level videos is that they can often be created by your own staff. Even if you decide to outsource them, they will be much cheaper than A-level videos because you can produce multiple videos at the same time or engage a third-party for just one part of the production process, such as editing. To create a B-level video, all you’ll need is a basic script outline (bullet points work great), someone on your staff willing to get on camera, some basic video equipment, and an entry-level video editing program. If you don’t have people on your staff who are comfortable shooting video from a smartphone and editing it together, we recommend seeking training or considering hiring a student or recent graduate with those skills. The keys to success with B-level videos are authenticity, volume, and consistency. Authenticity. Brands that achieve success with these videos aren’t worried about memorizing lines and being perfect on camera. You’d be amazed at how much the occasional “um” will make you sound more human and help you connect with your audience. With that said, you do want to feature someone who is comfortable on camera, even if it takes them some practice to get there. Volume. As long as you’re creating valuable content, the more videos you have, the better. Consistency. Just like with a blog, magazine, or newsletter, publishing videos at a consistent interval allows you to more easily build an engaged audience of return viewers. Examples of B-level video include this one from Solo, Simple Strat (hi!), and Moz, below: C-level video content This is the level where brands can really connect with their audience and stand out from the competition. C-level videos are raw, unpolished, and extremely effective in humanizing your brand and the team behind it. To create a C-level video, all you need to do is pull out your cell phone or turn on your webcam, press record, and start talking. You may want to prepare a few quick bullet points of what you’re going to talk about, but even that is often unnecessary. These videos are great for sharing lessons on-location from industry events, making key employees shine on their social media channels, helping your salespeople stand out in their prospects’ email inboxes, and adding a personal touch to your customer service communications. The most powerful aspects of C-level videos are that they can be personalized for individual people and they can help you get information out in almost realtime. You can use them to pack an extra punch in any email you send or to share lessons as you learn them or think about them — which is often when you’re most passionate about them and before the competition has a chance to talk about them. C-level videos still require good lighting and audio quality, so we do recommend purchasing a cheap portable light and lapel microphone, but you can easily get everything you need for under $50. These videos don’t require anyone else to shoot them, and you often don’t need to do any editing beyond occasionally cutting out or combining a couple of video clips. C-level video examples include this one from Gary Vaynerchuk, this one from Ali Schwanke, and Vidyard, below: Richard + James - Social Selling Mastery for you Putting it all together Now that you know the different levels of video content you’ll need, it’s time to put together your plan. Thinking about these levels as you begin to determine your video topics and schedules will make it easier to determine the resources you’ll need, your ideal number and frequency of videos, and how each video will fit into your larger marketing strategy and goals. Just remember your ABCs and get ready to experience the difference that video will make for your brand. Are you currently working on a video marketing strategy for the year? What have you found useful (or not) so far? <a class=\"embedly-card\" data-card-via=\"https://www.vidyard.com/blog/4-video-selling-examples/\" href=\"https://share.viewedit.com/yHs... + James - Social Selling Mastery for you Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The ABCs of Video Content: How to Build a Video Marketing Strategy"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The ABCs of Video Content: How to Build a Video Marketing Strategy"
    },
    {
      "level": "H2",
      "text": "The ABCs of video content"
    },
    {
      "level": "H3",
      "text": "A-level video content"
    },
    {
      "level": "H3",
      "text": "B-level video content"
    },
    {
      "level": "H3",
      "text": "C-level video content"
    },
    {
      "level": "H2",
      "text": "Putting it all together"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H3",
      "text": "How to Create the Most Basic Google Business Profile Video with Canva, Even If You’re Not Great At This Stuff!"
    },
    {
      "level": "H3",
      "text": "On-page Video SEO – Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Tyler Samani-Sprunk\n          \n            Tyler Samani-Sprunk"
}