{
  "url": "https://moz.com/blog/the-quizzical-duality-of-paid-links",
  "slug": "the-quizzical-duality-of-paid-links",
  "title": "The Quizzical Duality of Paid Links - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Google's been pretty clear - buy or sell links, particularly those that come from broker-type services, and we'll take steps to penalize your site. At one time, this meant simply de-valuing the links that come from paid sources, essentially erasing them from the link graph so as to \"take the money…",
  "content": "The Quizzical Duality of Paid Links Link Building By: Rand Fishkin June 16, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin June 16, 2008 The Quizzical Duality of Paid Links Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Google's been pretty clear - buy or sell links, particularly those that come from broker-type services, and we'll take steps to penalize your site. At one time, this meant simply devaluing the links that come from paid sources, essentially erasing them from the link graph so as to \"take the money out of the rankings.\" Now, however, a considerable amount of new evidence has emerged to suggest Google's doing more than just leveling the field - they're exacting revenge. How Paid Links Work on a Network Level: For the last 4 years, a number of large, generally well-known link brokers have operated in the gray area of Google's paid links guidelines. Their operations generally follow a similar thread: Contact a number of medium-high PageRank/Trusted websites about monetizing ad blocks with \"juice\"-passing links. Very often, these sites will simply sell the space without even realizing the potential Google-related implications. Start selling links through relationship marketing - connecting with SEO firms who can re-sell the links, attending conferences for personal connections to potential buyers, and even advertising on the web (Google may have killed ads for \"text links,\" but you can still find a full cadre of advertisers for link brokers, high pagerank links, link buying, etc). Create blocks of text link ads that point to the client pages from the seller, paying the rental price for the link space while earning a bonus on the extra amount earned from the buyers. Smart link brokers have taken a number of additional steps to help prevent discovery (and devaluation) by Google, including: Anonymizing & randomizing the HTML code used to display the ads. One smaller company I've seen will never use the same HTML styles twice to minimize the likelihood of discovery. Linking to half clients / half non-clients in the ad blocks, to help dissuade the engines from wholesale punishing the sites in the ads Modifying anchor text and link source (linking to multiple pages on a domain, or even domains/URLs that 301-redirect to the client's pages). Running only a few ad blocks per site to help lessen the risk of identification through sitewide/multiple links from a domain type detection. How Google Fights Paid Links & Text Link Sellers: On the other side of the coin, Google's actions have turned from preventative and reactive to real aggression: Actively penalizing not only sites that sell, but sites that buy (a significant change from 1.5-2 years ago, when those links were merely devalued). Naturally, this suggests that the system is ripe for abuse, but I haven't heard of a \"false positive\" though I certainly expect to see a few in the very near future. Penalties include lowering of rankings (which is somewhat new - most of the penalties used to be just in the toolbar PageRank score). In my experience, there's a two-tier system in place here. Usually, large, important sites will only lose rankings on the specific pages buying and selling the links, rather than the entire domain. Meanwhile, smaller and mid-size domains can experience site-wide rankings drops (the now famous \"-XX penalty\" is the one I see a lot here, where XX can be anything from 10 to 100). Google's spending significant engineering resources to investigate paid link networks and brokers and bring down entire businesses that use this strategy. Obviously, since many advertise and run websites, and some even use their own networks to help their rankings (or the rankings of other sites that share their registrant data), Google has some fairly low-hanging fruit to pluck. I've heard tell that Google may even have some people posing as link buyers to attempt to get data about the sites selling links - personally, I can't imagine why they wouldn't do this. If I were in charge of the paid link detection team, I'd have two full-time interns with lots of fake websites and businesses calling up every link broker I could find and trying to get their full inventory. Using \"poison,\" high-commercial value keywords in anchor text as a methodology to discover the sites buying and selling. Finding buyers and sellers by playing connect-the-dots. Once Google finds one seller or buyer, they can reverse the link patterns to/from a domain and catch an entire network of link sales. One of the most interesting tactics I've seen employed thanks to this new, take-off-the-gloves approach from Google is link sellers who work with buyers to first send links to their competitors' sites. If the buying site loses rankings, it's a win for the client and the seller keeps them up. If the competition gains rankings, the links are switched by the seller to point to the buyer's site (so they get the positive impact). I've only heard of this strategy being employed by a single buyer, albeit with multiple sellers, and don't know the final outcome (but it is a brilliant strategy). The Two Sides of the Paid Link Ethics & Business Case Debate: First off, I want to say that I am largely agnostic when it comes to the \"ethics\" of paid links, but I know that others have strong feelings about this. Even my fiancée thinks that buying links to grow search engine rankings is akin to cheating the web ecosphere, but it's one of the rare areas where we disagree. What I do see are two entirely competing business objectives from very different kinds of organizations. For Google, keeping link value from passing through directly purchased links is a no-brainer. They have to do it, or risk losing serious relevancy. Find a great link broker, even today, and you can use a mid-level domain (PR 6+, relatively high trust, lots of good links, significant history) to rank for very competitive terms and phrases. Google can't have that weakness exploited or they risk being leapfrogged by a competitor in the search space who does a better job with spam detection. Many times, when I hear Matt Cutts or Adam Lasnik talk about paid links, they address it almost like a philosophy or ethical issue, which, in my mind, is by far the weaker argument. Tell people that your job is to serve the best results, and sadly, the correlation between link buyers and relevance is frequently low. This perfectly explains why you have to discount perturbances like paid links. Make it about the business, and the business owners and operators in the room will respect you. Make it about the lack of morality among SEOs and you build grudges, animosity, and spite (\"Oh yeah, I'll show them - I'm gonna go buy me a bunch of links!\"). I'm not even personally immune to this gut-level reaction when I hear what should be a cut-and-dry business case presented as though it were a religious edict. For link buyers, the opportunity to potentially rank atop the engines is irresistible, and even if 9/10 links turn out to pass no value, the ROI is often still there to get the 10% that do send the juice. Businesses justify this with the sales and marketing value they get by being on top of the rankings, and those top rankings can often be leveraged into more natural links (see the now-classic rich get richer theory). My Problem With How Google Handles Manipulative Linking: Google's methodology for handling paid links creates, in my opinion, more problems than it solves, and it penalizes the more innocent players far more than those Google truly wishes to damage. How? When Google finds paid links, it may discount those links without impacting rankings or toolbar PageRank of the linkind/linked-to page, or it might ding one or both of these in addition. This inconsistency in patterns means there's no clear way to determine if Google knows a page is selling links (the toolbar PR can be a good sign, but even then it's not always 100%). Google likes this setup, because it means link buyers don't have clear signals about what to buy vs. what to avoid, and link sellers don't know which pages/domains might be passing juice vs. hurting their clients. In this scenario, the biggest losers are those who buy the links, who end up spending far more than they should, and those who sell links, who often don't realize that link sales are even a bad thing (seriously, go call up a few dozen ad departments at big media websites and ask them if they've heard of nofollow or Google paid links debate - there's simply no awareness in these circles). Now, Google might argue that these are precisely the targets of their Machiavellian machinations, but I find it ridiculous. The real target should be the link brokers and link network operators, who continue to profit no matter what action Google takes. If Google really wanted to fight the source of the issue, they need to provide some transparency about which sites and pages are penalized (and reducing toolbar PR, which fluctuates naturally is a terrible way to do it, particularly since there's no real source for historical PR information - unless you count SEOmoz's historical PageRank checking tool). My Proposals for How Google Could Really Fight Paid Links Effectively: Don't be like Microsoft and try security through obscurity. Be transparent and kick ass at your job. Create a yellow or red alert in the Google toolbar when a site/page has been penalized. Buyers will stay away, sellers will drop the links, and brokers/networks won't be able to use the site anymore. The buyers and sellers still suffer the same retribution, but now you've gone one step further and started on the path to actually eliminating the market itself - fighting the source of the problem, rather than just its symptoms. Currently, the paid link market is like the casinos in Vegas. The house is the broker, who wins no matter who's playing or how they do. Our link sellers are likely to be the newbies - often with no idea of how much they really stand to gain or lose, or even how the game is played. The buyers are savvier, but with equally bad odds, and only a rudimentary understanding of the game's mechanics. Google plays the dual role of timid regulator and savvy card shark, too paralyzed (maybe by fear?) that a few clever casinos & gamers will find brilliant workarounds if they expose the rules they're enforcing and happy to let the gamblers part with their money. They'd rather have full tables where everyone's losing to the house than empty the floor of all but a few of the smartest and most aggressive players. Photo credit - mandj98 on Flickr. Of course, I could be wrong - maybe Google would love to even the odds, shut down the industry and eliminate the brokers. Perhaps it's not actually paid links they're afraid of. Maybe there's some other reason they're playing fast and loose when a more straightforward strategy makes sense. Let's say Google did expose their knowledge of who's manipulating the system. What might happen? The link brokers would be largely out of business (and those who weren't would find it hard to keep customers so long as Google continues to do a good job finding and shutting down the links). Sellers would stop working with brokers But... There's another angle that hasn't been talked about before (to my knowledge). If Google were to expose their paid link knowledge, you can bet that Microsoft, Yahoo!, Ask, and every other startup engine would leverage that data for their own purposes. Perhaps the paid link industry isn't actually the demon Google claims it is, but an ace-up-its-sleeve in the war for search dominance. After all, if Google's the best spam-fighter among the engines, why share the golden goose? Just for argument's sake, let's assume that's the case. I'll make one more recommendation to the Google search team - don't expose the data publicly; just do it inside Webmaster Tools on an individual site basis. You still shut down the industry, but only those sites who've bought or sold know which links you've targeted, and any outside entity is going to have a near-impossible time discovering usable, scalable data. Final Thoughts: Until Google takes a more transparent, serious approach to fighting paid links at the source, it's going to be hard to take their indignant righteousness on the subject at face value. Until then, I'd recommend that sellers, brokers and buyers keep their activities as clandestine and randomized as possible. Google's built on pattern-detection - eliminate patterns and you maintain the best chance of retaining value. If and when Google comes around on the issue, I'll more strongly consider empathizing with them. It's a hard thing to do when you talk to dozens of folks who've spent hundreds of thousands of dollars on what they think is good SEO (or sold ad space to link brokers completely ignorant of the potential consequences) because of Google's desire for search domination (or unwillingness to do anything but spread fear to those SEOs who pay close attention). I'm particularly unsympathetic on this last point. Google alerts sites that have been hacked, those who have hidden text, and pages that otherwise fall outside their guidelines (at least, in many cases). I'm not buying the \"if we draw the line, spammers can go right up to it\" argument on paid links - it doesn't fit. Google knows they created the paid linking industry, has potential solutions to fix it, yet chooses to continue letting the so-called \"scoundrels\" profit most and suffer least. Google has to understand the boundaries of information dissemination through the SEO world. It's far more insular than we often perceive (as insiders), and to punish those who have no way to know what they're doing is wrong, while rewarding the savvy brokers seriously weakens their legitimacy on the topic. BTW - As with all posts on SEOmoz, the content above represents my personal opinion, and shouldn't be construed as gospel truth. P.S. This post might make it seem that I have sympathy for the brokers, but none for Google, when both are often guilty of the same offense - benefiting from the lack of knowledge in the market. I reserve harsher judgement for Google, both because I expect better from them and because in many cases, it really is only Google who knows the field, while brokers fumble as blindly as buyers and sellers. I also think it's a bit naive to create a valuable supply (links) and demand (rankings) then stand back and say, \"Hey, we didn't say you could create a market economy here!\" Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Quizzical Duality of Paid Links"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Quizzical Duality of Paid Links"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}