{
  "url": "https://moz.com/blog/the-social-graph-api-stop-making-me-find-my-friends-again",
  "slug": "the-social-graph-api-stop-making-me-find-my-friends-again",
  "title": "The Social Graph API - Stop Making Me Find My Friends AGAIN - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Google is working on the Social Graph API that can be used to take your existing connections on social networks and apply them to any new networks that you decide to join. The two current solutions on adding your friends to new socials networks are:Manually search for your friends on every new…",
  "content": "The Social Graph API - Stop Making Me Find My Friends AGAIN Social Media C By: Chris Bartow July 11, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! C By: Chris Bartow July 11, 2008 The Social Graph API - Stop Making Me Find My Friends AGAIN Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Google is working on the Social Graph API that can be used to take your existing connections on social networks and apply them to any new networks that you decide to join. The two current solutions on adding your friends to new socials networks are: Manually search for your friends on every new network you join. Tiring. Trust the new network enough to enter your user name/password for some other service and have it try to find your friends for you. Scary. The social graph could solve this problem by letting you specify one or more of your existing profiles via their URLs and finding all of your friends using those pages as starting points. When joining a new social network you could enter a URL for one of your profiles and be presented with a list of people that are already your friends elsewhere. You can then quickly confirm this and move on to doing something useful with the site. It works by using public XFN or FOAF data that you can embed in your web sites profile. XFN is super easy to use by just adding rel=\"me\" to any links that point to yourself and rel=\"friend\" to any links that point to a friend. FOAF offers richer content be requires a bit more work. The easiest way to connect on all of your profiles together is by using your web site, which may be yourname.com, and link to all your social profiles, then have those social profiles link back to yourname.com. Anyone that has or plans to create a social web site with profiles should consider marking up their pages with at least XFN data to help contribute to the social graph by adding rel=\"me\" and/or rel=\"friend\" links where appropriate. It would be nice if SEOMoz integrated this into the profile pages with rel=\"me nofollow\" and just rel=\"me\" for users that build enough rank. :) To learn more about the Social Graph API, check out the presentation from Google I/O. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Social Graph API - Stop Making Me Find My Friends AGAIN"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Social Graph API - Stop Making Me Find My Friends AGAIN"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Chris Bartow\n          \n            Chris Bartow"
}