{
  "url": "https://moz.com/blog/the-3-metrics-you-must-know-before-you-launch-an-seo-campaign",
  "slug": "the-3-metrics-you-must-know-before-you-launch-an-seo-campaign",
  "title": "The 3 Metrics You MUST Know Before You Launch an SEO Campaign - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Accurate measurement and tracking is the foundation of every high-performing marketing organization and SEO campaign. You cannot maximize what you don't measure! Investing in SEO - or any other marketing strategy - without tangible goals and accurate tracking in place to quantify your results is…",
  "content": "The 3 Metrics You MUST Know Before You Launch an SEO Campaign SEO Analytics By: Ben Landers October 15, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Ben Landers October 15, 2010 The 3 Metrics You MUST Know Before You Launch an SEO Campaign SEO Analytics This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Accurate measurement and tracking is the foundation of every high-performing marketing organization and SEO campaign. You cannot maximize what you don't measure! Investing in SEO - or any other marketing strategy - without tangible goals and accurate tracking in place to quantify your results is like bowling blindfolded. You might knock down some pins, but you'll never refine and improve your technique as quickly or efficiently as someone that can actually see which pins are falling and how many are being knocked over with each roll. If you want to maximize the return on investment (ROI) from your SEO campaigns, there are (at least) 3 metrics you must know. METRIC 1: Non-branded (or non-trademarked) organic visits per month A lot of people new to SEO focus on rankings and organic visibility. Rankings and visibility mean nothing if no one is using the keywords for which you rank! Think of your website as if it were a sales funnel or a virtual sales rep (because it is!). At the highest level, you want to test and invest in marketing strategies that cost-effectively drive more qualified visitors into your funnel and monitor (or track) your visitor's actions while they're on your site. SEO can be a great way to accomplish this; however, you need to make sure that all those organic rankings and increased visibility are actually resulting in increases in non-branded organic visits to your site. The goal of most SEO campaigns to get get more people to your site with an emphasis on those using keywords and keyword phrases which indicate they are interested in your product or service, but did not know you by name prior to their visit. For an SEO company, this might mean searches for keywords like, \"seo companies in Vermont\" or \"seo consultant in Maryland.\" METRIC 2: True visit-to-goal conversion rate (goal = sign-up, lead, inquiry, call, etc.) Traffic for the sake of traffic isn't the name of the game (unless you're in the business of selling advertising based on pageviews). An SEO campaign should drive conversions (leads, sales, etc.). A conversion is any action on your website that you define as more valuable than a visitor that comes to the site, does nothing and leaves. Savvy companies define many different types of conversions - often broken into two categories: Macro and micro conversions. A macro-level conversion might be a web form completed and submitted (a web lead) or a phone call (phone lead). A micro-level conversion could be a sign-up for an email newsletter, registration for a webinar, download of a white paper, etc. Analytics must be in place and properly configured in order to identify a site's conversion rate. The \"true\" element of this metric typically refers to phone calls generated by web visits. Most service companies - HVAC, plumbers, roofers, etc. get far more phone inquiries than they do web inquiries; however, very few service business owners track this action. At best, they track their online conversions (and very few even do that!). Think about the problem this causes - If you are receiving 9 phone inquiries for every 1 web inquiry (a common stat for home service companies), not tracking the phone inquiries you receive and attributing them to the proper marketing channel (ex. organic search) means you're missing more than half the picture! You can't possibly maximize your ROI from SEO when you operate this way! METRIC 3: Cost-per-conversion by marketing tactic, strategy or channel Few companies have the resources (time or money) to test every \"great\" marketing strategy. As a result, marketing success comes down to prioritization. SEO campaigns, when developed, managed and executed correctly, can be a highly effective way to generate more visits, leads and sales at a low cost per. However, you MUST track cost-per-conversion for each of your active marketing strategies so that you can continually re-allocate your marketing budget in favor of high-performing strategies. Sorry SEO peeps - SEO isn't always the lowest cost strategy (and this is coming from an SEO guy!). Search engine marketing success is usually about maximizing first page real estate. You do this by investing in paid search (aka pay per click, PPC, CPC) AND organic optimization (SEO). Don't assume SEO is always cheaper than PPC. Use accurate tracking and a small investment in analytics to accurately quantify the results of both. There's no lasting silver bullet in the advertising and marketing world - online or offline. The best way to win over the long haul is to invest in a simple process which goes: TRACK, TEST, TWEAK, REPEAT! Know your numbers and you'll measurably improve your SEO campaign performance (and the performance of any other marketing strategy you track!). You can learn more about using analytics to maximize SEO results, by subscribing to our blog. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The 3 Metrics You MUST Know Before You Launch an SEO Campaign"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The 3 Metrics You MUST Know Before You Launch an SEO Campaign"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ben Landers\n          \n            Ben Landers\n          \n            Ben Landers"
}