{
  "url": "https://moz.com/blog/the-shear-complexity-of-social-trends",
  "slug": "the-shear-complexity-of-social-trends",
  "title": "The Sheer Complexity of Social Trends - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Preface Though it is yet unwritten, my follow-up to the test I proposed on whether Google can count thumbs has been much on the forefront of my thoughts, and ever changing. Many people are adding information to this concept that I'd not yet thought of. Many people agree with me and many more...",
  "content": "The Sheer Complexity of Social Trends Social Media J By: justFred February 8, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! J By: justFred February 8, 2008 The Sheer Complexity of Social Trends Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Preface Though it is yet unwritten, my follow-up to the test I proposed on whether Google can count thumbs has been much on the forefront of my thoughts, and ever changing. Many people are adding information to this concept that I'd not yet thought of. Many people agree with me and many more disagree to varying degrees. I'm excited to say, however negative the results were, that test was my most successful endeavor into the world of search. Speaking of which, thank you all for participating! To seek an answer to an unknown and not find it can sometimes be far more rewarding than to ask and be answered. In an effort to answer the question I asked originally, my mind began to seek out many answers to similar questions, and ultimately succinctly concluded the unfortunate answer (once again, if you remember my poorly written post about personalized search) that Google just hasn't sorted it all out yet, and may not in my life-time. The Sheer Complexity of Social Trends The thing we are trying to understand, analyze, and interact with... it's complicated. And we're the reverse engineers! We are trying to understand, analyze, and interact with a thing that must itself understand a thing that is far more complex.... US. Imagine what the engine must see and begin to understand. There are new ideas, new concepts, ever changing trends and opinions, there are personalities, groups of personalities, and groups of GROUPS! There are blogs about blogging, directories of directories, and even posts about posts! And all along it is commented and subject to spam. Things will be discussed, commented, cited, discussed some more, voted upon, edited, and ranked! The end to the variance of the written word is limitless. How can the Google-bot take all this information into account? How much information can it or will it understand? And does it or will it approach the task in the most intelligent or efficient way? Given that we're the reverse engineers, I'll leave all of that to the engineers - to Google. After all, that is not my job. Wait.. what is your job, Fred? I am a Search Engine Marketer, a Web Consultant and Analyst, a Programmer, an Intermediate Web Designer, and an Entrepreneur! (justfredworks.com if you're in the need) But what do you do? I help people make money on the internet! But how? By helping the bots understand where to find the right business for the right job. I match the customer to the salesman, and help the \"store\" better serve the needs of the customer, and I report to the owner of the store. Of course, there are those among us that would seek to understand this complicated thing and change it, for the good of the User Experience and general growth throughout the Internet. More of us however, are changing the thing in response to the bills that must be paid, and the people that enlist our services. If we are independently interested in Search, it is more likely that we are interested because our own ideas and products don't have the exposure they need. I do my best to understand this bot for many reasons, but because of my job title, I tend to interact with Google-bot in a way that serves the good of the Transaction, not the Interaction, though the two most certainly should and do intersect. In that sense, Google-bot must be wary of those that would try to game it as well. It must understand people like and unlike us and interact with us in order to achieve maximum proficiency. Not just us, but it must interact with all of us. That is... the 6,649,022,020 of us. For those of you keeping score that's 13,298,044,040 thumbs! (give or take, no offense to the handicapped and genetically deformed) I've realized (with your help) that a simple thing such as \"counting thumbs\" is not such a simple thing after all. The algorithm is affected by so many different factors, that it may be redundant or counter-productive to do such a simple thing. In my coming conclusion I'll discuss all of the indirect ways that the search results are affected by the thumbs. Segmenting comments really is only just a small part of a much more complex animal, and I can understand how they have bigger fish to fry, so to speak. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Sheer Complexity of Social Trends"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Sheer Complexity of Social Trends"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "justFred\n          \n            justFred"
}