{
  "url": "https://moz.com/blog/the-two-part-seo-ranking-model-lets-make-seo-simple",
  "slug": "the-two-part-seo-ranking-model-lets-make-seo-simple",
  "title": "The Two-Part SEO Ranking Model: Let's Make SEO Simple - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "It may be tempting to look for an easy answer when it comes to ranking, but both research and Google itself say links and content are the biggest factors involved. Would your SEO improve if you focused with greater effort on a simplified two-factor algorithm?",
  "content": "The Two-Part SEO Ranking Model: Let's Make SEO Simple SEO Basics | Search Engines By: Eric Enge August 30, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Eric Enge August 30, 2016 The Two-Part SEO Ranking Model: Let's Make SEO Simple SEO Basics | Search Engines The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. There sure is a lot of interest in SEO ranking factors: There have been major studies done on this, notably by both Moz and Searchmetrics. These are groundbreaking pieces of research, and if you're serious about SEO, you need to understand what these studies say. That said, these are too complex for most organizations to deal with. They need a simpler way of looking at things. At Stone Temple Consulting (STC) we deal with many different types of organizations, including some of the world's largest companies, and some of the highest-traffic websites in the world. For most of these companies, understanding that there are 200+ ranking factors does more harm than good. Why, you ask? So many people I talk to are looking for a silver bullet. They want to hear that they should only change their heading tags on the second Tuesday of every month, except during leap years, when they should do it on the first Tuesday, except in February when they should change it on the third Monday. These distractions end up taking away from the focus on the two things that matter most: building great content (and a great content experience) and promoting it well. Today's post is going to lay out a basic approach that most companies can use to simplify their thinking about SEO, and keep their focus on the highest priorities. What Google recently saidHere's what Google Dublin's Andrey Lippatsev said in a Hangout that I participated in on March 23, 2016. Also participating in the Hangout was Ammon Johns, who asked Andrey what the two most important ranking factors are: Andrey Lippatsev: Yes. Absolutely. I can tell you what they are. It is content and links going into your site. There we go, that's a start. According to Google, it's links and content that are the two biggest. Hopefully, the idea that content is a big factor is obvious, but below I'll break out more what great content really entails. In addition, you can see some backup for the power of links in the study I recently published on links as a ranking factor. Should we think of the world as consisting only of these two factors? It's quite simplistic, and possibly too much so, but let's try to simplify this even more. How many organizations would dramatically improve their SEO if they focused on creating great content and promoting it effectively? I can tell you that from my experience these are two things that many organizations simply don't do. Does that mean that we can take our two factors and put them into a (purely) hypothetical ranking score equation that looks like this? I actually think that this equation is pretty effective, though it has some limitations and omissions that I'll describe in more detail below. You also need to think about the concept of \"great content,\" that will get a high Content Score, in the correct manner. What is \"great content?\"If we step back and think about what makes up great content, it seems to me that there are three major components that matter: Relevancy Quality The overall content experience The first part of this is simple. If the content is not relevant to a query, it shouldn't rank for that query, ever. That makes sense, right? The second part is also pretty simple, and that's the notion of quality. Does it provide information that people are looking for? Is that information relatively unique to your site? Clearly, it makes sense for the quality of the content to matter a lot. We can combine the notions of quality and relative uniqueness into the notion of material differentiation. Rand covers this brilliantly in his Whiteboard Friday about creating 10X content. Creating the 220,001st article on how to make French toast is just not going to cut it: You need to create something new and compelling that also offers a lot of value. That may not be easy, but being the best at something never is. If you're in a competitive market, it's reasonable to guess that your top competitors are making great, relevant content on topics that matter to their target audience. For the most important queries, it's probable that the top 5 (and maybe more) pieces of content in that space are really, really good (i.e. more comprehensive than other articles on the topic, or brings in new information that others don't have). The third part encompasses many pieces. Is your content well-organized and easy to read? Does it effectively communicate its key points? How do people engage with it? If they land on a page on your site that has the answer to their question, can they quickly and easily find that information? Once again, you'll find that the major competitors that rank in the top of the SERPs all handle this pretty well too. Let's now take a look at what the role of the content score in ranking might look like: Note that the Y-axis is \"Chances of Ranking,\" as opposed to \"Ranking.\" Nonetheless, this curve suggests that the Content Score is a big one, and that makes sense. Only the best of the best stuff should rank. It's simple. Digging a bit deeper on what goes into content qualityBut what about title tags? Heading tags, use of synonyms? Page layout and design? Stop and think about it for a moment. Aren't those all either part of creating higher-quality content, or making that content easier to consume? You bet. For example, imagine that I wrote this piece of content: It could be the greatest information in the world, but it's going to be really hard for users to read, and it will probably have terrible user engagement signals. On the other hand, imagine that my content looks like this: Would you say the quality of one of these pieces of content is higher? I would. The second one is much easier to read, and therefore will deliver more value to users. It will get better engagement, and yes, it will probably get linked to more often. Why do links get separate treatment?You could argue that links are just another measurement of content quality, and there is some truth to that, but we give them separate treatment in this discussion for two reasons: 1. They're still the best measurement of authority. Yes, I know I'm ruffling some feathers now, but this is what my experience after more than 15 years in SEO (and seeing hundreds of SEO campaigns) has taught me. To get and sustain a link, someone has to have a website, has to be willing to modify that website, and they have to be willing to have their site's visitors click on the link to leave their site and go to yours. That's a pretty material commitment on the linking site's part, and the only incentive they have to do that is if they believe that your content is of value to their site's visitors. Why not social signals? While I've long argued that they have no impact except for aiding in content discovery, let's for sake of argument say that I'm wrong, and there is some impact here, and explain why social signals can never be a critical part of the Google algo. It's simple: social signals are under the control of third-party companies that can make them invisible to Google on a moment's notice (and remember that Google and Facebook are NOT friends). Imagine Google giving Facebook (or any other 3rd party) the power to break their algorithm whenever they want. Not happening! 2. The power of links should cause different actions on your part. What is that action? It's called marketing, and within that discipline is the concept of content marketing. Done the right way, these are things you should do to raise the reputation and visibility of your brand. In fact, this may consume a material amount of your entire company budget. With or without search engines in the world, you've always wanted to do two things: (1) Make really good stuff, and (2) market it effectively. In 2016, and beyond, this will not change. No doubt, part of attracting great links is to produce great content, but there are other overt actions involved to tell the world about that great content, such as active outreach programs. Expanding on user engagementMany have speculated that Google is using user engagement signals as a ranking factor, and that it will increase its investment in these areas over time. For example, what about click-through rate (CTR)? I discuss CTR as a ranking factor here, but to net it out simply, it's just too easy a signal to game, and Google tells us that it uses CTR measurements as a quality control check on other ranking signals, rather than as a direct signal. You can doubt Google's statements about this, but if you own or publish a website, you probably get many emails a week offering to sell you links via one scheme or another. However, you never get emails offering you CTR ranking schemes. Why is that, you think? It's because even the scammers and spammers don't think it works. Important note: Rand has done many live CTR tests and a number of these have shown some short-term rankings movement, so CTR could be used in some manner to discover hot trends/news, but still not be a core ranking factor. What about other user engagement signals? I'd bet that Google is, in fact, doing some things with user engagement signals, though it's hard to be sure what they are. It's not likely to be as simple as bounce rate, or its cousin, pogosticking. Pogosticking sure seems like a good signal until you realize there are many scenarios where they don't work at all. For example, when users are comparison shopping, they'll naturally hop from site to site. Finding good user engagement factors that make for really reliable signals is quite hard. Many have speculated that artificial intelligence/machine learning will be used to derive these types of factors. Here are three pieces of content that cover that topic in some detail: The Machine Learning Revolution: How it Works and its Impact on SEO, an article here on Moz by yours truly SEO in a Two-Algorithm World, a Powerpoint by Rand Fishkin The Past, Present, and Future of SEO, an article by Mike Grehan Information architectureHaving a solid information architecture (IA) that Google can crawl and easily find your content is also a major requirement. In Andrey Lippatsev's response, he undoubtedly presumed that this was in good shape, but it would be wrong to leave this out of this discussion. At Stone Temple Consulting, we've helped tons of sites improve their organic traffic simply by working on their IA, eliminating excessive page counts, improving their use of SEO tags like rel=canonical, and things of this nature. This is clearly a big factor as well. Usability also feeds into IA, because people need to be able to find what they're looking for on your site. What I've left out with the two-factor modelFirst of all, there are other types of results, such as images, videos, and maps results, that are opportunities to get on the first page, but the above discussion is focused on how to rank in regular web search results. To be fair, even in the regular web results, I've left some things out. Here are some examples of those: Local links. I'm not referring to \"local pack\" listings here. If I search on \"digital cameras\" right now, in the regular web search results, I'll see some listings for stores near me. Clearly, proximity is a very large factor in ranking those pages. Query deserves diversity. An example of this is the query \"Jaguar.\" Chances are that my two-factor algorithm would rank only car sites in the top 10, but Google knows that many people that type that query want information on the animal. So even if the two-factor algo would slant things one way, you'll see some animal-related sites in the top 10. In-depth articles. This is a feature that's hard to spot in the search results, but sometimes Google includes in the bottom of the top 10 results some pieces of content that are particularly comprehensive. These are for queries where Google recognizes there's a decent chance that the user is engaging in extensive research on a topic. Here's an example for the query \"constitution\": We conducted a small sample review of 200 SERPs and found that about 6% of the results appeared to be from factors such as these. The two-factor model also doesn't account for personalization, but this post is looking at ranking factors for regular search results other than personalization, which, of course, also has a large impact. Looking for ranking hacks?OK, I'm going to give you one. Make your content, and the experience of consuming that content, unbelievably good. That's step one. Stick to your knitting, folks, and don't cop out on the effort to make your content stand out. You have no choice if you want to get sustainably positive results from SEO. Don't forget the overall site and page usability, as that's a big part of what makes your content consumable. This is a critical part of making great content. So is measuring user engagement. This provides a critical feedback loop into what you're doing, and whether or not it's working for your target audience. Then, and only then, your focus should turn to marketing that will help drive your reputation and visibility, and help attract links to your content. Here it is in a nutshell: If your content isn't competitive in relevance and quality, links won't help. If it is, links will make the difference. Your content has to be elite to have a chance to score highly on any given competitive search result. After that, your superior marketing efforts will help you climb to the top of the heap. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Two-Part SEO Ranking Model: Let's Make SEO Simple"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Two-Part SEO Ranking Model: Let's Make SEO Simple"
    },
    {
      "level": "H2",
      "text": "What Google recently said"
    },
    {
      "level": "H2",
      "text": "What is \"great content?\""
    },
    {
      "level": "H3",
      "text": "Digging a bit deeper on what goes into content quality"
    },
    {
      "level": "H2",
      "text": "Why do links get separate treatment?"
    },
    {
      "level": "H3",
      "text": "1. They're still the best measurement of authority."
    },
    {
      "level": "H3",
      "text": "2. The power of links should cause different actions on your part."
    },
    {
      "level": "H2",
      "text": "Expanding on user engagement"
    },
    {
      "level": "H2",
      "text": "Information architecture"
    },
    {
      "level": "H2",
      "text": "What I've left out with the two-factor model"
    },
    {
      "level": "H2",
      "text": "Looking for ranking hacks?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Eric Enge\n          \n            Eric Enge"
}