{
  "url": "https://moz.com/blog/the-clickthrough-the-lead-capture-and-the-infommercial",
  "slug": "the-clickthrough-the-lead-capture-and-the-infommercial",
  "title": "The Clickthrough, The Lead Capture, and The Infomercial - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Gone are the days when your \"landing page\" is the homepage of your website. Recent trends in internet marketing have brought landing pages to the forefront of conversion rate optimization. Nowadays, increasing your chances of converting visitors into buyers of your products and/or services requires…",
  "content": "The Clickthrough, The Lead Capture, and The Infomercial Conversion Rate Optimization (CRO) D By: Dave Donaldson March 17, 2011 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! D By: Dave Donaldson March 17, 2011 The Clickthrough, The Lead Capture, and The Infomercial Conversion Rate Optimization (CRO) This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Gone are the days when your \"landing page\" is the homepage of your website. Recent trends in internet marketing have brought landing pages to the forefront of conversion rate optimization. Nowadays, increasing your chances of converting visitors into buyers of your products and/or services requires true-to-form landing pages to properly steer potential customers into your sales funnel. On the surface this seems like an easy thing to do, but what makes a good landing page? Why do some landing pages convert better than others? And what type of landing page should you use? Like anything else, the answers depend on what you're trying to accomplish. Are you simply trying to capture customer leads? Are you trying to get visitors to download your latest free eBook? Or are you selling a product where people have to give you their hard-earned money? To help answer these questions, it's helpful to understand the 3 main types of landing pages: The Clickthrough. These are probably the most common form of landing pages, where you find a sharp-looking page with a large call-to-action button, and where that call-to-action button is the only clickable element on the page. The Lead Capture. Almost as common as The Clickthrough, this landing page has a small form for visitors to enter customer data, typically name and email address, which can and will be used for follow-up at a later date. This type of landing page is commonly referred to as a squeeze page. The Infomercial. Otherwise known as a sales page or sales letter, this landing page is very different from the other two types because of its design, which is mostly text. It's full of jargon, keywords, and sales phrases to convince you to buy the product being offered. In other words, it reads like a late-night infomercial. The Clickthrough Like all good landing pages, a clickthrough page is devoid of anything that distracts the user from the goal: to click the call-to-action button. Clicking the call-to-action button is important because that's how potential customers first get into your sales funnel. If users don't get into your sales funnel, you won't have any sales. A clickthrough landing page typically consists of a combination of the following things: An attention-grabbing headline A subheadline that expands upon why the user is here A product image or screenshot, or an embedded video Feature touts that highlight the best reasons users should be interested in the product The aforementioned call-to-action button, in the right place and big enough to be noticed immediately A reinforcing customer quote Another important aspect is a great-looking, well-spaced out design. Having a poorly-designed, cramped landing page will most certainly decrease your conversion rate, so be sure to design your landing pages properly (and test your designs to determine which ones lead to higher conversion rates). Here's an example of a very clean, professional-looking clickthrough landing page that has all the ingredients for high conversion rates: The Lead Capture A lead capture landing page (or squeeze page) is very similar to a clickthrough page in all aspects except for one thing: instead of clicking a call-to-action button that takes them further into the sales funnel, users enter their customer data into a small form. The primary reason for using a squeeze page is so that you can direct market to those people at a later time. Collecting email addresses is a big part of internet marketing, and is a precious commodity. The theory is that once you have a person's email address, you have their attention. And if you have their attention, your chances of successfully marketing to them go up. One important trend with squeeze pages is to use 3rd party email list services to capture the customer data. Companies like Aweber, Campaign Monitor, and MailChimp provide forms that you can add to your squeeze pages to make collecting customer data a snap. Below is a sample squeeze page for capturing a customer lead. Notice that the design is similar, yet different from the clickthrough landing page above: The Infomercial And now we come to the infomercial, or sales page. As you can see below, the overall design of the sales page is quite different from a typical landing page or squeeze page. A sales page is made mostly of text, with the occasional product image or embedded video thrown in for good measure. The goal of a sales page is to keep the visitor reading, all the way from the top to the bottom, because the bottom is almost always where you find the call-to-action button. In fact, there are three types of readers of a sales page (Skimmers, Jumpers, and Book Worms), and I highly suggest reading \"Anatomy of a Long Sales Letter\" for more information. A sales page typically consists of a combination of the following things: A preheadline, the main headline, and a postheadline A list of benefits or reasons why you want the product Several \"pitches\" throughout the page Customer testimonials A product photo or two, and maybe an embedded video Some sort of money-back guarantee The retail or original price and the \"short-time only\" sale price An interesting note about sales pages is that even though they typically convert well (when written properly), designers loathe them. Why? Well, mainly because there isn't really much \"design\" to a sales page. Almost all sales pages seem like they were created with Microsoft Word, and that's not a tool designers prefer. So Which One Should You Use? It depends, but you can make the argument for any of them. It all comes back to what you are trying to accomplish with your landing pages. Are you trying to get as many people into your sales funnel as possible after they click on your AdWords ad? Then use a clickthrough page or a sales page or both. Are you trying to collect as many email addresses as possible so that you can let people know when your next product will be available? Then use a lead capture squeeze page. In any case, create multiple landing pages per goal and continuously test them to find out which ones perform better. Utilize tools like Unbounce, Optimizely, the MaxA/B WordPress plugin, Visual Website Optimizer, and Google Website Optimizer to your advantage. Happy landing! About the author: Dave lives in Columbus, OH and is one of the founders of Max Foundry, a company that makes WordPress plugins for landing pages, squeeze pages, sales pages, and A/B testing. You can follow Dave on Twitter (@arcware) and on his blog, where he writes about living the bootstrapped startup life. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Clickthrough, The Lead Capture, and The Infomercial"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Clickthrough, The Lead Capture, and The Infomercial"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Ensure Your Organic Traffic Actually Drives Revenue — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How Our Website Conversion Strategy Increased Business Inquiries by 37%"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dave Donaldson\n          \n            Dave Donaldson\n          \n            Dave Donaldson"
}