{
  "url": "https://moz.com/blog/the-brand-halo-effect-does-brand-awareness-impact-organic-search-rankings",
  "slug": "the-brand-halo-effect-does-brand-awareness-impact-organic-search-rankings",
  "title": "The Brand Halo Effect: Does Brand Awareness Impact Organic Search Rankings? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "How much weight does brand carry in the SERPs? It might be more than you think.",
  "content": "The Brand Halo Effect: Does Brand Awareness Impact Organic Search Rankings? Advanced SEO | Search Engines | Competitive Research By: Tom Coad March 24, 2016 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Tom Coad March 24, 2016 The Brand Halo Effect: Does Brand Awareness Impact Organic Search Rankings? Advanced SEO | Search Engines | Competitive Research This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. “The extent to which consumers are familiar with the qualities or image of a particular brand of goods or services.” Oxford English Dictionary's definition of brand awareness How does anyone, not least a search engine, quantify brand awareness? Is it possible to accurately measure a consumer’s familiarity of a brand, and how can a search engine use this as an accurate metric from which it can factor it into a ranking algorithm? And if it could, can this be influenced by external factors, such as television ads or media exposure? In truth, it is extremely difficult to quantify all of the elements that can influence brand awareness, but can search engines still use particular metrics to understand customer awareness and perception of a given brand or product? Could hard metrics, such as search queries, citations, traffic and click-through rates, influence organic search rankings? We wanted to understand just how a brand’s organic search traffic could influence its search rankings, so we put that question to the test. Testing the theory A lot of SEO agencies and specialists talk at length about the influence brand recognition has on organic search rankings, so we put that theory to the test. Now, of course, there are limitations and caveats we need to acknowledge in an experiment of this nature. While we cannot say for certain that any changes observed were directly attributable to our experiment, it was designed to be as controlled and as impartial as possible. Our experiment was to take a brand in a fairly obscure niche that has ranked consistently for a number of keywords for no less than 12 months, according to data from our bespoke organic ranking tool. Having selected the brand, we directed would-be consumers to Google and requested that they search for the brand name and subsequently click on the target brands homepage. Once on the page, we directed the users to navigate around the site for at least two, minutes replicating how a user would interact. We would, over the course of this experiment, monitor rankings for keywords that were relevant to that brand. Keywords Tracked Avg. Monthly Search Volume time & attendance system 10 time and attendance solutions 10 time attendance software 40 time and attendance software uk 30 time & attendance software 40 Following this period of activity, we noted a number of interesting results. Two of the keywords achieved their highest ranking positions within a 12-month period, while the overall average ranking for the five key terms in our experiment achieved peak rankings and estimated clicks (based on an assumed click-through rate). The graph below demonstrates the overall average ranking for our target brand over the five key terms, with the two-month experiment period highlighted below. When we take a look at the rankings of individual keywords, we can also see big spikes for particular keywords during the experiment period, which then fall to the previous level (and in some cases, further) shortly after the end of the experiment period. During the experiment period of the directed traffic, three of the five terms tracked hit their peak ranking position. Outside of this period, three terms (\"time and attendance software uk,\" \"time and attendance solutions\" and \"time and attendance system\") never reached these prior or post this period. What other factors are at play? Of course, we cannot isolate these results to the activity we conducted, as there are many, many other ranking factors at play that could influence search rankings. We did, where possible, however, monitor many other ranking factors in order to isolate our experiment activity as much as possible. Using another one of our bespoke tools, URL Monitor, we were able to crawl the page’s HTML daily to identify any onsite changes and, during the period of the experiment, there were no on-page changes. Referring domains (to the domain) grew by 10% during the time period and referring domains to the monitored URL also grew by 10%. However, we are prepared to cautiously rule this out as an influencing factor. After careful analysis of the data following the \"directed brand traffic\" period, rankings, inconsistently with referring domains, went back to their previous positions or slightly worse. What else could be at play? We know Google and other search engines make 100’s of changes throughout a given year, so we can’t rule out the impact that a particular update may have had on this brand. During our experiment period in November 2015, Search Metrics reported on an unofficial Google update named “The Quality Update/Phantom 3” (November 22, 2015) and Search Engine Land had an official announcement about RankBrain, but notwithstanding those updates, the results seem to correlate closely to the level of our activity. We looked at the impact that our activity had on year-on-year brand queries using Google’s Keyword Planner monthly segments, which aligns accurately with the number of queries that we send during the experiment period. In order to identify any possible impact of seasonality by trending the combined search query volume for the non-brand terms year on year. Our data found that search volume in November 2015 was down when compared to the previous year, so we can confidently eliminate any potential impact of product or industry seasonality behind the uplift that we observed. So, does brand awareness influence search rankings? It’s important to remember that our experiment only measures the impact of just one element of brand awareness, although it is one of the relatively few that a search engine could quantifiably and objectively measure. Of course, we cannot categorically state that “brand traffic increases organic search rankings” on the basis of this experiment and this experiment alone, but what this experiment does is go some way to demonstrating a correlation between brand traffic uplift and organic ranking gains, albeit temporarily. However, the key takeaway from this is experiment is to refrain from using unsolicited search traffic for ranking gains. What we are saying is brand activity and promotion, among other things, support organic rankings. Our advice, therefore, would be to ensure you, as a brand, have a robust digital marketing strategy with your brand at the core. A Google patent reveals how search engines are attempting to gauge the brand authority of a product by benchmarking it against the non-brand volume of searchers for the keyword. By utilizing the way people navigate around the web and integrating this into marketing channels, brands can take advantage of brand authority, increasing the quality score signal within each of the product search markets to generate attention across the non-brand aware keywords. Ultimately your brand needs to be building its brand both online and offline. Has your team conducting similar studies and saw likewise results? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Brand Halo Effect: Does Brand Awareness Impact Organic Search Rankings?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Brand Halo Effect: Does Brand Awareness Impact Organic Search Rankings?"
    },
    {
      "level": "H2",
      "text": "Testing the theory"
    },
    {
      "level": "H2",
      "text": "What other factors are at play?"
    },
    {
      "level": "H2",
      "text": "So, does brand awareness influence search rankings?"
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Tom Coad\n          \n            Tom Coad\n          \n            Tom Coad"
}