{
  "url": "https://moz.com/blog/the-envelope-please-winners-of-the-seomoz-smxwest-giveway",
  "slug": "the-envelope-please-winners-of-the-seomoz-smxwest-giveway",
  "title": "The Envelope, Please.... Winners of the SEOmoz SMX West 2008 Giveaway - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The SEOmoz SMX West 2008 Giveaway Winners are...",
  "content": "The Envelope, Please.... Winners of the SEOmoz SMX West 2008 Giveaway SEO Events By: Gillian Muessig March 11, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Gillian Muessig March 11, 2008 The Envelope, Please.... Winners of the SEOmoz SMX West 2008 Giveaway SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Thanks to all who played our color-coded badge game, made new friends, shared codes, and hopefully had more fun at SMX West 2008 because of it. Thanks also to our partners who offer discounts to all SEOmoz PRO members at the Discount Store for their generous prizes. And now, (drum roll, please), the winners are: Lifetime Crazy Egg Subscription: Duncan from Distilled One Year Dedicated Server from Superb.net: Ken from Epiar SMX Advanced (June 3-4, 2008) Full Conference Pass: Peter from Zillow.com IPhone 16 GB from SEOmoz: Melissa from PolyPhaser $500 Mongoose Metrics Acct: Nagaraju from boorah.com Annual SEOmoz PRO Memberships: Thomas from Portent Interactive Scott from etna interactive I-Touch 8 GB from SEOmoz: Susan from i-architects.com 3-month SEOmoz PRO Memberships: Jeremy from Washington Energy Services Marie from Saint Gobain Angel from EZanga.com Gemma from Web Certain Ty from Perspective Internet Marketing $100 Amazon Gift Card: Mandy from Intuit ...and one dozen people received Hoodies and a deck of Search Spam cards! It's good to have fun ;) L Porter from Flying Bridge Kristos M Howse from Pop Labs A. Rivlin Sarah from Edutopia Nathan Tamar Weinberg from Techipedia Irina from abc Search Lauren from elocal listing Craig from SE Jones Pat from Mattherhorn Ross from StepForth Congratulations to all of the winners! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Envelope, Please.... Winners of the SEOmoz SMX West 2008 Giveaway"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Envelope, Please.... Winners of the SEOmoz SMX West 2008 Giveaway"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Gillian Muessig\n          \n            Gillian Muessig"
}