{
  "url": "https://moz.com/blog/the-paid-links-debate-rages-on-ses-san-jose-2007",
  "slug": "the-paid-links-debate-rages-on-ses-san-jose-2007",
  "title": "The Paid Links Debate Rages On - SES San Jose 2007 - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In our continuing series of coverage, I'm pleased to present one of the most talked-about, anticipated and dramatic sessions of the SES San Jose conference so far (though I heard that the session on click fraud was also extremely contentious).\nFor the past 2-3 years, Google (along with Yahoo! and…",
  "content": "The Paid Links Debate Rages On - SES San Jose 2007 SEO Events By: Rand Fishkin August 21, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 21, 2007 The Paid Links Debate Rages On - SES San Jose 2007 SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In our continuing series of coverage, I'm pleased to present one of the most talked-about, anticipated and dramatic sessions of the SES San Jose conference so far (though I heard that the session on click fraud was also extremely contentious). For the past 2-3 years, Google (along with Yahoo! and MSN/Live) have hounded the micro-economy of paid link advertising and paid link networks at conferences, on blogs and, when possible, in the search results themselves. The basic argument that search engineers in general, and Matt Cutts in particular, has presented is that paid links represent manipulation and pollution in the index. The links are not \"editorially vouching\" for the quality and relevancy of the pages they point to, but due to the ulterior motive of financial compensation, adversely affect the quality of search results. The panel for this session included: Moderator - Jeffrey K. Rohrs of ExactTarget Matt Cutts - Google search quality engineer and blogger at MattCutts.com Michael Gray - self proclaimed \"troublemaker\" and blogger at Wolf-Howl.com Todd Malicoat - \"paid link defender\" and blogger at Stuntdubl.com Todd Friesen - \"former troublemaker\" and director of online media at Range (also known as Oilman) Greg Boser - \"link buyer\" and CEO of WebGuerrilla Andy Baio - Founder of Upcoming.org and current Yahoo!er Todd Malicoat & Michael Gray prepare for the Fight Prior to the panel's start, moderator Jeffrey Rohrs played a video from David Dugdale of Rentvine that later become part of the panel's debate. I've embedded it below: The video was a lighthearted introduction to a panel that was shockingly negative at times. Matt Cutts began with a presentation called, simply, \"Paid Links.\" He started by telling the audience that the title of the panel, \"Are Paid Links Evil?\" was the wrong question to ask. Rather, in his opinion, a more proper question would be \"Do paid links that pass PageRank violate search engines' quality guidelines?\" And the answer, according to Matt, is that since 2005, Google has been explicitly clear that the answer is \"Yes.\" Matt notes that in the offline world, the FTC demands disclosure of all paid marketing activities (example from Matt - warning: PDF). In his opinion, when that disclosure carries over to the web, it must include disclosure for both humans and machines, meaning that a mention of \"sponsored links\" or \"advertising links\" in the body copy or as an image that's visible to humans is not enough - those who link to sources from which they have received compensation should be labeled in one of the following ways: Use a redirect through URL blocked by robots.txt Redirect through a URL using a 302 Use Javascript to direct the link Apply the rel=”nofollow” attribute to the link Add the Meta Robots = \"nofollow\" to the page header Matt goes on to say that Google certainly does not recommend you buy links - in fact, they're happy with link buyers who use sources like: AdBrite Quigo IndustryBrains Microsoft AdCenter Yahoo! Publisher Network Any site that doesn't pass PageRank He says that using non-no-follow links is akin to littering or driving in the carpool lane with only one person - it has an overall negative impact on society (in this case, the web). Matt also says that it's very difficult to buy paid links effectively as a business or as a search marketer because Google does such a good job detecting and eliminating the value of those links. He notes the following pitfalls: Links that are bought for a limited time (may not provide long term value) Links that are \"run of site\" which Google is very good at finding and eliminating Links that are purchased from \"sloppy sellers\" who link to bad sites and bad neighborhoods Links that are bought from sellers that cloak the links only to you, so Google never sees them Buying links that can be found and reported by a competitor Matt mentions that David's (very) recent viral video is an excellent example of how you can be creative and interesting to entice links to come to your site and notes that despite what some SEOs might say, it's much harder to fly under the radar than you/we think. Matt wraps up by mentioning a post of mine from several months back; Paid Links - Can't be a White Hat With 'em, Can't Rank without 'em. He notes that for all of the queries but one, Google had already algorithmically detected and removed the value of those links. Matt had some further reading from sources like the Washington Post, the FCC and his own blog that he promised to write about in the near future. Michael Gray was next to the stage. His presentation titled, \"A Tale of Propaganda and Fear, Uncertainty and Doubt,\" was confrontational, political and emotional to a degree that I have not previously seen at an SES conference. Michael is certainly an exceptionally effective speaker - he pulled the audience with him throughout the course of his arguments and was frequently interrupted by applause as he played to the emotions of the crowd and launched a rhetorically powerful indictment of Google's motivations. Sadly, due to Michael's exceptional speed with his presentation, I was not able to effectively take notes. However, I will do my best to summarize his arguments and hope that he posts the presentation online in the near future. At the core of Michael's anti-Google sermon was the following series of arguments: Both commercial and non-commercial queries exist on the web Commercial websites are NOT generally linked-to naturally Non-commercial websites are much more likely to entice natural links By eliminating paid links, Google will fill the top results for commercial queries with primarily non-commercial results Thus, when a searcher wishes to take a commercial action, the only relevant results will be the paid listings And, thus, searchers will be more likely to click on AdWords links, which earn Google money Michael noted that Google is not the government, should not be attempting to influence how webmasters build sites and is engaged in precisely the activity they claim to abhor - paid link sales, albeit in a different format, and one that makes themselves the primary earner. Michael also claimed that Google was deceptive in its launch and use of nofollow in 2005. According to him, nofollow was initially launched to protect blogs and content publishers from linking to bad neighborhoods and allow them to control and reduce the comment spam problem. It was only after widespread adoption - 3-6 months after nofollow was announced, that Google began publicly claiming that it should also be placed on paid links. Michael claims that this effort was part of a conspiracy by Google to deflect criticism about nofollow and their policies on paid links by subverting the issue until after the rollout. Personally, I had a tough time with these claims, though certainly the reaction of the audience would seem to indicate that they very much agreed or, at least, enjoyed the roasting of the popular search giant. However, I have a tough time arguing that none of Michael's points had validity - I'm hoping to catch him on video tomorrow, possibly with Mike McDonald & WebProNews - and discuss his conjecturing in more detail. Todd Malicoat spoke next, with a presentation entitled - \"7 Reasons Why I am a Link Libertarian.\" His seven reasons included: The semantic issue – paid linking is ambiguous – every link has a relative value and cost, and very few links are given truly editorially. Google is the founder of the link economy with their visible PageRank in the toolbar. The economic argument; according to Adam Smith - “if left to its own means, the efficient market will sort itself out” Paid links help clients and revealing them hurts relevancy Google's policy of FUD (Fear, Uncertainty & Doubt) is deplorable Competition is good for the market, and paid links create a competitive market According to the philosophy of \"design websites as though the search engines did not exist,\" the practice of paid links is perfectly legitimate and reasonable Todd also indicted the following AdWords ads as an example of hypocrisy from Google: He wrapped up his presentation noting that when buying links, SEOs and businesses must stay alert and aware - keeping links relevant, hidden and believable as natural. He also said that as SEOs, we need to stop publicly talking about the practice of buying links, both in panels (such as this) and in the online environment. To that, I say, good luck :) Todd Friesen from Range spoke next. He had not prepared a Powerpoint, but made several exceptionally intelligent points (in my opinion): If link purchases have a positive ROI for a company, they'll continue to make them. If they have a positive ROI, chances are good that they must also be serving the searcher effectively and thus, be good results for the engines. In a worst-case scenario, you flush your money down the drain - this isn't so bad, as those links can still send traffic, branding and may work at multiple engines (not just Google) Outside of the link buyer and seller, no one (especially not the search engines) know who is involved in a link purchase. Thus, if SEOs ever find that Google will actually ban sites (or directly penalize them) for link purchases, those purchases will be made by competitors to attempt to fool the engines into believing that they are violating the guidelines and should be penalized. Greg Boser from Webguerrilla also did not prepare a presentation, but made noteworthy points in a short speech: In a response to Matt Cutts' carpool analogy, Greg noted that he sometimes drives in the carpool lane when he's late and knows that the potential $300 fine is worthwhile. In Greg's opinion, the example that Matt gave of David Dugdale's Rentvine viral video is as egregious if not worse for relevancy than paid links - viral content of such an off-topic nature (to Rentvine's primary topic of finding homes for rent) should not help Rentvine's rankings and is more \"polluting\" than relevant paid links. Google often uses the example of the Yahoo! Directory as a place where paid links are acceptable since the editorial review quality is high, but this is, in Greg's opinion, a fallacy as Yahoo!'s directory is filled with spammy sites Andy Baio from Upcoming/Yahoo! is last up (note: he's also the blogger behind Waxy.org, though updates on that site are infrequent). He mentions that he's on the panel to \"represent users of the web and of search engines\" as he is not in the search marketing field and had to do \"a lot\" of research before coming to the panel, though he has not prepared a formal presentation. Andy first agrees with many of the things that Greg & Todd mentioned, saying that if the link has relevance and a true editorial review, it probably should not be discounted by the engines. He continues on to say that he's “not” representing Upcoming.org or Yahoo!, but he did consult with the Yahoo! Search team and they generally agree with Google on the topic of paid links. The only reason that he's on the panel is that he feels strongly that this is spam and that this practice makes the web worse. Andy says that If you (or your business) wouldn't resort to email spam or comment spam, why are paid links acceptable? According to Andy, paid links shouldn't be used because they ruin a public resource, are deceptive and hurt ordinary users. If your focus is traffic, that's terrific. But that's not the focus and Andy believes that the industry (of paid links) is “shady.” However, he strongly agrees with Todd (Malicoat) that allowing link brokers to run ads on Google is hypocritical. Andy wraps up by noting that If the websites who wanted to rank were “good enough,” they wouldn't need to buy links. He feels that “it's clear that eventually the technique will backfire. It's going to hurt your reputation and your pocketbook.” Q+A produces almost as many questions as answers, but I'll do my best to recount them: I (Rand) posed two questions to the panel: To Greg Boser - why shouldn't the Rentvine viral video be interpreted by Google as a signal that the Rentvine domain is valuable/unique/interesting? _ Greg responds that while it should be making that viral video rank for its own keywords/topics, the current algorithm from Google rewards \"trust\" and linkbait/viral content helps to build that trust. Off-topic viral content, according to Greg, is a terrible signal that the content on a site that's commercially targeted will actually have value to the searcher. He says that \"just because you (Rand) and Neil (referring to Neil Patel who's in the front row) can spam Digg,\" doesn't mean your clients' sites are relevant. And, besides that, those links are equally paid, as linkbait development services from companies like Neil's and Rand's are very expensive. _ To Matt Cutts - from an engineering perspective, would it not be preferable to algorithmically detect paid links, rather than request that webmasters use them voluntarily? After all, what percentage of web developers/marketers have ever (or will ever) hear of \"nofollow?\" _ Matt agrees that yes, indeed the first line of defense is always algorithmic. He seems to change positions a bit on the topic and says that \"nofollow\" is really for publishers who want to protect themselves from losing their ability to pass PageRank/linkjuice. I'd love to get some clarification from Matt about why, in that case, do they seem so intent on webmasters using \"nofollow\" when they buy links? Other questions posed to the panel: To Matt Cutts - can Google remove the ability of individual pages to pass linkjuice _ Matt says that not only can they remove single page's ability to pass PR, they can also remove the ability of only certain links on a page from passing PR, and do. _ To Matt Cutts - would Google ever ban a large brand for an extended period of time for engaging in manipulative link practices? _ Matt says that Google had removed a very big site (WhenU) in the past for 43 days in total from the index, and this was noticed by Ben Edelman. _ Jonah Stein (from Alchemist Media) asks Matt Cutts to answer the question posed to Greg Boser about the relevancy of Rentvine's linkbait video Matt says that viral content is a great way to show Google you can be creative and interest people across the web. One exact quote that I found valuable was \"Starting a blog can have a tremendous effect on the amount and quality of links you earn.\" The session wrapped up with dozens of questions pending, and the panel did get somewhat swarmed afterwards: While I was fascinated by this panel, I'm not sure that it solved any issues or brought webmasters closer to any solutions or solid answers in the paid links debate. I believe there's plenty more that needs addressing around this topic, and hope that all of the panelists (even Andy Baio) will have more to contribute in their blogs or online in the next few days. BTW - Tomorrow I'll be speaking on the SEO Pricing panel at 3:15pm on how much SEOs should charge, how much clients of SEO should expect to pay and how we at SEOmoz have gone through radical shifts in our own business model to create a more scalable model. Rebecca, meanwhile, will be speaking on Linkbaiting and Viral Search Success, where I expect she will rock :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Paid Links Debate Rages On - SES San Jose 2007"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Paid Links Debate Rages On - SES San Jose 2007"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}