{
  "url": "https://moz.com/blog/the-importance-of-marketing-analytics",
  "slug": "the-importance-of-marketing-analytics",
  "title": "The Importance of Marketing Analytics - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "[Importance Of Marketing Analytics] Why is marketing analytics important? As marketers, we understand the role of marketing analytics, of having an analyst on staff, and of constantly working with the data as part of our daily practice.",
  "content": "The Importance of Marketing Analytics SEO Analytics By: Joanna Lord November 27, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Joanna Lord November 27, 2012 The Importance of Marketing Analytics SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Analytics is one of those words: it gets used correctly for the most part, but often gets used as a catchall. As marketers, we understand the importance of having web analytics set up, of having an analyst on staff, and of constantly working with the data as a part of our daily practice. We spend a significant amount of time focused on site metrics and web analytics reports. We have a great sense of how our sites are performing technically, and how that backs out to money made. But what if web analytics aren't enough? Over the last few months, we’ve seen the rise of an equally important piece to the puzzle — marketing analytics — and I'd like to take some time and to explain what it is and how it can help all of us be more effective marketers. So, what is Marketing Analytics? Marketing analytics is the measurement and optimization of your marketing activities. Rather than focusing only on your site’s performance like you do with web analytics, you focus on how your marketing efforts are performing, and adjust them accordingly. Marketing analytics goes beyond on-site indicators and leans on other tools, offsite metrics, and even offline efforts. It takes a whole-picture approach to the measurement of your marketing. The concept seems simple — and somewhat assumed — but many marketers spend hours in web analytics tools like Google Analytics and Omniture, looking at the outcome of their efforts as it relates to site performance, but don't go any further than that. But what about analyzing the way you executed that campaign? What about the time of day you did things, or the vehicles you used? What about the conversations offsite, and the engagement in real life that resulted from those efforts? Marketing analytics is the act of looking past mere website results, and asking yourself, \"How did that marketing campaign really go?\" Marketing analytics helps us see how everything plays off each other, and decide how we might want to invest moving forward. Re-prioritizing how you spend your time, how you build out your team, and the resources you invest in channels and efforts are critical steps to achieving marketing team success. How do I get started with Marketing Analytics? Like many new approaches to analytics, there is a learning curve. There will need to be some up-front explanation and defining. We wanted to break down the parts of marketing analytics and leave you with some kick-off questions to get started with. 1. How are your marketing activities performing? This is the piece that most marketers have down pat. This is all about how are you performing right now. How are your current efforts paying off? If you focus solely on web analytics, you may find yourself focusing too narrowly on your site's results. With marketing analytics, you'll take a wide angle view. Rather than simply reporting your visitor counts, time on site, and conversions, what about reporting more? What about the results that happened offsite? What about the less traditional KPI-driven results like conversations, comments, and shares? In addition to reporting more metrics, we should also be reporting them in a way that speaks to the entire team and the company at large. If you want to change how your company invests their marketing resources, you need to make a strong case for analyzing what is happening beyond your site, and to go beyond cookie cutter KPIs and report formats. Here are a few examples of common web analytics performance KPIs (on the left) and then a contrasting list of marketing analytics KPIs (on the right). You can see how the list doesn't just grow in size, but requires us to use many tools, compile our own reports, and work to tell a story with the data. Marketing analytics goes beyond traditional website KPIs. We find more of the metrics we care about tend to be people-centered: how are we doing our best job for both current visitors/customers and for future ones? How are our fans, friends, and followers engaging with us? Who's talking about our brand on other sites? We track metrics that help us use our time in the most valuable way possible, and we work to know exactly how our marketing activities are doing for us. 2. Where are your competitors investing time and resources? Competitive analysis, you so funny. It's one of those things that all marketers know is important, but so many of us fail to carve out dedicated time for it. Marketing analytics assumes that competitive research is an ongoing, fluid effort. It shouldn't be something we do at the beginning of a project or when we take on a new client. It should be a constant metric we are aware of — and one we know as well as we do our own. In addition to performance, we need to be aware of where they are putting their time. What are they testing? What are they investing in? This requires we jump out of our software and tools and become observers. Are they engaging more on certain networks? Are they pushing more money into content marketing? Are they investing heavily into channels that you may or may not be in? This competitive layer adds color to your performance research. Now you know where you stand, where they stand, and you have a better sense of where things are going. This helps you invest in the right efforts, and possibly pull back from others. 3. How do your marketing activities perform in the long-term? We understand the importance of knowing if we have improved week over week, and month over month, but too often we stop at that. There are so many other things to be watching closely when tracking success. How about the momentum of those gains and losses? What about the long-term quality of those gains and losses? How do those short-term wins turn into loyalty and ongoing engagement? Marketing analytics focuses more on the overall performance of our efforts, and the many ways we can single them out to improve them. Imagine planning your marketing roadmap around yesterday's results only, or your site's performance only. Scary, huh? We agree. Now imagine planning a marketing roadmap around how each channel has done over time, and how your specific efforts returned across all the objectives you care about (money, engagement, loyalty, etc.) — that sounds way better. If you take the time up front to map that movement out, you will make more holistic decisions about where to invest your energy. Here are some great additional questions to ask when working to understand how your activities are returning: 4. How does your marketing analytics data inform your next decision? We all understand the premise that we need to invest where things are returning well. This is most commonly applied in performance marketing, but all of our marketing efforts demand the same closing of the loop. Marketing analytics can help us close the loop as it relates to our marketing efforts and investments. Instead of assuming some channels always work — or that some channels are never going to work — you should be testing where and how you spend your time, and prioritizing next quarter’s investments accordingly. This is most easily applied when it comes to staffing and budget spend, but what about time spent on researching new tools, new processes, creating new tests, and designs? Are you giving your time to the right channels? Marketing analytics helps us get to the bottom of that, and because of it you can make your next move a fully informed one. Common mistakes with Marketing Analytics There are quite a few common challenges people face when trying to invest in marketing analytics. Here are a few we've found, and tips on how to avoid them. Set it and forget it dilemma: We've all done it. You hear about this new cool analytics tool. You set it up and start collecting data, but you never quite circle back to see how things are going and what it's telling you. Or, worse yet, we receive weekly reports sent to us but we fail to interpret the data for valuable insights. It's the \"set it and forget it\" dilemma. Marketing analytics expects more. To do it well, you need to be testing both new channels and new tools to track their success — then set aside time to dive into the data. A key piece to successful marketing analytics is to be proactive and constantly pushing the limits on the process behind your decisions. It takes time. Marketers are strapped for time, but this is time well spent. Thinking it’s a CMO's job: A common misconception around deciding how to grow a marketing program is to think it's solely the CMO's job to do so. Instead, we should look at it as every marketer's responsibility to know how their efforts are returning and what to do next. This should back out to a roadmap for your channel or job responsibilities. If you leave it to the top of the organization, you often get a very disconnected roadmap. It should be a joint conversation. Failing to evangelize the wins and losses: One of the most common mistakes we fast-moving, highly caffeinated marketers make is failing to evangelize the results of our efforts. To make marketing analytics part of your team's culture and place it in the forefront of your company's mind, you need to be sharing how things are going on a regular basis. Rather than tell them you \"use inbound marketing to attract community members,\" you can talk about the specific campaigns, content pieces, and efforts. Show them which ones are working, and which ones need work. Ask for ideas and feedback. By getting them involved, they will be more invested in seeing it succeed. In conclusion: you need both While we think marketing analytics is critical for a successful marketing program, we aren’t saying it should replace your web analytics. Quite the opposite, actually. We think it’s the combination of the two that set a team up to succeed. If you spend time analyzing both your site’s performance and your efforts' performance you will have the full picture: What is working? What needs help? What demands a pivot? We’ve already seen more tools and resources pop up to help marketers really understand how their efforts are affecting the full picture. I think the next year will bring even more into the space. Many marketers are already looking at the big view marketing analytics provides today, albeit without dedicated tools that provide all of this functionality. For most marketers, the task is a manual one that requires multiple tools to get the full view — but it's worth it. As marketing teams continue to grow in size, and marketers wear more and more hats, we think more people will demand mature tools that make it easy to document a game plan. Rather that navigate that landscape based solely on conversions or other secondary metrics, there will be a demand for a more holistic approach to help us understand how we are doing, and where we should be doing more. I’m excited to see marketing analytics continue to evolve, and to see how tools develop to make it a smoother, more repeatable process — and I'm super excited to see how that can help us all be more efficient, successful marketers. I’d love to hear how you are applying this form of analysis, and what tools you use to help dictate where to invest your time and resources. Please leave comments and thoughts below! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Importance of Marketing Analytics"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Importance of Marketing Analytics"
    },
    {
      "level": "H2",
      "text": "So, what is Marketing Analytics?"
    },
    {
      "level": "H2",
      "text": "How do I get started with Marketing Analytics?"
    },
    {
      "level": "H2",
      "text": "Common mistakes with Marketing Analytics"
    },
    {
      "level": "H2",
      "text": "In conclusion: you need both"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Joanna Lord\n          \n            Joanna Lord\n          \n            Joanna Lord"
}