{
  "url": "https://moz.com/blog/the-five-secret-ways-nintendo-rules-the-internet",
  "slug": "the-five-secret-ways-nintendo-rules-the-internet",
  "title": "The Five Secret Ways Nintendo Rules The Internet - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "By keeping children and teenagers entertained back in the 1980s, Nintendo has claimed a spot in the heart of the present day internet generation. Nintendo's internet success is widely accepted yet largely undocumented. The tactics below reveal only the tip of the iceberg.\n\n...",
  "content": "The Five Secret Ways Nintendo Rules The Internet Marketing Industry By: Danny Dover December 10, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Danny Dover December 10, 2008 The Five Secret Ways Nintendo Rules The Internet Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. By keeping children and teenagers entertained back in the 1980s, Nintendo has claimed a spot in the heart of the present day internet generation. Nintendo's internet success is widely accepted yet largely undocumented. The tactics below reveal only the tip of the iceberg. Nintendo Has Allowed its Characters to Thrive Online A Real Search In Google Reveals That 'Mario' Has More Results Than 'Porno' (Results may vary depending on location) Unlike most other media producers, Nintendo has allowed its intellectual property to be freely discussed and used online. Nostalgia and Nintendo's openness to new technology has created an atmosphere that has allowed the company's characters to grow immensely popular. The example above shows that a Google search for the term Mario returns more results than a search for Porno. This is amazing in a media atmosphere allegedly driven by violence and sexuality. Mario has remained essentially the same non-violent and innocent character that he was 20 years ago, and he has still managed to attain inequitable popularity. Nintendo Utilizes Its Special Understanding of the Internet Generation The company has years of market research and experience in selling to this market. Just like a good web interface designer, Nintendo relies on conventions to make every one of its games feel familiar to its users. Nintendo Can Make Terrible Ideas Great Data Source A fat hero with the super power to jump really high? He rides a tiny dinosaur with magic shoes? WTF! Only Nintendo has the video game Midas touch to create gold out of seemingly terrible ideas. With the exception of a few recent game systems, Nintendo has always led the world in video game sales. Now with the help of brilliant internet advertisements, Nintendo has regained its throne as the best video game system creator in the world. Nintendo Flies Below the Radar and Creeps in Like a Trojan Horse Nintendo's and Microsoft's Headquarters Nintendo's American Headquarters are located in Redmond, Washington, and are completely surrounded by Microsoft's Headquarters. Its single building is embarrassingly lacking compared to Microsoft's immense complex. The same could be said of Nintendo's internet marketing campaigns. They are usually small (relative to competitors Sony and Microsoft) but surprisingly effective. Nintendo is Timeless Mario's Evolution (Photo Credit) Although Mario has gained a dimension (he's 3D now, like you and me), he is still the red overalls-wearing goof that he has always been. Nintendo knows that it has created something worthwhile and has worked hard to preserve it. The same can be said for its website. It continues to be the image heavy eye candy that is has been since 2001. If you know of any other secrets Nintendo is using to rule the internet, please feel free to share your opinions and expertise in the comments. As always, e-mail me or send me a private message if you have any suggestions on how I can make my posts more useful. If that's not your style, feel free to contact me on Twitter (DannyDover) and/or Linkedin (Danny Dover). Thanks! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Five Secret Ways Nintendo Rules The Internet"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Five Secret Ways Nintendo Rules The Internet"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Danny Dover\n          \n            Danny Dover\n          \n            Danny Dover"
}