{
  "url": "https://moz.com/blog/the-power-of-archetypes-in-marketing",
  "slug": "the-power-of-archetypes-in-marketing",
  "title": "Understand and Harness the Power of Archetypes in Marketing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Understanding your brand's archetype and narrative mode can embed you deep in the psyche of your customer. Learn how.",
  "content": "Understand and Harness the Power of Archetypes in Marketing Marketing Psychology | Branding | SEO Copywriting By: Gianluca Fiorelli March 12, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Gianluca Fiorelli March 12, 2015 Understand and Harness the Power of Archetypes in Marketing Marketing Psychology | Branding | SEO Copywriting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Roger Dooley, neuromarketing expert, reminds us in his book Brainfluence that in 80% of cases we make a decision before being rationally aware of it. Although Dooley explains this effect in terms of how our brain works, in my opinion, distinctly separating neuroscience and the theory of archetypes would be incorrect. On the contrary, I believe that these two aspects of the study of the human mind are complementary. According to Jung, archetypes are \"[...] forms or images of a collective nature which occur practically all over the Earth as constituents of myths and—at the same time—as individual products of unconscious\". He then, added something that interests us greatly: \"The [forms and images] are imprinted and hardwired into out psyches\". Being able to design a brand personality around an archetype that connects unconsciously with our audience is a big first step for: brand loyalty, community creation, engagement, conversions. The Slender Man is the \"Internet age\" version of the archetype figure of the Shadow Archetypes can be also used for differentiating our brand and its messaging from others in our same market niche and to give that brand a unique voice. If we put users at the center of our marketing strategy, then we cannot limit ourselves in knowing how they search, how they talk on social media, what they like to share or what their demographics are. No, we should also understand the deep psychological reasons why they desire something they search for, talk the way they talk, share what they share, and their psychological relation with the environment and society they live in. Knowing that, we can use archetypes to create a deep emotional connection with our audience and earn their strong positive attitude toward us thanks to the empathy that is created between them and us. Narrative modes, then, help us in shaping in a structured way a brand storytelling able to guide and engage the users, and not simply selling or creating content narrative doomed to fail. The 12 archetypes graph by Emily Bennet The chart above presents the 12 Jungian archetypes (i.e: Hero), to what principal human desire (i.e.: leave a mark on the world) they correspond and what is the main behavior each one uses for achieving that desire (i.e.: mastery). Remember: if the audience instinctively recognizes the archetypal figure of the brand and its symbolism and instinctively connect with it, then your audience is more ready to like and trust what your brand proposes. On the other hand, it is also a good exercise to experiment with archetypes that we would not think are our brand's one, expanding the practice of A/B tests to make sure we're working with the correct archetype. The Creator In my last post I used Lego as example of a brand that is winning Internet marketing thanks to its holistic and synergistic use of offline and online marketing channels. I explained also how part of its success is due to the fact Lego was able to shape its messages and brand personality around the Creator archetype (sometimes called the \"Builder\") which is embodied by their tagline, \"let's build\". Creators tend to be nonconformist and to enjoy self expression. A Creator brand, then, will empower and prize its audience as much as it is able to express itself using its products. View image | gettyimages.com The Ruler The Ruler is the leader, the one setting the rules others will follow, even competitors. Usually it's paired with an idea of exclusiveness and status growth. A brand that presents itself as a Ruler is suggesting to their audience that they can be rulers too. A classic example of Ruler brand is Mercedes: The Caregiver Altruism, compassion, generosity. Caregiver brands present themselves as someone to trust, because they care and empathize with their audience. The Caregiver is one of the most positive archetypes, and it is obviously used by nonprofit organizations or governmental institutions like UNICEF, but brands like Johnson & Johnson have also shaped their personality and messages around this figure. The Innocent The Innocent finds positive sides in everyone and everything. It sees beauty even in things that others will not even consider, and feels in peace with its inner beauty. Dove, obviously, is a good representation of the Innocent archetype. The Sage The Sages wants to know and understand things. The Sage is deeply humanist and believe in the power of humankind to shape a better world through knowledge. However, the Sage also has a shadowed side: intolerance to ideas others than their own. Google, in both cases, is a good example a Sage brand. The Explorer The Explorer is adventurous, brave, and loves challenges. He tends to be an individualist too, and loves to challenge himself so as to find his real self. Explorer brands prompt their audience to challenge themselves and to discover the Explorer within. Red Bull is a classic example of these kinds of brands, but REI and Patagonia are even better representations. The Hero In many aspects, the Hero archetype is similar to the Explorer and Outlaw ones, with the difference that the Hero many times never wanted to be the hero, but injustice and external events obliged him to find the courage, braveness, and the honor to become one. Nike, and also its competitor Adidas, shapes its brand voice around this archetypal figure. The Magician The Magician is clever, intelligent, and sometimes his ability can be considered supernatural. The Magician is able to make the impossible possible. Because of that some of the best known technology brands use this archetype as their own to showcase their innovation and how they use their advanced knowledge creatively. Apple—even if you are not an Apple fan—created a powerful brand by shaping it around this archetype. The Outlaw The Outlaw is the rebel, the one who breaks the rules in order to free his true self. The Outlaw goes against the canon and is very aware of the constrictions society creates. A great example of a brand that very well represents the Outlaw archetype is Betabrand. The Everyman It is perfectly fine to be \"normal,\" and happiness can come from simply sharing things with people we love. Brands targeting the Everyman audience (and painting themselves as such) craft their messages about the beauty of simple things and daily real life. Ikea is probably the brand that's achieved mastery in the use of this archetype over the past few years. The Jester Fun, irreverent, energetic, impulsive and against the established rules at the same time, the Jester is also the only one who is able to tell the truth with a joke. Jesters can be revolutionary too, and their motto could be \"a laugh will bury you all.\" A brand that presents itself as the Jester is a brand that wants to make our lives easier and more bearable, providing us joy. The Lover Sensuality is the main characteristic of the Lover archetype, as well as strong physicality, passion, and a need for deep and strong sensations. But the Lover can be also the idealist, the romantic longing for the perfect love. Archetypes and brand storytelling Our brain, as many neuroscientists have proved, is hard-wired for stories (I suggest you to watch this TEDx too). Therefore, once we have decided what archetype figure best responds both to our audience and our values as a brand, we must translate the psychology we created for our brand into brand storytelling. That storytelling must then be attuned to the psychology of our audience based on our psychographic analysis of them. Good (brand) storytelling is very hard to achieve, and most of the time we see brands that miserably fail when trying to tell branded stories. Introducing the Theory of Literary (or Narrative) Modes In order to help my clients find the correct narrative, I rely on something that usually is not considered by marketers: the Theory of Literary Modes. I use this theory, presented first by Northrop Frye in it essay Anatomy of Criticism, because it is close to our \"technical marketer\" mindset. In fact: The theory is based on a objective and \"scientific\" analysis of data (the literary corpus produced by humans); It refuses “personal taste” as a metric, which in web marketing would be the same as creating a campaign with tactics you like but you don’t really know if your public is interested in. Even worse, it would be like saying \"create great content\" without defining what that means. Moreover, the Theory of Literary Modes is deeply structured and strongly relies on semiotics, which is going to be the natural evolution of how search engines like Google will comprehend the content published in the Internet. Semantic thinking is just the first step as well explained Isla McKetta here on Moz few months ago. Finally, Northrop Fryed considers also archetypes this theory because of the psychological and semiotic value of the symbolism attached to the archetypal figure. Therefore, my election to use the Theory of Literary Modes responds To the need to translate ideal brand storytelling into something real that can instinctively connect with the brand's audience; To make the content based on that storytelling process understandable also by search engines. The Theory of Literary Modes in marketing To understand how this works in marketing, we need to dig a little deeper into the theory. A literary work can be classified in two different but complementary ways: 1) Considering only the relation between the nature of the main character (the Hero) and the ambient (or environment) where he acts. 2) Considering also if the Hero is refused or accepted by society (Tragedy and Comedy). In the first case, as represented in the schema above, if the Hero: Is higher by nature than the readers and acts in a completely different ambient than theirs, we have a Romance; Is higher by nature than the readers, but acts in their same ambient, we have an Epic; Is someone like the reader and acts in the reader's own ambient, we are in field of Realism; Is someone lower by nature than the readers and acts in a different or identical ambient, we are in the realm of Irony, which is meant as “distance.” A fifth situation exists too, the Myth, when the nature of the Hero is different than ours and acts in an ambient different than ours. The Hero, in this case, is the God. If we consider also if society refuses or accepts the hero, we can discover the different versions of Tragedy and Comedy. I will not enter in the details of Tragedy, because we will not use its modes for brand storytelling (this is only common in specific cases of political marketing or propaganda, classic examples are the mythology of Nazism or Communism). On the contrary, the most common modes used in brand storytelling are related to Comedy, where the Hero, who usually is the target audience, is eventually accepted by society (the archetypal world designed by the brand). In Comedy we have several sub modes of storytelling: \"The God Accepted.\" The Hero is a god or god-like kind of person who must pass through trials in order to be accepted by the society; The Idyll, where the Hero uses his skills to explore (or conquer) an ideal world and/or become part of an ideal society. Far West and its heir, Space Opera (think of Interstellar) are classic examples. Comedy sees the hero trying to impose his own view of the world, fighting for it and finally being awarded with acceptance of his worldview. A good example of this is every well ending biopic of an entrepreneur, and Comedy is the exact contrary of melodrama. On a lower level we can find the Picaresque Comedy, where the hero is by nature inferior to the society, but – thanks to his cleverness – is able to elevate himself to society's level. Some technology business companies use this narrative mode for telling their users that they can \"conquer\" their market niche despite not having the same economic possibilities as the big brands (this conquering usually involves the brand's tools). Finally we have the Irony Mode of Comedy which is quite complex to define. It can represent stories where the hero is actually an antihero, who finally fails in his integration into the society. It can also be about inflicting pain on helpless victims, as in mystery novels. It can also be Parody. Some examplesThe Magician, gamification, and the Idyllic mode Consider this brand plot: The user (the Hero) can become part of a community of users only if he or she passes through a series of tasks, which will award prizes and more capabilities. If the user is able to pass through all the tasks, he will not only be accepted but also may have the opportunity to be among the leaders of the community itself. And now consider sites, which are strongly centered on communities like GitHub and Code Academy. Consider also SAAS companies that present the freemium model like Moz or mobile games like Boom Beach, where you can unlock new weapons only if you pass a given trial (or you buy them). The Magician is usually the archetype of reference for these kinds of brands. The Hero (the user) will be able to dominate a complex art thanks to the help of a Master (the brand), which will offer him instruments (i.e.: tools/courses/weapons). Trials are not necessarily tests. A trial can be doing something that will be awarded, for instance, with points (like commenting on a Moz blog post), and the more the points the more the recognition, with all the advantages that it may offer. Gamification, then, assumes an even stronger meaning and narrative function when tied to an archetype and literary mode. Ikea, the Everyman, and the Comedic mode Another example is Ikea, which we cited before when talking of the Everyman archetype. In this case, the Hero is someone like me or you who is not an interior designer or decorator or, maybe, who does not have the money for hiring those professionals or buying very expensive furniture and decoration. But, faithful to its mission statements (\"design for all\", \"design your own life\"...), Ikea is there to help Everyman kind of people like me and you in every way as we decorate our own houses. On the practical side, this narrative is delivered in all the possible channels used by Ikea: web site, mobile app, social media (look at its Twitter profile) and YouTube channel. Betabrand, the Outlaw, and Picaresque Comedy A third and last example can be Betabrand. In this case both the brand and the audience is portrayed using the Outlaw archetype, and the brand narrative tend to use the Picaresque mode. The Heroes is the Betabrand community who does not care what the mainstream concept of fashion is and designs and crowdfounds \"its fashion.\" How to use archetypes and narrative modes in your brand storytelling The first thing you must understand is what archetype best responds to your company tenets and mission. Usually this is not something an SEO can decide by him- or herself, but it is something that founders, CEOs, and directors of a company can inform. Oftentimes a small to medium business company can achieve this with a long talk among those company figures and where they are asked to directly define the idealistic \"why?\" of their company. In case of bigger companies, defining an archetype can seem almost impossible to do, but the same history of the company and hidden treasure pages like \"About Us\" can offer clear inspiration. Look at REI: Clearly the archetype figure that bests fits REI is the Explorer. Then, using the information we retrieve when creating the psychographic of our audience and buyer personas, matching with the characteristics each archetype has, and comparing it with the same brand core values, we can start to understand the archetype and narrative mode. If we look at REI's audience, then we will see how it also has a certain affinity with the Everyman archetypal figure (and that also explains why REI also dedicates great attention to family as audience). Once we have defined the best archetype commonly shared by our company and our audience, we must translate this figure and its symbolism into brand storytelling, which in web site includes design, especially the following: Color pattern, because colors have a direct relation with psychological reaction Images, considering that in user-centric marketing the ideal is always to represent our targeted audience (or a credible approximation) as their main characters. I am talking of the so called \"hero-shots\", about which Angie Schottmuller brilliantly discussed in the deck I embed here below: Visual Marketing with Hero Shot Images from Angie Schottmuller If you want to dig deeper in discovering the meaning and value of symbols worldwide, I suggest you become member of Aras.org or to buy the Book of Symbols curated by Aras. Define the best narrative mode to use. REI, again, does this well, using the Idyllic mode where the Hero explores and become part of an ideal society (the REI community, which literally means becoming a member of REI). We should, then: Continue investigating the archetypal nature of our audience conducting surveys Analyzing the demographic data Google Analytics offers us about our users Using GA insights in combination with the data and demographic information offered by social networks' ad platforms in order to create not only the interest graph of our audience but also to understand the psychology behind those interests Doing A/B tests so to see whether symbols, images, and copywriting based on the targeted archetypes work better and if we have the correct archetype. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Understand and Harness the Power of Archetypes in Marketing"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "Understand and Harness the Power of Archetypes in Marketing"
    },
    {
      "level": "H2",
      "text": "The 12 archetypes"
    },
    {
      "level": "H4",
      "text": "The Creator"
    },
    {
      "level": "H4",
      "text": "The Ruler"
    },
    {
      "level": "H4",
      "text": "The Caregiver"
    },
    {
      "level": "H4",
      "text": "The Innocent"
    },
    {
      "level": "H4",
      "text": "The Sage"
    },
    {
      "level": "H4",
      "text": "The Explorer"
    },
    {
      "level": "H4",
      "text": "The Hero"
    },
    {
      "level": "H4",
      "text": "The Magician"
    },
    {
      "level": "H4",
      "text": "The Outlaw"
    },
    {
      "level": "H4",
      "text": "The Everyman"
    },
    {
      "level": "H4",
      "text": "The Jester"
    },
    {
      "level": "H4",
      "text": "The Lover"
    },
    {
      "level": "H2",
      "text": "Archetypes and brand storytelling"
    },
    {
      "level": "H3",
      "text": "Introducing the Theory of Literary (or Narrative) Modes"
    },
    {
      "level": "H3",
      "text": "The Theory of Literary Modes in marketing"
    },
    {
      "level": "H4",
      "text": "Some examples"
    },
    {
      "level": "H5",
      "text": "The Magician, gamification, and the Idyllic mode"
    },
    {
      "level": "H5",
      "text": "Ikea, the Everyman, and the Comedic mode"
    },
    {
      "level": "H5",
      "text": "Betabrand, the Outlaw, and Picaresque Comedy"
    },
    {
      "level": "H3",
      "text": "How to use archetypes and narrative modes in your brand storytelling"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Turn Marketing Into Meaningful Relationships — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Catering to User Behavior Shifts During Times of Economic Turbulence — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Close More Sales With Emotion-Driven SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Gianluca Fiorelli\n          \n            Gianluca Fiorelli\n          \n            Gianluca Fiorelli"
}