{
  "url": "https://moz.com/blog/the-rising-power-of-social-media-optimization",
  "slug": "the-rising-power-of-social-media-optimization",
  "title": "The Rising Power of Social Media Optimization - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Social Media Optimization (SMO) is perhaps the best kept secret these days in the field of search engine optimization. But what is it, and how can you harness its power?Loosely defined, social media optimization is a form of search engine optimization which targets the increasingly popular…",
  "content": "The Rising Power of Social Media Optimization Social Media A By: arteworks March 21, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! A By: arteworks March 21, 2007 The Rising Power of Social Media Optimization Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Social Media Optimization (SMO) is perhaps the best kept secret these days in the field of search engine optimization. But what is it, and how can you harness its power? Loosely defined, social media optimization is a form of search engine optimization which targets the increasingly popular user-driven content bookmarking sites such as digg.com as sources of both traffic and inbound linkage. This type of SEO strategy can best be described in more traditional terms as an aggressive viral marketing campaign, in which user driven content forms the \"word of mouth\" necessary to create a buzz in the online community regarding a particular web site. Huh? Let us address some key terms one at a time. Social media can be defined, for our online purposes, as any web site in which the content of that site is primarily user driven. In other words, the site owners don't create the content, the users do. Some familiar examples might be blogger.com, myspace.com, facebook.com, and similar sites. It would also include social bookmarking sites, which are becoming evermore popular these days, especially with users in their 20's and 30's. A social bookmarking site is a site such as digg.com. There are many of them. These sites generally operate as a way to store Internet bookmarks online. Think of the familiar \"Favorites\" folder in your browser. Well, social bookmarking sites do the same thing, but take it a step further. First of all, social bookmarking allows a user to post his or her favorite articles, news stories, or web sites online as opposed to on their local machine. Secondly, these bookmarks are public, so that anyone can browse them and find sites that other people have bookmarked. Finally, many such sites offer additional functionality, such as user-driven ranking or voting and the addition of public comments to each bookmark. So how can this be used for search engine optimization purposes? Well, it is important to remember that the proper goal of search engine optimization is not just rankings, but traffic, and not just any traffic but qualified traffic. It serves no business purpose to be #1 for a term not relevant to your site, or to receive loads of unqualified traffic to your site that will not result in a conversion to sale. When SEO is considered in this context, which is the proper one, things begin to make more sense. Social media optimization involves a number of things, which will be detailed in later posts. However, generally speaking, the bookmarking of your site's content to social bookmarking sites creates both inbound linkage, traffic, and a \"buzz.\" It is a wonderful way to \"get the word\" out about your site in short order. The other advantage of social media is that it does create its own sort of internal quality control. Those who choose to spam a site with low quality posts will generally get voted down by the social community. Of course, bad publicity is better than no publicity, but we would all rather have a positive buzz about us given the choice. The creation of quality, useful, informative content is crucial to generating a positive buzz about your site. Social media optimization involves more than just the act of bookmarking your site, however. It also involves making your site easy for others to bookmark as well. This is usually accomplished via a series of bookmarking icons placed somewhere within each page of the site, which allow users to post your content to a social media site with a simple click of their mouse. Ethical social media optimization also requires the creation of quality content, as previously mentioned. The online community simply will not tolerate useless, banal posts, and the user driven model of social media fosters a spirit of creativity and originality, all of which contributes to the \"mashup\" of Internet content. The mashup theory in a nutshell centers around the concept of an aggregated web, in which content is pulled from a variety of sources to generate a quality, relevant, and informational experience for the netizen. Happy bookmarking! About the Author: Matt Foster is the President of ArteWorks Business Class, a leading search engine optimization firm located in Austin, Texas. For more information, please visit www.arteworks.biz. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Rising Power of Social Media Optimization"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Rising Power of Social Media Optimization"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "arteworks\n          \n            arteworks"
}