{
  "url": "https://moz.com/blog/the-witch-hunt-google-the-puritans-and-senator-mccarthy",
  "slug": "the-witch-hunt-google-the-puritans-and-senator-mccarthy",
  "title": "The Witch Hunt - Google, the Puritans, and Senator McCarthy - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I don't think I am the only one who had to read The Crucible in high school and listen to their English teacher compare the play to McCarthyism in the 50s.  And I can't be the only one sitting here thinking that Google is on the same type of ob...",
  "content": "The Witch Hunt - Google, the Puritans, and Senator McCarthy Search Engines M By: MaltaSEO October 10, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! M By: MaltaSEO October 10, 2007 The Witch Hunt - Google, the Puritans, and Senator McCarthy Search Engines This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I don't think I am the only one who had to read The Crucible in high school and listen to their English teacher compare the play to McCarthyism in the 50s. And I can't be the only one sitting here thinking that Google is on the same type of obsessive link buying witch hunt. What do the Puritans, McCarthyism and Google all have in common? And how could it lead to Google's downfall? Let's explore: Rise to Power through Confusion The Puritans: New church, no clear leader McCarthyism: America just finished one war, starting two more (Cold and Korean) Google: Rose in the midst of the dot-bomb era to become the market leader A Soapbox to Stand-On The Puritans: The Pastor, the Church McCarthyism: Senator McCarthy, the Senate Google: Matt Cutts, Gadgets, Google, and SEO A Superior Mentality The Puritans: Find and punish witches to help fight the Devil McCarthyism: Find and punish communists to protect America Google: Find and punish link buyers to prevent index spam Scared Snitches The Puritans: No one wants to go to Hell – must report witches McCarthyism: No one wants to be blacklisted or deported – must report communists Google: No one wants to be banned from the index – must not buy links & must report other link buyers The Dust Settles The Puritans: Members were dead, the flock was broken McCarthyism: People lost their jobs, their homes, and their reputations Google: Google is dethroned and loses considerable search market share. Consumers & search marketers win because a superior service has been created. There are plenty of people already covering the buying links is bad/buying links is good debate. What I am pointing out is that Google's obsession with the detection, reporting, and devaluing of paid links is blinding their ability to create a superior search experience. Google is stuck on creating a spam-free index, while competitors like Ask.com continue to innovate and redefine how a SERP can assist searchers, even if their index doesn't contain every nook-and-cranny of the web. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Witch Hunt - Google, the Puritans, and Senator McCarthy"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Witch Hunt - Google, the Puritans, and Senator McCarthy"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "MaltaSEO\n          \n            MaltaSEO"
}