{
  "url": "https://moz.com/blog/the-internet-marketers-checklist-for-determining-if-a-business-idea-is-worth-pursuing",
  "slug": "the-internet-marketers-checklist-for-determining-if-a-business-idea-is-worth-pursuing",
  "title": "The Internet Marketer's Checklist For Determining If a Business Idea is Worth Pursuing - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Starting a company is a lot like streaking. Coming up with the idea and brainstorming the execution is exciting but performing the action is difficult and rarely done well.\n\nI, like a lot of people, have had my mind hijacked by a new business idea that fools me into believing I came up with the…",
  "content": "The Internet Marketer's Checklist For Determining If a Business Idea is Worth Pursuing Online Advertising By: Danny Dover March 2, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Danny Dover March 2, 2009 The Internet Marketer's Checklist For Determining If a Business Idea is Worth Pursuing Online Advertising The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Update 7-29-09: I have decided to put this series on hold for a while. I will continue it once I get more time to experiment with the ideas before recommending them. I am sure both of us can appreciate that :-p Cheers! This is the second post of an ongoing blog series called How to Start an Internet Company That Will Be Noticed: A Framework. The series aims to use an online marketing perspective to create a framework for starting a successful internet company. Starting a company is a lot like streaking. Coming up with the idea and brainstorming the execution is exciting but performing the action is difficult and rarely done well. I, like a lot of people, have had my mind hijacked by a new business idea that fools me into believing I came up with the next big thing. Unfortunately, most of these plans ended in complete failure. As soon as I started to make progress I would inevitably run into an unforeseen problem that would, like a bad streaking plan, leave me embarrassed and out of breath. Fueled by my failures, I have used my more successful business and internet marketing experiences to create the following checklist. My hope is that this list will prevent you from repeating my mistakes. Good Luck! The Internet Marketer's Checklist For Determining If a Business Idea is Worth Pursuing PDF Come up with an idea that solves a marketable problem - Many web business ideas I have followed (or pursued) have failed because their benefit was not marketable. Before checking this box I now ask myself the following questions: Can I explain this idea in a language that makes sense to applicable people? Does the solution sound plausible to someone who hasn't tried it? Am I trying to sell a solution that people can get for free without a lot of additional effort? Determine what kind of people will want to visit the site - I have seen many developers fall into the trap of solving a problem in a way that is optimal for them but not for users as a whole. To avoid this pitfall, it is important to understand your prospective users. For now, it is okay to simply outline the persona of a potential user. The next segment of this series will go in depth on answering this question. To see an expert example of this, look up Max Levchin and his work with Slide. He is one of the most mathematical and technical focused leaders in the internet industry and his current company deals almost exclusively with glittery slideshows for teenagers. Identify and obsess over what tasks users will be able to accomplish via the product or service - It is practically impossible to execute an idea without feature creep (adding more and more new features as a plan expands). This makes it painfully important to resist the urge to expand and instead focus on the primary objective. I find it best to write down all of my expansion ideas in a notebook but not act on them until after the primary objective is done. Keep asking yourself what will make users want to recommend this service/product to their friends. This is the key to viral marketing. Secure an \"unfair\" advantage over your competition - If you really do have the next big idea, be prepared for a lot of copycat competition. The best way to prepare yourself is by securing an unfair advantage. Sometimes this is by finding a more influential user-base (Facebook), other times this is by harnessing an untapped technology (YouTube), and more often than not, this takes the form of hiring superior staff. (Google, Wufoo, Twitter, 37 Signals) Remember, first comers' advantage is important, but without something special it is not enough to carry your business. Identify two degrees of difference - Far too often people create clone companies that don’t offer anything new. For all of my ideas, I try to identify two degrees of difference. For example, if you are creating the “YouTube of refrigerator magnets,” you could consider the refrigerator magnets as one degree of difference (from YouTube). Expand on this by adding a second degree of difference. This could take the form of “YouTube of refrigerator magnets based on a fremium business model.” Two degrees of difference helps promote diversity and innovation which helps build a stronger and more marketable product/service. Figure out how to make your content build links - Search Engine Optimizers roughly agree that 70% of ranking metrics are directly related to links. This means that optimizing your business's link-worthiness is vitally important. You must decide early on what type of link-worthy content you will initially focus on. Is your content, service or product going to be: Practical, Interesting, Funny, a News Source, a Time Saver or something else? Secondly, it is important to make sure that the users that you plan on targeting are capable of giving links. The easiest link producing users to target are webmasters and bloggers. If applicable, try to attract their attention. Determine who will write your unique content - The reality is that search engines are very limited in the type of content that they can index well. Text is the currency of the internet. Don’t be fooled into believing that you can be an exception. Who are you going to get to write? Are they a talented writer? Do they LOVE writing? Can you get them under contract? What will you do to avoid fluff? You should answer all of these if you want to show up highly ranked in search engines. Ask yourself how will this website do if it only has 10/100/1000 users - There are several hurdles your idea will need to overcome. To prepare for this I have learned to ask myself the following questions: Does the idea rely on the network effect? If so, how will it be overcome? Can a community be gleaned from a different website? Why are complete strangers going to spend their time on this new website? It helps to look at the big picture and imagine why a user will pick this new website over the millions of other options. Throw away the idea that you will succeed because you’re an exception - It is very unlikely that you are the next Bill Gates/Steve Jobs/Mark Zuckerberg/Peter Thiel. These people did not start their companies believing they were exceptions. Instead, they dedicated all of their thoughts and efforts to proving it. Cast a wide net, be flexible and work harder than your competition. These are the real ways to become successful. I look forward to hearing your opinions and expertise in the comments. As always, e-mail me or send me a private message if you have any suggestions on how I can make my posts more useful. If that's not your style, feel free to contact me on Twitter (DannyDover) and/or Linkedin (Danny Dover). Thanks! P.S. Thanks to Jacob Morris for some of the inspiration for this post! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Internet Marketer's Checklist For Determining If a Business Idea is Worth Pursuing"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Internet Marketer's Checklist For Determining If a Business Idea is Worth Pursuing"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Danny Dover\n          \n            Danny Dover\n          \n            Danny Dover"
}