{
  "url": "https://moz.com/blog/the-five-marketing-lessons-that-took-me-a-long-time-to-learn",
  "slug": "the-five-marketing-lessons-that-took-me-a-long-time-to-learn",
  "title": "The Five Marketing Lessons That Took Me a Long Time to Learn - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Because I grew up surrounded by entrepreneurs I learned early that working for yourself was a great way to make money and improve your lifestyle. However, even though I had this early drive to build businesses, I didn’t always know the right way to go about building or marketing them. In fact,…",
  "content": "The Five Marketing Lessons That Took Me a Long Time to Learn Marketing Industry By: Neil Patel December 19, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Neil Patel December 19, 2011 The Five Marketing Lessons That Took Me a Long Time to Learn Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Because I grew up surrounded by entrepreneurs I learned early that working for yourself was a great way to make money and improve your lifestyle. However, even though I had this early drive to build businesses, I didn’t always know the right way to go about building or marketing them. In fact, through trial and error I eventually discovered what it takes to build and market a successful business, and the following five lessons are what I think to be the most important. Being the category leader is not the only way to be successful Everyone seems to think that if you’re not number one then you won’t have a successful business. I know I fell into this trap early in my career. Whether I was working as a marketing consultant or SEO, I tried to be number one, but it didn’t take me long to discover that being the best and being the category leader is not the same thing. In some cases, you are number one when you dominate in revenue, number of users or market position. In other words, it’s pretty clear you are number one. For example, according to StatCounter, when it comes to browser, it’s pretty obvious who rules: But if you are in a less-developed market, number one is often perception, which you can control with marketing. Listen, a company with a product that’s inferior to competition, yet gets a lot of media buzz, will seem like the category leader. The clothing company American Apparel is a great example. Constantly in the media, whether for good things or bad things, American Apparel seemed unstoppable. In the case of AA, you couldn’t go anywhere without seeing one of their ads or hearing about them in the news. What did they do to make that happen? Controversial policies - American Apparel doesn’t outsource and often includes employees posing for their soft-porn ads, both great topics for the media to report on. Adopt a social cause and make noise about it – American Apparel is behind two social causes, Legalize LA and Legalize Gay, both causes that bring them attention. Break the mold for good – The majority of employees at AA are immigrants who are paid more than twice the minimum wage and offered low-cost, full-family healthcare. (It’s unfortunate that 1,500 were illegal, but the CEO claims they used fake papers.) Defend your values tooth and nail. The CEO of American Apparel is unapologetic about his unorthodox polices, values and views, which adds further fuel to the fire. Of course some argue that the AA CEO is a sleaze ball who undermines all of his good. Others argue that his behavior is part of the brand’s DNA. Are they market leaders? Not when it comes to market capitalization. That title belongs to Burberry Group at $552.2 billion. But you wouldn’t know it if you watched the news. In 2008, the Guardian named American Apparel label of the year and in 2009 Time magazine named the CEO one of its finalist for most influential people in the world. My point is American Apparel went from a small clothing manufacturer in 2003 to a successful business in less than a decade because they were constantly in the press. You can usually compete with the big dogs if you figure out how to get a lot of press and buzz. Focus on the opportunity, not the market leader Another myth about market leaders has to do with market growth or saturation. For example, early this November comScore came out with data on US smart phone market. Here’s the data as a graph provided by Asymco: What should jump out at you immediately is the all the blue on the top of the graph. That stands for all the opportunity out there for getting smart phones into the hands of people who don’t use smart phones. In other words, it doesn’t matter who the market leader is. The game is far from over for newcomers. Good marketing means you look at what your competitor is doing, especially if he is the market leader, but you also look around them…you look for the opportunity that others are ignoring and, if it is there, taking advantage of it without having to take on the big guys. Thinking like a customer is essential It’s important to remember, however, that just because you are getting so much attention doesn’t mean you will be successful. Marketing rule number one is to solve your customer’s problems. You’ve probably heard this many times before, but it bears repeating…you must make a product that meets an obvious need. Over time I’ve developed a method when it comes to business and product development. It’s called the SIMPLE method: Simple – A successful product will take the guesswork out of how it satisfies a customer’s problems. Febreeze, for example, is simple…spray and kill odors. You get it immediately. Interesting – Furthermore, a successfully marketing product puts distance between it and other commodities by explaining what makes it different. All products are a commodity. The iPhone…it’s a commodity, namely a smart phone. But not just any smart phone. It’s got apps, Face Time and now Siri. Meaningful – But just because you figured out a problem to solve doesn’t mean you’ll be successful. The problem has to be meaningful. Look at Square, for example. It allows small businesses to easily collect payments via credit cards. Most of these small businesses will tell you they were losing money because they couldn’t take credit cards. Productive – Like being simple, a product that customers will like helps them do something they currently do…but faster, easier or even cheaper. In other words, the product doesn’t complicate the customer’s life, but offers a convenience. Long-lasting – A successful product will have longevity. It will provide a meaningful solution to a customer’s problem that will be more than just a fad. And it will go through multiple generations. Entertaining – This last point is important because it explains the popularity of sites like Facebook or video games, which everybody can argue are not productive ways to spend your time. However, they provide excitement and enjoyment, which is meaningful to you. I wish I’d thought of this method before I even started in business, but maybe I can help you avoid the mistakes I made and get successful in less time than I did by sharing it with you. Free advertising can be your best promotional tool. If you don’t have a lot of cash and you are trying to market your company online, don’t worry, as companies have been able to succeed without spending much money on marketing. This fact becomes apparent when you see that social media advertising spend will only be $4.4 billion or 7% of online ad spend by 2016. The reason is that to set up a social profile doesn’t cost anything and ongoing costs are low. When I was trying to grow one of my first businesses, Advice Monkey, I paid over $5,000 to three different companies to market it. Unfortunately I got zero results, so I decided I was going to learn how to do it myself. Here is a list of six marketing ideas I used that didn’t require a huge budget: Blog – By now it should be obvious that blogging is a great idea for generating traffic and attention. But I still run into entrepreneurs who dismiss it for one reason or another. SEO - A few companies that have leveraged SEO fairly well are About.com, Wikipedia, Craigslist, Amazon, and Zappos. And an example of a smaller company that has done this is Bargaineering, which was acquired by Bankrate for 2.8 million. Guest poster – An easy way to get your company out there is to write guest blog posts on other blogs. From TechCrunch to Huffington Post, there are thousands of popular blogs on the Internet. And the one thing all of these blogs want is more content. Speak at conferences – You don’t have to spend a lot of money travelling to regional conferences, but occasionally splurge and got to a national conference. You’ll get more exposure. Talk shit – People tend to pay attention when someone talks trash. For example, I once wrote a blog post on Like.com and how they were messing up with their marketing efforts. Shortly after that the CEO called and offered me consulting work. Do interviews – I cannot tell you how many times I simply emailed someone and asked if they would like to interview me. Blogs and media sources are always looking for content…and interviews are an easy way to get it. Check out this article if you want fifteen other big marketing ideas for your small budget. Social media can absolutely drive sales I pretty much jumped head first into social media when sites like Blogger, Twitter and Facebook came on the scene. However, it took me quite a while to figure out how to use them correctly so I could drive traffic and sales to my website. Did you that for every hour we spend on online, we spend about fifteen minutes of that hour on social media sites? This is according to Neilson: And did you know that about half of that time we are looking at products and services? The lesson is that if you want to build a sales relationship online, social media is your best bet. A good example of monetizing social media is Joie De Vivre, a California company that operates luxury hotels. Every Tuesday the company tweets exclusive deals to their nearly 13,000 followers who have only a few hours to act on deeply discounted deals. Joie De Vivre typically books over 1,000 room nights with these types of deals, rooms that might remain empty. Even large companies like Virgin use social media effectively. Richard Branson says that their approach to social media is with a healthy sense of fun and attractive offers. For example, the fourth highest sales day for Virgin America came when they tweeted, “$5 donated to KIPP Schools for every flight booked today.” Conclusion Some of these lessons may seem obvious, others not so. I know it took me a several years to figure them all out, but once I did, building successful business got easier and easier. This is not to say that if you follow these lessons above you will be guaranteed a successful business. You will improve your chances, however. What not-so-obvious marketing lessons have you learned during your years in business? About the author: Neil Patel is the co-founder of KISSmetrics, an analytics provider that helps companies make better business decisions. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Five Marketing Lessons That Took Me a Long Time to Learn"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Five Marketing Lessons That Took Me a Long Time to Learn"
    },
    {
      "level": "H2",
      "text": "Being the category leader is not the only way to be successful"
    },
    {
      "level": "H2",
      "text": "Focus on the opportunity, not the market leader"
    },
    {
      "level": "H2",
      "text": "Thinking like a customer is essential"
    },
    {
      "level": "H2",
      "text": "Free advertising can be your best promotional tool."
    },
    {
      "level": "H2",
      "text": "Social media can absolutely drive sales"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Neil Patel\n          \n            Neil Patel\n          \n            Neil Patel"
}