{
  "url": "https://moz.com/blog/the-best-seo-social-content-strategy-thought-leadership",
  "slug": "the-best-seo-social-content-strategy-thought-leadership",
  "title": "The Best SEO, Social + Content Strategy: Thought Leadership - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I'm constantly recommending thought leadership as a marketing strategy and, frequently, getting a lot of pushback. It started when I was a consultant, but continues to this day. It usually goes something along the lines of: Other Person: It's easy to be a thought leader in the fields you just…",
  "content": "The Best SEO, Social + Content Strategy: Thought Leadership Branding By: Rand Fishkin October 3, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 3, 2011 The Best SEO, Social + Content Strategy: Thought Leadership Branding The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I'm constantly recommending thought leadership as a marketing strategy and, frequently, getting a lot of pushback. It started when I was a consultant, but continues to this day. It usually goes something along the lines of: Other Person: It's easy to be a thought leader in the fields you just showed, but what are the rest of us ordinary businesses supposed to do? Me: Actually, I'm a strong believer that there's virtually no such thing as an industry or niche where thought leadership, interesting/share-worthy content and great inbound marketing can't work. Marketers said personal finance was boring until Mint. They thought online dating couldn't be a thought-leadership play until OKTrends. They said elevator installation couldn't have anything good, then Grant (an Australian firm) launched their great news section including awesome infographics like this one and earned #1 rankings for \"Home Elevators.\" Other Person: But those fields all have existing examples to draw inspiration from; I bet you can't name anyone in my particular practice of XYZ Me: That's the best part! If no one else has risen up to claim the mantle of thought leadership; it's an even greater opportunity. The early adopters in thought leadership and content marketing often receive a disproportionate quantity of attention from links, social media, press, etc. ROI may take elbow grease, time and patience, but if you find a way to earn the attention of the web, you have a chance to build a truly amazing brand. Other Person: There's no way we can invest that much energy and budget in thought leadership for marketing. We'd need to build a platform to host the content, we'd have to do design/artwork, we'd need to brainstorm and research the ideas, run them past layers of management for approval and Me: In five minutes, you can have a Wordpress installation running in a subfolder of your site. You can do the brainstorming and execution by yourself at first - let's dream up three ideas together right now; I bet we can do it. If you really need design work, look how Cyrus did it here (for under $500). If you can't get executive approval; create your own blog/site, show them the success you're having and then 301 it over. Other Person: Well, OK, maybe. Me: Louie, I think this is the beginning of a beautiful marketing story. Other Person: Umm... My name is Steve. Me: Oh. Sorry. I recently gave this talk on the Death and Rebirth of SEO at Webcam in Bend: The Death & Rebirth of SEO And right after the talk, had very similar conversations to the above with several folks in attendance. To be fair, I completely understand how challenging the process of building thought leadership on the web can appear. But when you get into it, it's fun, addictive and surprisingly effective. There's no better way, in my opinion, to create a great brand on the web and simultaneously supercharge your social media, SEO and traffic-growth than thought leadership. p.s. I've been enjoying a lot of shorter blog posts from folks like Brad Feld (whose post on thought leadership partially inspired this one) and Fred Wilson, so I thought I'd try my hand at slimming down my usual 1,000+ word count posts. Hopefully it's just as impactful/useful. Oh, and slide 65 in the deck above is a duplicate; sorry 'bout that. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Best SEO, Social + Content Strategy: Thought Leadership"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Best SEO, Social + Content Strategy: Thought Leadership"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Getting Buy-In for Customer Stories — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Local Brand Loyalty Takeaways From That Time Ace Hardware Was Trending"
    },
    {
      "level": "H3",
      "text": "How to Build a Strong Brand Moat With SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}