{
  "url": "https://moz.com/blog/the-finnish-seo-2006-market-watch-ceo-of-finnish-seo-company-caught-spamming-no-penalty-so-far-google-opens-country-office-etc",
  "slug": "the-finnish-seo-2006-market-watch-ceo-of-finnish-seo-company-caught-spamming-no-penalty-so-far-google-opens-country-office-etc",
  "title": "The Finnish SEO 2006 market watch – CEO of Finnish SEO company caught spamming (no penalty so far), Google opens… - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I know country specific posts are not of large interest, but since SEOmoz has European readers I decided to give a short rundown of what’s happening in Finnish (and Scandinavian) SEO markets this autumn.SEO is a hot topicSEO and internet marketing is finally catching fire in Finland – news articles…",
  "content": "The Finnish SEO 2006 market watch – CEO of Finnish SEO company caught spamming (no penalty so far), Google opens country office etc. Public Relations M By: mozUser1469147917838 October 3, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! M By: mozUser1469147917838 October 3, 2006 The Finnish SEO 2006 market watch – CEO of Finnish SEO company caught spamming (no penalty so far), Google opens country office etc. Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I know country specific posts are not of large interest, but since SEOmoz has European readers I decided to give a short rundown of what’s happening in Finnish (and Scandinavian) SEO markets this autumn.SEO is a hot topicSEO and internet marketing is finally catching fire in Finland – news articles are published every now and then, and some even break into the mainstream. That’s the front page, but on the back the situation is, IMO, still very immature and evolving. It is estimated that the annual total SEO business turnover in Finland will exceed 3 million euro (roughly 4 million US$) this year and should increase heavily for several years to come. 3 million euros sounds small, and it is. When you divide the turnover with the number of companies in the business (20+ pro-level agencies/consultants and hundreds of web design agencies), the outcome is very unpleasant. It's no wonder that most Finnish professionals actively seek out larger European and US clients and take very few local customers. Another growth trend for the future is related to Russian search markets, which are expected to become major players over the next few years. Like with any industry that’s booming, there are a plethora of growth-related issues. The concept of SEO services is really new to customers and even to most providers. There are issues of quality, pricing, etc. Google opens Finland country office Google has (finally) opened country office in Finland. The sad news is that it's merely a sales office at this point.I just recently read an interview of Johan Kinnander, Google’s Scandinavian Country manager, and my eye caught a statement of his:“Scandinavia is immature ground for internet search advertising compared to Great Britain or United States, tough Scandinavians are A-listers in broadband and internet search usage.”IMO this is a very precise notation of Scandinavian search behavior, but I can’t help wondering what makes this difference. Google has the search (and PPC marketing) dominance in Scandinavian markets, people use internet search very actively (if I remember correctly, Scandinavians are one of the most active search engine users in world), and the quality of SERPs is still relatively good (and people place perhaps too much trust with search engine results). CEO of Finland’s largest SEO company caught cloaking - no penalty so farThe headline says it all – the CEO of Total Management (Finland’s largest SEO agency), Mr. Poutiainen, was caught cloaking search engines with his personal test site. This is a rather interesting topic to follow as several search engines have recently declared their intentions to fight spam in languages other than English. So far there has been no penalty or statement from any of the search engines though this broke some major news in Finland and Scandinavian SEO circles.To quote Mr. Poutiainen (translated from original news article): “This is my personal site, not of my business… I use this site to test and study how search engines and bots behave [ADDITIONAL NOTE by 2K: “This is a non-commercial test website for search engine algorithm tests” statement was added on domain front-page few days ago, after 3+years of “testing”]… This testing model was taken from similar services from United States… Search engine spamming or misleading consumers in commercial sense has not occurred. I’ve created thousands of cloaked test pages – they are still running and I will create them in future too. Similar tests run constantly on different domains and languages”. Very bold words that raise the question of studying / testing black hat methods in real life SEO … Is there a need to test black-hat / unethical methods? And, if one wishes to study/test, how to do it without breaking any rules. Is this kind of behaviour acceptable in any scenarios?However, if Google and other search engines treat countries and pages equally, I would expect the test site and several other Finnish (and Scandinavian) sites to get penalized very shortly. The first Finnish book about SEO has been publishedInterestingly enough, it’s by the same person as above ;) As always, feel free to add your opinions and comments. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Finnish SEO 2006 market watch – CEO of Finnish SEO company caught spamming (no penalty so far), Google opens country office etc."
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Finnish SEO 2006 market watch – CEO of Finnish SEO company caught spamming (no penalty so far), Google opens country office etc."
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "mozUser1469147917838\n          \n            mozUser1469147917838"
}