{
  "url": "https://moz.com/blog/the-1-big-lie-about-shopping-cart-abandonment-you-probably-believe",
  "slug": "the-1-big-lie-about-shopping-cart-abandonment-you-probably-believe",
  "title": "The 1 Big Lie You Probably Believe About Shopping Cart Abandonment - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Is your eCommerce site plagued by shopping cart abandonment? If so, don't assume you know the real culprit behind the failed sales. You could be passing up a golden business opportunity your competitors are totally unaware of.",
  "content": "The 1 Big Lie You Probably Believe About Shopping Cart Abandonment Conversion Rate Optimization (CRO) | SEO Tools By: Angus Lynch October 31, 2014 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Angus Lynch October 31, 2014 The 1 Big Lie You Probably Believe About Shopping Cart Abandonment Conversion Rate Optimization (CRO) | SEO Tools This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Raise your hand if you’ve ever asked yourself these questions: \"If only our website checkout process was 1 step shorter.\" ‘\"If only our call-to-action button was a different color.\" \"If only we could present shipping costs in a different way.\" Sound familiar? If so, you have shopping cart abandonment issues. You’re not alone. The Baymard Institute states that 67.89% of online shopping carts are abandoned across the web. And if you’re like most online retailers, you probably address the problem by:Making sure to disclose your shipping costs early Reducing the steps in your checkout Making your forms clear and simple Making sure your call-to-action ‘pops’ These are all steps every marketer should take with their virtual cart. The problem is, they only address half the issue. Here’s another problem: many bloggers, toolmakers and marketers have latched onto this 67% cart abandonment rate, and they use it to tell one big lie: \"If your cart abandonment rate is 67%, you’re losing out on 67% of your sales.\" This statement is simply not true, as it falsely assume every user who adds an item to a virtual cart initially had a definitive intent to buy. But as we’ll find out in this post, roughly 30-40% of visitors who add items to carts are merely expressing interest in your products, not commitment. In this post, I’ll discuss:Why online retailers need to reframe their approach to shopping cart abandonmentHow to market to casual cart abandoners, who add items with only a loose commitment to buyWhy they 'abandon,’ by the numbers Most of us think cart abandonment results from breakdowns in the checkout process, but that’s only half the story. Check out the top six reasons for cart abandonment according to Savvy Panda: The top six reasons shoppers abandon virtual carts, as per Savvy Panda’s research Two of the top four reasons for abandonment have nothing to do with the cart itself. Rather, they have to do with the shopper expressing only passing interest in the product. We call this type of user a casual abandoner. And data from other sources confirms their prevalence. Here are Shopify’s findings on cart abandonment: Image Source Here's a graph from Forrester’s North American Technographics survey: Image Source Looking at the graphs sideby-side, we see that casual abandoners (identified by orange arrows) make up somewhere in the range of 30-40% of total abandoners. So why are so many users treating the cart as a mere expression of interest in a product? Shouldn’t a cart add signify definitive intent to buy? To find out why, we have to look at the motivations of online shoppers. Here are two groups of users who are likely contributing to this phenomenon:Group 1: Hedonic shoppers Research tells us that shoppers have two primary motivations: hedonic and utilitarian. Utilitarian shopping is driven by what we need—the necessities of life—like groceries, clothing and household items. Hedonic shopping is driven by the perceived enjoyment of the shopping experience itself. And since the experience is what they desire, hedonic shoppers don’t need to complete the purchase to gain satisfaction. Mark Arnold and Kristy Reynolds lay out the six categories of hedonic shopping in their 2003 paper, “Hedonic shopping motivations.”Adventure shopping Gratification shopping Social shopping Idea shopping Role shopping Value shopping To fulfill their desire for the shopping experience, hedonic shoppers frequently fill and abandon virtual carts without completing a purchase.Group 2: Comparative shoppers A second group contributing to bloated cart abandonment rates is what we call comparative shoppers. Comparative shoppers add items to carts in order to 1) conduct price comparisons and 2) bookmark items for laterer consideration. Several prominent papers on online consumer behaviour back this up:In Shopping Cart Abandonment at Retail Websites, Shibo Li and Patrali Chatterjee contend that placing items in a virtual cart is merely part of the consideration stageIn Consumer patronage and risk perceptions in internet shopping, Sandra Forsythe and Bo Shi argue that we use the web more as an informational resource than as a purchasing toolAnd in Why We Don’t Buy, a study by Bronto Software and Magento, it was determined that up to 38% of frequent shoppers “always” use the virtual cart to save items for later Findings on cart use as a bookmarking tool from Why We Don’t Buy So with all signs indicating that bloated shopping cart abandonment rates are due to the motivations of shoppers themselves—and not the functionality of the cart—you’d think site owners would have clued in, right? Wrong.Online retailers are treating cart abandoners all wrong Given the numbers we’ve looked at in this post, the term “cart abandonment” feels inadequate. After all, how can shoppers “abandon” something they were never committed to in the first place? But despite these findings, many site owners are treating cart abandoners with tunnel vision: instead of looking at an abandoned cart as a strong sales lead, they’re treating it is as a lost cause. According to SeeWhy, roughly 81% of online merchants believe abandoners are a total waste of time. Image Source And their inaction speaks to this. BizReport states that 80% of retailers fail to send triggered emails to prospective customers after cart abandonment. All this despite the fact that the same SeeWhy study shows 75% of new visitors abandon with intent to return at some point. Perhaps site owners worry customers will think emails will be unexpected— intrusive even? Well that’s not how shoppers see it, and more figures from Why We Don’t Buy back this up. According to the study, 47% expect to receive some type of reminder email after they abandon a shopping cart. If you were to offer any salesperson a pool of qualified sales lead in which 47% were expecting to hear from them, they’d be on it like a pack of wild dogs. And on the web, the opportunity should be treated the same. Most telling of all is this next figure from Why We Don’t Buy, which tells us that almost a third of cart abandoners would likely complete their order after receiving a notification. Image Source In this context, I propose reframing your approach to the issue. Rather than seeking to reduce your \"shopping cart abandonment\" rate, seek to increase your shopping cart retention rate. Grab a slice of the 30-40% of shoppers who express interest in your products through the cart. In other words, treat shopping cart abandoners just as would any other hot sales lead: stay in contact with them by any means possible. Of course, to do this you’ll need to equip yourselves with tools for the job.The tools you need to convert cart abandoners You need to stay in contact with cart abandoners. Period. And since 77% prefer marketing messages to come straight to their inbox, email is the best way to do it. Period. The good news is you’ll be hunting on fertile ground, since we’ve already established that:47% are expecting your message 32% will likely take action after receiving your message 80% of your competitors aren’t sending cart abandonment emails And if the rule of 7 teaches us anything, following up with this group of prospects will spur a series of interactions with your brand, creating a purchasing journey, if you will. There are two things you will need to follow up with these prospects: 1) A series of cart abandonment emails, and 2) tools for collecting email addresses from cart abandoners. The content that should go in your cart abandonment emails is the topic for another post, but here are a few quick guidelines:Stress the value of your offer to appeal to price-sensitive customersUse a good dose of urgency (limited supply and/or time-sensitive)Make sure the email is readable on mobile devicesBe prompt; sending the email within one hour of abandonment is advisable The main trick is building your email list, and you’ll need tools to make that happen.1. Checkout recovery tools Checkout recovery tools like AbandonAid and Rejoiner help to grab email addresses during the checkout process. They do this moving the email form in your cart to the forefront, and then using cookies to make sure the user’s email address is saved–even if they abandon the cart. The Rejoiner dashboard One big advantage of checkout recovery tools is that they come with the benefit of having built-in email capabilities for setting up triggered follow-ups. And since cart follow-ups are most effective when sent within one hour of abandonment, this is a very handy feature. One disadvantage of using cart abandonment tools is that many users drop off in between a) adding items to the cart, and b) filling in their contact information. Without an email address saved, there’s no way to follow up. Action Item If you're considering using checkout recovery tools as a tactic for increasing shopping cart retention, Rejoiner has a great collection of resources for eCommerce professionals. As a primer, I would recommend reading The Cart Abandonment Equation, a free ebook that's written specifically for marketers who haven't tried this technology before. Cart recovery tools are subscription services that typically cost anywhere from $50 to $500 per month, depending on your traffic volume. Whether those numbers work for you depends on your situation; but for most eCommerce sites, that's a pittance compared to what can be recovered from abandoned carts.2. Exit-intent technologyUsing a new technology called exit-intent is another great tactic for converting more cart abandoners. Exit-intent technology monitors visitor activity as users browse your product pages and add items to the cart. The technology is specifically designed to identify abandoning visitors, so when a user begins to abandon your cart, it activates an exit overlay designed to engage the user. An exit overlay from BabyAge.com, activated when the user begins to abandon their shopping cart Exit overlays work for staying in contact with cart abandoners because they a) can be targeted to shopping cart pages specifically and b) only activate when the user is about to abandon the cart. Exit overlays are often used to offer deals, resources or other benefits to customers in exchange for contact information, as per the example below: Example of an exit overlay at XeroShoes.com, launched when the user begins to abandon the page The technology can segment abandoning users into different groups, such as traffic source, user behaviour (first-time vs. returning visitors) and, of course, cart abandoners. Two advantages to using exit-intent are provided by exit overlays. They 1) incentivize the user to submit their email address and 2) can activate at any point during the browsing session—not just after a user has entered contact information—as per the graph below: Action Item Increasing cart retention is just one of many ways exit-intent technology can help you improve the performance of a website. Like checkout recovery, exit-intent tools are usually monthly subscription services. Plans typically cost between $50 and $500, and there are more expensive services that offer a more consultative approach (such as handling the copywriting and design work for the exit overlays). Again, the option that works for you depends on your situation. Since exit-intent is a newer technology, resources are more scarce. However, Kissmetrics recently published an article (with case studies) outlining how the technology works. A similar article also appeared on Entrepreneur.com.TakeawaysRoughly 30-40% of shoppers who fill your shopping cart do so without definitive intent to buy your products; instead, they are merely expressing interest These \"casual\" cart abandoners are valuable sales leads that should be pursued. However, 80% of retailers are not sending triggered emails after abandonment. Using checkout recovery tools and exit-intent technology are smart tactics for converting your cart abandoners Used in tandem, checkout recovery tools and exit-intent technology can form a formidable duo for chasing down and converting the many valuable leads that come through your shopping cart Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The 1 Big Lie You Probably Believe About Shopping Cart Abandonment"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The 1 Big Lie You Probably Believe About Shopping Cart Abandonment"
    },
    {
      "level": "H2",
      "text": "Why they 'abandon,’ by the numbers"
    },
    {
      "level": "H3",
      "text": "Group 1: Hedonic shoppers"
    },
    {
      "level": "H3",
      "text": "Group 2: Comparative shoppers"
    },
    {
      "level": "H2",
      "text": "Online retailers are treating cart abandoners all wrong"
    },
    {
      "level": "H2",
      "text": "The tools you need to convert cart abandoners"
    },
    {
      "level": "H3",
      "text": "1. Checkout recovery tools"
    },
    {
      "level": "H3",
      "text": "2. Exit-intent technology"
    },
    {
      "level": "H3",
      "text": "Takeaways"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Ensure Your Organic Traffic Actually Drives Revenue — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How Our Website Conversion Strategy Increased Business Inquiries by 37%"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Angus Lynch\n          \n            Angus Lynch"
}