{
  "url": "https://moz.com/blog/the-things-you-didnt-know-you-didnt-know",
  "slug": "the-things-you-didnt-know-you-didnt-know",
  "title": "The Things You Didn't Know You Didn't Know - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Oh, perspective. It's a fantastic human characteristic that, among other things, lets us compare how we once felt with how we feel now. When I began working at SEOmoz, I was aware that, in comparison to many people, I knew \"a lot\" about the series of tubes some call the internet, but far less than…",
  "content": "The Things You Didn't Know You Didn't Know Moz News By: Jane Copland January 17, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jane Copland January 17, 2007 The Things You Didn't Know You Didn't Know Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Oh, perspective. It's a fantastic human characteristic that, among other things, lets us compare how we once felt with how we feel now. When I began working at SEOmoz, I was aware that, in comparison to many people, I knew \"a lot\" about the series of tubes some call the internet, but far less than I'd soon know. Here are some of the lighter-hearted things I've learned since September 18, 2006. Finding something online is easy. Reading the minds of people who find things online is not. I had no idea how many different ways people can come up with to search for, say, \"cheap running shoes\". Along the same lines, I did not realise that many people, including myself, talk to search engines in very strange ways. Why, when correct usage is \"buy cheap running shoes\" do we search for \"shoes running cheap buy?\" The plagiarism speeches throughout college weren't just good for your character. They weren't just good for avoiding expulsion and lawsuits. They exist because Google says \"no\" to Ctrl+C, Ctrl+V. Spelling eludes a large percentage of the population. Actually, this is out of place. This, I already knew. What I really didn't know is that because spelling eludes a large percentage of the population, you have the opportunity to learn scores of different words' misspellings. Does anyone need cheep running shoes? Apparently, they do. Basic HTML is not scary. You do not need to copy and paste whenever you have to write something that begins with <a href... My interview-stage blog submission was too long and essay-like. So was Scott's. Some links are Benjamins. Some are Washingtons. Some are pennies that, even after a year, a whole collection of them will only get you a couple of bucks at CoinStar. It isn't hard to tell the difference. The client is always right, until the client is wrong, and then Matt gets mad. It was a thoroughly good idea to reply to a Craigslist posting titled \"Do You Use Your Powers for Good... Or for Awesome?\" Of course, there's a lot more I've learned in the past four months, but these are some of the ones I didn't expect. In four months time, I'll look back and see what more I've learned! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Things You Didn't Know You Didn't Know"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Things You Didn't Know You Didn't Know"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jane Copland\n          \n            Jane Copland"
}