{
  "url": "https://moz.com/blog/the-word-wikiality-courtesy-of-mr-colbert",
  "slug": "the-word-wikiality-courtesy-of-mr-colbert",
  "title": "The Word - Wikiality (Courtesy of Mr. Colbert) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Oilman pointed to this first, so he deserves the link credit. Bravo, Todd - your taste in entertainment makes me an even bigger fan than before.\nLike Todd, I watched this segment last night and couldn't help but think how plugged in Colbert's staff must be to the Web 2.0 world. Unlike so many…",
  "content": "The Word - Wikiality (Courtesy of Mr. Colbert) Social Media By: Rand Fishkin August 2, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 2, 2006 The Word - Wikiality (Courtesy of Mr. Colbert) Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Oilman pointed to this first, so he deserves the link credit. Bravo, Todd - your taste in entertainment makes me an even bigger fan than before. Like Todd, I watched this segment last night and couldn't help but think how plugged in Colbert's staff must be to the Web 2.0 world. Unlike so many parodies of Internet trends, I was surprised to see a gaffeless, accurate and needle-sharp skewering of Wikipedia. Watch for yourself: Brilliant, no? I admit - sometimes I actually enjoy Colbert even more than the Daily Show. And, no offense to Mr. Cutts, but this is my kind of video... Maybe we could have Webguerrilla and Oilman do their own \"Word\" segment on the right hand side of Matt Cutts' videos - I'm laughing just thinking about it. Update: Newsvine has good coverage of the events that followed, including Mr. Colbert's banning from Wikipedia. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Word - Wikiality (Courtesy of Mr. Colbert)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Word - Wikiality (Courtesy of Mr. Colbert)"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}