{
  "url": "https://moz.com/blog/the-clients-i-cant-afford-to-take",
  "slug": "the-clients-i-cant-afford-to-take",
  "title": "The Clients I Can't Afford To Take - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This is a post about how to choose better clients. It starts with introspection, and ends with a connection. For each of these tips, I’m thinking specifically of a client I let walk away. If a strong partnership is what you seek, then you have to be able to decline potential clients. The customer…",
  "content": "The Clients I Can't Afford To Take SEO Consulting By: Bill Sebald May 10, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Bill Sebald May 10, 2013 The Clients I Can't Afford To Take SEO Consulting The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Creating demand where none currently exists is the expertise of a bullshit artist. Some in sales would take offense to that statement; some would agree. Where I believe this talent fails is with a particular kind of recurring revenue service – consulting and agency work. Inevitably you run out of steam and alibis. If you can’t produce what you promise, you either have to pack up your wagon and flee to another dusty town (which, let’s face it, is how some SEOs and digital marketers practice), or suffer sleepless nights worrying about facing your clients in the morning. Personally, I don’t like traveling. I also really like my sleep. This is a post about how I choose better clients. It starts with introspection, and ends with a connection. For each of these tips, I’m thinking specifically of a client I let walk away. If a strong partnership is what you seek, then you have to be able to decline potential clients. The customer is not always right. Sometimes they’re downright dangerous. Now, I know this isn’t possible in every company. An agency I worked with rarely says no to work. Bad clients pile on and contribute to driving away employees in routine mass departures. When I was worked there relationships got contentious, and frankly, I didn’t see a lot of flawless consulting happening. The phrase we used around the office to convince ourselves this was normal was, “that’s agency life.” I came to learn that wasn’t agency life. To remind ourselves of some of the marketing ideologies we learned in college; most retailers employ the marketing department philosophy, whereas search fits the marketing concept. In SEO marketing we want to answer the searches being made more often than any other task, which may not fit nicely into a clients’ ROI demands. Luckily, this is something we can get ahead of with early, open communication with the prospect. Sometimes you're able to reset expectations, sometimes not (where I kindly refer them to someone more of their mindset). It's important to ask goal-oriented questions here, and give a real thought to what you're positioned to achieve. What do they consider success? Does it match your beliefs? Have they had SEO before, and what were their frustrations? Are you better for them? Can you help them help you help them? If you can truly embrace what you are as a service provider, and nurture deals accordingly, you’re in a very fortunate position. If you can perform SEO under the auspice of what is required for the client, instead of what the client thinks needs to be done, you’re well on your way to a successful partnership. Clients I Avoid Sometimes you need to cut the line before you reel in the catch. Once the catch breaks the water line, do you see a snagged horseshoe crab? Cut it. Did you pull in flounder? Invite me over for dinner. I’m a student of psychology and naturally think I size people up pretty well. There are basically three traits (or character flaws) that I am on high-alert for. As soon as I hit one, not only do I feel compelled to be reserved, but I close up – sometimes prematurely. Here are some of the personality types I avoid, and some tips on uncovering their true identities. (Caveat: First impressions aren’t always accurate. First impressions should not the last chance to make a good impression. It’s very easy to misread people. I do keep that in the back of my head, just to balance me out.) The Egomaniac Some prospects may want to impress you. Sometimes they routinely impress themselves. Personally, I find them awfully hard to communicate with. You know the traits – they ask you questions only to cut you off and answer themselves. They are micro-managers. They brag incessantly about their past experiences. They believe they’re the only one that can truly defeat Superman. They’re the type of person to say, “I didn’t get to where I am by not speaking up.” While on paper that sounds like a good trait, these can also be the people who have trouble accepting someone else’s expertise. They may not see the value of your otherwise salient recommendations. They tend to only respect other egomaniacs But sometimes this is a front. Sometimes the egomaniac is socially awkward. A good skill in business is recognizing emotions, character flaws, and humanity when it really exists. Sometimes the egomaniac thinks he needs to be a killer. I have seen this disguise many, many times in my career. I remember a client who managed to take down an entire marketing department with a previous agency. He was a product of a big name business advisor firm (name left out to prevent lawsuits) and drove some of my co-workers into therapy – honestly. There may have been no pleasing him, but the powers that be refused to cut ties. We weren’t able to do what we knew was best; we ultimately became an order taker for someone who wasn’t an expert in our field, but thought he was. This guy may truly be a serial killer at large. Alternatively, I recall meeting with a prospect that ran an unimpressive ecommerce business. During the initial meeting I found myself listening to an hour long diatribe about him and how he shaped the company into what they are today. Interesting and something worth knowing in detail down the line, but I was there to talk about how I could help with their SEO. After finally asking two questions, in which I maybe got three words out, it was pretty clear this wasn’t going to be a productive meeting. Still, I stayed with the pitch process. Fortunately I made the right move, as this marketing director turned out to be more bark than bite. We’ve had a pretty successful three year run together, once the pretences went away. I need a point person I want to spend time with. If the real soul of the point person and company can’t be lured out quickly, it may be a dead deal for me. What to Do Embrace the company culture and team’s personality. Try to be yourself, not who you think they want you to be. Ultimately you want a partner and a friend, not just a client and paycheck. If you don’t have an egomaniac account manager, this relationship could go down in flames. Make it personal, but don’t take it personally. I always try finding something in common with the prospects. It’s a sales tactic for sure, and an ice breaker, but I find it useful to quickly peel back the personality layers. I try to see who they really are. I remember a client pitch where I learned the CMO was in a Philly band. Knowing the band, and playing music myself, we were able to connect on a non-business level. I know this is a crazy concept for some agencies that prefer to be more formal, but It really helps you understand the personality and temperament of the people you’re going to be working with. Maybe it’s not your call to accept or deny the egomaniac, micro-managing client. In some cases you can still make it work. Communication (and some good habits) can go a long way in getting the client to bond with you, without you throwing away any integrity. We’ve all had a micro-managing boss at one time in our lives. Take some learnings from that experience. There are plenty of great tips online for that problem that can be leveraged with a micromanaging client: http://blogs.hbr.org/hmu/2011/09/stop-being-micromanaged.html http://www.thedailymuse.com/career/how-to-manage-a-micromanaging-boss http://michaelhyatt.com/micromanager.html http://nahidc.blogspot.com/2008/07/how-to-deal-with-micromanaging-boss.html The Dictator Some clients (think they) know exactly what they want. That can be a good thing. Sometimes though, they don’t want it the way you deliver it. It’s vital to know when you simply can’t deliver. How can you under-promise and over-deliver if you aren’t structured to meet their simplest expectations? Have you ever gotten a hamburger right at McDonald’s when you told them to make it special? No – it’s impossible. The employees have panic attacks behind the grill. It’s not how McDonald’s is built. I had one prospect reach out to me about six months ago. We had worked together in a small capacity before. He told me precisely what he was looking for – he required someone to manage a department that needed to communicate with the Sydney office at 6 am, and required I hit a certain goal each month. This was a goal I not only didn’t believe was reasonable, but probably impossible (not to mention the only time I’m up at 6 am is when I haven’t fallen asleep yet). My services aren’t excessively flexible by design – I simply can’t answer all the demands of most dictators. My services have a specific design with defined specialties. I know my team’s strengths and weaknesses. I know my plan in and out, and would have struck out with his needs. I had to face the facts and let that prospect go, even though it was a nice payday. What to Do Try to break the “we’ll take anything” model. That’s how people get hurt – including your employees. A client’s SEO and digital marketing need has become ubiquitous. Maybe they’ll be open to your specialized take on their business? Never over-promise. Never wear a hat you don’t own. Stay calm. SEOs are in a great position already, with a great inherent value. Sometimes there are other providers who can do a better job than you in a certain area, so why not let them? Build some relationships between other service providers and create “friendly-competition”. When a client says \"I want this,\" say \"we do this.\" Keep it professional and offer to help them find someone who fits their model. This may create serendipity and good karma. I’ve actually gotten referrals from prospects I’ve turned down. Not often, but it’s the magic of networking, relationships, and good deeds. Never underestimate the power of serendipity: https://moz.com/rand/manufacturing-serendipity/ http://www.openforum.com/articles/8-ways-to-cultivate-serendipity-in-business-and-life/ http://www.greenlaneseo.com/blog/2012/09/creating-your-own-seo-serendipity/ The Negotiator It’s great to be on the payer side of negotiation. I find negotiating deals quite fun. But when the tables are turned, and I’m the service provider, I flex very little in price. It’s less because I’m a jerk and more because of my respect for my work and values. Wharton grads are taught to believe in what they’re worth; anything less and you’re potentially softening the product. When a client tells me his budget is X, and I need it to by upwards around Y, the negotiation needs to stop. This was a huge lesson I learned after years of thinking about cash flow, and not quality of life. I recently had a prospect that came to me and asked if I was available for consulting. As I always do, I brought up the budget question early on. He said, “I can spend about $300 a month.” Now I know some SEOs can stretch that and get rankings. I’m always impressed by these guys, but at that rate, I would fall on my face (and my sword). I’d fail at providing the only values I know how to create. I’d be scrambling to get good work done, and in the end, it would probably not be worth the aggravation after taxes. Still, I tried to help him find someone who was better suited, while advising that his monthly fee was more likely to attract amateurs that might cost him more in the end. He was able to come up a little and I was able to refer him to another local SEO who fit his needs much better. Again, investing in serendipity. I can’t say this enough - Take a bad deal financially and you will pay for it. I’ve never seen a need to pad the price for negotiation in our industry. We’re not selling used cars here. What to Do Don’t budge unless you’ve priced yourself out of the market. Also, don’t risk putting yourself in a bad relationship because you settled. It doesn’t tend to work out in marriage, government, or business. Clearly display all the items a client could be getting in an engagement with you and encourage the prospect to see the value if they “pay up” instead of going with an amateur. If you have a price you’re proud of, then you should also have results and confidence to stand behind. Some agencies find it very difficult to talk about money, as it gets slipped in as a line item at the back of a proposal. These proposals are often written after hours of conversations. I propose you bring the money conversation early to qualify your prospects. I go so far as put my rates and packages right on my website and always encourage my prospects to review those pages in an introductory email. I don’t like wasting hours on a deal that was never meant to be. I’ve found this to be a very positive technique to getting deals signed quickly, as some clients prefer the openness and honesty. Not everyone likes haggling, and will happily pay a price when they know it’s fair. Conclusion Sometimes a bad client can teach you how to be a better consultant, but I don’t wish a bad client upon anyone. In my 10+ years of consulting, I’d like to think the lessons I learned (some of which I’m sharing here) can really be learned through some tough and common sense. Agencies are busy places, but you need to take time (off-sites work nicely) to really figure out what your service model is. Whether it’s from the top down, or just your specific department, having a thought out manifesto on the clients you’re not going to take could be transformational to the success of your consulting business. Oh, and if by chance you encounter a hybrid of all these client-types above, the only tip I have is… flee. I’ve yet to find any way to tame this three-headed egotistical, dictating, negotiating creature. That’s schizophrenia on a level I can’t even comprehend. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Clients I Can't Afford To Take"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Clients I Can't Afford To Take"
    },
    {
      "level": "H2",
      "text": "Clients I Avoid"
    },
    {
      "level": "H3",
      "text": "The Egomaniac"
    },
    {
      "level": "H3",
      "text": "What to Do"
    },
    {
      "level": "H3",
      "text": "The Dictator"
    },
    {
      "level": "H3",
      "text": "What to Do"
    },
    {
      "level": "H3",
      "text": "The Negotiator"
    },
    {
      "level": "H3",
      "text": "What to Do"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Sins of an Agency: Parting Ways With Our Biggest Client"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "8 Prep Steps for Better Local Business Client Meetings"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Bill Sebald\n          \n            Bill Sebald\n          \n            Bill Sebald"
}