{
  "url": "https://moz.com/blog/the-best-of-2013",
  "slug": "the-best-of-2013",
  "title": "The Best of 2013: The Top Posts and People on the Moz Blog - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "On the last day of 2013, we bring you a roundup of the year's top posts (based on several metrics), the top comments from community members, and the most active commenters on the blogs. Happy New Year!",
  "content": "The Best of 2013: The Top Posts and People on the Moz Blog Moz News By: Trevor Klein December 31, 2013 Table of Contents Copied! By: Trevor Klein December 31, 2013 The Best of 2013: The Top Posts and People on the Moz Blog Moz News Continuing what has become an annual tradition at Moz, on the last day of 2013 we're excited to bring you a roundup of the very best of this year's posts on the Moz Blog and YouMoz. After asking Roger to work overtime to crunch these numbers, we've whittled the posts down to the cream of the crop, and have organized them in several different ways: The top Moz Blog posts by unique pageviews The top YouMoz Blog posts by unique pageviews The top Moz Blog posts by number of thumbs up The top Moz Blog posts by number of comments The top Moz Blog posts by number of linking root domains The top comments from our community by number of thumbs up The most active community members by number of comments posted This year's data was more difficult to collect, as we migrated to our new domain in May. My eternal gratitude goes to Cyrus Shepard for helping make sure the right numbers were pulled. Top posts by unique pageviews One of the quintessential metrics for a piece of content is its number of unique pageviews. Reflecting our audience's thirst for advanced SEO, content marketing, and data analysis, these posts were winners from the very beginning. 1. 10 Tools for Creating Infographics and Visualizations February 6 - Posted by Miranda Rensch Communicating visually is one of the most effective ways to explain complex concepts and relationships, both internally with your teammates and externally with your clients. Our very own Product Manager, Miranda Rensch, offers a list of tools you can use to create beautiful visualizations and let your visual communication skills shine! 2. A Visual Guide to Keyword Targeting and On-Page Optimization August 6 - Posted by randfish As the \"O\" in SEO has broadened in scope, the most effective elements of on-page optimization have changed. While there is arguably no \"perfectly optimized page,\" this update to a 2009 post provides a comprehensive guide to steer you in the right direction. 3. The Web Developer's SEO Cheat Sheet 2.0 August 29 - Posted by DannyDover It is my honor and privilege today to introduce the brand new version of The Web Developer's SEO Cheat Sheet. This free and downloadable cheat sheet covers all of the important SEO code and best practices that are needed by online marketers and developers. 4. How to Rank: 25 Step SEO Master Blueprint May 14 - Posted by Cyrus-Shepard If you’re like most SEOs, you spend hours each week reading the latest SEO tactics and search engine tidbits. We spend hours learning, but does 90% of it change what we actually do - that is, the basic work of ranking a web page for search? To lend a hand, let me introduce the 25 Step SEO Master Blueprint. 5. Amazing Correlation Between Google +1s and Higher Search Rankings August 20 - Posted by Cyrus-Shepard This year's Search Ranking Factors Study showed a very strong correlation between Google +1s and higher rankings, and there's a compelling reason why. Google+ was built for SEO, and is far better optimized for search than other platforms. 6. Holy Grail of eCommerce Conversion Optimization - 91 Point Checklist and Infographic January 24 - Posted by CueBlocks.com Invest in building filthy rich user experience, consistently and throughout your store. That is what stores with deeper pockets (like ASOS, Zappos, and JCPenney) do to achieve better conversion rate than your store. This article will take you away from usual Search Engine Optimization stuff to where the real money lies - Conversion Rate Optimization. What you do with the visitors you bring to your website? 7. 2013 Search Engine Ranking Factors July 9 - Posted by Matt Peters The results are in! Come check out Moz's 2013 Ranking Factors as Matt Peters presents a preview of the results from the survey and correlation study. 8. Goodbye SEOmoz. Hello Moz! May 29 - Posted by randfish For the last two years, the 130+ Mozzers across product, engineering, marketing, and operations have been working to transform this company to the next stage of our evolution. Today, that incredibly demanding, intense, but ultimately rewarding process has reached its first goal. I'm excited to announce that as of today, SEOmoz is formally transitioning our brand, our products, our company name, and all of our efforts to Moz. 9. The 100 Best Free SEO Tools & Resources for Every Challenge - Interactive July 31 - Posted by Cyrus-Shepard At Moz, we love using premium SEO Tools. Paid tools are essential when you need advanced features, increased limits, historical features, or professional support. For other tasks, a free tool does the trick. Here you'll find a collection of the 100 best completely free tools, tools with both free and paid options, and free trials. 10. When Keyword (not provided) is 100 Percent of Organic Referrals, What Should Marketers Do? - Whiteboard Friday September 24 - Posted by randfish The rate at which Google is lumping keywords into \"(not provided)\" has skyrocketed in the last month, leading to a huge drop in referral data and speculation that 100% of keywords will soon be masked. In this special Whiteboard Tuesday, Rand covers what marketers can do to make up for this drastic change. Top YouMoz posts by unique pageviews We saw some real gems come through the YouMoz queue this year. Most of these posts were promoted to the Moz Blog shortly after they were published, as their resonance with the Moz community was readily apparent. 1. Holy Grail of eCommerce Conversion Optimization - 91 Point Checklist and Infographic January 24 - Posted by CueBlocks.com Invest in building filthy rich user experience, consistently and throughout your store. That is what stores with deeper pockets (like ASOS, Zappos, and JCPenney) do to achieve better conversion rate than your store. This article will take you away from usual Search Engine Optimization stuff to where the real money lies - Conversion Rate Optimization. What you do with the visitors you bring to your website? 2. 96 Quick SEO Wins - What Can You Do With an Hour? January 31 - Posted by kevingibbons If you want to win at SEO in 2013, you must commit to a solid long-term strategy. However, that's not to say you can't build small wins into your long-term strategy to strengthen it along the way. Here are 96 quick wins you can implement in an hour or less to see tremendous results. 3. The Ultimate Guide to Advanced Guest Blogging January 21 - Posted by Pratik.Dholakiya With \"content marketing\" being the indisputable SEO buzzword of 2012, we can expect 2013 to see an onslaught of marketers trying to build links with guest posts. The growth in this market will cause some sites to lower their guest posting standards, others to raise them, and still more to stop accepting them altogether. We're going to help you combat this by sharing how we got posts up on ProBlogger and Search Engine Journal, and by introducing you to our strategy for success with our clients. 4. 33 Link Building Questions Answered April 4 - Posted by Rhea Drysdale When it comes to link building idea generation, the sky's the limit! In today's post, Rhea Drysdale offers her tips for best practices and a philosophical approach to link building that will help bring your ideas to life. 5. Post-Penguin Anchor Text Case Study January 15 - Posted by Court Tuttle It's no secret that Google's Panda and Penguin updates caused a lot of panic. Although I'm pretty turned off to information about these updates, I've been really interested in the anchor text issues surrounding the Penguin update. If sites that have over-optimized anchors lost traffic due to the update, it seems to make sense that sites can move up with relatively few (or without any) anchored links. I wanted to test that idea and decided that it was time for a good, old fashioned case study. 6. 5 Lessons Learned from 100,000 Usability Studies August 28 - Posted by Phil Sharp As helpful as analytics can be, they simply can't give as complete a picture as usability studies. This post walks through five of the most important lessons we've learned after performing hundreds of thousands of those studies. 7. How to Build Links to Your Blog - A Case Study June 4 - Posted by MatthewBarby After a month or so of development, my site was finally ready and I wanted to start thinking about how to get some traffic going on the website. Whilst paid advertising and social media were a huge part of the strategy, I knew that appearing in the search engines for a wide selection of long-tail phrases was going to be instrumental to the blog's success. This is when I began developing my link building strategy and, after trialing out some very successful approaches, I've decided to now share my link building tactics with you all. 8. How to Build a Great Online Fashion Brand - 34 Things that Really Amazing Fashion Retailers Do May 30 - Posted by ILoveFashionRetail.com Despite the title, we believe this article can also benefit and inspire retailers in industries outside fashion and help them find their way to success in online retail business in this new social commerce environment. The Online Fashion Retail Industry, particularly at the luxury end, seems to be doing well. Over the past few years, lot of money has been invested into fashion retail businesses. Valuations of these companies might seem inflated, but these companies are growing fast with the help of clear revenue stream and a value proposition that’s beyond price advantage. But while some companies in Fashion technology are successfully raising more money and growing, there is another segment that’s struggling to survive. These businesses are stalling because of their ability to adopt to the shift in the media consumption behavior of the consumer. 9. How To Blog Successfully About Anything January 9 - Posted by TannerC In order to create a successful blog, you must be passionately curious about the topic you're covering. Learn how to turn even the most uninteresting blog post topics into goldmines with these tips for successful bloggers. 10. Semantic Web and Link Building without Links > The Future for SEO? January 10 - Posted by simonpenson Rand’s recent WBF about co-occurrence was a real wake up call for those still transfixed with link building practices of old. While anchor text based links may still have some effect, there is little arguing the fact that the factor’s importance is dwindling. In its place are things like social signals, link age, and, most importantly, a growing reliance on relevancy and how that is deciphered. Top Moz Blog posts by number of thumbs up While something of a controversial metric, there's nothing more satisfying for an author (or, I admit, for a publisher!) than seeing a bunch of thumbs up. These posts went far beyond satisfying, though, garnering jaw-dropping numbers of thumbs up. 1. How to Rank: 25 Step SEO Master Blueprint May 14 - Posted by Cyrus-Shepard If you’re like most SEOs, you spend hours each week reading the latest SEO tactics and search engine tidbits. We spend hours learning, but does 90% of it change what we actually do - that is, the basic work of ranking a web page for search? To lend a hand, let me introduce the 25 Step SEO Master Blueprint. 2. Goodbye SEOmoz. Hello Moz! May 29 - Posted by randfish For the last two years, the 130+ Mozzers across product, engineering, marketing, and operations have been working to transform this company to the next stage of our evolution. Today, that incredibly demanding, intense, but ultimately rewarding process has reached its first goal. I'm excited to announce that as of today, SEOmoz is formally transitioning our brand, our products, our company name, and all of our efforts to Moz. 3. The Web Developer's SEO Cheat Sheet 2.0 August 29 - Posted by DannyDover It is my honor and privilege today to introduce the brand new version of The Web Developer's SEO Cheat Sheet. This free and downloadable cheat sheet covers all of the important SEO code and best practices that are needed by online marketers and developers. 4. A Visual Guide to Keyword Targeting and On-Page Optimization August 6 - Posted by randfish As the \"O\" in SEO has broadened in scope, the most effective elements of on-page optimization have changed. While there is arguably no \"perfectly optimized page,\" this update to a 2009 post provides a comprehensive guide to steer you in the right direction. 5. Amazing Correlation Between Google +1s and Higher Search Rankings August 20 - Posted by Cyrus-Shepard This year's Search Ranking Factors Study showed a very strong correlation between Google +1s and higher rankings, and there's a compelling reason why. Google+ was built for SEO, and is far better optimized for search than other platforms. 6. 2013 Search Engine Ranking Factors July 9 - Posted by Matt Peters The results are in! Come check out Moz's 2013 Ranking Factors as Matt Peters presents a preview of the results from the survey and correlation study. 7. The 100 Best Free SEO Tools & Resources for Every Challenge - Interactive July 31 - Posted by Cyrus-Shepard At Moz, we love using premium SEO Tools. Paid tools are essential when you need advanced features, increased limits, historical features, or professional support. For other tasks, a free tool does the trick. Here you'll find a collection of the 100 best completely free tools, tools with both free and paid options, and free trials. 8. From Zero to a Million: 20 Lessons for Starting an Internet Marketing Agency September 19 - Posted by NiftyMarketing This post is a combination of stories and thoughts about what I have gone through building Nifty Marketing. My hope is that a few of you who are out there hustling will benefit from doing some of the things that I did, and most of the things that I didn't. 9. Post-Penguin Anchor Text Case Study January 15 - Posted by Court Tuttle It's no secret that Google's Panda and Penguin updates caused a lot of panic. Although I'm pretty turned off to information about these updates, I've been really interested in the anchor text issues surrounding the Penguin update. If sites that have over-optimized anchors lost traffic due to the update, it seems to make sense that sites can move up with relatively few (or without any) anchored links. I wanted to test that idea and decided that it was time for a good, old fashioned case study. 10. Holy Grail of eCommerce Conversion Optimization - 91 Point Checklist and Infographic January 24 - Posted by CueBlocks.com Invest in building filthy rich user experience, consistently and throughout your store. That is what stores with deeper pockets (like ASOS, Zappos, and JCPenney) do to achieve better conversion rate than your store. This article will take you away from usual Search Engine Optimization stuff to where the real money lies - Conversion Rate Optimization. What you do with the visitors you bring to your website? Top Moz Blog posts by number of comments Some posts, whether due to truly inspired content or a touch of controversy (sometimes a little of both), generate significantly more discussion in the comments than others. Many of these have comment sections that dwarf the original post! We expected our announcement of the shift from SEOmoz to Moz would drum up some conversation, but we were interested to take a look at the rest of this list. 1. Goodbye SEOmoz. Hello Moz! May 29 - Posted by randfish For the last two years, the 130+ Mozzers across product, engineering, marketing, and operations have been working to transform this company to the next stage of our evolution. Today, that incredibly demanding, intense, but ultimately rewarding process has reached its first goal. I'm excited to announce that as of today, SEOmoz is formally transitioning our brand, our products, our company name, and all of our efforts to Moz. 2. Post-Penguin Anchor Text Case Study January 15 - Posted by Court Tuttle It's no secret that Google's Panda and Penguin updates caused a lot of panic. Although I'm pretty turned off to information about these updates, I've been really interested in the anchor text issues surrounding the Penguin update. If sites that have over-optimized anchors lost traffic due to the update, it seems to make sense that sites can move up with relatively few (or without any) anchored links. I wanted to test that idea and decided that it was time for a good, old fashioned case study. 3. The Ultimate Guide to Advanced Guest Blogging January 21 - Posted by Pratik.Dholakiya With “content marketing” being the indisputable SEO buzzword of 2012, we can expect 2013 to see an onslaught of marketers trying to build links with guest posts. The growth in this market will cause some sites to lower their guest posting standards, others to raise them, and still more to stop accepting them altogether. We're going to help you combat this by sharing how we got posts up on ProBlogger and Search Engine Journal, and by introducing you to our strategy for success with our clients. 4. Why We Can't Just Be SEOs Anymore - Whiteboard Friday May 2 - Posted by randfish There's a movement happening in our industry where many SEOs are changing their titles and practices to \"inbound marketing.\" Where did this shift originate, and how is it shaping our industry at large? In today's Whiteboard Friday, Rand shares his thoughts on why we can't just be SEOs anymore if we're aiming for the bigger picture. 5. The 100 Best Free SEO Tools & Resources for Every Challenge - Interactive July 31 - Posted by Cyrus-Shepard At Moz, we love using premium SEO Tools. Paid tools are essential when you need advanced features, increased limits, historical features, or professional support. For other tasks, a free tool does the trick. Here you'll find a collection of the 100 best completely free tools, tools with both free and paid options, and free trials. 6. Ultimate Guide to Google Penalty Removal October 14 - Posted by PinpointDesigns A few months back, I wrote an article on Moz all about a penalty our web agency received for unnatural links pointing to our website. At first, this was a bit of a shock to the system, but since then, we've learned so much about Google's webmaster guidelines and we've helped lots of companies get their businesses back on track and remove manual penalties associated with their websites. 7. From Zero to a Million: 20 Lessons for Starting an Internet Marketing Agency September 19 - Posted by NiftyMarketing This post is a combination of stories and thoughts about what I have gone through building Nifty Marketing. My hope is that a few of you who are out there hustling will benefit from doing some of the things that I did, and most of the things that I didn't. 8. When Keyword (not provided) is 100 Percent of Organic Referrals, What Should Marketers Do? - Whiteboard Tuesday September 24 - Posted by randfish The rate at which Google is lumping keywords into \"(not provided)\" has skyrocketed in the last month, leading to a huge drop in referral data and speculation that 100% of keywords will soon be masked. In this special Whiteboard Tuesday, Rand covers what marketers can do to make up for this drastic change. 9. How to Rank: 25 Step SEO Master Blueprint May 14 - Posted by Cyrus-Shepard If you’re like most SEOs, you spend hours each week reading the latest SEO tactics and search engine tidbits. We spend hours learning, but does 90% of it change what we actually do - that is, the basic work of ranking a web page for search? To lend a hand, let me introduce the 25 Step SEO Master Blueprint. 10. Why Google Analytics Tagging Matters - Whiteboard Friday March 15 - Posted by RachaelGerson In today's Whiteboard Friday, Rachael Gerson sheds some light on \"dark social\" and explains why tagging in Google Analytics improves the accuracy of your referrals. Take credit for the work that you're doing, and tag your links! Top Moz Blog posts by number of linking root domains It just wouldn't seem right to use unique pageviews, thumbs, and comments to judge an SEO-focused blog without throwing in linking root domains as well. Using data from Open Site Explorer, here are the 10 posts that garnered the most attention from unique domains across the web. 1. Amazing Correlation Between Google +1s and Higher Search Rankings August 20 - Posted by Cyrus-Shepard This year's Search Ranking Factors Study showed a very strong correlation between Google +1s and higher rankings, and there's a compelling reason why. Google+ was built for SEO, and is far better optimized for search than other platforms. 2. 2013 Search Engine Ranking Factors July 9 - Posted by Matt Peters The results are in! Come check out Moz's 2013 Ranking Factors as Matt Peters presents a preview of the results from the survey and correlation study. 3. When Keyword (not provided) is 100 Percent of Organic Referrals, What Should Marketers Do? – Whiteboard Tuesday September 24 - Posted by randfish The rate at which Google is lumping keywords into \"(not provided)\" has skyrocketed in the last month, leading to a huge drop in referral data and speculation that 100% of keywords will soon be masked. In this special Whiteboard Tuesday, Rand covers what marketers can do to make up for this drastic change. 4. Goodbye SEOmoz. Hello Moz! May 29 - Posted by randfish For the last two years, the 130+ Mozzers across product, engineering, marketing, and operations have been working to transform this company to the next stage of our evolution. Today, that incredibly demanding, intense, but ultimately rewarding process has reached its first goal. I'm excited to announce that as of today, SEOmoz is formally transitioning our brand, our products, our company name, and all of our efforts to Moz. 5. The Web Developer's SEO Cheat Sheet 2.0 August 29 - Posted by DannyDover It is my honor and privilege today to introduce the brand new version of The Web Developer's SEO Cheat Sheet. This free and downloadable cheat sheet covers all of the important SEO code and best practices that are needed by online marketers and developers. 6. A Visual Guide to Keyword Targeting and On-Page Optimization August 6 - Posted by randfish As the \"O\" in SEO has broadened in scope, the most effective elements of on-page optimization have changed. While there is arguably no \"perfectly optimized page,\" this update to a 2009 post provides a comprehensive guide to steer you in the right direction. 7. How Website Speed Actually Impacts Search Ranking August 1 - Posted by Zoompf Google has long stated website performance will impact search ranking, but what exactly does this mean? In this article, Zoompf researches over 40 different speed metrics to determine the most impactful performance changes you can make to your website to improve search ranking. 8. 10 Tools for Creating Infographics and Visualizations February 6 - Posted by Miranda.Rensch Communicating visually is one of the most effective ways to explain complex concepts and relationships, both internally with your teammates and externally with your clients. Our very own Product Manager, Miranda Rensch, offers a list of tools you can use to create beautiful visualizations and let your visual communication skills shine! 9. The SEO of Responsive Web Design January 28 - Posted by Kristina Kledzik Will Critchlow announced back in November that Distilled's blog was updated with a new responsive design, but it occurred to me recently that we never went into the specifics of why responsive web design is so great. It's been a hot topic in online marketing for the past few months, but is it really going to become an industry standard? Short answer: yep. 10. How to Rank: 25 Step SEO Master Blueprint May 14 - Posted by Cyrus-Shepard If you’re like most SEOs, you spend hours each week reading the latest SEO tactics and search engine tidbits. We spend hours learning, but does 90% of it change what we actually do - that is, the basic work of ranking a web page for search? To lend a hand, let me introduce the 25 Step SEO Master Blueprint. Top comments by number of thumbs up We're always impressed by the discussions we see in the comments below blog posts. In addition to the great many insightful points that add to what the authors say, one of our favorite parts is the support our community members show for one another. Here are the most thumbed-up comments from 2013. 1. Stephan_Boehringer | September 24 When Keyword (not provided) is 100 Percent of Organic Referrals, What Should Marketers Do? - Whiteboard Tuesday 2. gfiorelli1 | July 19 Heart to Heart About Link Building - Whiteboard Friday 3. MarkTraphagen | August 20 Amazing Correlation Between Google +1s and Higher Search Rankings 4. jcolman | May 29 Goodbye SEOmoz. Hello Moz! 5. randfish | August 29 The Web Developer's SEO Cheat Sheet 2.0 6. Dr-Pete | April 15 The Difference Between Penguin and an Unnatural Links Penalty (and some info on Panda too) 7. Bill Sebald | July 16 9 Experts and a Summary: What Makes an Ideal SEO Employee? 8. KeriMorgret | February 7 Going Beyond Moz Metrics to Answer: \"Why is this Site Outranking Me?\" 9. evolvingSEO | February 12 Stop Clicking Here! 7 Superior SEO Alternatives to Generic Links 10. KeriMorgret | March 8 6 Ways to Use Fresh Links & Mentions to Improve Your Marketing Efforts - Whiteboard Friday Most active users by number of comments While quality certainly trumps quantity in most cases, we're continuously impressed by the ability of our community members to cover both bases. On average, the folks on this list (which intentionally omits our own staff and associates) have left a comment on every second or third post we've published, and we couldn't appreciate their contributions more. 1. Charles_SEO mozPoints: 516 | Rank: 161 2. Spook SEO mozPoints: 259 | Rank: 350 3. Brahmadas mozPoints: 341 | Rank: 248 4. Dubs mozPoints: 946 | Rank: 85 5. steviephil mozPoints: 1,030 | Rank: 77 6. paints-n-design mozPoints: 224 | Rank: 435 7. danatanseo mozPoints: 3,298 | Rank: 10 8. manishbhalla mozPoints: 230 | Rank: 422 9. skifr mozPoints: 234 | Rank: 407 10. Matt-Antonino mozPoints: 1,681 | Rank: 36 Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Best of 2013: The Top Posts and People on the Moz Blog"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Best of 2013: The Top Posts and People on the Moz Blog"
    },
    {
      "level": "H2",
      "text": "Top posts by unique pageviews"
    },
    {
      "level": "H2",
      "text": "Top YouMoz posts by unique pageviews"
    },
    {
      "level": "H2",
      "text": "Top Moz Blog posts by number of thumbs up"
    },
    {
      "level": "H2",
      "text": "Top Moz Blog posts by number of comments"
    },
    {
      "level": "H2",
      "text": "Top Moz Blog posts by number of linking root domains"
    },
    {
      "level": "H2",
      "text": "Top comments by number of thumbs up"
    },
    {
      "level": "H2",
      "text": "Most active users by number of comments"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Trevor Klein\n          \n            Trevor Klein\n          \n            Trevor Klein"
}