{
  "url": "https://moz.com/blog/the-rise-and-fall-of-pagerank-a-parable",
  "slug": "the-rise-and-fall-of-pagerank-a-parable",
  "title": "The Rise and Fall of PageRank: A Parable - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "…",
  "content": "The Rise and Fall of PageRank: A Parable Content Marketing D By: DavidLaFerney March 14, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! D By: DavidLaFerney March 14, 2008 The Rise and Fall of PageRank: A Parable Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Because I started a blog since the last update of toolbar pagerank, I’ve had the dreaded gray bar staring at me for the last 4-5 months. I don’t know exactly when the update happened, but I noticed it this morning. A shiny new PR 4 on the home page. I’m as proud as a new Papa. No, actually I’m not, but it is pretty cool. For anyone who’s new to web mastering, PageRank is the value that Google assigns (via their secret algorithm) to each web page that they index. If you have a Google toolbar installed on your browser, then a little green bar graph indicating pagerank is an optional tool. Webmasters in general and SEOs in particular started obsessing about pagerank as soon as the little toolbar widget became available. So, to quote Jessica Simpson, “I don’t know what it is, but I want it.” And the race was on to get more pagerank by hook or by crook, even if it meant spamming, shilling, or link buying. Soon Google realized that they had created a monster and began proclaiming that toolbar pagerank is really not an indication of anything significant. Meaningless, really. Pay no attention to that man behind the curtain. Right. Real PageRank is a closely held secret. PageRank or pagerank? One indicates toolbar pagerank which is a value between 1 and 10 (only updated every few months) while the other is Real PageRank (updated constantly - we think) and is a Secret value between 0 and 1. And some SEO Theorists really get a twist in their panties if you mix them up. Even as toolbar pagerank updates became fewer and farther between, SEOs obsessed more, analyzing every word that the Google Oracles uttered concerning pagerank or PageRank. And their hearts filled with lust for the evil green pixels. Then came the horrible Pagerank Smackdown of ’07, and many notorious bloggers lost magnitudes of toolbar pagerank because either 1) Google is a fascist monster bent on world domination, or 2) Because they were selling links. It was a dark dark day, but then another day dawned fair and they who were smitten discovered that their traffic wasn’t diminished by the Smackdown and the blogosphere was filled with cries of “Up Yours, Google! May all free men rejoice, for toolbar pagerank really is meaningless. Huzzah!” But behold, November brought another chill to the Internet. The oppressed webmasters experienced the nightmare of every Patriotic American – Lowered Property Values. That’s right, the resell value of their lovingly developed virtual real estate was lowered by the Smackdown, even though they never lost traffic. Revolutions have started over less. Some saw the errors of their ways and penitently petitioned the mighty Google for forgiveness, while others remain defiant to this very day, flaunting their link selling worldliness, like freedom fighters in the struggle for search rank equality. May mercy shine upon their souls. The moral of the story is – \"Don’t tease the 800 pound Gorilla.\" Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Rise and Fall of PageRank: A Parable"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Rise and Fall of PageRank: A Parable"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "DavidLaFerney\n          \n            DavidLaFerney"
}