{
  "url": "https://moz.com/blog/the-changing-landscape-of-mobile-search",
  "slug": "the-changing-landscape-of-mobile-search",
  "title": "The Landscape of Mobile Search is Changing – How Will You Adapt? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Should you have an app, or not? Would AMPs work for you? Are you prepared for the intelligent personal assistant takeover? Consider how you'll adapt to the world of mobile search as it changes beneath your feet in this post examining current and future trends.",
  "content": "The Landscape of Mobile Search is Changing – How Will You Adapt? Search Engines | Mobile SEO By: Bridget Randolph May 24, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Bridget Randolph May 24, 2016 The Landscape of Mobile Search is Changing – How Will You Adapt? Search Engines | Mobile SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. [Estimated read time: 9 minutes] Note: this post is based on a recent presentation I gave at LearnInbound Dublin. You can find the slides here. Mobile search as a topic has changed a lot over the past few years. When I first started looking at this, back in 2012, there was already a lot of discussion happening around the topic of mobile. And back then, the big question everyone was asking was, “what should my mobile strategy be?” Even then, things were shifting. At one of my early conference presentations on the topic, I made the point that we should stop thinking about a “mobile strategy” as different from our web strategy, because mobile technology was becoming simply another way to access the Internet. This isn’t surprising; after all, global purchases of smartphones are increasing at an exponential rate: Source And because of this, the questions we’re asking have changed. We used to ask whether we needed a separate mobile site (and it was around this time that Google really began to encourage the use of responsive design), whereas now “mobile-friendliness” often seems to be used interchangeably with “responsive.” (This is, of course, a whole other topic!) We used to worry about treating mobile users differently because we thought they were always “on the go,” whereas now we realize that most people use mobile devices all the time, and in fact most of the time these devices are used even when other options are available, such as at home or at work. And most recently, Google have started speaking in terms of “micro-moments,” the various use cases of search: Do-Go-Know-Buy, which apply equally to mobile users as to desktop. And we used to talk a lot about apps, and about whether to use an HTML web app vs a native app, how hard it was for the average app to stand out from all the noise in the app store, and about app store optimization (ASO) harking back to the old days of SEO, with its emphasis on keywords for ranking. Now, we talk about the other ways in which people can use and discover our apps — such as app indexation and app streaming. This shift is hardly surprising, when you consider that, in 2015, 52% of UK internet users have stated that mobile is their “preferred way to access the web” — up from only 24% in 2013. This means the number of people who view mobile as their primary web device has doubled in just 2 years, and we have every reason to believe that this trend with continue. It just makes sense, because (as Benedict Evans recently wrote), “it’s actually the PC that has the limited, basic, cut-down version of the Internet...it only has the web.” Whereas our mobile devices have so much more information to draw on (photos, geolocation, friends, physical movement) and greater interactivity: with the external world (through technology like beacons), with you when you’re not using it (through notifications), and with your personal identity (because a phone is always signed-in and it is almost always an individual device rather than a shared one). So what are the key ways in which we're seeing this shift in user behavior change our approach to SEO? To answer that question, I’d like to focus on four key areas in which Google seems to be shifting its approach to mobile search, and some things we can do about it: Mobile-friendliness as a ranking factor Site speed and page load times Mobile-first design of SERPs App integration with web search Mobile-friendliness as a ranking factorIn 2015, when Google first rolled out the Mobile-Friendliness Update (or “Mobilegeddon” as it was nicknamed), the impact was felt in two ways. More directly, by those sites which were impacted by the rollout — some sites lost up to 35% of their mobile rankings within the 1st month after the rollout — and indirectly, by the move towards mobile-friendliness in the lead up to the update. Google announced that they saw a 4.7% increase in the number of mobile-friendly sites in the two months between announcing that the update was coming and when it actually rolled out. A new version of the update has recently rolled out, so we can expect to see further impact from this in the next few months. What should we do about it?The key action here is to ensure that your site passes the mobile-friendly test, and to check Google Search Console reports for mobile-specific errors. Site speed and page load timesHand in hand with the focus on mobile-friendliness, there is also a push towards improving site speed and page load times. This is particularly noticeable on editorial sites, where an ad-revenue business model leads to lots of different elements required to load a page, despite the actual content being fairly lightweight. Google are not the only ones addressing this issue: Facebook Instant Articles and Apple Newsstand both use in-app versions of content pages to speed up the loading process, and some publishers have also created their own native apps to help solve this. Google’s solution to this is their Accelerated Mobile Pages Project (AMP), which allows publishers and creators of editorial content to build versions of their pages with stripped-back, skeleton HTML, following a set of rules which guarantee speed and force distribution (an important thing to be aware of if you choose to utilize this approach). This set of rules allows the page to: load quickly (speed), and be cached by Google and served directly in the SERP (distribution). Example (L–R): primary URL, AMP version on primary website, and AMP version cached by Google. What should we do about it?The first step is to decide whether AMP is relevant for you. You should use AMP if: Google News is an important traffic source for you; You make a lot of content, particularly editorial content; You want wider distribution of your content; You have a high proportion of mobile traffic. If this is a good approach for you, you can learn more about how to implement it here. Mobile-first design of SERPsThis third key area is around Google making desktop search look and feel more like mobile search. There are two major ways that this has happened: 1. The card-style layout, which makes the distribution of content easier on a variety of different screen sizes and types: 2. And the move to get rid of the sidebar ads on desktop search in favor of more ads at the top of the page (on “highly commercial” searches): “Old” Google desktop SERP “New” Google desktop SERP without sidebar ads What should we do about it?There’s not a huge amount that can be done to address this trend head-on. However, it’s important to ensure that, for these “highly commercial” SERPs, you are taking account of the changing SERP layout in your tracking and reporting. In addition, you may want to shift some of your focus towards building out your top-of-funnel search strategy, to target less commercial keywords where you will have fewer paid ads to compete with. App integration with web searchGoogle needs to find a way to integrate app content with the rest of the web, or they risk becoming irrelevant. The “walled garden” effect from having apps on your phone’s home screen, coupled with recent stats which show that around 85% of users’ time on their mobile devices is spent on apps rather than on the mobile web, means that apps present a very real threat to Google continuing to act as an intermediary between users and content discovery. The solution for Google is to start indexing and serving app content in the web search results, and this is what they are trying to do with their work around app indexation and app streaming. App indexation involves setting up your app so that the same http:// web link can be used to link to a page on your desktop site, its mobile version (responsive design or dynamic serving), and the equivalent content inside your app (deep linking). This allows Google to serve the most relevant version based on the context which they have around that particular user and how they prefer to use the web. Image credit: http://searchengineland.com/app-indexing-matters-f... In the longer-term, they seem to be moving towards the option of “app streaming,” which would allow a user to access app content without having the app installed on their device. The content would instead be served via Google search interface, again firmly positioning Google in the middle between the user and the content provider: Example of app streaming in SERP What should we do about it?If you don’t already have an app, this may not be relevant to you. However, it is worth considering whether you should create one. To determine whether or not you should have an app, you can ask the following questions: Would my app… Add convenience? Offer unique value? Provide social value? Offer incentives? Entertain? If the answer is no to all of these, you probably don’t need an app. If you do have an app, though, make sure that it supports http:// web links, and then head over to my post on app indexation for a walkthrough on how to set this up. Where’s this all heading?I believe that all of these trends are supporting a wider push by Google towards their goal of building the ultimate, intelligent personal assistant. Sergey Brin stated in 2013: “My vision when we started Google 15 years ago was that eventually, you wouldn’t have to have a search query at all.”This may seem impossible, but when you consider the implicit signals which Google is now able to access through the enhanced features on a mobile device, it seems less farfetched. Already, they are able to access data around: Search history Language Social connections Time of day Browser Device Location And already, users are realizing that they can provide fewer contextual signals within their keyword search and the search engine will still know what they’re asking. In addition, the technologies are becoming more finely tuned and gathering more data all the time: wearables that can monitor physical activity and health signals (like heart rate), beacons which can pinpoint a location down to which side of the street you’re standing on, and phones which can tell whether you’re walking, running, cycling or riding in a car. These are all signals which in the future could be used to determine the most relevant results to serve - potentially before you even ask. When you combine all of these signals with the integration of the public index (what we currently think of as the Google search index), the private index (your emails, photos, calendar, etc) and app content, Google could have the ability to know as much about your day to day activities as any human PA. This means a single interface for all types of searches, and eventually, an intelligent personal assistant which can anticipate your next question before you ask it. So maybe, instead of focusing just on keywords, or even topics, the next question we should start asking is: “How can I be the most useful source from a personal assistant app’s perspective?” If you’re interested in learning more about these trends which are shaping the future of search, like implicit signals, the changing Google interface, intelligent personal assistants, beacons, wearables, and other new devices, and more, we’ve been writing and discussing our predictions over on the Distilled blog for our new #Searchscape project. How have you seen the mobile search landscape shift over time? Do you agree that it’s heading towards the development of intelligent personal assistants? I’d love to hear your thoughts in the comments! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Landscape of Mobile Search is Changing – How Will You Adapt?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Landscape of Mobile Search is Changing – How Will You Adapt?"
    },
    {
      "level": "H2",
      "text": "Mobile-friendliness as a ranking factor"
    },
    {
      "level": "H3",
      "text": "What should we do about it?"
    },
    {
      "level": "H2",
      "text": "Site speed and page load times"
    },
    {
      "level": "H3",
      "text": "What should we do about it?"
    },
    {
      "level": "H2",
      "text": "Mobile-first design of SERPs"
    },
    {
      "level": "H3",
      "text": "What should we do about it?"
    },
    {
      "level": "H2",
      "text": "App integration with web search"
    },
    {
      "level": "H3",
      "text": "What should we do about it?"
    },
    {
      "level": "H2",
      "text": "Where’s this all heading?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Bridget Randolph\n          \n            Bridget Randolph\n          \n            Bridget Randolph"
}