{
  "url": "https://moz.com/blog/the-beginners-guide-to-keyword-research-using-free-tools",
  "slug": "the-beginners-guide-to-keyword-research-using-free-tools",
  "title": "An Introduction to Keyword Research Using Free Tools - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I often find that keyword research is an overlooked part of the SEO process. Many SEOs will tend to stick with using Google’s Adwords Keyword Tool and as a result, they will most likely be targeting the exact same keywords as the competition. The ultimate goal with keyword research is to find those…",
  "content": "An Introduction to Keyword Research Using Free Tools Keyword Research By: Adam Whittles November 29, 2012 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Adam Whittles November 29, 2012 An Introduction to Keyword Research Using Free Tools Keyword Research This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. I often find that keyword research is an overlooked part of the SEO process. Many SEOs will tend to stick with using Google’s Adwords Keyword Tool and as a result, they will most likely be targeting the exact same keywords as the competition. The ultimate goal with keyword research is to find those juicy, low-hanging fruit - the long-tail keywords. Long-tail keywords are sometimes defined as keyword phrases containing multiple words of four or more. However, this is not how I like to define them. For me, the long-tail keywords are those that have lower volumes of traffic and are less competitive to rank for. In other words, they may contain multiple words or they could contain as few as two words. Anyway, I wanted to share my method of conducting keyword research in order to hopefully give some insights into the process. For this example, I am going to use the ‘greetings card’ industry in the UK. All the tools I will be using are freely available to everyone. So let’s get started! Basic Google Search with Seed Keyword I always like to start my research with a basic Google search using my most obvious industry keyword. This will give an idea of who my competitors are and who the big players in the industry are. So, a basic search for [greetings cards] in Google.co.uk produces the following results: Two of the top four results (funkypigeon.com and moonpig.com) are well known brands that advertise regularly on television. However, the top 2 results are perhaps lesser-known competitors. Spy on your Competitors Now that you have an idea of who the big players are, it's time to see if we can find out what keywords they are targeting. Let’s take a look at greetingscards.co.uk. When we look at the home page, there doesn’t seem to be an awful lot of text, so let’s turn to using a keyword density tool. SEOBook has a pretty good keyword density tool but I’m going to use the tool from David Naylor Search Marketing. The reason I prefer to use this tool is because it has more options to customize your results and can provide phrases of four or more words in length. When we use the keyword density tool we are provided with the following list: As you can see, it is a pretty comprehensive list of keyword ideas that we can also use. However, where did all these words come from, considering there was very little text on the homepage? A quick look at the source code reveals the answer. They are still using the Keyword Meta Tag and have stuffed it with around 30 keywords. This is exactly why you shouldn’t still be using the redundant tag as it just gives your competitor insights into the keywords you are targeting. Get some Über-suggestions with Übersuggest Übersuggest is a great tool that extracts all the Google autocomplete words for a base keyword. It is really simple to use. All you have to do is put your base keyword in the search box, select a language and country then hit suggest. For [greetings cards] we are presented with the following list of 352 suggestions: The tool also makes it really easy to select all the keywords so that you can easily copy and paste them into Google’s Adwords Keyword Tool later. Merge Everything Together! For this next stage, I like to use a tool called mergewords (mergewords.com) to further advance our list. Before you use this tool you will need to think carefully about how to arrange the words in the three columns to get the right combination of words. Once you have done this, you can start filling the boxes with words. For greetings cards, I used the following combination: This resulted in 468 keyword possibilities. Separate the Wheat from the Chaff Having followed these steps, we now have a list of over 800 keywords. However, some of these may be duplicates and some may be unsuitable for other reasons. This is how I start the filtering process. First I input all of the keywords into an excel spreadsheet, then I use the ‘remove duplicates’ tool. I'm using Excel 2011 for Mac, which has a 'remove duplicates' function in the Ribbon's Data tab: If you are using Excel 2007 or later then you should also be able to easily find this function. However, if you are using an earlier version of Excel, there are still ways to easily remove duplicates. MrExcel.com lists a variety of methods you can use to remove duplicates in both Excel 2003 and 2007. Twenty-nine duplicates were removed, leaving me with a list of 851 keywords. The next step is to manually go through the list and remove any unsuitable keywords such as those containing brand terms. Unfortunately, there is no suitable way to automate this (that I know of) and you will have to go through the list manually. After going through the list manually and removing unsuitable keywords, we are now left with 741 keywords. Now we use Google’s Adwords Keyword Tool Now we have a list of 741 keywords, it’s time to use Google’s keyword tool to start refining the list and find out information such as search volumes, competition and local search trends. When using the tool, remember to have all the parameters set correctly. So, make sure you set the tool to [Exact] match types in the correct location (UK in this case) and tick the box to only show ideas closely related to your search. To set the tool to show [Exact] match, just navigate to the left sidebar and select the check-box next to [Exact]. You may have to unselect the check-box for Broad match if it is selected: After inputting the 741 keywords into the keyword tool, we further refine the list by removing any unsuitable words we may have missed from the previous manual check and remove any keywords with local search volumes of less than 10. This leaves us with a more manageable list of 126 keywords, which we can download as a CSV file. However, we are not quite done with Google’s keyword tool just yet. We are now going to start adding some more keywords to the list by inserting our refined list of 126 keywords into the keyword tool. Once we have done this you should get around 800 keyword suggestions from Google: The first thing we should do is to save all the keywords from our original list of 126, to our new list. Next, we can arrange the list of suggestions by competition from lowest to highest. Once this is done, we can now start adding all the keywords with low to medium competition and local monthly search volumes greater than 10. These are our 'juicy' low-hanging fruit keywords. The final stage is to add all the important keywords from the suggestions that we may have missed previously. Depending on how many keywords you have added from this final stage, you should have a final list of around 280 keywords. To see the list I have created you can visit the blog at my site Crimson Penguin and download it for free! Wait, we’re not Finished Yet! Two of my favorite tools for keyword research that often get overlooked are Google Trends and Google Insights. However, Google has recently combined the two into a new look Google Trends. This is a great tool for finding valuable insights into your niche keywords and can often help you to make decisions about which specific keywords you should target. Let’s take a look at our example of the greetings card industry: As you can see from the graph in the top, very slight changes in the keywords can produce drastically different results. Pluralising [birthday card] to [birthday cards] results in twice as much interest over the past 12 months. Final Word Hopefully, I’ve shown you some useful tools and techniques that you can start to use in your own keyword research projects. Armed with this knowledge, I hope you can start to find more valuable long-tail keywords for your clients. About the Author Adam is a professional SEO and owner/founder of Crimson Penguin SEO Services based in Essex. He also works for a leading SEO agency in London. You can connect with Adam on Twitter or Google+ Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "An Introduction to Keyword Research Using Free Tools"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "An Introduction to Keyword Research Using Free Tools"
    },
    {
      "level": "H2",
      "text": "Basic Google Search with Seed Keyword"
    },
    {
      "level": "H2",
      "text": "Spy on your Competitors"
    },
    {
      "level": "H2",
      "text": "Get some Über-suggestions with Übersuggest"
    },
    {
      "level": "H2",
      "text": "Merge Everything Together!"
    },
    {
      "level": "H2",
      "text": "Separate the Wheat from the Chaff"
    },
    {
      "level": "H2",
      "text": "Now we use Google’s Adwords Keyword Tool"
    },
    {
      "level": "H2",
      "text": "Wait, we’re not Finished Yet!"
    },
    {
      "level": "H2",
      "text": "Final Word"
    },
    {
      "level": "H3",
      "text": "About the Author"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Adam Whittles\n          \n            Adam Whittles"
}