{
  "url": "https://moz.com/blog/the-beginners-checklist-for-search-conferences",
  "slug": "the-beginners-checklist-for-search-conferences",
  "title": "The Beginner's Checklist For Search Conferences - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "J. K. Rowling (She wrote a little book called Harry Potter) recently gave the commencement speech at Harvard University. She spoke about the power of failure and the incredible potential of imagination. It was a great speech that left me with one powerful lasting gem. She pointed out that humans…",
  "content": "The Beginner's Checklist For Search Conferences SEO Events By: Danny Dover June 9, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Danny Dover June 9, 2008 The Beginner's Checklist For Search Conferences SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. J. K. Rowling (she wrote a little book called Harry Potter) recently gave the commencement speech at Harvard University. She spoke about the power of failure and the incredible potential of imagination. It was a great speech that left me with one powerful lasting gem. She pointed out that humans are unique in their ability to learn from others' experiences. Last week I attended my first search conference. I gleaned a lot of valuable info and met many interesting people. Throughout the conference I compiled a mental checklist for my next conference. My hope is that my experience and the corresponding checklist will become a learning resource for all of you. The Beginner’s Checklist For Search Conferences PDF Before the Conference What to bring Business Cards - I didn't have business cards and it was awkward ;-( Don't make the same mistake as me. It is not necessary to get anything special. The person giving the card is much more important than the quality of the card. Unless you have superfluous design resources, I don't recommend spending significant time or money (no more than $20.00 USD) on your business cards. Branded Clothing - Become a self serving billboard and wear your company’s logo loud and proud. (Notable Exception Possibly NSFW) Laptop/Notepad - The medium onto which you transcribe your notes is a personal preference. Just make sure you bring something and utilize it to its fullest. Good Shoes - You will be standing and walking around all day. Think function over fashion. Weather Dependent Clothing - Check your favorite weather source and plan accordingly. Water Bottle (Nalgene with a Carabiner is how we do it in Seattle) - You are going to be surrounded by hundreds of other heat producing attendees. Be sure to always have a source of water on hand so you can stay hydrated and healthy. Wear Deodorant - No one likes smelly people. Sorry Rebecca. Bring a Paper Clip - Generally name tags at conferences will be badges that attendees wear around their neck. Unfortunately, the badges have a tendency to spin and hide the wearers name. This problem can be avoided easily by paper clipping the badge into place. Prepare yourself Get a Twitter Account - At search conferences there is always a conversation going on behind the presentation. Be involved and in the know by following the right people. (I will list some power accounts if there is a demand in the comments.) Know the Big Players/Companies - You are going to need to know who the big players are before you get to the conference. Read more about important SEO people. Optional Bring Separate Wireless Internet Source - If you have the resources, bring an external internet source (e.g., PC card). This will keep you connected if the Wifi goes down and has the possibility to make you a good person to know. Be Born at Least 21 Years Prior to the Event - In the United States the legal drinking age is 21. Although drinking is not required by any means, it can be necessary helpful for some people. Find Restaurants Nearby - Knowing places to eat is always a great way to help you network. People unfamiliar with the area will be looking for someone who is in the know. During the Conference Show Time Arrive Early or Late (not too late) to Avoid the Registration Line - Every person at the conference will need to register at the beginning of the conference to get in. Make sure you are not the one at the back of the line. Wear Branded Clothing - You brought it, now wear it! Network - Network, Network, Network. The relationships you make at conferences have much more potential than the information you learn in sessions. Since almost everyone at search conferences are there to network, meeting people should be easy. Attend All Session Blocks Except One - The big names at conferences got to where they are by knowing most of the things discussed in sessions. This means that they are unlikely to attend many sessions. Choose your least important sessions and skip them. Use this time to meet the big names. They will be much less bombarded and far more likely to really get to know you. Go to Popular Booths - Popular booths will feature more important people and offer conversation starters for all the people you don’t know. At Lunch, Don’t Sit With Friends - This is hard because most people see lunch as a time to relax. This is not necessarily true. Network, Network, Network. Drink a Lot of Water - Keeping yourself hydrated keeps yourself energized and fully functional. Use Your Notepad/Computer - Take a lot of notes. I recommend at least one new page/file per session. Keep All of Your Random Ideas in One Place - This can either be a separate text document or the last page of your notepad. Collect Cool Schwag - Free stuff is great. Gather as much as you can and bring it home for friends and family. Parties Party Hop - Maximize your chances to network and learn from the more experienced attendees. Avoid Useless Conversations - Make your impact but keep most conversations short and to the point. Here are a couple of things to bring up if the conversation stops. What do you not get to do enough of? (Thanks Carlos.) Have you ever watched the Viagra SERPS to study black hat techniques? (Hint: \"Buy Viagra\" is much more interesting than simply \"Viagra\".) If all else fails, remember that people at start ups LOVE to talk about their company. After the Conference Before Sleeping Review Business Cards - Reviewing the business cards you received will help you remember all of the people you met. Review Notes - This will likely help prioritize your work. Create a To-Do List - After a conference your motivation will likely be really high. Use this opportunity to define future tasks and goals. Reconnect Blog About It - Not only will this help you keep a record of the event, but it also provides an avenue to cement connections with people. Connect Online - Find people you met in real life and connect with them online. Specifically, I recommend finding people on Twitter, Facebook, and Linkedin. If you are an experienced conference attendee, feel free to share your opinions and expertise in the comments. This post is very much a work in progress. As always, feel free to e-mail me or send me a private message if you have any suggestions on how I can make my posts more useful. If that's not your style, feel free to contact me on Twitter (DannyDover) and/or Linkedin (Danny Dover). Thanks! (I'm taking my own advice here!) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Beginner's Checklist For Search Conferences"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Beginner's Checklist For Search Conferences"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Danny Dover\n          \n            Danny Dover\n          \n            Danny Dover"
}