{
  "url": "https://moz.com/blog/the-truth-about-squidoo-what-is-it-good-for",
  "slug": "the-truth-about-squidoo-what-is-it-good-for",
  "title": "The Truth About Squidoo. What is it Good For? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Hi, fellow mozzers.  Today I want to share some of my experience digging into social service called Squidoo. I'm sure many of you have met some recommendations to use this service for link building or online promotion, but I've never seen any good overview of this service from a SEO…",
  "content": "The Truth About Squidoo. What is it Good For? Social Media By: Tim Soulo December 16, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Tim Soulo December 16, 2010 The Truth About Squidoo. What is it Good For? Social Media This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Hi, fellow mozzers. Today I want to share some of my experience digging into social service called Squidoo. I'm sure many of you have met some recommendations to use this service for link building or online promotion, but I've never seen any good overview of this service from a SEO perspective. What is it, anyway? I was struggling into Squidoo for a couple of weeks, hoping that there's some value behind it that can spice up my SEO/SMM strategy. It's hard to tell the exact definition of the service, but here's my understanding of what it is being used for: Experienced people launch websites & blogs and monetize them with affiliate programs, referral programs, Adwords or whatever. \"Squidders\" just create one-page-websites on Squidoo, add monetization plugins and do some basic linkbuilding. It seems like that's enough to get some search traffic to your lens and make money. So basically what pro-lensmasters do is: seek for a compelling topic; keyword research for some decent longtail phrase to name a lens; create a nice lens, which will cover the chosen topic; promote it to appear in SERPs; make money by redirecting visitors to Amazon & stuff. Where is the cool part? Traffic estimates from Compete show us that Squidoo is pretty a decent resource to put some effort in: What's the SEO value here? With the Page Rank of 8, Squidoo is a choice platform to gain high quality relevant links to any pages of your website. I bet many of you would like to have a backlink from a PR5 lens like this one: \"Lady Gaga Costumes\" (1st in Google for \"lady gaga costumes\" term). You can also check the \"Top 100 Lenses On Squidoo\" list and apply Mozbar to each. The metrics are really tasty: But here is where the \"Not so fast!\" part of the tale begins. I naively thought that Squidoo does have some special tools to boost your page metrics and help it to reach the top of the SERPs. To my sincere disappointment it doesn't. All the benefit it brings (except for high Domain Authority) is that you can go and comment some top lenses to leak some link juice from them or sit there and hope that some lensmasters with tough lenses will link to yours in some way. In addition to that, if the topic that you're building your lens around is not very hot & trendy - you'll most likely fail (like I failed with lens dedicated to our website builder). Now let's see what it takes to create a successful lens: Part I: Creating a Squidoo lens. 1. Think of a Squidoo lens like of a blog post. Only a valuable blog post will go viral, attract links and dominate search. What I mean by \"valuable\"? I mean that it must be interesting to all audiences and, of course, it should be trending. Basically that's why Megan Fox's Tattoos lens ranks way better than Book Care and Repair lens. No one cares about the books when there is Megan Fox around LOL 2. Now when you have the idea of a nice blog post to create a lens, it's time for a keyword research. Pick the combination you wish to rank for and name your lens. The name of your lens is reflected in it's URL, which helps in ranking. 3. What you have left is to write a really compelling post and hope that people will like it. There's no difference between creating a quality blog post and a quality lens. Pictures, videos, infographics and any type of nice UGC modules will make your lens more appealing. Don't forget to explore existing lenses relative to your topic to get some ideas. Part II: Promoting a Squidoo lens. 1. I am writing this post for the world's toughest SEO community, so I won't describe the well known ways of promoting something on the web. Build links, use Social Media, send e-mails etc. 2. Speaking of Squidoo specific promotions, there are some tips that I'd like to share: Write your Bio & upload photo. Just because it looks more professional and appeals to people & Squidoo community. Write lots of good content. Every lens has its own rank on Squidoo, which is based on various factors, like your Squidoo activity, how big and good your lens is, the updates frequency, etc. Lenses with higher rank are more visible, and when people visit your lens they might mark it as \"favorite\", giving your lens some additional links inside Squidoo and a higher PageRank as a result. Use proper tags. Squidoo uses the tags to choose lenses for \"related\" box, which will link your lens on other similar lenses. Comments and \"favs\". Spend a few minutes a day to go and comment someones lenses. Add to favoutires lenses that appeal to you. People might visit your profile and do the same for you. But don't be spammy with this tactic. Forum. Participate at Squidoo forum and add your lens to your signature. This will grant you some visits of pro-lensmasters. And as I've previously said - they have a really nice community and will always help you with your questions & issues. Directories & Bookmarks. There is a small list of Squidoo specific directories and bookmark systems like Lensroll, Squidom, Squoogle etc. Don't forget to submit your lens there. RECAP: When I started using Squidoo I thought this would be a holy grail that will grant me some very cool links from high PR pages. But it turned that you need to invest just as much effort to promote a lens as you do for any other website or a blog post. From this perspective I've sorted out 2 ways I can use Squidoo for SEO: 1. In case you have a truly compelling idea for a blog post, think of a possibility of making a lens on Squidoo instead. With enormous domain authority and some help from the Squidoo community, maybe you'll have a chance to get to the top list, which will make you a high PR page and grant lots of traffic in future. 2. If you don't want to invest too much time and effort, but still want to have some quality links from Squidoo, I'd recommend finding some high authority lensmaster and paying him to create 5-10 quality lenses relative to your niche with links to different pages to your website. It will be a lot easier for him to get some help from Squidoo community and make the most of those lenses. Check my other post: Facebook Marketing: Ultimate Guide Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Truth About Squidoo. What is it Good For?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Truth About Squidoo. What is it Good For?"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Tim Soulo\n          \n            Tim Soulo"
}