{
  "url": "https://moz.com/blog/the-ultimate-analytics-comparison-project-needs-your-help",
  "slug": "the-ultimate-analytics-comparison-project-needs-your-help",
  "title": "The Ultimate Analytics Comparison Project Needs Your Help - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Last week I wrote a piece offering a free linkbait idea on web analytics. Incredibly, several folks responded, indicating they'd give it a go. Yesterday, I sat down with two of the frontrunners - Eric Enge from StoneTemple Consulting & Jonah Stein of ...",
  "content": "The Ultimate Analytics Comparison Project Needs Your Help SEO Analytics By: Rand Fishkin November 16, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin November 16, 2006 The Ultimate Analytics Comparison Project Needs Your Help SEO Analytics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Last week I wrote a piece offering a free linkbait idea on web analytics. Incredibly, several folks responded, indicating they'd give it a go. Yesterday, I sat down with two of the frontrunners - Eric Enge from StoneTemple Consulting & Jonah Stein of Alchemist Media. Eric had already begun the project - he has buy-in from all of the following analytics firms to provide their software free for one month to help test and compare against one another: Omniture WebSideStory Indextools ClickTracks Google Analytics Webtrends CoreMetrics Jonah will be helping out by adding some of his sites to the mix that Eric has already assembled. Jonah's also going to help out from the analysis side, adding his expertise in the realm of PPC analytics. But, dear readers, they need your help, too. They're seeking volunteer websites with a minimum of 100,000 unique visits per month to help participate in the project. What does this get you? Along with industry recognition, you'll also earn some very juicy links - from SEOmoz and the host article (which, IMO, has the potential to rival our Web2.0Awards as linkbait) and potentially many of the thousands of sites that will link to the case study. Sites in any sector are welcome to participate. You can leave your URL below (along with a way to contact you), or simply shoot an email to both jstein -at- alchemistmedia.com and eenge -at- stonetemple.com. All of us appreciate your help in making this project something that can benefit the entire web community. p.s. If you represent a web analytics firm that's not on the list above and are interested in participating, please send Eric & Jonah an email and they'll work to include you. p.p.s. They're currently on the lookout for a couple sites with a high PPC spend - $50K+ per month. If you've got a site like this to share, we'd be extra appreciative. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Ultimate Analytics Comparison Project Needs Your Help"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Ultimate Analytics Comparison Project Needs Your Help"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "UTM Tagging for Google Business Profile — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Surprising SEO Test Results — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}