{
  "url": "https://moz.com/blog/the-problem-with-pagination-on-cpm-ad-driven-websites",
  "slug": "the-problem-with-pagination-on-cpm-ad-driven-websites",
  "title": "The Problem with Pagination on CPM Ad Driven Websites - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This morning I woke up at 3:45am (just about the time I usually go to sleep), kissed my fiancée goodbye and jetted off for a day-long meeting in Phoenix, AZ with the folks at Village Voice Media (operators of 16 weekly newspapers and many media-focused sites and blogs). During our chat, the issue…",
  "content": "The Problem with Pagination on CPM Ad Driven Websites Technical SEO By: Rand Fishkin February 5, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin February 5, 2008 The Problem with Pagination on CPM Ad Driven Websites Technical SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This morning I woke up at 3:45am (just about the time I usually go to sleep), kissed my fiancée goodbye, and jetted off for a day-long meeting in Phoenix, AZ with the folks at Village Voice Media (operators of 16 weekly newspapers and many media-focused sites and blogs). During our chat, the issue of pagination for article content reared its ugly head, and since this particular issue troubles so many CPM-revenue focused sites, I decided it needed to be addressed (despite the fact that I touched down in Seattle at 8pm, taxied over to Vanessa's for Buffy Tuesday, and desperately need some sleep). Here's the fundamental dilemma: CPM Revenue is based on page views (because more page views mean more ad views). Splitting up lengthy news articles (or any lengthy content for that matter) from a single long page into more digestable sized pages is not only good for user experience (depending on your users' preferences), but also promotes more page views, and thus more ad revenue. From an SEO perspective, splitting up articles into multiple pages is generally bad, because: Most links (internal and external) will only point to the first page of the article, so subsequent pages get comparatively little link juice Creating unique title tags (or meta descriptions) for multiple article pages presents a significant problem (what else are you going to call it, but \"article title page 2 of 12\"?) If the entire content were on a single page, you might generate far more mid and long tail search traffic to the page, because those keywords would all be on a single, more competitive URL What's a publisher to do? For those who might not be following, I've drawn up some handy images to help illustrate the problem: There is a clever solution to this issue, but it veers into territory that some worry is gray hat - using CSS layers and javascript to keep all of the content on a single page, but make clicks to view the layers that would have been page 2, page 3, etc. refresh the ads and \"count\" as a page view. In this example, the search engines only get a single URL, with all of the content, and the visitors get, what could certainly be argued, a more usable page, while the publisher gets what they want - the maximum number of \"page\" views. One large media website that used to use exactly this tactic was the International Herald Tribune. However, it appears that now, they too are creating multiple URLs for their paginated material, and seeing those results in Google (example). Quite the pickle... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Problem with Pagination on CPM Ad Driven Websites"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Problem with Pagination on CPM Ad Driven Websites"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "7 Ways SEO and Product Teams Can Collaborate to Ensure Success"
    },
    {
      "level": "H3",
      "text": "6 Things SEOs Should Advocate for When Building a Headless Website — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}