{
  "url": "https://moz.com/blog/the-full-list-of-suppliers-to-ask-for-links",
  "slug": "the-full-list-of-suppliers-to-ask-for-links",
  "title": "The Full List of Suppliers to Ask for Links - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "One small step in any linkbuilding process that has been written about many times before is to ensure that you (/ your client) has links from all appropriate businesses that they actually have a real relationship with. In the SEO world, it'd be unthinkable to enter into a partnership without a few…",
  "content": "The Full List of Suppliers to Ask for Links Link Building By: Will Critchlow January 15, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Will Critchlow January 15, 2009 The Full List of Suppliers to Ask for Links Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I sometimes feel that I don't write about basic fundamental SEO techniques often enough. Particularly here on the SEOmoz blog where I often try to save my \"deep\", \"thoughtful\" posts, in contrast to the Distilled blog where I write more widely and Twitter where I talk about any old rubbish. As a step towards remedying this, I thought I would write about some specific basics in the process of linkbuilding. I am working on our linkbuilding process for clients here at Distilled. It's probably one of the hardest things to do as an agency - to balance all the competing issues: time taken by many clients to implement recommendations (but expect results anyway) the natural urge for consultants to focus on the creativity and suffer through lack of implementation / follow-through working out where the line is on quality vs. guidelines vs. the future vs. effectiveness right now understanding what we can do for a client vs. what they have to do for themselves It's interesting though, and I have learnt a lot from re-working the process (and we're definitely not done yet!). But today's post isn't really about how to create an agency linkbuilding process (maybe another day) - it's about a specific but basic step in that process. Getting links from suppliers One small step in any linkbuilding process is to ensure that you (/ your client) has links from all appropriate businesses that they actually have a real relationship with. In the SEO world, it'd be unthinkable to enter into a partnership without a few links between your sites, but in many industries, this happens. Beyond partnerships, what about all your suppliers and customers? This has been written about many times before - along with techniques for getting links from those suppliers (such as offering testimonials). When you actually start writing a process to do this though, you realise that it's no good having a line in your process that says: \"get links from suppliers\" or even \"get client to get links from suppliers\" We know from much experience that \"actions\" like this tend to sit on todo lists for ever before being quietly forgotten about. What you need is something much more actionable. Like this: Step 1: \"get client to tell us who their IT support company is\" Much easier to action. Obviously this needs to be followed with something like: Step 2: \"research supplier's website to see if they use testimonials / link to clients\" Depending on the answer, we will either just have to get the client to write a testimonial and we can speak to their contact or we may have to spend more time convincing the supplier that they *should* have testimonials on their site ;) Having processes with steps like this work many times better than generic descriptions of processes that are actually many steps long. Having had this brilliant insight, I realised I still wasn't quite there (it's also not really my insight - read getting things done if you haven't already - brilliant book on how to define tasks among many other things - and read the e-myth for more on writing processes - yes those are both amazon.co.uk links I'm sure you'll work it out if you're in the US...). In my example above, I said \"IT support company\" but it's no good having a process that says \"do this for IT support then everything else you can think of\". You have to list these things out. So I started looking for a list of suppliers you could get links from and couldn't find one. So I wrote my own. And now because Rand taught me to over-share, I'm giving to you all as well. I'm sure it's not complete yet, but I will add to it with good suggestions from the comments: IT support web design / hosting telephony email service provider / email marketing company legal advice HR / recruitment coaching / business advice property services (including landlords / tenants) PR advertising software provider(s) - particularly industry software accountancy / audit training (again, particularly industry training) printing / graphic design food / drink / hospitality hardware / office furniture / computer equipment suppliers cleaning company industry suppliers (depending on the client's industry) conference organisers (either for your own seminars etc. or whose conferences you attend) artwork providers (local artists or galleries), florists etc. [Courtesy of whitespark] And of course don't forget PPC and SEO provider ;) As I said, I have been thinking about this and other elements of linkbuilding a lot recently as I have been hard at work on improvements to Distilled's linkbuilding process. It is unbelieveable - no matter how much you think you know about a subject - when you go back to scratch and try to read everything you can find on a subject, then try to write a process, you learn a hell of a lot. Thank you to those people who have already helped behind the scenes (props to Melanie Nathan for some particularly juicy ninja tips). As it progresses, I might well write more on the subject as I know it's one that many people struggle with, but I'll also make sure that I continue to write about the business stuff you've come to expect. Don't forget to share any suppliers I've missed in the comments (or any juicy linkbuilding tips)! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Full List of Suppliers to Ask for Links"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Full List of Suppliers to Ask for Links"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Will Critchlow\n          \n            Will Critchlow\n          \n            Will Critchlow"
}