{
  "url": "https://moz.com/blog/the-unpredictable-science-of-predicting-hits",
  "slug": "the-unpredictable-science-of-predicting-hits",
  "title": "The Unpredictable Science of Predicting Hits - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Social media and viral marketing are all about creating \"hits\" - building content that will resonate with the Linkerati audience in a way that encourages sharing, linking and participation. It's no easy task, and this past Sunday, the New York Times Magazine had a terrific article that paralleled…",
  "content": "The Unpredictable Science of Predicting Hits Social Media By: Rand Fishkin April 16, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 16, 2007 The Unpredictable Science of Predicting Hits Social Media The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Social media and viral marketing are all about creating \"hits\" - building content that will resonate with the Linkerati audience in a way that encourages sharing, linking and participation. It's no easy task, and this past Sunday, the New York Times Magazine had a terrific article that paralleled this struggle. From the piece - Is Justin Timberlake a Product of Cumulative Advantage? - ...professional editors, studio executives and talent managers, many of whom have a lifetime of experience in their businesses, are so bad at predicting which of their many potential projects will make it big. How could it be that industry executives rejected, passed over or even disparaged smash hits like “Star Wars,” “Harry Potter” and the Beatles, even as many of their most confident bets turned out to be flops? It may be true, in other words, that “nobody knows anything,” as the screenwriter William Goldman once said about Hollywood. But why? Of course, the experts may simply not be as smart as they would like us to believe. Recent research, however, suggests that reliable hit prediction is impossible no matter how much you know — a result that has implications not only for our understanding of best-seller lists but for business and politics as well. Luckily, in the world of linkbait, at least at the current time, experienced marketers are actually excellent at making predictions about the success or failure of a piece. At SEOmoz, we've launch a dozen linkbait pieces a month between clients and internal projects and have 70%+ success rates (phenomenally high compared to the subject of the NY Times piece). Neil & Cameron at ACS, Michael Gray at Wolf-Howl and others in the industry experience similar probabilities of widespread adoption. This article still captured my attention, and here's why - the writer discusses an experiment: In our study, published last year in Science, more than 14,000 participants registered at our Web site, Music Lab (www.musiclab.columbia.edu), and were asked to listen to, rate and, if they chose, download songs by bands they had never heard of. Some of the participants saw only the names of the songs and bands, while others also saw how many times the songs had been downloaded by previous participants. This second group — in what we called the “social influence” condition — was further split into eight parallel “worlds” such that participants could see the prior downloads of people only in their own world. We didn’t manipulate any of these rankings — all the artists in all the worlds started out identically, with zero downloads — but because the different worlds were kept separate, they subsequently evolved independently of one another. The results of their experiments were remarkable: In all the social-influence worlds, the most popular songs were much more popular (and the least popular songs were less popular) than in the independent condition. At the same time, however, the particular songs that became hits were different in different worlds, just as cumulative-advantage theory would predict. Introducing social influence into human decision making, in other words, didn’t just make the hits bigger; it also made them more unpredictable. If you're following this logic and translating it to the art and science of viral marketing for the web, whether that's via Digg or Flickr, Reddit or YouTube, MySpace or Netscape, the lesson is that the earliest viewers of the material have the greatest impact on how popular your content will become. Sadly, this lot isn't neccessarily predictable, though in communities like Digg and Reddit, at least at the current time, certain preferences have clearly emerged. The answer for a marketer (whether it's a record-producing New York Hip-Hop mogul or an SEO pushing the rankings of a client through Digg) seems clear - manipulate artificially. Convince people that you've already received some popularity and people like it and your task is made infinitely easier. So much for the quality content theory... BTW - Don't you love the fact that the piece's title contains \"Justin Timberlake,\" yet the story itself has no specific relation nor any mention of him? That's SEO, NY Times style :) p.s. Had to mention this because it was such a good post - How we Took a Blog from 0 to 2000 Subscribers in Just 12 Days - I think NxE is going to become a mainstay in my sidebar; their other posts are terrific, too. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Unpredictable Science of Predicting Hits"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Unpredictable Science of Predicting Hits"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Future of Content Success Is Social"
    },
    {
      "level": "H3",
      "text": "How To Get Buy-In by Setting Strategic Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Twitter’s Brand Equity: 17 Years & 12 Million Keywords"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}