{
  "url": "https://moz.com/blog/the-best-of-2011-posts-people-who-rocked-our-world",
  "slug": "the-best-of-2011-posts-people-who-rocked-our-world",
  "title": "The Best of 2011 - Posts & People Who Rocked Our World - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "What's better than unicorns and kittens happily leaping over rainbows with gold at the end? The Moz community, that's what!\n\n\tAt the end of every year we like to take a...",
  "content": "The Best of 2011 - Posts & People Who Rocked Our World Moz News By: Jennifer Sable Lopez December 22, 2011 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jennifer Sable Lopez December 22, 2011 The Best of 2011 - Posts & People Who Rocked Our World Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. What's better than unicorns and kittens happily leaping over rainbows with gold at the end? The Moz community, that's what! At the end of every year we like to take a look back, not only at which posts made an impact, but which people made an impact on the community as well. This year we're taking a peek at the top content on the blog based on thumbs up, visits, root domains, tweets and comments. Plus we have the added bonus of looking at community members who left the most comments, and those whose comments were the most thumbed up. If you've missed any of these posts over the past year, I invite you to grab a cup of coffee and start reading. I look forward to hearing about your favorite posts, plus your thoughts on why these posts did so well this year. Before we get too ahead of ourselves, I wanted to again remember GoodnewsCowboy, a long time community member whom we lost to cancer earlier this year. GNC was an amazing man and is sorely missed around here. For quick reference, check out the Top Posts of 2011 by: Thumbs Up Unique Visits Linking Root Domains Tweets Total Number of Comments And the community members who rocked our world: Top Comments of 2011 by Thumbs Up Top Users of 2011 By Total Comments A few notes about the data: 1. I'm no scientist, I did my best putting this together and I apologize now if I've screwed anything up. 2. All data was pulled in the past 24 hours, so some of the numbers may have changed slightly. 3. I'm not a scientist. :) Plus, I need to send a huge thank you to Casey Henry who helped me gather quite a bit of this data. Thank you Casey! Top Posts of 2011 By Thumbs Up Let's get this party started. First things first, I wanted to note that last year there were three posts with 100 or more thumbs up. This year, there were 41 posts with over 100 thumbs up. FORTY ONE. That's just crazy pants (as Joanna Lord would say). This of course made me want to figure out if the thumbs up was just a general inflation, better content, more traffic, what. I think you'll see it's a generous helping of all of that combined. For the first time the blog schedule was pretty well organized (ehem.. I may be the one who organizes this ;), we specifically reached out to get great guest bloggers, we added more amazing Associates to write for the blog and our traffic was through the roof (more on that later). But enough of my mumblings, let's get to the good stuff. Thumbs Up: Help Raise Money for New Zealand March 3rd, 2011 - Posted by jennita This post is actually the top post in every single category listed below. But in order to show off more great content, I pulled it from the other lists since it dominated them all. :) I wanted to call it out here and again thank everyone for all their donations to the New Zealand Red Cross after the horrible earthquakes earlier this year. It was absolutely amazing to see the community come together so quickly. 1. How Google's Panda Update Changed SEO Best Practices Forever - Whiteboard Friday June 23rd, 2011 - Posted by Aaron Wheeler Panda. As the title says, Google Panda changed SEO forever and everyone wanted to watch the video about it. Number one Yo! 2. Duplicate Content in a Post-Panda World November 16th, 2011 - Posted by Dr. Pete Panda... again. Pete knocks this one out of the ball park and inbound marketers across the globe liked this puppy. In fact people liked it so much they asked for him to make a PDF version that they could print out for themselves and others. Sweet. 3. The Responsibilities of SEO Have Been Upgraded July 12th, 2011 - Posted by randfish So, an SEO isn't just an SEO anymore, we've become so much more. Inbound Marketing anyone? 4. How Organized Spam is Taking Control of Google's Search Results January 28th, 2011 - Posted by invseo Whee! This awesome post started out in YouMoz and very quickly got promoted to the main blog. It really got people riled up as we headed into the new year. 5. 4 Graphics to Help Illustrate On-Page SEO November 8th, 2011 - Posted by randfish In grand Rand fashion, he put together these great images that will help us to demonstrate a bit easier what on-page SEO really is. You know for that boss or client who just doesn't get it. ;) 6. Which Type of Link Anchor Text is the Most Effective? [An Experiment] October 11th, 2011 - Posted by jamesagate Another top post that started off in YouMoz (YAY YouMoz!!) and won the hearts of the community. James ran an experiment and walked us through what seemed to work best! 7. The Noob Guide to Online Marketing (With Giant INFOGRAPHIC) February 9th, 2011 - Posted by Oli Gardner I'm not quite sure this one even needs any introduction. If you're reading this post, I'm sure you've already seen the Noob Guide (as we call it around the office). Once again Oli hits the top 10 list with an infographic (he was on it last year too #goOli!). 8. Just How Smart Are Search Robots? November 29th, 2011 - Posted by iPullRank They are smarter than you think, and Mike King explains it all, Pacman style! 9. Quantifying the Impact of Google's Keyword Referral Data Shutdown November 14th, 2011 - Posted by randfish Whoa, whoa, whoa! What's up with this (not provided) bs? 10. Better Understanding Link-based Spam Analysis Techniques July 31st, 2011 - Posted by Justin Briggs Justin gets into the mind of a search engine to help us understand link-based spam detection. Sounds geektastical, doesn't it?! Top Posts of 2011 By Unique Visits Great, we've seen the posts that got the most thumbs up, but are they the same as the ones that got the most traffic? I'll give you a hint, only two of the top thumbed, are the same as the most trafficked. Which means eight of them are different. The question is, does this mean these posts got a lot of traffic from new users that didn't create accounts in order to thumb up the posts? Sadly we may never know. I'd love to hear your thoughts in the comments though. Now let's look at the traffic! 1. The Noob Guide to Online Marketing (With Giant INFOGRAPHIC) February 9th, 2011 - Posted by Oli Gardner Yep, you'll notice a trend here... the Noob Guide is on ALL OF THE LISTS. :) #goOli 2. How Google's Panda Update Changed SEO Best Practices Forever - Whiteboard Friday June 23rd, 2011 - Posted by Aaron Wheeler Pppppppppanda! 3. White Hat SEO: It F@$#ing Works April 10th, 2011 - Posted by randfish This was in response to a post claiming that White hat SEO is a joke, which Rand easily proved otherwise. 4. The New Google Social Network - Google+ June 30th, 2011 - Posted by caseyhen z0mg! Google created a social network that doesn't suck! Everyone go get your account noooowwwwwwww. 5. 10 Ugly SEO Tools that Actually Rock September 5th, 2011 - Posted by Cyrus Shepard Apparently people like ugly. Kidding, kidding. What this really says is that people love tools and especially ones that kick booty. 6. Facebook + Twitter's Influence on Google's Search Rankings April 19th, 2011 - Posted by randfish Rand takes a look at some early correlation data on social influence in Google SERPs. You'll notice a trend this year and that's social, social, social. 7. An SEO Checklist for New Sites - Whiteboard Friday September 22nd, 2011 - Posted by Aaron And the crowd went wild! Seriously though, everyone knows someone who has a new website, and they came to watch this one in droves. 8. Blog Design for Killer SEO - Infographic July 12th, 2011 - Posted by Cyrus Shepard These days everyone tries their hand at Infographics. But Cyrus (and his wife who designed it) put the \"fogra\" back in Infographics. It's a great visual on blog design with SEO in mind. 9. Beating Google's Panda Update - 5 Deadly Content Sins August 16th, 2011 - Posted by Cyrus Shepard Everyone wanted to learn how to make sure they didn't get hit by Panda, or pull themselves out of the Panda abyss. 10. New Edition of the Ranking Factors for 2011 is Now Live! June 6th, 2011 - Posted by randfish Can I get a w00t w00t! Top Posts of 2011 by Linking Root Domains Well we're SEOs aren't we? Then we must take a look at the posts that have received the most backlinks! The best way to do this is to look at the number of linking root domains instead of total number of backlinks. As with everything else, you'll notice that last year there were three posts with over 100 linking root domains. However this year, there were twelve posts with over 100. SEO really does work?! What?! 1. Facebook + Twitter's Influence on Google's Search Rankings April 19th, 2011 - Posted by randfish Everyone who wrote a post about how Facebook & Twitter are now helping with rankings, must have linked to this post. Love! 2. How Google's Panda Update Changed SEO Best Practices Forever - Whiteboard Friday June 23rd, 2011 - Posted by Aaron Wheeler Poor little photos of pandas all across the web being used in posts about Google Panda. All the while linking to this highly informative Whiteboard Friday. 3. A Tweet's Effect On Rankings - An Unexpected Case Study February 15th, 2011 - Posted by jennita Well lookie there, I MADE IT TO THE LIST. I don't need no stinking thumbs or traffic, I'm down with the backlinks! :) (ok... I'll move on now) 4. The Noob Guide to Online Marketing (With Giant INFOGRAPHIC) February 9th, 2011 - Posted by Oli Gardner Noob. Guide. 'Nuf. Said. 5. Google's Farmer/Panda Update: Analysis of Winners vs. Losers March 3rd, 2011 - Posted by randfish Oooh everyone wants to know who made out well with Panda and who got crushed. 6. Google +1 And The Rise of Social SEO March 30th, 2011 - Posted by Tom Critchlow Remember when Google +1 came out before Google+? Yea, that was odd. Anyway... Tom wrote a great post on how it changed SEO! 7. Blog Design for Killer SEO - Infographic July 12th, 2011 - Posted by Cyrus Shepard Infographics = links. 8. Experiments on Google+ and Twitter Influencing Search Rankings July 5th, 2011 - Posted by Cyrus Shepard Hmm more talk of this social thing helping SEO, we might be on to something here. 9. White Hat SEO: It F@$#ing Works April 10th, 2011 - Posted by randfish And if you haven't read this post yet, go F@$#ing read it! (sorry for the bad language, but Rand started it) 10. Social Annotations in Search: Now Your Social Network = Rankings June 22nd, 2011 - Posted by randfish If your aunt Betsy shares a post about gluten free brownies, you might see that in your SERPS. Wait. What?! Top Posts of 2011 by Tweets Ya'll have been tweeting your little fingers off this year. In 2010 there were only two posts with over 1,000 tweets, but in 2011 there were 55. This may very well be the reason for all that traffic above. :) I need to give a huge thanks to Dr. Pete for gathering this data for me at the last minute (that's how I roll). Now let's see what people like to tweet about. I should probably note that five of the 10 top tweeted posts ARE ABOUT TWITTER. heh. I know what I'm going to be writing about more in 2012. 1. The Noob Guide to Online Marketing (With Giant INFOGRAPHIC) February 9th, 2011 - Posted by Oli Gardner Holy tweets batman. 2. Yes, You Really Can Build Links With Twitter - Whiteboard Friday September 1st, 2011 - Posted by caseyhen You can build links with Twitter? OMG I have to tweet this! 3. Facebook + Twitter's Influence on Google's Search Rankings April 19th, 2011 - Posted by randfish This is starting to be like deja vu. :) 4. 10 Ugly SEO Tools that Actually Rock September 5th, 2011 - Posted by Cyrus Shepard Any time I see a post being tweeted that has the word \"ugly\" in it, I totally click. Cyrus is a tweetbait master, who knew?! 5. How Google's Panda Update Changed SEO Best Practices Forever - Whiteboard Friday June 23rd, 2011 - Posted by Aaron Wheeler Panda. SEO. Changed. Forever. 6. A Tweet's Effect On Rankings - An Unexpected Case Study February 15th, 2011 - Posted by jennita Ooh Ooh Ooh! That's me again. (Every post from here on forward shall be about Twitter) 7. Experiments on Google+ and Twitter Influencing Search Rankings July 5th, 2011 - Posted by Cyrus Shepard Google+. Twitter. Rankings. Tweet it. 8. The Tweet Effect: How Twitter Affects Rankings June 1st, 2011 - Posted by dohertyjf Hehehe this is just getting funny the number of top tweeted posts talking about twitter. It's so meta I might cry. But really, John's post rocked the twitters. 9. Tracking the KPIs of Social Media September 7th, 2011 - Posted by randfish Love, love, love this post. I may have even tweeted it 20 times or so from various accounts. I mean... wait... you can't prove anything! 10. White Hat SEO: It F@$#ing Works April 10th, 2011 - Posted by randfish Don't make me tell you again. Top Posts of 2011 by Total Number of Comments Here's the thing, mozzers comment a lot. It's really quite amazing how many comments a post will get, even the mediocre ones. There are tons of exceptional industry blogs out there, but I've never seen one get this many comments to every post. I absolutely love that the community is so generous! Below we'll take a look at the top commenters, but for now let's see which posts caused the most disucssion. Oh! Most of these have been mentioned above, so I left out my comments (since you're probably getting tired of them anyway). 1. How Google's Panda Update Changed SEO Best Practices Forever - Whiteboard Friday June 23rd, 2011 - Posted by Aaron Wheeler 2. 32 SEO Tactics to Avoid in 2011 January 18th, 2011 - Posted by Lindsay 3. White Hat SEO: It F@$#ing Works April 10th, 2011 - Posted by randfish 4. The Noob Guide to Online Marketing (With Giant INFOGRAPHIC) February 9th, 2011 - Posted by Oli Gardner 5. Article Marketing: Mostly A Scam - Whiteboard Friday August 25th, 2011 - Posted by Aaron Wheeler 6. Duplicate Content in a Post-Panda World November 16th, 2011 - Posted by Dr. Pete 7. Quantifying the Impact of Google's Keyword Referral Data Shutdown November 14th, 2011 - Posted by randfish 8. Competitive Analysis in Under 60 Seconds Using Google Docs May 15th, 2011 - Posted by Tom Anthony 9. The Responsibilities of SEO Have Been Upgraded July 12th, 2011 - Posted by randfish 10. Google +1 And The Rise of Social SEO March 30th, 2011 - Posted by Tom Critchlow Top Comments of 2011 by Thumbs Up Yay! Now we get to take a look at some of the people making \"waves\" in the community. This list shows the top 10 comments based on the number of thumbs up it received. Some of them are cooky and fun, while others are direct and to-the-point. Take a peek: 1. SandroM | January 19th, 2011 32 SEO Tactics to Avoid in 2011 2. Jonathon Colman | September 24th, 2011 Crawl Outage - An Update and What We're Doing 3. randfish | September 2nd, 2011 Yes, You Really Can Build Links With Twitter - Whiteboard Friday 4. russvirante | September 26th, 2011 Crawl Outage - An Update and What We're Doing 5. iulian lita | January 18th, 2011 32 SEO Tactics to Avoid in 2011 6. Liza Shulyayeva | July 12th, 2011 The Responsibilities of SEO Have Been Upgraded 7. Dan Deceuster | September 15th, 2011 5 Reasons Why Copying Links is Bad for You 8. Frederik Hyldig | August 26th, 2011 Article Marketing: Mostly A Scam - Whiteboard Friday 9. gfiorelli1 | July 12th, 2011 The Responsibilities of SEO Have Been Upgraded 10. randfish | July 6th, 2011 Experiments on Google+ and Twitter Influencing Search Rankings Top Users of 2011 By Total Comments So who commented the most you ask? Well if you're around the blog much you probably already know that Gianluca is the king of comments. I wanted to also note that our friend GoodnewsCowboy (who I mentioned above) was the top commenter last year. This year he fell to the 15th spot, and that's only with having comments through March 16th. One note about the top users, all Associates and staff have been removed from this list (There were five that would have made the list: Rand, Dr. Pete, Cyrus, myself & iPullRank). So who are our chatty Kathy's? 1. gfiorelli1 mozPoints: 5578 | Rank: 3 2. James Norquay mozPoints: 1692 | Rank: 16 3. Jenni Brown mozPoints: 583 | Rank: 71 4. Moosa Hemani mozPoints: 535 | Rank: 82 5. algogmbh_petra mozPoints: 1179 | Rank: 26 6. Dubs mozPoints: 284 | Rank: 162 7. webpagefxseo mozPoints: 210 | Rank: 269 8. joshuahedlund mozPoints: 330 | Rank: 136 9. SEOTakeaways mozPoints: 1088 | Rank: 31 10. Stephen mozPoints: 1724 | Rank: 15 Are you as enamored as I am with this post? I sure hope so! It was a ton of fun to put together (even though you may have heard me grumbling on twitter about it). I always love taking a look back at the past year's posts and realizing how much has really happened in a year! This year the obvious themes were the convergence of search and social, plus the Panda update. I hope you'll bookmark this post and read through the ones you may have missed throughout the year. What was your favorite post this year? Spectacularly awesome image of unicorns, kittens and rainbows from Sarcastic Monday. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Best of 2011 - Posts & People Who Rocked Our World"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Best of 2011 - Posts & People Who Rocked Our World"
    },
    {
      "level": "H2",
      "text": "Top Posts of 2011 By Thumbs Up"
    },
    {
      "level": "H2",
      "text": "Top Posts of 2011 By Unique Visits"
    },
    {
      "level": "H2",
      "text": "Top Posts of 2011 by Linking Root Domains"
    },
    {
      "level": "H2",
      "text": "Top Posts of 2011 by Tweets"
    },
    {
      "level": "H2",
      "text": "Top Posts of 2011 by Total Number of Comments"
    },
    {
      "level": "H2",
      "text": "Top Comments of 2011 by Thumbs Up"
    },
    {
      "level": "H2",
      "text": "Top Users of 2011 By Total Comments"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez"
}