{
  "url": "https://moz.com/blog/the-true-value-of-top-publisher-links",
  "slug": "the-true-value-of-top-publisher-links",
  "title": "The True Value of Top Publisher Links - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Which top-tier publishers link out the most, and which confer the most value? Kristin Tynski analyzes the data.",
  "content": "The True Value of Top Publisher Links Link Building | Public Relations By: Kristin Tynski January 20, 2020 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Kristin Tynski January 20, 2020 The True Value of Top Publisher Links Link Building | Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I’m often asked about what results are earned through content marketing and digital PR. So I decided to take a data-driven approach to quantifying the value of links from top-tier press mentions by looking at the aggregate improvements seen by a group of domains that have enjoyed substantial press attention in the last few months. Then I examined which publishers can have the biggest impact on rankings. My goal was to answer this question: What sort of median bump can be expected when your brand secures media coverage? And how can you potentially get the biggest organic lift? First off: Top-tier links matter a great deal This chart represents the correlation between the number of times a site was linked to from within the article text of publishers and its rankings and traffic. Considering the sheer number of possible variables that contribute to rankings changes (on-site factors, amount and quality of on-site content, penalties, etc.) seeing R-values (which determine the linear relationship) this high is a good result. In general, the higher the R-score, the stronger the relationship between number of links from publishers and improvements in organic ranking. We found significant relationships between the number of mentions on news sites ranked in the Top 500 and an even stronger relationship for those ranked within the Top 300. The likely reason for this is twofold: Top 300 publishers confer more Domain Authority than less popular sites.Top 300 publishers often have larger syndication networks and broader visibility, leading to more links being built as the result of a press mention, leading to more Domain Authority accumulation overall. Which publishers link out the most? When pitching publishers, it can be extremely useful to understand who is most likely to actually provide a link. Some publishers have policies against outbound links of any type or nofollow all outbound links. Looking at the huge dataset, I got a better understanding for which publishers link out to other sites most frequently. Notice the large number of local news sites with high numbers of outbound links. Local news is often keen to link out. Unfortunately, most local news won’t have large scale syndication, so looking at top-tier publishers with large numbers of outbound links is likely a better strategy when developing a pitch list. So when you remove those from the list, here are the winners. The top 15 national publishers that provide links ForbesThe New York TimesZDnetNPRPR News WireSeeking AlphaThe ConversationUSA TodayCNNBenzingaBusiness InsiderQuartzThe HillHeavyVox Sites like Forbes only dole out nofollow links, but many of these others provide dofollow links (in addition to just being great, high-authority coverage to achieve). Some industry specific options, like Seeking Alpha, Benzinga, and The Hill, can make for great vertical-specific dream publications to strive for coverage on. Which publishers confer the most value in terms of organic search improvements? Looking at this database, it’s possible to look at the median organic traffic gains aggregated by the site that gave the link. This view is filtered to only include sites that had linked out 100+ times in order to reduce outlier publishers with small volumes of outbound links to only a handful of sites. More popular sites are clustered near the top, further reiterating the fairly obvious point that the more popular a site, the more value a link from them will be in terms of improving organic ranking. While most of the top-value links are from these sites, there are quite a few mid-tier sites that seem to grant disproportionate value, including several local news sites and niche authoritative publishers. Methodology I used The GDELT Project, a massive repository of news articles that are searchable using BigQuery, to extract the links from all news articles over the last year. Then I aggregated them by root domain. For each domain from the GDELT dataset that was mentioned in a news article at least 30 times, we then pulled organic data from SEMrush’s API for each one. I combined the SERP change numbers to the cleaned GDELT data by matching it to the URL of the linked-to site. This gave me organic changes (traffic volume, price, ranking keyword volume change) for each of the root URLs linked to more than 30 times from within the text of articles in the GDELT scrape. From there, I ran a correlation analysis to see if we could find a statistically significant influence of news coverage on rankings. Conclusion Using insights like the ones above, you’ll be able to craft content better suited to those specific writers and audiences, increasing your chances of getting extremely impactful links via a digital PR strategy. You can download the Tableau notebook and sort in the desktop version to explore the different sites relevant to your vertical. While not all of them may accept outside content, it’s a great start for building a “dream” pitch list. Study the type of content they typically publish, what their audience seems to enjoy most (based on shares and comments), and consider using these insights to hone your content strategy. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The True Value of Top Publisher Links"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The True Value of Top Publisher Links"
    },
    {
      "level": "H2",
      "text": "First off: Top-tier links matter a great deal"
    },
    {
      "level": "H2",
      "text": "Which publishers link out the most?"
    },
    {
      "level": "H3",
      "text": "The top 15 national publishers that provide links"
    },
    {
      "level": "H2",
      "text": "Which publishers confer the most value in terms of organic search improvements?"
    },
    {
      "level": "H2",
      "text": "Methodology"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kristin Tynski\n          \n            Kristin Tynski"
}