{
  "url": "https://moz.com/blog/the-future-of-the-moz-community#youmoz",
  "slug": "the-future-of-the-moz-community",
  "title": "​The Future of the Moz Community - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "With the recent changes at Moz, there's been a lot of speculation about the future of our community. I'd like to try to set the record straight and provide an honest account of where we're at and where we're headed.",
  "content": "​The Future of the Moz Community Moz News By: Dr. Peter J. Meyers September 8, 2016 Table of Contents Copied! By: Dr. Peter J. Meyers September 8, 2016 ​The Future of the Moz Community Moz News As many of you know, Moz recently went through a major reorganization, which included the loss of 28% of our staff. Our Community team was heavily impacted, which has understandably led to speculation about the future of the Moz Community. I want to specifically address those concerns, project by project. The Moz Community is an essential part of our past and future, and while we can’t ignore the reality and difficulty of our recent losses, we believe strongly in our Community and are doing our best to chart a path forward. A personal note I asked to write this post, knowing it wouldn’t be easy. I’ve been a member of the Moz Community for almost 10 years. When my first YouMoz post was promoted in April 2007, I didn’t realize it would be the start of a decade-long journey. The Moz Community made my career in SEO possible, and I’ll always be grateful for that. The people affected by the past few weeks are my peers and friends, and I take that loss personally. It’s ok to take that personally. At the same time, there are 160 peers and friends still at Moz trying to figure out how to do more with less, and they believe in our Community, too. We will make mistakes along the way, and we will need your help. I and the entire Moz team would also like to thank the departing members of the Community team – Jen, Erica, Charlene, and Matt – for all of their contributions over the years building and maintaining a thriving community. This has been a month of difficult decisions driven by both unpleasant financial realities and shifts in Moz strategy, but we do not take their contributions for granted. A few clarifications Before diving in project-by-project, I’d like to clarify a few points. First, we did not lose the entire Community team – Megan and Danielle are still at Moz, and they’ve been with the team since 2011 and 2013, respectively. They know our Community well. The day-to-day of our main blog is (and has been) run by members of our Audience Development team (Trevor and Felicia, with the help of the Marketing team), which is separate from the Community team. Moz Q&A and Social are a joint effort between Community, Customer Support, and a group of dedicated industry experts known as Moz Associates. It takes a lot of hard-working, dedicated people to create a world-class community. The Big List Here is a list of all of our major Moz Community-focused projects, and the status of those projects as best we know today. I will try to be as transparent as possible. (1) MozCon 2016 Please be assured that MozCon 2016 is full speed ahead. Erica and Charlene graciously agreed to stay with Moz through the conference, and everything will proceed as originally planned. We look forward to seeing many of you in Seattle next week. When you see them, please thank Erica and Charlene for everything they’ve done to make MozCon a great event. (2) MozCon 2017 We’ve had many conversations about MozCon 2017 in the past two weeks, and have committed to moving forward with our flagship event. As originally planned, MozCon 2017 will take place in Seattle, from July 17–19. We realize that an event of the size and quality of MozCon is not an easy thing to pull off, but we have many team members who have been actively involved in past events and we will collectively work hard to maintain the MozCon tradition. (3) Moz Blog Before Moz was a company and long before it was a product, there was a blog. The Moz Blog has our full support, will remain a core part of our Community, and we will continue to support and update big content projects, including The Beginner’s Guide to SEO. We are 100% committed to maintaining strong educational resources for the SEO community. (4) YouMoz Prior to the reorganization, we had started some difficult conversations about YouMoz. As our Community and the entire world of content marketing has evolved, the quantity of submissions has increased while the quality has suffered. This left our team spending a large amount of time on managing the queue and editing posts. It also meant that good posts had to wait longer to be published, frustrating our best contributors. In the near future, YouMoz will be phased out in favor of a better guest contributor process and system for the Moz Blog. Our hope is to offer guest authors higher-profile opportunities on the main blog. We will also be exploring ways to allow our community to pitch blog topic ideas without submitting an entire post, to save everyone time and frustration.I have a long, personal history with YouMoz, and this is a difficult decision, but as a content marketer I also know that our world has changed dramatically in the past couple of years. We will do our best to adapt to those changes and give our Community the chance to contribute in meaningful ways. (5) Moz Q&A A few months back, we started looking for a new technology platform for the Q&A forum, one that could better serve our evolving community. Those plans will continue forward. Our Community team is working hard to launch a better Q&A engine that can support both our Moz Pro and Moz Local customer communities, as well as the broader SEO community. We are fully committed to a new and improved Q&A in the coming months that supports a wide range of SEO conversations and helps the next generation of marketers grow in their careers. (6) Social media Obviously, the Community team had a huge hand in growing and managing our various social channels. Many of those channels have also changed, with Facebook pushing hard toward paid inclusion and Google+ facing an uncertain future. Megan, Danielle, and our Customer Support team are committed to actively supporting Twitter and our other existing channels, even as we look for the best ways to engage our Community in the broader social world.We will continue to explore new channels, such as Instagram, as well as better ways to engage with old channels, including LinkedIn. Thanks to support teams in the UK and Australia, we will soon have 24/7 social coverage on major channels. The coming months Ultimately, our commitment to the Moz Community will be judged by our actions in the coming weeks and months and not just by our words. Our resources are more constrained now, but our dedication is as strong as ever. I’d like to thank all of you for supporting us over the years, and I hope that you will continue this journey with us as we explore the future of the industry and the Community. If you have specific questions or concerns, please feel free to ask in the comments, and I will do my best to address them (or find someone on our team who can). We look forward to seeing many of you at MozCon next week! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "​The Future of the Moz Community"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "​The Future of the Moz Community"
    },
    {
      "level": "H2",
      "text": "A personal note"
    },
    {
      "level": "H2",
      "text": "A few clarifications"
    },
    {
      "level": "H2",
      "text": "The Big List"
    },
    {
      "level": "H3",
      "text": "(1) MozCon 2016"
    },
    {
      "level": "H3",
      "text": "(2) MozCon 2017"
    },
    {
      "level": "H3",
      "text": "(3) Moz Blog"
    },
    {
      "level": "H3",
      "text": "(4) YouMoz"
    },
    {
      "level": "H3",
      "text": "(5) Moz Q&A"
    },
    {
      "level": "H3",
      "text": "(6) Social media"
    },
    {
      "level": "H2",
      "text": "The coming months"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}