{
  "url": "https://moz.com/blog/the-long-dark-teatime-of-rands-decisions",
  "slug": "the-long-dark-teatime-of-rands-decisions",
  "title": "The Long, Dark Teatime of Rand's Decisions - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Rand's Warning: This post is very long, very personal and, while highly informational, doesn't contain many tips on how to perform SEO or get your content or your site in front of the right people. What it does contain is a bit of history about our business here at SEOmoz and a sharing of the…",
  "content": "The Long, Dark Teatime of Rand's Decisions Moz News By: Rand Fishkin May 9, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 9, 2006 The Long, Dark Teatime of Rand's Decisions Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Rand's Warning: This post is very long, very personal and, while highly informational, doesn't contain many tips on how to perform SEO or get your content or your site in front of the right people. What it does contain is a bit of history about our business here at SEOmoz and a sharing of the issues we're struggling with for the future. Why am I writing a post like this? To be honest, there's two reasons. First, our name, SEOmoz, isn't just short and memorable, it's representative. Even though we're a for-profit enterprise, I've always strived to keep the members of SEOmoz and the readers of this blog informed about everything we do – it's part of our creed to keep this “project”, which has become a successful consulting business, “open source”. My belief is that this philosophy of “moz” - open, sharing, freely available and participatory - is one of our greatest assets and posts like this keep that philosophy a reality by making our business as transparent as can be. The second reason is selfish – I need your advice. The comments here at SEOmoz are one of the greatest sources of inspiration, feedback and quality advice we've got. I rely on the input given to help navigate the direction of the blog's content and in this instance, the future of our business. I need feedback more than ever. On to the struggle itself... Right now, SEOmoz is in a very unique position. We've found ourselves torn between two worlds, navigating uncertain waters without the benefit of long experience. Our central quandary is – what direction do we take? Our options: A) Continue to serve clients, provide SEO and web marketing consultation and generate relatively robust profits as a firm. We're poised to grow to 8 full-time employees in the next month (from the 3 that we had last October) and from that vantage, we'll be in a position to bring in between $700K and $1.25 million in revenue over the next 12 months. Even with significant overhead and expenses, it makes for a well paid team and a decent budget for growth. B) Ween ourselves off clients and develop our own content play in the Web 2.0 landscape. As fun as it is to see the traffic, visibility and revenues of our clients launch skyward as we work with them, temptation begs the question... “why not do it for yourself?” Indeed, I can't think of a meeting with a venture capitalist or experienced entrepreneur in which the question hasn't been raised - “If you're so good at this, why serve the interests of others?” I think I know how stock brokers must feel. Before you ask, the answer is yes – we have an idea and a project ready to pursue to create the next Flickr/Facebook/Writely/Craigslist/What Have You... It's a question of timing, fear and uncertainty. The safe play is option A – to continue to grow steadily, bringing aboard new and exciting clients, helping them with the familiar ground of optimization, content generation, promotion and marketing. But, I can't delude myself into thinking that the current economic climate of investment, growth and prosperity for Internet companies will last forever. Indeed, having been a solid part of the dot-com crash, it's hard for any entrepreneur to ignore the lessons of the cyclical market. On the flipside, I have no illusions that despite the innovation of our idea, it won't remain an untouched landscape forever. Indeed, even now, I see potential competitors who must be eyeing the same horizon lustily, dreaming in their showers of ways to become the “Amazon” of the market. So, why now? Why the sudden crossroads? The answer is – we've been offered financing, and not just from a single source. Our connections to the worlds of private equity have aroused interest from 3 different groups, none of whom have even heard our idea pitched to them, but all anxious to know whether we have something up our sleeve that's ready to receive seed funding. It seems odd to me that without ever seeing an idea on paper, I've been independently approached by these potential investors, but I see some clear signs that suggest why this is happening: The blogosphere has made investing in “unknowns” much more difficult. Finding a company that no one else has heard of, particularly in the consumer Internet field, is nearly impossible for investors in the current marketplace, so they're seeking instead to find companies that don't yet exist and ideas that have never been put on paper. Our profile and experience has garnered attention. It's undeniable that press like that received for the Web 2.0 Awards, the Beginner's Guide to SEO and the blog itself influences those investors who observe the online field. SEO itself is exciting because of the power targeted visitors can deliver. The resurgence of the online advertising model and the power of search engines to drive revenue has investors seeking plays to take advantage of the boom. Our passion for SEO (and all things online) is infectious and overwhelming. I think people often walk away from meetings with me with the same giddiness that I ooze from every pore when I start talking SEO, linkbait, Web 2.0 and the power of the Internet. I've never been a “salesy” guy – and, in fact, I never try to sell us (SEOmoz), per se. What I sell (without really trying) is the idea of the Internet as a frontier where anything is possible with right tools (those tools being – targeted traffic, passionate users and the possibility of dominating your competition on the web). The people I interact with seem to make the natural leap to opportunity and possibility on their own. I hate to come off as conceited or full of myself, and in fact, I harbor no delusions. We've come from humble beginnings, not just in the field of SEO, but in the field of business. Many folks don't know that I financed SEOmoz personally through debt, and had months after the crash where, between the three of us (Matt, myself and Gillian), only one person took home a paycheck. Gillian (my mom) spent some dark, dark days managing our finances over the last 5 years – days that affected her marriage to my father, her ability to care for my brother and sister and her spirit. I'm overwhelmed that I can look forward to a day in the next 2-3 months when our entire debtload (from years of losses) will be erased. I didn't learn SEO overnight, either. My early posts from SEOChat (only 3-4 years ago), show my inexperience and naivety with a field that is immensely complex. As much as SEO comes as second nature and logic to me now, I can certainly empathize with those who aren't versed in the subject. I regularly read 20-30 blogs, browse through dozens of forum threads and watch SERPs across dozens of industries just to stay on top of the game – and I learn something new every single day. The field of SEO has been a forgiving learning environment and the people of SEO – you – have made this business viable. I owe the success of SEOmoz as much to forum posters, conference speakers (and attendees), social taggers and bloggers as I do to our successes with projects like Avatar and press like Newsweek. To be totally honest, I think that more than anyone else outside the organization, I owe Danny Sullivan a good 20% cut on the business (I'll have to make it up to him in conference tickets). With a bit of luck, I've been able to give back a little, too, through referred business, a little link love and a healthy dose of promotion for the industry as a whole. Now for the shakedown – a list of positives and negatives, fears and hopes for the future of SEOmoz. Do it Rand, take the money: We could develop our idea in 4-6 months, rather than the 18-24 months we'd need to finance and develop it without outside help. With VC backing, our network of influencers, business consultants, accountants, intellectual property lawyers and experienced enterpreneurs could help to support our effort to grow quickly and minimize competitive risks. Even if the idea failed, we'd have the security of money we didn't owe to a bank or collection agency should things turn sour. We could maintain our current business, rejecting only new clients, and still keep a presence in the SEO world should we decide to re-engage the consulting sphere. External pressure would help to keep us focused and external advice could help us avoid pitfalls in the road. If we don't take the leap now, it may never become an opportunity again. Someone could enter the space, the market could collapse or worse yet, our lives could change to a profile that could no longer accept the risk inherent in taking this path. At this stage in our lives, we don't have children or spouses to care for, nor elderly family members requiring financial support. It's a rare window in any person's life in which financial security is flexible. Don't risk it, Rand, you're on the right path: Could investors look at our idea, fall in love, reject our plan and recruit their own team to build the project, betraying us and stealing our idea? Would we have a legal leg to stand on? Could we hope to win in court against a far better equipped opponent? What would an ownership stake look like – 10%, 20%, more? What recourse would we have if we wanted to buy back the investment shares in the future to once again have complete ownership? If we get a $500K investment, will it cost us $5mil or $50mil to get that ownership back if things go well? If we pursue this project with outside financing, will we be able to maintain sovereignty over its integrity, its offerings and its revenue model (which, as we've conceived it, is back-loaded and not especially aggressive)? Will we have the power to say “no” to a buyout offer should one come along down the road? If we want to maintain control of the company, but are forced to provide an “exit strategy” for investors, who will win that struggle? Will we have the freedom and free time to continue our many forays into experimental projects for the SEOmoz site and the SEO community? We've only recently become largely independent from outside funds – are we ready to accept the responsibility of investment? Will our consulting projects suffer from a lack of attention? Will our reputation in the industry? If we can't contribute to the SEO world in the form of conference speakings, online articles, etc. (the very things that got us where we are), have we given up too much? These are hard questions for me to answer. Despite almost 10 years in the web development and Internet consulting/marketing industry (only 4 in SEO), I recognize that shouldering a decision like this will come as a challenge no matter which path we take. I wear a beard to help hide my age and present a more \"commensurate with expectations\" profile to clients and business associates but in truth, there's still a 26-year old making decisions for a great number of people – not only those we employ, but the customers we serve, the readers and contributors to the blog, the online and offline professional community and the businesses we help guide. If ever there was a time to make the right decision, it's now. So, whether you've got a direct position on the issue or just some helpful advice to offer, it would be greatly appreciated. Thanks for reading all the way through this Monday night rant. Back to our regularly scheduled programming tomorrow – I promise. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Long, Dark Teatime of Rand's Decisions"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Long, Dark Teatime of Rand's Decisions"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}