{
  "url": "https://moz.com/blog/the-localup-advanced-2015-agenda-is-here",
  "slug": "the-localup-advanced-2015-agenda-is-here",
  "title": "The #LocalUp Advanced 2015 Agenda Is Here - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Get the low-down on the LocalUp Advanced agenda. We're planning some great sessions and workshops, making sure you get face time with your favorite speakers on Saturday, February 7.",
  "content": "The #LocalUp Advanced 2015 Agenda Is Here Local SEO | Marketing Industry | SEO Events By: Erica McGillivray December 9, 2014 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Erica McGillivray December 9, 2014 The #LocalUp Advanced 2015 Agenda Is Here Local SEO | Marketing Industry | SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Editor's note: Hoping to attend a future Moz Conference? We'd love to see you! You may heard that in partnership with Local U, we're putting on a local SEO conference called LocalUp Advanced on Saturday, February 7. We're super-thrilled to be able to dive more into the local SEO space and bring you top speakers in the field for a one-day knowledge explosion. We're expecting around 125-150 people at our Seattle headquarters, so this is your chance to really chat with speakers and attendees one-to-one with a huge return on investment. Moz Pro or Local U Subscribers $699 General Admission $999 LocalUp Advanced 2015 Agenda 8:00-9:00am Breakfast 9:00-9:05am Welcome to LocalUp Advanced 2015! with David Mihm 9:05-9:30am Pigeons, Packs, & Paid: Google Local 2015 with Dr. Pete Meyers In the past year, Google shook the local SEO world with the Pigeon update, rolled out an entirely new local pack, and has aggressively dabbled in local advertising. Dr. Pete covers the year in review, how it's impacted the local landscape, and what to expect in 2015. Dr. Pete Meyers is the Marketing Scientist for Moz, where he works with the marketing and data science teams on product research and data-driven content. He's spent the past two years building research tools to monitor Google, including the MozCast project, and he curates the Google Algorithm History. 9:30-9:55am Local Battlegrounds - Tactics, Trenches, and Ghosts with Mike Blumenthal Join Professor Maps and take a ride in the Way Back Whacky Machine to look at Google's technologies, tactics, and play books used to create, shape, and dominate the local ecosystem in their image. Learn what's relevant to marketing today and how these changes are shaping Google's coming battles in the space. If you're in Local, then you know Mike Blumenthal, and here is your chance to learn from this pioneer in local SEO, whose years of industry research and documentation have earned him the fond and respectful nickname 'Professor Maps.' Mike's blog has been the go-to spot for local SEOs since the early days of Google Maps. It's safe to say that there are few people on the planet who know more about this area of marketing than Mike. He's also the co-founder of GetFiveStars, an innovative review and testimonial software. Additionally, Mike loves biking, x-country skiing, and home cooking. 9:55-10:10am Q&A with Dr. Peter Meyers and Mike Blumenthal 10:10-10:45am Going Local with Google with Jade Wang Learn about local search with Google. We'll chat about the potential of local search and discuss how business information gets on Google. If you've gone to the Google and Your Business Forum for help (and, of course, you have!), then you know how quickly an answer from Google staffer Jade Wang can clear up even the toughest problems. She has been helping business owners get their information listed on Google since joining the team in 2012. 10:45-11:05am AM Break 11:05-11:25am Getting Local Keyword Research and On-page Optimization Right with Mary Bowling Local keyword data is often difficult to find, analyze, and prioritize. Get tips, tools, and processes for zeroing in on the best terms to target when optimizing your website and directory listings, and learn how and why to structure your website around them. Mary Bowling's been specializing in SEO and local search since 2003. She works as a consultant at Optimized!, is a partner at a small agency called Ignitor Digital, is a partner in Local U, and is also a trainer and writer for Search Engine News. Mary spends her days interacting directly with local business owners and understands holistic local needs. 11:25-11:50am Local Content + Scale + Creativity = Awesome with Mike Ramsey If you are wondering who is crushing it with local content and how you can scale such efforts, then tune in as Mike Ramsey walks through ideas, examples, and lessons he has learned along the way. Mike Ramsey is the president of Nifty Marketing with offices in Burley and Boise, Idaho. He is also a Partner at Local U and many other ventures. Mike has an awesome wife and three kids who put up with all his talk about search. 11:50am-12:15pm Review Acquisition Strategies That Work with Darren Shaw Darren Shaw will walk you through multiple real-world examples of businesses that are killing it with review acquisition. He'll detail exactly how they manage to get so many more reviews than their competitors and how you can use their methods to improve your own local search visibility. Darren Shaw is the President and Founder of Whitespark, a company that builds software and provides services to help businesses with local search. He's widely regarded in the local SEO community as an innovator, one whose years of experience working with massive local data sets have given him uncommon insights into the inner workings of the world of citation-building and local search marketing. Darren has been working on the web for over 16 years and loves everything about local SEO. 12:15-12:30pm Q&A with Mary Bowling, Mike Ramsey, and Darren Shaw 12:30-1:30pm Lunch 1:30-1:55pm The Down-Low on LoMo (Local Mobile) SEO with Cindy Krum Half of all local searches happen on mobile, and that stat is just growing! Map search results are great, but your mobile site has to be great too. Cindy Krum will review the best practices for making your local site look perfect to mobile users and crawlers alike. No mobile site? No problem as you'll also get tips for how to make the most of mobile searches without one. Cindy Krum is the CEO and Founder of MobileMoxie, LLC, a mobile marketing consultancy and host of the most cutting-edge online mobile marketing toolset available today. Cindy is the author of Mobile Marketing: Finding Your Customers No Matter Where They Are, published by Que Publishing. 1:55-2:20pm Thriving in the Mobile Ecosystem with Aaron Weiche A look into the opportunity of creating and growing the mobile experience between your customers and your brand: one strong enough to delight fingers, change minds, and win hearts. Aaron Weiche is a digital marketing geek focused on web design, mobile, and search marketing. Aaron is the COO of Spyder Trap in Minneapolis, Local U faculty member, founding board member of MnSearch, and a Local Search Ranking Factors Contributor since 2010. 2:20-2:45pm Content, Conversations, and Conversions with Will Scott How local businesses, and the marketers who love them, can use social media to bring home the bacon. Helping small businesses succeed online since 1994, Will Scott has led teams responsible for thousands of websites, hundreds of thousands of pages in online directories, and millions of visits from search. Today, Will leads nearly 100 professionals at Search Influence putting results first and helping customers successfully market online. 2:45-3:10pm Segmentation Domination with Ed Reese Learn how to gain powerful insight by creating creative custom segments in Google Analytics. This session shows several real-world examples in action and walks you through the brainstorming, implementation, and discovery process to utilize segmentation like never before. Ed Reese leads a talented analytics and usability team at his firm Sixth Man Marketing, is a co-founder of Local U, and an adjunct professor of digital marketing at Gonzaga University. In his free time, he optimizes his foosball and disc golf technique and spends time with his wife and two boys. 3:10-3:30pm PM Break 3:30-4:00pm Playing to Your Local Strengths with David Mihm Historically, local search has been one of the most level playing fields on the web with smaller, nimbler businesses having an advantage as larger enterprises struggled to adapt and keep up. Today, companies of both sizes can benefit from tactics that the other simply can’t leverage. David will share some of the most valuable tactics that scale—and don’t scale—in a presentation packed with actionable takeaways, no matter what size business you work with. David Mihm is one of the world’s leading practitioners of local search engine marketing. He has created and promoted search-friendly websites for clients of all sizes since the early 2000s. David co-founded GetListed.org, which he sold to Moz in November 2012. Since then, he's served as our Director of Local Search Marketing, imparting his wisdom everywhere! 4:00-4:25pm Don't Just Show Up, Stand Out with Dana DiTomaso Learn how to destroy your competitors with bringing personality to your marketing. Confront the challenges of making HIPPOs comfortable with unique voice, keep brand standards while injecting some fun, and stay in the forefront of your audience's mind. Whether at a conference, on the radio, or in a meeting, Dana DiTomaso likes to impart wisdom to help you turn a lot of marketing BS into real strategies to grow your business. After 10+ years and with a focus on local SMBs, she's seen (almost) everything. In her spare time, Dana drinks tea and yells at the Hamilton Tiger-Cats. 4:25-4:40pm Q&A with David Mihm and Dana DiTomaso 4:40-5:20pm Exposing the Non-Obvious Elements of Local Businesses That Dominate on the Web with Rand Fishkin In some categories and geographies, a local small business wholly dominates the rankings and visibility across channels. What are the secrets to this success, and how can small businesses with remarkable products/services showcase their traits best online? In this presentation, Rand will dig deep into examples and highlight the recurring elements that help the best of the best stand out. Rand Fishkin is the founder of Moz. Traveler, blogger, social media addict, feminist, and husband. And if that doesn't quite tickle your fancy... Workshops! We'll also be hosting workshops with our speakers, which are amazing opportunities for you to dig into your specific questions and issues. I know, sometimes I get a little shy to ask questions in front of a crowd or just want to socialize at the after party, so this a great opportunity to get direct feedback. Time Workshop Option A Workshop Option B 1:30-1:55pm Reporting Q&A with Ed Reese and Dana DiTomaso Need help with your reporting? Ed and Dana will make sure you're on the right track and tracking the right things. Google My Business Q&A with Jade Wang Google My Business can be confusing, but Jade Wang is here to lend a hand. She'll look over your specific problems and help you troubleshoot. 1:55-2:20pm How to Troubleshoot All Things Local with Mike Blumenthal and Mary Bowling No Local SEO problem can get by the combined powers of Mike and Mary. This dynamic duo will assist you in diving into your specific questions, problems, and concerns. Google My Business Q&A with Jade Wang Google My Business can be confusing, but Jade Wang is here to lend a hand. She'll look over your specific problems and help you troubleshoot. 2:20-2:45pm Citation Q&A with David Mihm and Darren Shaw Getting the right citations for your business can be a powerful boost. David and Darren will show you how to wield citations correctly and creatively for your business. Google My Business Q&A with Jade Wang Google My Business can be confusing, but Jade Wang is here to lend a hand. She'll look over your specific problems and help you troubleshoot. 2:45-3:10pm Mobile Q&A with Aaron Weiche and Cindy Krum Local and mobile go hand-in-hand, but mobile implementation, optimization, and perfection can be tricky. Aaron and Cindy will help guide you and your business. Google My Business Q&A with Jade Wang Google My Business can be confusing, but Jade Wang is here to lend a hand. She'll look over your specific problems and help you troubleshoot. See you in February, friends. And please, don't hesitate to reach out if you have any questions! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The #LocalUp Advanced 2015 Agenda Is Here"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The #LocalUp Advanced 2015 Agenda Is Here"
    },
    {
      "level": "H2",
      "text": "LocalUp Advanced 2015 Agenda"
    },
    {
      "level": "H2",
      "text": "And if that doesn't quite tickle your fancy... Workshops!"
    },
    {
      "level": "H2",
      "text": "Reach more customers with Moz Local!"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The 11 Known Google Business Profile Fields That Impact Your Rank"
    },
    {
      "level": "H3",
      "text": "My Top 5 Local SEO and Marketing Takeaways From MozCon 2024"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Erica McGillivray\n          \n            Erica McGillivray\n          \n            Erica McGillivray"
}