{
  "url": "https://moz.com/blog/the-best-of-the-moz-blog-2017",
  "slug": "the-best-of-the-moz-blog-2017",
  "title": "The Very Best of the Moz Blog 2017: Our Top 50 Posts - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We've curated a hefty list of the Moz Blog's top posts throughout the year, covering all of our most popular categories. Come check out what you may have missed, see which community members made the Top 10 Comments, and help us ring in 2018 right!",
  "content": "The Very Best of the Moz Blog 2017: Our Top 50 Posts Moz News | Advanced SEO | SEO Basics By: Felicia Crawford December 28, 2017 Table of Contents Copied! By: Felicia Crawford December 28, 2017 The Very Best of the Moz Blog 2017: Our Top 50 Posts Moz News | Advanced SEO | SEO Basics Now, I know we technically have a few days left in 2017, but I'm ready to dive head-first into a fond, full-blown retrospective. Each year we look back on what we've published, compiling and sharing the pieces you liked best. Normally we divvy it up via various metrics: traffic, 1Metric score, total thumbs up, total comments, the best of YouMoz, and so on and so forth. This year, however, we're doing things just a little differently.A lot has changed in the past year...The way we run the blog has changed in a few significant ways from the days of yesteryear. YouMoz, our user-generated content blog, was retired in the autumn of 2016 (though we hope to resurrect it in another form someday). We reduced our publishing frequency a bit, and refocused our content on core SEO topics after spending 2015 and 2016 branching out into other marketing subjects (like social media and content marketing). We also made some big changes with regards to commenting: we closed comments on posts older than 30 days (they became veritable spam factories), and implemented stricter moderation filters to better catch spammy comments fishing for either a link or easy MozPoints.And if I'm being completely honest, I don't think the \"Best of\" posts from years past have offered you, our beloved readers, as much value as they should've. The most excited comments on those posts occur when someone discovers a gem they'd missed, when a post reaches out to you from the masses of online content clamoring for your attention and speaks to you. The way we formerly ranked \"the best\" resulted in a lot of overlap; the same few posts with lots of thumbs up, a busy comments section, and high traffic overwhelmed the leaderboard.What criteria now determines \"best\"?At the end of 2017, we're starting fresh. First, I've taken our ten most popular blog post categories by traffic — these represent the topics readers are actively seeking information on. Next, I thought about which metric matters most to me when I consider the success of a blog post. Traffic, thumbs, social shares... Nice to see, yes, but they don't paint a very clear picture of a post's impact. I found myself returning to my favorite blog post metric again and again: the comments.A post with a lively comments section can be many things. Perhaps it sparked questions or debate; perhaps the findings were controversial; perhaps it was simply inspiring. Whatever the reason, a heavily commented-on post represents something that struck a chord, that convinced a person to peek out from behind their keyboard shield and contribute a thought, something that coaxed a little extra effort and commitment from our community. As a silent lurker myself, I am consistently blown away by the humility, genius, and generosity you all display in the blog comments section every day. So there we have it: this year's Best of the Moz Blog 2017 is a list of the top five most-commented posts in the top ten blog categories. That's fifty unique blog posts throughout the year on a variety of topics, some of which you may have missed. Most blog posts fall into several of our categories, but every post will only be listed once; if it's hit the top five in a more popular category, I've taken it out of the running for the rest. It's my sincere hope that this list uncovers something useful for you, something that helps make your job and day just a little easier. Without further ado, let's get this party started!(If you're curious, check out the Best of 2016 and the Best of 2015, too.)The top 5 Whiteboard FridaysWhiteboard Friday is far and away our most popular blog category, earning three times as much traffic as the rest. Because it always overlaps with at least one other category, you're bound to get a tidy grab bag of SEO takeaways with this list!10 Things that DO NOT (Directly) Affect Your Google RankingsRand Fishkin, September 22ndThumbs: 85Comments: 180 What do the age of your site, your headline H1/H2 preference, bounce rate, and shared hosting all have in common? You might've gotten a hint from the title: not a single one of them directly affects your Google rankings. In this rather comforting Whiteboard Friday, Rand lists out ten factors commonly thought to influence your rankings that Google simply doesn't care about.What Do Google's New, Longer Snippets Mean for SEO?Rand Fishkin, December 8thThumbs: 100Comments: 136Featured snippets and meta descriptions have brand-new character limits, and it's a huge change for Google and SEOs alike. Learn about what's new, when it changed, and what it all means for SEO in this episode of Whiteboard Friday. (And this is cheating, but for good measure, you might follow up with Dr. Pete's official recommendation for meta description lengths in 2018.)What Links Can You Get that Comply with Google's Guidelines?Marie Haynes, January 20thThumbs: 68Comments: 112If you've ever been the victim of a Google penalty, you know how painful it can be to identify the problem and recover from the hit. Even if you've been penalty-free thus far, the threat of getting penalized is a source of worry. But how can you avoid it, when it seems like unnatural links lurk around every corner?In this Whiteboard Friday, we warmly welcome Google penalty and unnatural link expert Marie Haynes as she shares how to earn links that do comply with Google's guidelines, that will keep your site out of trouble, and that can make a real impact.7 ‹Title Tag› Hacks for Increased Rankings + Traffic - Whiteboard FridayCyrus Shepard, May 5thThumbs: 185Comments: 103You may find yourself wondering whether the humble title tag still matters in modern SEO. When it comes to your click-through rate, the answer is a resounding yes! In this Whiteboard Friday, we welcome back our good friend Cyrus Shepard to talk about 7 ways you can revamp your title tags to increase your site traffic and rankings.Comment Marketing: How to Earn Benefits from Community ParticipationRand Fishkin, January 13thThumbs: 53Comments: 97It's been a few years since we've covered the topic of comment marketing, but that doesn't mean it's out of date. There are clever, intentional ways to market yourself and your brand in the comments sections of sites, and there's less competition now than ever before. In this Whiteboard Friday, Rand details what you can do to get noticed in the comments and the benefits you'll reap from high-quality contributions.The top 5 posts in On-Page SEOThe results of our recent Moz Blog Reader Survey highlighted on-page SEO as the topic you'd most like to learn about, so it's not surprising to see that this category sits right under Whiteboard Friday for popularity. There's an interesting theme that emerges from these top posts: it seems we're still working on many of the same things, but how we treat them has necessarily changed over time.How Links in Headers, Footers, Content, and Navigation Can Impact SEO - Whiteboard FridayRand Fishkin, October 20thThumbs: 68Comments: 92Which link is more valuable: the one in your nav, or the one in the content of your page? Now, how about if one of those in-content links is an image, and one is text? Not all links are created equal, and getting familiar with the details will help you build a stronger linking structure. This Whiteboard Friday covers links in headers and footers, in navigation versus content, and how that can affect internal and external links, link equity, and link value between your site and others.It's Time to Stop Doing On-Page SEO Like It's 2012Rand Fishkin, February 6thThumbs: 84Comments: 91On-page SEO has evolved in the past five years. Rand outlines the changes in five succinct tactics: move beyond keyword repetition rules; searcher intent matters more than raw keywords; related topics are essential; links don't always beat on-page; and topical authority is more important than ever.The Wonderful World of SEO Meta Tags [Refreshed for 2017]Kate Morris, April 13thThumbs: 46Comments: 67Which meta tags are absolutely necessary, which are dependent on your situation, and which should you absolutely ignore or remove? Kate Morris refreshes her original 2010 post on the subject of meta tags, sharing a few new tips and reiterating what's remained the same over the past 7 years.Designing a Page's Content Flow to Maximize SEO Opportunity - Whiteboard FridayRand Fishkin, December 1stThumbs: 54Comments: 48Controlling and improving the flow of your on-site content can actually help your SEO. What's the best way to capitalize on the opportunity present in your page design? Rand covers the questions you need to ask (and answer) and the goals you should strive for in this edition of Whiteboard Friday.How to Do a Content Audit [Updated for 2017]Everett Sizemore, March 22ndThumbs: 49Comments: 31Learn how to do content audits for SEO in this comprehensive, updated guide by Everett Sizemore, including tips for crawling large websites, rendering JavaScript content, and auditing dynamic mobile content.The top 5 posts in Local SEOLocal SEO overlaps with what we think of as traditional SEO in many ways, so it's not surprising at all to see this category near the top. There's still a lot of doubt and apprehension, it seems, when it comes to local SEO best practices and what really works, and the top posts in this category reflect that.Local SEO Spam Tactics Are Working: How You Can Fight BackCasey Meraz, March 28thThumbs: 48Comments: 75It's very clear that spam tactics in Google's local results are earning higher rankings. In this post, Casey Meraz identifies exactly what spammers are doing to get ahead, what they can get away with, and what you can do to fight back against the problem plaguing local results. Not-Actually-the-Best Local SEO PracticesMiriam Ellis, December 11thThumbs: 47Comments: 72Not all common practices in local SEO are the best practices. In fact, some of them can be pretty darn harmful. Check out Miriam's list of what-not-to-dos (and what-you-should-actually-dos) in this comprehensive blog post.The 2017 Local SEO Forecast: 10 Predictions According to MozzersMiriam Ellis, February 14thThumbs: 35Comments: 67From Google providing intimate details about businesses to Amazon expanding even further into the local scene, local SEO stood to see a lot of change this year. Check out what the SEOs at Moz had to say about what to prepare for in 2017.Proximity to Searcher is the New #1 Local Search Ranking FactorDarren Shaw, February 22ndThumbs: 58Comments: 65Forget everything you thought you knew about the most impactful local ranking factors — searcher proximity just may be the number-one thing influencing where a local business shows on the SERPs.How to Perform a Basic Local Business Competitive AuditMiriam Ellis, August 22ndThumbs: 32Comments: 65Are you outranked in Google's Local Pack? Then it's high time to perform a competitive business audit. Use this example analysis and downloadable spreadsheet to analyze the strengths and weaknesses of multiple businesses and devise a plan to win.The top 5 posts in Basic SEOBasic SEO is another category that enjoys a lot of overlap with other topics; perhaps that's one reason why it's so popular. This year's top posts in this category cover a range of subjects, and all are pretty useful for someone learning (or leveling up in) SEO.Aren't 301s, 302s, and Canonicals All Basically the Same? - Whiteboard FridayDr. Pete, March 3rdThumbs: 62Comments: 69They say history repeats itself. In the case of the great 301 vs 302 vs rel=canonical debate, it repeats itself about every three months. In this Whiteboard Friday, Dr. Pete explains how bots and humans experience pages differently depending on which solution you use, why it matters, and how each choice may be treated by Google.How to Prioritize SEO Tasks [+Worksheet]Britney Muller, September 21stThumbs: 41Comments: 64An absolute essential if you want to keep yourself from getting overwhelmed, Moz's own SEO Britney Muller offers five tips for prioritizing your SEO work: setting specific goals, identifying important pages for conversions, uncovering technical opportunities via a site crawl, time management, and providing consistent benchmarks and reporting.5 Tactics to Earn Links Without Having to Directly Ask - Whiteboard FridayRand Fishkin, July 28thThumbs: 71Comments: 63Typical link outreach is a tired sport, and we've all but alienated most content creators with our constant link requests. In this Whiteboard Friday, Rand outlines five smart ways to earn links to your site without having to beg.\"SEO Is Always Changing\"... Or Is It?: Debunking the Myth and Getting Back to BasicsBridget Randolph, July 19thThumbs: 56Comments: 60We're so fond of the idea that SEO is hard because it's always changing. But is that really true? Bridget Randolph challenges a common industry refrain and brings us back to the basics of what's really important in our work.How to Target Multiple Keywords with One Page - Next LevelBrian Childs, June 15thThumbs: 45Comments: 56In this edition of our educational Next Level series, you'll learn an easy workflow for researching and targeting multiple keywords with a single page.The top five posts in Link BuildingA thousand years from now, when the Space Needle has toppled into Puget Sound and our great-great-great-great-etc. grandchildren are living on Mars, link building will still prove to be one of the most popular subjects on the Moz Blog. And you get a double-whammy of goodness this year, because they just so happen to all be Whiteboard Fridays!Should SEOs Care About Internal Links? - Whiteboard FridayRand Fishkin, May 26thThumbs: 85Comments: 87Internal links are one of those essential SEO items you have to get right to avoid getting them really wrong. Rand shares 18 tips to help inform your strategy, going into detail about their attributes, internal vs. external links, ideal link structures, and much, much more in this edition of Whiteboard Friday.How to Prioritize Your Link Building Efforts & Opportunities - Whiteboard FridayRand Fishkin, February 17thThumbs: 73Comments: 81We all know how effective link building efforts can be, but it can be an intimidating, frustrating process — and sometimes even a chore. In this Whiteboard Friday, Rand builds out a framework you can start using today to streamline and simplify the link building process for you, your teammates, and yes, even your interns.The 3 Easiest Link Building Tactics Any Website Can Use to Acquire Their First 50 Links - Whiteboard FridayRand Fishkin, September 8thThumbs: 81Comments: 77Without a solid base of links, your site won't be competitive in the SERPs — even if you do everything else right. But building your first few links can be difficult and discouraging, especially for new websites. Never fear — Rand is here to share three relatively quick, easy, and tool-free (read: actually free) methods to build that solid base and earn yourself links.When and How to Use Domain Authority, Page Authority, and Link Count Metrics - Whiteboard FridayRand Fishkin, June 16thThumbs: 50Comments: 71How can you effectively apply link metrics like Domain Authority and Page Authority alongside your other SEO metrics? Where and when does it make sense to take them into account, and what exactly do they mean? In this Whiteboard Friday, Rand answers these questions and more, arming you with the knowledge you need to better understand and execute your SEO work.Image Link Building - Whiteboard FridayBritney Muller, December 15thThumbs: 48Comments: 63Image link building is a delicate art. There are some distinct considerations from traditional link building, and doing it successfully requires a balance of creativity, curiosity, and having the right tools on hand. In this Whiteboard Friday, Moz's own SEO and link building aficionado Britney Muller offers up concrete advice for successfully building links via images.The top 5 posts in Advanced SEO2017's top posts in the advanced SEO category cover just about every post type we like to publish (and that you like to read): in-depth case studies, Whiteboard Fridays, best practice advice, and solid how-tos.[Case Study] How We Ranked #1 for a High-Volume Keyword in Under 3 MonthsDmitry Dragilev, April 19thThumbs: 73Comments: 140If you've been struggling to take the number-one spot in the SERPs for a competitive keyword, take a cue from this case study. Dmitry Dragilev shares his team's 8-step methodology for ranking first in a popular niche.How Google AdWords (PPC) Does and Doesn't Affect Organic Results - Whiteboard FridayRand Fishkin, November 17thThumbs: 68Comments: 89It's common industry knowledge that PPC can have an effect on our organic results. But what effect is that, exactly, and how does it work? In this Whiteboard Friday, Rand covers the ways paid ads influence organic results — and one very important way they don't.SEO Best Practices for Canonical URLs + the Rel=Canonical Tag - Whiteboard FridayRand Fishkin, July 14thThumbs: 62Comments: 87If you've ever had any questions about the canonical tag, well, have we got the Whiteboard Friday for you. In this episode, Rand defines what rel=canonical means and its intended purpose, when it's recommended you use it, how to use it, and sticky situations to avoid.How to Uncover Hidden Keyword-Level Data Using Google SheetsSarah Lively, February 13thThumbs: 42Comments: 83Which keywords are driving your organic traffic? Keyword-level data doesn't have to be (not provided). Sarah Lively shares a smart solution using two free add-ons for Google Sheets.How Long Should Your Meta Description Be? (2018 Edition)Dr. Pete, December 19thThumbs: 49Comments: 76The end of November saw a spike in the average length of SERP snippets. Across 90K results, we found a definite increase but many oddities, such as video snippets. Our data suggests that many snippets are exceeding 300 characters, and we recommend a new meta description limit of 300 characters.The top 5 posts in Technical SEOTechnical SEO posts are some of my favorite categories to publish (which is perhaps a strange sentiment coming from a poetry major). The debate that recently raged — about whether it's necessary or unnecessary for SEO — will always stick with many of us, as will Rand's excellent Whiteboard Friday rebuttal on the topic. XML Sitemaps: The Most Misunderstood Tool in the SEO's ToolboxMichael Cottam, April 11thThumbs: 43Comments: 83XML sitemaps are a powerful tool for SEOs, but are often misunderstood and misused. Michael Cottam explains how to leverage XML sitemaps to identify and resolve indexation problems.JavaScript & SEO: Making Your Bot Experience As Good As Your User ExperienceAlexis Sanders, June 20thThumbs: 56Comments: 79More and more, we're realizing it's incredibly important for us as SEOs to understand JavaScript's impact on search experience. Can search engines see your content and experience your site the way a user does? If not, what solutions can you use to fix it?Pros and Cons of HTTPS Services: Traditional vs Let's Encrypt vs CloudflareJR Ridley, September 13thThumbs: 38Comments: 78Thinking about going secure? It's more important than ever, with Google issuing security warnings for many non-secure sites in Chrome. This comparison of three popular HTTPS services will help you determine the best option for implementing an SSL certification on your site.Mastering Google Search Operators in 67 Easy StepsDr. Pete, March 1stThumbs: 82Comments: 76Google search operators are like chess – knowing how the pieces move doesn't make you a master. Dive into 67 examples, from content research to site audits, and level up your search operator game.Unlocking Hidden Gems Within Schema.orgAlexis Sanders, October 18thThumbs: 45Comments: 69Schema.org can be a confusing resource if you're trying to learn how to use and implement structured data. This mini-guide arms you with the right kind of thinking to tackle your next structured data project.The top 5 posts in Keyword ResearchThe posts generating the most buzz in our keyword research category seem to revolve around quick yet effective wins and tactical advice. And with time constraints being one of the biggest challenges reported in our Reader's Survey, it's really no surprise. The Lazy Writer’s Guide to 30-Minute Keyword ResearchBritney Muller, July 26thThumbs: 52Comments: 54Keyword research doesn’t have to be a marathon bender. A brisk 30-minute walk can provide incredible insights — insights that connect you with a wider audience on a deeper level. Britney Muller shares several ways to get your keyword research tasks done efficiently and well.The Keyword + Year Content/Rankings Hack - Whiteboard FridayRand Fishkin, February 10thThumbs: 63Comments: 49What's the secret to earning site traffic from competitive keywords with decent search volume? The answer could be as easy as 1, 2, 3 — or more precisely, 2, 0, 1, 7. In this Whiteboard Friday, Rand lets you in on a relatively straightforward tactic that can help you compete in a tough space using very fresh content.3 Tactics for Hyperlocal Keywords - Whiteboard FridayRand Fishkin, February 24thThumbs: 63Comments: 47Trying to target a small, specific region with your keywords can prove frustrating. While reaching a high-intent local audience is incredibly valuable, without volume data to inform your keyword research, you'll find yourself hitting a wall. In this Whiteboard Friday, Rand shares how to uncover powerful, laser-focused keywords that will reach exactly the right people.Which of My Competitor's Keywords Should (& Shouldn't ) I Target? - Whiteboard FridayRand Fishkin, November 24thThumbs: 45Comments: 44You don't want to try to rank for every one of your competitors' keywords. Like most things with SEO, it's important to be strategic and intentional with your decisions. In this Whiteboard Friday, Rand shares his recommended process for understanding your funnel, identifying the right competitors to track, and prioritizing which of their keywords you ought to target.NEW in Keyword Explorer: See Who Ranks & How Much with Keywords by SiteRand Fishkin, October 23rdThumbs: 41Comments: 43It's not often that a product-focused post makes our blog's Best of the Year list, so this is both interesting and heartening to see. We worked really hard to bring better data and more usefulness to Keyword Explorer this year, and y'all left some really kind sentiments in the comments. Thanks for always being here for us, folks! :)The top 5 posts in ContentI won't say it, I promise. ;) But content is just as important as ever, and the rather vague advice of \"create great content and the rest will come\" has certainly gotten a bit exhausting over the years. We've made an effort to publish more actionable ways to think about and use content, and it seems like that's been resonating with you so far!Refurbishing Top Content - Whiteboard FridayBritney Muller, February 3rdThumbs: 66Comments: 82You've got top-performing content on your site that does really well. Maybe it's highly converting, maybe it garners the most qualified traffic — but it's just sitting there gathering dust. Isn't there something else you can do with content that's clearly proven its worth?As it turns out, there is! In this Whiteboard Friday, Britney Muller shares three easy steps for identifying, repurposing, and republishing your top content to juice every drop of goodness out of it.What We Learned From Analyzing 1.4 Million Featured SnippetsA.J. Ghergich, January 17thThumbs: 48Comments: 78From optimal snippet length, to practical application tips, to which queries prefer tables, lists, or paragraphs, learn everything you need to know to supercharge your snippet wins.The Perfect Blog Post Length and Publishing Frequency is B?!!$#÷x - Whiteboard FridayRand Fishkin, August 18thThumbs: 76Comments: 65The perfect blog post length or publishing frequency doesn't actually exist. \"Perfect\" isn't universal — your content's success depends on tons of personalized factors. In this Whiteboard Friday, Rand explains why the idea of \"perfect\" is baloney when it comes to your blog, and lists what you should actually be looking for in a successful publishing strategy.Learning to Re-Share: 4 Strategies to Renew, Refresh, and Recycle Content for Bigger ReachJen Carney, August 2ndThumbs: 31Comments: 51You've spend too much time and effort on content creation to share it only once. Check out four smart strategies you can implement today to improve the reach of your existing content.How to Build the Right Content Marketing Strategy for SEO GrowthAlli Berry, November 15thThumbs: 30Comments: 51Keywords are important for innumerable SEO tasks, but driving your content marketing strategy isn't one of them. Your strategy should be based on the audience you're trying to reach if you want your organic traffic to convert.Paid Search MarketingWhile it perhaps seems a little strange for an SEO blog to cover, paid search plays an important part in our digital marketing world, and as reported in our Reader's Survey, plenty of us wear more than one hat. Here are the top posts from 2017 that generated the most commentary about all things paid: Do iPhone Users Spend More Online Than Android Users?Martin Meany, October 11thThumbs: 27Comments: 71 iPhone users tend to spend 3x as much as Android users, according to an analysis of 31 million mobile e-commerce sessions. Digital marketers can capitalize on this revelation via Facebook and AdWords.Branding Success: How to Use PPC to Amplify Your BrandPurna Virji, February 21stThumbs: 34Comments: 44You might be surprised to learn that branding and PPC go hand-in-hand. Find out how to leverage your PPC campaigns to strengthen your brand and win conversions and loyalty from your customers.No, Paid Search Audiences Won’t Replace KeywordsKirk Williams, May 30thThumbs: 33Comments: 29Keywords or audience targeting? Kirk Williams sets out to argue that far from being dead, keywords are still the most useful tool in the paid search marketer's toolbox.Paid Social for Content Marketing Launches - Whiteboard FridayKane Jamison, September 29thThumbs: 31Comments: 29Stuck in a content marketing rut? Relying on your existing newsletter, social followers, or email outreach won't do your launches justice. Boosting your signal with paid social both introduces your brand to new audiences and improves your launch's traffic and results. In this Whiteboard Friday, we're welcoming back our good friend Kane Jamison to highlight four straightforward, actionable tactics you can start using ASAP.The Step-By-Step Guide to Testing Voice Search Via PPCPurna Virji, March 21stThumbs: 30Comments: 24Conversational interfaces are becoming more and more popular, but it's hard to know where to start when it comes to voice search. A $50 PPC budget is enough to jumpstart your voice search keyword list and strategy — learn how in this step-by-step guide.Top comments by thumbs upComments are my favorite blog post success metric, and it simply wouldn't do if we didn't honor the folks who contributed the most popular comments in 2017. Thank you, all of you, for sharing your thoughts with the greater Moz and SEO community, and for taking precious time out of your day to make the blog a more interesting and better place. And for all the comment lurkers out there like me, I offer you solemn solidarity and zero judgment (but I'd be delighted to see y'all venture out from behind the screen now and again ;).1. Praveen Sharma on \"10 Things that DO NOT (Directly) Affect Your Google Rankings - Whiteboard Friday\" – 58 thumbs upShort, sweet, accurate, relevant advice is the name of the game. :) We've had feedback before that some readers come to the blog for the comments as much as the post itself, and this example shows why. Thanks for sharing your insight, Praveen!2. SEOMG on \"7 ‹Title Tag› Hacks for Increased Rankings + Traffic - Whiteboard Friday\" – 42 thumbs upMuch like the above, this comment exemplifies clear, useful examples related to the post topic. You rock, SEOMG!3. Praveen Sharma on \"The 3 Easiest Link Building Tactics Any Website Can Use to Acquire Their First 50 Links - Whiteboard Friday\" – 39 thumbs upSwooping in again with another helpful tidbit to add to the blog post at hand, Praveen's made it on the Top 10 list twice. We really appreciate your contributions, Praveen!4. Trevor Klein on \"Moz Transitions: Rand to Step Away from Operations and into Advisory Role in Early 2018\" – 38 thumbs upA bittersweet comment that clearly struck a chord with many in our community. Rand, I hope you know how much we all love and appreciate you! And Trevor, thank you so much for your candid and genuine thoughts; you truly spoke for all of us there.5. Gianluca Fiorelli on \"SEO Best Practices for Canonical URLs + the Rel=Canonical Tag - Whiteboard Friday\" – 30 thumbs upGianluca's comments on the Moz Blog are legendary; each one is a treasure, a miniature blog post in and of itself. Thank you for sharing your smarts with us, Gianluca!6. Rand Fishkin on \"What Do Google's New, Longer Snippets Mean for SEO? - Whiteboard Friday\" – 28 thumbs upBy using the comments section to clarify a few points about his Whiteboard Friday video and highlight his advice, Rand adds extra value and oomph to the post as a whole... and the community responded. :) Thank you for always leaving 10X comments, Rand!7. Eric Hahn on \"10 Things that DO NOT (Directly) Affect Your Google Rankings - Whiteboard Friday\" – 26 thumbs upThe discussion in the thread spurred by this helpful, on-topic comment is the kind of lively, educational back-and-forth we love to witness. Thank you for inspiring folks to ask questions and learn, Eric!8. Igor Gorbenko on \"What Do Google's New, Longer Snippets Mean for SEO? - Whiteboard Friday\" – 25 thumbs upIt makes me really happy that our community has — and rewards — such awesome personality. Igor, thank you for your wit and your insights! ᕕ(⌐■_■)ᕗ ♪♬9. Tim Soulo on \"Moz Transitions: Rand to Step Away from Operations and into Advisory Role in Early 2018\" – 22 thumbs upThe blog community definitely resonated with all the heartfelt, personal stories shared on this post. Tim, thank you for sharing!10. Gianluca Fiorelli on \"Comment Marketing: How to Earn Benefits from Community Participation - Whiteboard Friday\" – 21 thumbs upIn an incredibly meta turn of events, Gianluca's comment on our Comment Marketing Whiteboard Friday rounds out the list of 2017's top comments on the Moz Blog. I don't think there's a person on this Internet that's done a better job of personal comment marketing than Gianluca! :)Here's to you!Thank you all, each and every one of you, for helping to keep our little community a thriving, nurturing place to learn SEO, share ideas, and hey, even make mistakes now and again. It's an honor to have a hand in providing content to such a TAGFEE and brilliant group of people, and I can't describe how excited I am for all that 2018 will bring.Let me know in the comments how you liked the change-up this year, what other \"Best of\" formats or lists you might find helpful, and any other ponderings or thoughts you might have — and thank you again for reading! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Very Best of the Moz Blog 2017: Our Top 50 Posts"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Very Best of the Moz Blog 2017: Our Top 50 Posts"
    },
    {
      "level": "H3",
      "text": "A lot has changed in the past year..."
    },
    {
      "level": "H3",
      "text": "What criteria now determines \"best\"?"
    },
    {
      "level": "H2",
      "text": "The top 5 Whiteboard Fridays"
    },
    {
      "level": "H3",
      "text": "10 Things that DO NOT (Directly) Affect Your Google Rankings"
    },
    {
      "level": "H4",
      "text": "Rand Fishkin, September 22nd"
    },
    {
      "level": "H3",
      "text": "What Do Google's New, Longer Snippets Mean for SEO?"
    },
    {
      "level": "H4",
      "text": "Rand Fishkin, December 8th"
    },
    {
      "level": "H3",
      "text": "What Links Can You Get that Comply with Google's Guidelines?"
    },
    {
      "level": "H4",
      "text": "Marie Haynes, January 20th"
    },
    {
      "level": "H3",
      "text": "7 ‹Title Tag› Hacks for Increased Rankings + Traffic - Whiteboard Friday"
    },
    {
      "level": "H4",
      "text": "Cyrus Shepard, May 5th"
    },
    {
      "level": "H3",
      "text": "Comment Marketing: How to Earn Benefits from Community Participation"
    },
    {
      "level": "H4",
      "text": "Rand Fishkin, January 13th"
    },
    {
      "level": "H2",
      "text": "The top 5 posts in On-Page SEO"
    },
    {
      "level": "H3",
      "text": "How Links in Headers, Footers, Content, and Navigation Can Impact SEO - Whiteboard Friday"
    },
    {
      "level": "H4",
      "text": "Rand Fishkin, October 20th"
    },
    {
      "level": "H3",
      "text": "It's Time to Stop Doing On-Page SEO Like It's 2012"
    },
    {
      "level": "H4",
      "text": "Rand Fishkin, February 6th"
    },
    {
      "level": "H3",
      "text": "The Wonderful World of SEO Meta Tags [Refreshed for 2017]"
    },
    {
      "level": "H4",
      "text": "Kate Morris, April 13th"
    },
    {
      "level": "H3",
      "text": "Designing a Page's Content Flow to Maximize SEO Opportunity - Whiteboard Friday"
    },
    {
      "level": "H4",
      "text": "Rand Fishkin, December 1st"
    },
    {
      "level": "H3",
      "text": "How to Do a Content Audit [Updated for 2017]"
    },
    {
      "level": "H4",
      "text": "Everett Sizemore, March 22nd"
    },
    {
      "level": "H2",
      "text": "The top 5 posts in Local SEO"
    },
    {
      "level": "H3",
      "text": "Local SEO Spam Tactics Are Working: How You Can Fight Back"
    },
    {
      "level": "H4",
      "text": "Casey Meraz, March 28th"
    },
    {
      "level": "H3",
      "text": "Not-Actually-the-Best Local SEO Practices"
    },
    {
      "level": "H4",
      "text": "Miriam Ellis, December 11th"
    },
    {
      "level": "H3",
      "text": "The 2017 Local SEO Forecast: 10 Predictions According to Mozzers"
    },
    {
      "level": "H4",
      "text": "Miriam Ellis, February 14th"
    },
    {
      "level": "H3",
      "text": "Proximity to Searcher is the New #1 Local Search Ranking Factor"
    },
    {
      "level": "H4",
      "text": "Darren Shaw, February 22nd"
    },
    {
      "level": "H3",
      "text": "How to Perform a Basic Local Business Competitive Audit"
    },
    {
      "level": "H4",
      "text": "Miriam Ellis, August 22nd"
    },
    {
      "level": "H2",
      "text": "The top 5 posts in Basic SEO"
    },
    {
      "level": "H3",
      "text": "Aren't 301s, 302s, and Canonicals All Basically the Same? - Whiteboard Friday"
    },
    {
      "level": "H4",
      "text": "Dr. Pete, March 3rd"
    },
    {
      "level": "H3",
      "text": "How to Prioritize SEO Tasks [+Worksheet]"
    },
    {
      "level": "H4",
      "text": "Britney Muller, September 21st"
    },
    {
      "level": "H3",
      "text": "5 Tactics to Earn Links Without Having to Directly Ask - Whiteboard Friday"
    },
    {
      "level": "H4",
      "text": "Rand Fishkin, July 28th"
    },
    {
      "level": "H3",
      "text": "\"SEO Is Always Changing\"... Or Is It?: Debunking the Myth and Getting Back to Basics"
    },
    {
      "level": "H4",
      "text": "Bridget Randolph, July 19th"
    },
    {
      "level": "H3",
      "text": "How to Target Multiple Keywords with One Page - Next Level"
    },
    {
      "level": "H4",
      "text": "Brian Childs, June 15th"
    },
    {
      "level": "H2",
      "text": "The top five posts in Link Building"
    },
    {
      "level": "H3",
      "text": "Should SEOs Care About Internal Links? - Whiteboard Friday"
    },
    {
      "level": "H4",
      "text": "Rand Fishkin, May 26th"
    },
    {
      "level": "H3",
      "text": "How to Prioritize Your Link Building Efforts & Opportunities - Whiteboard Friday"
    },
    {
      "level": "H4",
      "text": "Rand Fishkin, February 17th"
    },
    {
      "level": "H3",
      "text": "The 3 Easiest Link Building Tactics Any Website Can Use to Acquire Their First 50 Links - Whiteboard Friday"
    },
    {
      "level": "H4",
      "text": "Rand Fishkin, September 8th"
    },
    {
      "level": "H3",
      "text": "When and How to Use Domain Authority, Page Authority, and Link Count Metrics - Whiteboard Friday"
    },
    {
      "level": "H4",
      "text": "Rand Fishkin, June 16th"
    },
    {
      "level": "H3",
      "text": "Image Link Building - Whiteboard Friday"
    },
    {
      "level": "H4",
      "text": "Britney Muller, December 15th"
    },
    {
      "level": "H2",
      "text": "The top 5 posts in Advanced SEO"
    },
    {
      "level": "H3",
      "text": "[Case Study] How We Ranked #1 for a High-Volume Keyword in Under 3 Months"
    },
    {
      "level": "H4",
      "text": "Dmitry Dragilev, April 19th"
    },
    {
      "level": "H3",
      "text": "How Google AdWords (PPC) Does and Doesn't Affect Organic Results - Whiteboard Friday"
    },
    {
      "level": "H4",
      "text": "Rand Fishkin, November 17th"
    },
    {
      "level": "H3",
      "text": "SEO Best Practices for Canonical URLs + the Rel=Canonical Tag - Whiteboard Friday"
    },
    {
      "level": "H4",
      "text": "Rand Fishkin, July 14th"
    },
    {
      "level": "H3",
      "text": "How to Uncover Hidden Keyword-Level Data Using Google Sheets"
    },
    {
      "level": "H4",
      "text": "Sarah Lively, February 13th"
    },
    {
      "level": "H3",
      "text": "How Long Should Your Meta Description Be? (2018 Edition)"
    },
    {
      "level": "H4",
      "text": "Dr. Pete, December 19th"
    },
    {
      "level": "H2",
      "text": "The top 5 posts in Technical SEO"
    },
    {
      "level": "H3",
      "text": "XML Sitemaps: The Most Misunderstood Tool in the SEO's Toolbox"
    },
    {
      "level": "H4",
      "text": "Michael Cottam, April 11th"
    },
    {
      "level": "H3",
      "text": "JavaScript & SEO: Making Your Bot Experience As Good As Your User Experience"
    },
    {
      "level": "H4",
      "text": "Alexis Sanders, June 20th"
    },
    {
      "level": "H3",
      "text": "Pros and Cons of HTTPS Services: Traditional vs Let's Encrypt vs Cloudflare"
    },
    {
      "level": "H4",
      "text": "JR Ridley, September 13th"
    },
    {
      "level": "H3",
      "text": "Mastering Google Search Operators in 67 Easy Steps"
    },
    {
      "level": "H4",
      "text": "Dr. Pete, March 1st"
    },
    {
      "level": "H3",
      "text": "Unlocking Hidden Gems Within Schema.org"
    },
    {
      "level": "H4",
      "text": "Alexis Sanders, October 18th"
    },
    {
      "level": "H2",
      "text": "The top 5 posts in Keyword Research"
    },
    {
      "level": "H3",
      "text": "The Lazy Writer’s Guide to 30-Minute Keyword Research"
    },
    {
      "level": "H4",
      "text": "Britney Muller, July 26th"
    },
    {
      "level": "H3",
      "text": "The Keyword + Year Content/Rankings Hack - Whiteboard Friday"
    },
    {
      "level": "H4",
      "text": "Rand Fishkin, February 10th"
    },
    {
      "level": "H3",
      "text": "3 Tactics for Hyperlocal Keywords - Whiteboard Friday"
    },
    {
      "level": "H4",
      "text": "Rand Fishkin, February 24th"
    },
    {
      "level": "H3",
      "text": "Which of My Competitor's Keywords Should (& Shouldn't ) I Target? - Whiteboard Friday"
    },
    {
      "level": "H4",
      "text": "Rand Fishkin, November 24th"
    },
    {
      "level": "H3",
      "text": "NEW in Keyword Explorer: See Who Ranks & How Much with Keywords by Site"
    },
    {
      "level": "H4",
      "text": "Rand Fishkin, October 23rd"
    },
    {
      "level": "H2",
      "text": "The top 5 posts in Content"
    },
    {
      "level": "H3",
      "text": "Refurbishing Top Content - Whiteboard Friday"
    },
    {
      "level": "H4",
      "text": "Britney Muller, February 3rd"
    },
    {
      "level": "H3",
      "text": "What We Learned From Analyzing 1.4 Million Featured Snippets"
    },
    {
      "level": "H4",
      "text": "A.J. Ghergich, January 17th"
    },
    {
      "level": "H3",
      "text": "The Perfect Blog Post Length and Publishing Frequency is B?!!$#÷x - Whiteboard Friday"
    },
    {
      "level": "H4",
      "text": "Rand Fishkin, August 18th"
    },
    {
      "level": "H3",
      "text": "Learning to Re-Share: 4 Strategies to Renew, Refresh, and Recycle Content for Bigger Reach"
    },
    {
      "level": "H4",
      "text": "Jen Carney, August 2nd"
    },
    {
      "level": "H3",
      "text": "How to Build the Right Content Marketing Strategy for SEO Growth"
    },
    {
      "level": "H4",
      "text": "Alli Berry, November 15th"
    },
    {
      "level": "H2",
      "text": "Paid Search Marketing"
    },
    {
      "level": "H3",
      "text": "Do iPhone Users Spend More Online Than Android Users?"
    },
    {
      "level": "H4",
      "text": "Martin Meany, October 11th"
    },
    {
      "level": "H3",
      "text": "Branding Success: How to Use PPC to Amplify Your Brand"
    },
    {
      "level": "H4",
      "text": "Purna Virji, February 21st"
    },
    {
      "level": "H3",
      "text": "No, Paid Search Audiences Won’t Replace Keywords"
    },
    {
      "level": "H4",
      "text": "Kirk Williams, May 30th"
    },
    {
      "level": "H3",
      "text": "Paid Social for Content Marketing Launches - Whiteboard Friday"
    },
    {
      "level": "H4",
      "text": "Kane Jamison, September 29th"
    },
    {
      "level": "H3",
      "text": "The Step-By-Step Guide to Testing Voice Search Via PPC"
    },
    {
      "level": "H4",
      "text": "Purna Virji, March 21st"
    },
    {
      "level": "H2",
      "text": "Top comments by thumbs up"
    },
    {
      "level": "H4",
      "text": "1. Praveen Sharma on \"10 Things that DO NOT (Directly) Affect Your Google Rankings - Whiteboard Friday\" – 58 thumbs up"
    },
    {
      "level": "H4",
      "text": "2. SEOMG on \"7 ‹Title Tag› Hacks for Increased Rankings + Traffic - Whiteboard Friday\" – 42 thumbs up"
    },
    {
      "level": "H4",
      "text": "3. Praveen Sharma on \"The 3 Easiest Link Building Tactics Any Website Can Use to Acquire Their First 50 Links - Whiteboard Friday\" – 39 thumbs up"
    },
    {
      "level": "H4",
      "text": "4. Trevor Klein on \"Moz Transitions: Rand to Step Away from Operations and into Advisory Role in Early 2018\"  – 38 thumbs up"
    },
    {
      "level": "H4",
      "text": "5. Gianluca Fiorelli on \"SEO Best Practices for Canonical URLs + the Rel=Canonical Tag - Whiteboard Friday\" – 30 thumbs up"
    },
    {
      "level": "H4",
      "text": "6. Rand Fishkin on \"What Do Google's New, Longer Snippets Mean for SEO? - Whiteboard Friday\" – 28 thumbs up"
    },
    {
      "level": "H4",
      "text": "7. Eric Hahn on \"10 Things that DO NOT (Directly) Affect Your Google Rankings - Whiteboard Friday\" – 26 thumbs up"
    },
    {
      "level": "H4",
      "text": "8. Igor Gorbenko on \"What Do Google's New, Longer Snippets Mean for SEO? - Whiteboard Friday\" – 25 thumbs up"
    },
    {
      "level": "H4",
      "text": "9. Tim Soulo on \"Moz Transitions: Rand to Step Away from Operations and into Advisory Role in Early 2018\" – 22 thumbs up"
    },
    {
      "level": "H4",
      "text": "10. Gianluca Fiorelli on \"Comment Marketing: How to Earn Benefits from Community Participation - Whiteboard Friday\" – 21 thumbs up"
    },
    {
      "level": "H2",
      "text": "Here's to you!"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Felicia Crawford\n          \n            Felicia Crawford\n          \n            Felicia Crawford"
}