{
  "url": "https://moz.com/blog/the-long-forgotten-never-indexed-search-api-xmlteomacom",
  "slug": "the-long-forgotten-never-indexed-search-api-xmlteomacom",
  "title": "The Long Forgotten, Never Indexed Search API - XML.TEOMA.COM - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I'm writing this entry in the hopes that the good people at Ask.com will continue to provide the service at xml.teoma.com without interruption. I have my fears that simply by talking about it, I risk destroying its value, but after a careful review, I believe it's worth the risk to share something…",
  "content": "The Long Forgotten, Never Indexed Search API - XML.TEOMA.COM Mobile SEO By: Rand Fishkin July 26, 2006 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin July 26, 2006 The Long Forgotten, Never Indexed Search API - XML.TEOMA.COM Mobile SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I'm writing this entry in the hopes that the good people at Ask.com will continue to provide the service at xml.teoma.com without interruption. I have my fears that simply by talking about it, I risk destroying its value, but after a careful review, I believe it's worth the risk to share something of great value and interest to the SEM community as a whole. From the screenshot, we can see that the page hasn't been updated since late 2001 - the 9/11 link, press release of AskJeeves' acquisition of Teoma and use of the butler and old AskJeeves logo are dead giveaways. My thanks go first to Sean Carlos of Antezeta in Milan. Sean tipped me off as to the existence of the xml.teoma.com domain and has written a fantastic guide on his site - Decrypting Ask's Web Search API - and an accompanying documentation resource. In the documentation, Sean Carlos shows us just how flexible the API is, providing far more in the range of queries than is possible at Ask.com including: site: intitle: inurl: lang: geoloc: inlink: last: afterdate: beforedate: betweendate: His documentation provides much more, including information about how to inerpret the XML data returned. A sample of that data is below: Note data like \"score\", \"partition\" and, in the header, \"estimate result\" and \"total result\" In the screenshot, I closed the topicgroup data, showing additional related queries, which you can still get in Ask.com on the right-hand side of the results (under the Narrow Your Search and Expand Your Search headlines) I hope to see even more work and investigation go into this source. I'm sure that plenty of clever tools could come out of those projects. Let's all cross our fingers that Ask keeps it alive. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Long Forgotten, Never Indexed Search API - XML.TEOMA.COM"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Long Forgotten, Never Indexed Search API - XML.TEOMA.COM"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too"
    },
    {
      "level": "H3",
      "text": "Internal Linking for Mobile-First & Mobile-Only Indexing"
    },
    {
      "level": "H3",
      "text": "All About Fraggles (Fragment + Handle)"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}