{
  "url": "https://moz.com/blog/the-jones-day-lawsuit-big-law-firm-sues-ecommerce-site-for-linking-back-to-it",
  "slug": "the-jones-day-lawsuit-big-law-firm-sues-ecommerce-site-for-linking-back-to-it",
  "title": "The Jones Day Lawsuit: Mega Law Firm Sues E-Commerce Site For Linking Back To It - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "May It Please the Mozzers, \n\nThose of you who get paid to build links aren't going to believe this one. One of the world's largest law firms, Jones Day, actually filed suit against a small e-commerce company, BlockShopper, for linking to it with the anchor text \"Jones Day.\" \n\nYes. ...",
  "content": "The Jones Day Lawsuit: Mega Law Firm Sues E-Commerce Site For Linking Back To It E-Commerce SEO By: Sarah Bird October 13, 2008 Table of Contents Copied! By: Sarah Bird October 13, 2008 The Jones Day Lawsuit: Mega Law Firm Sues E-Commerce Site For Linking Back To It E-Commerce SEO May It Please the Mozzers, Those of you who get paid to build links aren't going to believe this one. One of the world's largest law firms, Jones Day, actually filed suit against a small e-commerce company, BlockShopper, for linking to it with the anchor text \"Jones Day.\" Yes. I'm telling you the truth. The weird thing is BlockShopper's site wasn't defamatory, negative, or competing for services. Still, Jones Day decided to file a trademark infringement and dilution lawsuit. It just makes no sense. BlockShopper reports on real estate purchases in several upscale neighborhoods around the country. It's a little privacy-invasive (not in a legal sense, but in a moral sense), but they report on the names and professions of people who buy new homes. Sometimes they provide photos of the purchasers. They also map the location of the new home and state how much the person paid for it. When describing where the person works, BlockShopper often links to the employer's site. Apparently, all the trouble started when a couple of Jones Day lawyers bought some new homes in a swanky Chicago neighborhood. BlockShopper included their names, photos from the firm's website, links to the firm's website, and information about the prices and locations of the homes. If you're thinking that maybe Jones Day is upset about the semi-creepy privacy issues or the use of the firm photos, you'd be wrong; There are no copyright claims and no privacy claims in the Complaint [PDF]. Instead, Jones Day is suing over the use of its name as anchor text for a link to its website. It claims that its mark is being diluted and there is a likelihood of confusion. Yeah right. Can you imagine someone accidentally going to BlockShopper and thinking that it was a law firm site or affiliated with Jones Day just because it links to it? Have any of the managing partners ever used the internet before? Here's a hint to the folks at Jones Day: There are no tubes. There are only links. The more links to you, the better for you. Good News: Some excellent and highly qualified attorneys from EFF, Public Citizen, Public Knowledge and the Citizen Media Law Project have stepped up to help BlockShopper fight this silly lawsuit. With some big guns willing to help, BlockShopper should be able get the case dismissed handily. Fair use is a defense to both trademark infringement and dilution. Linking to someone you are writing about is entirely lawful, so long as you aren't telling lies or confusing consumers. If it were illegal, there could be no world wide web. Bad News: If Jones Day is planning on suing everyone who links to it using the anchor text \"Jones Day,\" then it has several hundred more defendants to go. Let's hope this prestigious law firm stops embarrassing the legal profession and rethinks its losing strategy. Happy Link Building. Respectfully, Sarah L. Bird Further Reading: Paul Levy's excellent post The Plain Dealer's Coverage Techdirt TechlawJournal has a lot of links to case documents and detailed analysis Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Jones Day Lawsuit: Mega Law Firm Sues E-Commerce Site For Linking Back To It"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Jones Day Lawsuit: Mega Law Firm Sues E-Commerce Site For Linking Back To It"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Common Mistakes E-commerce Websites Make Using JavaScript"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Sarah Bird\n          \n            Sarah Bird\n          \n            Sarah Bird"
}