{
  "url": "https://moz.com/blog/the-vast-pacific-horizon",
  "slug": "the-vast-pacific-horizon",
  "title": "The Vast, Pacific Horizon - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Sunday night. Rays of sunshine are pouring in heat through the skies above Los Angeles, penetrating the plane's interior despite the drawn windowshades. Mystery Guest is next to me, reading a book we picked up on the Santa Monica pier today, and a Macromedia Flash document is calling to me from the…",
  "content": "The Vast, Pacific Horizon Moz News By: Rand Fishkin August 27, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 27, 2008 The Vast, Pacific Horizon Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Sunday night. Rays of sunshine are pouring in heat through the skies above Los Angeles, penetrating the plane's interior despite the drawn window shades. Mystery Guest is next to me, reading a book we picked up on the Santa Monica pier today, and a Macromedia Flash document is calling to me from the desktop tray, but I'm in the writing mood, so it'll have to wait a little longer. SEOmoz has been a strange place to work over the last 9 months - not because we've moved offices or doubled our staff or shifted around the management, though those milestones have certainly had an impact. No, what's really odd is that we've been in a state of constant anticipation - working towards the biggest launch we've ever had and salivating in anticipation of the release. If you've ever smoked a brisket or braised lamb on the stove, you know the sensation. Every minute spent waiting feels like an hour. The olfactory assault teases you; the glances at the clock are too frequent, and your stomach voices its opinion that the time-space continuum is moving at a less-than-optimal rate. Stretch that over the course of a year and you've got a good idea how we all feel. Rewind to the Fall of 2007. Seattle's having a rare sunbreak in late October and I'm at lunch with Michelle (our board member from Ignition). \"What's my big idea?\" she wants to know. The one I'm dreaming about - the one I'd build if resources were no constraint and time was, for once, on my side. \"Well,\" I say, \"there is this one thing.\" Yeah - but that one thing is going to take a lot more time and resources than we've got, even without outside investment. It's so ambitious that even my usually optimistic friends in the industry don't see it as a real possibility in the next half decade. The thing is - they don't know about my secret weapons (and until January rolled around, actually, neither did I). It turns out that with the right connections, the right partnerships, a half-crazy CEO, a pair of equally over-optimistic, never-say-die engineers (Nick & Ben), and the dedicated SEOmoz team, my pipe dream might actually have a chance in hell of bearing fruit. February of 2008 and some early testing gives us a roadmap, but it's an expensive one and it's going to mean tying up nearly all of our dev resources for 6 months (and adding a handful of pricey, new talent to the team). That means virtually no new tools, no new projects, no time to patch up the parts of the SEOmoz site that aren't scaling so well. Big risk could spell big rewards, but only if everyone in the SEO world thinks this product is as amazing as I do. Otherwise, the burn rate is going to catch up too fast, and that means... Well, it won't be pretty. Looking up from my laptop, the sunlight's gone and the dark rainclouds of Northern Oregon obscure the last wisps on sunset. That Flash document - a slideshow of wireframes for our new product, still hasn't gotten the attention it deserves. The visualization of all our new stuff is proving to be a massive challenge, so I'm attempting to re-skin the graphs and charts to help clear this hurdle. Some of the concepts are so new and unfamiliar that they require a great deal of education before they can start to provide value and insight. SEOs are smart, and they learn fast, but we don't have the luxury of time on our side, and in a down economy, marketers need actionable data, not inaccessible brain teasers. In May, I remember getting my first glance at an early Alpha version of the product - by then it was affectionately called \"Carhole\" internally. If you don't watch the Simpsons regularly, the name's a nod to this brilliant bit of dialogue. Every SEO project I worked on that month and every question I answered found some use for \"Carhole.\" And every time I didn't use it, I thought of how, when the final product launched, I'd be able to solve all the missing pieces of the puzzle. But the doubts were still there - what if no one else realizes how amazing this will be? What if the data is too complex to be accessible to a large audience? What if we run out of money before we can launch? This, I think, is a startup CEO's life - half driving, mind-numbing, teeth-chattering fear. And, half wild-eyed, frenetic, obsessive passion. Nothing's good enough, yet everything is amazing. Nothing can be launched fast enough, but rushing out the door is fraught with peril. Today the world will rejoice at the mere thought of your product; tomorrow, it's too complex to get traction. How do we survive this institutional chaos without going mad? I don't know - I know that some of us don't. I just wish I knew whether it was luck or wisdom that kept the successful ones afloat in the maelstrom - and whether I have enough of either to make it. Tonight I'm back in Seattle. Mystery Guest's still next to me, but she's given up on her book and has fallen asleep on the floor next to the computer in our spare apartment bedroom. In 18 days, we'll be married - another event nothing can prepare me for, and one that takes up every spare second of an already overburdened year. Has ambition outweighed common sense? Has Rand finally succumbed to his own driving neuroses? Only time will tell. I do know that the next 60 days are going to be some of the defining moments of my life, both personally and professionally. I just thank the stars that even if things don't turn out perfect on the professional side, they've never looked brighter personally. And deep down, I know that's the one that really matters. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Vast, Pacific Horizon"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Vast, Pacific Horizon"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}