{
  "url": "https://moz.com/blog/the-middle-path-of-marketing-a-philosophy",
  "slug": "the-middle-path-of-marketing-a-philosophy",
  "title": "The Middle Path of Marketing - A Philosophy - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The middle path being such as ubiquitous phenomenon, let’s apply it with to what we do here – Online Marketing. I find this philosophy manifests itself across all aspects of this discipline, from Web Design, SEO, PPC, Analytics & Strategy.",
  "content": "The Middle Path of Marketing - A Philosophy Marketing Psychology By: Mark Meyerson February 20, 2014 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Mark Meyerson February 20, 2014 The Middle Path of Marketing - A Philosophy Marketing Psychology This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. The Middle Path Philosophy Taking the middle path is a concept that promotes balance, diversity and moderation. It’s a philosophy that covers so many aspects of life and when applied to marketing can bring tremendous insight. It’s essentially about acting in moderation, evaluating all options and making informed and balanced decisions. My first encounter with this philosophy came from the Medieval Spanish philosopher, physician and scholar Maimonides. Maimonides proposed that in everything we do, we should always tend to the middle path. He writes: \"The upright path is the middle path of all the qualities known to man. This is the path which is equally distant from the two extremes, not being too close to either side.” (Yad hachazaka Chap 1. Law 4). He goes on to explain that this includes everything from finances, to character traits. Later on, I discovered that this idea predates Maimonides and is actually Aristotelian in nature. Aristotle said that exercise, virtues, courage, indulgence and more, all need to be taken in moderation. It’s the path between excess and deficiency. (Nicomachean Ethics, Book II, Section 9) In Buddhist theology there is also the expression of the ‘middle way’ in connection with the path to achieving Nirvana. In life, there are so many instances where this makes sense. Research by Schwartz and Grant has demonstrated that many phenomenon follow an inverted U-Shaped curve, where there is a point along the line after which the positive effects of phenomena turn negative. Graphically, this looks like this: In this example, performance increases with arousal, but only to a point, where more arousal decreases performance. There is an optimal point or inflection point at which maximum performance is achieved. Schwartz and Grant go so far as to suggest that “psychologists have good reason to believe that life is nonmonotonic….this may be a fundamental and ubiquitous psychological principle: There is no such thing as an unmitigated good.” (Where nonmonotonic means that there is an inverted U structure, whereby at high levels, costs outweigh benefits.). Some examples in life where this is true include: wealth and parenting, emotional well-being and income, happiness and longevity, class size and academic achievement, alcohol consumption and health, crime levels and punishment. (Some of these examples were taken from Gladwells ‘David & Goliath, Chap 2.’ There you can find further discussion on this topic). The Middle Path of Marketing This being such as ubiquitous phenomenon, let’s apply it with to what we do here – Online Marketing. I find this philosophy manifests itself across all aspects of this discipline, from Web Design, SEO, PPC, Analytics and Strategy. Here are several examples: Choice Selling products on a website involves giving our customers choice. Intuitively, we think that the more options we provide the better experience our customers will have. It’s not so. Iyengar and Lepper found that more choice is actually demotivating and can be detrimental in many cases to sales. Schwartz and Grant claim that “as choice increases, welfare increases, but the relation is not linear: there are diminishing marginal benefits to added options”. Schwartz has also written extensively about this in his book “the paradox of choice, why more is less”. Choice on a website can cover a large range of aspects. Things like: choice of products, choice of accessories, choice of information and choice of social media platforms to share on. It certainly takes a central role in website design and marketing, as having to little choice will limit our ability to compete with competitors, however too much choice will be confounding for customers. The optimal number of choices will be different depending on the context. It’s important to test and find that optimal inflection point where too much choice becomes constricting. Information in Moderation Content marketing is a popular catchword these days and it’s often about creating great resources on our websites. Having a great resource will attract interested people and help to establish a company or person as a thought leader in their industry. We often see things like ‘the ultimate guide to…’ or ‘everything you needed to know about….’ Investing in this type of content is great, but to a degree. There is a point at which you can approach information overload. Compiling pages and pages of information on the intricacies of a topic is going to be tedious. Readers want to be able to find the information they need quickly, so keeping these guides and website content concise is a consideration. It is about finding that sweet spot between having enough to be considered authoritative and encompassing, but not having too much, to make it not useful. The same applies to media types. Having videos, audio, infographics, graphics, all on one page can also become overbearing. You need just enough to be interesting and helpful. Backlink Profiles Moving over to offsite SEO, part of any good strategy will be to increase the number, quality and type of the backlinks to your website. There is a strong correlation between backlinks (quality and quantity) and rankings. However, a good strategy doesn’t simply need to pursue high quality backlinks, but rather a diverse range of backlinks. This is because it’s important to keep the profile natural and not trigger any algorithmic penalties. The below graph shows the backlink profiles of four clients. The graph shows the number of backlinks per client at each level of Domain Authority (DA), where DA is a measure of the domain quality. You see in the graph that Client D has a large amount of backlinks under DA 25. The link profile is positively skewed. At first glance, this looks good as it has a much larger quantity of links then other clients, but really this means that there is a disproportionate amount of low quality links coming into the site. This is a strong indicator that unnatural link building is occurring and this also places the domain in a low quality neighbourhood, by associating it with these similar low level DA sites. Client A on the other hand is actually in a much better position, they have backlinks more evenly spread out along the DA spectrum, with a larger number of inlinks at higher levels like DA 30 to 45. The ideal link profile will look more like a bell curve: This is preferable because in general it is very difficult to acquire links from high profile, high DA sites. Similarly, you want to keep away from too many easy low quality DA sites. Ideally a good site that wants to rank well should have most of its inlinks from sites in the medium range. This is a perfect example of the middle path in action, graphically. The key is diversity and moderation. Diversify your Overall Strategy and Channels In finance, portfolio theory proposes that by diversifying investments you can maintain return and minimise risk. Schwartz and Grant say in their paper that “All positive traits, states and experiences have costs that at high levels may begin to outweigh their benefits”. The same is true online, there are a many different inbound channels that you can utilise to achieve your marketing goals: Organic Search Paid Search Display advertising Social platforms: Facebook, Twitter, LinkedIn etc.. Email marketing Direct marketing Referral, affiliate, etc… If you invest too much in one area, the benefits are eventually going to outweigh the cost. It’s critical to follow the middle path philosophy. It is too risky to put all your eggs in just one or two baskets, but at the same time, you can’t spread yourself to thin either. Analytics reports such as Multi-Channel funnels can help you assess how your different inbound channels work together. You can see how activity in one channel helps drive conversions through another. For example, I may run a campaign on a social network to raise awareness of my brand or product. If this sparks interest and later on a user searches for my product in a search network, but can’t find me, then the effort goes to waste. Your efforts need to be diverse, but should focus on core areas for which you have enough resources. Paid Campaigns The same is true if you drill down into any of your channels specifically. Paid campaigns are especially good because of the large amount of available data. It is easy to evaluate these campaigns according to CPA goals once your tracking is setup. With Adwords optimisation, the best strategy is one that is based on the middle path philosophy as well. Campaigns that have too wide a reach will become irrelevant, yet campaigns that are too specific will miss out on much of their potential. The best strategy is one that has a broad reach, yet is filtered to exclude everything that is irrelevant. I put this into practice using broad match modifier to begin with and then over time strictly filtering out negatives. Another mistake that companies make is to have a set CPA goal for all campaigns. The issue here is that the market is different for different products and the reality is there is different conversion rates based on this. CPA goals or other goals need to be set appropriately based on the reality within the market. It’s important to first achieve profitability in any campaign, then look to minimise CPA and maximise conversions. This should be done campaign by campaign, and not restricted as a blanket rule. Again this middle path strategy is ideal because it starts out with a broad reach and then based on profitability campaigns are optimised or removed to end up with the optimal number of campaigns within the account. Data Puke This is a term coined by Avinash Kaushik in reference to having too much data in your web analytics reporting, making it difficult to understand what is going on. Having too little data or reports will make it difficult to find insights and draw actionable conclusions. Similarly having too many reports and too much information per report is overwhelming, leads to data puke and makes it harder to find the important data. The key is to find your sweet spot. This is the specific path, guided by your business goals, that provides the right amount of reporting to give you just enough data on the information you need. Avinash often talks about having just four key reports in Google Analytics, one per each section. Each of these can give you a wealth of information. For more advanced Analytics users, these can come in the form of custom report templates and advanced segments. Hear Avinaush himself talk about these specific reports in this discussion. Also, find more discussion on Data Puke here. Challenges to the Middle Path The middle path is not without its challenges. These are the challenges that I have encountered and my thoughts in how to overcome them: Taking a stand Sometimes it’s important to take a stand in life. You don’t always want to be a fence sitter. If something is really great and it works for you, then you should go with it and perhaps sometimes stray out of the middle just a bit. But even then, too much of anything is a bad thing. Even too much water can kill you, it is called Hyponatremia and it can be fatal. Where is the Middle? My biggest issue is that it is not often clear where the middle is. As a philosophy of life, in some ways you are always in the middle. If you look to one extreme you will find people there and if you look to the other you will also find people in that direction more extreme then you. So you are in the middle of them. They way around this is to quantify as much as you can. For example, studies found that the ideal amount of financial income in order to be a good parent is around $75,000 per year. Any less than that and the parent needs to spend less time with their kids in order to make money, any more and it doesn’t provide any more benefit to parenting, it makes it harder to say no. The only way you can find an average is by gathering the data and doing the math. In marketing, we need to be able to quantify this as well. For a DA curve, it is relatively easy to see where the middle is. Similarly, when it comes to choices, experiments can help you find the optimum. It’s harder when we review multi-channel marketing and multi campaign marketing. Everyone’s business, resources and goals are a bit different so the middle will be slightly different. Conclusion Many of us find our middle path naturally, others tend to extremes. I find when I take on something new that in the beginning I tend to an extreme and then over time I settle down into a middle path. I think it’s important to diversify early and then evaluate. Recognising the importance of the middle path and becoming more aware of it, can help us get to the optimal point quicker, both in life and in business. Certainly in the sphere of online marketing it is manifest from a top-level strategy all the way down to the way we view data and make specific optimisations. What do you think? Are you currently following the middle path, should we really be looking to the middle, or should we take a stand? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Middle Path of Marketing - A Philosophy"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Middle Path of Marketing - A Philosophy"
    },
    {
      "level": "H2",
      "text": "The Middle Path Philosophy"
    },
    {
      "level": "H2",
      "text": "The Middle Path of Marketing"
    },
    {
      "level": "H3",
      "text": "Choice"
    },
    {
      "level": "H3",
      "text": "Information in Moderation"
    },
    {
      "level": "H3",
      "text": "Backlink Profiles"
    },
    {
      "level": "H3",
      "text": "Diversify your Overall Strategy and Channels"
    },
    {
      "level": "H3",
      "text": "Paid Campaigns"
    },
    {
      "level": "H3",
      "text": "Data Puke"
    },
    {
      "level": "H2",
      "text": "Challenges to the Middle Path"
    },
    {
      "level": "H3",
      "text": "Taking a stand"
    },
    {
      "level": "H3",
      "text": "Where is the Middle?"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Turn Marketing Into Meaningful Relationships — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Catering to User Behavior Shifts During Times of Economic Turbulence — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Close More Sales With Emotion-Driven SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Mark Meyerson\n          \n            Mark Meyerson"
}