{
  "url": "https://moz.com/blog/the-new-link-explorer-is-here",
  "slug": "the-new-link-explorer-is-here",
  "title": "Moz's Link Data Used to Suck... But Not Anymore! The New Link Explorer is Here - Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Link Explorer may be in beta, but when it comes to your links, it's still a big deal. In this Whiteboard Friday, Rand transparently addresses many of the biggest complaints about OSE over the years and explains the vast improvements Link Explorer provides, from DA scores updated daily to historic…",
  "content": "The New Link Explorer is Here Moz Tools | Whiteboard Friday | Link Building By: Rand Fishkin May 4, 2018 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 4, 2018 The New Link Explorer is Here Moz Tools | Whiteboard Friday | Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Earlier this week we launched our brand-new link building tool, and we're happy to say that Link Explorer addresses and improves upon a lot of the big problems that have plagued our legacy link tool, Open Site Explorer. In today's Whiteboard Friday, Rand transparently lists out many of the biggest complaints we've heard about OSE over the years and explains the vast improvements Link Explorer provides, from DA scores updated daily to historic link data to a huge index of almost five trillion URLs. Click on the whiteboard image above to open a high-resolution version in a new tab! Video Transcription Howdy, Moz fans, and welcome to another edition of Whiteboard Friday. This week I'm very excited to say that Moz's Open Site Explorer product, which had a lot of challenges with it, is finally being retired, and we have a new product, Link Explorer, that's taking its place. So let me walk you through why and how Moz's link data for the last few years has really kind of sucked. There's no two ways about it. If you heard me here on Whiteboard Friday, if you watched me at conferences, if you saw me blogging, you'd probably see me saying, \"Hey, I personally use Ahrefs, or I use Majestic for my link research.\" Moz has a lot of other good tools. The crawler is excellent. Moz Pro is good. But Open Site Explorer was really lagging, and today, that's not the case. Let me walk you through this. The big complaints about OSE/Mozscape 1. The index was just too small Mozscape was probably about a fifth to a tenth the size of its competitors. While it got a lot of the quality good links of the web, it just didn't get enough. As SEOs, we need to know all of the links, the good ones and the bad ones. 2. The data was just too old So, in Mozscape, a link that you built on November 1st, you got a link added to a website, you're very proud of yourself. That's excellent. You should expect that a link tool should pick that up within maybe a couple weeks, maybe three weeks at the outside. Google is probably picking it up within just a few days, sometimes hours. Yet, when Mozscape would crawl that, it would often be a month or more later, and by the time Mozscape processed its index, it could be another 40 days after that, meaning that you could see a 60- to 80-day delay, sometimes even longer, between when your link was built and when Mozscape actually found it. That sucks. 3. PA/DA scores took forever to update PA/DA scores, likewise, took forever to update because of this link problem. So the index would say, oh, your DA is over here. You're at 25, and now maybe you're at 30. But in reality, you're probably far ahead of that, because you've been building a lot of links that Mozscape just hasn't picked up yet. So this is this lagging indicator. Sometimes there would be links that it just didn't even know about. So PA and DA just wouldn't be as accurate or precise as you'd want them to be. 4. Some scores were really confusing and out of date MozRank and MozTrust relied on essentially the original Google PageRank paper from 1997, which there's no way that's what's being used today. Google certainly uses some view of link equity that's passed between links that is similar to PageRank, and I think they probably internally call that PageRank, but it looks nothing like what MozRank was called. Likewise, MozTrust, way out of date, from a paper in I think 2002 or 2003. Much more advancements in search have happened since then. Spam score was also out of date. It used a system that was correlated with what spam looked like three, four years ago, so much more up to date than these two, but really not nearly as sophisticated as what Google is doing today. So we needed to toss those out and find their replacements as well. 5. There was no way to see links gained and lost over time Mozscape had no way to see gained and lost links over time, and folks thought, \"Gosh, these other tools in the SEO space give me this ability to show me links that their index has discovered or links they've seen that we've lost. I really want that.\" 6. DA didn't correlate as well as it should have So over time, DA became a less and less indicative measure of how well you were performing in Google's rankings. That needed to change as well. The new DA, by the way, much, much better on this front. 7. Bulk metrics checking and link reporting was too hard and manual So folks would say, \"Hey, I have this giant spreadsheet with all my link data. I want to upload that. I want you guys to crawl it. I want to go fetch all your metrics. I want to get DA scores for these hundreds or thousands of websites that I've got. How do I do that?\" We didn't provide a good way for you to do that either unless you were willing to write code and loop in our API. 8. People wanted distribution of their links by DA They wanted distributions of their links by domain authority. Show me where my links come from, yes, but also what sorts of buckets of DA do I have versus my competition? That was also missing. So, let me show you what the new Link Explorer has. Click on the whiteboard image above to open a high-resolution version in a new tab! Wow, look at that magical board change, and it only took a fraction of a second. Amazing. What Link Explorer has done, as compared to the old Open Site Explorer, is pretty exciting. I'm actually very proud of the team. If you know me, you know I am a picky SOB. I usually don't even like most of the stuff that we put out here, but oh my god, this is quite an incredible product. 1. Link Explorer has a GIANT index So I mentioned index size was a big problem. Link Explorer has got a giant index. Frankly, it's about 20 times larger than what Open Site Explorer had and, as you can see, very, very competitive with the other services out there. Majestic Fresh says they have about a trillion URLs from their I think it's the last 60 days. Ahrefs, about 3 trillion. Majestic's historic, which goes all time, has about 7 trillion, and Moz, just in the last 90 days, which I think is our index — maybe it's a little shorter than that, 60 days — 4.7 trillion, so almost 5 trillion URLs. Just really, really big. It covers a huge swath of the web, which is great. 2. All data updates every 24 hours So, unlike the old index, it is very fresh. Every time it finds a new link, it updates PA scores and DA scores. The whole interface can show you all the links that it found just yesterday every morning. 3. DA and PA are tracked daily for every site You don't have to track them yourself. You don't have to put them into your campaigns. Every time you go and visit a domain, you will see this graph showing you domain authority over time, which has been awesome. For my new company, I've been tracking all the links that come in to SparkToro, and I can see my DA rising. It's really exciting. I put out a good blog post, I get a bunch of links, and my DA goes up the next day. How cool is that? 4. Old scores are gone, and new scores are polished and high quality So we got rid of MozRank and MozTrust, which were very old metrics and, frankly, very few people were using them, and most folks who were using them didn't really know how to use them. PA basically takes care of both of them. It includes the weight of links that come to you and the trustworthiness. So that makes more sense as a metric. Spam score is now on a 0 to 100% risk model instead of the old 0 to 17 flags and the flags correlate to some percentage. So 0 to 100 risk model. Spam score is basically just a machine learning built model against sites that Google penalized or banned. So we took a huge amount of domains. We ran their names through Google. If they couldn't rank for their own name, we said they were penalized. If we did a site: the domain.com and Google had de-indexed them, we said they were banned. Then we built this risk model. So in the 90% that means 90% of sites that had these qualities were penalized or banned. 2% means only 2% did. If you have a 30% spam score, that's not too bad. If you have a 75% spam score, it's getting a little sketchy. 5. Discovered and lost links are available for every site, every day So again, for this new startup that I'm doing, I've been watching as I get new links and I see where they come from, and then sometimes I'll reach out on Twitter and say thank you to those folks who are linking to my blog posts and stuff. But it's very, very cool to see links that I gain and links that I lose every single day. This is a feature that Ahrefs and Majestic have had for a long time, and frankly Moz was behind on this. So I'm very glad that we have it now. 6. DA is back as a high-quality leading indicator of ranking ability So, a note that is important: everyone's DA has changed. Your DA has changed. My DA has changed. Moz's DA changed. Google's DA changed. I think it went from a 98 to a 97. My advice is take a look at yourself versus all your competitors that you're trying to rank against and use that to benchmark yourself. The old DA was an old model on old data on an old, tiny index. The new one is based on this 4.7 trillion size index. It is much bigger. It is much fresher. It is much more accurate. You can see that in the correlations. 7. Building link lists, tracking links that you want to acquire, and bulk metrics checking is now easy Building link lists, tracking links that you want to acquire, and bulk metrics checking, which we never had before and, in fact, not a lot of the other tools have this link tracking ability, is now available through possibly my favorite feature in the tool called Link Tracking Lists. If you've used Keyword Explorer and you've set up your keywords to watch those over time and to build a keyword research set, very, very similar. If you have links you want to acquire, you add them to this list. If you have links that you want to check on, you add them to this list. It will give you all the metrics, and it will tell you: Does this link to your website that you can associate with a list, or does it not? Or does it link to some page on the domain, but maybe not exactly the page that you want? It will tell that too. Pretty cool. 8. Link distribution by DA Finally, we do now have link distribution by DA. You can find that right on the Overview page at the bottom. Look, I'm not saying Link Explorer is the absolute perfect, best product out there, but it's really, really damn good. I'm incredibly proud of the team. I'm very proud to have this product out there. If you'd like, I'll be writing some more about how we went about building this product and a bunch of agency folks that we spent time with to develop this, and I would like to thank all of them of course. A huge thank you to the Moz team. I hope you'll do me a favor. Check out Link Explorer. I think, very frankly, this team has earned 30 seconds of your time to go check it out. Try out Link Explorer! All right. Thanks, everyone. We'll see you again for another edition of Whiteboard Friday. Take care. Video transcription by Speechpad.com Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The New Link Explorer is Here"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The New Link Explorer is Here"
    },
    {
      "level": "H2",
      "text": "Video Transcription"
    },
    {
      "level": "H2",
      "text": "The big complaints about OSE/Mozscape"
    },
    {
      "level": "H3",
      "text": "1. The index was just too small"
    },
    {
      "level": "H3",
      "text": "2. The data was just too old"
    },
    {
      "level": "H3",
      "text": "3. PA/DA scores took forever to update"
    },
    {
      "level": "H3",
      "text": "4. Some scores were really confusing and out of date"
    },
    {
      "level": "H3",
      "text": "5. There was no way to see links gained and lost over time"
    },
    {
      "level": "H3",
      "text": "6. DA didn't correlate as well as it should have"
    },
    {
      "level": "H3",
      "text": "7. Bulk metrics checking and link reporting was too hard and manual"
    },
    {
      "level": "H3",
      "text": "8. People wanted distribution of their links by DA"
    },
    {
      "level": "H2",
      "text": "So, let me show you what the new Link Explorer has."
    },
    {
      "level": "H3",
      "text": "1. Link Explorer has a GIANT index"
    },
    {
      "level": "H3",
      "text": "2. All data updates every 24 hours"
    },
    {
      "level": "H3",
      "text": "3. DA and PA are tracked daily for every site"
    },
    {
      "level": "H3",
      "text": "4. Old scores are gone, and new scores are polished and high quality"
    },
    {
      "level": "H3",
      "text": "5. Discovered and lost links are available for every site, every day"
    },
    {
      "level": "H3",
      "text": "6. DA is back as a high-quality leading indicator of ranking ability"
    },
    {
      "level": "H3",
      "text": "7. Building link lists, tracking links that you want to acquire, and bulk metrics checking is now easy"
    },
    {
      "level": "H3",
      "text": "8. Link distribution by DA"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How To Plan and Run a Successful Client Meeting – Next Level"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "Moz AI: Introducing Augmented Intelligence"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}