{
  "url": "https://moz.com/blog/the-island-of-dr-yahoogle-or-the-reverse-directory-hypothesis",
  "slug": "the-island-of-dr-yahoogle-or-the-reverse-directory-hypothesis",
  "title": "The Island of Dr. Yahoogle, or The Reverse Directory Hypothesis - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Lately, the search engines seem to have become more intelligent. I say this because the suggestions they make seem to be more accurate. Now, this obviously goes back to a human decision to leverage data that had already been collected, rather than a vast improvement in the suggestion engine.",
  "content": "The Island of Dr. Yahoogle, or The Reverse Directory Hypothesis Keyword Research By: buybigtires November 3, 2008 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: buybigtires November 3, 2008 The Island of Dr. Yahoogle, or The Reverse Directory Hypothesis Keyword Research This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Lately, the search engines seem to have become more intelligent. I say this because the suggestions they make seem to be more accurate. Now, this obviously goes back to a human decision to leverage data that had already been collected, rather than a vast improvement in the suggestion engine. The good news is that it gives us an idea as to the prevailing logic that currently dominates the search sphere. For example, when you misspell a word at MSN/Live and Yahoo, they now give you the result they think you were searching for (e.g. agirculture nets results for agriculture). All of the engines now give related search terms when you search for a given term. In Google's case, it occasionally gives you terms that are remarkably related to each other: \"4x4\" and \"off road\" being two such terms. Then it occurred to me: If the engines are viewing these terms as being synonymous, then could anchor text containing either term boost rankings in both SERPs? So I went through my ranking data and the answer is yes, at least to some degree. Google (and possibly MSN ) has taken this data into account in their algorithms, and made positive adjustments accordingly. Why is this important? This is far different than just varying your core anchor text (which, by the way, is a pretty good idea) by adding, subtracting, or changing the order of words. If I am correct (and according to my horribly unscientific collection of data, I am) then you can kill two birds with one stone, er...link. If the argument is correct. then it gives us a little better idea of how Google views authority within a niche. We are always using the term \"organic\" as a way to describe the SEO process and the rankings in Google. The truth is, Google is doing lab-controlled evolution. The matter may be organic, but the process is anything but. Google defines (or obscures) what is necessary to progress to the next round of the process. That's not saying that a brier doesn't get huge before the big G lops it off at the roots, but that they control the growing environment. Google starts you off as an uncategorized site, storing text, title tags, internal structure. As links develop, Google slowly categorizes you based on anchor text given. It then combines your anchor text and compares it with the other sites that have the same anchor text. Some of it is for ranking purposes, but mainly Google is doing quality control. Once you have met the requirements, Google then moves on link strength and other on-page factors for what I am calling a \"brute force\" analysis. This determines ranking. When you have become a niche leader and have enough keywords in common with other category leaders (in the eyes of Google) they then free you to compete in a broader category with greater success. (Essentially, this is the directory model in reverse.) Rinse, repeat, ad infinitum. In this case, the so-called \"sandbox\" is more of \"uncategorized\" zone. It's not so much a penalty, as Google has not decided what preliminary category to put the site in. I believe this is why we see some new sites ranking immediately while others languish outside the index for months. This all extremely oversimplified and depends on me being correct, of course. So, all that, just to say this: Do a search, check the SE's suggestions for related searches. In addition to varying anchor text, used these terms as well. Try to dominate a niche before shooting for a highly competitive keyword. Result: Hopefully, a synergistic boost within your niche. I know that this is just common sense to some of you, and if so, I apologise for wasting your time. My greatest hope is that it provides a slight shift in perspective that gives you a competitive advantage. Signing off... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Island of Dr. Yahoogle, or The Reverse Directory Hypothesis"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Island of Dr. Yahoogle, or The Reverse Directory Hypothesis"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "buybigtires\n          \n            buybigtires"
}