{
  "url": "https://moz.com/blog/the-day-remarketing-changed-forever",
  "slug": "the-day-remarketing-changed-forever",
  "title": "The Day Remarketing Changed Forever - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "On June 25th, 2015, AdWords changed forever when Google announced that remarketing audiences would become available for advertisers on search. In this video blog, Ciaran Murphy goes over what this means and why it's important.",
  "content": "The Day Remarketing Changed Forever Online Advertising | Marketing Industry By: Ciaran Murphy December 16, 2015 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Ciaran Murphy December 16, 2015 The Day Remarketing Changed Forever Online Advertising | Marketing Industry The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Today, we're talking about June 25th, 2015: the day Google AdWords changed forever to allow Analytics remarketing audiences to be available for advertisers on search. In our video blog, we'll begin by telling you why this is important and explain some problems it solves. We'll give you some examples of how you can use RLSAs, along with four benefits of using them. We've also included a simple example of how you can create one audience. And we'll conclude with the sequel to The Day Google AdWords Changed Forever. This video is about 25 minutes long — if this hits your TLDW (too long, didn’t watch) limit, you can check out a shortened, related video on elegant remarketing on search, or read through the summary below. 1. AdWords Problems Those familiar with Google AdWords will be aware that it is your website’s best (or second-best, behind organic) converting source of traffic. However, that's not to say that Google AdWords isn't without its problems. We term the three most common issues we see with AdWords as: The Leaky Bucket The Generic KeyWord Conundrum You Say Tomato The Leaky Bucket The Leaky Bucket refers to instances where your AdWords budget is insufficient to cover all searches for your keywords. This means that you could potentially miss out on conversions due to your ad not showing along a user’s path to purchase. The Generic Keyword Conundrum We coined the phrase \"Generic KeyWord Conundrum\" for keywords that are relevant to your business and which will drive a lot of traffic to your website. However, this traffic can be top-of-funnel and less likely to convert. So, when you have a set budget, it may not always make sense to bid on generic keywords. You Say Tomato Then we come to the issue of the keyword itself. The best thing about AdWords is that it's based on keywords. You choose your keywords, set your bid, and off you go driving traffic to your website. Yet, it can often be difficult to understand the intent behind a user’s search term. For example, if a user searches for \"pizza,\" it's difficult to know if they're searching for \"pizza delivery,\" a nearby restaurant, or a recipe. Encapsulating these issues, we can say that the biggest limitation for AdWords has been that we can only target by words (excluding the obvious targeting options of location, device, etc). 2. RLSAs & Google Analytics We're always striving to innovate for our clients here at Wolfgang Digital; to this end, we have weekly learning sessions where we discuss the latest changes in AdWords and how we can introduce these to our clients’ accounts. So we were extremely excited when it was announced on June 25th that Analytics audiences would now become available within Remarketing Lists for Search Ads. Up to that point, you could use RLSAs only with your AdWords remarketing tag. This would now mean that we could use over 200 Google Analytics dimensions and metrics to create audiences for RLSAs. Building out these audiences meant that we could effectively target people at all stages across the purchase funnel. 3. RLSAs & Audience building Audience of website visitors We could create an audience for past website visitors on the awareness stage. This means when we bid on keywords, we know that the user has been on our website and are familiar with our products, services, and price range. This user is more qualified and we can now tackle the Generic KeyWord Conundrum and also ensure that we do not suffer from the Leaky Bucket. We can target Facebook traffic within the interest stage. Facebook drives lots of quality traffic, but it still suffers from lower conversion rates. Capturing this audience in Analytics and remarketing to them on search will allow advertisers to extract more value from their Facebook activity. Case study 1: Brown Thomas Our first case study comes from a department store in Dublin who wanted visibility on highly competitive keywords for cosmetic keywords. We knew from past AdWords performance and insights from their Google Analytics that we would have a tough time getting good coverage on these keywords, while keeping the campaigns profitable — so we decided to overlay the campaign with a remarketing list for people who had previously visited the website. This enabled us to improve conversion rate by 1,500% and reduce cost-per-sale by 94%. Case study 2: iClothing Our second case study comes from an online clothes retailer called iClothing. We manage their social accounts as well as their AdWords account, and could see that while social conversion rates were low, it was often a touchpoint on a user’s path to purchase. We created a list of users who had come to the iClothing website from one of our Facebook ads. Using this list within AdWords, we were able to show these users specific, Facebook-related ads encouraging them to return to the website to complete their purchase. This strategy allowed us to boost conversion rate by 165%, while reducing cost-per-sale by 84%. Past purchases & repeat customers Another smart way to capture an audience is to look at past purchasers and repeat customers. You can define these audiences based on users who have made exactly one purchase as a \"past customer,\" and users who have made more than 1 purchase as \"repeat customers.\" There are lots of studies that indicate customers will convert at a higher rate and spend more, so it makes sense to target customers differently than non-customers. Case study 3: McElhinneys Based on these studies, as well as our own insights from Google Analytics, we implemented a strategy for another one of our clients, McElhinneys, to break our audience down into 2 distinct categories: one for past customers, and one for users who were yet to purchase from us. This allowed us to target the 2 audiences in different ways and with different messages, as well as allowing us to split our budget as efficiently as possible. The implementation of this strategy led to a 324% boost in conversion rate, a 75% drop in cost-per-sale, and a 300% boost in Return On Ad Spend (ROAS). Other audiences There are a few other types of audiences to take note of that you might want to target. These could be cart abandoners, those who've visited a certain number of pages, or those who have spent a certain amount of time on your site — these people are more likely to be engaged with your site and your products. 4. How to create an audience Make sure your Google Analytics account is linked to your Google AdWords account. Make sure Remarketing is on in the Data Collection setting in your Analytics account (this is essential!). Go to the \"Audiences\" settings in the Remarketing section of the Property column on the Admin page of your Google Analytics account. Click on \"+New Audience.\" Select the Analytics view that you want to take this audience from and the AdWords account where you want to use the audience. You can then either create a new audience based on a number of characteristics, or import an existing segment as an audience. Once the audience is created, you’ll be able to see it in the Shared Library of your AdWords account. Creating the audiences is a straightforward process. You need to visit the Remarketing section within Admin in Google Analytics. You then link with the appropriate AdWords account. Next, you can decide whether to use some available audiences, or import some segments already active within your Analytics account — or you can create a new audience. Creating a new audience is easy. You can build an audience based on demographics, technology, behavior, date of first session, or traffic source. For example, we can create an audience for traffic that arrives from source = Facebook & Medium = CPC and this will create an audience of all Paid Facebook traffic (assuming you use GTMs to tag your Facebook Paid traffic with Medium = CPC). The next time you visit the Audience section of your AdWords Shared Library, you'll see your new Analytics audience available. 5. Benefits of RLSAs Now we'll look at four benefits of using RLSAs. Control budget First up, it allows us to control budget. We can ensure that we place sufficient budget on our best-performing campaigns. We have mentioned using RLSAs for past purchasers — in this case, we can ensure that any campaign targeting past purchasers has full impression share, as this campaign will be most likely to convert. Control ad message Our second benefit is that we can control our ad message. For example, after capturing a Facebook audience who has viewed our Spring/Summer dresses, we can tailor our creative by referencing Facebook and a Summer Sale. Control KPIs The third benefit is that we can control KPIs. We can now differentiate our campaigns between customer retention and customer acquisition, and designate our KPIs accordingly. Control targeting Finally, the fourth benefit allows us to control targeting. We can decide exactly what audiences we are showing our search ads to. We can move beyond mere keyword targeting and now add the layer of an audience, making Google AdWords even more powerful. 6. The Day Adwords Changed Forever: Further developments with RLSAs But, like all great stories, there is a sequel. The Day AdWords Changed Forever, Part II was when Google moved beyond audience targeting based on Analytics and introduced first-party data with Customer Match. Having witnessed the success of Facebook’s and Twitter’s use of email lists within their platform, it became inevitable that AdWords would allow advertisers to use email lists on search. Building audiences via Analytics has its limitations. It is cookie-based, so a user could delete their cookies and we would lose them. They also do not cross devices so again we might be missing our audience when they switch devices. This makes email lists much more powerful, as we can now target users across devices when they're logged into Google. There are requirements to enable Customer Match, but if you go through the video blog above, we include a way to hack these requirements. Customer Match Go to the Audiences section of the Shared Library of your Google AdWords account, click on \"+Remarketing List\" and click on \"Customer Emails.\" You can then name your list and upload a .csv file with the email addresses on it. You also need to provide a URL where users can unsubscribe from the list. Define the duration of this audience, i.e. how long a user will remain part of this audience. Click \"Upload and save list.\" Wait until your list has been processed and if there are enough valid email addresses, you can then start to advertise to that list. Thanks for watching and reading along today. We'd love to hear your thoughts on RLSAs and AdWords — sound off in the comments section below! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Day Remarketing Changed Forever"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Day Remarketing Changed Forever"
    },
    {
      "level": "H2",
      "text": "1. AdWords Problems"
    },
    {
      "level": "H3",
      "text": "The Leaky Bucket"
    },
    {
      "level": "H3",
      "text": "The Generic Keyword Conundrum"
    },
    {
      "level": "H3",
      "text": "You Say Tomato"
    },
    {
      "level": "H2",
      "text": "2. RLSAs & Google Analytics"
    },
    {
      "level": "H2",
      "text": "3. RLSAs & Audience building"
    },
    {
      "level": "H3",
      "text": "Audience of website visitors"
    },
    {
      "level": "H3",
      "text": "Case study 1: Brown Thomas"
    },
    {
      "level": "H3",
      "text": "Case study 2: iClothing"
    },
    {
      "level": "H3",
      "text": "Past purchases & repeat customers"
    },
    {
      "level": "H3",
      "text": "Case study 3: McElhinneys"
    },
    {
      "level": "H3",
      "text": "Other audiences"
    },
    {
      "level": "H2",
      "text": "4. How to create an audience"
    },
    {
      "level": "H2",
      "text": "5. Benefits of RLSAs"
    },
    {
      "level": "H3",
      "text": "Control budget"
    },
    {
      "level": "H3",
      "text": "Control ad message"
    },
    {
      "level": "H3",
      "text": "Control KPIs"
    },
    {
      "level": "H3",
      "text": "Control targeting"
    },
    {
      "level": "H2",
      "text": "6. The Day Adwords Changed Forever: Further developments with RLSAs"
    },
    {
      "level": "H3",
      "text": "Customer Match"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H3",
      "text": "Programmatic Delivery: The Future of Content Marketing and Promotion?"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Ciaran Murphy\n          \n            Ciaran Murphy"
}