{
  "url": "https://moz.com/blog/the-mobile-web-vital-for-social-networking-important-for-everyone-else",
  "slug": "the-mobile-web-vital-for-social-networking-important-for-everyone-else",
  "title": "The Mobile Web - Vital For Social Networking; Important For Everyone Else - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I've recently purchased my first BlackBerry phone, and I've thus been introduced to the joys of a truly mobile Internet. There is a big difference between composing all-lower-case, badly punctuated emails on one of these horrific pieces of rubbish and using a phone that was actually designed with…",
  "content": "The Mobile Web - Vital For Social Networking; Important For Everyone Else Mobile SEO By: Jane Copland June 18, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Jane Copland June 18, 2008 The Mobile Web - Vital For Social Networking; Important For Everyone Else Mobile SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I've recently purchased my first BlackBerry phone, and I've thus been introduced to the joys of a truly mobile Internet. There is a big difference between composing all-lower-case, badly punctuated emails on one of these horrific pieces of rubbish and using a phone that was actually designed with the Internet in mind. However, I've also had the displeasure of visiting sites that aren't designed with mobile phones in mind. I liken looking at a badly-formed mobile site as being in a very skinny corridor with a lot of very large people. No one can move very quickly and you can't see anything. Whilst nothing (save for perhaps the iPhone) currently compares to a real computer, there is of course a growing number of sites that do their best to give us full functionality at a mobile level. As was mentioned in the Mintel report I cited last week, mobile usability is the next battle ground for social media and, in particular, social networking. There shall be no prizes handed out for guessing which companies are doing mobile social networking best, although I have to dock points from Twitter because 99% of their mobile success is due to applications like TinyTwitter, Twitterberry, Twinkle, and a range of other things beginning with \"tw.\" Facebook pretty much turns into a made-for-mobile application when taken to a cellphone, managing to both stay loyal to its online self and exhibit total mobile functionality. Its mobile homepage is of course different, but it's tough to distinguish from its regular homepage when you're using a cellphone: Other major players in the social networking sphere do pretty decent job, but could do better: Bebo's mobile homepage bears no resemblance to its regular homepage and is barely functional. Off I went to MySpace to see how Tom deals with cell technololgy, both via the web at mobile.myspace.com and on my phone, and was met with this. You can't make this stuff up. A refresh brought up MySpace's mobile page, but I was unable to access the site on my phone due to the same error. Its mobile page was actually far better looking than a regular MySpace horror story. Of course, upon getting my phone, I sat around for quite a while and visited sites I frequent when I'm using a computer. There was probably a 50 / 50 split between sites that did well with mobile and those that took an excrutiatingly long time to load and were then unusable. For some sites, it's not so important to be available for mobile users, although leaving mobile to rot isn't a great idea for any site. I do feel that any site with social functions, which would include ours, needs to be accessible anywhere. It may seem ridiculous to you that someone would want to check SEOmoz comments from the bus, but when you see one of those comment tracker emails come in on a post in which you've been taking an interest, you want to read it! The majority of cellphones don't seem to live up to real computer accessibility yet and thus it's a mistake to neglect an \"m\" version and leave phones to their own devices when dealing with content. Consider this \"on the list\" for us, as we know a lot of you look at SEOmoz, especially the blog, on mobile phones. As an aside, I'm composing this post in Internet Explorer because, after downloading Firefox 3.0 this afternoon, all of my links turned into nightmares like this: javascript:void(0);/*1213760150698*/ Has anyone else had this problem and, if so, how do you fix it? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Mobile Web - Vital For Social Networking; Important For Everyone Else"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Mobile Web - Vital For Social Networking; Important For Everyone Else"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too"
    },
    {
      "level": "H3",
      "text": "Internal Linking for Mobile-First & Mobile-Only Indexing"
    },
    {
      "level": "H3",
      "text": "All About Fraggles (Fragment + Handle)"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Jane Copland\n          \n            Jane Copland"
}