{
  "url": "https://moz.com/blog/the-best-spam-submission-ever",
  "slug": "the-best-spam-submission-ever",
  "title": "The Best Spam Submission Ever - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "As you may know, one of my job duties here is to manage our user-generated blog. Every day I sift through the queue of blog entry submissions and publish posts about Internet marketing, business tactics, social media, web dev/design, etc. While I publish one or two worthy, relevant blog entries…",
  "content": "The Best Spam Submission Ever Moz News By: Rebecca Kelley January 27, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rebecca Kelley January 27, 2009 The Best Spam Submission Ever Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. As you may know, one of my job duties here is to manage our user-generated blog. Every day I sift through the queue of blog entry submissions and publish posts about Internet marketing, business tactics, social media, web dev/design, etc. While I publish one or two worthy, relevant blog entries each day, I delete several spam submissions. I've seen spam entries about buying World of Warcraft gold, pay day loans, auto loans, Halloween costumes, recycling batteries, hypnosis, GPS, song lyrics, eyeglasses, dogs, Asia travel, India tourism, car rentals, installing car DVDs, cosmetic surgery, t-shirt printing, civil engineering, UK vacation properties, fragrance products, food coloring, music festivals, fashion, and virtually everything in between. At this point not many spam entries surprise or amuse me--I pretty much delete them and continue through the queue. Until now. The other day I was going through the queue of submitted entries and came across a spam post that was so funny I decided to illustrate it. Below is that spam entry, in illustrated form. All of the copy at the top of each panel is actual verbatim copy from the blog submission (I only provided the drawings). I hope this entry brings you as much joy as it brought me. Enjoy. Actual title. I promise. Got any awesome spam stories? Email me (rebecca -at- seomoz.org) or follow me on Twitter (@rebeccakelley) and maybe I'll illustrate them. :) Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Best Spam Submission Ever"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Best Spam Submission Ever"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}