{
  "url": "https://moz.com/blog/the-blue-collar-seos",
  "slug": "the-blue-collar-seos",
  "title": "The Blue Collar SEOs - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Noteworthy this past weekend was Donna's post on the subject of Blue Collar SEO. It's a fantastic short article on the different types of SEO companies and individuals in the business and worthy of 5 minutes of everyone's ti...",
  "content": "The Blue Collar SEOs SEO Events By: Rand Fishkin May 23, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin May 23, 2005 The Blue Collar SEOs SEO Events The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Noteworthy this past weekend was Donna's post on the subject of Blue Collar SEO. It's a fantastic short article on the different types of SEO companies and individuals in the business and worthy of 5 minutes of everyone's time. At the current time, I too am mostly blue collar (with a white stripe or two when I have to present at SES conferences). The majority of my work is done in blue jeans and my days at the office don't start until my morning reading and posting has been completed (often sans pantalons). As I find myself starting down a road that will lead to a collar color change, I wonder if this is something that will make me happy over the long run... Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Blue Collar SEOs"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Blue Collar SEOs"
    },
    {
      "level": "H2",
      "text": "Snag your MozCon bundle"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H3",
      "text": "Diving Into the Future of Digital Marketing: The MozCon 2024 Day One Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}