{
  "url": "https://moz.com/blog/the-day-the-knowledge-graph-exploded",
  "slug": "the-day-the-knowledge-graph-exploded",
  "title": "The Day the Knowledge Graph Exploded (+50.4%) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "On July 19th, there was a major Google update that almost all of us missed. Overnight, the number of queries with Knowledge Graph entries jumped 50% to just over a quarter (26.7%) of the searches we track.",
  "content": "The Day the Knowledge Graph Exploded (+50.4%) Search Engines By: Dr. Peter J. Meyers August 21, 2013 Table of Contents Copied! By: Dr. Peter J. Meyers August 21, 2013 The Day the Knowledge Graph Exploded (+50.4%) Search Engines The morning of July 19th there was a major Google update, and no one is talking about it. Put simply: We missed it, because we just weren't looking for it. Overnight, the number of queries we track in the MozCast 10K beta system that show some kind of Knowledge Graph jumped from 17.8% to 26.7%, an increase of over 50%. This was not a test or a one-day fluke — here's a graph for all of July 2013 (as of August 20th, the number has remained stable near 27%): So, let's get to the meat of it — who were the big overnight winners? What did those \"new\" Knowledge Graph boxes look like, and were there any clear patterns? The overnight winners There were 908 queries that picked up Knowledge Graph (KG) entries on July 19th in our data, so the full list is a bit much for a blog post, but let's look at 20 high-volume queries (this data was actually pulled on August 16th, since some queries had lost KG boxes in the interim): garmin primark avianca ancestry suntrust toms royal caribbean cheap tickets oakley forex tractor supply discount tire ulta casio nectar famous footwear new balance david's bridal gander mountain philippine airlines At a glance, 16 of these seem to be known brands (I think we can count \"ancestry\" and \"cheap tickets\" as brand queries in 2013), with \"forex\", \"tractor supply\", \"discount tire\", and \"nectar\" not having obvious brand associations. We'll come back to \"forex\" (I discovered something interesting there), but Google is treating both \"tractor supply\" and \"discount tire\" as brand queries. The Knowledge Graph for \"tractor supply\" shows: A search for \"discount tire\" shows a smaller, expanding KG entry, below ads and a map (for my search, at least): The one clear outlier in this group was the search for \"nectar\", which pulled up two KG-style entries (we classify them pretty loosely, to throw a wide net): (1) an answer-box style entry (but in the right-hand column), and (2) a disambiguation box: Across the entire data set, \"brand\" queries seemed to fare well in this Knowledge Graph gold rush, although there were exceptions. Let's look at an interesting case — the search for \"forex\". The Forex oddity \"Forex\" is a highly competitive search term, and pretty notorious for being spammed. When I went to check the query, I wasn't seeing a Knowledge Graph entry, so I took a look at the history since mid-July. The #1 position has bounced back and forth between Wikipedia and Forex.com. Across 32 days of data (since July 19th), Wikipedia has ranked #1 (in our data set) 10 of those days. Every day Wikipedia has ranked #1, the SERP has shown a Knowledge Graph entry: On the 22 days where Forex.com ranked #1 (and Wikipedia ranked #2), a Knowledge Graph entry only appeared three times (13.6%). As you can see, the KG entry is informational, suggesting that Google is interpreting the query as an information-seeking search. While this is highly speculative, it's possible that the informational interpretation that drives this KG entry is also pushing Wikipedia into the #1 spot. When, for whatever reason, Google interprets the query more loosely or as a navigational query, then Forex.com ranks #1 and the KG entry often disappears. Again, this is just speculation, but it does demonstrate that — like rankings — KG entries are being interpreted and displayed in real-time and can fluctuate from search to search. The Wikipedia connection You can see even from these few examples that many of the new results are using data from Wikipedia. When Google launched Knowledge Graph in May of 2012, they stated that \"Google's Knowledge Graph isn't just rooted in public sources such as Freebase, Wikipedia and the CIA World Factbook.\" Of course, this implies that Freebase, Wikipedia, and the CIA Factbook are sources, and observations of KG data seem to support this. What's interesting about the new Knowledge Graph entries coming from Wikipedia is that they suggest that the data itself isn't new. It's unlikely that Wikipedia entries/data exploded overnight, so that leaves us with two theories: (1) Google imported more existing Wikipedia data, or (2) Google chose to let more queries display a Knowledge Graph entry and lowered some kind of algorithmic threshold. As large as Wikipedia is, it's unlikely that storage capacity is a major issue for Google, so I think that (2) is the more likely explanation — Google has simply loosened the restrictions on which queries can trigger the Knowledge Graph. The entity connection So, what's tipping these new Knowledge Graph entries? I try to avoid the word \"brand\" when talking about the algorithm, because it carries a lot of bias and we all seem to mean something a little different. I do think, however, that there is an entity connection that certainly looks brand-like. Here's another odd query that gained a KG entry on July 19th — \"chicken recipes\": For most of us, I think Lee's Famous Recipe Chicken is a bit of stretch for \"chicken recipes\", which is clearly an informational query. Even Google organic results clearly recognize the intent, with actual recipes for chicken dishes taking up the entire top 10. Here's another odd query that generated a suggestion for an entity — \"army games\": What's funny is that Google doesn't display a \"Showing results for…\" spelling correction or seem to think that I actually meant \"armor\" when I typed \"army\". They've just chosen to give a fairly unrelated entity a bit of extra credit. All of the top 10 rankings are based on \"army\" and there is no mention of Armor Games outside of the KG entry. The entity/brand connection is a nice theory, but then we have a query like \"vegetarian recipes\", which also picked up a KG entry on July 19th: Here, the Knowledge Graph entry is informational, and doesn't seem to have a brand/entity association. So, before we go off on the \"BIG BRANDS GET ALL THE BREAKS!\" warpath, I think we have to take a deep breath and try to get a handle on the facts. My gut feeling is that Google has bumped up the volume on the Knowledge Graph, letting KG entries appear more frequently. In many cases, this seems to have benefited brands, but keep two things in mind: (1) Many of these brands are small, and (2) That could be a side effect and not the primary intent. The simple fact is that brands are entities, and as Google builds a \"web of things,\" entities are going to gain ground and pages are likely going to lose ground. Update (August 21st) In the comments, Will Critchlow pointed out that Nectar is a well-known brand in the UK. When you search \"nectar\" on Google.co.uk, the entity/brand association is much clearer: So, essentially, 19 out of the 20 queries on that list were brand-related, with \"forex\" being ambiguous depending on the context. This also clearly shows the impact of localization and the complexity of how KG entries are being triggered. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Day the Knowledge Graph Exploded (+50.4%)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Day the Knowledge Graph Exploded (+50.4%)"
    },
    {
      "level": "H2",
      "text": "The overnight winners"
    },
    {
      "level": "H2",
      "text": "The Forex oddity"
    },
    {
      "level": "H2",
      "text": "The Wikipedia connection"
    },
    {
      "level": "H2",
      "text": "The entity connection"
    },
    {
      "level": "H2",
      "text": "Update (August 21st)"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}