{
  "url": "https://moz.com/blog/the-disconnect-in-ppc-vs-seo-spending",
  "slug": "the-disconnect-in-ppc-vs-seo-spending",
  "title": "The Disconnect in PPC vs. SEO Spending - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There's a big disconnect in the way marketing dollars are allocated to search engine focused campaigns. Let me highlight:\n\nNot surprisingly, search advertising should continue to be the largest category, growing from $9.1 billion in 2007 to $20.9 billion in 2013.\n- Source: ...",
  "content": "The Disconnect in PPC vs. SEO Spending Paid Search Marketing (PPC) By: Rand Fishkin October 21, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin October 21, 2008 The Disconnect in PPC vs. SEO Spending Paid Search Marketing (PPC) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. There's a big disconnect in the way marketing dollars are allocated to search engine focused campaigns. Let me highlight: Not surprisingly, search advertising should continue to be the largest category, growing from $9.1 billion in 2007 to $20.9 billion in 2013. - Source: C|Net News, June 30, 2008 OK. So companies in the US spent $10 billion last year on paid search ads, and even more this year. How about SEO? SEO: $1.3 billion (11%) - Source: SEMPO data via Massimo Burgio, SMX Madrid 2008 According to SEMPO's data, it's 11% for SEO and 87% for PPC (with another 1.4% for SEM technologies and <1% for paid Inclusion). Here's where I get confused: That looks to me like most of the eyeballs are on the organic listings - the ones you can only influence with organic SEO... Huh? Maybe we should get more data on this subject. Let's turn to Enquiro: Organic Ranking Visibility (shown in a percentage of participants looking at a listing in this location) Rank 1 – 100% Rank 2 – 100% Rank 3 – 100% Rank 4 – 85% Rank 5 – 60% Rank 6 – 50% Rank 7 – 50% Rank 8 – 30% Rank 9 – 30% Rank 10 – 20% Side sponsored ad visibility (shown in percentage of participants looking at an ad in this location) 1 – 50% 2 – 40% 3 – 30% 4 – 20% 5 – 10% 6 – 10% 7 – 10% 8 – 10% Fascinating. So visibility is considerably higher for the organic results. What about clicks? Thanks to Comscore, we can see that clicks on paid search results has gone down over time, and is now ~22%. Conclusions: SEO drives 75%+ of all search traffic, yet garners less than 15% of marketing budgets for SEM campaigns. PPC receives less than 25% of all search traffic, yet earns 80%+ of SEM campaign budgets. Questions: Why does paid search earn so many more marketing dollars? What can SEOs and the SEO industry do to help bring parity to this equation? Does a down economy mean SEO will be given greater opportunity to perform? I'll save my opinions for later, but would love to hear yours. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Disconnect in PPC vs. SEO Spending"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Disconnect in PPC vs. SEO Spending"
    },
    {
      "level": "H2",
      "text": "Organic Ranking Visibility"
    },
    {
      "level": "H2",
      "text": "Side sponsored ad visibility"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}