{
  "url": "https://moz.com/blog/the-exact-science-of-hindsight",
  "slug": "the-exact-science-of-hindsight",
  "title": "The Exact Science of Hindsight and How This Helps in SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Over the last few months I've found myself doing slightly less SEO, and in its place I've been thinking about how we can improve the SEO services we offer our clients. SEOs, I've found, tend to be quite a creative bunch, both in the type of work that gets done but also in the way that the work gets…",
  "content": "The Exact Science of Hindsight and How This Helps in SEO SEO Basics D By: Duncan Morris December 11, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! D By: Duncan Morris December 11, 2008 The Exact Science of Hindsight and How This Helps in SEO SEO Basics The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Over the last few months I've found myself doing slightly less SEO, and in its place I've been thinking about how we can improve the SEO services we offer our clients. SEOs, I've found, tend to be quite a creative bunch, both in the type of work that gets done but also in the way that the work gets done. One of the joys of being in SEO is that the tasks that need to be done and the best way of doing these tasks is permanently evolving. The creative urges mean that often when asked to do two similar tasks a week apart, the tasks are done in a completely different way. From a job satisfaction and creativity point of view, this is fantastic; starting from scratch each time on a task means the creative juices can really flow. From a management and consistency point of view, re-inventing the wheel each time is a nightmare! In business strategy discussions we often talk about wearing multiple hats to help differentiate between the various roles we have to play. In any given day I can metaphorically wear a number of different hats, ranging from my shareholder hat, to my management hat, to my SEO or developer's hat. With my management hat on (I picture a bowler hat) I've been trying to get a happy medium between allowing the creative juices to flow freely and being able to guarantee quality and consistency to our clients. It's early days for our more formal processes, and I dare say I'm pushing a bit far towards the consistency side of things, but I thought I'd share a few of my thoughts. Create a Products and Services List Our first step towards the management holy grail of consistent quality is to create a list of products and services that we offer. SEO is constantly changing (and salesmen have a habit of selling anything!) so this list is constantly evolving, but having the list makes our life so much easier in so many different areas. Sales Process In a small and growing company it is very tempting to do anything for anybody that asks for it. We all want to be able to deliver exactly what the clients want, but without careful specification and handover between the sales team and the operations team this can lead to poorly defined tasks. We have asked (management speak for \"told\") the sales team (in our case, Will!) that they are only allowed to sell things that are on our list. These are the things that we are confident we can really excel at. Every task we sell is taken from something from that list. This means that right from the outset everyone is singing from the same hymn sheet (I'm really getting into this management speak). It's worth mentioning that this hasn't led to us selling things that people don't really want or need. Almost every business and every website is different, so the last thing I'm suggesting is that you just apply a generic product or service to all of your clients' websites. Having said that, when it boils down to it, there are a fairly small subset of tasks that occur on almost every project. Keyword research, anyone? What about a technical site review? To reduce any lingering doubts, we also allow the sales team to list any specific areas of focus or differences from our standard product. Creating Processes We have spent time working out what we mean and how we go about delivering each and every task. This is the balancing act I was talking about earlier. If this process is too regimented, all the creativity we enjoy as SEOs is lost and you are just following a recipe. If this process doesn't exist at all, the management structure is lost. By creating the processes, we have something we can review and adapt over time. When our creativity finds a better way of doing something, we can add it into the process and from that point onwards it improves the product we offer to all our clients. To ensure that this list is used and is kept up to date, we constantly review it. We have a weekly meeting of the SEO team to discuss the various projects we are working on. Each week we review one of the processes and get feedback on ways we can improve it. There are always new SEO tools that can make a process better or faster. In theory, the days of people shouting across the office, \"Does anyone remember the name of that tool that lets me ...\" should be gone, since whenever we find a new tool is gets added to the process. By constantly reviewing the processes and keeping everyone up to date with the latest tools, tactics and techniques, we are always incrementally improving the service that we offer our clients. Reviewing Completed Projects Someone called Guy Bellamy once said: Hindsight is an exact science. [source] As part of our project management process we run regular meetings to discuss all the projects that we have completed. We only run these meetings when we have enough completed projects so that there is enough to talk about. The first time we ran such a meeting I was shocked as to how much we learnt. Looking back at a project a couple of months after the work has been completed gives you the ability to see what worked and what didn't. SEO is often about trying something, measuring its effect, refining the process and trying something else. Spending the time to look back over a number of projects allows you to spot trends that you might otherwise miss. Do projects where you start link building before you fix any technical issues work better than those where the order is reversed? Knowing the answer to these sorts of questions feeds back in to the process documents and will make you better as a consequence. If you only take one thing from this post, I urge you to take a couple of hours out of your day and sit down with your SEO team. Look over all the projects that you have completed in the last few months and dissect and discuss. I guarantee you will learn something interesting. What you do with your new knowledge is obviously entirely up to you. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Exact Science of Hindsight and How This Helps in SEO"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Exact Science of Hindsight and How This Helps in SEO"
    },
    {
      "level": "H2",
      "text": "Create a Products and Services List"
    },
    {
      "level": "H3",
      "text": "Sales Process"
    },
    {
      "level": "H3",
      "text": "Creating Processes"
    },
    {
      "level": "H2",
      "text": "Reviewing Completed Projects"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H3",
      "text": "An Introduction to Google Tag Manager"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Duncan Morris\n          \n            Duncan Morris"
}