{
  "url": "https://moz.com/blog/the-spread-of-seo-knowledge",
  "slug": "the-spread-of-seo-knowledge",
  "title": "The Secret \"10%\" of SEO Knowledge and How Information Spreads in the Search World - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "A conversation last week got me thinking about how knowledge spreads in the world of SEO. I noted on a panel that 90% of all SEO knowledge is \"out there,\" floating on the web, mentioned in presentations, and generally findable by anyone who knows enough to ask the right questions or perform the…",
  "content": "The Secret \"10%\" of SEO Knowledge and How Information Spreads in the Search World Public Relations By: Rand Fishkin December 11, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin December 11, 2007 The Secret \"10%\" of SEO Knowledge and How Information Spreads in the Search World Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. A conversation last week got me thinking about how knowledge spreads in the world of SEO. I noted on a panel that 90% of all SEO knowledge is \"out there,\" floating on the web, mentioned in presentations, and generally findable by anyone who knows enough to ask the right questions or perform the right searches. The other 10% is behind the curtain - it's hidden knowledge that rarely ever rears its head. Things in the 10% might include: The names and emails of private link brokers and link sellers whose networks are still passing value IP lists of the search engines' cloak-detection bots and methods of identifying potential human quality raters Ways around penalties, bans, or other search issues Email access to the right people at search engines, blogs, social media sites, & large web properties Access to email or online lists of effective social media voting groups Methods for scalably grabbing large amounts of competitive intelligence data from the engines or other sources Data on traffic, referrals, and other competitive intelligence information for big brands, sites, and verticals CTRs, CPCs, CPMs, ad payouts, & conversion rates for specific keywords and phrases Lots and lots of other super secret stuff The 10% number is not a stable one. I'd venture to guess that 10 years ago, it was much larger (which is to say that a far greater amount of knowledge is available today than was back then). Since I've only been in the industry formally since about 2001-2 (when I started working on search marketing and reading industry forums), I can't say for certain what amount of information was available in 1997, but I did make this nifty graphic to give my rough percentages for the amount of material available while I've been active: Most SEOs probably pick up their knowledge from a few limited sources - competitive webmastering is, after all, still in its infancy, so you've only got a small selection. Blogs, sites, & forums (both private and public) on the web serve as a solid data repository (SEOmoz would be among these), but to grasp SEO, I think you really need some serious experience on a site - either your own or your employer's (or a consulting client's, though hopefully that wouldn't be your first try at the subject). I've put together the following chart illustrating some of these and my personal path. I'm actually even more interested to hear where you get your knowledge, so I created a quick poll: web surveys - Take Our Poll Every SEO is going to be different, naturally, but from experience I'd say that nearly everyone goes through some period of working on a single site, at least during the beginning of their career. Obviously, some small percentage of us become active in the participatory web of the SEO world - writing articles, running blogs, speaking on panels, training other SEOs, etc. In working to get VC funding for SEOmoz, we estimated that there were around 60-70,000 individuals worldwide who call themselves \"SEOs,\" and another 250,000 or so who have SEO as a large part of their job responsibility. Since there's something close to 4-6,000 active SEOs in the social, online sphere (voting on things at Sphinn, writing blogs, commenting at blogs, etc), we could estimate that around 2-3% of SEOs publicly share their knowledge. Once again, I wanted to try to illustrate how SEOs who dive into the practice of contributing and sharing distribute their knowledge, and how much of that actually gets \"out there.\" Here's what I came up with: I'm generalizing, but my concept is that at the outset of your SEO career, you might share some information - your successes and failures, but not a whole lot of advice since you haven't been down the path before. However, as you ramp up your knowledge, you'll start to share a considerable amount more about what you're learning, what works, and how to apply it. Once you reach the \"advanced\" stage, however, you're often learning a lot more of the \"10%\" than anything else, particularly if you take on consulting work and get a lot of competitive intelligence and exposure to issues under NDA. If and when you finally reach the Greg Boser status of \"Dark Lord,\" you might still be sharing quite a bit, but you've probably already shared a lot of what you're going to give out, and the increase in knowledge and experience has given you responsibilities and tasks that eat up the time you used to spend \"sharing.\" Of course, there are individuals who fit these rules nicely (someone like Dan Thies or Dave Naylor) and those that are outliers, like Aaron Wall (who's certainly in the \"Dark Lord\" category but still shares far more than 50%). Hopefully, this excercise in guestimation and colorful chart-building has been as fun and interesting to you as it is to me. Naturally, I'd love to hear your feedback about the general topic of SEO knowledge spreading and, more specifically, your own experiences with learning and sharing. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Secret \"10%\" of SEO Knowledge and How Information Spreads in the Search World"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Secret \"10%\" of SEO Knowledge and How Information Spreads in the Search World"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}