{
  "url": "https://moz.com/blog/the-job-landscape-in-search-design-and-social-media",
  "slug": "the-job-landscape-in-search-design-and-social-media",
  "title": "The Job Landscape in Search, Design and Social Media - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In late October Forum One Networks put out a white paper titled \"Online Community and Social Media Compensation.\" I applaud their efforts, but, I think they create an unrealistic view of the job space in online media.  One, I think the surveyed companies over-represent corporate ...",
  "content": "The Job Landscape in Search, Design and Social Media Public Relations C By: Carlos del Rio December 4, 2009 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! C By: Carlos del Rio December 4, 2009 The Job Landscape in Search, Design and Social Media Public Relations The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. In late October Forum One Networks put out a white paper titled \"Online Community and Social Media Compensation.\" I applaud their efforts, but, I think they create an unrealistic view of the job space in online media. One, I think the surveyed companies over-represent corporate jobs. Answers Corp., Autodesk, Avid, Best Buy, Cartoon Network (Turner), Consumer Reports, Electronic Arts, hi5, IBM, KaBOOM!, Nokia, Quest Software, Sage Software, Seesmic, Sony Online Entertainment, The Knot, and Yahoo! Their average respondent is in a department of 9-people and have at least one sub-ordinate. I suspect the truth of the job landscape is that there are far more web jobs (social media, web design/development, SEO, PPC and web analytics) in small business than in large corporations. Two, they fail to address critical issues like education, work experience and job duties. Forum One claims that in social media the average woman makes $75,624 and the average man makes $86,644. I feel simply looking at the averages is too shallow to make a good argument about compensation. So, I am doing something about it. I think the SEOmoz community has a wide range of people and will contribute a broader, and more realistic, perspective on what jobs on the web really look like. I put together an 18-question anonymous survey (it will take less than 5 minutes to complete) to create a better look at salary and compensation on the web. Once I collect the data we will make all of the findings transparent, free to download and creative-commons so you can use the data freely. Help the community by creating better data resources. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Job Landscape in Search, Design and Social Media"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Job Landscape in Search, Design and Social Media"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Why Building Links with Digital PR Is Hard — And That’s OK!"
    },
    {
      "level": "H3",
      "text": "Breaking News: ‘PR Critical to SEO Success’ Is Not Breaking News"
    },
    {
      "level": "H3",
      "text": "Driving Sales with Digital PR: What E-commerce Brands Need to Know"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Carlos del Rio\n          \n            Carlos del Rio\n          \n            Carlos del Rio"
}