{
  "url": "https://moz.com/blog/the-art-of-buying-links-under-the-radar",
  "slug": "the-art-of-buying-links-under-the-radar",
  "title": "The Art of Buying Links Under the Radar - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "I've been a fan of David Wallace for a while, but his rant on things that bug him about link sellers was one of my favorites. It also made me realize that I needed to write a solid post about link purchasing directly from websites under the radar of the engines. To some, this type of advice would…",
  "content": "The Art of Buying Links Under the Radar Link Building By: Rand Fishkin August 16, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin August 16, 2007 The Art of Buying Links Under the Radar Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. I've been a fan of David Wallace for a while, but his rant on things that bug him about link sellers was one of my favorites. It also made me realize that I needed to write a solid post about link purchasing directly from websites under the radar of the engines. To some, this type of advice would put me squarely in the black hat camp, but I think that buying relevant advertisements from good quality sites who are certainly going to take into account who they're linking to is a legitimate way of marketing your site. If you can add to the ROI of the ad by not adding a \"nofollow,\" it seems hard to justify adding that condition to the sale. I'm also of the opinion that, when done right, these one-to-one link purchases are nearly impossible to detect, as compared to large link purchases through brokers or networks, which can be compromised by smart engineers. After all, if you worked at the engines, wouldn't you type in text link ads, create a fake identity, and try to get a look at all of the link sellers' networks? Here's the general process I like to follow, using the specific example of Eden Valley Orchards (who I don't think has any SEO efforts, but I loved their grounds and am considering it as a wedding location, so it's fresh on my mind). STEP 1: Keyword Discovery Eden Valley needs to figure out which keywords are going to send them the most qualified, valuable web traffic. In reality, they should probably buy some ads on Google AdWords, Yahoo! & Live, and test the conversion rate (through their contact page or a visit us link or their email newsletter, along with their wine club membership). However, I don't have access to that data, so let's just assume that the term \"ashland winery\" is particularly valuable. They'd probably want to find a good 2-3 dozen terms and phrases, but for brevity's sake, we'll just look at this one. STEP 2: Finding Relevant Sites As I've noted in the past, it's my belief that some of the most valuable links, from both a traffic and relevancy standpoint, come from the pages that rank highest for the target term. Thus, acquiring links from the pages here, here, here and here are probably very good bets. I also like using the Juicy Link Finder tool, which is perfect for this kind of task. There's a ton of different ways to find good sites to provide value, but for now we'll move on - maybe a more detailed post on link opportunity discovery will be valuable in the near future. STEP 3: Sending Initial Advertising Requests The first request typically will be sent either over email or through a contact form. The phrasing and style of what you send is extremely important and will determine how likely you are to get a response and the receptiveness of the person to the email. Many times, you'll find a page on sponsorship/advertising/etc like this one. In these cases, it's easy to get started and the site is clearly receptive to a paid link advertisement. At other times, though, it's a bit more difficult. For example, this page - winenet.com - ranks very well at most of the engines and would be a great spot to get traffic and link value. Technically, though, they're a competitor, so buying an ad might be very tough. Here's what I might write: Greetings from your friends 15 minutes up the road in Medford (over at the Eden Valley Winery), My name is Rand Fishkin and I actually work in the web marketing department over at Eden Valley (OK, so technically I'm also the web designer and the guy who has to clean the glasses after tastings, but that's beside the point). I wanted to get in touch to see if we could possibly do some cross-promotion over the web. I'm hoping that you've got some time to schedule to chat on the phone this week about your website and possibly getting an advertising link of some kind. Let me know if this is something that can work for you - we'd love to reciprocate by sending some of our site visitors your way as well. You can reach me anytime over email or at 215-649-XXXX. Best, Rand That's certainly not guaranteed to work, but it establishes a relationship and it's straightforward. My guess is that since they're a direct competitor, I've got only a 1/4 chance of getting that phone call, but if I pursue this strategy with enough sites, I'm sure to get some places to sell me that ad link. STEP 4: Follow Ups As important as the first contact is following up. I recommend being as prompt as possible - you want to make them see that they are incredibly important to you. Treat your contacts with respect, and you're more likely to earn respect yourself. In the follow up, you'll need to establish details, including what page you'd like the link on, what format you want them to use (I particularly like to have a small image with a logo or picture and a short anchor text block beneath it), and request that they send over pricing. STEP 5: Pricing Considerations Pricing is a big deal - you'll only have a certain budget and you can't afford to spend $5,000 for every link that comes along. For link valuation, I'd suggest checking out my post - How do you measure a link. From there, you'll need to determine a starting point and a maximum - you don't want to go into the negotiations without these prepared. I like to first ask the party selling the link to give you a price they find acceptable - I find that 75% of the time or more, they come back with a price far lower than you were expecting (simply because folks don't realize how valuable links are). Here's how I figure it - if you can break even based on the traffic the link will send, you should absolutely buy it. If you're not quite there, but you're at least getting 2/3-3/4 of the link price from the traffic, I usually opt to go for it as well (as the link value for the search engines will end up sending enough other traffic). On trick here - always offer to pay a discounted rate for a 1 or 2 year stint if you can afford it. Many times, site owners would come back to me and say \"I'll give it to you for $100/month\" and if I offered $500 for one year, they'd often accept (or at least come back with $7-800 for the yearly price). The psychology is easy to understand - the link costs them nothing, so the thought of getting $500 straightaway is very enticing. STEP 6: Checking Value Figuring out whether you've gotten a good deal is tough, but the best metrics to use are traffic referrals and rankings. Check your backlinks at Yahoo! - more recent and more important sources tend to appear higher (though even those in the 2-300 range for highly linked-to sites are often very valuable). Also, run searches containing the anchor text and excluding your site - if the page you bought a link from is highly ranked, chances are it's sending you some pretty good quality link love. Obviously, during a campaign of link acquisition, you'll want most of all to see your rankings rise. If they don't you might be doing something wrong (or Google's got a dampening penalty on you). STEP 7: Evaluate & Repeat It takes at least a few dozen link purchases like this before you can see serious progress. In the manual link building campaigns that I ran, I noticed that the delay in the links \"earning\" full value could be up to 3 months. It was also critical to add many numbers of links before you'd see progress, and then it would often come all at once (moving up 5 or 10 positions). Be prepared for uneven movement - some links are more and less valuable than you think, so it's just a matter of hitting that sweet spot. In my experience, you'll need a combination of trusted links, links with proper anchor text and links with high PageRank/Juice (not necessarily according to the toolbar, though it can be one indicator). I can't say for certain, but it's my strong feeling that link acquisition in this manner, even if many of them do involve money changing hands, is nearly impossible for Google and other engines to detect. I also believe that there's no real reason they wouldn't want to count these links. The sites you're buying from are trusted sources and they're not going to link out to junk. In my view, it's very much like buying a link from the Yahoo! directory - you're paying, they're reviewing critically and listing you only if they like you and want to send their visitors to you. I'd love to hear your thoughts on how you make effective use of direct advertising link purchases. UPDATE: 2 years after the publication of this post, I wrote our updated stance on link buying and paid links. While we're keeping this article in its current form for posterity, I highly recommend you read the above post and consider risks far more strongly than I first urged here. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Art of Buying Links Under the Radar"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Art of Buying Links Under the Radar"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}