{
  "url": "https://moz.com/blog/the-guide-to-creating-a-great-kickstarter-video",
  "slug": "the-guide-to-creating-a-great-kickstarter-video",
  "title": "The Guide to Creating a Great Kickstarter Video - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "If you’re planning to crowdfund a project (through Kickstarter, for example), few things will give you a leg up like creating a solid video to explain and pitch your idea.",
  "content": "The Guide to Creating a Great Kickstarter Video Video By: Fergus Dyer-Smith June 19, 2014 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Fergus Dyer-Smith June 19, 2014 The Guide to Creating a Great Kickstarter Video Video This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. If you’re planning to crowdfund a project (through Kickstarter, for example), few things will give you a leg up like creating a solid video to explain and pitch your idea. According to Kickstarter, projects with videos succeed at a much higher rate than those without (50% vs. 30%). Videos work for a lot of reasons, not the least of which is the fact that video gives you the opportunity to be personable in a way text simply will not allow. Depending on the nature of your project, this means you can use video to showcase whatever potential backers will value—your professionalism, your creativity, your communication skills or even your sense of humor. This guide will provide you with a quick but thorough checklist for creating crowdfunding videos that work. THE STORYLINE Before you shoot your video, you’re going to need a script. (An off-the-cuff video may sound like a fresh, fun idea, but it will almost certainly look like what it is: an exercise in non-preparation.) But wait! Before you fire up your word processor of choice, you have some homework to do. Research First Steve Young, the Director of Product Marketing at SmartShoot, advises, “Before even thinking about writing a script, storyboarding your video, or finding a filmmaker, make sure you watch as many Kickstarter videos as you can.” You’re looking for what makes a video memorable and engaging. Is there a video that causes you to forget you’re actually doing research and piques your interest to the point that you’re excited about someone else’s project? Study that video! Decide what drew you in and consider how you can use the same strategy in your own video production. Here are a few examples of successful, engaging crowdfunding videos: Try and think about your product from the other side. I recently spoke to Phil Baker, the investment Analyst from CrowdCube about the types of videos that are successful on their platform Have a Script This is Video Making 101. Before you can shoot a video, you need a script. Again, Young has some wisdom to share: “You want to spend the bulk of your time perfecting the script writing process. Act out the different scenes and get as much feedback [as you can] from your friends and family.” Make sure your script includes all the most important aspects of your crowdfunded project, including how the project came to be, why the project is important, why the project will be successful, and what rewards will be offered to those who contribute. Shorter is Better As you develop your script and plan the video production phase, keep in mind that shorter videos have a much higher chance of retaining the viewer’s attention. According to Kendall Almerico of Entrepreneur.com, “The video should be short, exciting and get the viewer fired up and wanting to read more about what you are offering. Ideally, the video should be three minutes long or less.” Get to the Point On the subject of brevity, don’t spend the first 30 seconds of your video beating around the bush. “The first 10 seconds are crucial!” cites Tatayana Fundrazr.com. If you can hook a viewer in those first 10 seconds, they are far more likely to watch the whole video, making them far more likely to contribute to your project. PRODUCTION While you can recruit the help of a professional video production team, there’s a good chance you’re interested in crowdfunding specifically because your project is on a tight budget. You may not have the funds to go pro, but that’s okay. Effective videos can be made, even by a complete amateur. Got a Smart Phone? You’ve Got a Camera. The camera app on your smart phone, while not the most sophisticated piece of video equipment on the planet, is capable of this job, provided you take the time to make sure you’re prepare. For example, you will find a basic tripod invaluable in creating smooth, steady shots. Additionally, “...there are a number of resources online to teach you basic shooting skills, ‘ Vimeo Video School’ is a great place to start. Even if you can’t shoot a video, you can create a slideshow using images that integrates music and voice over narration, check out ‘Animoto’ to get started,” (from ‘How To Create an Effective Crowdfunding Video’). Lighting and Sound Two of the most important elements of good, clean video production are lighting and sound. Be sure you shoot your video in a well-lit environment, whether outside, using natural lighting, or inside, using additional lights, spotlights and even desk lamps to ensure that you aren’t robed in shadows. You may also find it helpful to use a small, clip-on microphone to ensure all speech is easy to hear. Speak loudly, clearly, and slowly. Also, try to tap into your excitement about the project. Your passion can be contagious. Location, Location, Location The location you choose for your video makes an impact. For some projects, you may actually want to shoot the video in your garage. However, if your product is more refined, a cleaner, more professional environment will likely work better. Give thought to where you shoot, mindful that the viewer will take in not only you and your voice, but your background, as well. The Art of Editing “As an editor, your aim should be to create a seamless experience that will immediately engage your viewers and keep them watching until the very end. There are many low-cost editing programs, like iMovie or Windows Movie Maker, which you can use to craft your video,” advises Kapkan. While video editing programs, like those listed above, allow you to add special effects and transitions, avoid the temptation to include these. Nothing screams “amateur movie maker” like a video chalked full of tired, old effects. Instead, edit with simple, straight cuts. Also, it’s a good idea to add background music to your video—something that matches the theme, tempo and mood of your shoot. However, a word of caution here: be mindful of copyright laws. Do not, repeat, do not, use any medium (music, video, or even graphic logos) without the express, written permission of the copyright holder. ADDITIONAL TIPS & TRICKS Finally, two pieces of advice worth highlighting all on their own. These two things alone are crucial, so make sure your video includes these elements. Be Yourself “Both a blessing and a curse (and the nature of crowdfunding), Kickstarter campaigns are often successful due to the emotional connection potential backers have with the project creators,” writes Kerrin Sheldon from Fast Company. Your goal should be a video that embodies you—your personality, passion and project. A video without these personal touches doesn’t give the viewer any emotional hook. Given that so many crowdfunded projects are successful because people invest in them emotionally, this is vital. Ask for a Donation It sounds obvious, but many people feel shy about asking for a hand out. However, the goal of any crowdfunded project is to raise money. If you don’t ask for a donation in your video, you’re missing a huge opportunity. “This needs to be the very last thing in the video, and it needs to be clear, and worded to focus on what they'll be getting, not what you want,” (from ‘How Successful Kickstarter Campaign Videos Are Made’). Additionally, there are a lot of other guides out there online for creating successful crowdfunding videos. We’ve hit the highlights here, giving you enough information to successfully create your own video. However, if you still feel shaky, we encourage you to seek out other resources and research until you feel well prepared. Sources: 1) Kickstarter Getting Started, kickstarter.com 2) ‘ How to Make a Kickass Kickstarter Video’, fastcompany.com 3) ‘ How to Make a Kickstarter Video That Raises Over $150,000’, smartchot.com 4) ‘ 6 Tips to Create a Top-Notch Crowdfunding Video’, entrepreneur.com 5) ‘ How To Create an Effective Crowdfunding Video’, fundrazr.com 6) ‘How Successful Kickstarter Campaign Videos Are Made’, crowdfundingdojo.com 7) ‘5 Must Read Tips for Your First Kickstarter Video’, videobrewery.com 8) Opening image from the Kickstarter project Ancient Terrible Things Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Guide to Creating a Great Kickstarter Video"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Guide to Creating a Great Kickstarter Video"
    },
    {
      "level": "H2",
      "text": "THE STORYLINE"
    },
    {
      "level": "H3",
      "text": "Research First"
    },
    {
      "level": "H3",
      "text": "Have a Script"
    },
    {
      "level": "H3",
      "text": "Shorter is Better"
    },
    {
      "level": "H3",
      "text": "Get to the Point"
    },
    {
      "level": "H2",
      "text": "PRODUCTION"
    },
    {
      "level": "H3",
      "text": "Got a Smart Phone? You’ve Got a Camera."
    },
    {
      "level": "H3",
      "text": "Lighting and Sound"
    },
    {
      "level": "H3",
      "text": "Location, Location, Location"
    },
    {
      "level": "H3",
      "text": "The Art of Editing"
    },
    {
      "level": "H2",
      "text": "ADDITIONAL TIPS & TRICKS"
    },
    {
      "level": "H3",
      "text": "Be Yourself"
    },
    {
      "level": "H3",
      "text": "Ask for a Donation"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Best SEO and Digital Marketing Podcasts in 2024"
    },
    {
      "level": "H3",
      "text": "How to Create the Most Basic Google Business Profile Video with Canva, Even If You’re Not Great At This Stuff!"
    },
    {
      "level": "H3",
      "text": "On-page Video SEO – Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Fergus Dyer-Smith\n          \n            Fergus Dyer-Smith\n          \n            Fergus Dyer-Smith"
}