{
  "url": "https://moz.com/blog/the-balance-between-form-function",
  "slug": "the-balance-between-form-function",
  "title": "The Balance between Form & Function - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Purskincare, a cosmetics company based in the UK, has been asking for some advice on Cre8asite forums. The website itself is quite a looker - clearly designed by s...",
  "content": "The Balance between Form & Function Moz News By: Rand Fishkin April 7, 2005 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Rand Fishkin April 7, 2005 The Balance between Form & Function Moz News The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Purskincare, a cosmetics company based in the UK, has been asking for some advice on Cre8asite forums. The website itself is quite a looker - clearly designed by someone who knows their audience well and has an eye for web design. However, they've forgotten the principles of usability and SEO which demand on-page text, clear text links and navigation, and incoming links.I'm using Pur as an example of the pendulum swinging to far away from the technical side of web development, but there are thousands of examples of just the opposite - designers and developers who put no time, effort or care into the design and fluidity of their GUI and thus, lose the elements of enjoyment and branding that are carried to customers via design. It's always important to strike a balance between the functionality of a site (for both visitors and search engines) and the emotional and psychological forces that drive customers through design. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Balance between Form & Function"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Balance between Form & Function"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Transform Your Marketing Game and Boost Your Income With the New Moz Affiliate Program"
    },
    {
      "level": "H3",
      "text": "The MozCon 2024 Video Bundle Has Arrived! (Bonus: Our 2023 Videos are FREE!)"
    },
    {
      "level": "H3",
      "text": "That's a Wrap: The MozCon 2024 Day Two Recap"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin"
}