{
  "url": "https://moz.com/blog/the-road-to-supplemental-hell-is-paved-with-good-intentions",
  "slug": "the-road-to-supplemental-hell-is-paved-with-good-intentions",
  "title": "The Road to Supplemental Hell is Paved with Good Intentions - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Recently, Rand did a Whiteboard Friday on the topic of Supplemental Pages. He took a more moderate view than a recent Forbes article on the same topic. During the discussion of ...",
  "content": "The Road to Supplemental Hell is Paved with Good Intentions Search Engines L By: Lori Bourne May 8, 2007 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! L By: Lori Bourne May 8, 2007 The Road to Supplemental Hell is Paved with Good Intentions Search Engines This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Recently, Rand did a Whiteboard Friday on the topic of Supplemental Pages. He took a more moderate view than a recent Forbes article on the same topic. During the discussion of this video, I mentioned that my webstore, Montessori for Everyone, has quite a few pages in Google’s supplemental index. Just as Rand said in the video, they are pages that have little to no “link juice”; otherwise, there’s nothing spammy or suspect about them. As of the beginning of May, Google has indexed my entire webstore. Out of 273 pages, 40 of those are in the regular index and the rest are in supplemental. The ones in the regular index are as follows: Home page (naturally) Main store pages (all linked to from my home page) Category pages (all linked to from my home page) A few (like, 5) item pages (none of them have home page links, only category page links) I do know that all of my items have unique page titles, meta keywords, and meta descriptions, so that’s not the reason for the supplemental pages. Someone suggested that my xml sitemap needs to be updated, but I checked it and it’s up-to-date (and includes all my items). Then Great Scott! mentioned changing my store layout. The default store set-up is to have thumbnail image links to each individual item. Rather than having image links, he suggested that I make the item titles the links to individual items. He said that the Mozzers have been debating which kind of links are better: alt-tagged images, or text links with good anchor text. I thought this might be a big task, but after fiddling around with my store templates (having full access to them is one of the things I love most about my store host, 3dCart) I was able to make the switch pretty easily. I am a tad worried about the effect on conversions; people might be used to clicking on thumbnail images rather than a text link. But the fact that the item titles are now links is pretty obvious, so I don't think it will be a big deal. There were a few other things that occurred to me to get more link love to my item pages. For instance, I have some Squidoo lenses that I could use to put links to some of my supplemental pages. I could also link internally from regular-indexed pages to some supplemental pages. But I thought I would wait before making those changes, so that this would be the only change. I started to wonder if my webstore was set up incorrectly. I decided to surf around to other webstores selling items similar to mine. The results were decidedly interesting. The first site, Montessori123, (run by my friend Janelle) has both text and picture links to each individual item. Her site was custom-made by PixClinic. It’s a much larger site than mine (Google shows about 2,690 pages indexed), but she still only has about 15 pages in the regular index and all the rest in supplemental. The other site, Alison’s Montessori, (run by my friends Michelle and Khurram), is also much larger than mine. It’s hosted by Volusion, and Google shows about 1,650 pages have been indexed; about 37 pages are in the regular index and all the rest in supplemental. Okay, I’m feeling a little better about my site. I guess I’m about par with other, similar websites. Could it be that Google treats webstores differently than regular websites? Does the structure of webstores affect the spidering and indexing of store pages? Are all of our stores set up incorrectly? I truly don’t have answers to these questions. It will probably take a little while for Google to re-spider my site completely; I plan on posting back with any changes. If anyone has any experience with webstores and SEO, please share! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Road to Supplemental Hell is Paved with Good Intentions"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Road to Supplemental Hell is Paved with Good Intentions"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "The Helpful Content Update Was Not What You Think"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Lori Bourne\n          \n            Lori Bourne"
}