{
  "url": "https://moz.com/blog/the-big-list-of-ppc-resources-articles",
  "slug": "the-big-list-of-ppc-resources-articles",
  "title": "The Big List of PPC Resources and Articles - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "This post needs very little introduction. I’ve scoured the web, my bookmarks and Twitter (thanks guys!) for all the very best articles about PPC that I can find. I’ve broken the links down into several categories to make it easier to read. Enjoy!",
  "content": "The Big List of PPC Resources and Articles Paid Search Marketing (PPC) T By: Tom Critchlow December 19, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! T By: Tom Critchlow December 19, 2008 The Big List of PPC Resources and Articles Paid Search Marketing (PPC) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. This post needs very little introduction. I’ve scoured the web, my bookmarks and Twitter (thanks guys!) for all the very best articles about PPC that I can find. I’ve broken the links down into several categories to make it easier to read. Enjoy! Campaign Management The following are articles on how to improve your campaign, tips, tricks and campaign advice. Best of class: starting a PPC campaign from scratch by Rimm Kaufman The rest: Google lady with 51 Adwords tips Digerati marketing with 3 tips to improve CTR Redfly marketing helps take the guesswork out of PPC campaign set up Redfly marketing gives 10 tips to increase your quality score PPC Hero on following Yahoo’s PPC advice Sitepronews on how to turn around an unprofitable PPC campaign SEOmoz chips in with 17 common PPC mistakes Netbusiness blog looks at 8 Adwords mistakes SEOmoz with a Whiteboard Friday on PPC management PPC Hero with 6 settings to double check before setting a new account live Sitepoint with some of the worst Adwords mistakes Searchengineguide with 5 common PPC mistakes Me! Talking about PPC! ON VIDEO! no way. Tools Here are a few handy PPC tools to streamline your processes. Best of class: Search Light Digital's PAM-VAR Tool. It's neat and handy and lets you efficiently run your tests. The rest: Google’s ad preview tool. Allows you to check your ads are running and how they look. Google’s traffic estimator. Does what it says on the tin. Self hosted PPC tracking software. Not used it myself but recommended. Vertster. Have a neat little statistical significance test. Landing Page Advice Of course, PPC management is only one part of the process. You need to make sure that you’re sending the traffic to a page which is working hard for you. How do you go about testing that? What should you improve on your landing page? All below, my avid reader! Best of class: Copyblogger does a comprehensive roundup of their own stuff on landing pages. Essential reading. The rest: SEOmoz talks landing pages ROI Revolution shares 3 landing page tips SEL shares some practical landing page tricks SEO Design Solutions writes on landing pages which appeal to motivated searchers (like PPC traffic) Anywired discusses 13 sure signs that your landing page is a turn off Postclickmarketing looks at how you scale your landing pages SEM Geek looks at optimising paid search and landing pages for TV, radio and print advertising. Compelling reading. 9 myths of landing page quality score Headline Tips From The Dali Lama See what I did there? Headlines are important. They need to grab your attention, and never more so than in PPC. Best of class: Google Lady shares some really in depth things to try with headlines for PPC along with detailed examples The rest: Lyndon from Cornwallseo shares some headline writing tips. More for linkbait than PPC, but good reading. Copy Blogger looks at how to write compelling headlines Copy Blogger again. More good stuff. Freelanceswitch on how to write headlines that kill Google conversion university tips on headlines. Basic but it’s good to go over this stuff. Maths When you’re running PPC campaigns, maths comes in handy. There’s actually surprisingly little written about this, I was expecting to find more. Please chip in with your own links in the comments. No best of class since there’s only 2 links! Distilled: PPC lessons from Kenny Rogers (advanced maths) Searchlaboratory (who work just across the road from where I used to live!) share some PPC stats secrets Analytics Tracking, tracking, tracking. If you can't measure it then what good is it? Best of class: hack Google Analytics to show actual search queries for broad match AND find the referring domain (useful for SEO too) The rest: Use Google Analytics to get proper ad scheduling data Other Here are all the other articles I didn’t think really fit into any other categories. Some general stuff, stats, rapping, etc. All worth checking out. Searchenginewatch discuss playing dirty with PPC Google’s own tutorial. Dull in places but worth checking on the basics. Bigmouthmedia on affiliate PPC spending by region (of the UK). Interesting. A PPC rap. No, really! If you haven’t seen this then check it out! Ewhisper with how to lower your minimum bid (aka quality score) PPCblog write on understanding when to bid on your own brand 10 travel PPC tips 13 myths of PPC The darker side of affiliate PPC Are you running ads on Google partner network? If so, read this! Combining search and display advertising for greater gain More than you could ever want to know about quality score Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Big List of PPC Resources and Articles"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Big List of PPC Resources and Articles"
    },
    {
      "level": "H2",
      "text": "Campaign Management"
    },
    {
      "level": "H2",
      "text": "Tools"
    },
    {
      "level": "H2",
      "text": "Landing Page Advice"
    },
    {
      "level": "H2",
      "text": "Headline Tips From The Dali Lama"
    },
    {
      "level": "H2",
      "text": "Maths"
    },
    {
      "level": "H2",
      "text": "Analytics"
    },
    {
      "level": "H2",
      "text": "Other"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Tom Critchlow\n          \n            Tom Critchlow\n          \n            Tom Critchlow"
}