{
  "url": "https://moz.com/blog/the-impact-of-company-investment-on-seo-link-building-case-study",
  "slug": "the-impact-of-company-investment-on-seo-link-building-case-study",
  "title": "The Impact of Company Investment on SEO - Link Building Case Study - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "On the 4th of March 2013 the company I work for underwent a third round of investment from Conde Nast. This was, for a number of reasons pretty big news in the fashion industry as it was Conde Nast’s biggest investment in e-fashion to date – as a result we received a large number of global…",
  "content": "The Impact of Company Investment on SEO - Link Building Case Study Link Building By: Matt Ridout April 16, 2013 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Matt Ridout April 16, 2013 The Impact of Company Investment on SEO - Link Building Case Study Link Building This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. There are certain landmarks for businesses which are considerably large in value, these can come in all shapes and sizes but generally cover; mergers, investment, rebranding, share pricing, being bought by another company or going public on the stock market. One or more of these will usually happen every few years for a medium to large sized business and are often decided and managed at the very top of a company’s hierarchy. Personally speaking, I have worked at a number of places that have undergone just about all of those that I’ve mentioned, but until now have never really been able to measure what secondary impact this has on SEO and Google. It’s probably a familiar scenario for most seasoned SEOs – there are some brands out there which seem to do very little active link building or content creation yet their rankings appear strong. When it comes to identifying why and where these companies get their link juice from and why they rank so highly, it becomes clear that a number of extremely high value links are usually the cause. On the 4th of March 2013 the company I work for underwent a third round of investment from Conde Nast. This was, for a number of reasons pretty big news in the fashion industry as it was Conde Nast’s biggest investment in e-fashion to date – as a result we received a large number of global citations, many of them with links and social signals to our site. So how does Google treat this sudden influx of positive signals to a site and what impact has that had in rankings and visits? It's worth remembering a great piece of link bait that Lyndon Antcliff created a few years ago involving a young boy, his dads credit card and a lady of the night. Matt Cutts mentioned that creating fake stories could lead to penalties - besides being misleading they could generate (and did for Lyndon) large numbers of links which Google use to struggle with - that was five years ago and I'm confident Google now has a filter for such eventualities or those actions that mimic the kind of results you might receive. Obviously this kind of news was a big deal for both our site and the investors so our CEO and PR team held a company news conference to release the story to the press. As our business has a global target we ensured the press invitations mirrored our audience. Social Impact We had a number of global websites and publishers pick up the story, such as The Economist, Vogue, FT, Techcrunch and many more. Over the first three days of the release we reached over 12 million accounts on Twitter including 1,000 tweets, 501 retweets and 100 replies. Below you can see the distribution of tweets (three days only) divided by the number of followers each users had: We did also get a lot of likes on facebook and plus ones/shares on G+ but in terms of broadcasting and spreading the news story Twitter came out trumps. Web Mentions With SEOmoz’s timely release of their web mentions tool we were able to look at the surge of stories and links coming from news sites and bloggers over the release period: Before the news of the investment our site would get around 20 new mentions per day on average but this spiked up to 138 on the 4th of March and continued to have an increased number for 4-5 days afterwards. As well as utilising the new SEOmoz tool we also used the traditional manual approach of monitoring new stories and pick up such as Google News and Twitter’s search function, then recording the links in a Google doc. Obviously not all mentions and news stories linked to our site (which would have been awesome) and some of the international news sites seem compelled to link to their own internal search results for our brand name – which is a bad user experience (boooo) – however we did get 23 good quality links (and counting) within the first few days of our news. I decided to look at the kind of links in a bit more detail so the graph below show you the kind of quality links I’m talking about – I’ve added SEOmoz and Search Engine Land as controls in measurement so you can see the kind of level of value these are delivering. Generally domain authority was exceptionally high for this kind of activity – we did actually get one link from a domain that had a domain authority of 100 (and wasn’t Wordpress or Blogspot). Generally speaking when normal link building activities are carried out anything between 40-60 in domain authority is considered good, on average from this news came to 73, over 23 links. Again to put some of these links into perspective I’ve made a comparison of total links for all sites versus SEOmoz and Search Engine Land – four sites have over 10 million links, the top one had 63 million incoming links (international known newspaper). What I’m trying to illustrate in this section is simply that some of these links are just usually un-obtainable, so the SEO value you would expect would be significantly high. In terms of the type of links we received from this news, it was 99% brand pointing to the homepage – as you would expect from a story on investment. My Theory I had anticipated what would happen to our rankings as I've seen a pattern emerge in Google over the last 6-12 months; when you acquire new good quality links pointing to a domain or a increase in the number of links to a website you will generally see an immediate drop or \"sandbox\" of rankings (especially if the anchors are exact match). I believe this occurs when the algorithm detects something unusual or out of trend in a linking profile, most likely this is in place to stop spammers but it can and does get triggered by natural increases like the examples I mentioned in the beginning of the post. So I anticipated the following: Week 1 - probably very little impact to rankings, most likely uplift from the visits through the stories Week 2 - start of a negative impact to rankings, most likely to keywords that rely on link juice delivered from the homepage Week 3 - most likely rankings will start to turn around and resume to where we originally started Week 4 - I was hoping that the true value from all these high quality links would now start flowing value to our site and as a result see an increase in multiple rankings Results Week 1 During the first two days since our news broke there was actually no change to any rankings (or the ones I was benchmarking anyway), but towards the end of the week I started to see a number of drops in rankings for keywords that, prior to this event had been increasing regularly month on month. I benchmarked 102 primary keywords and did a comparison for a week before and a week after we got the influx of links - the average rank moved from 12.6 to 17.2: This was a far bigger drop than I had initially anticipated given the quality of the incoming links and social signals. Week 2 As predicted in the second week there has been the biggest drop in ranking for a large number of keywords. There were a few that did increase well but overall, as you can see in the graph below we went from an average rank of 12 at the benchmark to just over 21 on a set of 102 keywords in just two weeks. During this week we did also generate additional links from yet more high profile sources. Week 3 & 4 Towards the end of week 3 and beginning of week 4 I saw the increase in ranking starting to appear - with the average ranking moving from nearly 20 to 14. Around this time there were significantly less links coming in to our site than the previous two weeks. Week 5 Week 5 saw another increase and for the first time since the beginning of March the group of keyword had actually improved on the original benchmark rankings. Summary Here's some bullet point findings over this experience: Rounds of investment to a company will inevitably generate extremely high value links that are usually unobtainable from normal SEO techniques These high value links are often from news sites to start with and then vertical specific in a \"second wave\" of pickup The social impact is less of a direct impact on SEO but helps spread the word to bloggers that in turn pick up the story and link The impact on rankings is negative to start as the sudden influx in links is uncharacteristic of the existing link profile (regardless of authority) Some trusted sites will link to their own internal search results for your brand name Expect a heavy influx of links to your homepage and a a result of that make sure your internal link structure flows to the right business areas It took around five weeks for the true value of the links to have a positive impact on rankings / organic traffic I'll keep you all updated as to any more changes we experience. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Impact of Company Investment on SEO -  Link Building Case Study"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Impact of Company Investment on SEO -  Link Building Case Study"
    },
    {
      "level": "H2",
      "text": "Social Impact"
    },
    {
      "level": "H2",
      "text": "Web Mentions"
    },
    {
      "level": "H2",
      "text": "My Theory"
    },
    {
      "level": "H2",
      "text": "Results"
    },
    {
      "level": "H3",
      "text": "Week 1"
    },
    {
      "level": "H3",
      "text": "Week 2"
    },
    {
      "level": "H3",
      "text": "Week 3 & 4"
    },
    {
      "level": "H3",
      "text": "Week 5"
    },
    {
      "level": "H2",
      "text": "Summary"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Matt Ridout\n          \n            Matt Ridout\n          \n            Matt Ridout"
}