{
  "url": "https://moz.com/blog/the-economic-motive-behind-googles-new-advertisement-algorithm",
  "slug": "the-economic-motive-behind-googles-new-advertisement-algorithm",
  "title": "The Economic Motive Behind Google's New Advertisement Algorithm - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Economics is the study of relationships between supply and demand sprinkled with an understanding of human behavior.Pricing is something that most business owners GUESS, and they typically fall within the average area where the demand curve intersects with the supply curve.Then, the distribu...",
  "content": "The Economic Motive Behind Google's New Advertisement Algorithm Paid Search Marketing (PPC) J By: james zolman August 12, 2007 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! J By: james zolman August 12, 2007 The Economic Motive Behind Google's New Advertisement Algorithm Paid Search Marketing (PPC) The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Economics is the study of relationships between supply and demand sprinkled with an understanding of human behavior. Pricing is something that most business owners GUESS, and they typically fall within the average area where the demand curve intersects with the supply curve. Then, the distribution of pricing among the entire population of competitors in a specific industry is often bell shaped with outliers at both the high and low ends of the pricing spectrum. Google recently announced a change to their advertisement algorithm. Specifically, the change is that the top ad position will now be determined by the MAX BID instead of the highest actual cost per click. This is a very smart move in terms of Google's potential revenue and the impact this change will have on business bidding behavior: Supply is limited to 1-3 positions above the organic results. Business owners who see their competitors take the top positions will want to out-bid that person by raising their maximum bid, thereby gaining control of the top position. The ripple effect of one competitor raising their bid is tremendous, especially with the bid management software and bid management companies available today - somebody is keeping an eye on things. When one competitor is bumped into a different position, the bid is automatically or manually changed to compensate for the lost/preferred position. When the top bidder raises their maximum cpc, and several others follow suit, the costs incrementally rise because everybody wants to have the higher max cpc even though they rarely pay their maximum rate! Raising your max cpc will inherently increase your costs. These costs are ultimately going into Google's pocket, and I have to tip my hat their way because this was a genius, strategic move on their part while trying hard to make it a win/win situation. Google made the move based on the current behavior of their advertisers and the quality level of the advertisements. Google took advantage of this behavior by looking at the supply, tapping their chins, and saying \"hmmmmmm\" while they thought of ways to manipulate demand. They HAD TO MOVE the demand curve to the right because the supply curve is fixed! When the demand curve moves to the right on a fixed supply curve, costs generally rise for the buyer while revenue rises for the supplier. What do you think? Would this be considered 'evil' or is it REALLY a win/win situation? Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Economic Motive Behind Google's New Advertisement Algorithm"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Economic Motive Behind Google's New Advertisement Algorithm"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Ultimate SEO and PPC Integration Playbook — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Use Google Ads AI & Machine Learning To Run Better Campaigns"
    },
    {
      "level": "H3",
      "text": "How to Use Keywords to Combine the Power of SEO and Google Ads [Case Study]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "james zolman\n          \n            james zolman\n          \n            james zolman"
}