{
  "url": "https://moz.com/blog/the-foolproof-method-for-great-blogging",
  "slug": "the-foolproof-method-for-great-blogging",
  "title": "A Foolproof Method for Great Blogging - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "The Foolproof Method for Great Blogging\nDon’t become an expert by acting like one - This might sound counter-intuitive, but it really does make sense. Many inexperienced bloggers try to make their work sound important and reputable even when it is not. This is an easy mistake to make because…",
  "content": "A Foolproof Method for Great Blogging Content Marketing By: Danny Dover July 31, 2008 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Danny Dover July 31, 2008 A Foolproof Method for Great Blogging Content Marketing The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. The Foolproof Method for Great Blogging A note on blog content I like to compare blogs to mattresses. Every mattress needs to have the right softness to support ratio. I imagine top ten posts, weekly roundups, and opinion pieces as the padding that makes mattresses soft. Meaty posts, research-based pieces and posts announcing new important information are like mattress springs. The key to a successful blog is maintaining the right ratio. Just like different people prefer different mattress ratios, audiences prefer different blog content ratios. Both kinds of posts are a subtle art form and equally important, but the second type of posts are much harder to write on a consistent basis. The following method mostly applies to writing these more in-depth (spring-like) blog posts. Prepare yourself Don’t become an expert by acting like one - This might sound counter-intuitive, but it really does make sense. Many inexperienced bloggers try to make their work sound important and reputable even when it is not. This is an easy mistake to make because emulating the industry leaders is a logical path to success. Don’t be fooled. Real success comes from distinguishing oneself in a useful way, not by pretending to be something one is not. Avoid the temptation to brainstorm - Brainstorming is the gateway to poor posts. If you have to scrape the bottom of the pan to come up with a blog post idea, chances are the resulting blog post won’t be your finest. Great bloggers write what they feel they need to write. The resulting posts are the ones other people feel they need to read. Know your audience - The best possible circumstance in blogging is when writing for your audience is no different than writing for yourself. A great blogger should ask themselves if they would pick their own blog post to read out of the hundreds of options presented to them daily. If they wouldn't, they need to figure out why not. Bring something new to the table - Great bloggers know how to find or create information that no one else knows about. You should ask yourself if your intended post is simply restating something someone has already covered. Many bloggers writing about the same public announcement Research, research, research - You don’t need secret sources to get new information. Instead, create new information yourself. It may be time consuming, but combining and analyzing public data in a unique and interesting way is always a surefire blogging hit. Think like a magazine editor - Readers might pick up a magazine to read the top 10 \"blah blah,\" but they subscribe for the great articles. The same is true for blogs. Write content to grab people’s attention and write deeper content to keep it. Surround yourself with people who challenge you - Blogging is time consuming, difficult, and sometimes disheartening. The best way to keep your motivation up is to surround yourself with people who will keep you going. Initially, this can either be people you interact with online or in real life. Eventually this influence should be your audience. Time to write Write your first draft in a word processor, not in your web editor - If you want your work to be taken seriously, write it seriously. Not only do most word processors provide spelling and grammar check, but the very act of writing blog posts in the same environment as your professional documents pressures you to write quality posts. This post in draft form while I wrote it in a word processor Write down your main ideas first - Writing your main ideas out gives you the opportunity to organize your thoughts and assures that you have covered all of your bases. After you have the ideas, expand on them and fill in all the blanks. Research, research, research - I do almost 100 Google searches every time I write a post. Each time I blog, I try to become an expert in what I am writing about. You should learn to backup all of your written words with producable facts. Remember, unlike other forms of writing, blog posts remain publicly accessible for a long time. My Google activity while writing past blog posts Read your post aloud - The human brain is able to process text very fast because it utilizes learned patterns. This is a bad thing when you are trying to edit a blog post. Just think of the reading “riddles” you have undoubtedly received many times in e-mails from your parents. It is remarkably easy to miss blatant typos. It is much easier to read these misspelled words internally than it is to read them aloud. Use this knowledge to your advantage and avoid publishing typos. There are four 'F's in this sentence, right? Wrong, there are actually seven. Even moderately skilled readers commonly skip prepositions (in this case, the word \"of\") when processing text. Reading your post aloud helps you avoid the common mistakes that lead to typos. Be sure to do this at least once before publishing your blog posts. Lose some weight, fatty! - Remember that internet users have about as much attention span as a five-year old child on speed. (What? I grew up in a rough neighborhood) As a rule of thumb, the user should never have an entire screen of text while scrolling through your post. Separate large text blocks with relevant pictures or uniquely formatted titles. Go do something else for an hour - Save and exit the word processor you are writing your post in. Minimizing it will make returning to the post too tempting. Go outside, read a book, or simply go walk your dog. Or if you are like me when given this advice, go on YouTube or Facebook and let your mind wander elsewhere. Make a final BS read-through - This is one of the most important steps. Before posting, reread your post and delete all of the bullsh%t. It inevitably creeps into all blog posts. The BS can take the form of unnecessary preaching, lame jokes, wordy sentences, repetitious points, unnecessary arguments, or even repetitious points. ;-) Make sure that you would feel comfortable reading your blog post out loud to a room full of your peers. Publish it - Hit the magic button, do a spin in your computer chair, and get ready for the fun part. Finally you can start to blog Blogging is as much about discussion as it is about writing content. View your post from the perspective of your readers - Go reread your post on your actual blog. Verify that all of your images and links work correctly. Be sure that your links both take you to the correct URL and open in a new window. <a href=”https://moz.com/” title=”SEOmoz Homepage” target=”_blank”>I love SEOmoz</a> Remember, you don’t want your users leaving your blog mid-post. Respond to comments - You wouldn’t ignore someone if they talked to you face to face. Make sure to follow the same etiquette for blog posts. You don’t necessary have to respond to every single comment, but you should try to answer readers' questions and be part of the any related discussions. (I for one need improvement in this area.) Add updates - Did you just find out half your post was incorrect after publishing? Add an update but don’t delete your original content. Make use of strikethrough. It is okay to change your entry after posting, just make sure you make a clear note that it changed. Admitting to a mistake is always better than simply hiding your errors. Remember, people can always see what you have written in the past by viewing cached versions. Respond to your response - See if people elsewhere on the web are talking about your post. If they do, join the conversation. At a minimum check Delicious, Technorati, and Google Blog Search. Reflect and learn - This should happen about a day or so after writing your awesome post. Simply reflect on how well you achieved your desired results and reflect on any mistakes you may have made. This is one of the most important parts of successful blogging. Finally, pat yourself on the back and smile. If you did everything correctly, you should be loving what you do ;-) Stay tuned for the SEOmoz blogging guide coming out early next week! If you are an experienced blogger, feel free to share your opinions and expertise in the comments. This post is very much a work in progress. As always, feel free to e-mail me or send me a private message if you have any suggestions on how I can make my posts more useful. If that's not your style, feel free to contact me on Twitter (DannyDover) and/or Linkedin (Danny Dover). Thanks! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "A Foolproof Method for Great Blogging"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "A Foolproof Method for Great Blogging"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Danny Dover\n          \n            Danny Dover\n          \n            Danny Dover"
}