{
  "url": "https://moz.com/blog/the-definitive-howto-for-conversion-rate-optimization",
  "slug": "the-definitive-howto-for-conversion-rate-optimization",
  "title": "The Definitive How-To Guide For Conversion Rate Optimization - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Let's start by asking one of the most important questions in conversion rate optimization (CRO):\n\nA good question\nIn this article, you’ll get:\n\n    A clear and defined process for CRO\n    Checklists to print and check off a...",
  "content": "The Definitive How-To Guide For Conversion Rate Optimization Design S By: stephen-15402 April 26, 2010 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! S By: stephen-15402 April 26, 2010 The Definitive How-To Guide For Conversion Rate Optimization Design The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Let's start by asking one of the most important questions in conversion rate optimization (CRO): A good question.In this article, you’ll get: A clear and defined process for CRO Checklists to print and check off as you goI’ll share the same processes that I use to consistently boost my clients’ conversion rates – sometimes even doubling or tripling them. (I specialize in industries like finance, gaming, travel and weightloss, where even a 5% increase in conversion rate can generate millions of dollars.)This is the article I wish I could have read when starting out.Conversion Rate Optimization - setting the record straightIf you only remember one thing from this article, make sure this is it.Conversion rate optimization is… Finding out why visitors aren’t converting Fixing it That's it.It sounds obvious, but a lot of people forget it – and they leave a ton of money on the table as a result.Conversion rate optimization isn't… Split-testing the colour of your buttons (unless you really want to) Following best-practice and guesswork Based on misleading metricsLet's look at the first point:Don't split-test the colour of your buttons (unless you really want to) The more people talk about CRO, the more you hear bizarre recommendations on the colour of your buttons and headlines, the alignment of form labels, and so on.This is one real-life example:\"Making your headline red will increase your conversion rate 30%.\"Let's rephrase the statement, using the definition of CRO above:\"I think that visitors aren't converting because our headline is black rather than red.\"Putting it like this, it starts to sound less plausible. Just because Youreapoorloser.com has a red headline, doesn't mean you should.We need to start by finding out why visitors aren’t converting – then fix it.The trouble is that statements like “green buttons convert better than red ones” and “short forms are better than long forms” are appealing, and quickly become considered “best practice”…Don't follow best-practice and guesswork It sounds counterintuitive to say \"don't follow best practice\" (especially in an article actually giving advice). To put it another way, don’t assume that just because it worked for someone else means it’ll work for you.It's natural that we'll look for silver bullets – in fact, it's good to look for ways to get bigger wins quicker – but this kind of testing doesn't fit with a successful conversion rate optimization strategy.Conversion rates are hugely personal to your website – what works on someone else's website will only work on yours if you have similar objections. You've got to find out what’s wrong with your site – not what worked on someone else’s.Don't worry about misleading metrics Focus on the money. So don't worry too much about microconversions or other metrics. (The only reason people boast about increasing their \"add to basket\" conversion rate is often because they didn’t increase their overall conversion rate.)Focus on the money and the conversion rate that’s directly linked to revenue.Why CRO mattersOk, let's start with the easy one:1. Make more moneyBut wait... there's more! When you increase your conversion rate, it also means you can…2. Increase advertising spendAfter all, when your conversion rate increases, then PPC, affiliate marketing and other advertising will suddenly become much more profitable. And when you do that, you can…3. Increase market shareThe more you increase your conversion rate, the more traffic you can buy, the more customers you get, the more repeat business you get... You'll rapidly increase your market share. And it all starts with your conversion rate.Conversion Rate Optimization – step-by-stepStage one: research and analysisBecome the customer This is a massively important step – and one that most people skip. Don’t be that person.Buy the product or service. And when you’re buying it, take screenshots and/or use Camtasia or similar to record yourself buying it. (It's incredible how many people haven't bought a product or service from their own site.)Increasing sales starts with understanding what you’re selling, so when you’ve bought the product or service, use it as a customer would. Test it, take it apart and put it back together – even demonstrate it to others as a salesperson would. Set up funnels in Google Analytics Most companies haven’t even set up goals and funnels in Google Analytics (and if they have, they stopped working properly months ago). When they’re set up right, they’ll quickly show you where you’re losing traffic and where the biggest opportunities are.If you need help setting this up, take a look at this excellent article on Google Analytics goals and funnels.Use other analytics packages Other analytics packages are great at showing you what’s happening on your website.Crazy Egg will generate heatmaps of your website, showing you which areas are getting the most clicks. Yes, Google Analytics does heatmaps too – but not like Crazy Egg. They’ll even show you clicks on inactive elements – the things people are clicking on that aren’t actually links. Often this will reveal areas the visitors want more information on. It can be a great source of quick wins. Crazy Egg – Look for clicks on inactive elements, as they can be a great source of quick wins.ClickTale is several tools wrapped into one. It’ll give you heatmaps showing how far down your pages visitors are scrolling (perfect for your long spammy weightloss page). It can even record videos of your visitors’ sessions (which will help you get in the habit of looking at your site through someone else’s eyes). And finally, it has brilliant form analytics – you’ll see exactly which questions in your form are causing visitors to abandon the page. ClickTale gives you access to a huge amount of data – including how far down the page visitors will scroll.Do five usability tests With several cheap usability testing companies available, there’s no excuse not to be doing it anymore. It’s one of the most profitable activities you can do. With sites like UserTesting.com (US and UK) and whatusersdo.com (UK), you’ll pay around $40 for a 15-minute usability test. At the end, you’ll get the video of their session, plus the voiceover as they navigate your site. With sites like UserTesting.com and whatusersdo.com offering quick and cheap usability tests… …there are no excuses not to do any.Remember, don’t make your brief too prescriptive. You want the tester to use the site as they would if they weren’t doing a test – don’t make them follow orders. (You can even set them the same task on a competitor’s site to see what the competition is doing right/wrong.)Survey your customers By this stage, we should be building a good list of reasons why visitors aren’t converting – whether they’re usability issues (can’t buy) or objections (won’t buy).We’ll gather more data on this with surveys. It doesn’t really matter how you survey your customers – so long as you do it.You can create a survey with SurveyMonkey and email it to your customers and non-customers (but make sure to use free-text answers rather than multiple choice – we want the customers to tell us in their own words, not to pick the closest reason from a list). Or use a tool like Kampyle to gather feedback directly on your site. Or just pick up the phone and speak to them.Talk to sales staff Your website is the online equivalent of your best salesperson. So… find that salesperson and ask them to sell the product or service to you. (If you’ve got a Flip camcorder, use that to film it.) Find out what questions and objections the customers ask and – more importantly – find out what the answers are. Flip camcorders – Keep one of these handy when speaking with sales and support staff.Stage two: solutionsCreate a list of all the objections + issues Ticked everything off in stage one? Good. If not, make sure you complete it soon (seriously – if you don’t, you’re leaving money on the table.)When you’ve got all the data, start a spreadsheet with a list of all the usability issues (can’t buy) on one tab, and the objections (won’t buy) on another. Highlight the ones that come up most often, or that you think can have a big impact.Brainstorm ways to overcome them Next, brainstorm ways to solve the usability issues and objections. Put the possible solutions into the second columns of your spreadsheet.Look for hidden opportunities Remember, it’s important to be creative with the solutions. Here are a couple of examples:If you’ve got a low conversion rate on a form, do you even need the form in the first place? Take a look at posterous.com – a great example of removing the sign-up process altogether. Posterous.com – “Look Ma – no sign-up!”If you have to keep your sign-up process, but people are abandoning it, how do you fix it? Lovefilm.com are great at conversion. If you abandon their sign-up form, on your next visit, they’ll redirect you back to where you left off – even if you type in their homepage URL. (Abandon their sign-up form and you’ll see how.) Lovefilm.com – “Haven’t I been here before…?”It’s creativity like this which will boost your conversion rate. If you do the same as everyone else, your conversion rate will be the same too.Prioritise the actions (aim for quick results and maximum improvement) So now we’ve got the objections, the issues and the possible solutions. Next we need to tackle them in the right order. There’s an opportunity cost, so we want to start – not with the quick wins – but the quick and big wins.Go through the list with your developers. Mark the ones that can be developed and tested quickly and easily. If they match up with the ones you highlighted above (that can have a big impact), you’ll know where to start.Stage three: development and testingDevelop the variations and take screenshots Now the fun part. Start developing the variations. Don’t be tempted to test too many things in each variation – you won’t know what’s increasing the conversion rate and what’s lowering it. Be scientific in your testing and you’ll get bigger wins quicker.When the variations have been developed, make sure you take screenshots of them. We need to keep records of everything we’re testing. It’s easy to get 20 tests into a campaign and forget what you tested at the start. Be like Travis Bickle: “One of these days I'm gonna get organezized”. Today is that day.Set up Crazy Egg on variations Don’t forget your analytics when you’re testing. Crazy Egg is a staple in my testing diet. If the Crazy Egg code is in your footer, it’ll be on the new variations automatically (as long as it’s an A/B test, not a multivariate test). Just set up a test at CrazyEgg.com and you’ll get a heatmap for the new page. Compare the two and you’ll have a clearer insight why one page is converting higher than another.Test using Google Website Optimizer or other testing software Google Website Optimizer is fairly powerful, fairly easy-to-use and – best of all – completely free. No excuses. Google Website Optimizer – the price is right.Now let me qualify those statements. It’s fairly powerful out-of-the-box, but you may want to hack it to do things like testing multiple goals. It’s fairly easy to use – especially if you’ve got a good developer – but there are alternatives that are easier.For a detailed guide to testing software, take a look at whichmvt.com.Stage four: review and expandLog the results and screenshots When the test has finished, log the results and store them with your screenshots of the variations. As we repeat this process, we’ll build up a folder of what works and what doesn’t. This is crucial.Analyse the results (big losses are just as important as big wins) Big wins are awesome. Big losses can be interesting too – just flip it around. So rather than saying, “Page B lowered the conversion rate by x%”, you should say, “Something about Page A effectively increased the conversion rate by y% over Page B.”Then all we need to do is find what that something is. Take a look at your Crazy Egg screenshots and review your list of objections and usability issues.If you got a win, can it be developed further? The first question after getting a win is, “How can we develop this?” So if you added a testimonial to your landing page, what would happen if you added five more? Take the winning element to extremes and see how big a win you can get.If you got a win, can it be applied to other parts of the funnel? The second question is, “How can we apply this elsewhere?” Take the principle that increased the conversion rate – adding trust, emphasising a particular benefit, introducing a guarantee – and work out how you can apply it to other parts of the funnel.These two questions together can magnify increases to the conversion rate several times over. Stage five: repeatAs you can see, the process works in a cycle. The insight you get after completing a test will feed into the top – giving you ideas for other tests to try. This is Conversion Factory's approach to conversion rate optimization.After a few rounds of testing, repeat all or part of stage one (research and analysis). Do the usability testers still struggle with the same things? Are potential customers still uncertain about the benefits of your product? Either way, you’ll get fresh ideas for CRO.Follow this process and you’ll quickly – and reliably – increase your conversion rate.What now?Thanks for making it through to the end. If you haven't already downloaded the worksheets, you can get them now.If you want to get more articles on conversion rate optimization, sign up to the mailing list on conversionfactory.com and we’ll keep you updated.Thanks!Stephen. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Definitive How-To Guide For Conversion Rate Optimization"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Definitive How-To Guide For Conversion Rate Optimization"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "The Mozbot Mashup: Roger Explores the World of Generative AI Imagery"
    },
    {
      "level": "H3",
      "text": "One Secret to Improve SEO in 2021: Guestographics"
    },
    {
      "level": "H3",
      "text": "Pop-Ups, Overlays, Modals, Interstitials, and How They Interact with SEO"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "stephen-15402\n          \n            stephen-15402"
}