{
  "url": "https://moz.com/blog/the-strategy-that-helped-sprout-social-double-its-blog-traffic",
  "slug": "the-strategy-that-helped-sprout-social-double-its-blog-traffic",
  "title": "The Strategy That Helped Sprout Social Double Its Blog Traffic - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "By being attentive to the user-insight gleaned from their website, Sprout Social turned a few simple tweaks into a bonafide blog-optimization strategy.",
  "content": "The Strategy That Helped Sprout Social Double Its Blog Traffic Keyword Research | SEO Analytics | Blogging By: Michael Patterson September 18, 2015 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! By: Michael Patterson September 18, 2015 The Strategy That Helped Sprout Social Double Its Blog Traffic Keyword Research | SEO Analytics | Blogging This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Our blog has been running for almost five years now, which means we’ve had to stop and rethink strategies a few times since its inception. But even though our blog’s format, style and techniques have changed over the years, two things have remained constant: We’ve stayed committed to providing our readers with helpful, actionable social media content and we’ve been steadily collecting data from Google. In a time when creating data-driven content is a top SEO strategy, the latter has become one of our blog’s greatest assets.The Insights team has spent a lot of time pouring through the data, and when analyzing it on a landing-page level one of the key things we noticed was all content has a shelf life. Even some of the most evergreen content will decay in time. However, this doesn’t have to mean you lose out on that traffic forever. With the proper strategy and maintenance, you can actually reverse the decay of content and re-optimize old posts to perform better than ever before.Flipping Blog ContentThe idea of flipping blog content initially struck us when the team saw one of our highest converting blog posts starting to lose visibility in the SERPs. We realized that the company couldn’t afford to see this post stop driving the quality traffic we were used to, so we re-optimized the post to match user intent and keyword volume.After seeing incredible success with that first post, our content team developed a strategy to scale the process: First, pull historical blog data to find posts that are losing traffic over time, then decide whether to optimize those posts, rewrite them or promote them via email and social.Find the Right Blog PostThe first portion of the process is all about pulling and analyzing your data in order to find the perfect blog post to flip. Here is how we do it at Sprout, but if you already have a post in mind, you can head to the section titled “Go With the Flow...Chart.”Step 1: Pull Analytics DataGo into your company's analytics provider, and create a report that shows you visit data on a landing-page level across all pages.If you use Google Analytics, you can copy the setup in the image above. First, navigate to \"Acquisition\" in the right-hand column of your page and look at traffic by the \"Source/Medium.\" Then choose \"Landing Page\" as the primary to sort by and type in your blog's unique URL into the search field. Make sure you’re filtering to look only at the organic traffic. Choose to look at the conversion goal that you’re most interested in increasing with your blog posts:New usersTotal sessionsGuide downloadsEmail opt-InsLeadsSubscriptionsSalesNow, if you use Google Analytics you’ll have to manually export one month of data at a time, as bulk downloading several months of data as a time won't break it down by specific period. Start exporting your data and combine it into one spreadsheet. Make sure to manually add a separate column and input each month as you go, since some analytics providers don’t include it as a column.Pull as many months as you’d like, but remember that the more data you pull, the stronger your insights.Step 2: Visualize Your DataYour raw sheet of data should look something like this:Next, you’ll need to create a pivot table to view individual landing-page performance over time.Highlight all of your columnsClick the Data tab at the top of your spreadsheetChoose Pivot Table, and click OK on the following screenSet up your pivot-table builder to look like the example belowAfter your Pivot Table is constructed, you’ll want to create a chart to examine the information. Highlight an entire row of data, starting with the landing page on the left and include all the months’ worth of data you pulled.Next, click Chart at the top of the page and choose a Line chart. This presents you with a graph on a landing page’s performance over the course of all the months you've pulled.Step 3: Find a Post Losing TrafficIf you drag the chart’s highlighted section over various rows, it will show you how various landing pages have performed over time. Keep dragging that section over the rows until you find one that has performed well in the past but has since stopped driving conversions.Here’s one of our blog posts that slowed considerably, making it an ideal candidate for flipping.Step 4: Find Page’s Keyword DataNext, you have to access Google Search Console (formerly Webmaster Tools). It’s a totally free tool, and if you don’t have it set up already, this post will have you up and running in no time. Once you’re in, navigate to the Search Analytics page and click No Filter under the Pages section.Tip: Increase your date range to the max to get the most query data.Now, in the page filter view, paste your target URL so that WMT will pull you the query data for that specific page.Assuming your page drives enough traffic, you’ll be able to see the queries that drive post impressions, clicks and traffic. This shows exactly what people are looking for when they’re visiting your page, which is a huge advantage when it comes to restructuring the content.For example, Sprout has an article that we update with all of the perfect image sizes for various social media networks. I pulled the query data and can see exactly what people anticipate seeing when they come through to our page.Briefly looking over our post shows that they can find all of this information on our page.Go with the Flow…ChartBelow is a flowchart that will help you figure out how to proceed based on the current state of your article. Answer the two questions honestly to find the solution that best fits your needs.Question 1: Does your content fit the query data?Look at the page data you pulled from the Google Search Console to see if it matches the content on your blog post. It’s incredibly important to make sure the content on your page matches the content your users are searching for, because if they can’t find what they’re looking for on your page you’ll deliver a poor customer experience, and they’ll likely bounce. If it turns out you’re ranking for terms and driving traffic for something irrelevant, you may want to completely rewrite the article. However, it’s not a complete loss, as you can use the query data you’ve collected to inform your new article. If the content in your post matches the query data, or is close enough that your users will find it satisfactory, move on to question two.Question 2: Is the page properly structured for SEO?Is your blog post structured and formatted for your readers and search engines? There are many different things that go into properly structuring a site for search, and you can learn much more in Chapter 6. Of Moz’s Beginner’s Guide to SEO, but there are some basics that you’ll want to note:An article title that summarizes the contentH2s and H3s that make the page easier to scanImages with alt-tags that make the content digestibleProper meta tags and a URL that inform readers of what the content is aboutSolution 1: Complete re-writeEither your content is ranking for some queries that it really shouldn’t, or your page is lacking proper structure to make for a good reader and search experience. In this case, it’s easier to start writing a completely new version of the post. The silver lining here is that you have a ton of data on hand that spells out exactly what these users want in a blog post. Use the query data you’ve collected and take some time to think about what exactly it is that people are looking for information on. Then create a new post that that answers all of these questions in a complete and well-structured way.Solution 2: major re-optimizationIf you arrived at this solution because your content and structure are both pretty close to being perfect, focus on revisiting the article to see if you can really tighten it up. Use the data at hand to make sure you’re completely answering your users’ queries, and prune any of the information nobody has looked for. Then make sure that you’re using proper headers to guide the site visitors to the answer they’re seeking.If you arrived at this step because your content is great but your post lacks solid search structure, focus on an overhaul of the page structure. Make sure the page title, meta description and URL contain the target keyword and that your target keyword appears in the article title, relevant headers and body content. Finally use sub headers to nest all of the page information in a scannable way, and be sure to sprinkle in images that help the readers digest the content.Solution 3: Minor re-optimizationIf your page is properly structured for SEO but your content doesn’t fit the keyword data exactly, spend some time using the query data to build out a more informative article. Take a few minutes to imagine yourself as the user. Then build out the content that you would like to see if you were in their shoes, including images that you think will help tell the article’s story.If your content is solid and the page structure is close to being completely search-friendly, spend some time making sure it’s perfect. Solution 4: Promote contentIf your page is pulling in relevant, quality traffic, and is already well-optimized for search, it’s best to just keep working to promote it. Try pushing your blog post out through your social media and email channels in order to garner new traffic. These new readers may provide you with additional social media shares and the links you need to reclaim some ground in the SERPs, fully recycling this piece of content.At the end of the day, it’s about providing your users with a great experience and content they’ll find helpful.Though this strategy can lead to a solid increase in traffic, never forget that creating new, unique content for your site must be the priority. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Strategy That Helped Sprout Social Double Its Blog Traffic"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Strategy That Helped Sprout Social Double Its Blog Traffic"
    },
    {
      "level": "H2",
      "text": "Flipping Blog Content"
    },
    {
      "level": "H2",
      "text": "Find the Right Blog Post"
    },
    {
      "level": "H3",
      "text": "Step 1: Pull Analytics Data"
    },
    {
      "level": "H3",
      "text": "Step 2: Visualize Your Data"
    },
    {
      "level": "H3",
      "text": "Step 3: Find a Post Losing Traffic"
    },
    {
      "level": "H3",
      "text": "Step 4: Find Page’s Keyword Data"
    },
    {
      "level": "H2",
      "text": "Go with the Flow…Chart"
    },
    {
      "level": "H3",
      "text": "Question 1: Does your content fit the query data?"
    },
    {
      "level": "H3",
      "text": "Question 2: Is the page properly structured for SEO?"
    },
    {
      "level": "H3",
      "text": "Solution 1: Complete re-write"
    },
    {
      "level": "H3",
      "text": "Solution 2: major re-optimization"
    },
    {
      "level": "H3",
      "text": "Solution 3: Minor re-optimization"
    },
    {
      "level": "H3",
      "text": "Solution 4: Promote content"
    },
    {
      "level": "H2",
      "text": "Power Up Your Content Strategy"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Michael Patterson\n          \n            Michael Patterson"
}