{
  "url": "https://moz.com/blog/the-secret-recipe-for-viral-content-marketing-success",
  "slug": "the-secret-recipe-for-viral-content-marketing-success",
  "title": "The Secret Recipe for Viral Content Marketing Success - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "We know that content marketing is one of the best ways to engage with audiences and potential customers online. But what happens when a business has tried content marketing and has seen few returns? It's time to come up with content that works; content that will go viral and can show what content…",
  "content": "The Secret Recipe for Viral Content Marketing Success Link Building By: Kelsey Libert May 7, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Kelsey Libert May 7, 2013 The Secret Recipe for Viral Content Marketing Success Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Let's assume you know the basics: content marketing is one of the best ways to engage with audiences and potential customers online. It is useful for improving search rankings, increasing brand engagement and loyalty, increasing brand visibility, and encouraging social sharing and interaction. If you are a consumer-facing company in this day and age, you simply cannot keep up with the competition if you are not actively building your content marketing skill set. Easier said than done though, right? You’ve probably dabbled in content marketing before, or maybe even hired a “top agency.” Maybe you have even seen some results; a few links here, a few hundred shares there, but then what? Certainly no fireworks, no massive ranking improvements, and no lead or sale increases. Maybe it wasn’t the panacea you’d hoped it might be. Short on time and money, you probably gave up and reinvested your money into tried and true marketing practices that could at least drive a few conversions. You chalked content marketing up to something too expensive or too difficult to find any real success with. If any of this resonates with you, you are most definitely not alone. Doing content marketing properly is no easy task, and to beginners it can seem to be next to impossible to create anything that will stand out and get noticed. Add to that the explosion of agencies who claim to be gurus and deliver tragically poor results, and the whole “content marketing” arena can start to feel like a convoluted mess that can’t deliver on its promises. So, what do you do? Other tactics are losing efficacy, your site is losing rankings, you can’t get social engagement for the life of you, and your frustration level is at an all-time high. You go back to the beginning, and you relearn the truth about what it takes to come up with content that works: content that shows what content marketing can really do for your business. Content marketing that can transform a company overnight. When content goes viral: The example above shows a near 10 fold increase in our client's organic search traffic (from Google alone) after a single successful viral campaign. The big spike in the beginning of December marks the launch of the campaign. Step 1: Understanding the truth about your competition You may assume when you first begin that your only competition are your business competitors, the companies online that fight for the same search phrases, or sell the same products or services. When it comes to content marketing, these businesses are only the beginning. What you must remember is that when creating content, you are fighting for attention against EVERYONE; all content creators, not just businesses. Your content must stand its ground against those who are creating content for entirely non-commercial reasons. This means that when coming up with your campaigns, you must not only do better than your competitors, but you must do better than almost everyone talking about your subject area. Step 2: Engagement is good, but viral is better In content marketing, going the incremental route can be an effective way to go. Loyal audiences can be built by creating a great deal of relevant, useful, but not particularly viral content. Through persistence and often grueling content creation schedule it is possible to find a positive ROI over the long term. If you have the capacity to pump out 5-7 thoughtful and moderately useful pieces of content weekly, eventually you will likely see good results. However, as Rand Fishkin said, you have to \"be willing to fail for a long time.” In fact, for companies that can afford it, this can be an essential piece of the content marketing pie, and it is often something we recommend to our clients who have longer timelines. But this style of content marketing will not change your business in the short term. It can take years of consistent effort to see substantial improvements in rankings and in audience growth. What if you don’t have years; don’t have the time, energy, or budgets to create compelling content on a regular basis; or simply need to build an audience fast? The answer is this: you must create something viral; content that can spread in a way that creates massive attention. Content that will boost you above the writhing masses, and make others take notice. Below, you can see our viral content marketing campaign results, which impacted our client’s 271% organic traffic increase. It's important to note that these results were generated by a single outreach placement on Buzzfeed.com, with a nofollow link. Step 3: Understanding what it means to “go viral\" If you have done any reading on viral marketing, you have probably come across attempts at formulas for describing virality, but none that have made it very concrete beyond the understanding that to go viral means to have a high level of visibility. The truth is that virality and the act of going viral isn’t really all that complex. Having something “go viral” relies on having specific values for three important variables. These variables include: Viral coefficient: the total number of new viewers generated by one existing viewer. As content creators this is the number you should be most concerned with, it is basically a “score” of how shareable your content truly is. Viral cycle time: the amount of time it takes before all these new users have been generated by a single initial viewer. In content marketing, the viral cycle Time can be thought of as the amount of time it would take for a viewer who had a piece of content shared with them to view the content and then decide whether or not to share it themselves. The viral cycle time for sharing content is usually no longer than 1-2 days, though in some special circumstances, it can be longer. For the purposes of our discussion here, we will define the viral cycle time as one day. Total available market: the number of people online who might be interested in sharing your content. For broad-appeal type pieces, this number could be in the hundreds of millions. For niche content, this could be as low as several hundred or several thousand people. I’ve adapted a spreadsheet that looks at how these factors actually influence the anatomy and eventual success or failure of a piece of content. The bones of this spreadsheet were originally created by Mark Devisser. Feel free to make a copy of this document and play around with the three variables mentioned above. As a note, you will likely notice some key aspects of virality just from playing with this including: True virality along with the telltale “hockey stick” graph can not be created without a viral coefficient of greater than \"1.\" The higher the coefficient, the faster the spread of the content and also the sooner and more abrupt the hockey stick you will see on the graph. The size of the initial seed is important for the length of time from the initial publishing it takes for virality (hockey stick) to happen. The larger the initial seed, the sooner you will see a potential viral effect, assuming the coefficient is still greater than 1. Extending the cycle time will extend the length of time it takes to see a viral effect (hockey stick) Fortunately, with web based content, the cycle time happens extremely quickly thanks to social channels and the nature of digital content. If you were measuring the virality of say a snail mail chain letter, the cycle time would be on the order of weeks, and creating virality would take much longer assuming a viral coefficient greater than 1. The size of the Total Available Market has an enormous bearing on the total number of cumulative views. This makes it extremely important to think about your target audience during idea development. If you want a viral smash, you must have content that appeals to the masses (more on this later). Step 4: Creating content with a viral coefficient above 1 So, understanding what virality is great, and understanding the levers for virality is even better, but how does this translate specifically to content? How do you take the ideas we just learned and make them work for you in your content marketing efforts? To begin, the first, most important, and most difficult step is to create a piece of content that you think will likely have a viral coefficient greater than 1. When it ultimately comes down to it, there is no perfect way to gauge whether or not a particular piece of content will have a viral coefficient above 1. Ultimately, you won’t know until your content gets out onto the Internet. However, by exploring the top-level qualities that exist within most viral content with a coefficient above 1, it is possible to give yourself a much higher probability of viral success. Strong emotional drivers Put simply, emotions drive almost all behavior. When an emotion is triggered in your brain, your nervous system responds by creating a subjective experience (feelings). A great deal of your decisions are informed by your emotional responses because that is what emotions are designed to do: to appraise and summarize an experience and inform your actions. The stronger the feeling, the more likely to spur a responsive action. When it comes to sharing online, the potential actions related to emotional activation are relatively simple. Essentially there are four options for your typical content consumer when approaching a new piece of content. Engage or disengage Share or don’t share In order for a content consumer to share, they must engage first with the content, and then make the decision to share that content. These actions are mediated entirely by emotions. Many brain researchers and scientists agree that emotion of interest is continually present in the normal mind under normal conditions, and it is the central motivation for engagement in creative and constructive endeavors and for the sense of well-being. Interest and its interaction with other emotions account for selective attention, which in turn influences all other mental processes. Thus, in order to get someone to engage with your content, it must first and foremost pique interest. It is for this reason that titles are so massively important. Without a title that piques interest beyond an undefined threshold, there will be no engagement. Assuming you’ve piqued your readers interest with an interesting title and have passed the first stage, your content must now convince the reader to share. The decision making process for this, as defined by prominent psychologist Richard Lazarus is as follows: Cognitive appraisal: The individual assesses the event cognitively, which cues the emotion. Physiological changes: The cognitive reaction starts biological changes such as increased heart rate or pituitary adrenal response. Action: The individual feels the emotion and chooses how to react (or not). If the cognitive appraisal spurs a strong enough emotion, and resultantly large physiological change, the probability of action is increased. In the case of sharing content, if the cognitive appraisal cues a strong enough emotion and resultant physiological response to overcome factors that antagonize sharing the reader will share the content. So, how do we create strong emotional drivers in our content? In the fast paced online environment, you will only ever have a short amount of time to get the attention of a viewer. Your goal should be to capture the attention of a viewer, and then engage them emotionally as quickly as possible. The faster and more deeply you are able to engage their emotions, the more likely the viewer is to invest themselves enough in the content to share it. Let’s by addressing speed: The speed of emotional activation If you are not able to convey the emotionally impactful aspects of your content quickly, you are probably dead in the water. Highly viral content will communicate its strong emotional impact within the first few seconds of viewing. It is for this reason that visual, easy-to-understand, and easy-to-consume content is generally the most viral. Take one look at viral kingmakers like Reddit.com and you will notice that 90% of the frontpage content are static images. This is also the reason behind the success of infographics (as well as image macros/memes, animated gifs and several other mediums). Visual, simplistic, easy-to-consume, infographics can make excellent viral content, but only if they can extend the benefit of their medium and illicit a strong emotional reaction as well. Which emotions should we engage? Conceivably, almost any emotion, given that it is strong enough is possible as behaving as the primary driver of sharing. In practice, though, not all emotions are as effective in driving sharing behavior as others. Unfortunately, there have been very few studies on the types of emotions lead to sharing. Jonah Berger, a professor at Wharton, has done some preliminary research in this area by looking at the email sharing rates of New York Times articles. His findings are summarized as follows: “The results indicate that positive content is more viral than negative content, but the relationship between emotion and social transmission is more complex than valence alone. Virality is partially driven by physiological arousal. Content that evokes high-arousal positive ( such as awe) or negative (anger or anxiety) emotions is more viral. Content that evokes low-arousal, or deactivating, emotions (e.g., sadness) is less viral. these results hold even when the authors control for how surprising, interesting, or practically useful content is (all of which are positively linked to virality), as well as external drivers of attention (e.g., how prominently content was featured). Experimental results further demonstrate the causal impact of specific emotion on transmission and illustrate that it is driven by the level of activation induced. taken together, these findings shed light on why people share content and how to design more effective viral marketing campaigns.” While this is a great start in understanding the emotional drivers of sharing, it is a very incomplete understanding. In an effort to further detail the real emotional drivers, I sought to understand the emotional impact of content that better fit the criteria of most viral content (i.e. visual, easy-to-understand, and easy-to-consume content). Exclusive Fractl research project: viral emotions *It is important to begin by noting here that the following experiment is not scientific or widely comprehensive. Despite this, there is a good deal of preliminary information that speaks to some of the most apparent aspects of the emotional drivers of viral content, and the takeaways found are likely quite valuable. Research of greater depth will likely bear out additional information and more granular insights.* (Raw Data) I began by selecting a group of content that fit what I believed would be representative of the “best of the best” in viral content. To make sure I was comparing apples to apples, I decided only to use static images instead of written or multimedia content. Memes and inside jokes were also excluded as the factors that lead to them becoming viral can be non-emotional and more difficult to analyze or ascertain. The source of the content I used came from the top 50 image posts of all time on reddit.com/r/pics, a community of 3.4 million plus content voters. I selected 25 images that I felt could stand alone, ones that required no previous knowledge to understand (Reddit tends to boost inside joke type content on occasion, so post that fit that profile were excluded). I then had each image coded by 50 volunteers for the emotions that were elicited by each image as well as the strength of each emotion. The possible choices for the emotions included: Possible emotion choices What we learned The results from this informal survey on some of the web’s most viral visual content was actually quite amazing. Much of what we found mirrored the results found by Jonah Berger, but we also found some interesting additional takeaways. What we found was as follows: Positive emotions were much more common than negative emotions (14 negative and 184 positive). Certain specific emotions were extremely common, while others were extremely uncommon. The strength of the emotional impact was a great indicator for the popularity of the content on Reddit. The top four most popular posts on Reddit also had the top four highest aggregate emotionality scores (sum of emotional strength score totals). Interest, surprise, and amusement seemed to behave as emotional multipliers for positive emotions, and empathy seemed to act as an emotional multiplier for negative emotions. 12 of the 25 images had Amusement, Interest, and Surprise as 3 of their top emotions and all images had at least 1 of the 3 emotions (either Amusement, Interest, or Surprise). Contrasting emotions seemed to be helpful in increasing emotional impact. In the cases where negative emotions were present, they seemed to directly contrast positive emotions, likely enhancing the emotionality of the image through this contrast. Additionally, empathy seems to be a common emotion found alongside popular content that evokes strong negative emotions. Enhancing emotionality for higher virality It’s clear that emotionally evocative content is essential in creating wide-reaching viral content, and that there are even some emotions that seem to work better than others toward this goal, but are there other ways to expand on emotionality for virality? In other words, how can emotionality be enhanced? Increasing emotional identification with the content Make your content visual On a whole, visual content is better at conveying emotionality and being understood quickly and easily. Therefore, images and video have a leg up against written form content. It is for this reason that image and video sharing dominates online. It is the reason the images and video dominate Reddit’s front page each day and the reason 40 of the top 50 posts of all time on Reddit are either images or videos. It is the reason we have all seen infographics, animated gifs, and image macros have become ubiquitous. As a general rule, visual content is simply more engaging. Make your content interactive Interactive content engages the viewer’s senses and attention in a more active way than simple static content. By creating an experience that your viewers must participate in, you necessarily enhance the impact. If there is an emotional angle to your interactive campaign, it can increase the emotional impact substantially. One excellent way we are seeing this happen recently is through the use of parallax treatments like these. Make your content personalized Customized or personalized content is, by its very nature, better at engaging viewers emotionally than non-personalized content. Emotions are more easily evoked when the user can actually SEE themselves in the content, instead of relying on empathy to put themselves in someone else’s shoes. Some standout emotionally compelling, personalized, content like this, illustrates just how incredibly viral emotionally driven, personalized, visual content can be. Have you ever created something with 12 million + Facebook likes? Try emotionally-driven, visual, personalized, interactive content, and you might just be able to. Emotional stacking with lists If you haven’t been paying attention to Buzzfeed.com lately, you should probably start. They have mastered the art of what I like to call “Emotional Stacking.” Definition: Lists of disparate visual content, linked thematically, into a list that is purposefully structured to build up a specific emotional response. This example, for instance illustrates the technique perfectly. A list based image post of the 45 “Most Powerful Images” of 2011. With each image adding to the emotional reaction of the user, by the time you get to the end, you have been worked up into such an emotional state that the desire to share feels almost visceral. Growing the viral coefficient - Beyond the emotions While emotions generally play the largest role in determining the viral coefficient of a piece of content, there are other aspects that can contribute significantly to whether or not a that content is ultimately shared. Additional motivating factors can play a key role, specifically factors that convey some kind of social benefit or ego benefit. The social benefits of sharing: Social incentive/reward to share \"Ingroup vs. Outgroup\" Content that makes the viewer feel exclusive, or in-the-know, or otherwise included can often work very well as a motivator for sharing. This ingroup vs. outgroup effect is one of the driving forces for the popularity of memes, by sharing the “inside joke” the sharer demonstrates that they are part of the ingroup. \"Altruistic\" Content that allows the sharer to feel that they are doing tangible good can often incentivize sharing and substantially increase the viral coefficient. This is especially true for content that has a strong emotional hook that creates strong feelings of empathy. This is just one excellent example of an altruism enhanced, emotionally-driven viral effect. \"Self-identity/image bolstering\" When users share content on peer-facing communities like Facebook, they often make sharing decisions based on how the content will represent them to their peers. What is it that sharing that specific piece of content will convey about the sharer to their peers? Content that, when shared, would affirm the identity of the sharer will be more likely to be shared than content that won’t. This is one of the reasons why emotionally driven content that relates to hot-button social issues can often be extremely viral. We saw this exploited (in the best sense of the word) extensively by companies like OREO, with their pro LGBT rights campaigns over the last year. Sharing was incentivized because so many people felt compelled to position themselves on one side of the issue or the other, bolstering their own identity to themselves and their peers using the emotionally evocative image as a vehicle. Step 5: Decreasing viral cycle time As I mentioned earlier, viral cycle time can be thought of as the period of time it takes for a viewer to share from the time they view the content. While a viral coefficient above 1 is needed for exponential viral growth, the timeline of this growth can be fast or it can be exceedingly slow. It is the viral cycle time that determines how quickly exponential growth will occur in content that has a viral coefficient above 1. It is in the best interest of the content creator to do everything they can to decrease the viral cycle time, to help achieve exponential viral growth in the shortest amount of time possible. So, what can be done to manipulate viral cycle time? To be precise, pretty much anything that can spur the sharer to consume the content faster and share the content faster. This includes, but is not limited to the following: 1. Decreasing consumption time Conciseness of content is extremely important. The faster content can make its impact, the faster the potential cycle time. This is another reason why images tend to be so viral. They can be understood and shared at lightning speed. For instance a viral image may take only seconds to consume, whereas a long-form article, or long video may take many minutes or more to consume. The slower the consumption of the content, the slower the viral cycle time, and potentially the longer it would take for the content to go viral (assuming it has a viral coefficient above 1). The takeaway here is to do everything you can to make your content as concise as possible, so long as you are not sacrificing the impact of the content. Don’t make the mistake of sacrificing a 1+ viral coefficient for a faster cycle time, because without it, you won’t have any virality at all. 2. Increasing ease and speed of sharing Making your content simple and fast to share is absolutely essential for helping to increase viral cycle time. You should do everything you can to include sharing tools for the most popular social sharing sites (Facebook, Tumblr, Pinterest, Email, and Reddit) at the very least. You should also make sure that sharing is set up properly to share a compelling default title and text. Step 6: The limitations of virality and the importance of audience. I’ve discussed generalities about the importance of emotional activation in viral content, but creating successful viral content can often be a bit more nuanced than simply creating something that will strongly engage viewers’ emotions. It is also incredibly important to do your best to make sure that your content is well suited for the audience you hope to target. Now, if you are simply trying to create something massively viral, and you don’t really care about any connection or tie-in to your company or brand, your opportunities for topic ideas are nearly limitless. In practice, though, this isn't often the case. The goal is usually to create viral content that in some way ties in with the offering of the company creating the content. In this case, it is essential to carefully define a target audience for your prospective content, even before coming up with ideas. The reception of the content you create within this segmented target audience is what will determine whether or not your content will become viral. The considerations that you may want to make are multiple, and a future blog post will cover this topic in more depth, but in general, it is important to consider the following aspects of your audience in order to determine the potential reception of any viral concept you are considering creating. What types of content does your target audience like to consume? What specific topics tend to be discussed within this community, and specifically, what topics are held as important by this community? What topics are controversial? What gets this community riled up? What is the general Zeitgeist of the community you are targeting? What are their commonly held opinions on social and political topics? Who are their heroes and villains? Who are their niche celebrities? What is their unique history? Their legends and fables? What sorts of emotions typically are expressed by your target audience? Failing to understand your audience can spell failure. If you are unable to understand them enough to know how to push their emotional buttons, and which ones to push, you will have a high likelihood of turning them off from sharing. Step 7: Considerations for fractal virality A fractal is the mathematical term use for a system of self-similar repeating patterns at different scales. In the context of viral marketing, it can be thought of as an apt descriptor for so called “viral expansion loops” which are created when content has functionality built into it that provides for users or viewers to extend or create new viral content based on or as a part of the original content. Generally, fractal content is user generated, either actively (the user actually does something) or passively (the user’s data is used, but they do nothing). Some examples of fractal content include: Elfyourself.com Fatbooth, Oldbooth, and other mobile apps UGC photo or video contests like: crashthesuperbowl.com Altruistic DIY concepts like Dan Savage’s “It Gets Better” campaign By giving users an opportunity to utilize their own creativity through personalization and user generated content, it is possible to create fractal sharing and massive exposure. Keep in mind that all of the emotional drivers discussed with viral content apply here as well, we’ve simply added an additional layer or step to expand virality. Some important aspects to consider when attempting to create fractal content include considering: How can this idea be adapted, personalized, or altered while retaining the primary message? How have you enabled creativity? Is the functionality conducive to ease of creation and creativity? How have you encouraged users to create compelling emotional content? How do you plan on curating or controlling the content? Is there a potential for a negative reaction? Conclusions Viral and fractal content has the potential to reach and influence massive audiences, but in practice can be exceedingly difficult to create. By understanding your audience and the emotional drivers that motivate them, it is possible to increase your odds of success substantially. Through careful investigation of the elements of virality, in the future it will be possible to continue to improve the odds of success substantially. Here at Fractl, we aim to do just that. Keep an eye out for several new case studies that will help illustrate the points made here through real-life examples of emotionally driven viral and fractal content. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Secret Recipe for Viral Content Marketing Success"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Secret Recipe for Viral Content Marketing Success"
    },
    {
      "level": "H2",
      "text": "Step 1: Understanding the truth about your competition"
    },
    {
      "level": "H2",
      "text": "Step 2: Engagement is good, but viral is better"
    },
    {
      "level": "H2",
      "text": "Step 3: Understanding what it means to “go viral\""
    },
    {
      "level": "H2",
      "text": "Step 4: Creating content with a viral coefficient above 1"
    },
    {
      "level": "H3",
      "text": "Exclusive Fractl research project: viral emotions"
    },
    {
      "level": "H3",
      "text": "What we learned"
    },
    {
      "level": "H3",
      "text": "Increasing emotional identification with the content"
    },
    {
      "level": "H2",
      "text": "Step 5: Decreasing viral cycle time"
    },
    {
      "level": "H2",
      "text": "Step 6: The limitations of virality and the importance of audience."
    },
    {
      "level": "H2",
      "text": "Step 7: Considerations for fractal virality"
    },
    {
      "level": "H3",
      "text": "Conclusions"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Kelsey Libert\n          \n            Kelsey Libert\n          \n            Kelsey Libert"
}