{
  "url": "https://moz.com/blog/the-future-of-ecommerce",
  "slug": "the-future-of-ecommerce",
  "title": "The Future of e-Commerce: What if Users Could Skip Your Site? - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "There are signs that Google may someday allow for transactions directly in the SERPs. What would that mean for ecommerce sites, and how would optimization look?",
  "content": "The Future of e-Commerce: What if Users Could Skip Your Site? E-Commerce SEO By: Tim Allen July 25, 2016 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Tim Allen July 25, 2016 The Future of e-Commerce: What if Users Could Skip Your Site? E-Commerce SEO The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Have you taken a look at Google Shopping recently? Okay, so it isn’t quite the ecommerce monster that Amazon or eBay are, and yes, it’s only filled with sponsored posts. Playing around with it, however, proves that it provides a decent experience. And that experience got me thinking. What if, instead of being sponsored ads, Google Shopping completely replaced organic search results for transactional queries? Would this be a better user experience? I would have a comparison of products from multiple retailers without even having to visit a website. Would this be a better experience than just \"ten blue links?\" In this post I want to share why I think Google Shopping could replace organic search results in the future, and how websites can begin to prepare for this. A closer look at Google ShoppingWe've already seen evidence of Google trying to keep users within their search engine with local packs, flights, knowledge graphs, and instant answers. What’s to say shopping isn’t next? Google have already been using Google Shopping ads within search results for a while now, and they recently started testing Showcase Shopping ads, increasing the level of product exposure in a search result. Check out this Google Shopping result for “red shoes” below: On first impression, this could easily be an organic shopping result. Google doesn’t make it crystal clear that these are paid ads, only displaying a small notification in the top right. Do users clearly understand that these products and brands are paying to appear here? As the potential customer, does it even matter, as long as I find the red shoes I’m looking for? If this had been my search result instead of the typical organic search result, it wouldn’t have been a disappointing experience. In fact, Google would be putting me closer to my desired action of actually researching/purchasing red shoes, without me ever needing to leave Google. Why do I think the long-term plan could be to use the layout of Google Shopping as a replacement for the current organic result? For me, the Google Shopping landing pages offer: An overall better user experience than most sites — it has familiarity and loads quickly. A range of products from multiple suppliers all in one place. Price comparison of multiple suppliers without me having to load multiple domains. Easy-to-understand faceted navigation. Mobile-friendly — I don’t have to gamble on the search result I’m clicking on. More intuitive for voice searchThis plugs perfectly in with the development and improvements of voice search and the use of compound search queries, which Tom Anthony and myself discussed in Distilled’s Searchscape series. Here's a previous example of a compound query that Tom Anthony shared at SMX Munich: I thought I’d test this same process out by trying to find a pair of red shoes using just voice search. The results weren't perfect and, at this time, not a great user experience. However, compare this to Google Shopping results and you'll see where we could be heading in the future with organic results. Below is how the current search results look for a mobile voice search (on the left) versus search results if you click through to Google Shopping (images on the right). “Okay Google, show me shoes”Yup, those are definitely shoes. So far, so good for both results! Current SERPs Shopping SERPS “Okay Google, under £40”Not quite under £40, but they are shoes within a reasonable price range. Google’s organic results have dropped product listings and are now showing sales pages for shoe stores. Current SERPs Shopping SERPS “Okay Google, in red”Organic search now lists red shoe landing pages. However, the ads seem way off target, displaying bikes. Google Shopping, on the other hand, is getting pretty close to the product I may be looking to purchase. Current SERPs Shopping SERPS “Okay Google, for men”Organic continues to show me predominantly men's shoes page results, despite a very specific search query. Compare that to Google Shopping, which now matches the majority of my criteria except price. Current SERPs Shopping SERPS While the above search shows the organic SERPs aren’t producing high-quality results for conversational queries, you can be confident that these types of results will continue to improve. And when they do, the Google Shopping result will produce the best answer to the user's query, getting them to their desired action with the fewest number of clicks. Time and again we've seen Google attempt to reduce the number of steps it takes for a user to get their answer via features such as car insurance, flight comparison, and instant answers. This seems the logical next step for shopping, as well, once search results are dependable. Will the user still have to come to my site to complete a transaction?Initially, yes, the user will have to click through to your page in order to purchase. Currently, Google Shopping allows users to find more information about a product within Google before clicking through to a landing page to complete their purchase. But in the long run, Google could facilitate the transaction for your business without a user ever hitting a website. We saw Google testing this within paid search back in 2015. And while at the time Google stated they have no intention of becoming a retailer (and I still believe this to be true), we certainly know that Google wants to get the user to complete their goal as quickly and easily as possible, ideally remaining within the Google eco-system. Google Shopping testing instant purchase What could this mean for webmasters?A change such as this could be a double-edged sword for businesses. If Google decided to rank your product more prominently than competitors, its ease of use could see an uplift in sales. The downside? If Google decided to monetize this feature, they could look to take a cut from any sales, similar to Amazon and eBay. Secondly, we would have to refine the way we measure traffic to our site (or not). It's likely that measurement would have to be based on impressions and conversions rather than sessions. Based on the current reporting format available for Google Shopping, users may have access to clicks and click-through rate, but as no actual data is being passed to Google Analytics this would likely be reported within Google Search Console. Of course, we'd still want ranking reports, as well. Rank tracking companies such as GetStat and SEMRush would have to adapt their products to track product listings in the same way that we've seen them improve tracking for local packs and structured data over the last 12 months. How could we prepare for this?Preparation for a world where Google looks like this falls into two buckets: what you should do if you own the physical products, and what you should do if you don’t (for example, if you’re an affiliate site). If you own the product:If you own the product (for example, you stock and sell TVs), then you should be looking to give Google as much information about your products as possible to ensure they have the optimal opportunity to appear within search engine results. Ensure product pages are well-optimized so Google understands the product being displayed. Most importantly, we recommend you get structured data in place (Google’s current preference is for webmasters to use JSON-LD). There may also be immediate benefits, such as getting more rich snippets within search results and an increased opportunity of being featured in answer boxes (and leapfrogging competitors), but this will help future-proof your site. Want to know more about JSON-LD? I recommend taking a read of the following resources: Google’s introduction to structured data Distilled consultant Bridget Randolph discusses how to audit for structured data opportunities BuiltVisible’s guide to Microdata, JSON-LD & Schema Additionally, we need to start looking higher up the funnel and creating content that will make users come back. I know, I hate saying it, but we have to produce great content! I'll discuss how The Wirecutter has been approaching this in just a moment. Further down the pipeline, if Google decided it can handle processing user transactions within Google itself, you'll want to consider opening up your checkout as an API. This was a requirement in Google’s paid experiment and, as such, could be a necessity to appear here in the future. If you don’t own the product & are an affiliate or review site, etc.Ranking for both transactional and information search queries could become even more difficult. It may even become impossible to rank for very specific long-tail search terms. The recommendations don’t differ too much from above. We should still get structured data in place to reap the rewards now and start producing great content that sits higher up the funnel. Producing great and useful contentWill Critchlow recently introduced me to The WireCutter as one of his go-to websites. This is a site that's taken product research to an extreme. With extremely in-depth articles about which products users should buy, they take the thought process out of \"which product should I buy?\" and instead, based on my needs, say, “Don’t worry about doing any more research, we've done it for you. Just buy this one.\" I’ve recently purchased a range of products from pens to printers based on their recommendations. They've created useful content — which, after numerous purchases, I now trust — and as a result encourages me to return to their site over and over again. To finish up, I'd love to hear your thoughts: How might the future of ecommerce look? How have you been using voice search, particularly compound and revised queries? Do you think Google Shopping replacing the current organic search layout would provide an improved user experience? Reach out to me in the comments below or over on Twitter — @the_timallen. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Future of e-Commerce: What if Users Could Skip Your Site?"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Future of e-Commerce: What if Users Could Skip Your Site?"
    },
    {
      "level": "H2",
      "text": "A closer look at Google Shopping"
    },
    {
      "level": "H2",
      "text": "More intuitive for voice search"
    },
    {
      "level": "H3",
      "text": "“Okay Google, show me shoes”"
    },
    {
      "level": "H3",
      "text": "“Okay Google, under £40”"
    },
    {
      "level": "H3",
      "text": "“Okay Google, in red”"
    },
    {
      "level": "H3",
      "text": "“Okay Google, for men”"
    },
    {
      "level": "H2",
      "text": "Will the user still have to come to my site to complete a transaction?"
    },
    {
      "level": "H2",
      "text": "What could this mean for webmasters?"
    },
    {
      "level": "H2",
      "text": "How could we prepare for this?"
    },
    {
      "level": "H3",
      "text": "If you own the product:"
    },
    {
      "level": "H3",
      "text": "If you don’t own the product & are an affiliate or review site, etc."
    },
    {
      "level": "H2",
      "text": "Producing great and useful content"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Optimize E-commerce Sitemaps with 1M+ Pages — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "CRO Misconceptions Every SEO Should Know — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "4 Common Mistakes E-commerce Websites Make Using JavaScript"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Tim Allen\n          \n            Tim Allen"
}