{
  "url": "https://moz.com/blog/the-impact-of-authoritative-links-mentions-and-shares-on-rankings",
  "slug": "the-impact-of-authoritative-links-mentions-and-shares-on-rankings",
  "title": "The Impact of Authoritative Links, Mentions, and Shares on Rankings - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Today I want to share with you some interesting details about research that I've done recently and which I have also presented at SMX Advanced Seattle.",
  "content": "The Impact of Authoritative Links, Mentions, and Shares on Rankings Competitive Research By: Philip Petrescu June 13, 2012 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Philip Petrescu June 13, 2012 The Impact of Authoritative Links, Mentions, and Shares on Rankings Competitive Research The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Today I want to share with you some interesting details about research that I've done recently and which I have also presented at SMX Advanced Seattle. We also have a blog on our website where we post most of the interesting things that we are working on. From time to time, we also post articles that solve common problems that people in our industry face everyday. What's interesting about these articles is that once they are published on our blog, in less than five minutes, they rank first in Google when searching for their title. But it's probably easy to rank first for such a long tail keyword right? How about a three-word keyword? How about two words? Not bad with virtually no links and just a few shares, right? Here’s another example. Second place from four billion results with no links to the article. So what's so special about these articles? Why is Google giving them so much attention? First of all, it's fresh content. Google loves fresh content. Second, the article is good enough for people to share it on Twitter, Facebook and Google+. On average, these articles get about 50 to 100 shares total. What would happen if you would have some very influential people share that content? Martin Macdonald wrote an article at the end of March about someone who apparently ranked for \"camper shoes man\" on fifth place without any links to the page. Or so he pretended, because Martin has quickly uncovered his hidden network of links. If you haven't seen this article yet, you should check it out, it’s pretty funny: But let's look at this story from a different point of view. What Martin tried to do here is prove the guy wrong, that he did need some good amount of links to rank for that keyword. But he managed to accomplish something that even he did not expect. Martin's article actually outranked everyone on the \"camper shoes man\" keyword with no actual links, only with some good amount of social shares. He even managed to rank second for “camper shoes”. So what can you learn from this? That the title of your content is very important. There is a very strong correlation between the title and the keyword. Do a little research to see how people search for this kind of content before you name it. That social signals are very important in the early stages of ranking. If your article gets shared by many influential people you get a higher exposure for a limited amount of time. But are these social signals enough to keep that article to rank well? The answer, as you would expect it, is no. The data from my research suggests that you get a good exposure for about a week and then you start losing your rankings. If your article is good, this will be enough time for people to start linking to you. Google will then pick up those links and add some important ranking signals to your article. Unfortunately, that means there is still no long term ranking without some good authoritative links. So let's find out what kind of impact do authoritative links have on rankings. As you probably already know, Google has more than 200 signals that affect rankings. I have only chosen the ranking factors that are related to links in my research and I have grouped them into the following categories: Quantity Diversity Quality Relevance In my research I have analyzed multiple keywords that we are competing for and the link data I used comes from both SEOmoz and Majestic SEO. In the following charts, you will see the top 10 ranking pages for the keyword that I have chosen as an example. These are rendered on the X axis. Depending on the metric that is shown, the values for this metric will appear on the Y axis. The line that you see in this chart is how a perfect correlation would look like. Just keep in mind that you will not be able to see a very good correlation when we look at each metric separately. That’s mainly because all the 200 metrics that the Google algorithm uses work together and they don't have that much value when taken separately. Also, most of the charts only show data about LRDs because I wanted to eliminate any statistical errors coming from site wide links. First of all let's look at the quantity of links that these pages have. You can see here both links and linking root domains (LRDs). There is a surprising large amount of links for the 5th and 6th positions. Why aren't these websites at the top of these results? Let's compare exact match and partial match LRDs. You would think that a larger number of exact and partial links should indicate a better ranking. Well, not anymore. Welcome to 2012! The website on the first position has fewer exact match LRDs than the second website. Not to mention the 5th website. This looks like having a large number of matching anchors is no longer the definitive answer to higher rankings. Position no. 6 has a very few number of links with exact match compared to the others. That is probably why it’s not ranking higher. However, it looks like there is a big boost given by the brand signals, even though it has a lower relevance. The red line shows the number of brand + keyword links. They may be counted by Google as both brand signals and partial match keywords, so many people nowadays say that they work really well. Plus these links look natural so you should not incur any penalties. Let's look at the first two websites in the chart above. The 2nd place has a lot more LRDs with exact match and they make up 70% of all the LRDs. What’s curious is that there are websites ranking in this SERP with less than 10%. Maybe their anchor text distribution is more natural? Most of the websites ranking here have pretty high ratios of branded LRDs in their link profile just as it would be natural for any website. The first website seems to have a good combination of both brand and brand + keyword anchors. The major exceptions, the 2nd and the 5th places make us think that with their large number of exact and partial links they would have ranked higher if only they would have a higher number of branded links. Looking at the percentages, it’s easier to see that most of the top 10 results have more brand signals than exact match anchor texts. The only exception here is number 2 which has a lot of exact match anchor LRDs. But since we are comparing branded links with exact and partial match links, why not do a proper comparison? Again number 2 seems to be the exception here. All I can say is that the Google spam team still has some work to do. With a PA over 90, the 6th place should outrank everyone. But it doesn't and we can only think that the reason for this is its lack of relevance pointed earlier in the anchor text analysis. Most of the results have a higher Page Authority than Domain Authority, which suggests that most of their links are pointing to the page ranking in the results. Even PageRank, taken by itself, doesn’t have a better correlation. The new metrics from Majestic, Citation flow and Trust flow, show slightly different results for the 1st website that now appears to be less authoritative than the 2nd and 3rd. Don’t forget that these metrics have just been released and they apply only to the fresh index, which is only for the links parsed in the last 30-45 days. It would be interesting to see these metrics applied for the historical index. I have also added here Page Authority from SEOmoz to see how it compares with the new Majestic data. They look pretty similar, but I wonder what happened to the first result. Here’s the distribution of all links by Page Authority. The two sites with most of the links, 5th and 6th places, are clearly shown here. Number 5 though seems to have a lot of low quality links to it, which are probably ignored by Google. And number 6 has a lot more links with higher authority. But what happens if we combine Relevance with Quality? Number 6 is gone because it does not have enough links with this anchor text. The only thing that keeps it this high may be the brand signals. If we remove the 5th place from the chart we can see that the other pages seem to have a pretty good natural profile, with 1st place taking the lead. If we look at the distribution of brand signals, the 6th place not only has a lot more branded links than all the others, but these links also have a higher authority. Now let’s combine all four categories: Relevance, Quality, Quantity and Diversity. The blue line is the average authority of the exact match followed LRDs (authority and relevance). The red line shows the number of exact match followed LRDs (quantity and diversity). As you can see, these two lines are opposing each other. Where authority lacks, quantity compensates. So it looks like all these signals work together. Quantity is lowered by quality. Relevance is still the critical factor. Without it, neither quantity or quality matter. Conclusions: Relevance signals are still important, but having too many is not helpful. Having a lot of brand signals and some relevance is better than having a lot of relevance and no brand or authority. “If you have 1 million links with anchor text and no brand links then you have a problem.” I love this quote from David Naylor, and you should definitely do something about it if you are in this situation. When I first started this research I had hoped that I could at least be able to tell you some of the secrets behind Google’s algorithm. But you know what I found out after gathering and analyzing all this data? There are no secrets! The algorithm works for you. Think about it this way. If you create a great product, what anchor text would people use to link to you? That's right, the name of your product. That's a brand signal. If you create some great content, how would people link to it? They will probably use some or all the words from the title of your article. Those are exact and partial match anchor text signals. What happens when all these people share your content or link to it? You become an authority. So you see, it's not about trying to build authoritative links to your website, it's about becoming an authority yourself. Stop spending so much time trying to get these links the hard way. You should spend your valuable time creating a great product that people would want to write about or creating that great content that people would want to share. That's how you become an authority! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Impact of Authoritative Links, Mentions, and Shares on Rankings"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Impact of Authoritative Links, Mentions, and Shares on Rankings"
    },
    {
      "level": "H2",
      "text": "Try our SEO Competitive Analysis tool"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How to Actually Be Better Than Your Competitors in the Eyes of Choosy Customers"
    },
    {
      "level": "H3",
      "text": "SEO Gap Analysis — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "Daily SEO Fix: Competitive Link Research"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Philip Petrescu\n          \n            Philip Petrescu\n          \n            Philip Petrescu"
}