{
  "url": "https://moz.com/blog/the-difference-between-penguin-and-an-unnatural-links-penalty-and-some-info-on-panda-too",
  "slug": "the-difference-between-penguin-and-an-unnatural-links-penalty-and-some-info-on-panda-too",
  "title": "The Difference Between Penguin and an Unnatural Links Penalty (and some info on Panda too) - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Are you confused about the difference between Penguin and an Unnatural Links penalty? Not sure whether you should be disavowing your links? Wondering whether you should file for reconsideration? Well...you're not alone! I have spent a good amount of time answering questions and learning from others…",
  "content": "The Difference Between Penguin and an Unnatural Links Penalty (and some info on Panda too) Link Building By: Marie Haynes April 18, 2013 The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Table of Contents Copied! By: Marie Haynes April 18, 2013 The Difference Between Penguin and an Unnatural Links Penalty (and some info on Panda too) Link Building The author's views are entirely their own (excluding the unlikely event of hypnosis) and may not always reflect the views of Moz. Are you confused about the difference between Penguin and an Unnatural Links penalty? Not sure whether you should be disavowing your links? Wondering whether you should file for reconsideration? Well...you're not alone! I have spent a good amount of time answering questions and learning from others in the SEOmoz Q&A and I see a lot of site owners and even SEOs who are unsure about the answers to these questions. Recently, a YouMoz article (that was promoted to the main blog) was written in which the author showed an image of the unnatural links warning that his site received and then stated: \"We straight away knew that we had been hit by Google's Panda 3.9.1 update!\" Oh dear. An unnatural links warning is NOT indication that you have been affected by Panda! Now, this article, and the comments below it have some great information on unnatural links recovery, so I don't want to be too harsh on the author. My point in mentioning this though is that even SEOs who know a thing or two about Google penalties and algorithm changes can be confused on these matters. A confession - I messed up too. I am insanely obsessed with understanding Penguin, Unnatural Links Penalties and Panda. I really don't know why. But it all started because I made a mistake. I was part of an SEO forum discussion in which a site owner felt they had been affected by the Penguin algorithm. I told him to clean up his bad links and then file for reconsideration. A senior member of the forum rightfully corrected me and said that I was giving incorrect advice. And he was right! As I will discuss further on in this article, filing for reconsideration is not going to help a Penguin hit site. I gave some bad advice and I am grateful that I was corrected. What that correction did was make me realize that Penguin and Unnatural Links Penalties are confusing. A lot of SEOs, myself included at the time, had a lot to learn about these issues. I made a decision that day that I would learn everything I could about algorithm changes and Google penalties. A Brief Description of Penguin, Unnatural Links and Panda Before we start answering questions, here is some fundamental information about Penguin, Unnatural Links Penalties and Panda: The Penguin Algorithm On April 24, 2012, Google announced \"Another Step to Reward High Quality Sites\", an algorithm change aimed at fighting against webspam. The algorithm change was first called \"The Webspam Algorithm\" but eventually began to go by the name of \"Penguin\". This algorithm severely affected sites that had widespread keyword stuffing and participation in link schemes. Matt Cutts, head of webspam at Google, eventually admitted on Twitter that links are \"a primary area to monitor\" when you have been affected by Penguin. What most SEOs believe is that one of the primary causes of Penguin is when sites create easily made links containing keywords as anchor text from low quality places such as article marketing sites, bookmarks and do-follow comments. Unnatural Links Penalties These penalties are manual penalties that Google can place on sites when they determine that a site is widely attempting to manipulate the search engine results by creating links. These penalties are manual as opposed to Penguin which is algorithmic. So, what causes a site to be hit with an unnatural links warning? Most webmasters believe that if someone files a spam report against you, then this will open up your site for a manual review. Some have speculated that Google monitors some of the more competitive niches such as \"payday loans\", \"car insurance\", casino sites, etc. and manually checks for unnatural links. No one knows for sure. The Panda Algorithm The Panda Algorithm was created by Google in an attempt to cause low quality sites to be displayed much lower in the search results. When Panda first hit, it was an unnamed algorithm. Many named it the \"Farmer update\" as it seemed to be aimed at content farms that ranked well as a result of scraping content from other sites. Most SEOs believe that sites affected by Panda have issues with on page quality as opposed to the quality of their links as in Penguin and Unnatural Links penalties. Sites that have been affected by Panda often have significant amounts of duplicated content (either on their own site or more commonly, from other sites) and also thin content. Thin content is usually a page that consists of very few words. If a site contains a lot of duplicate and thin content then Google sees little reason to show this site prominently in its search results. An entire site can be severely demoted because of Panda even if only parts of the site have duplicate and thin content. Now let's cover some of the points where people are the most confused about these issues. What is the difference between Penguin and an Unnatural Links Penalty? Both of these issues have to do with unnatural links. In both cases, the use of keywords as anchor text can be a factor. However, the main difference between the two is that Penguin is an algorithmic issue while Unnatural Links penalties are manual. A manual penalty is one that is levied by a human being, one site at a time. For example, a competitor could file a spam report on you which could result in a Google Webspam employee looking at your site. The employee could look at your backlinks and see that you have been engaging in practices that are considered as link schemes. As such, they may decide to levy a manual penalty on your site. Penguin is not levied one site at a time. Google has created an algorithm which is designed to programmatically find sites that have been engaging in unnatural link building tactics. When Penguin updates, if your site has been flagged as a site that is engaging in webspam, then your site will be affected on the date of the update. No human being is directly involved in determining whether your site is affected. As a point of interest, I have heard some SEOs who have done testing and believe that Penguin can affect a site on any day and not just Penguin refresh days. So far, in sites that I have seen, it seems that Penguin can only affect a site on a Penguin refresh day. The reality is that at this point no one knows for certain whether or not a site can be affected by Penguin on a date other than a Penguin refresh date. Do Penguin, Unnatural Links and Panda affect the whole site or just part of the site? Penguin: Penguin is a sitewide issue. If Google determines that your links are not trustworthy, then there is a flag put on the entire site that causes it to not rank well. Unnatural Links: A manual unnatural links penalty can affect the entire site, or just a page, or even just one keyword. Sometimes a site can be penalized and be totally removed from the Google index. Other times, the site can still be in the index but not be shown in the first 10 pages for any of its keywords. Or, sometimes the penalty will not be as severe and may only affect one or two keywords. Here is a quote from Matt Cutts regarding a site that was penalized on a keyword level: The site in this example would not be able to rank for the keywords that they had used as anchors for sites that embedded their widgets. Panda: Panda can affect an entire site, or sometimes one section such as a news blog on the site. Panda does not tend to affect just single pages of a website. If you have a site that has some good content, but a lot of thin and duplicate content, then the Panda filter can cause the entire site to have trouble ranking, not just the thin and duplicate pages. Should you file for reconsideration if you have been affected by Penguin, Unnatural Links or Panda? Penguin: No. A reconsideration request is only meant for sites that have a manual warning. If you have a manual warning then you will have a message in your WMT. (See the image next to the section above on Unnatural Links.) If you have been affected by Penguin, then, because this is an algorithmic issue, having a Google employee review the site will not help. Unnatural Links: Yes. If you have a manual warning in your WMT then once you have done the work required to clean up the site (see below) then you will need to file for reconsideration. Panda: No. See Penguin. Panda is also an algorithmic change and a reconsideration request will not help you recover. Should you be using the disavow tool if you have been affected by Penguin, Unnatural Links or Panda? On October 16, 2012, Google released the disavow tool which allowed webmasters to essentially have Google add an invisible \"nofollow\" to certain links that are pointing to their site. Since the release of this tool, there have been so many webmasters asking questions in Q&A as well as other SEO forums wondering if they should be disavowing their links. Many have become paranoid about their links and want to disavow everything that looks suspicious. I've seen people who wanted to disavow a great link because it was site-wide. I've seen others who wanted to disavow a pile of links even though they are already nofollowed links. There is a lot of confusion around the use of the disavow tool. This is probably why the disavow tool comes with this disclaimer: Penguin: Google vaguely suggests that the disavow tool could be useful for a Penguin hit site. In their blog post about the disavow tool, they say the following: \"Q: Should I create a links file as a preventative measure even if I haven’t gotten a notification about unnatural links to my site? A: If your site was affected by the Penguin algorithm update and you believe it might be because you built spammy or low-quality links to your site, you may want to look at your site's backlinks and disavow links that are the result of link schemes that violate Google's guidelines.\" Most SEOs believe that if you have been affected by Penguin then you should use the disavow tool to discount the unnatural links to your site. At the time of writing this, Penguin has not refreshed since the disavow tool was released. (The tool was released October 16th and the last Penguin refresh was October 5th.) What this means is that we do not have any proof yet as to whether or not disavowing links will help a site to recover from Penguin. Hopefully it will, but there may be other factors that need to be addressed as well such as on page issues like keyword stuffing. Unnatural Links: Yes. This is what the disavow tool was made for. Google says, in regards to a manual unnatural links penalty, \"If you’ve done as much as you can to remove the problematic links, and there are still some links you just can’t seem to get down, that’s a good time to visit our new Disavow links page.\" Panda: No. As Panda generally does not have anything to do with backlinks, disavowing links to your site is not likely to help. Do you need to manually remove links? Penguin: While removing links is probably a good idea, it is likely not necessary. Because Penguin is an algorithm, to recover you don't need to show a human being evidence that you have worked hard to remove links. Most SEOs who are experienced with Penguin issues believe that disavowing your problematic links will help and that physically removing the links is not necessary. With that being said, if the bad links are under your control and easy to remove, then it is a good idea to do so. Unnatural Links: When trying to recover from a manual unnatural links penalty, it is not enough to just disavow the bad links. Google wants to see evidence that you have tried to get as many of the unnatural links removed as possible. When you file for reconsideration, one of the first things that the webspam team member does is check a number of the links that they have flagged as unnatural and see how many of them you have gotten physically removed. For the unnatural links that you are unable to get removed because the webmaster didn't reply, or because they wanted a large sum of money or for whatever other reason, then you can disavow those links. Removing an unnatural links penalty from a site can take a lot of work. If you are struggling to remove a penalty from your site, or if you are an SEO who would like to get involved in doing penalty removal work, I have documented everything that I do in order to get penalties removed in my book (see bio section for link). Panda: No, it is not believed that any links need to be removed for sites affected by Panda. When will you recover? Penguin: Most SEOs believe that you will not be able to recover a Penguin hit site until Penguin refreshes again. Google announced at SMX West that in 2013 there would be a major Penguin update but did not say when this would happen. There are some people who believe that they have seen Penguin hit sites recover on a day other than a refresh day. There are ways to recover a Penguin hit site without waiting for a refresh. For example, if you had a \"green widgets\" page that had been affected by Penguin because you built anchor text using the phrase \"green widgets\", you could build a new page called \"buying-green-widgets\" and get new, good quality links to that page and possibly rank again for this term. The original page would not rank, but the new one could. The problem with this is that getting new good quality links is difficult. Google wants you to earn links and not make them yourself. I asked John Mueller, a Google employee about whether or not it was possible to recover a Penguin hit site outside of a Penguin refresh and here is what he said: \"+Marie Haynes theoretically, in an artificial situation where there’s only one algorithm (which is, in practice, never the case), if a site is affected by a specific algorithm, then the data for that algorithm needs to be updated before it would see changes. In practice, while some elements might be very strong depending on what was done in the past, there are always a lot of factors involved, so significantly improving the site will result in noticeable changes over time, as we recrawl & reindex the site and it’s dependencies, as well as reprocess the associated signals. So yes, you’d need to wait for the algorithm to update if it were the only thing involved, but in practice it’s never the only thing involved so you’re not limited to waiting. Also keep in mind that for long-running processes (be it algorithm updates like this, or other higher-level elements in our algorithms), it’s never a good idea to limit yourself to small, incremental improvements; waiting to see if “it’s enough” can take a while, so I’d recommend working to take a very good look at the issues you’ve run across, and working to make very significant improvements that will be more than enough (which users will appreciate as well, so there’s that win too).\" A full discussion on ways to recover from Penguin is outside of the scope of this article. Unnatural Links: Once you file for reconsideration, it will take anywhere from 3-14 days to hear back from Google. I have had it take as long as six weeks, but this was just after the disavow tool was released and Google probably had a large backlog of sites to review. If you get the wonderful \"manual spam action revoked\" message, for some sites recovery can happen in a couple of days. Depending on how severe the penalty was, it can take significantly longer such as several months. There are some sites that can have a penalty revoked but not see any increase in rankings at all. This generally happens when sites have no good links to prop the site up. If your site's backlink profile consisted of 99% self made links and you have removed or disavowed almost all of those links then you will need to get good, quality links to your site in order to rank again. Gone are the days of being able to rank well on poor quality links. Some sites can still appear to be penalized after their manual penalty is lifted if they are also under the effects of Penguin. In most cases, it is believed that the work that is done to recover from an unnatural links penalty will also get you out of Penguin trouble. However, you'll need to see a Penguin refresh in order to start ranking well again. Panda: Again, a full discussion on Panda recovery is outside of the scope of this article. Once you have done what is necessary to fix Panda issues such as duplication and thin content, then many sites will recover with the next Panda refresh. However, I have seen some sites that have taken several Panda refreshes in order to recover. As of March, 2013, Matt Cutts stated that Panda will not be doing large regular refreshes as we have been used to but instead it will now be regularly rolled into the regular algorithm. I expect that this means that Panda hit sites can recover much sooner now once the work is done. Conclusion The purpose of this article was to answer some of the regularly asked questions when it comes to differences between Penguin, Unnatural Links and Panda issues. I don't claim to have all of the answers though. I hope this article generates some good discussion and questions! Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Difference Between Penguin and an Unnatural Links Penalty (and some info on Panda too)"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Difference Between Penguin and an Unnatural Links Penalty (and some info on Panda too)"
    },
    {
      "level": "H3",
      "text": "A confession - I messed up too."
    },
    {
      "level": "H2",
      "text": "A Brief Description of Penguin, Unnatural Links and Panda"
    },
    {
      "level": "H3",
      "text": "The Penguin Algorithm"
    },
    {
      "level": "H3",
      "text": "Unnatural Links Penalties"
    },
    {
      "level": "H3",
      "text": "The Panda Algorithm"
    },
    {
      "level": "H2",
      "text": "What is the difference between Penguin and an Unnatural Links Penalty?"
    },
    {
      "level": "H3",
      "text": "Do Penguin, Unnatural Links and Panda affect the whole site or just part of the site?"
    },
    {
      "level": "H3",
      "text": "Should you file for reconsideration if you have been affected by Penguin, Unnatural Links or Panda?"
    },
    {
      "level": "H3",
      "text": "Should you be using the disavow tool if you have been affected by Penguin, Unnatural Links or Panda?"
    },
    {
      "level": "H3",
      "text": "Do you need to manually remove links?"
    },
    {
      "level": "H3",
      "text": "When will you recover?"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "Boost Your SEO with Link Explorer"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "How to Easily Find Backlink Opportunities With Moz — Next Level"
    },
    {
      "level": "H3",
      "text": "How I Develop Successful Link Building Strategies for My Clients"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Marie Haynes\n          \n            Marie Haynes\n          \n            Marie Haynes"
}