{
  "url": "https://moz.com/blog/the-perks-of-popularity",
  "slug": "the-perks-of-popularity",
  "title": "The Perks of Popularity - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "In high school popularity can seem vitally important. The attention, the parties, the good life. With the benefit of hindsight and a few years of maturity, I've realized even the popular kids (I wasn't one of them) had other issues to deal with -- homework, parents, etc. In other words, it was only…",
  "content": "The Perks of Popularity Content Marketing M By: Meredith O'Neil April 23, 2010 This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Table of Contents Copied! M By: Meredith O'Neil April 23, 2010 The Perks of Popularity Content Marketing This YouMoz entry was submitted by one of our community members. The author’s views are entirely their own (excluding an unlikely case of hypnosis) and may not reflect the views of Moz. Popularity comes in many forms In high school popularity can seem vitally important. The attention, the parties, the good life. With the benefit of hindsight and a few years of maturity, I've realized even the popular kids (I wasn't one of them) had other issues to deal with -- homework, parents, etc. In other words, it was only one part of the equation. The same is true on the world wide web. Of course, on the internet, popularity is measurable and can have a significant impact on your website. I run an e-commerce site, BuyAceHardware.com. As an Ace Hardware retailer, we have access to the titles, descriptions and images in the Ace catalog. It's wonderful content. But there's one problem. It's shared by all the other retailers, including three e-commerce sites. Ugh! Duplicate content. I'm working on it, but with 10,000 items and one person, it's going to take a while. But that's for the products already up. As I add new items, the king -- content -- is leading the way. That's where popularity popped up and showed its power. I added the Dyson DC25 Animal Vacuum to the site about three weeks ago. It and all the other vacuum product pages had original content with original content on the section page. All the vacuums were marked with very attractive prices compared to other listings on the web. Here's where it got interesting. At the moment, BuyAceHardware gets most of its traffic and sales through Google shopping. Being one of the lowest prices, the Dyson really got some attention -- it was popular. The clicks started rolling in and many of those visitors turned into customers. This is excellent news, but it got better. Now, just a few short weeks later, our analytics show \"Dyson DC25 Animal Vacuum\" (and a few variations) as keyords leading people to our homepage. In addition, the Dyson page has been indexed by Google. Another rapid occurance, in my experience. We seem to have a few things working in tandem. The low price of the Dyson certainly was the catalyst. That drew the customers to the page, resulting in popularity. It also resulted in some wonderful conversions. The popularity, in tandem with the original content, became an asset because Google took notice. Low prices = user interest. User interest = popularity. Popularity = more exposure. More exposure = more user interest. The beloved Dyson now has a prominent spot on the homepage with more original content, including keyword links. I'm hoping to build on the perks of popularity. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Perks of Popularity"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Perks of Popularity"
    },
    {
      "level": "H2",
      "text": "With Moz Pro, you have the tools you need to get SEO right — all in one place."
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H3",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Meredith O'Neil\n          \n            Meredith O'Neil\n          \n            Meredith O'Neil"
}