{
  "url": "https://moz.com/blog/the-incredible-shrinking-serp",
  "slug": "the-incredible-shrinking-serp",
  "title": "The Incredible Shrinking SERP - 2015 Edition - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "First, there were 10 results, then sometimes 7, and now as few as 4. In the past year, Google has changed the page-1 landscape entirely, and we barely noticed.",
  "content": "The Incredible Shrinking SERP - 2015 Edition Advanced SEO | Search Engines By: Dr. Peter J. Meyers April 9, 2015 Table of Contents Copied! By: Dr. Peter J. Meyers April 9, 2015 The Incredible Shrinking SERP - 2015 Edition Advanced SEO | Search Engines In the beginning, there were 10 results, and it was good. Then, came expanded site-links and Google's 7-result SERP. Around the middle of 2014, we started to hear reports of SERPs with odd numbers of organic results – 9, 8, 6, 5, and even 4 page-1 results. At first, these were sporadic and hard to replicate, but they quietly expanded. This is a recent 4-result SERP for \"autism speaks\": By some counts, there are as many as 16 non-paid links on this page (not counting images), but by traditional SEO standards, there are only 4 true organic positions for which you can compete. So, what's going on here? Is it just random, or is there a method to Google's madness?It's all in the news For a couple of months, I just assumed these strange result counts were some kind of glitch. Then I noticed an unusual pattern. Last October, Google rolled out the \"In The News\" Update. This update expanded news results to many new sources, but it also seemed to change the pattern of when news results appear. This is 28 days of data from MozCast's Feature Graph (10K queries): The presence of News results seemed to be cyclical, dipping early in the week and peaking later in the week. I don't follow News results closely, so it was just a curiosity at first, until I saw another bit of data. This is the average page-1 result count for that same period: While the scale of the change was much smaller (please note that both graphs have a restricted Y-axis to make the effect more visible), the opposing shapes of the curves seemed like more than a coincidence. As News results increased, the average page-1 organic result count decreased.It's a vertical, vertical world Spot-checking various SERPs, I was able to confirm this effect. If page 1 had a News box, then the organic result count would be decreased by one (to either 9 results or 6, depending on the starting point). Here's a sample SERP (I've removed snippets to simplify the image) for \"samsung galaxy tab\": This is a basic 10-result SERP, but when a News box comes into play, we're only left with 9 organic results. This raised the question – were other verticals having a similar impact? Digging deeper, I found that, in addition to News results, Image results and In-depth Articles also occupied one organic position. Remember the example at the top of the post? It's a brand query, resulting in a 7-result SERP, but it also has News results, Image results, and In-depth Articles. If we do the math: 7 - 1 - 1 - 1 = 4 results. It's not random at all. In the interest of being more methodical, what if we looked at the average page-1 organic result across every combination of verticals in our data set? We'll stick with a starting point of 10 results, to keep the data clean. Here's a table with the average counts by vertical combination: I've taken the average out to two decimal places just to be more transparent, but what we're seeing here is little more than a tiny bit of measurement error. Generally speaking, each instance of a vertical result type (as a whole, not individual links within these verticals) costs a 10-result SERP one organic ranking position. It's worth nothing that SERPs with all 3 verticals are pretty rare, but when they occur, each of those 3 verticals costs one position and one opportunity for you to rank on page 1.It's always something So, do the same rules apply to 7-result SERPs? Well, Google isn't a big fan of making my life easy, so it turns out this gets a bit more complicated. When 7-result SERPs originally launched, our data showed that they almost always came with expanded sitelinks in the #1 organic position. By \"expanded sitelinks\", I mean something like the following: Sitelinks usually appear for queries that either have a strong brand connotation or at least a dominant interpretation. While we typically use 6-packs of expanded sitelinks as an example, actual counts can vary from 1 to 6. Originally, the presence of any sitelinks yielded a 7-result SERP. Now, it's gotten a bit more complicated, as shown by the table below: Since each row of sitelinks can contain up to 2 links, the general logic seems to be that 1 row of sitelinks equates to 1 additional organic result. If you have 3 rows of sitelinks, then Google will remove 3 organic results from page 1. Google's logic here seems to revolve around the actual display of information and length of the page. As they add some elements, they're going to subtract others. Since the physical display length of of most elements can vary quite a bit, the rules right now are pretty simplistic, but the core logic seems to be based on constraining the total number of results displayed on page 1. It's time to rethink organic All of this raises a difficult question – what is an organic result? As SEOs, we typically don't think of vertical results as \"organic\" by our fairly narrow definition, but they're much more organic than paid results or even Knowledge Graph. What's more, Google is starting to blur the lines with verticals. For example, in the past couple of weeks, Google has redesigned the look of In-depth Articles twice. You might think \"So what? It's just a design change,\" but take a closer look. At the end of March, Googled removed the \"In-depth articles\" header. Here's an example of the new design (for the query \"jobs\"): While the thumbnail images and horizontal dividers still set these results apart somewhat, Google's intent seems to be to make them appear more organic. Keep in mind, too, that other, organic results use thumbnails as well (including videos and recipes). Then, just a couple of weeks later (our systems detected this on the morning of April 8th), Google went much farther, removing the thumbnails and even the byline. Here's part of a screenshot for \"Putin\": Can you spot the true organic results here? They're the first two – the rest of this screenshot is In-depth Articles. The only real clue, beside the count and source-code markers, is the horizontal divider on either end of the 3-pack. On mobile, even the dividers are gone, as every result is treated like a \"card\" (see below). As an SEO, I'm still inclined to call these results \"vertical\" for two reasons: (1) historical precedent, and (2) these results play by different ranking rules. I think reason #2 is the more important one – In-depth Articles are currently dominated by a core set of big publishers, and the algorithm differs quite a bit from regular, organic results.It's only the beginning... You wanna get really crazy? Let's look at an entire SERP for \"polar\" on an Android device (Moto G). This result also includes In-depth Articles (warning: scrolling ahead): Let's do the math. For starters, it's a branded result with expanded sitelinks, so we should have a 7-result page. Remember that those last 3 results are In-depth Articles, so we'll subtract 1, leaving us with what should be 6 results. See the \"app pack\" in the middle? That's an Android-specific vertical, and instead of counting the pack as just 1 result, Google is counting each link as a result. So, we're only left with 3 traditional organic results on this SERP, despite it being packed with information. I strongly suspect this trend will continue, and it will probably expand. The definition of \"organic\" is blurring, and I think that all of these vertical results represent SEO opportunities that can't be ignored. If we're stuck in the mindset of only one \"true\" organic, then our opportunities are going to keep shrinking every day. Copied! Back to Top",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "The Incredible Shrinking SERP - 2015 Edition"
    },
    {
      "level": "H3",
      "text": "Table of Contents"
    },
    {
      "level": "H1",
      "text": "The Incredible Shrinking SERP - 2015 Edition"
    },
    {
      "level": "H2",
      "text": "It's all in the news"
    },
    {
      "level": "H2",
      "text": "It's a vertical, vertical world"
    },
    {
      "level": "H2",
      "text": "It's always something"
    },
    {
      "level": "H2",
      "text": "It's time to rethink organic"
    },
    {
      "level": "H2",
      "text": "It's only the beginning..."
    },
    {
      "level": "H2",
      "text": "Make smarter decisions with Moz API"
    },
    {
      "level": "H2",
      "text": "Read Next"
    },
    {
      "level": "H3",
      "text": "How I Found Internal Linking Opportunities With Vector Embeddings"
    },
    {
      "level": "H3",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H3",
      "text": "How to Optimize for Google's Featured Snippets [Updated for 2024]"
    },
    {
      "level": "H2",
      "text": "Comments"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}